[
  {
    "rating": "4/5",
    "review": "Best under the radar star wars movie out there....Great writing...great lighting....great attention to detail...great story arch...great acting.....just amazing and how a star wars movie should be."
  },
  {
    "rating": "4.5/5",
    "review": "Not as good as Clone Wars but great nonetheless ."
  },
  {
    "rating": "4.5/5",
    "review": "Easily the best Star Wars movie released under Disney's rule. With beautiful visuals in the best cgi in a Disney Star Wars project, this is an easy recommendation to any Star Wars enjoyer. With the recent release of Andor, the story is even more hopeful and simultaneously heartbreaking. I wish passion projects like this and Andor were more common for Star Wars."
  },
  {
    "rating": "1.5/5",
    "review": "The beginning of the end for Star Wars, with a classic « girl boss » vibe"
  },
  {
    "rating": "5/5",
    "review": "One of the best Star Wars spin offs... if not the best."
  },
  {
    "rating": "5/5",
    "review": "Before Andor, everyone I've known or have only ever barely met have all agreed that Rouge One is one of, if not The best Star Wars movie ever made This is one where, even if you or someone you know doesn't like Star Wars - it can change that May the force be with us all"
  },
  {
    "rating": "4.5/5",
    "review": "Though plagued and hunted by re-shoots and re-writes, this movie pulls off an intelligent, well rounded, beautiful, exciting, and heart breaking Star Wars movie. The thing that makes this extraordinary, is that it's a prequel, and one that is somehow after many many years, is perfectly connected into Star Wars Ep IV. This is pulled of thanks to a great combination of writing, acting, excellent special effects and sound. After watching Star Wars Ep IV is never the same. The prequel makes Star Wars Ep IV better, and that's so impressive. They say lightning never strikes twice, but now it has with the Andor TV show, which now makes watching Rogue One even better, deeper, and more incredible. I always thought that Rogue One was probably my favourite Star Wars movie... and now I'm sure of it. The new trilogy is Andor+Rogue One+ Star Wars Ep IV. Bravo."
  },
  {
    "rating": "4/5",
    "review": "Less depth then Andor. Best Star Wars movie yet. Everyone dies, fighting for sunrise they know they'll never see."
  },
  {
    "rating": "5/5",
    "review": "This movie was already fantastic, but Andor manages to elevate the movie!"
  },
  {
    "rating": "4/5",
    "review": "**Rogue One – 4 Stars** As a huge Star Wars nerd, *Rogue One* had me hooked from day one. I remember watching it in theaters, jaw dropped. After binging *Andor*, it only made sense to revisit this gem. The cast? Spot on. The atmosphere and worldbuilding scream classic Star Wars but with a grittier, grounded vibe that just works. Seeing the Death Star’s power firsthand while still planet-side? Absolutely intense and terrifying in the best way. Ben Mendelsohn as Krennic nails it as a smug yet desperate villain, but let’s be honest—Darth Vader steals the show. That hallway scene? *Chef’s kiss*. He’s never looked more menacing. The cinematography is top-notch, making this feel like a proper war movie in space. This is exactly how you expand the universe: new stories that respect the old while pushing things forward. *Rogue One* bridges perfectly into *A New Hope*. Loved it."
  },
  {
    "rating": "5/5",
    "review": "Best piece of star wars media ever created."
  },
  {
    "rating": "5/5",
    "review": "Fantastic peace of cinema in the Star Wars universe. The story and world building is very good and to be able to see other sides and characters and their backgrounds is very interesting. Good action with stunning visuals"
  },
  {
    "rating": "5/5",
    "review": "Incredible. Great characters, story, and cinematography. Light years ahead of the other Star Wars media produced by Disney."
  },
  {
    "rating": "1.5/5",
    "review": "Rewatch after Andor and maaaan this is so bad compared to that brilliant series. The dialogue is horrible, the CGI is horrible (animated Grand Moff looked terrible), the story is so inconsistent, the main character has no personality. If not for Cassian and the background we have on him now, that whole movie would be a complete pass for me"
  },
  {
    "rating": "4.5/5",
    "review": "\"Rogue One: A Star Wars Story\" is a dramatic and thrilling entry in the Star Wars universe that stands out as a unique and powerful bridge into one of the greatest trilogies of all time. With strong performances and gripping action, the film delivers a well-crafted narrative centered on sacrifice, hope, and the cost of freedom. Unlike many other entries in the saga, Rogue One has the strength to stand on its own, offering a rich and transformative story that deepens the meaning of the rebellion and what it truly means to fight for something greater than yourself."
  },
  {
    "rating": "3/5",
    "review": "It gives a decent backstory to a new hope, but it has some nonsensical and frustrating moments that take away from the story."
  },
  {
    "rating": "4.5/5",
    "review": "Really fascinating Star Wars story and one of the best climax ever of star wars films ever."
  },
  {
    "rating": "4/5",
    "review": "My favorite star wars movie I think, at least in my top 3"
  },
  {
    "rating": "5/5",
    "review": "I grew up a Star Wars nerd...so this is written as both a fan and as a filmmaker, writer, and story teller. So maybe my film knowledge will balance out the fandom. I've always wanted to see a more raw, grounded, gritty Star Wars film not built for kids, but built to make a fictional universe truly alive. Rogue One nails that. So regardless of critics and reviews, there is one pure element that can't be denied. Rogue One is the closest Star Wars has ever gotten to feeling like a tangible, living, existing thing. It's a natural fan evolution: from a kid that likes laser swords, to an adult that realizes laser swords could exist. To echo our own society and culture, this is Star Wars keeping it real. The story fills previous lore gaps when it comes to the Death Star, much of the rebel workings, and how the Death Star was so easily destroyed. This alone, makes the original Star Wars film richer and stronger. It also features no Jedi but manages to make The Force still important. It features a droid - quite the opposite of the typical cliche - that keeps the connection of flesh and metal intact. And while Darth Vader is a legend...this is the first film after his transition that truly shows how deadly, cold, capable, and legendary he is. That alone is worth 4 stars out of 5 to me. The uninitiated might not understand that and should educate themselves before they give a low score. His five minutes to the knowledgeable fan make the film at least 3 to 4 stars. The use of old unused footage to tie it to the original Star Wars is pure genius as well and the third act action delivers like Postmates. Chris Weltz and Tony Gilroy did a hell of a job writing it, and Gareth Edwards killed it. The dialogue, feel, and texture of the film, for me, was something I dreamed of but didn't think was possible. They even brought in space martial arts, which alone, should garner the film an additional star. And they didn't need a Jedi to save the film, or make it flounder like the \"forced\" (pun intended) sequel trilogy. This is the rawest Star Wars film you're ever going to get. Most-likely...EVER No agendas except handling the mission for the people. Add a star for that. The Andor series by Gilroy, and with the same aesthetic and exploration of both Star Wars realism and choosing to dive deeper, has received the most acclaim out of ANY Star Wars project since. There's a reason for that. That also should earn a star. ...and yes, the CGI Tarkin and Leia isn't perfect. But that can be fixed in the future. What should impress you, is that the filmmakers felt them necessary to tell the proper story so they did what they had to do. If you're looking at Rogue One holistically...in terms of story, aesthetic, acting, writing, directing, cinematography, production, closing up old story holes, making Stars Wars more grounded and realistic, innovating, elevating, making a funny robot also a killing machine, giving the best Darth Vader moment ever...and everybody dies?!?! And if after all of that, it's not at least four stars out of five? The Force isn't with you. And that's okay. I'd recommend starting with The Last Jedi. That will probably be your cup of tea."
  },
  {
    "rating": "5/5",
    "review": "One of the best in the Star Wars franchise, only enhanced with both seasons of Andor. The negative 'professional' critics are clearly not fans of genre, which isn't for everyone. Rogue One stands out amongst all the 21st century Star Wars cinema"
  },
  {
    "rating": "4.5/5",
    "review": "The best film of the series since the first trilogy. Mature, well built and acted. Few minor oddity in the story development I would have avoided but all in all excellent work."
  },
  {
    "rating": "5/5",
    "review": "best thing disney has ever put out. gave me hope but then they killed that hope, because disney being well, disney."
  },
  {
    "rating": "5/5",
    "review": "One of the best modern Star Wars films. Highly recommend watching this one"
  },
  {
    "rating": "4/5",
    "review": "My chronological rewatch of the films continues, and watching them this way really highlights what a good film this is - in terms of the timeline, the first film that feels coherent and, well, good. A fine cast is well directed by Gareth Edwards, who has a flair for science fiction action adventure and an eye for a striking image. It has wit, energy, focus, good humour, spectacle, and fun. There's an argument that the Star Wars films are mostly aimed at younger audiences; if that's true, then this film may be seen to stray from that. But I'd like to think younger audiences will also appreciate this for what it is - a well-constructed war adventure with sleek narrative lines and a smattering of all the important constituent parts along the way. Think how much this film's timeline predecessors would be appreciated if the care that characterises Rogue One had been taken on them."
  },
  {
    "rating": "4.5/5",
    "review": "Initially I didnt think it was that great. But, compared to the other Disney starwars, it's freaking citizen kane"
  },
  {
    "rating": "5/5",
    "review": "Easily in my Top 5 favorite Star Wars films"
  },
  {
    "rating": "5/5",
    "review": "Disney’s best cinematic entry to the Star Wars franchise. Remaining faithful and providing homage to the original 1977 film, this not only provided great and beautifully filmed action sequences but also meticulous attention to detail and actually tied up a couple of major loose ends presented in the original."
  },
  {
    "rating": "5/5",
    "review": "With a lot of likeable characters, great storytelling, and epic war scenes, this is to my opinion the best Star Wars movie, so far, since the original trilogy. I especially loved the android which adds another great character to the non-humans in Star Wars. The only regret is, that all the main characters have to die. But that's something we know from the beginning of the movie. And, they all really do it with dignity, and it makes us think that to give your life to save others is really a great cause, and an act of heroism. So, at the end of the day, this movie is really enjoyable from start to finish."
  },
  {
    "rating": "5/5",
    "review": "Well done! Lots of fanfare and building on so much lore. Amazing!"
  },
  {
    "rating": "4.5/5",
    "review": "Easily the best Disney produced Star Wars film. The last 45 minutes are some of the best minutes in all of Star Wars. Shots of death star, Leia, Tarkin, Vader, sacrifices by the characters, action, from start to finish a really great movie. Some characters kind of thrown in there, but all in all a fantastic film."
  },
  {
    "rating": "4.5/5",
    "review": "There are still two Star Wars movies I haven't seen yet of the eleven that exist at this point, and Rogue One is top three in my book. It's not a perfect film, but it hums along like a well-oiled machine. It's exciting and well-written (for a Star Wars film) (hey - the dialogue doesn't make me cringe!) and it adds a lot to A New Hope. Very enjoyable component of the Star Wars saga."
  },
  {
    "rating": "4.5/5",
    "review": "Gripping with fantastic special effects, casting and acting. Sooo good it restored my faith in humanity after watching the previous terrible Disney Star Wars movies."
  },
  {
    "rating": "5/5",
    "review": "Like so many others, I grew up on the original trilogy (IV-VI). Pre- Hayden Christensen Anakin, pre- special edition. They are the movies that created the world and sucked millions (billions?) into it. That said, after many re-watches of all 11 movies, I’ve concluded that the final 40 minutes of Rogue One is the absolute best of Star Wars. It feels like a successful marriage of the optimism and excitement of A New Hope, the drama of The Empire Strikes Back, the desperation and triumph of Return Of the Jedi, the storytelling of the prequels, the nostalgia of Solo, and the visuals of the Disney trilogy. A phenomenal cast, authentic heroes/heroines and villains, and the ability to capture the spirit of Star Wars WITHOUT A SINGLE JEDI is magnificent. It’s all there, and the final moments include an incredible showcase of the true terror of Darth Vader seen in no other movie, concluded by a masterful hand-off of the story to Episode IV that cries perfection."
  },
  {
    "rating": "4.5/5",
    "review": "The best \"Disney\" era Star Wars film released...so far."
  },
  {
    "rating": "5/5",
    "review": "Really great movie! It really felt authentic and true to the source material! Some things were a little miss but all in all it was great."
  },
  {
    "rating": "5/5",
    "review": "This is hands down the best Disney Star Wars film. Too bad they did such a terrible job on the other movies."
  },
  {
    "rating": "5/5",
    "review": "This movie was great! The action was amazing and the visuals were incredible, and the added menace of Darth Vader made the movie so much better. I definitely recommend it!"
  },
  {
    "rating": "5/5",
    "review": "Probably the best in the series!"
  },
  {
    "rating": "5/5",
    "review": "Of all the post Episode VI films, this was def best of them. It’s entertaining and meaningful. There was so much to like about it and even though you know how it all ends because it’s a prequel you really do care about the characters and the outcome anyway."
  },
  {
    "rating": "5/5",
    "review": "Love this movie! Lot of good Star Wars and ending was great"
  },
  {
    "rating": "2.5/5",
    "review": "Overrated. The suicide squad of star wars, but better."
  },
  {
    "rating": "4/5",
    "review": "Great movie, just a bit much drama. Every moment was made to feel very heavy and significant, where I like that there were a lot of \"significant\" moments."
  },
  {
    "rating": "4.5/5",
    "review": "Good disney movie who would have thought disney would have been this good to fall so far so fast with star wars. Good lead female, interesting droids, plot line, character arcs, ties into original trilogy without contracting it."
  },
  {
    "rating": "4.5/5",
    "review": "The best Disney star wars movie in my opinion great movie filling the gap between movie 3 and 4 the Vader hallway scene is peak cinema I love this movie I would rate it 97%"
  },
  {
    "rating": "5/5",
    "review": "This and Andor are the best Disney Star Wars."
  },
  {
    "rating": "4/5",
    "review": "The only worthy addition to the franchise post Disney intervention. Wonderfully directed by Edwards and great performances throughout."
  },
  {
    "rating": "4/5",
    "review": "Compared to all the other new Star Wars aimed at destruction of the original trilogy, this stand-alone movie is deserving and entertaining. The best Star Wars movie since 1983."
  },
  {
    "rating": "3.5/5",
    "review": "The best Disney star wars movie and Its worth a watch"
  },
  {
    "rating": "5/5",
    "review": "The best of the Disney Star Wars Era"
  },
  {
    "rating": "5/5",
    "review": "Rogue One is the kind of film that only gets better each time you watch it. At once a mesmerizing war film and a terrific 101 on how terrible the Empire has become, Rogue One also features one of the greatest scenes in all of film while resurrecting the villainy of Darth Vader that had significantly faded after the release of Revenge of the Sith. Forget all the reshoots and rumors of a complicated shoot, the result elevates it to one of the best of the series."
  },
  {
    "rating": "4.5/5",
    "review": "Compared to Episodes 7-9, I find this film much more enjoyable. There are certainly some of the segments and characters that I want to see more. The trailer and eventually the film had some disconnect. Apart from that, can't really say any bad thing about it. K2SO dialogue was brilliant. The film was exciting to watch. Probably want to learn more stories about those characters played by the Asian actors. One probably weird plot point was about the temple guard. Is he like the daredevil in Star Wars? What's that story about?"
  },
  {
    "rating": "5/5",
    "review": "Loved the actress. She and the K2SO Droid made the show!"
  },
  {
    "rating": "5/5",
    "review": "Best star wars move so far."
  },
  {
    "rating": "5/5",
    "review": "Peak Star Wars and best entry to the franchise since the original trilogy. Must see!"
  },
  {
    "rating": "4.5/5",
    "review": "Better than any of the main line Disney Star Wars movies, which doesn't say much but hey."
  },
  {
    "rating": "5/5",
    "review": "This is the best Star Wars movie since the original trilogy, 50 years ago."
  },
  {
    "rating": "2/5",
    "review": "I didn't need this story, I already know what happened leading up to episode IV, and the characters suck. The blind guy is stupid and annoying, Andor is one of the dumbest characters I've seen, the girl is the best and I still don't care for her. Nobody wanted or asked for this, pointless and boring."
  },
  {
    "rating": "4/5",
    "review": "La historia está bien contada el es algo trágico inesperado final"
  },
  {
    "rating": "5/5",
    "review": "Great Star Wars Movie! Loves It!"
  },
  {
    "rating": "5/5",
    "review": "Superbly executed and immensely entertaining movie. I thought this was one of the best standalone prequels I have seen in a long time. The story, characters, scenes, and dialogue were all fantastic and compelling. Loved it."
  },
  {
    "rating": "2.5/5",
    "review": "This felt like a love note to the fans and is a fine addition to the franchise."
  },
  {
    "rating": "5/5",
    "review": "An amazing prequel to A New Hope which perfectly shows the empire in a way we hadn't seen until this released."
  },
  {
    "rating": "4.5/5",
    "review": "Best Star Wars movie that Disney has ever done. Excellent casting, script, and it’s actually a Star Wars movie. Plus, it has the Vader scene that we have all been waiting for! Should have signed the director to do a Trilogy."
  },
  {
    "rating": "4/5",
    "review": "A breath of fresh air, this movie is a must watch among sequels, unworthy of their name."
  },
  {
    "rating": "3/5",
    "review": "It's okay, but in no way or shape good. My biggest problem are the plot holes and the pacing. Many decisions by characters make no sense, even less by military commanders. And the characters don't develop any depth or motivation at all"
  },
  {
    "rating": "5/5",
    "review": "A perfect balance of story-telling, nostalgia, action, drama, and a little comedy sprinkled in. Similar to the other best Star Wars film (Empire Strikes Back), Rogue One doesn’t hold punches. This darker, more mature style needs to be the way forward for future Star Wars films. I only wish it was longer."
  },
  {
    "rating": "5/5",
    "review": "Great action and great characters on one of the coolest planets in star wars. This is a fantasic addition to the star wars universe"
  },
  {
    "rating": "5/5",
    "review": "This is pretty much as good as it gets when it comes to Star Wars."
  },
  {
    "rating": "4/5",
    "review": "The best of the Star wars movies. It beautifully shows how only a couple commoners changed star wars history. Not much wrong with it. It does a great job at setting up a new hope. I would give it an 86%"
  },
  {
    "rating": "5/5",
    "review": "Rogue One, the only and last good work of Disney's Star Wars. R.I.P STAR WARS."
  },
  {
    "rating": "3/5",
    "review": "Dont hate me for this but i kinda felt bored watching this"
  },
  {
    "rating": "4.5/5",
    "review": "The best Star Wars movie since the original trilogy"
  },
  {
    "rating": "5/5",
    "review": "This film does a great job to lead a viewer into Star Wars IV. It can definitely be argued as one of the best films that Disney has produced and the only great Star Wars film made by Disney."
  },
  {
    "rating": "3.5/5",
    "review": "Good Star Wars movie. Great prequel for a new hope."
  },
  {
    "rating": "4.5/5",
    "review": "This is a great movie! Best of all of the Disney Star Wars movies by far. This movies so good only few of the movies achieved the greatness that this one did."
  },
  {
    "rating": "5/5",
    "review": "Everything the prequels should have been and much more than just that. Brilliant!"
  },
  {
    "rating": "5/5",
    "review": "The dirty dozen meets the Star Wars universe. I needed the movie at the time I saw it first in theaters, and inspiring hope is where some of the best humanity has resides."
  },
  {
    "rating": "5/5",
    "review": "Best Star wars movie since Revenge of the sith. Makes the new trilogy look like garbage..."
  },
  {
    "rating": "5/5",
    "review": "Star Wars Rouge One is an outstanding film in every aspect… perfect origin story for Star Wars New Hope. Excellent addition to Star Wars enduring cultural phenomenon."
  },
  {
    "rating": "4.5/5",
    "review": "This is an spinoff set right before episode IV. The best Star Wars movie made by Disney (not to say the only good one) by far."
  },
  {
    "rating": "3.5/5",
    "review": "Direção: Bom Atuação: Ok Roteiro: Ok Caracterização: Bom Soundtrack: Ok"
  },
  {
    "rating": "5/5",
    "review": "Sad and embarassing that this is the only good Star Wars movie Disney made.."
  },
  {
    "rating": "5/5",
    "review": "The only good Star Wars movie made by Disney."
  },
  {
    "rating": "5/5",
    "review": "Best star wars film. Disney made and still has the right ending."
  },
  {
    "rating": "5/5",
    "review": "By far the best Star Wars movie made. If you know you know. Fantastic acting and story and characters. If only they could make them like this again."
  },
  {
    "rating": "4/5",
    "review": "The entire movie was very well put together from beginning to the awesome ending. Easily the best StarWars Disney has put out which isn’t saying much but Rogue One was fantastic."
  },
  {
    "rating": "5/5",
    "review": "Besto Pelicula de Star Wars"
  },
  {
    "rating": "1/5",
    "review": "Ok so I’m no fan of the franchise at all, however, this one was supposed to be a cut above more recent attempts. In reality it is abysmal. The plot was so serious must have been written by an AI bot. Not just any bot but an insanely cheap and lazy bot. It is ridiculously simplistic and dreary. The sets and costumes often look cheap. As for the acting? Jeez. It’s so lacking emotional connection and basic competence that it often painful to watch. Almost everyone is sub par but the lead actress in particular was woefully unconvincing. It almost feel parodically bad and yet you can always trust the Star Wars brigade to suspend all credibility and just praise whatever trash gets turned out. This very very bad. Watched in DVD."
  },
  {
    "rating": "1.5/5",
    "review": "never really liked star wars"
  },
  {
    "rating": "4.5/5",
    "review": "Rogue One is up there on my favorites list! Good humor, wonderful story. It falls perfectly into the timeline! I recommend this to anyone and everyone!"
  },
  {
    "rating": "4/5",
    "review": "Among all the movies I’ve seen, \"Rogue One\" stands out as one of my favorites. As a fan of the Star Wars universe, this installment offers me an authentic and exciting experience. The film features stunning landscapes, and the cinematography is one of its great strengths. Each frame is designed to immerse us in the distant galaxy we love so much. The special effects are outstanding, contributing to the spectacle of the action scenes. The story keeps you glued to the screen, as it connects episodes III and IV in a smart way, even though it’s a standalone film. It’s not strictly necessary to watch it to understand the saga, but it’s definitely an excellent gateway for those looking to dive deeper into Star Wars lore. One of the best parts of the movie is the third act, which is full of suspense, action, and both aerial and ground battles. However, while I enjoyed the story, I have to mention that the development of the main character didn’t entirely convince me; there were aspects of her story that felt a bit too convenient. Speaking of the story, I really liked the performances of the leads. Among them, my favorite is Diego Luna, who plays a Rebel spy. His character development is one of the highlights of the story. K-2SO, the reprogrammed Imperial droid, also shines; he gained personality as a side effect of his reprogramming and is a sarcastic character who made me laugh out loud more than once. Jyn Erso, the protagonist, also has a memorable story, although there are a couple of things that didn’t convince me, such as her joining the Rebellion, which felt too easy or convenient for the plot. Still, her development is generally acceptable. As for the other three members of the squad, they don’t appear much on screen and seemed a bit forgettable; I’d almost say they were included just to support the continuation of the story. Despite this, \"Rogue One\" is a film that I definitely recommend to any Star Wars fan. It offers an exciting and visually impactful experience that you won’t want to miss."
  },
  {
    "rating": "3/5",
    "review": "Está bien, pero pocp carismáticos los personajes y faltó guión para las escenas de acción."
  },
  {
    "rating": "4/5",
    "review": "Rogue One is a surprise diamond in the rough. Though the film lacks the flair (minimal lightsabers) and wit (barely any humor) of other Star Wars films, it fits the narrative being told. The cinematography is Rogue One is crisp and the dialogue is generally pretty good. The tone is serious and the characters fully embrace the severity of the situation. There are duller moments, particularly in the first two acts, but the story comes full circle in the end. I've said it before and I'll say it again, Star Wars knows how to execute killer third acts. The finale of this film is no different, and might be the best climax in the franchise other than RoTS. Everything that happens after the shield opens on Scarif is anxiety inducing. Though we have a short time to develop relationships with these characters, the connections are strong as we watch their fight for hope. Rogue One is one of those movies that did not need to be made, but I am glad that it was. I try to stray away from using the word \"perfect\" in these reviews, but this film is the perfect segue into the original trilogy. Best Character: Cassian Andor Best Moment: The Vader slaughter. Best Quote: \"It's not a problem if you don't look up.\" That was Jyn's response when asked about the Empire's rule and the Imperial flag flying. This single line adds needed depth and understanding to her character."
  },
  {
    "rating": "4.5/5",
    "review": "The best Star Wars film in terms of visuals, this movie was beautiful. I loved the characters, and the way it gave time to looks at planets weve never seen before. I loved seeing this in theaters."
  },
  {
    "rating": "1.5/5",
    "review": "Completely un-engaging. Zips from planet to planet, uninteresting character to uninteresting character... like the main girl boss character that differs from other girl boss characters about as much as one slice of white bread differs from the next. No development, no character arc, because of course she's flawless and better than any male at everything from the start. This is just a typical, lifeless, stock, modern, action movie with the additional offense of taking a crap on Star Wars, just like all the Disney attempts (and fails). Really, Star Wars should have been left in the 70s/80s."
  },
  {
    "rating": "5/5",
    "review": "The only good SW movie Disney made"
  },
  {
    "rating": "2.5/5",
    "review": "I wouldn't call this a good movie, but probably the best of the Disney Era films. Had a lot of potential at least..."
  },
  {
    "rating": "5/5",
    "review": "Probably the best Star Wars movie from the Disney era. Unique while respective of the originals. Loved the story too but the action sequences and special effects were top notch"
  },
  {
    "rating": "3/5",
    "review": "Has great potential but it fell short of my expectations"
  },
  {
    "rating": "5/5",
    "review": "Así deberían ser las películas de Star Wars, no sus tonterías de los episodios VII VIII IX"
  },
  {
    "rating": "2.5/5",
    "review": "While one of my favorite star wars movies, and if I were take my fanboy cap off, I'd have to admit that it does not feel tonally like star wars. There's no joy in it. It's not for mass consumption like the original trilogy was. It's adult star wars. And that's also the the problem with the andor series which leads up to this movie."
  },
  {
    "rating": "4.5/5",
    "review": "Easily the best of the Disney Era Star Wars movies. While the basic premise is nothing but a filler to what some consider to be a plot hole it is a great movie and proof that Star Wars is still a profitable IP when handled with care and respect."
  },
  {
    "rating": "4.5/5",
    "review": "A flawed masterpiece but head and shoulders above any Star Wars property outside of the OT. The only good thing about the sequel trilogy completely destroying the concept of stakes is that we can now have Rogue Two, since nobody, even Palpatine can ever die in Star Wars."
  },
  {
    "rating": "5/5",
    "review": "The best visuals in a star wars movie ever, the best space battle, the only thing that's a bit bad is the character development, but this is a star wars story and the horror of war is perfectly shown, the empire seems threatning, so much so, that the rebels lose most of their fleet and rogue one, it is a fantastic movie, my favorite star wars movie"
  },
  {
    "rating": "5/5",
    "review": "The first Star Wars \"War\" movie, really cool, Brings so much new into the universe, great effects and an awesome Space Battle! Also one of the best hallway scenes ever!"
  },
  {
    "rating": "5/5",
    "review": "way better than the sequels, fleshes out the universe"
  },
  {
    "rating": "5/5",
    "review": "Muy buena película de Star Wars, deberían hacer más de este estilo"
  },
  {
    "rating": "4.5/5",
    "review": "The only Star Wars film that was any good since Disney bought the franchise. Mandalorian season 1 & 2 is close. Great acting, great story leading to canon Star Wars. A must watch."
  },
  {
    "rating": "5/5",
    "review": "Maravillosa, se siente Star Wars, tiene contexto, expande una historia que sólo fue mencionada, buen guión y dirección. Hay amor ahí."
  },
  {
    "rating": "4.5/5",
    "review": "It is the best new Star Wars movie."
  },
  {
    "rating": "5/5",
    "review": "Great actors, amazing story!"
  },
  {
    "rating": "3/5",
    "review": "Nice movie. Nice actors. Nice scene with Darth Vader."
  },
  {
    "rating": "4/5",
    "review": "Probably the best thing Disney has done with Star Wars, This is actually a very good film. Well written and acted, and syncs up brilliantly to the famous beginning of Star Wars. At least they got one right..."
  },
  {
    "rating": "5/5",
    "review": "Best of the new star wars movies, maybe even the best star wars movie ever made, it's up there in the top 3 at the very least. Just see it if you haven't already!"
  },
  {
    "rating": "4.5/5",
    "review": "The best Star Wars story and movie Disney has had to offer. This, Andor, and Rebels are top-tier beloved content. Keep to what works, keep the writers, directors, and visionaries who want to keep Star Wars engaging and memorable."
  },
  {
    "rating": "4.5/5",
    "review": "An incredible film. Very clever to have a film set directly running up to the opening scene is Episode 4. A very well executed film. The most 'gritty' Star Wars film to be produced and the franchise benefits from having such an incredible film to be a part of it."
  },
  {
    "rating": "5/5",
    "review": "The only decent movie to come out of Lucas Arts since the second trilogy. The performances by Ben Mendelsohn and Diago Luna and Felicy Jones were AMAZING. Great to see Star Wars is in the hands of a Good director and A-GRADE actors... What a talented ensemble! Ben Mendelsohn was MIND BLOWINGLY good."
  },
  {
    "rating": "5/5",
    "review": "Best Star Wars movie produced by Disney. I rank it top 3 best Star Wars movie ever. Vader stole the show."
  },
  {
    "rating": "4/5",
    "review": "Rogue one to me comes off as a James Bond meets Italian job meets band of Brothers. I do wish the characters were flushed out a little bit more. It does help if you have an understanding of the lore going into this movie. There is Some heavy-handed fan service. Dialogue is great, acting well done, Directing one of the best. And overall, great watch and probably the best Star Wars movie Disney has produced. I would definitely Recommend rogue one to anyone. 4/5"
  },
  {
    "rating": "4.5/5",
    "review": "Loved the story, loved the casting and f^%>ing loved the Darth Vader scene at the end!!!!"
  },
  {
    "rating": "5/5",
    "review": "The best movie since Disney purchase. Would’ve enjoyed seeing the original ending."
  },
  {
    "rating": "5/5",
    "review": "One of the best star wars films to ever be made."
  },
  {
    "rating": "5/5",
    "review": "Great Movie. At this point it's hard to believe Disney had anything to do with it."
  },
  {
    "rating": "4/5",
    "review": "You felt sadness for the characters that were lost and understood the sacrifice made by the rebels really sets up the original story…"
  },
  {
    "rating": "3/5",
    "review": "The last 5 minutes is where most of my ratings come from. The film itself is largely forgettable as with the actors. You already know how it ends anyway."
  },
  {
    "rating": "2/5",
    "review": "Best of the lame new Star Wars movies but it doesn't help much"
  },
  {
    "rating": "5/5",
    "review": "My favorite Star Wars movie! Scrips was amazing, acting was amazing, and the word building was perfect. CGI needed some help for a few characters but still good."
  },
  {
    "rating": "4.5/5",
    "review": "Not perfect. Stardust is a bit annoying, well quite a bit actually, but the movie itself is amazing. And the ending is near perfect."
  },
  {
    "rating": "5/5",
    "review": "The best Star Wars film since the original trilogy. I can't write a review to properly encapsulate why it's brilliant, so I'd just recommend watching it."
  },
  {
    "rating": "4.5/5",
    "review": "Probably the best Disney Star Wars movie"
  },
  {
    "rating": "5/5",
    "review": "This is the direction Star Wars should be heading in"
  },
  {
    "rating": "5/5",
    "review": "Finally! A Star Wars movie that feels like the Star Wars of old! BRAVO!!!"
  },
  {
    "rating": "3/5",
    "review": "It's a good movie."
  },
  {
    "rating": "5/5",
    "review": "Kein Film, an dem George Lucas nicht beteiligt ist, zeigt so gut die wahre Seele von Star Wars."
  },
  {
    "rating": "5/5",
    "review": "The best star wars that were created after \"Revenge of the Sith\" A well-made heroic movie with characters that you will like and care about even in a short time. At the end, almost a tear drops from the digital return of some characters, and the final tribute to Darth Vader is epic."
  },
  {
    "rating": "4/5",
    "review": "Disney best Star Wars film but that’s not saying much"
  },
  {
    "rating": "5/5",
    "review": "Literally, my favorite Star Wars movie of the Disney era. Great story arc, great characters. Terrific special effects. They didn't beat you over the head with the Skywalker line. Just awesome. So yeah... watch this movie and enjoy!!"
  },
  {
    "rating": "5/5",
    "review": "Literally, my favorite Star Wars movie of the Disney era. Great story arc, great characters. Terrific special effects. They didn't beat you over the head with the Skywalker line. Just awesome. Thanks for not sucking"
  },
  {
    "rating": "5/5",
    "review": "Unbelievably good compared to all the new live-action movies and series. A work worthy of old Star Wars."
  },
  {
    "rating": "4.5/5",
    "review": "Love Rogue One, it connects Revenge of the Sith and New Hope so well with a compelling story that will keep you on the edge of your seat and take you on a roller coaster of emotions. It may not be as good as some of the original saga but it is a great show."
  },
  {
    "rating": "4/5",
    "review": "Best movie of Disney Star Wars"
  },
  {
    "rating": "4.5/5",
    "review": "Good movie with just a few glitches, but delivers a knockout punch at the end. Felicity Jones plays the \"tortured heroine\" perfectly."
  },
  {
    "rating": "5/5",
    "review": "A true testament to what Star Wars stands for. The Story of Rogue One is not a happy one. There's no happy ending here. However, it's a Story for the Ages. A Story of Honor, Sacrifice, Altruism and Last Stands. And it's also, the last Star Wars movie ever made. What came after is just a vandalization of Star Wars."
  },
  {
    "rating": "5/5",
    "review": "Gareth Edwards is a real Star Wars fan!"
  },
  {
    "rating": "5/5",
    "review": "Peak Disney wars. Not one single minute of this movie was bad. The Empire is FINALLY a threat and scary. The prequels are great but how I have longed to see stormtroopers be more than comic relief… loved this movie. But this is as far as it goes movie wise for SW Disney… they aren’t the movies you’re looking for. “Move along …move along”"
  },
  {
    "rating": "4/5",
    "review": "Probably the only fantastic Disney-Star Wars movie. 100% worth a watch."
  },
  {
    "rating": "5/5",
    "review": "This was Disney STAR WARS at the apex of it's prime! By far this is the best of the Disney STAR WARS movies. It is well acted, looks great, and the action makes sense but does not overwhelm the viewer. The Darth Vader ending scene is perhaps the greatest in all of STAR WARS. Disney will NEVER again match this......."
  },
  {
    "rating": "5/5",
    "review": "Muy muy muy buena película"
  },
  {
    "rating": "5/5",
    "review": "Vader's corridor scene made me genuinely terrified of him and the build up to A New Hope was incredible. While the protagonist could've been lesser passive, she was somewhat relatable with an interesting, promising team that made up the legendary 'Rogue One' squad. A must watch alongside the Original 6 episodes (Ep I - VI)"
  },
  {
    "rating": "2.5/5",
    "review": "Must be hard to make a movie everyone knows the ending to. Some nice scenery but very boring until the last 5 minutes where there is the ultimate fan service."
  },
  {
    "rating": "5/5",
    "review": "Wish Disney would put this level of effort into everything. This is god tier."
  },
  {
    "rating": "5/5",
    "review": "Best Star Wars film Disney has done. Great writing, great story, great acting. Tony gilroy knows what he’s doing. It doesn’t mess up anything canon and folds right into a new hope."
  },
  {
    "rating": "5/5",
    "review": "Good Star Wars story - very different feel than all the other movies. Really liked the movie - but the last 2 minutes when Vader shows up...the entire movie was worth watching for just that. Seeing Vader just be a bad@$$ is just amazing."
  },
  {
    "rating": "4/5",
    "review": "It is a good movie. Not great but solidly good."
  },
  {
    "rating": "4.5/5",
    "review": "Best star wars movie since Empire strikes back and season 2 of Mandalorian."
  },
  {
    "rating": "5/5",
    "review": "So muss ein Star Wars Film außerhalb der Hauptreihe sein"
  },
  {
    "rating": "4.5/5",
    "review": "The best Disney Star Wars film contribution. Fits perfectly in the main story. without insulting main characters or breaking lore. In my mind the only Disney Star Wars movie that is canon."
  },
  {
    "rating": "5/5",
    "review": "Rogue one is a master piece."
  },
  {
    "rating": "4.5/5",
    "review": "For me, the original trilogy and this movie make up the Star Wars movies, everything else ranges from optional to diabolically terrible Star Wars branded content"
  },
  {
    "rating": "5/5",
    "review": "My second favorite Star Wars movie of all time."
  },
  {
    "rating": "5/5",
    "review": "A beautifully crafted love letter to Star Wars."
  },
  {
    "rating": "5/5",
    "review": "This is the one truly good movie out of Disney Star Wars. I would even say, this one is not Disney Star Wars, this the one, that deserves to just be great Star Wars period."
  },
  {
    "rating": "5/5",
    "review": "The best Mickey mouse Star Wars movie"
  },
  {
    "rating": "5/5",
    "review": "This is the best Star Wars movie Disney has put out. Even though it's still part of the overarching Skywalker saga it feels very fresh. And all of the main characters are new but still you care about them which makes the story arc still very much filled with emotion and great entertainment. The visual effects are absolutely stunning and you very much feels like the Star Wars universe. Do yourself a favor and check this one out"
  },
  {
    "rating": "5/5",
    "review": "This is easily my favorite post OT Star Wars movie. The way it seamlessly bled into a New Hope was a stroke of genius. Great action, great performances, and felt like Star Wars. Well done."
  },
  {
    "rating": "4/5",
    "review": "Great story that ties into the original movies. The story is well thought out and the actors do a great job."
  },
  {
    "rating": "5/5",
    "review": "This is what Star Wars fans wanted. New story that didn't break old norms. New characters that were 'flawed' but had integrity. Hey look: a strong, female protagonist that we actually ALL like; dear Disney take note: We have NO IDEA of the sexual orientation of the characters!!! Because... it wasn't germain to the story!!!"
  },
  {
    "rating": "5/5",
    "review": "The best Star Wars movie made by Disney. By a lot."
  },
  {
    "rating": "5/5",
    "review": "The last well done Star Wars movie."
  },
  {
    "rating": "5/5",
    "review": "This movie is a must-see! :)"
  },
  {
    "rating": "4/5",
    "review": "I changed my mind. Despite the overwhelming amount of deaths, this movie hits a lot of emotional and impactful beats that most modern Star Wars media fail to achieve."
  },
  {
    "rating": "4/5",
    "review": "I think this is the best of Disney Star Wars. I think Jyn is a great character, the comedy elements worked for me. This movie is the bar I rate all Disney Star Wars projects against"
  },
  {
    "rating": "5/5",
    "review": "Love it Felicity Jones is a queen"
  },
  {
    "rating": "0.5/5",
    "review": "This is easily one of the most boring movies ever. I fell asleep twice while watching it."
  },
  {
    "rating": "4/5",
    "review": "The best of Star Wars Disney. Not saying it couldn't be better but enjoyed it. If I was younger I believe I would have liked it even more. But for, it's retcon of what A New Hope was I would have been happier. But it didn't break anything and had good set pieces."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is beautifully done and it's among my favorite Star Wars movies. I quickly became invested in the characters, and knowing how the movie will likely end didn't take away from my enjoyment and interest in the journey throughout the film. Re-watchability factor is high, and there are some legendary scenes. A must for any Start Wars fan!"
  },
  {
    "rating": "5/5",
    "review": "En mi opinión es una de la mejores películas de star wars de toda la saga aunque esta película no salen los Jedi, es muy entretenida y excelente trama, la parte donde sale Darth Vader es una maravilla para los que somos fanáticos de star wars."
  },
  {
    "rating": "4.5/5",
    "review": "Good story that was enthralling and entertaining. Great ending fight scene."
  },
  {
    "rating": "5/5",
    "review": "Cassian Andor is the Goat. Just wish they had some balls and didn’t kill everyone off. Other than that a perfect 10"
  },
  {
    "rating": "5/5",
    "review": "This movie fits in with the first six. One of the only Disney made starwars that I consider cannon"
  },
  {
    "rating": "5/5",
    "review": "Everything feels right in this movie - best Star Wars Movie after 2010."
  },
  {
    "rating": "0.5/5",
    "review": "Cody Rhodes hates this one"
  },
  {
    "rating": "2.5/5",
    "review": "Would have preferred Kyle katarn and Jan orrs version of the story"
  },
  {
    "rating": "5/5",
    "review": "A really good and respectful prequel to the Original Star Wars trilogy that properly acknowledges the Prequel Trilogy."
  },
  {
    "rating": "4.5/5",
    "review": "Someone tell disney these are the kind of movies and moments we want. Its sad these characters stories cant continue but at the same time if they milked them too much it would ruin them"
  },
  {
    "rating": "4.5/5",
    "review": "If only Disney used this film as a model as to how to properly adapt new stories into the already established Star Wars universe. Was an excellent bridge between Revenge of the Sith and A New Hope. They also did an exceptional job writing new characters and developing their back stories."
  },
  {
    "rating": "5/5",
    "review": "Best Star Wars movie of the 2000s outside of Revenge of The Sith."
  },
  {
    "rating": "3.5/5",
    "review": "A fan letter to George Lucas Star Wars. The only Disney Star Wars that is good and made any sense. Pity that none of the other Disney Star Wars was like this."
  },
  {
    "rating": "5/5",
    "review": "Rogue One puts the War in Star Wars. Fans of the original trilogy are sure to enjoy what proves a moving addition to the Star Wars canon."
  },
  {
    "rating": "4.5/5",
    "review": "This is what Star Wars is suppose to be, great Acting and amazing performances, and the lead character is female, unlike the female actress in The Acolyte which brings shame and creates mockery of the star wars saga."
  },
  {
    "rating": "5/5",
    "review": "Now this is Star Wars! This is what Star Wars is about.."
  },
  {
    "rating": "4/5",
    "review": "Great movie. Loved how it filled in so much of the Rebellion story leading to Episode 4."
  },
  {
    "rating": "4/5",
    "review": "I really liked the third act of the film. The space battle and Vader are awesome moments in the film."
  },
  {
    "rating": "5/5",
    "review": "The perfect bridge between Revenge of the Sith and A New Hope"
  },
  {
    "rating": "4.5/5",
    "review": "The single best Star wars movie since the Empire Strikes Back. I actually believe this to be superior to Return of the Jedi."
  },
  {
    "rating": "5/5",
    "review": "Excellent. The best Star Wars creation to date. No cheese, all plot"
  },
  {
    "rating": "5/5",
    "review": "Of the newer Star Wars movies this is the top. Gritty and dark but staying true to source material."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible, terrible movie. Straight up did not like it. The only thing that made this movie worth it was the 30 seconds of Vader."
  },
  {
    "rating": "5/5",
    "review": "Absolutely awesome prequel to the original Star Wars - A New Hope. Cool new characters that bravely stole the plans to the original Death Star. Loved it. Best Darth Vader scene ever! Sadly, one of the very few Disney Star Wars productions on par with George Lucas’ original works."
  },
  {
    "rating": "4.5/5",
    "review": "Cinematography is just incredible, definitely Disney’s best Star Wars movie to date, also an incredible depiction of Darth Vader"
  },
  {
    "rating": "5/5",
    "review": "\"Rogue One: A Star Wars Story is an authentic Star Wars universe film with excellent acting, stunning visuals, and an overall entertaining experience.\""
  },
  {
    "rating": "4/5",
    "review": "Best Star Wars movie Disney has made by a long shot."
  },
  {
    "rating": "5/5",
    "review": "Great movie, one of my fauvorites ever. Hopefully it won't get cutted off, when Disney will have to sell SW, which it will, considering how bad job they do with it, beside R1 and Andor."
  },
  {
    "rating": "2/5",
    "review": "It was to predictable and boring. I never cared about the people because we all knew they were going to die. They tried to make us care but in the end we all knew what was going to happen. It was an ok movie and never need to see it again."
  },
  {
    "rating": "5/5",
    "review": "Great space dog fights, tension, and story telling. Also Vader just brutally ripping and tearing through rebels was beautiful."
  },
  {
    "rating": "5/5",
    "review": "By itself, this is the best Star Wars movie. It is amazing. I recommend this along with the OGs and Prequels. Forget about the rest of the Disney garbage."
  },
  {
    "rating": "5/5",
    "review": "Simply excellent. Love K-2SO !"
  },
  {
    "rating": "5/5",
    "review": "The only movie that Disney made in the Star Wars universe that was good. everything else is garbage."
  },
  {
    "rating": "3.5/5",
    "review": "Best of the Disney era star wars. 7 out of 10."
  },
  {
    "rating": "4.5/5",
    "review": "Very good. The only Disney entry worthy of the Star Wars name."
  },
  {
    "rating": "5/5",
    "review": "This movie is amazing and I can't stop watching it"
  },
  {
    "rating": "4/5",
    "review": "Out of everything that Disney released in the Star Wars universe this movie is by far the best. Fans of the original trilogy, the prequels and the EU should check it out."
  },
  {
    "rating": "4.5/5",
    "review": "Great film, really enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "Best movie of the Disney era movies. Fits in well between episodes 3 and 4."
  },
  {
    "rating": "3.5/5",
    "review": "It felt like Star Wars, it looked like Star Wars. The best Disney Star Wars movie of the bunch."
  },
  {
    "rating": "4.5/5",
    "review": "Best Disney Star Wars movie."
  },
  {
    "rating": "4.5/5",
    "review": "The best Star wars movie post Disney. That's not saying much though.... lol... (Seriously. I hate Modern Disney. Go bankrupt already!) Anyway, this movie is an exciting and rather dark story over all. It tells a pretty powerful story and has some epic action scenes."
  },
  {
    "rating": "3.5/5",
    "review": "\"Rogue One: A Star Wars Story,\" directed by Gareth Edwards and released in 2016, stands out as a bold and compelling entry in the Star Wars franchise. As the first of the standalone anthology films, it carves its own path while seamlessly integrating into the broader Star Wars mythology. With its gritty tone, complex characters, and breathtaking visuals, \"Rogue One\" delivers a powerful and emotionally resonant story of courage and sacrifice. Set just before the events of \"A New Hope,\" \"Rogue One\" fills in the crucial backstory of how the Rebel Alliance acquired the Death Star plans, setting the stage for the original trilogy. The film introduces us to Jyn Erso (Felicity Jones), a fierce and determined heroine whose personal vendetta against the Empire becomes a catalyst for a larger rebellion. Jones' performance is compelling, imbuing Jyn with both vulnerability and strength, making her journey deeply affecting. The ensemble cast of \"Rogue One\" is exceptional, bringing to life a diverse group of characters, each with their own unique motivations and arcs. Diego Luna’s Cassian Andor is a complex figure, a Rebel intelligence officer who operates in the moral gray areas of wartime. Donnie Yen’s Chirrut Îmwe and Jiang Wen’s Baze Malbus provide a dynamic duo, blending spirituality and brute force, while Riz Ahmed’s Bodhi Rook offers a portrayal of redemption and bravery. Alan Tudyk’s K-2SO, a reprogrammed Imperial droid, injects the film with much-needed humor and heart, his dry wit and loyalty making him an unforgettable character. Mads Mikkelsen’s portrayal of Galen Erso, Jyn's father and the reluctant architect of the Death Star, adds a layer of emotional complexity to the narrative. His internal struggle and ultimate act of defiance against the Empire provide a poignant underpinning to the story. Ben Mendelsohn’s Orson Krennic, the ambitious and ruthless Imperial Director, serves as a formidable antagonist whose pursuit of power adds to the film’s tension and stakes. Visually, \"Rogue One\" is stunning. Gareth Edwards' direction brings a sense of scale and realism to the Star Wars universe, with striking cinematography that captures both the grandeur of space battles and the gritty, war-torn landscapes of planets like Jedha and Scarif. The film’s special effects are top-notch, seamlessly blending practical and digital elements to create immersive and believable environments. The film’s score, composed by Michael Giacchino, pays homage to John Williams’ iconic themes while introducing new motifs that enhance the story’s epic and emotional moments. The music supports the narrative beautifully, from the suspenseful heist sequences to the somber and reflective moments of sacrifice and loss. \"Rogue One\" excels in its portrayal of the moral complexities and harsh realities of rebellion. The film does not shy away from showing the difficult choices and sacrifices that come with fighting an oppressive regime. The climactic battle on Scarif is a masterclass in tension and action, culminating in a bittersweet victory that underscores the film’s themes of hope and sacrifice. The visceral, ground-level perspective of the conflict brings a fresh and intense energy to the Star Wars saga. The film’s connection to \"A New Hope\" is handled with care and respect, culminating in a seamless transition that enhances both films. The appearance of Darth Vader, particularly in the chilling hallway scene, serves as a powerful reminder of his terrifying presence and the looming threat of the Empire. In conclusion, \"Rogue One: A Star Wars Story\" is a standout addition to the Star Wars canon, offering a gripping and emotionally charged narrative that enriches the overall saga. Its blend of strong performances, stunning visuals, and a compelling story of heroism and sacrifice makes it a must-watch for fans and newcomers alike. \"Rogue One\" is a testament to the enduring power of the Star Wars universe, proving that even in the darkest of times, hope can prevail."
  },
  {
    "rating": "4/5",
    "review": "finally something that felt like a STAR WARS movie I liked how it tied in to the first movie. it gives me hope"
  },
  {
    "rating": "4/5",
    "review": "\"I'm one with the Force, and the Force is with me\" was dumb. But then, the whole idea of the Force in Star Wars could be dumb, too. Otherwise, this film is wonderful."
  },
  {
    "rating": "4.5/5",
    "review": "It's important to watch Rogue One back with fresh eyes after watching \"The Acolyte\". If you want to see a strong Star Wars story, led by a nuanced character who is not just \"generic strong female lead\" character but displays complexity, motivations and individuality to tell an interesting story - come here. Felicity Jones is fantastic as Jyn Erso, although Alan Tudyk's voice performance almost steals the show."
  },
  {
    "rating": "4/5",
    "review": "Pretty good movie, I liked it"
  },
  {
    "rating": "5/5",
    "review": "As a standalone movie, possibly the best Star Wars film made to date. A must see - and proof that the Star Wars fandom is MORE than prepared to accept a strong, female lead - when well written and acted, in a strong story."
  },
  {
    "rating": "4.5/5",
    "review": "Maybe the only REALLY good Disney Star Wars movie to so far."
  },
  {
    "rating": "4.5/5",
    "review": "Really enjoyed this movie. Filled in the gap nicely. Excellent pacing, direction and casting. This is easily my favourite Star Wars movie outside the original trilogy."
  },
  {
    "rating": "5/5",
    "review": "Rogue One is my favorite Star Wars movie. Amazing visuals and the acting is excellent. I have watched at least 10 times and see new details each time. Visceral and emotional. Highly recommend!"
  },
  {
    "rating": "5/5",
    "review": "The only Disney Star Wars content that I've sat and watched over and over again. This is an example of how to portray a strong female lead. She could have just as easily been \"diverse\" without directly pointing it out and it would have been just as good a movie. Do more like this."
  },
  {
    "rating": "4.5/5",
    "review": "The only good Star Wars movie made since the original trilogy. More of this please. Less of Rian Johnson’s BS."
  },
  {
    "rating": "5/5",
    "review": "The best Star Wars movie since Disney has taken over and ruined the franchise Beautiful story, stunning cinematography, amazing set pieces. A 5 minute horror movie at the end… you’ll know when you see it and you’ll love every second of this movie. Strong and likable character, perfect amount of humor to seriousness ratio."
  },
  {
    "rating": "3.5/5",
    "review": "A pretty good film that could have been a great film. Unfortunately they turned a lot of the action scenes that should have created good tension into a campy batman feel, and then they were too over the top corny with the blind monk. They needed a way to have the audience care more about Jin Erso as well. Going back and reading the books that go more into her story help the movie for me, but as a standalone film, it doesn't do what it needs to on that front."
  },
  {
    "rating": "4.5/5",
    "review": "Star Wars at its best!"
  },
  {
    "rating": "4.5/5",
    "review": "Best star wars disney film, great battle fight scene, nice plot and tidbits for fans such as Vader boarding the ship at the end of the movie made me very happy. Definitely worth to watch!"
  },
  {
    "rating": "4.5/5",
    "review": "With minimal flaws, this is almost a 5-star Star Wars film. It is also a candidate for a 5-star film in general. Pure cinematic masterpiece!"
  },
  {
    "rating": "4/5",
    "review": "Very interesting take on the Star Wars universe. Gritty, raw, and dirty. 40 seconds of the film steals the show and is very memorable."
  },
  {
    "rating": "5/5",
    "review": "One of the best Star Wars movies since Disney got the rights. I love Jin and Cassian Andor as characters I wish they would of survived . Perfect setup to New Hope. That Vader scene towards the end is AMAZING 😱. I even love Michael Giacchino score even though it isn't John Williams. This is a 10/10 EPIC FANTASTIC"
  },
  {
    "rating": "5/5",
    "review": "Amazing Star Wars movie that created original, compelling characters and built upon Star Wars lore in an authentic way. The movie pays homage to the originals while still maintaining its own originality (unlike a certain sequel trilogy). Boasted one of the coolest and most acclaimed Darth Vader scenes of all Star Wars media. The love for Star Wars shines through every bit of this movie."
  },
  {
    "rating": "5/5",
    "review": "Actually makes hs original star wars movie, \"A New Hope\" even better. One of the best of the star wars movies."
  },
  {
    "rating": "5/5",
    "review": "This is the best Star Wars movie in my opinion. I call it the gritty, boots on the ground star wars. First half is plot set up with periodic action sequences. Then the last hour is the big pay off. Felicity Jones was outstanding as Jyn Erso. K-2SO became my favorite star wars robot character. So worth the watch."
  },
  {
    "rating": "4/5",
    "review": "This movies runs circles the width of saturns rings around J.J. Abrams and Disney's failed vanity triology in terms of: Science Fiction Pacing Acting Writing General ideas Scope Drama Suspense And lifts the veil on the unholy hodgepodge of corporate dumfuc(k)ery that it truly was. The musical score is barely servicable. But that is really the only negative thing about it. It really is. The rest is Star Wars as Star Wars was in the beginning. Only more mature."
  },
  {
    "rating": "5/5",
    "review": "I remember first seeing this Film in 2016 with my Dad and sister while being amazed at how well choreographed and visually stunning this film managed to be. 8 Years later I’m still amazed. Great acting and great visuals and I Love how this film falls directly into a New Hope."
  },
  {
    "rating": "5/5",
    "review": "スターウォーズがディズニーに移ってファンの不安が募る中ファンにこれぞスターウォーズ！と言わせるような作品が登場した。悲しくも素晴らしい作品。この時はまだファンは知らなかった。この後の悪夢を、、、。"
  },
  {
    "rating": "5/5",
    "review": "Best Disney Star Wars film easily. The action, writing, and visuals is phenomenal. This film is a massive love letter to Star Wars films."
  },
  {
    "rating": "5/5",
    "review": "For once Disney knew what they were doing with Star Wars"
  },
  {
    "rating": "5/5",
    "review": "The greatest Star Wars film in the Disney era. Felt just like one of the original trilogy films. If only all of the Disney films had been like this. Great action, great cast and really good humour. No cheesy Disney humour that ruins every moment like the other Disney films. Everything about it is perfect and the darth vader scene is incredible. Couldn’t recommend this enough"
  },
  {
    "rating": "3.5/5",
    "review": "Taking place between episodes 3 and 4, this movie has a bit of plot armor, but that could be the Force. 6.7/10 - Fine."
  },
  {
    "rating": "4.5/5",
    "review": "This is one of the best of Star Wars and the only good Star Wars movie Disney has made, the hole side plot of Jyn and her father is compelling and helps making her fell 3 dimensional, as well as Casian he has a lot moments to shine in this flick. This is simply chefs kiss. 9.2/10"
  },
  {
    "rating": "5/5",
    "review": "Best Disney made star wars movie."
  },
  {
    "rating": "5/5",
    "review": "My favourite stars wars movie, the story was fantastic, characters were incredibly likeable, I was so drawn in throughout this tale, just the right amount of action as well as a well thought out script. Recommend to absolutely anyone."
  },
  {
    "rating": "5/5",
    "review": "Das ist der beste Disney Star wars Film."
  },
  {
    "rating": "5/5",
    "review": "The best star wars movie since the return of the Jedi. Feels just like the original trilogy. If the you loved episodes IV to VI then likely you will love this too. Watch it now."
  },
  {
    "rating": "5/5",
    "review": "To date one of the only spinoff series or movies that Disney didn't completely butcher. Great movie here, everyone dies as they do in a thrilling scifi drama such as SW."
  },
  {
    "rating": "3/5",
    "review": "It's concept is good but the way it executes is not."
  },
  {
    "rating": "5/5",
    "review": "One of the best Starwars movies"
  },
  {
    "rating": "4.5/5",
    "review": "In all seriousness, this is indeed one of the best Star Wars movies out there, especially when it takes war much more serious. Now, as the story goes, a great one when outside of the Jedi and every main character we know and love, except a couple which I'll keep to myself. The acting does range from amazing when it comes to emotional moments, serious moments and how it drives the plot to decent when the movie does have to take a breath, which I don't mind it that much. My favorites do have to be K-2SO and Chirrut Imwe, while everyone else are great on their own when the story has to advance from scene to scene even from Jyn and Cassian's point of view. The scenery does look great, I would have to say the best out of every live-action Star Wars movies. The action does fit the greatest since this is more of an actual war movie when getting the plans of the Death Star to fighting off Stormtroopers to at the least, fight in a war. Even as watching this first time, I do see why most fans see this as one of the best. Even gets you on the edge of your seat and see where all this goes before the climax, which is a little slow, but it is what it is. Some find it okay, some find it amazing. I do stand by saying, this was, once again, not just a Star Wars movie, but a great war movie on it's own. 9/10."
  },
  {
    "rating": "4/5",
    "review": "Rogue one brings back that joy that previous star wars movies had, with a fun cast of characters and a dark tone, while also adding more to the rich world of star wars."
  },
  {
    "rating": "5/5",
    "review": "Another great addition to the Star Wars universe!"
  },
  {
    "rating": "5/5",
    "review": "Insanely good film! The best of the Disney Star Wars movies, and one of the best Star Wars films over all."
  },
  {
    "rating": "3/5",
    "review": "sad what happens to characters at the end too many characters good action scenes one of the better star wars films"
  },
  {
    "rating": "4.5/5",
    "review": "Una película que forma parte de una franquicia tan grande y confusa (incluso más que el UCM), y que aún así, funcione por sí misma sin recurrir a cameos o referencias, hace que sea la mejor de su franquicia."
  },
  {
    "rating": "1/5",
    "review": "This is the worst movie I have ever watched. I would have given it 0.5 stars if darth Vader wasn't in it."
  },
  {
    "rating": "4/5",
    "review": "A great movie about the rebellion and a good plot."
  },
  {
    "rating": "5/5",
    "review": "Definitely the very best Star Wars movie ever and trying to watch the Disney series \"Andor\" after it, is blasphemous as Andor is not consistent with Rogue One"
  },
  {
    "rating": "5/5",
    "review": "Love this movie. Gareth Edwards delivered once again. Great cast of characters and locations. Great ending. The only good Star Wars movie under Disney."
  },
  {
    "rating": "5/5",
    "review": "cheing hor ivor:um... scarf is destroyed and everyone is dead. so.... do you know talking about ending to continue a new hope too?"
  },
  {
    "rating": "4.5/5",
    "review": "Consistent action-packed storytelling with engaging and remarkable characters makes it the best Star Wars movie till date. Highly immersive rebeliant experience without any visible plot patterns."
  },
  {
    "rating": "1/5",
    "review": "Only good scenes are with Vader."
  },
  {
    "rating": "5/5",
    "review": "Kyle Katarn was better, but Andor carried."
  },
  {
    "rating": "5/5",
    "review": "The best element of this movie come from the idea that it is a war film set in the Star Wars universe. The battle scenes are the best of any theatrical Star Wars film, in my opinion. The plot has some holes, but the character writing, dialogue, and tension building is very well done. The acting is good on all accounts. The visuals, score, CGI, and sound design are brilliant. The original trilogy aesthetic is perfectly captured. It is a love letter to fans of the original trilogy era, and by far my favorite product of the Disney Star Wars era."
  },
  {
    "rating": "3/5",
    "review": "Hot Take: Rogue One is kinda average."
  },
  {
    "rating": "4.5/5",
    "review": "I Absolutely Loved watching this movie in the Theater, the effects were in my opinion really good for the time, the story was also really good and don't even get me started on the Characters! I seen it maybe 8 time's now and I still to this day, think that this is my personal favorite Star Wars film."
  },
  {
    "rating": "3.5/5",
    "review": "Rogue One's best quality is that it sticks to the predetermined lore of Star Wars, with it otherwise not bringing much variety to the franchise."
  },
  {
    "rating": "5/5",
    "review": "This is the only Disney movie which truly deserves to be a part of the Star Wars franchise!"
  },
  {
    "rating": "4.5/5",
    "review": "The hallway scene was peak fiction. Doesn't spare death and is really nice side movie to the saga."
  },
  {
    "rating": "5/5",
    "review": "Best movie of the franchise. Funny, suspenseful and emotion filled even though you know the general plot going in."
  },
  {
    "rating": "5/5",
    "review": "Surely the best Star Wars movie since Empire Strikes Back and maybe better. Rogue One brings a gritty new entry to Star Wars and shows us real war, not just sabers and magic. Rogue One shows us it isn't just Good vs Evil like the original trilogy, the rebels can be evil too, and the Empire can be good as well. Rogue One and Andor go hand in hand as beautifully written Star Wars. And the fact that nobody survives in this one makes it so much more real. Our characters we learn to love in this movie all sacrifice themselves for something bigger than themselves. Loved this movie, 10/10."
  },
  {
    "rating": "4.5/5",
    "review": "Best Star Wars movie since the 'Empire Strikes Back'"
  },
  {
    "rating": "5/5",
    "review": "By far the best of Disney Star Wars films. This movie shines in every way. It succeeds in providing insight into how the plans to the death star were stolen in a believable and realistic way. Poignantly epic and beautifully filmed. This is an absolute must see!"
  },
  {
    "rating": "5/5",
    "review": "The best Star Wars movie made under Disney, if not ever. Incredible soundtrack, especially Jyn Erso's theme."
  },
  {
    "rating": "5/5",
    "review": "The best Star Wars movie of all time. Period."
  },
  {
    "rating": "5/5",
    "review": "Best movie ever never gets old!"
  },
  {
    "rating": "3.5/5",
    "review": "Um filme muito legal envolvendo o universo de Star Wars, me surpreendeu muito a direção. A história é monótona no começo, mas o filme só melhora, trazendo uma experiência divertida com as boas e velhas cenas épicas que o universo de Star Wars consegue fazer."
  },
  {
    "rating": "4/5",
    "review": "Le début est un peu long mais la fin est une des meilleures que j'ai pu voir"
  },
  {
    "rating": "3.5/5",
    "review": "A fresh perspective on the Star Wars universe (as well as on action / adventure / war genres overall) without changing or disrespecting it. A good story that could stand on its own."
  },
  {
    "rating": "4/5",
    "review": "I thought this movie was solid. Thought the characters were each unique in their own way. It was entertaining but it us not better than the original trilogy."
  },
  {
    "rating": "4.5/5",
    "review": "I like it. Best Disney SW movie."
  },
  {
    "rating": "4/5",
    "review": "Rogue One not only bridges the gulf between the choppy prequel films and the masterful original trilogy, but stands as a reminder that plundering legacy and pandering to fans both old and new is not necessary to achieve the success that this delicate and sobering Star Wars picture delivers."
  },
  {
    "rating": "4/5",
    "review": "Gareth Edwards and Disney at some points took great risks with story and characters but it had major rewards such as solid ideas, interesting darker tones and the ending was so great"
  },
  {
    "rating": "4/5",
    "review": "If all the new star wars films were done like rogue 1 .....we can dream"
  },
  {
    "rating": "5/5",
    "review": "Great addition to the star wars legacy"
  },
  {
    "rating": "4.5/5",
    "review": "Rogue One is a great movie, it makes the empire really dangerous like we never seen before. It has the best space ship battle of Star Wars, a climax with an ending that seems REAL."
  },
  {
    "rating": "4/5",
    "review": "The best Star Wars movie since Revenge of the Sith, this first entry in the anthology films captures the flair of the original trilogy. The characters are likable, the action is brisk, and the Empire hasn't been this intimidating since The Empire Strikes Back. Gareth Edwards and his crew have crafted a film with an engaging story and a deep respect for established lore."
  },
  {
    "rating": "4/5",
    "review": "Out of all the movies that have been released by Disney after they bought Lucasfilm, this is one of the few things that have felt like a Star Wars movie. I appreciate the darker tone, while it still has some great jokes sprinkled in, mostly from K2-SO, who gave me some of the biggest laughs in the movie, while not just being a quip machine, like a lot of Disney SW characters. Every character feels like they exist in this world, and I especially like Beize and Chirrut's dynamic. They feel like true friends, willing to stick by one another, despite having differences in what they believe. Cassian Andor (with the benefit of watching the Andor series) is one of the best characters, and making him out to be a more morally grey character really shows how the SW universe is full of lawlessness, even in characters who we should see as the heroes. The special effects are some of the best I've seen in a Star Wars film, and every ship and planet feels photoreal. However, the digital doubles for Tarkin and Leia don't work very well, and while Tarkin as a fully CG human character is impressive, it still carries the stench of uncanniness. Another character I don't really care for is Bodhi, the pilot. He doesn't really have much to do, or much of a character, and when he gets his little moment to shine, he dies immediately after. Other than that, this is a great Star Wars film, and the last hour brings us some of the greatest, most inventive battle sequences in any of the films, with with some good characters, and a slow-building yet engaging story. If you haven't seen this, I encourage you to give it a shot."
  },
  {
    "rating": "4/5",
    "review": "Amazing, just amazing."
  },
  {
    "rating": "3/5",
    "review": "Tonally and visually closer to the original trilogy than any other movie produced within the franchise, but Rogue One relies a bit too much on fan service and lacks that final edge to really live up to its potential. On the plus side is a very believable story world, on the minus side is a very random plot. And then there are the CGI faces."
  },
  {
    "rating": "5/5",
    "review": "Best Star Wars movie: beautiful , good scenario and respect the lore. a lot of SW references. Rogue One is number 1."
  },
  {
    "rating": "3/5",
    "review": "There are no character development in this movie. As a result you do not really care about the investment and sacrifice these characters does to get the plans for the death star. Several under used actors like Mads Mikkelsen. Major pacing problems, action scenes feel forced in."
  },
  {
    "rating": "4.5/5",
    "review": "Rogue One is the first Star Wars film not directly involving the Skywalker family, which I love. However, it is also the first movie not featuring any Jedi or lightsabers (outside of one scene), which, for me, removes the two most iconic pieces of Star Wars, making it feel less like a Star Wars movie and more like a standard sci-fi movie. That being said, having no Jedi evens the battlefield, making for fantastic large-scale battle scenes. Overall, this is a good movie, and I understand why so many people love it. However, I would have liked to see something a bit more adventurous for Star Wars' first standalone film."
  },
  {
    "rating": "4/5",
    "review": "Very good characters, well paced and incredible stakes well portrayed."
  },
  {
    "rating": "2.5/5",
    "review": "Literally, the only thing people remember from this was the ending. Everything else was forgettable. The only reason why this movie was made was sourly for nostalgic purposes."
  },
  {
    "rating": "5/5",
    "review": "Good Cast - Great storyline - even If the end was of course already preset. Well done"
  },
  {
    "rating": "3/5",
    "review": "A mixed bag in every sense of the term, from how it's structured to how good of a watch it is. Sometimes it drowns in its own exposition, sometimes it pumps out incredible scenes. As a replacement Death Star plan story for the already amazing prologue level of Dark Forces (where Kyle Katarn got the plans on his own and didn't die), it's mediocre... but damn that scene where Darth Vader offs the poor rebels in that corridor is so morbidly incredible."
  },
  {
    "rating": "5/5",
    "review": "Simplesmente incrível, um filme formidável, realmente compensa assistir outra vez!"
  },
  {
    "rating": "5/5",
    "review": "Star wars at its peak in my opinion"
  },
  {
    "rating": "4/5",
    "review": "una excelente película, donde se demuestra el poderío del imperio y como hasta el ultimo hombre de la resistencia es valioso, sus protagonistas son carismáticos y empatizas con ellos, tiene el toque de humor justo y necesario que no ralla lo absurdo, su final es increíble, y tiene una escena iconica que pasara a la historia del cine. sin mas que añadir solo diré, soy uno con la fuerza y la fuerza esta conmigo soy uno con la fuerza y la fuerza esta conmigo"
  },
  {
    "rating": "5/5",
    "review": "When you look at Episodes 8 and 9 and Solo it's almost as if Rogue One was given the green light despite Disney's best efforts. The divide that seperates Rogue One from the aftermentioned is too great to calculate. What we got from Rogue One was everything we didn't get from 8, 9, or Solo. A great director, compotent screenwriters, and actors who excelled because they were given material worthy of their talent. Rogue One was released before any of the other films noted. Looking back isn't it great to know, even if it was just that one time, our expectations were actually exceeded rather than subverted?"
  },
  {
    "rating": "4.5/5",
    "review": "A Star Wars movie that appeals to new and old fans alike. Characters are memorable, unique and well-casted. While the story may seem a bit jumbled at times, this is largely eclipsed by stunning visuals, great dialogue and an emotional punch."
  },
  {
    "rating": "5/5",
    "review": "To this day my favorite Star Wars movie."
  },
  {
    "rating": "5/5",
    "review": "I thoroughly enjoyed this addition to the Star Wars universe and I must say that it is probably my favourite film in the franchise. Interesting characters, emotive story, and amazing special effects. I highly recommend this film."
  },
  {
    "rating": "5/5",
    "review": "Who the heck isn't giving this movie 5 stars"
  },
  {
    "rating": "4/5",
    "review": "It's pretty cool. The Characters seem to have some depth."
  },
  {
    "rating": "4/5",
    "review": "The only movie in the new franchise which is actually really good!"
  },
  {
    "rating": "5/5",
    "review": "Rogue One is one of The Best Star Wars movies ever made. It embodies everything the rebellion stands for and then some. I used to think ROTJ was the best but not anymore. The background characters in this film are what really make the franchise work. This movie deserves much more credit and higher rating. Jyn and Cassian are the true rebels."
  },
  {
    "rating": "4/5",
    "review": "Despite my biased feelings about new installations for the Star Wars franchise, this was both a refreshing and captivating 2 hours, and a really interesting, fun way to create an entire backstory for a somewhat minor detail in the main installments."
  },
  {
    "rating": "5/5",
    "review": "Peak star wars, peak fiction."
  },
  {
    "rating": "5/5",
    "review": "This is literally one of the best, if not the best star wars movie. Its amazing and love every second of it. This movie is 100% my favorite star wars movie out there"
  },
  {
    "rating": "3.5/5",
    "review": "Weak characterization bolstered by compelling visuals (some of the most memorable in the series) which might be more important."
  },
  {
    "rating": "5/5",
    "review": "consider this the best complete/single star wars movie."
  },
  {
    "rating": "5/5",
    "review": "As a profesional movie watcher, it doesn't matter how great a movie is, if you don't have a great high quality sound cinema speakers and high HDR visual effects in a 4k or 8k screen even the best movie in the world may result boring, so now, I don't know why we have people who watch this movies in their celphone's screens commenting or giving their opinions in rotten tomatoes. My opinion about \"ROGUE ONE\"?? I think is one of the best star wars movies, May be the best of all star wars movies, action, fun, explotions, fire, and Darth Vader!! May be there are little defects or errors but they are insignificant, I really enjoy this movie every time I watch it, all my family does it."
  },
  {
    "rating": "4/5",
    "review": "First third is meh but second 2/3 are awesome and it does have the Vader scene"
  },
  {
    "rating": "5/5",
    "review": "Peak Star Wars, easily the best since Empire Strikes Back A++++"
  },
  {
    "rating": "5/5",
    "review": "An excellent example of the strength Star Wars has on the big screen. A Star Wars story it is, as it acts as an independent film, yet connects beautifully with the rest of the movies. In a captivating performance from all cast members, the emotions and feelings are felt by members of the audience as if they are in the scene itself. The plot has amazing twists and turns that keep you engaged the whole way through. With the great cast choices and special effects that immerse you into the wonderful world of rebellion, Rogue One is a must-see whether you thoroughly enjoy Star Wars or have never seen it."
  },
  {
    "rating": "5/5",
    "review": "Great piece of work in any kind of visual and acting category. cleverly inserting a action packed emotional piece of story into another great story. Well done!"
  },
  {
    "rating": "5/5",
    "review": "My favorite Star Wars movie!"
  },
  {
    "rating": "4/5",
    "review": "While I didn't enjoy the CGI faced characters, and some portions of the story had me questioning the logic of things, overall this was a very impressive and emotionally engaging Star Wars film. Also, that Vader scene!!"
  },
  {
    "rating": "5/5",
    "review": "Star Wars is a real love/hate thing for me. The endless merchandising the laughable prequels/sequels its been a pathetic cash grab for decades now. But every now and then the franchise coughs up something of value like Andor or the series of video games Star Wars Battlefront. This is the only Star Wars film besides the original trilogy that is worth watching. And it's spin off Andor is great too. If your going to jump into the sea of uninspired over produced garbage that is modern day Disney Star Wars then this is really the only film to watch."
  },
  {
    "rating": "5/5",
    "review": "Star Wars Masterpiece. In my opinion Best star wars move ever and perfekt starter for new fan."
  },
  {
    "rating": "5/5",
    "review": "One of the best newer Star Wars movies! If not the BEST!"
  },
  {
    "rating": "4.5/5",
    "review": "While the first half or third of the movie is a bit meh and exposition-heavy, the last act is pure Star Wars entertainment and fun. Easter eggs and callbacks/references work, the special effects/CGI are mostly on point, and the new characters that come along are likable and kick butt! The force is with this film!"
  },
  {
    "rating": "5/5",
    "review": "Life Changing for long-time fans and a great Prequel, and a nice introduction."
  },
  {
    "rating": "5/5",
    "review": "The only good movie to come out of Disney Star Wars. A must see."
  },
  {
    "rating": "0.5/5",
    "review": "Film réussi visuellement, avec de bonnes idées, malheureusement le scénario et le respect de l'épisode IV est une catastrophe, un piège, un détonateur placé dans un réacteur qui est une pure invention du film, alors que ce n'est pas le cas dans l'épisode quatre, une étoile de la mort opérationnelle et qui détruit jedha et Scarif… alors que celle ci n'est opérationnelle qu'à partir de l'épisode IV et qui a comme première cible alderaan, et les rebelles qui assistent à la démonstration de puissance de cette station de combat alors que les rebelles assistent à la puissance de l'étoile de la mort pour la première fois dans l'épisode IV, le grand moff Tarkin voulait d'ailleurs que la princesse Leia soit la première à y assister Et pleins d'autres bêtises … Bref film catastrophique… qui est juste très beau"
  },
  {
    "rating": "5/5",
    "review": "Easily the best of Disney-era Star Wars. Rogue One feels taken right out of the original trilogy while still being very fresh and interesting, all the characters are fun to watch and receive great arcs, the action is some of the best we've seen in a Disney-era movie, and the plot is very inspired. As a bonus, the production is excellent as well. Lets hope we see more of Gareth Edwards in the future."
  },
  {
    "rating": "5/5",
    "review": "The last good Star Wars movie"
  },
  {
    "rating": "5/5",
    "review": "Ótimo filme. Explica muita coisa ! Peças se encaixam."
  },
  {
    "rating": "4.5/5",
    "review": "The best star wars film since the empire strikes back."
  },
  {
    "rating": "5/5",
    "review": "Rogue One is my favourite STAR WARS film because of its compelling characters, visually stunning action sequences and life-changing morals."
  },
  {
    "rating": "5/5",
    "review": "The visually stunning and emotionally grounded Rogue One shows what Starwars can be. The perfectedly executed story is about finding what you believe in and being willing to sacrifice. To top it off, the story goes directly into A New Hope. The solid storyline mixed with awesome fan service make Rogue One an absolute win."
  },
  {
    "rating": "2/5",
    "review": "This is where Star Wars went downhill for me. At the time it was alright, but I don't remember much from it so it isn't very memorable."
  },
  {
    "rating": "5/5",
    "review": "Great story, perfect pacing, and that final Vader scene is the greatest lightsaber scene in any star wars movie!! Worth the price of admission"
  },
  {
    "rating": "4.5/5",
    "review": "Wow. A more grounded and gritty Star Wars that maintains the core elements that makes the franchise special. Arguably the best Star Wars film."
  },
  {
    "rating": "5/5",
    "review": "\"Rogue One\" is an exciting chapter linked to the history of the first films of the Star Wars saga, and presents us with a magnificent and very original script, which perfectly connects all the dots, bringing iconic participations of legacy characters, such as Darth Vader and the Princess Leia. Alone, it works very well, too, as it features engaging characters you care about throughout the film, plus, of course, outstanding photography and special effects. What about that final sequence? Sad, melancholic and yet heart warming with the brief appearance of Princess Leia. No matter how many times I watch this movie, I will be positively impacted every time."
  },
  {
    "rating": "5/5",
    "review": "Watched this movie three times but still feel like I haven't enjoyed it enough! The end battle scene on the beach is beautiful and probably one of my fav Star Wars movies."
  },
  {
    "rating": "5/5",
    "review": "This movie is like the original trilogy"
  },
  {
    "rating": "4.5/5",
    "review": "A fantastic addition to the franchise with great characters, a great plot, and lots of action. The Vader hallway sequence might be the best scene in Star Wars."
  },
  {
    "rating": "4.5/5",
    "review": "This is a very underrated movie. Its action and thrills are great. The characters aren't really super interesting but the classic Star Wars feel makes this film awesome."
  },
  {
    "rating": "4/5",
    "review": "Rogue One delivers a thrilling and action-packed standalone adventure set in the Star Wars universe, with a compelling ensemble cast and breathtaking battle sequences, making it an enjoyable addition to the saga."
  },
  {
    "rating": "4.5/5",
    "review": "It was like a starwars war movie"
  },
  {
    "rating": "4/5",
    "review": "A fantastic installment in the Star Wars saga"
  },
  {
    "rating": "3.5/5",
    "review": "Rogue One è un film molto adulto per la saga e sperimentale, benevolmente diverso"
  },
  {
    "rating": "3.5/5",
    "review": "This movie has bad dialogue and the first half part of the movie is boring. It only gets interesting after they arrive at Scarif. The battle scenes at Scarif is epic and very well-thought. The scene when Vader was chasing in the end is fantastic. The characters are interesting and well developed."
  },
  {
    "rating": "5/5",
    "review": "This movie goes down as one of my favorites. I love that the movie is a little darker than the others and the twists and turns they make. The ending being not a happily ever after type of ending was also great showing the sacrifices the characters made to kick start the 3 main movies. Did i also mention the visuals are AMAZING."
  },
  {
    "rating": "4.5/5",
    "review": "One of my two top picks of the newest released movies from the orginal Star Wars franchise. Well done."
  },
  {
    "rating": "4/5",
    "review": "This is a solid Star Wars film. Adds to the original films REALLY well. It's a good stand alone sci-fi film too. Don't have to watch all of Star Wars to know what's going on in this film which is a plus!"
  },
  {
    "rating": "4.5/5",
    "review": "A fantastic addition to the Star Wars saga."
  },
  {
    "rating": "4/5",
    "review": "Rogue One is a somewhat refreshing take on part of the Star Wars pantheon that often gets overlooked. Focusing on characters that normally fly nameless and faceless in the background, highlighting them just long enough to unceremoniously kill them off the instantly. Its uniquely crafted, expertly casted with Jones, Luna and Tudyk the linchpin with Mendelsohn and Mikkelson offering pedigree. This is a Star Wars movie that doesn't always feel like its siblings but fortunately, in Rogue One's case its a good thing. 8.2/10"
  },
  {
    "rating": "5/5",
    "review": "Literally better than the originals, imo. Unbelievable."
  },
  {
    "rating": "2/5",
    "review": "Filme arrastado, apesar do roteiro bem elaborado, faltou melhor performance principalmente nas atuações."
  },
  {
    "rating": "5/5",
    "review": "A perfect Star Wars movie. Maybe even my favourite out of all of them, including original trilogy. I think Rogue One crew were the greatest heroes of the story. Their mission and ultimate sacrifice were instrumental to the whole larger storyline!"
  },
  {
    "rating": "5/5",
    "review": "Really good, tons of lore, and a good sequel to Andor"
  },
  {
    "rating": "5/5",
    "review": "This combined with Mandalorian seasons 1 and 2 is proof that Disney is capable of doing something right with Star Wars. Perhaps if they cannot show themselves worthy of learning from their mistakes, they can at least learn from their successes!"
  },
  {
    "rating": "5/5",
    "review": "The best Star Wars movie since Empire Strikes Back. Well written, clever story that use enough nostalgia to keep die-hards happy but still good enough to be a great stand alone movie."
  },
  {
    "rating": "5/5",
    "review": "DID NOT LACK CHARACTER DEVELOPMENT"
  },
  {
    "rating": "3.5/5",
    "review": "While Disney's Star Wars hasn't seen the greatest days, there are still indeed some gems in a world of stone, and Rogue One: A Star Wars Story is absolutely one of them. Having such a smart premise and execution, doing a service to all the nit-pickers of A New Hope and giving us a new invigorating story that gives us an expansive refined context on A New Hope that I can't help but praise."
  },
  {
    "rating": "5/5",
    "review": "10/10 Sem duvidas o melhor filme de Star Wars \"Rogue One: Uma História Star Wars\" é uma adição notável ao universo cinematográfico de Star Wars, oferecendo uma aventura épica repleta de ação que certamente se destaca entre as melhores cenas de ação de toda a franquia. As cenas de ação em Rogue One são de tirar o fôlego e estão entre as melhores do universo cinematográfico de Star Wars. Desde batalhas explosivas no espaço até combates intensos em terra, o filme oferece uma variedade de sequências de ação emocionantes e bem coreografadas. A habilidade da direção em capturar a grandiosidade e o perigo das batalhas é impressionante, mantendo os espectadores na ponta de suas cadeiras durante toda a projeção. Além da ação espetacular, Rogue One também apresenta personagens cativantes e bem desenvolvidos. Jyn Erso, interpretada brilhantemente por Felicity Jones, é uma protagonista carismática e determinada, cuja jornada pessoal é emocionante de acompanhar. Os demais membros do grupo de rebeldes também têm suas oportunidades de brilhar, com destaque para o carismático Cassian Andor, o sarcástico K-2SO e o misterioso Chirrut Îmwe."
  },
  {
    "rating": "5/5",
    "review": "F***ing loved this movie. My favorite Star Wars project, Movie or show."
  },
  {
    "rating": "5/5",
    "review": "One of the best Star Wars movies ever made. Right up there with Empire Strikes back. I think they did a great job balancing suspense, adventure, humour and fear in the plot and with the characters which are largely well crafted. It fits really well with the original trilogy and there's some reasonable and necessary CGI with Grand Moff Tarkin and Princess Leia. The first firing of the Death Star is spectacular, Love the sarcasm of Andor's reprogrammed droid. He stole the show. Great final battle and gut-wrenching ending. Fantastic"
  },
  {
    "rating": "3/5",
    "review": "Has its moments, I understand where people come from when they claim this is the best of the 'Disney era' of Star Wars films. But given its self-contained nature, relatively simple premise and how it ends, I think it either lacks characters to invest in, or there simply isn't enough background on all of them to make it feel satisfying. It does feature an excellent score without Williams at the helm, which does its own thing while drawing from the classics you would expect to hear in a movie like this. The cast is generally great. It does its own thing while also doing what it can to connect to the films we all know by now, which usually works within the plot well. Give it a watch if you like the original trilogy and prequel trilogy but are less so keen on the sequels, it is cut from a different cloth."
  },
  {
    "rating": "3.5/5",
    "review": "That ending scene...🤩"
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing and Disney's best thing they've done with the franchise yet. Franchises, I mean rebellions, are built on hope!"
  },
  {
    "rating": "5/5",
    "review": "Yes. Yes. 10 times yes. Amazing."
  },
  {
    "rating": "4/5",
    "review": "This is what every Disney Star Wars movie should have been. A movie crafted by writers and filmmakers who love Star Wars and understand George Lucas's vision. If you've seen Episode IV, you know the characters are going to die, but it lays out a compelling plot and makes you care for the characters. Also, the Vader scene at the end has got to be my favorite part of the movie even if it creates a minor issue with the beginning of Episode IV."
  },
  {
    "rating": "5/5",
    "review": "Fantastic! Up there with George Lucas Star Wars."
  },
  {
    "rating": "3.5/5",
    "review": "first act is fine, second act is okay, 3 act is AMAZING!!"
  },
  {
    "rating": "5/5",
    "review": "A movie that is great and right with \"The Empire Strikes Back\"!"
  },
  {
    "rating": "4/5",
    "review": "La única película digna aparte de las tres mas antiguas. Merece la pena."
  },
  {
    "rating": "4.5/5",
    "review": "I love this movie! In my opinion, one of the best films in all of Star Wars."
  },
  {
    "rating": "4.5/5",
    "review": "A meaningful and emotional story of self sacrifice that's a joy to watch the whole way through. The troubled creation of this movie may have left a few scars on a great film- but I love it nonetheless."
  },
  {
    "rating": "1/5",
    "review": "i did not like this movie"
  },
  {
    "rating": "3.5/5",
    "review": "While I enjoyed this movie a lot, it has more style over substance, way too much nostalgic fanservice, and I only remembered a few of the main characters."
  },
  {
    "rating": "5/5",
    "review": "Easily one of the best Star Wars films ever made."
  },
  {
    "rating": "4.5/5",
    "review": "When you have seen everything that Disney realeased, related to the Star Wars universe, after this movie, Rogue One is still the best movie of this new ST iteration, even though nobody asked for it and the de-aging effects are really distracting."
  },
  {
    "rating": "4.5/5",
    "review": "Definitely the best Disney Star Wars movie out there. If all of them would be like this, then Star Wars wouldn't be a dead franchise right now."
  },
  {
    "rating": "4.5/5",
    "review": "For the first time, apart from maybe in Force Awakens, the magic of Star Wars really feels back. Good direction, drama, laser stuff and more. Rouge One is a win."
  },
  {
    "rating": "4/5",
    "review": "I couldn't believe my eyes when I saw the ending of the movie, a beautiful tragedy of nameless rebels and the start of A New Hope."
  },
  {
    "rating": "4.5/5",
    "review": "This is the best Star Wars movie since Return of the Jedi. The only thing I didn't love was the music. It just felt off in several places. But other than that it's nearly perfect."
  },
  {
    "rating": "5/5",
    "review": "This movie should have a 100% tomatoes score"
  },
  {
    "rating": "3.5/5",
    "review": "Great movie with a strong cast. Last good Star Wars movie made."
  },
  {
    "rating": "4.5/5",
    "review": "a satisfying addition to the star wars saga, giving us more insight into the foundation of the rebellion, with a beautiful story and an amazing roster of incredible heroes. this is my favorite piece of star wars content from Disney, with great pacing and beautiful special effects."
  },
  {
    "rating": "5/5",
    "review": "I'm not a Star Wars fan, but Rogue One is one of my favourite movies. It's time for a rewatch but I remember crying like a baby watching this movie in the theatre. The loyalty and comradery between the characters is what ultimately made this film for me. I love a good friendship <3 The fight choreography was excellent as well. I mean, you've got Donnie Yen in a movie? Of course the fight sequences are gonna be great. I loved seeing him in this science fiction setting!"
  },
  {
    "rating": "5/5",
    "review": "Rogue one is the best SW movie out there. This is the definition of the word Wars in the SW franchise. THIS is Star WARS. This movie is an approach to a mature audience definitely."
  },
  {
    "rating": "4.5/5",
    "review": "The first and one of two \"A Star Wars Story\" movies made by Disney. Rogue One is a fantastic movie that gives context to how the rebellion was able to retrieve the Death Star plans in the original movie. The main stand out for the movie is its fantastic writing from Tony Gilroy. He does a great job at introducing completely unknown characters and making them an interesting part of the story. Jyn Erso, Cassian Andor, Galen Erso and the rest of \"Rogue One\" are intriguing to me. The world-building is very good and introduced us to the world of Star Wars right before the Battle of Yavin. Not only is the writing fantastic, the filmmaking is very good. There are some incredible shots to look at. The cinematography is just very good. The musical score is amazing and the sound design always give me chills. The action is brutal and is something I would love to see more of in Star Wars. Overall, Rogue One is a fantastic entry into the Star Wars universe that tells a beautifully crafted story about the Rebellion."
  },
  {
    "rating": "5/5",
    "review": "Wow, this movie was well made, well acted and actually had excellent story. It expands the Star Wars lore to explain why the Death Star has that strange weakness, gives us an amazing Gold Squad Cameo, as well as great action sequences. Absolutely recommend It's so hard to understand how this movie could be made by the same company as The Force Awakens."
  },
  {
    "rating": "5/5",
    "review": "Joins the original trilogy to become of the best Start Wars productions there have ever been."
  },
  {
    "rating": "5/5",
    "review": "This is a grait Star War movie. Quite better than the disaster of the last trilogy."
  },
  {
    "rating": "3/5",
    "review": "Not sure why everyone loves this so much. It was boring til the last 15 minutes.."
  },
  {
    "rating": "4.5/5",
    "review": "Awesome film. Definitely what Star Wars needs more of."
  },
  {
    "rating": "5/5",
    "review": "This is the best Star Wars movie since 1983, nuff said."
  },
  {
    "rating": "3.5/5",
    "review": "Only good Star Wars movie Disney made"
  },
  {
    "rating": "5/5",
    "review": "Prople got money los of it"
  },
  {
    "rating": "4/5",
    "review": "A well done film that ties the prequel and original trilogies. It respects the source material and fleshes out what the Star Wars universe would have been like during a timulteous time such as this."
  },
  {
    "rating": "4.5/5",
    "review": "Honestly probably the best of the new movies."
  },
  {
    "rating": "5/5",
    "review": "After Andor, and trying to remember my memories back in 2016, Rogue One is such an amazing film. Like, dude, HOW IN THE WORLD is this movie is better than the whole sequel trilogy?!?!? My complaint aside, the groundbreaking story is very complex and executed very well with each pacing, while adding some side characters and bringing Darth Vader to the plot. Truly fitting. 9.5/10."
  },
  {
    "rating": "5/5",
    "review": "This is no doubt one of my favorite movies of all time, it is in fact quite amazing and I would recommend"
  },
  {
    "rating": "4.5/5",
    "review": "One of the best of the newer chapters in the Star Wars universe which is not entirely perfect, but it gives us a fresh and engaging story with particularly good set pieces."
  },
  {
    "rating": "4.5/5",
    "review": "Easily my favorite Star Wars movie! The humor is always on point - K2SO has the most hilarious lines and the plot is really good too. The central cast of characters work really well together, making the adventure very enjoyable. I really like that there aren't any force users in the movie, it makes Rogue One feel distinct from the rest of the Star Wars universe which keeps the movie from just being a rehash of previous movies."
  },
  {
    "rating": "5/5",
    "review": "One of my favorite Star Wars movies. Added more lore between episodes 3-4. It's nice to know what happens in between that and how the Death Star plans were intercepted and explains how it's put into use. Also that final scene with Vader, just badass and ruthless. How he should always be. His power is always implied in other movies, but they showed how powerful he is. Character done justice!!"
  },
  {
    "rating": "5/5",
    "review": "My favorite movie of all time"
  },
  {
    "rating": "3/5",
    "review": "The only okay new star wars film"
  },
  {
    "rating": "4/5",
    "review": "OMG, this movie had me crying so much!!!!!!! Yet it was so great. Let's talk about the acting, Felicty jones as Jyn Erso I just have no words"
  },
  {
    "rating": "5/5",
    "review": "An amazing experience with a well written story and ending."
  },
  {
    "rating": "3/5",
    "review": "Actually a surprise, probably the best of the Disney Star Wars era...not that it took much, since all the others go from passable to really bad. But still enjoyable. I miss Lucasfilm though."
  },
  {
    "rating": "5/5",
    "review": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD good 🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻"
  },
  {
    "rating": "4/5",
    "review": "Its different and same at the same time. Really impressed with the way the handled the transition from the end if this, to the start if A new hope was good. Saddest ending in the star wasr franchise. And giid acting with cool action delivers a very good movie"
  },
  {
    "rating": "2.5/5",
    "review": "I didn't like Rogue One much, but it's certainly improved in the light of the Andor prequel show; however, I still enjoyed Solo much more than R1 and in the end, ESB still reigns supreme as the best Star Wars film. Ultimately, the best live-action Star Wars content is The Mandalorian followed closely by Obi-Wan Kenobi."
  },
  {
    "rating": "4.5/5",
    "review": "it ties the two good trilogies together and has nothing to do with the new terrible one."
  },
  {
    "rating": "3.5/5",
    "review": "Wish I could see the other cut !"
  },
  {
    "rating": "5/5",
    "review": "Als Kritiker gebe ich dem Film volle Punktzahl der Film ist unglaublich der Film ist der beste den Disney rausgebracht hat von Star Wars und dieser Film ist einfach der Beweis wie ultimativ fantastisch Star Wars ist. Egal wie oft ich den Film sehe jedes Mal bin ich ultimativ begeistert und dieser Hype in mir nimmt nicht ab."
  },
  {
    "rating": "5/5",
    "review": "Hands down my favorite Star Wars movie. Finally an interesting and different take on the franchise that does something new with it. I'm so sick of seeing the same movie being made over and over. This one, thankfully, was unique."
  },
  {
    "rating": "5/5",
    "review": "Idk why but I this movie is my favorite one out of all the Star Wars movies."
  },
  {
    "rating": "4.5/5",
    "review": "Watching andor makes me love this movie more The best Disney Star Wars movie besides Mandalorian‘s TV show as one just perfectly fits in to a new Hope 9/10"
  },
  {
    "rating": "5/5",
    "review": "Muy buena. Con mucha acción"
  },
  {
    "rating": "5/5",
    "review": "I've seen this movie well over a dozen times, and will happily see it well over a dozen more."
  },
  {
    "rating": "4/5",
    "review": "The battles in this movie, particulary that of Scarif, is amazing and make up for some odd scenes with subpar acting."
  },
  {
    "rating": "5/5",
    "review": "Best Disney starwars movie for sure. Actually feels like a Star Wars film. Love the characters and after watching andor it all connects nicely!"
  },
  {
    "rating": "5/5",
    "review": "My favourite of all Star Wars films to date. I hope the Character CGI can be revisited in the future, as it is about the only thing that needs attention."
  },
  {
    "rating": "5/5",
    "review": "A great stand alone story in its own right, Rogue One ties up a number of loose ends we didnt realise needed to be tied up."
  },
  {
    "rating": "5/5",
    "review": "This movie is what any other Star Wars movie beyond IV, V and VI should've been."
  },
  {
    "rating": "4.5/5",
    "review": "Best modern star wars movie and right beside the first three ogs"
  },
  {
    "rating": "5/5",
    "review": "Best of em all :) they need to erase the last three films"
  },
  {
    "rating": "5/5",
    "review": "The Dirty Dozen combined with The Magnificent Seven rolled into Star Wars. Definitely the best in recent years, it almost pips Episode IV to the top spot."
  },
  {
    "rating": "4/5",
    "review": "Rogue One is darker and grittier than the other Star Wars projects and I think it works super well. If anything, it's a shame that it had to setup a 40-year-old movie as I think this holds it back a little. The action scenes are very entertaining and while Andor makes me suspect that Tony Gilroy was involved in most of the film's high points it's all in all very good entertainment."
  },
  {
    "rating": "5/5",
    "review": "The best standalone in the Star Wars universe about the story of Jyn Erso joining forces with the Rebel Alliance in their effort to steal plans for the Death Star prior to the beginning of \"A New Hope\"."
  },
  {
    "rating": "4/5",
    "review": "A simple but efficient story, well threaded in the greater lore, served by credible characters and talented filmmaking."
  },
  {
    "rating": "5/5",
    "review": "This film is what all of Disney Star Wars could have been. And after watching Andor, Rogue One is even more fulfilling to watch. Rogue One in essence is a war movie, which is why it is a great Star Wars movie. It uses nostalgia in ways that benefits itself while at the same time not overdoing it and screaming \"fan service.\" That is why, overall, Rogue One is a success."
  },
  {
    "rating": "5/5",
    "review": "I ignore it for long because of a certain trilogy and solo (is ok, but it's like a fix at the end) , I'm not angry simply and deeply disappointed, but I got interested before watching to mock it Andor that I was also ignoring and ...wah !!! I'm blown away in this film, literally blown away, it's a fantastic and engaging one to get even if you don't know \"Star Wars\" !"
  },
  {
    "rating": "4.5/5",
    "review": "Awesome film. Awesome cast. Great origin story and it’s an honor to be able to see this"
  },
  {
    "rating": "2/5",
    "review": "Some great characters and sequences and some bad characters and sequences. A mixed bag, but not the worst thing in the world."
  },
  {
    "rating": "5/5",
    "review": "Up with the best of the franchise. A darker elegant take that closes an obvious plot hole of the original trilogy. With excellent performances and charged action sequences, this film sets precedent for character depth, realism, and tension in the galaxy far far away. Includes easter eggs and throwbacks without obvious pandering."
  },
  {
    "rating": "5/5",
    "review": "One of my most loved Star Wars movies. And to this day I can still watch it over and over again."
  },
  {
    "rating": "4.5/5",
    "review": "Very enjoyable. Watched twice. Last was Nov, 2022. Worthy rewatch someday"
  },
  {
    "rating": "5/5",
    "review": "The best sound editing ever done in a movie!"
  },
  {
    "rating": "4/5",
    "review": "This was a good movie the plot is good the chareters are good K2SO has alot of funny moments the amazing vader scene the battle of Scarif and the sad Sacrfices there is 1 thing I dont really dont like in this movie and that is Saw he dident have to really exsit."
  },
  {
    "rating": "4/5",
    "review": "Great movie and did a fantastic job showing us that Star Wars has more stories that don't center around the Jedi."
  },
  {
    "rating": "4/5",
    "review": "Rogue One is almost perfect as a Star Wars prequel. There are some very minor issues with pacing and dialogue. I removed a star from my rating for the ridiculous fight scene in which a 5ft girl beats up half a dozen trained soldiers in armour with a stick. They flip around as if she's as strong as Superman but she doesn't have the Force and isn't using a powered up weapon. Could use a bit more character fleshing out but the battles at the end are things of beauty, particularly The Scene with Lord Vader at the end. Loved it. Made me really fear the Sith and the Empire like no other Star Wars project before it."
  },
  {
    "rating": "4.5/5",
    "review": "Really great war movie. Good pacing, great humor (and amount of it), good writing. Wasn't expecting much. Got a pleasent suprise :) Worth a watch."
  },
  {
    "rating": "5/5",
    "review": "This is by far the best of the Star Wars stories, back to New Hope and Empire. This is due largely to the casting. Felicity Jones and Diego Luna were simply born for this part. Ben Mendolsohn and Mads Mikkelson push it over the top and do for this movie what Harrison Ford did for the original. This is much darker with more of an adult feel than other movies in the franchise. Having said that, it has its humorous parts that are dropped in at just the right spot and are not juvenile or goofy. The best thing about the movie is the extent to which it draws you into the world of the Rebellion's espionage. That part of the movie is tense, and feels real with real consequences. (People actually die in this one.) This is one that every fan should own. Hopefully we will get more of this in the future."
  },
  {
    "rating": "4/5",
    "review": "Very surprised how amazing this movie is. Making Vader terrifying once again was genius."
  },
  {
    "rating": "4/5",
    "review": "Watching this again for the several times after catching Andor series. It is still one the best made movie in the Star Wars universe"
  },
  {
    "rating": "5/5",
    "review": "Better than the Skywalker saga and that's saying a lot."
  },
  {
    "rating": "4.5/5",
    "review": "Best Disney has to offer"
  },
  {
    "rating": "3.5/5",
    "review": "I like how they're expanding what's to be expected from the Star Wars universe. An espionage thriller set in the Star Wars universe. What more do you need to know?"
  },
  {
    "rating": "4/5",
    "review": "Not what you would expect from Star Wars, but still good."
  },
  {
    "rating": "4.5/5",
    "review": "This story is ultimately unique that really shows that star wars could even go on a grounded route, with no jedi, no lightsabers, just a band of people with sheer will. This opens up for a fresh perspective of star wars with a fascinating and thrilling actions"
  },
  {
    "rating": "5/5",
    "review": "Rogue One is an amazing Star Wars film! It's the best Star Wars film since Empire Strikes Back!"
  },
  {
    "rating": "4.5/5",
    "review": "This movie really was needed to fill in what happened right before a new hope. The story is really consistent and i love the charcters and how they get built. It also showed you more of how terrifying vader is. I think its a really good movie."
  },
  {
    "rating": "4.5/5",
    "review": "Best Star Wars movie behind Empire. I have watched this movie about 10 times....Love it!"
  },
  {
    "rating": "4/5",
    "review": "Rogue One: A Star Wars Story is a memorable installment in the long-running franchise, by delivering an anthology that is not so focused on exposition and dullness, and delivers a rich story containing appealing action sequences and memorable characters,"
  },
  {
    "rating": "4/5",
    "review": "Best Starwars movie since the originals"
  },
  {
    "rating": "5/5",
    "review": "That Vader scene alone was betten than all the Episodes VI, VII and VIII combined.. Simply amazing movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Best of the Disney-era Star Wars movies. Here Star Wars feels like a real war movie, complete with tough moral choices and tragic losses. The cinematography is top-notch, the battle scenes the best since Return of the Jedi and the conclusion is perfect and emotional. It's not without its flaws; character development is often weak, the middle lags, and the numerous easter eggs crammed in are a distraction. But none of these gripes change the fact that this is a tight and effective movie, one that adds a great new dimension to SW canon."
  },
  {
    "rating": "3.5/5",
    "review": "I wasn't moved by Rogue One in the same way that I am by very good movies. It featured far too much forced humour, perhaps to make up for the gloom and melancholy it contained. I also thought the music was too bland for my tastes; once again, it didn't appear to convey many emotions with the film and sounded generally too light, at least to my ears."
  },
  {
    "rating": "5/5",
    "review": "One of the best SW stories ad movies. Direction, cast, storytelling - amazing."
  },
  {
    "rating": "4/5",
    "review": "A rare gem from Disney Star Wars. While most of Disney's attempts at making Star Wars was very underwhelming; \"Rogue One\" is actually one of the few that actually is worth watching. This movie definitely sets the stage nicely for the events leading up to \"A New Hope\". Definitely worth to watch. The only other Star Wars from Disney that I would suggest next to \"Rogue One\" is the tv-series \"The Mandalorian\". Sadly everything else that Disney has produced is pretty much trash in my opinion."
  },
  {
    "rating": "4.5/5",
    "review": "A beautiful story that just so happens to be a Star Wars film."
  },
  {
    "rating": "5/5",
    "review": "Oh, best Star Wars movie in my opinion. So so amazing, it fit so well into the Star Wars universe. And the best part for me was that they made it realistic, and didn't throw in a happy ending to make it nice. No, plot armor wasn't a thing here. I loved it. Wish i could give it more stars."
  },
  {
    "rating": "4.5/5",
    "review": "This right here is true Star Wars. It has minimal fan service, enduring characters, and an interesting plot. This is one of my favorite Star Wars movies, and even just one of my favorite movies. If you're a Star Wars fan this movie is a must watch, and if not, I would still recommend it."
  },
  {
    "rating": "5/5",
    "review": "Arguably the best Star Wars movie."
  },
  {
    "rating": "4.5/5",
    "review": "this is how you modernize Star Wars, not with bloody lens flares and shaky cams and action in every 10 mins. anyways taking .5 of because everyone is killed but I know why they did it but still. I loved them."
  },
  {
    "rating": "4/5",
    "review": "One of the better SW universe movies."
  },
  {
    "rating": "4.5/5",
    "review": "Without a doubt best Star Wars movie since Empire Strikes Back"
  },
  {
    "rating": "5/5",
    "review": "I love this fine. And it kind of answers your questions as a prequel"
  },
  {
    "rating": "5/5",
    "review": "Likely the best and most enjoyable of the modern day Star Wars films so far, maybe with SOLO being the only other with the caliber of the originals."
  },
  {
    "rating": "4.5/5",
    "review": "best movie in Disney production, really enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "Great acting all around from the entire cast. One of the very best Star Wars movies. Really puts the war in Star Wars. Great climax, followed by a great anti-climax with Darth Vader's best scene in the entire film franchise."
  },
  {
    "rating": "5/5",
    "review": "Loved it , better then the sequels forsure"
  },
  {
    "rating": "2/5",
    "review": "This film tries to do something different with the Star Wars mythos, which I give it credit for. I totally see that a film focusing on the rebellion part of the Rebel Alliance might be cool. Unfortunately, the story and characters fall flat in this one. Honestly, I don't care about any of them by the end and don't even know most of their names, which means their sacrifices mean nothing to me. And I won't even mention how bad the main character is or the fact Darth Vader's couple appearances overshadow everything she did. The sad truth is this movie is just meh."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing graphics and great action!"
  },
  {
    "rating": "2/5",
    "review": "Finally saw this for the second time. This isn't a bad movie, but it's not good. They call it a Star Wars movie, but it's only that because of the over the top amount of fan fair. The entire movie played on the fact, hey, I know that person or have seen that ship before. Characters were awful and boring and because you already know the outcome, I didn't care about a single one of them. Better luck next time Disney."
  },
  {
    "rating": "4/5",
    "review": "best star wars movie after the 6th. all movies after are garbage"
  },
  {
    "rating": "3.5/5",
    "review": "Full disclosure. Not a huge Satr Wars fan, but I really enjoyed this one. The story was excellent and I think this was the last good SW movie before Disney opted to destroy the franchise."
  },
  {
    "rating": "5/5",
    "review": "The best spin off movie ever. Better than episodes 7, 8 and 9 of star wars."
  },
  {
    "rating": "3.5/5",
    "review": "I'll admit I've never been one especially keen on Star Wars films. I have seen a couple previously but I can't claim to have fully followed the plot intricacies. I heard this film was recommended, even to non-Star Wars fans, however, so I decided to give it a go. Its certainly not a bad film - its reasonably tense and atmospheric at times and it is somewhat gripping as well, with good chase scenes. There's a decent cast present too, including Forest Whitaker and Mads Mikkelsen, among others. Its pretty entertaining and I thought the special effects were well done but its very much a sci-fi film and the plot is somewhat complicated. I'm pretty s ure you can enjoy it, even if you don't pay much attention to every last plot point, however. Its not the sort of film I think I'd want to watch again but its certainly a good film and so I'd say its worth seeing if it interests you, or if your a sci-fi fan, then yes I would recommend it. I can think of worse ways to spend a little over 2 hours, though it isn't exactly greatly meaningful or memorable, its definitely not bad either and does a good job of keeping the viewer entertained, even if said viewer may not be entirely sure of everything going on. Sometimes escapism is all thats needed in a film, especially these days."
  },
  {
    "rating": "4/5",
    "review": "Very Good Action Sequences and Very Good Cinematography Overall with Very Good Special Effects. The soundtrack was phenomenal as well. The movie had a good pacing as well. The plot is easy to follow as well. My main problem consistently throughout this film was outside of the main protagonist to a degree I felt every single character in this was very generic lacking any real identity or charisma. It felt like the writers didn't feel there was a need to flesh these characters out hardly at all because they all suffer the same fate but that isn't an excuse for lazy writing. And because of that that is why the acting also feels like its nothing special either. The actors aren't given much to work with except be likeable and accouple of quirks that are I guess meant to substitute for personality. Acting and the Characters were the main problems I had with this consistently. And it really starts to weigh the longer things go on. But still every other element is very well done especially a very well done action packed ending. This is a classic of its franchise and if your a fan of Star wars you'll like it it is definitely worth at least one viewing but this isn't anywhere near the quality of the original trilogy because of the lack of rich characters."
  },
  {
    "rating": "5/5",
    "review": "Quite literally the best Disney Star Wars movie! I forgot how good this movie was, watching it through the 2nd time. Phenomenal ending!"
  },
  {
    "rating": "3.5/5",
    "review": "Above average for sure, better than new movies."
  },
  {
    "rating": "5/5",
    "review": "Rouge One is the best Star Wars story ever."
  },
  {
    "rating": "1.5/5",
    "review": "The robot was pretty anoying but overall it was better than the sequals. Not very high of a achievement however."
  },
  {
    "rating": "4.5/5",
    "review": "The Best Star Wars movie Disney ever produced! Probably the only good star wars movie Disney made."
  },
  {
    "rating": "3.5/5",
    "review": "These movies are just not as fascinating as they used to be. It was good. Special effects are great. Not a fan of the acting."
  },
  {
    "rating": "5/5",
    "review": "2nd best Starwars film after Empire."
  },
  {
    "rating": "5/5",
    "review": "Loved it as much as I always have. One of the best Star Wars movies and looked great on IMAX."
  },
  {
    "rating": "5/5",
    "review": "simply put, the best starwars movue since disney took over!"
  },
  {
    "rating": "4.5/5",
    "review": "Story a little confusing at the beginning but once the plot settled it was a Lot of Fun! Continuous, Epic Action constantly that never seemed to stop. Fun movie a Entertaining way to spend an Evening!"
  },
  {
    "rating": "5/5",
    "review": "Quietly one of the best Star Wars movies ever made. Excellent story woven perfectly into the existing Star Wars movies. Helped make up for the disappointment of the new trilogy."
  },
  {
    "rating": "5/5",
    "review": "Rogue One is hands down, the best Star Wars movie in the Disney era and is on par with the quality of the original trilogy. Everything from the cast, the overall/original storyline and character progression is exceptional. Even small wins, like opening the shields, felt so significant in this movie and for the first time, the feeling of dread and terror was ever presence. The cast/characters - particularly in the second half of this film - were so likeable because of their arcs and genuine bravery. There was no plot armor, no character was safe from demise, yet, they sacrificed everything for information that gave them nothing more than a mere chance of survival. The closing Vadar scene also culminated the quality of cast and story. The extras who played the Rebels put in such an incredible performance during that final scene. The feeling of sheer horror when Vadar's lightsaber shone was totally unlike anything I'd felt while watching a movie. The \"LAUNCH\" scream from one the rebels highlighted how terrifying and evil Vadar had become. It also gave 'A New Hope' so much more meaning which is quite a feat. They HAD to succeed in their mission after the Rebels gave up their own lives to get the Death Star plans. Jyn was perfectly cast and an example of how to write a strong female character. She was so easy to like, her script was brilliant and she was the consummate hero. Jyn was arguably the most important \"side story\" (for lack of a better term) in all of Star Wars. This is an absolute must watch for all Star Wars fans. 11/10"
  },
  {
    "rating": "5/5",
    "review": "Easily the best new SW movie and one of the best SW movies in general."
  },
  {
    "rating": "3.5/5",
    "review": "For a Star wars fan it like a return to the classics wich the new trilogy couldnt make ,the rouge one is good stand alone star wars film."
  },
  {
    "rating": "5/5",
    "review": "It was a story that fit right where it should be. It was original. I believed the acting and it drew me into the story. And, more importantly, it wasn't a rehash of another story in the Star Wars universe. Definitely must watch"
  },
  {
    "rating": "4.5/5",
    "review": "One of the best Star Wars movies out there! Took awhile to build up, but I loved the ending!"
  },
  {
    "rating": "4/5",
    "review": "a really really solid movie, a lot of care was put into this movie and i truely commend disney for this movie its great visuals are great the story is great but if you get bored quickly this movie isnt for you as the first half is meh while the second half is truely phenomenal hope they dont ruin cassians story in andor"
  }
]