[
  {
    "rating": "3.5/5",
    "review": "I like it. A little character development for the Captain America and Red Hulk. But too bad the super villain just surrendered like that."
  },
  {
    "rating": "3/5",
    "review": "Captain America:Brave New World is a fun movie despite having many plot holes in its story telling."
  },
  {
    "rating": "3/5",
    "review": "I don’t dude it was just a solid three"
  },
  {
    "rating": "0.5/5",
    "review": "IT WAS MID AF and the Red Hulk and The Leader were wasted"
  },
  {
    "rating": "2/5",
    "review": "Sorry, Chris Evans is Captain America. Just isn't the same without him. It had it's moments, but they were few and far between. Definitely not on my list of MCU watch again titles. Once was enough."
  },
  {
    "rating": "2/5",
    "review": "Seeing Harrison ford into a Hulk that detransforming was just unsettling and the story was just kinda boring. Decent special effects but just alight."
  },
  {
    "rating": "1/5",
    "review": "Couldn’t recommend this movie any less."
  },
  {
    "rating": "2.5/5",
    "review": "Just the average sci-fi movie not bad. But not the blockbuster you'd expect from marvel."
  },
  {
    "rating": "2/5",
    "review": "Overall, it seems like a money-making machine implemented without any joy in doing it. This can bee seen in especially in the poorly written dialogue and unnecessary scenes."
  },
  {
    "rating": "0.5/5",
    "review": "It looks like a patchwork quilt."
  },
  {
    "rating": "2.5/5",
    "review": "you would think with all of the cool characters it would be a good movie but I think it is just too much the plot of the movie goes nowhere it would have been a better movie if the characters actually had a character arc but they don’t. I feel like they were only in the movie to make the trailers look good. go watch thunderbolt instead way better character arcs in that movie"
  },
  {
    "rating": "3.5/5",
    "review": "Solid movie. Helps Marvel continue correcting course after the disastrous Chapek COVID era"
  },
  {
    "rating": "3/5",
    "review": "Anthony Mackie cannot save a slapped together Marvel movie. Director Julius Onah’s Marvel superhero spy thriller Captain America: Brave New World (2025) is quite average. Anthony Mackie is actually apt for this new take on Captain America with Falcon’s wings, but his solid acting cannot save an awfully generic script. Mackie’s earnest approach held my attention and earned my respect for his touching conversations with Carl Lumbly, Sebastian Stan, Harrison Ford, and Danny Ramirez in the grounded scenes. The dramatic scenes are where Anthony Mackie gets to shine the most. Brave New World is not as bad as I thought it’d be, but it’s hardly a standout among the entire MCU. Julius Onah’s direction lacks any real style visually. I appreciate him trying to give Captain America some heart and trust in himself that he’s worthy of the shield. The action direction is decently exciting for the Red Hulk fight and when Cap is flying. These are easily the most entertaining parts of Brave New World. It is strangely not even about Captain America entirely as it’s more a direct sequel to The Incredible Hulk, but without The Hulk. Also it directly references The Eternals’ Celestial Island remnant as well as Falcon and the Winter Soldier, so it feels very disjointed and irrelevant. Who was this for? Honestly, because as someone who wanted to give Anthony Mackie’s Falcon taking up the mantle of Captain America, this movie fails him. He’s clearly trying to be cool, calm, commanding, funny, sincere, and reasonable with a compelling performance. But, he’s been thrown a tossed together Marvel movie. Writers Julius Onah, Peter Glanz, Rob Edwards, Malcolm Spellman, and Dalan Musson craft a very predictable spy narrative for Captain America to uncover. I wish this movie focused more on Falcon and Sabra’s emotional stories and character arcs rather than this mind control espionage mystery. It’s not much of a mystery considering producer Kevin Feige already spoiled that Harrison Ford’s President Ross is Red Hulk in the marketing. Why even make this movie? I would have liked to see this story just following Mackie as Captain America finding things out without his terrible new Falcon partner. Brave New World had potential to be pretty cool, but just ends up as a middle of the road Marvel movie that has clearly been hacked and slashed by the editors due to producer notes. Anthony Mackie is a pleasant surprise as Sam Wilson with his sincere side showing. He makes for a strong, yet vulnerable Captain America. Mackie gets when to be funny and when to bring some gravitas for the serious scenes. He’s obviously the standout here. Danny Ramirez is pretty obnoxious as the wise cracking Joaquin Torres the new Falcon. He gets a great emotional scene with Mackie in the end though. Carl Lumbly is really wonderful as Isaiah Bradley, especially since he feels like a father figure to Mackie’s Sam Wilson. He brings a lot of depth, gravitas, and emotional resonance to Brave New World. Sebastian Stan’s cameo as Bucky the Winter Soldier is heartfelt and amusing alike. He’s so much more mature than many of Marvel’s actors, so he’s always a welcome sight. He later really kills it as Bucky in Thunderbolts. Shira Haas is alright as Ruth Bat-Seraph, but her ex-Black Widow Sabra feels tagged on here. She clearly was supposed to be in a much larger role before the rewrites. Her fights are fun, but I wanted more out of her scenes with Mackie, if she was here at all. Like she just leaves to go to a baseball game with Isaiah at the end. Xosha Roquemore is pretty good as Secret Service agent Leila Taylor. She just seems like good trusted friends with Sam, but she should have been a romantic interest as well! What were they thinking? Giancarlo Esposito is fairly fierce and memorable as Seth Voelker’s Sidewinder. He seems interesting as a physical opponent for Sam’s Captain America. Liv Tyler gets a sweet cameo as Betty Ross, but her being here just reminded me that Mark Ruffalo really should have been cast in this too. Tim Blake Nelson is fine as Samuel Sterns, but he’s supposed to be super smart and just does a fairly basic evil scheme. He’s clearly not the real threat once we see Red Hulk and Sidewinder. His after credits scene is bad and did not get me excited for Doomsday or Secret Wars. Harrison Ford is excellent as the furious and forlorn President Thaddeus “Thunderbolt” Ross, who is also Red Hulk. Ford gives Ross some needed humanity and empathy. I found him quite compelling. Takehiro Hira sadly only gets a bit part as Japan’s prime minister Ozaki. Editors Matthew Schmidt and Madeleine Gavin jump around all over the place with frantic cuts that ruin some of the action and make the dialogue heavy scenes feel confusing. Cinematographer Kramer Morgenthau shoots Brave New World like a television episode with not very cinematic. The close-up shots were the only emotionally engaging ones. The action is shot so far away sometimes it was hard to see what Captain America was doing exactly in these fast flying skirmishes. The CGI sets are so awful, but the visual effects for Red Hulk look awesome at the very least. I like Captain America’s wings a lot. The stunt team provide some cool close quarters combat choreography, but it’s all been done before better in previous Captain America, Black Widow, and Shang Chi fights. Composer Laura Karpman’s movie score starts out forgettable, but has some killer themes during the Captain America versus Red Hulk fight as well as the tender music during the heartfelt conversations towards the end. Sound designers Willie D. Burton, Christopher Boyes, Coya Elliott, and Lora Hirschberg record clear voices, but far too quiet oddly. I was struggling to hear people speak even with the volume turned up very loud. Costume designer Gersha Phillips came up with a neat new red, white, and blue design for Captain America in the style of Falcon’s armor. The suits all look neatly tailored. Overall, Captain America: Brave New World is at its best when Anthony Mackie gets to be a Marvel superhero on screen. This veers off to too many side characters too often for my taste, but Mackie leads the fray with a surprisingly emotionally honest performance, steadfast leadership, and some hard hitting action moves."
  },
  {
    "rating": "3/5",
    "review": "Marvel cookie cutter movie not much to talk about with this one"
  },
  {
    "rating": "3/5",
    "review": "This movie lacks a lot in terms of character depth and story but the action scenes,Harrison Ford and Anthony Mackies characters are what makes this movie good.Not a bad movie but a flawed one."
  },
  {
    "rating": "0.5/5",
    "review": "Not sure what to tell people when thay ask about captain America Brave New World? how about! it felt like he was trying to be Steve Rogers by helping his friend who had been set up for a crime, just to find out it wasn't about him at all. Lacks the ability to excite with tasteless actors who just didn't give it one hundred percent, not only does it take away the ability to introduce a character early but instead falls short with every aspect of its timely demise. Sincerely, The upset Critic."
  },
  {
    "rating": "5/5",
    "review": "Was amazing loved it"
  },
  {
    "rating": "1/5",
    "review": "Stupid & boring. Another Marvel misfire."
  },
  {
    "rating": "3/5",
    "review": "I liked it. I like captain American"
  },
  {
    "rating": "3/5",
    "review": "It was average, better than captain marvel and Thor love and thunder. Red Hulk was the highlight."
  },
  {
    "rating": "3.5/5",
    "review": "Going into Captain America: Brave New World, I genuinely hoped for something more impactful—especially considering the weight the title carries and the expectations set by the trailer. What we got, though, was a film that’s neither terrible nor particularly great—just somewhere in the middle, floating in the murky waters of missed opportunity. It's not so terrible that it's not watchable at all, but it's also not very good, and the end leaves you feeling like you haven't bend told the entire story the way it was supposed to be said. The biggest issue, for me, is the pacing and structure. The plot feels disjointed, almost as if it’s rushing through key moments without letting them breathe. Watching it felt like someone hit the 1.5x speed button; scenes jump from one to the next without proper build-up or payoff. It’s as if a crucial 30-45 minutes of connective tissue were cut from the final edit—scenes that would have helped everything make more sense and resonate emotionally. There are glimpses of something bigger, something more meaningful, but those moments are never fully realized. The movie feels like it should be a major installment in the MCU—especially from the scale promised in the trailer—but in reality, it lands somewhere closer to a mediocre episode of a Marvel show than a cinematic milestone. In the end, Brave New World isn't a disaster, but it also doesn’t live up to the legacy it's meant to continue. It had the pieces to be something truly memorable, but they never quite come together in a satisfying way. Overall, to put it simply: \"The movie is barely worth a watch\", but it's not entirely broken."
  },
  {
    "rating": "1.5/5",
    "review": "Yeah.. this really weren't good at all, the acting, the cheography, the story, the villains very poor. Top 5 worst marvel movies"
  },
  {
    "rating": "3/5",
    "review": "Built up but failed to live up to expectations, wasn't the worst marvel movie but felt like a stop gap for the bigger picture.. many characters poorly used considering there stature in marvel.. Did enjoy the hulk being the angry character he is but craved more from the scenes provided.."
  },
  {
    "rating": "1.5/5",
    "review": "Stupid, trite, sappy, corny, I’ve seen soap operas that were less schlocky. What a waste of digital storage space."
  },
  {
    "rating": "4/5",
    "review": "Great acting. I wish there was more action but overall great movie"
  },
  {
    "rating": "3.5/5",
    "review": "7.2/10—wildly disappointing. Really poor effort to ring in the new era of Captain Sam"
  },
  {
    "rating": "1.5/5",
    "review": "Marvel somehow has figured out a way to make a lot of stuff happen in a movie and make it all feel completely inconsequential."
  },
  {
    "rating": "2.5/5",
    "review": "Pretty cheesy, bit of a struggle to make it all the way through - weak story, weak villain, overly complicated, action scenes were also somehow not very engaging. Meh."
  },
  {
    "rating": "3/5",
    "review": "Anthony Mackie was great, in fact he did fantastic with the script he’s been given. I would say this is his best performance aim the mcu so far. The few action scenes we are given might have been short (way too short even), but goddamn were those wakandian wings cool. I truly wish the sequence in the air with new falcon were longer. As for the story- yeah, not so good. It started off interesting with Isaiah and the mystery of what was going on with him, but it really lacked in the unraveling and the reveal. Especially cause we already knew Harrison was the red hulk. All in all, Anthony is a promising captain America, but I hope if he gets another movie they get better directing."
  },
  {
    "rating": "2/5",
    "review": "You need to have Disney+ to have any remote idea on what is happening. when the movie started I was somewhat lost as to what the f was happening. On top of that the movie felt rushed and had no grip on what it wanted to be, and having two stories in it at once. Although the fact that there was more than one super soldier really intrigues me. But overall marvel please figure out what you're doing, please."
  },
  {
    "rating": "1/5",
    "review": "The worst movie I’ve seen in theater in 5 years lol. New record for me"
  },
  {
    "rating": "3/5",
    "review": "Not the worst movie I've seen, but definitely a bit thin. Could have been done better with a short season or three episode TV show. Definitely not up to being a stand along movie."
  },
  {
    "rating": "3/5",
    "review": "El Hulk rojo, excelente, pero me sigue faltando un poco del nuevo capitán América, se siente inseguro y triste todo el tiempo"
  },
  {
    "rating": "2.5/5",
    "review": "It wasn’t as good as I thought it would be..it was ok.. could have been better"
  },
  {
    "rating": "3/5",
    "review": "The Brave, The New, The Messy Captain America: Brave New World had all the potential to soar — but somewhere between reshoots, script rewrites, and character redesigns, it stumbled through turbulence. It still looks good (thank you, Marvel budget), but under the hood? It’s basically Civil War 2: No One Believes My Super Friend Again. Let’s be real — Sam Wilson is an amazing Captain America. His suit? Clean. His presence? Powerful. But his character arc? Kind of left hanging in the wind while Ross got the spotlight (Marvel, why you out here doing Red Hulk PR in the trailers like it's a birthday surprise we didn't ask for?). The action’s solid, the vibes are decent, but the heart doesn’t hit as hard as it should. I was torn between a 2.5 and 3, but Sam’s representation matters. So yeah — 3/5. A good movie that could’ve been a great one if it got out of its own way."
  },
  {
    "rating": "3.5/5",
    "review": "Important watch for the setup of the MCU going forward."
  },
  {
    "rating": "3/5",
    "review": "It was ok, might not watch it again"
  },
  {
    "rating": "5/5",
    "review": "Is a good movie. Is good more what spider man homecoming and far from home, avengers age of ultron and thor ragnarok in special you are fan od movies od the marvel studios"
  },
  {
    "rating": "1.5/5",
    "review": "Makes you miss the first Captain America movies ... Very little efforts put into the scenario/dialogs, it just seems to be an interlude movie here to advance the story enough for the next proper Marvel movie"
  },
  {
    "rating": "1.5/5",
    "review": "Dull, uninteresting plot. Boring, unconvincing action. Completely uninteresting characters. Just could not get interested in anything in this movie that was about an inch deep. Seemed like an AI generated script. At best, something you could have on in the background while doing something more interesting."
  },
  {
    "rating": "1.5/5",
    "review": "After all these years this was the best story they could come up with? The new Captain America definitely deserved so much better. One of the worst antagonist ever created."
  },
  {
    "rating": "2.5/5",
    "review": "Lacking anything interesting to speak of...just dull."
  },
  {
    "rating": "4/5",
    "review": "Anthony Mackey brings a new special flare to the role of Captain America. I know a lot of people are not a fan of this movie, but I personally recommend it for anyone who wants to see just how far superhero’s have come in the MCU. Harrison Ford is also a bright new addition to the MCU franchise and I cannot wait to see more of him."
  },
  {
    "rating": "5/5",
    "review": "The best ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "1.5/5",
    "review": "I was disappointed to be honest I came out of the cinema confused with what I’d just watched and had a sour taste left in my mouth, i don’t know what was wrong but it was just wrong."
  },
  {
    "rating": "4/5",
    "review": "マーベルは確実に新時代に突入した 私はこの作品の雰囲気やキャラクターカラーが気に入っています！"
  },
  {
    "rating": "4/5",
    "review": "Good action. Anthony Mackie does a nice job."
  },
  {
    "rating": "4/5",
    "review": "To be honest my hopes for this movie weren't very high, but Anthony Mackie and Harrison Ford did GREAT at carrying the story and emotion. I felt it was pretty well paced and there wasn't too much unnecessary fluff. CGI could be better in some parts, but still overall fantastic. I think it is a great addition the Captain America franchise"
  },
  {
    "rating": "1.5/5",
    "review": "Boring film, with characters without development and dull, rhythmless choreography."
  },
  {
    "rating": "1/5",
    "review": "This was an incredible boring film, way too long and too much bad acting."
  },
  {
    "rating": "2/5",
    "review": "Unfortunately, continuing the lull after Endgame. I do like Anthony Mackie, hope he has more opportunities to shine as Sam Wilson."
  },
  {
    "rating": "1/5",
    "review": "Marvel really hit rock bottom with this one …"
  },
  {
    "rating": "2.5/5",
    "review": "Very bland. Nelson steals scenes though"
  },
  {
    "rating": "3/5",
    "review": "Good action, nice thriller style but the story is a mess"
  },
  {
    "rating": "2.5/5",
    "review": "This movie felt way to long. I have a hard time still connecting with Sam as the new Captain America. The movie felt to long and honestly it isn't even a Captain America movie. It is more an incredible hulk sequel than anything else."
  },
  {
    "rating": "1/5",
    "review": "Without a doubt, the WORST Marvel movie and I’ve seen them all. The plot was lame and predictable CGI was awful and from the start I just wanted it to end. Put a shame to Chris Evans captain America’s name. Waste of time. Don’t waste your time or money if I could go back and not watch it, I would. It was that awful. I only finished it because I was so excited to watch it with my friend and he made me finish it because he didn’t want to watch it knowing it wouldn’t be good, but because I wanted to we did and I wouldn’t even give this 1 star if that were an option"
  },
  {
    "rating": "2.5/5",
    "review": "At the end of the day, it’s a retelling of Captain America: The Winter Solider. It’s becoming apparent that Marvel is reusing plot lines and just swapping characters."
  },
  {
    "rating": "3/5",
    "review": "Fun ride CGI could have been better."
  },
  {
    "rating": "0.5/5",
    "review": "Malísima, personajes muy desaprovechados, no sé a quien de los escritores se les ocurrió tremenda estupidez que una persona sin ningún poder pueda vencer a Red Hulk, simplemente las botas del capitán america le quedan ENORMES a Sam Wilson."
  },
  {
    "rating": "5/5",
    "review": "I personally liked the movie. I think Anthony is a better cap than Chris, and no one can convince me otherwise🤫 the combat scenes were great, when I watch these movies the quality of combat scenes is the top most things that's important to me. Regardless of what anyone says, the movie was nice!"
  },
  {
    "rating": "3.5/5",
    "review": "Captain America: Brave New World brings a gritty, grounded energy back to the MCU. It’s got tension, heart, and solid action—and Sam Wilson holds it down as Cap. If you’re into real stakes and less CGI noise, this one delivers."
  },
  {
    "rating": "3.5/5",
    "review": "After so many rumors about reshoots, problems behind the scenes and terrible reactions at test screenings, my expectations for this film were quite neutral, which probably contributed to my reaction to it actually being more positive than I thought it would, even with its notable flaws. Sam Wilson (Anthony Mackie) really convinced me of his merit as the new Captain America, not copying the mannerisms of Steve Rogers and, at the same time, honoring the essence of the shield, both during the fights and the dialogues. I'm happy that the writers didn't simply copy his arc from the series 'Falcon and the Winter Soldier' (2021), even if they weren't very creative. Mackie's performance is great, but nothing particularly new. The highlight goes to President Thunderbolt Ross (Harrison Ford). Ford adds so many complex layers to this character, turning what was a somewhat generic villain into the coprotagonist of this story. About the supporting characters: Joaquin Torres (Danny Ramirez) as the new Falcon plays basically the same role as Sam himself in 'Captain America: The Winter Soldier' (2014) — more on these similarities later — while Isaiah Bradley (Carl Lumbly) serves mostly as a plot device to motivate the heroes. This trio (Sam, Joaquin, and Isaiah), though has little screentime, has also great chemistry. The same can't be said about Sabra (Shira Haas), a character that wasn't favored by the script (which took away everything that made her special in the comics and turned her into a carbon copy of Black Widow), nor by her actress, who delivers a very poor portrayal. When it comes to the script, I must say, it isn't very inventive. If you've watched 'Captain America: The Winter Soldier' prior, you may have noticed that this new film is, in many aspects, a worsened version of it — which is probably more than a frustrating coincidence. Never the less, it's a functional script that has its nice moments and successfully incorporates many elements of movies from the Marvel Cinematic Universe (MCU) that for years hadn't their consequences addressed, such as 'Eternals' (2021) and 'The Incredible Hulk' (2008), working as a spiritual successor of that last one (just with no Hulk...). Anyways, the atmosphere of espionage and of political intrigues still works fairly well. About the antagonists... well, The Leader (Tim Blake Nelson) is the great criminal mind behind all of this, and I kind of liked the way they handled his character, even though, as the movie progresses, his menace slowly becomes less threatening (the fact they ignored his mental powers works in favor of that feeling). On the other hand, the SERPENT Society, led by — had to look up his name — Seth Voelker (Giancarlo Esposito) has a terribly wasted potential and is completely forgettable. Once again, the spotlights are pointed to President Ross, who dazzles all the way through, specially at the end as Red Hulk, even though he is defeated too quickly. As for the technical production, this movie has good settings and great digital effects, with the exception of some brief scenes, a refreshing news considering the questionable quality of some of the CGI from the most recent products of Marvel Studios. The action sequences, in general, are just as excellent — notably, the last one is the best of them all (what a fight!). With all of that said, 'Captain America: Brave New World' is a good action film: besides not innovating and following an old formula from its studios, works well as so and integrates some important storylines for the MCU's future. It isn't particularly remarkable, but for someone looking for a nice and short adventure, it is very welcome. (3.5/5) Note: There's one post-credit scene at the end, but i found it to be kind of unnecessary as someone who already knows about the next great Marvel event coming soon."
  },
  {
    "rating": "3/5",
    "review": "It's okay not super original; some plot point and decision are quite interesting. Fun movie to see on Disney+."
  },
  {
    "rating": "2.5/5",
    "review": "Moved the MCU forward well, but that doesn’t make a good film or even a good movie."
  },
  {
    "rating": "2.5/5",
    "review": "I found it very hard to get invested into this film, but that seems to be the trend with a lot of marvels recent products, it has cool an engaging scenes"
  },
  {
    "rating": "1.5/5",
    "review": "Eh. . . Marvel lost the thread. . . Disney sucks"
  },
  {
    "rating": "2/5",
    "review": "Just watched, my one word review- Ew."
  },
  {
    "rating": "4/5",
    "review": "It's nothing super special, and certain aspects of the movie did not make sense, but overall I was entertained throughout."
  },
  {
    "rating": "3.5/5",
    "review": "Rating: 7/10. 72/100"
  },
  {
    "rating": "4/5",
    "review": "Extremely exaggerated hate this is solid action movie no problems at all enjoy with your family people really follow the crowd with that hate . Ham packed action from the start"
  },
  {
    "rating": "4/5",
    "review": "A lot of great action, Sam Wilson is a great Cap - but this really should have at least included Hulk given how central it was to Hulk's movie."
  },
  {
    "rating": "3/5",
    "review": "It's ok but given the pedigree of the trilogy that followed that's a major downgrade. Everything about it is just mediocre all around honestly. First off Mackie is ok but he just doesn't have the charisma of a leading man. The other characters around him just aren't that interesting either. the New Falcon, his mentor, the forgettable villians, nothing really helps make him more interesting or have chemistry to bounce off of. Ford isn't bad and probably is the best thing here. His weakest moments are when he's just a plot expose tool and his strongest is when he's given real character to work with. The cinemtography is so basic at times. Dull medium shots galore, some of the aciton scenes are cool when they are practically done but others like the Red Hulk fight are just alright and the CGI shows quite a bit. For such an expensive film the effects don't really show honestly. None of it is terrible but none of it is that special either. Some look better than others. the opening fight was cool and probably the best scene. Another big issue is the opening is good and probably the first 15 minutes or so it's the strongest. But the moment we got to the White House it really falls off. It becomes very unfocused at times but never convuluted. There is like 3-4 plot lines going on. The 2 villians neither of which is that special at all, the international tensions with Japan, Ross & Wilsons developments, all of it just feels very scattered but to it's credit it works enough to be passable storywise. It can look like also this has 2 different films at times too style wise. To it's credit also it does fall off quite a bit at first but it finds bottom and just kind of holds steady the entire way after just humming along. For such a troubled development the end product is passable for what it's worth but that's still a major con. Skip This. Could've been worse I guess."
  },
  {
    "rating": "3/5",
    "review": "The movie isn’t bad. It certainly isn’t great either. I did enjoy the film nonetheless!"
  },
  {
    "rating": "4.5/5",
    "review": "I love captain america and love how they are following the comics with Sam taking the shield after Endgame! I see a lot of people hate on this movie and I really don’t understand why. My only complaint is that at some portions of the movie the CGI was a little spotty and stood out of place. But other than that, the movie was outstanding and I can’t wait to see Sam’s cap be in future movies like Doomsday!"
  },
  {
    "rating": "2/5",
    "review": "The Winter Soldier would’ve been a better choice for a Captain America. This was another dud from Marvel. Falcon does possess the strength, nor the equipment to justify a challenge for a hulk. Taking a punch on the shield would’ve blown his legs away. It was a waste of money, time, no rewatchability material, will not own even at $4.99."
  },
  {
    "rating": "3/5",
    "review": "The mvoe was great and I really liked it but I just don't like how they show Sam as super strong, when he never got the super soldier serum and there were moments were I'm sure he would have gotten severely injured or even died because a normal human wouldn't have been able to survive such things"
  },
  {
    "rating": "1.5/5",
    "review": "What even is this nonsense... should have canceled this"
  },
  {
    "rating": "3.5/5",
    "review": "I know Captain America: Brave New World is the first Marvel movie of 2025. But I have to be honest my expectations were not super high. Even so, I was excited to see it. For the simple fact that this would be the first Captain America movie since Avengers End Game. Anthony Mackie’s official first feature film as Cap. I was more intrigued to see how or if they would connect this movie to Falcon and The Winter Soldier series. Read Full Review @ ajwallacereviews.com"
  },
  {
    "rating": "3/5",
    "review": "This is a movie that suffers from marketing and creative not being on the same page. I don't want to post spoilers, except the commercials are one big spoiler. The commercial show a climactic battle scene where it is clear who both the participants are, but the movie tries to build suspense as to what is happening to one of those characters. Nobody seems to know what's going on, but we the audience know. We saw the commercials. And it's not played as a hey audience you know what's going on and the characters don't. It's played like they're trying to build suspense and make it a mystery. A mystery that we saw in the commercials. It's hard for the movie to overcome that huge problem and become more than just a fun way to kill 90 minutes. On the good side, the interaction between Captain America and Falcon are amazing. It's a little disappointing that there's no reason why no other former Avengers come to help Captain America, I'm not saying they should have, but there should be a reason given why they don't. So I'm hopeful for another outing that's better, because the actors did a fine job, and there were some really good scenes, but overall the plot did not live up to the standard of the top third of Marvel films."
  },
  {
    "rating": "0.5/5",
    "review": "It is a Bad movie there are a black captain america and there are a red Hulk at the end all love the peace and bullshit things"
  },
  {
    "rating": "3/5",
    "review": "It was solid through the beginning of the movie and the middle, but you could tell where they did. The shoots and the story kind of fell apart. Also, the red Hulk scenes needed to be much more fulfilling and longer. I really enjoyed the beginning though in the middle of the movie and the red Hulk scenes that they had."
  },
  {
    "rating": "4/5",
    "review": "Captain America: Brave New World is a good film; compared to what Marvel has been producing in recent times, it stands out. However, I believe that the reshoots and some poor creative choices prevented it from reaching its full potential. I would watch it again, but it definitely could have been much better."
  },
  {
    "rating": "0.5/5",
    "review": "I just wanted the movie to be over. It was no Incredible Hulk, but was incredibly boring. Marvel movies used to be entertaining but the east several years anything but."
  },
  {
    "rating": "5/5",
    "review": "The writers, the pacing, the action scenes, the villain, the suspense… were all top notch."
  },
  {
    "rating": "4.5/5",
    "review": "It was pretty good I thought the villain could have been a bit more comic book accurate but still great story and loved it cast was great Harrison ford did pretty good for his first marvel film appearance too so I give this movie an A++"
  },
  {
    "rating": "3.5/5",
    "review": "The most epic Disney plus episode ever"
  },
  {
    "rating": "3/5",
    "review": "A big step down in quality for the Captain America franchise as a whole. Main issues for me are weak storytelling, terrible dialogue & clunky hand to hand combat scenes. Two scenes redeem the film for me: the battle over the Indian ocean & the finale battle between Cap & Red Hulk."
  },
  {
    "rating": "4/5",
    "review": "really enjoyed this movie hope it setsdup more"
  },
  {
    "rating": "3/5",
    "review": "it has some redeeming qualities like sam feeling like how he was portrayed in the infinity saga and ford was good but it was kind of disappointing"
  },
  {
    "rating": "3/5",
    "review": "Decent Marvel Movie, really not the greatest but not bad at all. No idea about what was going on the the fighting scenes were pretty cool (in my opinion). Wouldn't ever watch again though."
  },
  {
    "rating": "1/5",
    "review": "Very shoddy writing filled with as many dead ends as there are loose ends. And the good guys end up winning due to the \"power of family\" even though that doesn't work the first time, literally 5-10 minutes prior. Might be the worst Marvel movie I've seen"
  },
  {
    "rating": "4/5",
    "review": "why doesn't he just take the serum? pretty good overall though."
  },
  {
    "rating": "3.5/5",
    "review": "Marvel did their best but this movie lacks the actual Captain America vibes cos very young guy would love the actions the previous main hero would have done if he was put in this movie"
  },
  {
    "rating": "1.5/5",
    "review": "The main strategic villain had a terrible CGI and for Marvel fans we know how out of place Anthony Mackie as Sam Wilson was in that Hulk movie because that’s what they tried to do; rushed and forced a connection between the villain and the hero so they had a reason to “resolve it” at the end with the power of speech (which got old after the political message in his series on Disney+). Overall good fighting actions scenes but the whole movie, the main actor it all feels like a B-list character, there were no stakes, no real threats, ah yeah the main (cool) villain just appears half hour before the movie ends and again WHY DOES POWER OF SCRIPT DEFEATS IT"
  },
  {
    "rating": "2.5/5",
    "review": "I love Marvel but this movie was not interesting or entertaining. I expected a lot more from it, still has its moments but I hoped more for the new Cap and a Red Hulk movie.. disappointed"
  },
  {
    "rating": "1/5",
    "review": "Filme ruim da pext kkkk imitação barata do capitão América 2. 😹🫸🏻🌝🤡 Tirando a cena de ação que vimos nos trailers. De resto, fraco demais e bastante conveniências. 🙄🙈"
  },
  {
    "rating": "4/5",
    "review": "I really liked it! I liked how they connected back to the 2008 hulk villain, I thought they had forgotten about a certain villain and they finally circled back on it, I wish the hulk would’ve made an appearance since this had a ton of hulk related characters/villains, I loved the message that the new captain America gave and how he stands his ground!"
  },
  {
    "rating": "2.5/5",
    "review": "Don’t expect much. Not horrible just A go nowhere movie"
  },
  {
    "rating": "5/5",
    "review": "Very action packed loved the red hulk."
  },
  {
    "rating": "3.5/5",
    "review": "It’s an okay film but this should’ve been a Hulk Movie."
  },
  {
    "rating": "2.5/5",
    "review": "Another Meh entry in the MCU. Poor story, bad CGI in places. The trailer spoiled the entire film. You just don't care about the characters anymore, you are not invested in the jeopardy or what is at stake as the MCU has become convoluted. It is better than The Marvels, but not by much. Wasted opportunity with wasted characters such as Red Hulk and The Leader."
  },
  {
    "rating": "3/5",
    "review": "I just wached the movie and it was good. It was truly entertaining. Maybe I didn’t cry, maybe it didn’t give me the shivers but I’ve seen much worse movies. I think this marvel movie specifically got hate from so much audience not because the story isn’t interesting or the cgi was off, it’s because people can’t let go of Steve Rogers, they’re not accepting that we’re now in a new phase with new avengers new characters new mindsets. We should be more open in my opinion. What I didn’t like though was the script, it could’ve been much better but other than that it was a fun movie to watch. SO UNDERRATED. I’d give it a 6/10 not bad for post-endgame MCU, i’d rather say it’s better than a lot of the movies that marvel released these past few years especially Antman 3 and Thor 4 (those were horrible)"
  },
  {
    "rating": "4.5/5",
    "review": "Anthony Mackie and Harrison Ford are awesome. The action sequences are great, and it feels like a Marvel movie - the first MCU film in a while that feels a part of the connected universe. Sam makes a great Captain America. Only complaint is that the plot is a little bland and the writing feels \"meh\" at times. Overall, a lot of fun at the theaters!"
  },
  {
    "rating": "3/5",
    "review": "I love Anthony Mackie as Cap and Harrison Ford as Red Hulk but it wasn’t enough to carry this movie. The story was choppy and the villain was meh. Don’t get me wrong, Tim Blake Nelson is awesome but the character development felt rushed and disjointed. I enjoyed the movie but didn’t love it."
  },
  {
    "rating": "2/5",
    "review": "wasn't to good and it wasn't to \"bad\"... definitely could have waited for it to hit Disney plus"
  },
  {
    "rating": "2.5/5",
    "review": "This film barely passes, but it can't cover up its many shortcomings."
  },
  {
    "rating": "3/5",
    "review": "It's okay to miss it, but it's also better than most entries since 2019. Good riddance to the multiverse."
  },
  {
    "rating": "5/5",
    "review": "Very good action movie"
  },
  {
    "rating": "3/5",
    "review": "Um filme decente com bons momentos; gostei do Hulk Vermelho, gostei das cenas de ação e de vôo, e gostei do novo Capitão América. Enfim, é um filme simples porém divertido."
  },
  {
    "rating": "4/5",
    "review": "good movie to start off the new mcu universe"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst Marvel movies off al time, and by far the worst in MCU movies. The leader was one of the worst villains in any movie I have ever seen, red hulk appears for 5 minutes. And the new captain America was bar far one of the worst leads in any movie ever. It wanted to do so much but ended up doing nothing at all."
  },
  {
    "rating": "3.5/5",
    "review": "Very good execution to a Marvel movie if it were an early stage Marvel movie however we may be a little too far into the franchise for such a small stand alone film with hardly any build up to something. Another cameo or two would be nice which is not pandering if they are well written. (Which IS possible) I'm not sure how I feel about the new falcon. He seems a bit too peppy to pair well with Anthony Mackies bravado and swagger. Also the build up is disappointing due to the climax being spoiled in all the trailers. Other than that it's an ok addition to the M.C.U. My problem with the M.C.U. hasn't been the actors or the characters. It's been the writing and I feel this movie does better with that aspect at least."
  },
  {
    "rating": "2/5",
    "review": "I think Red Hulk is too much for a Captain America who doesn't have the super soldier serum yet. This movie should have been the best of the year, especially considering you're introducing Anthony Mackie as Captain America—you need to make the audience like him. For me, it's a 4/10."
  },
  {
    "rating": "3.5/5",
    "review": "If you’re expecting a high stake, heavy and grand MCU movie you’ll be disappointed. Yes this movie didn’t do as well as expected. It’s still within the solid/average/okay/good region, depending on how you feel. But the action sequences are top notch, likeable cast. A strong message about self-worth. A villain who does the right thing in the end, another villain was kind of wasted. Despite reshoots, the pacing and chopping of the movie is seamless. This is a low level MCU film, it does its job and I left feeling happy. The post credits was spooky with a subtle hint of what’s to come. And personally, we didn’t need anything spelt out, especially as Thunderbolts post credits is the heavy hitter. Sam Wilson is fantastic as Captain America. One more thing, this movie feels like some of the initially ‘not-so-well-regarded’ movies of Phase 1-4. Such as: Thor: Dark World, Iron Man 2, Antman & the Wasp, Captain America: First Avenger, Shang Chi, Eternals, Thor, Black Widow & Incredible Hulk And now some movies are getting more love, we will certainly look back at this movie in years to come and respect its smaller scale and safe vibes. It’s a perfect contrast to Thunderbolts which was a bigger movie, evidently so… as it’s a team up movie. Cant wait to watch Cap 4 on Disney+ This movie is far from perfect and deserves its B- score but it’s not a bad movie at all."
  },
  {
    "rating": "3.5/5",
    "review": "Captain America: Brave New World is a passable superhero enterprise that delivers the swell action one comes to expect in a Marvel outing."
  },
  {
    "rating": "4.5/5",
    "review": "“Suit Up” because you’re in for a truly 🆕 yet, aspiring film/story on Sam Wilson; who is in dead Captain America, and other characters we’ve come to love and appreciate. This movie was filled to the popcorn buckets with action, continued connectivity and surprises! When the old meets now. The amount of Easter Eggs makes you want to hunt and get that “Golden Egg.” As a fan who enjoys most if not all of the MCU films for what they are, the shout outs to certain characters, Earth 616 locations; Wakanda, there was so much fun throughout this story. Authenticity, Respect, Understanding & Dedication to the Sheild and title of Captain America. Sam’s appreciation to Steve is never tested but, Sam wavers the idea of taking the mantle/title is. By the end of the film, with elements of the first trilogy, Sam solidifies his place in the “new world” and the Avengers may have found their leader… ♥️ Congratulations to Anthony, Danny & the rest of the cast on creating the next chapter to this beautiful legacy. You did good 😊"
  },
  {
    "rating": "5/5",
    "review": "Red hulk smarrr, Sam best captain america"
  },
  {
    "rating": "2.5/5",
    "review": "pretty lame. not digging Sam as Captain America, red hulk was cool"
  },
  {
    "rating": "2.5/5",
    "review": "Although it wasn’t terrible, this movie is heavily flawed, you can tell they changed this movie a lot, it’s a sloppy mess, the villain was a huge miss both visually and story wise and they way Ross becomes the Red Hulk is lame plus there was way too much of him in the trailers. Anthony Mackie was pretty good and Harrison Ford wasn’t bad."
  },
  {
    "rating": "1.5/5",
    "review": "\"Captain America: Brave New World\" is a sloppy mess of a superhero movie. The more you dig deeper into this awful movie, the more dissapointed you get. The third act was okay, but the first and second acts were obnoxious, and a real chore to get through. The MCU has lost all of it's charm."
  },
  {
    "rating": "1/5",
    "review": "The characters felt one demential and the story wasn’t very good"
  },
  {
    "rating": "4/5",
    "review": "La pelicula en si no es mala pero si es un meh."
  },
  {
    "rating": "3/5",
    "review": "Loved seeing Sam take on the role of cap but action and story just seemed like it didn’t know what direction it wanted to go."
  },
  {
    "rating": "2/5",
    "review": "More Disney+ for consumption. Outplayed characters and rhetoric. Sure, we get new Cpt America which is great. But, everything else was very predictable."
  },
  {
    "rating": "3/5",
    "review": "Giving it an average score because I enjoy Anthony Mackie. That's it. I thought the story was dumb. The supporting characters were boring. Red Hulk was on screen for what.... 5 minutes. Worst Captain America installment by a landslide."
  },
  {
    "rating": "1.5/5",
    "review": "While both the acting and CGI are great, the ridiculous plot, sluggish pacing, and lifeless dialogue make this movie just another post Endgame disappointment. Side Notes: Why was Esposito cast as some random thug instead of the main villain? Scary manipulative villains are kinda his thing. While Harrison Ford is a great actor, his mannerisms and delivery are nothing like the character played by Hurt in previous films."
  },
  {
    "rating": "3/5",
    "review": "“YOU’RE NOT STEVE ROGERS”"
  },
  {
    "rating": "3.5/5",
    "review": "Back to the high action adventurous style of storytelling. Better than most say. Mackie can carry & hold his weight."
  },
  {
    "rating": "4/5",
    "review": "Is it MCU standards? No but it’s still a solid movie overall."
  },
  {
    "rating": "5/5",
    "review": "An utterly enjoyable film. Serious tones and action sequences were well constructed and the story intriguing. Absolute enjoyment."
  },
  {
    "rating": "3/5",
    "review": "Wasn't like the original Cap. wish there was more red Hulk."
  },
  {
    "rating": "1/5",
    "review": "Just bad there is nothing good about it"
  },
  {
    "rating": "2/5",
    "review": "This was disappointing, simple plot. Ridiculous action sequences, almost grade B like a Sy/Fy channel film."
  },
  {
    "rating": "2/5",
    "review": "The story wasn't that good. I think it should've been a Disney+ release"
  },
  {
    "rating": "3/5",
    "review": "Compared to the previous Captain America films. This isn't bad at all. It was alright. If it were called a Falcon movie then my rating would be higher but since it is a captain america movie we tend to put it in contrast with the previous ones that came out. So I'm giving this a good 3 out of 5. Again, its not bad. I still recommend you watch it. But for a \"Captain America\" movie. Its an average."
  },
  {
    "rating": "5/5",
    "review": "The movie was very fun. Anthony Mackie is a great Captain America. This movie very much sets a very solid foundation for future Captain America movies."
  },
  {
    "rating": "3/5",
    "review": "was fun. As far as Marvel movies go probably mid but not terrible"
  },
  {
    "rating": "5/5",
    "review": "This is literally the Incredible Hulk 2, but with Captain America only but the final action seen with red Hulk is great"
  },
  {
    "rating": "0.5/5",
    "review": "A film that can't decide what it's about or why we should care."
  },
  {
    "rating": "2.5/5",
    "review": "Its not that its a very bad movie. I liked moments in it but overall, the villians were nothing special, there was really no emotion with it. I expected more. Cap was the best part of the movie alonside maybe the falcon."
  },
  {
    "rating": "2/5",
    "review": "There may be some fun to be had, but “Captain America: Brave New World” is largely forgettable with an underdeveloped script and obvious reshoots."
  },
  {
    "rating": "2.5/5",
    "review": "Poor writing honestly. Saw the script coming from a mile away, very predictable, the typical villain and the tryhard superhero overcoming the fact that he's not like the original lmao. I miss the old movies but i gotta admit this one had good use of visual effects."
  },
  {
    "rating": "2/5",
    "review": "Let me be clear, I like marvel movies. I enjoy watching Kevin Feige piece together a universe & bring our comics to life. This movie is burdened by stitched together reshoots, clunky dialogue, and a story that can’t seem to figure out who its own antagonist is. This is not an actor problem, this is a writer/producer problem. I’m surprised Kevin Feige even allowed this out into the public because this was a Sony level marvel movie. Very disappointed and I hope they get this corrected in the future. Some positives, adamantium finally established, we got to revisit Tiamat, the hulk was well animated, and sidewinder is kind of a badass. However, it makes you think maybe we could have spent the 180 Million it took to make this movie on something more productive."
  },
  {
    "rating": "5/5",
    "review": "Love the way the story line and the tell of God story"
  },
  {
    "rating": "2/5",
    "review": "Probably the most forgettable and generic movie in the entire MCU. There are flashes of life when Harrison Ford finally hulks out and jumps around, but otherwise it's just so dull and meaningless. It wants to trick you into thinking you're watching a political thriller, but it only has the aesthetic of one. It wants to have cool action scenes but the special effects look unfinished and ugly. Anthony Mackie and the cast around him deserve better, and anyone that's been watching these movies for a long time deserves better too."
  },
  {
    "rating": "3/5",
    "review": "I understand the hate the movie got as a marvel movie and a captain America movie. However, for me it was a fun watch, not a bad story, some characters could have had a better image within the movie. The story not bad but could’ve been much better and could have been much worse at the same time."
  },
  {
    "rating": "5/5",
    "review": "It's a Marvel movie, of course it was good."
  },
  {
    "rating": "4.5/5",
    "review": "Brave new world makes its way through the MCU to become a worthy installment in the film series of captain america. the film itself is insanely enjoyable (likely more than the winter soldier). AS well as it benefits from having a structure of political thriller. The Action, Emotional Moments and Character Development are great/awesome in my opinion. Added to the fact that we got to have red hulk in an MCU film is truly spectacular. Definitely a worthy addition to the MCU."
  },
  {
    "rating": "3.5/5",
    "review": "The MCU has earned my trust. While not my favorite it was still great to see the new Captain in his own movie. I wish we got more scenes of Red Hulk."
  },
  {
    "rating": "0.5/5",
    "review": "Esse capitão vive o constante drama de provar que é o novo capitão. Isso já cansou! O cara é um herói e não tem a glória de um herói, coisa que ele tinha quando apareceu pela primeira vez nos vingadores. Triste!"
  },
  {
    "rating": "3.5/5",
    "review": "Was worth the watch, did think they could have done a bit more with the story and plot, may just be a bigger plot later on but was very engaging throughout the entire movie."
  },
  {
    "rating": "1/5",
    "review": "Story just doesn't not resonate with Marvel fans...Everything after Endgame is just crap"
  },
  {
    "rating": "3/5",
    "review": "Esse filme tem altos e baixos , cenas de voo boas e hulk vermelho é legal em ação porém há muitos diálogos que me deram sono e não movimentavam a história . O líder simplesmente ficou muito feio e é nada haver com sua versão original (quadrinhos) . Cena pós créditos horrível principalmente porque é muito provável que não irão usar o líder novamente no mcu , jogando muito potencial fora . A minha conclusão é igual a minha fala anterior existe um potencial todavia é desperdiçado por um roteiro que não quer construir a história"
  },
  {
    "rating": "2/5",
    "review": "mackie is great but this movie just sucks,they put up a hulk villain with a non supe hero.the build up to the red hulk is so underwhelming because we know it already from the trailer.the movie feels dragging but with many action sequence made it a little bearable.not worth going out your way to the cinema.2/5"
  },
  {
    "rating": "5/5",
    "review": "Wow I should have watched this movie sooner… This Capitain America kept me interested and engaged, it had just the right amount of action. I really liked this movie I will add to my collection I will definitely watch again it’s a shame it didn’t get the recognition it deserves."
  },
  {
    "rating": "2/5",
    "review": "Boring characters, boring actors, boring plots. What’s the point. Mackie is a good actor but this movie sucks."
  },
  {
    "rating": "3.5/5",
    "review": "Great edition to the Series worth at least another watch"
  },
  {
    "rating": "3.5/5",
    "review": "A servicable film that has too much hate on it. Its not amazing but its not awful either. Was a decent enjoyable film"
  },
  {
    "rating": "3/5",
    "review": "Fun movie that kind of brought back a good feeling of seeing the individual heroes' movies that brought back some classics, but then also embraced the new characters. Harrison Ford did a good job as the president and was a fun villain to watch, I was just wishing the climactic battle went a little bit longer and had a bit more emotion behind it."
  },
  {
    "rating": "5/5",
    "review": "Action packed and comedic"
  },
  {
    "rating": "3.5/5",
    "review": "Very good actions scenes, some good character moments, I found Anthony Mackie's performance did a lot to make his character likeable , however the films leaves a lot to be desired, with some undeveloped villains and worst of all Sam Wilson's Captain America doesn't seem to learn anything by the end of the movie. Overall a passable film, but could've been more."
  },
  {
    "rating": "0.5/5",
    "review": "Just come on...... Not a good movie. Where were they trying to go with this?"
  },
  {
    "rating": "3.5/5",
    "review": "Although not the best CAPTAIN AMERICA outing I've seen, BRAVE NEW WORLD is still good enough for a CBM. The movie tried to live up to it's previous outings but didn't quite pull it off yet but that doesn't make it bad, the satisfactory story-line and an incredible casting made this movie soar. Anthony Mackie and the ensemble took this movie to uncharted territory......also the fact that this movie dived well into the political aspect of the MCU and also linking together an event that took place years ago without dwindling in the process was impressive. BRAVE NEW WORLD has enough action scenes to keep you seated, although some sloppy dialogues and boring Easter eggs, this Anthony Mackie lead movie is worth the watch."
  },
  {
    "rating": "1.5/5",
    "review": "Some unbelievable moments, bad acting and just unnecessary movie!!!"
  },
  {
    "rating": "4/5",
    "review": "Good fun just how a Marvel film should be. Marvel are not seeking Oscars lol they are just for the fans and full of action. Great to take your kids to cinema as you'll enjoy it too! Not my favourite Marvel movie as Iron Man not in it...they should not of killed him off my opinion is Robert Downy Jr made the Marvel films great hope they can find a way of bringing him back. I hear rumours of an Iron Man 4 hope it's true. Captain America bit confusing as characters have changed but the new Captain pulls it off adequately. My score 7 out of 10 and a must see even if it's just worth one watch. Enjoy."
  },
  {
    "rating": "4/5",
    "review": "Definitely a fun watch I would recommend this to anyone who’s a fan of Sam Wilson’s character and the action sequences are overall fun"
  },
  {
    "rating": "2/5",
    "review": "Harrison Ford as President Ross was the pinnacle of this movie. Not a bad movie, but oddly paced, choppy dialogue, and forced plot lines."
  },
  {
    "rating": "1.5/5",
    "review": "An adequate TV series episode, probably an end season double header. There is no sense of any stakes. That said, beyond the bland strolling through the script there are moments. Here's another failed element: the incoherence of the story and, being Marvel, the action. Welcome to an Agents of Shield special, except it not at all special."
  },
  {
    "rating": "4.5/5",
    "review": "Captain America: Brave New World is a very good movie, and I don’t understand why people didn’t like it that much. It has good action scenes, which are also very well choreographed. It features a villain that falls a bit short, but is still not that bad. The special effects are very good, and the cinematography is wonderful. It was great that they brought back the subject of the Celestial, which had been left untouched for four years. So, for me, it’s a good superhero movie — with good characters, good action scenes, good visual effects — and I highly recommend it."
  },
  {
    "rating": "2.5/5",
    "review": "Captain America: Brave New World is not one of Marvel Studios finest movies but it’s not one of it’s worst either. It’s in between both of those areas. Somewhere in this film is a good movie. There are so many plotlines going on throughout it that the story gets convoluted. A more straight forward story would have been ok here. Anthony Mackie and Harrison Ford both deliver the goods here but still can’t elevate the script. The action is not winning any awards for action of the year. In fact I left rather dissapointed that there wasn’t more creativity here in that department. Spoiler warning is the Red Hulk doesn’t show up until about the last 25 minutes of the film. I really thought we were going to see him much sooner. The Villian is also the weakest part of the film as well and that is a problem. I can now see why this movie was not doing well with test screenings and had to go back for multiple reshoots. Captain America: Brave New World gets a 2 1/2 stars out of 5 from me."
  },
  {
    "rating": "5/5",
    "review": "Good good movie 😚🐸💚✨"
  },
  {
    "rating": "3.5/5",
    "review": "Pretty forgettable but not a necessarily bad film. Re-shoots pretty obvious."
  },
  {
    "rating": "2.5/5",
    "review": "Eh. Probably the weakest marvel film. Anthony Mackie is a good actor but he should be a different superhero. Doesn't have that same presence that Chris Evans had as Captain America. Harrison Ford of course is always good. Kind of a lame ending, writers reverted to the typical ridiculous speech where a few nice words make the villain stand down. Oh so that's all it took? \"I know you've done bad things but you can change, I believe in you\" then catch a cherry blossom in your hand and presto everything's back to normal. So $60 million in damage taxpayers now have to pay for could have been averted? Sam Sterns probably foresaw that but decided to keep it a secret. 🤣"
  },
  {
    "rating": "1.5/5",
    "review": "Se ha pedido mucho la esencia de las películas de Marvel, es una película muy poco entretenida, hay muchas cosas ilógicas en la trama, no entretiene."
  },
  {
    "rating": "5/5",
    "review": "This move was amazing. Honestly the action scenes were awesome. I look forward to more Anthony Mackie playing Capt America."
  },
  {
    "rating": "2/5",
    "review": "Flashes of brilliance, but you can tell it was made as a extremely mediocre TV series then edited into full length movie."
  },
  {
    "rating": "3.5/5",
    "review": "This one has great action scene that makes you feel it blow for blow. Captain America is back but with a different vibe. Harrison Ford makes Ross way more interesting and layered. Red Hulk gave you that classic hulk feel, like he turns to a horror film for a moment."
  },
  {
    "rating": "3/5",
    "review": "Harrison Ford is the saving grace of this movie"
  },
  {
    "rating": "2.5/5",
    "review": "As far as MCU movies go this one is “just ok.” There are some stand out moments in this film, but these moments are maybe 10-20% of the entire movie. The other 80% unfortunately is the same recent mind numbing/overly played-out marvel writing we’re all tired of seeing. The film suffers from bad pacing, undercooked plots and twists that are so obvious and predictable that I started checking my watch to see when the movie would finish. The supporting cast is pretty lack luster/down right cringy at times, and I was disappointed that they underutilized Giancarlo Esposito heavily in this film. Anthony Macky and Harrison Ford do a commendable job, but truthfully Carl Lumbly stole the show with his excellent performance. Overall the movie isn’t the worst thing in the MCU, but it’s no where near the best. C-"
  },
  {
    "rating": "2/5",
    "review": "While it certainly had some good moments, I found it to be quite boring and repetitive overall."
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed this movie"
  },
  {
    "rating": "1/5",
    "review": "Tries hard but jokes don't land. Story doensn't fully flow, looks like parts being forced together. Cheesy acting on all parts whether main or supporting character. Visual effects, especially at the beginning, look evidently like a movie set rather than a real laboratory."
  },
  {
    "rating": "3/5",
    "review": "Boring with a few good moments 😴... make a final twist for a bright future on the Marvel universe"
  },
  {
    "rating": "3.5/5",
    "review": "Um filme legal de assistir, mas com certeza não é um dos meus favoritos, pois sinto que a história, a cinematografia e o desenvolvimento dos personagens poderiam ser bem mais interessantes. Por conta disso, muitos personagens acabaram sendo irrelevantes para a trama. Além disso, o CGI falha em alguns poucos momentos, mas nada que incomode muito. Apesar disso, o filme apresenta cenas de ações bem legais, e isso vale o ingresso."
  },
  {
    "rating": "3.5/5",
    "review": "The film is good but not great, I appreciated Sam navigating his new role. Some characters were underdeveloped, such Samuel Sterns, Seth and they could have done better with Sabra. Red Hulk was a moment, a return to comic book savage depiction. Honestly, I have seen worse from recent Marvel instalments and this was a good time."
  },
  {
    "rating": "3.5/5",
    "review": "Just a good and fun Marvel movie."
  },
  {
    "rating": "3/5",
    "review": "Disjointed. Harrison Ford looked very out of place."
  },
  {
    "rating": "1.5/5",
    "review": "Terrible for the most part. I could care less about every character, every single character except for Dick Hallorann (Doctor Sleep/The Shining) when he says, 'I'm never going to be put in a box again' - brilliant. There was once a Captain America, his name was Steve Rogers - this replacement stuff doesn't quite do it for me. Hopefully, Avengers: Doomsday won't be a nearly this bad."
  },
  {
    "rating": "3/5",
    "review": "Action is decent, writing is awful and it's entirely predictable."
  },
  {
    "rating": "4/5",
    "review": "Refreshing, but still childish. This new captain is way better than Steve, who was just a soldier following orders. This one stands for the people because he wants it."
  },
  {
    "rating": "3.5/5",
    "review": "Solid movie, messy plot but Anthony Mackie is great as Sam Wilson."
  },
  {
    "rating": "5/5",
    "review": "Such underrated movie"
  },
  {
    "rating": "0.5/5",
    "review": "I want my money back worst movie ever"
  },
  {
    "rating": "2/5",
    "review": "Boring characters, boring actors, boring plots. What’s the point."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst written marvel films of all time"
  },
  {
    "rating": "3.5/5",
    "review": "If you have some friends over and you can't figure out what to do, this isn't a bad way to kill some time. But there are better things to do as well... Disney Plus it."
  },
  {
    "rating": "1.5/5",
    "review": "This is awful, managed half of it and gave up. The acting, script, music, and incessant sycophancy is unbearable."
  },
  {
    "rating": "1.5/5",
    "review": "I didnt think was a great MCU movie and typically can find something good about almost all of them. Would have been helpful to know the two pre-requisites for this were pre-mcu the Incredible Hulk and the Eternals. The Eternals might be the worst MCU movie of all time. Neither are memorable and without them you are left scratching your head."
  },
  {
    "rating": "3/5",
    "review": "I'm going to be honest, I've almost given up on Marvel Movies. After the few years of crap movies and cash grabs that we have been given, I had low expectations for this movie. Luckily, my expectations were met, it wasn't a terrible movie, but still wasn't the best."
  },
  {
    "rating": "0.5/5",
    "review": "It was horrible I bought it then after 20 min I new just skip too the red hulk part & that was just corny the new captain America doesn’t sound like the old cap. Hated every min of it"
  },
  {
    "rating": "2.5/5",
    "review": "It was okay. The story line was bland to be honest. I am not a huge Marvel fan, but the story line could have been much better. Better luck next time Marvel."
  },
  {
    "rating": "3.5/5",
    "review": "I'm not going to say that I didn't like the movie, because that would be a lie. What I think could have happened is to summarize the movie as Ross and Hulk. Apart from the final scene in the cherry trees (where the CGI was extremely poor), the dynamics of action and political conflicts were interesting on screen. Sam with a much more improved combat style, showing the evolution of the character as a whole. The hand-to-hand combat scenes were well directed. I found it interesting that finally a census about seconds to have exactly the seconds said. Sam mentions they had 28 seconds to cross the field and, yes I counted, it was exactly 28 seconds for them to enter and the guards to appear. For me, Isaiah is the most wronged character, the scene where he says he doesn't remember what happened and mentions his suit. I wish Marvel could do something better for Sam, since he's the new Captain America. Perhaps exploring the villains of the chapter better, like the serpent society, would be better as few were explored. Just as Strange's leading role in Multiverse of Madness was erased when Wanda was added, Ross being Hulk erases Sam's leading role. Anthony Mackie is amazing. The film didn't lack acting, it lacked script."
  },
  {
    "rating": "1.5/5",
    "review": "Its like they set out to set new levels of cringe with this movie. They need to just stop at this point"
  },
  {
    "rating": "2.5/5",
    "review": "As Captain America Civil War felt like an avengers movie, this felt like a hulk movie, without hulk. Lacked substance, little to no action and Sam doubting himself again. Could have been better for the first New Captain America but it really wasn’t, Harrison ford stole the show."
  },
  {
    "rating": "3/5",
    "review": "I went in not expecting much due to some of the more recent Marvel flops, but this movie had its good moments. I probably wouldn’t watch it again but it was entertaining."
  },
  {
    "rating": "3/5",
    "review": "A decent marvel movie. I really did not care"
  },
  {
    "rating": "3.5/5",
    "review": "It's fine. There are some great scenes and lots of closed threads from previous movies/shows. Ultimately it's a fun superhero movie."
  },
  {
    "rating": "2/5",
    "review": "I had high hopes I guess. It's not that bad, some really good action scenes gives 4 stars for that. But it feels like it tried too hard in the beginning, so overwhelming visually. Red Hulk had very little screen time. Minus 1 star for that. And the plot was disconnected and all over the place, another minus 1 star. Worth watching on streaming? Sure."
  },
  {
    "rating": "2/5",
    "review": "didn’t held up to the reputation of mcu superheroes specially when it’s from the same existing hero’s family."
  },
  {
    "rating": "1/5",
    "review": "Horrible! So far the worst Marvel movie! Boring, obvious, without sense, bad story and bad actors. Honestly I can't understand how come this stuff got better reviews than Kraven, not that Kraven is an excellent movie, but for sure better than this stuff."
  },
  {
    "rating": "0.5/5",
    "review": "who wrote this script and why?"
  },
  {
    "rating": "3/5",
    "review": "The writers should have spent more time on the script. It was average at best but my grand boys, ages 8 & 12, liked it. I loved the previous Captain America movies but this one lacked depth."
  },
  {
    "rating": "1.5/5",
    "review": "Sadly, Everything from trailers was in film and wasn't at all a good film for Marvel very messy story!"
  },
  {
    "rating": "2.5/5",
    "review": "6.5/10 this movie felt like a bland experience w/no thrills but it had classic hills vibes which was cool. Harrison Ford was ok it wasn’t the standout but this felt like a buddy cop movie that dragged. Sry Marvel u flopped again but I still have faith in u."
  },
  {
    "rating": "5/5",
    "review": "Great continuation of the Marvel franchise!"
  },
  {
    "rating": "5/5",
    "review": "Loved the nuance and complexity of Anthony Mackie’s performance as well as the underlying message about our society."
  },
  {
    "rating": "1/5",
    "review": "Such a bland move . Mackie is a great actor but the script , plot , and CGI were so vanilla . Honestly the Kid Danger Movie from Nickelodeon is more creative and memorable. Be disruptive and creative Marvel not bland and forgettable. At a time when the world needs heroes and stories of inspiration there should be great storytelling not …. Blah ….blah ….. bland old words. …."
  },
  {
    "rating": "1/5",
    "review": "Marvel is definitely running out of material and good characters. This movie could not hold a candle to its predecessors 10 or 15 years ago. You can't replace William Hurt (one of the greatest actors in my opinion) with Harrison Ford. The villain was dumb and not very threatening, some of the dialogue was corny, and the plot/story was incredibly underwhelming. It's time for disney to movie on to something else."
  },
  {
    "rating": "1.5/5",
    "review": "incoherent pointless mess"
  },
  {
    "rating": "3/5",
    "review": "The movie has multiple storylines but fails to commit fully to any of them. They film is carried by the enjoyable performances and the mostly good looking CGI."
  },
  {
    "rating": "3/5",
    "review": "A passable movie. But after Endgame, everything just seems epilogue."
  },
  {
    "rating": "4/5",
    "review": "Phenomenal movie. I haven’t been a theater in 4 years and this movie excited me enough to step out."
  },
  {
    "rating": "1/5",
    "review": "The guy playing the new falcon should be shot. Oh the whole movie was a cinematic flop also."
  },
  {
    "rating": "1.5/5",
    "review": "It was impossible to get invested in either the story or characters, it was like the actors just didn't believe in the film either. Stop dumbing it down to the lowest common denominator on the audience front, please!"
  },
  {
    "rating": "3.5/5",
    "review": "As a Marvel fan, I liked this movie. Anthony Mackie is a good replacement for Captain America. The action sequences were good, especially the Red Hulk vs Captain America sequence."
  },
  {
    "rating": "2.5/5",
    "review": "While lacking the old feel of Marvel movies, its an improvement from Marvel's recent material. Even with its chaotic plot and complicated shooting process, it was still a fun movie."
  },
  {
    "rating": "1/5",
    "review": "Harrison Ford and Anthony Mackie both bring their usual charming acting styles to the screen, but the script is pitiful even taking into consideration its MCU backing. Possibly the saddest part of this slop is Julius Onah's gasps of cinema where he attempts to make a scene more interesting than it is. Just another multimillion dollar attempt of resuscitating a long dead franchise."
  },
  {
    "rating": "1.5/5",
    "review": "So every spoiler is in the trailer ? Comon marvel"
  },
  {
    "rating": "4/5",
    "review": "Rather anticlimactic compared to other MCU movies."
  },
  {
    "rating": "3.5/5",
    "review": "I thought this was good overall. I don't like how they revealed who red hulk was in the trailer. I thought they could have left that out for a shock factor. I do like how they brought back some original cast from the Hulk movie. Not the best but definitely not the worst Marvel Movie. I do like Anthony Mackie as Captain America."
  },
  {
    "rating": "3/5",
    "review": "It's fine, but I really miss when Marvel was consistently better than \"Fine.\" It wanted to be a Hulk movie and a Captain America movie, and I don't think it did either particularly well. Just overall disappointing but enjoyable enough to not be outright bad."
  },
  {
    "rating": "1.5/5",
    "review": "Disappointing and Underwhelming While the actors delivered strong performances, the story itself fell flat. It felt more like a filler episode than a fully developed film, lacking the excitement and depth I was hoping for."
  },
  {
    "rating": "4.5/5",
    "review": "Exceptional movie. Sad for the loss of the original Thadeus Ross character. Harrison ford made it work. Storyline was good as well but needed another plot twist."
  },
  {
    "rating": "5/5",
    "review": "You gotta love Captain America! Glad you're back, Cap!"
  },
  {
    "rating": "1/5",
    "review": "The casting was a bad idea to start, just no. This take on Marvel comics is counterproductive. It's not the actors, it's Hollywood. It's bad enough to reclone a vintage character by combining two into one but to use unqualified writers is to desmantle all previously loved Marvel comics."
  },
  {
    "rating": "3.5/5",
    "review": "Not really our type of film but was pleasantly surprised, it is definitely worth a watch. Great special effects and a half decent plot! If you like Marvel and this type of film you will be in your element!"
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely sh*t, not recommending it."
  },
  {
    "rating": "1/5",
    "review": "Absolutely the worst, I cannot believe Harrison Ford put himself out on the line for this. I am not sure where this came from this franchise is dead to me, after a stinker like this I will never view any of the Marvel movies again."
  },
  {
    "rating": "1/5",
    "review": "New cap actor is crap"
  },
  {
    "rating": "2/5",
    "review": "When comparing this to marvel films from the past or just in general previous Captain America films - this one is absolutely terrible. You can tell it was a disaster from all the stories about reshoots. A convoluted terrible mess of a plot. The best part was spoiled in the trailer and it is the Red Hulk fight. That is all."
  },
  {
    "rating": "2/5",
    "review": "Incredibly weak effort. Main characters cannot carry the movie and it is just a typical generic Marvel formula. About 40 minutes left to watch so I'll stick it out but it is really disappointing, or maybe I should say expected.... Ok, I stuck it out!!!! Fantastic News, original thoughts are correct. What a really incredibly stupid movie."
  },
  {
    "rating": "2.5/5",
    "review": "Filme com muita ação, mas um filme que não representa a história do capitão américa."
  },
  {
    "rating": "3.5/5",
    "review": "It isn't as bad as critics say it is, because for starters, it solves a lot of plotholes that were left lose in the Infinity Saga, most of them being from The Incredible Hulk, so that's pretty good, but compared to something like Deadpool & Wolverine, it's inferior to that, but I'd say it's worth a watch if you want to see Marvel deliver a fun film."
  },
  {
    "rating": "3/5",
    "review": "It was decent, it kept me entertained. The Red Hulk was pretty awesome I also am I fan of the Sam Wilson version of Captain America. I mean come on !!! he's the only super solider who is human and did not take the serum! what a bad ass! The movie hit in the middle for me is was decent but not spectacular I think that's fair for this film."
  },
  {
    "rating": "3.5/5",
    "review": "It was alright, not as terrible as everyone said it would be. Still not up to par with everything up to and including End Game. But not the worst thing Disney has shelled out that’s for sure. Wait for it to be a 6 dollar rental somewhere. Or give it a few years it’ll be free on cable."
  },
  {
    "rating": "0.5/5",
    "review": "Man with wings flies about fighting bad men with a frisbee. It is utterly, mind-numbingly dull, and is the sort of neocolonialistic fetishism we, as a civilisation should be well beyond committing the resource to produce. My 12 year old son wandered off 32 minutes into the viewing to do something far more interesting. The only fun part of this film was when they played the Tame Impala song, Elephant, but you'd have to close your eyes and pretend you weren't stuck watching Captain America: Brave New World."
  },
  {
    "rating": "1/5",
    "review": "totally lost interest like 20 minutes in"
  },
  {
    "rating": "5/5",
    "review": "Loved all the action!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely brilliant action movie. I loved every scene and found the movie very enjoyable. Great cast and absolutely brilliant actors indeed!!"
  },
  {
    "rating": "2.5/5",
    "review": "Simply Decent. Nothing special was shown there."
  },
  {
    "rating": "2/5",
    "review": "This movie that feels like there are too many hands in it is the nicest way to describe it. I wish for it to be a success with Anthony Mackie leading it, and while he's good in it, the rest is just not cohesive and moving along with him. So much potential but lost in the transaction of dialogue and the incessantness of trying to make something not work, work. That annoying emotionless voice, god... at least scarjo can act. The flight scene is nice at least, not 2025 nice but nice nevertheless. It feels like it could be more with a vision in mind. This feels like producers trying to chime in too many times trying to make it work when all you have to do is let them work themselves."
  },
  {
    "rating": "5/5",
    "review": "Love the casting and very engaging!"
  },
  {
    "rating": "5/5",
    "review": "I loved it! Great action"
  },
  {
    "rating": "1/5",
    "review": "Captain America has been my superhero my entire life. This movie is not good. Just not good. I truly wanted to enjoy this movie, but besides a few CGI action sequences, just no. I can not believe that I am actually agreeing with the Critics on this one. You’ve gotta do better Disney."
  },
  {
    "rating": "2.5/5",
    "review": "Did not enjoy this at all... Slow... Story Line was ok... Wanted a bigger moment w Hulk and so, short lived in the movie.. Having a 5'2\" actor in charge of security details was laughable, sorry.. I feel like this movie was more about checking boxes, than creating a great movie. I went w my two adult sons and they have the same ratings (one said a 2 only bc Hulk was dope)... Nice try team Disney... Back to the basics. Make great movies again please.."
  },
  {
    "rating": "4/5",
    "review": "First of all I should clarify that I took the task of reviewing the most important details before watching it and the possible theories, so the movie was much more enjoyable for me. However, I must clarify that I did not watch the Disney series plus only a summary. I found the movie totally enjoyable and it was very well constructed plot wise, the villain was somewhat forgettable but there were certainly memorable scenes and very enjoyable performances to see together on screen, I can't say it's perfect but it made me want to keep watching Sam Wilson as Captain America, and I liked the Easter eggs. I would 100% watch it again."
  },
  {
    "rating": "3.5/5",
    "review": "Solid, had elements of a drama and investigation that felt more like an old school classic marvel movie. Had predictable plot lines that had the same elements of winter soldier, which doesn't make a lot of since how they didn't learn from that the first time or figure it out sooner. It's hard to fill Chris Evans shoes as Captain America, but Mackie did a good job."
  },
  {
    "rating": "4/5",
    "review": "Could of used more of red hulk, hopefully red hulk makes a return"
  },
  {
    "rating": "2/5",
    "review": "Tenuous plot coupled with weak dialogue - a solid cast, sadly hamstrung by the inadequacies of the production. Disappointing."
  },
  {
    "rating": "1.5/5",
    "review": "Honestly I understood what they were trying to do but it’s very clear it failed and they shouldn’t have showed red hulk so much in the trailers.just a cheap copy of winter soldier"
  },
  {
    "rating": "4.5/5",
    "review": "If you like super hero. It’s for you."
  },
  {
    "rating": "0.5/5",
    "review": "(Could not selected 0 star - 0.5 star is generous!) Probably the worse marvel movie ever. Feels made for Tv, during the writers strike, using discarded scripts from the bin. All the talented actors are there but the script is abysmal. Difficult to get emotionally involved with this B movie. What a shame this is what the first black Captain America movie ends up as!"
  },
  {
    "rating": "0.5/5",
    "review": "Disney keeps on destroying their own franchises, this movie was made like a chose your own adventure book, there is no correlation between scenes and you can tell that it had massive and bad reshoots. Keep up the bad work disney"
  },
  {
    "rating": "1/5",
    "review": "First time i almost fell asleep watching a marvel movie"
  },
  {
    "rating": "2/5",
    "review": "Another lackluster entry in Disney's Marvelverse. First off, it's not a good idea to make a movie called Captain America without Captain America (Steve Rogers). Second, the writing is a mess and the movie looks poor for such a high tier movie. Red Hulk was cool for about 10 seconds, which was the high point of the movie."
  },
  {
    "rating": "2/5",
    "review": "The direction was a mess and the action subpar. The film could have easily been 20 minutes shorter with tighter editing that would have helped disguise the insecure direction."
  },
  {
    "rating": "0.5/5",
    "review": "This was not any good. Plus Disney is ruining Marvel! Just like they're ruining Star Wars!!!"
  },
  {
    "rating": "2.5/5",
    "review": "not bad, Bu i really don't like the cgi, what happened to you Marvel?"
  },
  {
    "rating": "0.5/5",
    "review": "The Incredible Hulk 2 was very dull. Dialogue and a plot that seems to be all over the place, culminating in a mess of a film. To top it all off there is no Hulk…wait this is a Captain America movie?!?!"
  },
  {
    "rating": "2/5",
    "review": "Acting is low grade. No story...did not like at all. MCU its his downward trajectory."
  },
  {
    "rating": "0.5/5",
    "review": "We don’t need no Jewish Mossad spies"
  },
  {
    "rating": "3/5",
    "review": "(CASTELLANO) No es que sea una mala película, pero podría haber sido mucho mejor. Brave New World arranca con fuerza, presenta un nuevo escenario y pone al frente a un Capitán América sin superpoderes... y eso, aunque suena interesante, también puede desconcertar a más de uno. ¿Cómo compite un tipo sin superfuerza en un mundo lleno de dioses, mutantes y magos? Pues con carisma, voluntad y unos cuantos tropiezos en el guion. Hay ideas que funcionan y otras que quedan en el aire. El regreso de personajes como Sterns puede pillar por sorpresa si no llevas el MCU al día. La película intenta equilibrar conspiración política con acción superheroica, pero se nota falta de pulso en el ritmo, como si el montaje no terminara de decidirse entre el espectáculo y el drama. Anthony Mackie lo da todo y cumple, pero está claro que el guion no le acompaña como debería. Harrison Ford es un añadido de lujo, aunque tampoco termina de brillar como se esperaba. La acción está bien rodada, hay escenas que enganchan, pero entre tanto personaje, subtrama y diálogo explicativo, cuesta mantener la atención. No es un desastre, tampoco es un acierto. Es otro capítulo más del MCU que entretiene lo justo pero deja la sensación de oportunidad desaprovechada. Un 6/10 que sabe a poco, sobre todo para una saga que alguna vez fue sinónimo de grandeza. (ENGLISH) It’s not a bad movie, but it could’ve been so much better. Brave New World starts strong, introduces a new setting, and puts a Captain America without superpowers at the center… and while that sounds intriguing, it might throw some people off. How does a guy without enhanced strength stand a chance in a world full of gods, mutants, and sorcerers? With charisma, grit—and a few stumbles in the script. There are ideas that work and others that just float aimlessly. The return of characters like Sterns might catch you off guard if you're not up to date with the MCU. The film tries to balance political conspiracy with superhero action, but the pacing feels uneven, like the editing couldn’t quite decide between spectacle and drama. Anthony Mackie gives it his all and delivers, but it’s clear the script doesn’t support him the way it should. Harrison Ford is a great addition, but he doesn’t shine as much as expected either. The action is well shot, and there are moments that grip you, but between all the characters, subplots, and explanatory dialogue, it’s hard to stay fully engaged. It’s not a trainwreck, but it’s not a triumph either. Just another entry in the MCU that’s mildly entertaining but ultimately feels like a missed opportunity. A 6/10 that leaves you wanting more—especially from a saga that once stood for greatness."
  },
  {
    "rating": "1/5",
    "review": "\"Captain America: Brave New World is, unfortunately, the biggest letdown of the year. As someone who has followed the Marvel Cinematic Universe for over a decade, I went in with high hopes—especially for a film carrying the iconic Captain America title. But what we got was a disjointed, poorly-paced mess that fails to capture the spirit, depth, or excitement that made earlier Captain America films so impactful."
  },
  {
    "rating": "1.5/5",
    "review": "It's not the same, it doesn't feel like a Captain America film and Anthony Mackie does a terrible job of portraying the character, it's like asking for Rottweiler and getting a Jack Russell"
  },
  {
    "rating": "1/5",
    "review": "Terrible. Predictable. Just awful"
  },
  {
    "rating": "4.5/5",
    "review": "The critics of course didn't like it, they always get it wrong. I think its because they forget this is for entertainment and not some deeply thought out world wide real life message. I was however concerned that there were about 21% of the normal viewers didn't like it. I read several reviews before I realized everyone was rating it 4-5 stars or it was a 1 or less rating. That tells me its a really good movie except for people mad that Bucky isn't the new Cap like in the comic....I get it and you need to get over it. It all loosely follows the comics, if it were the same it would be like a big spoiler was in your head from reading the comics years ago... Excellent movie as good as the majority of the MCU movies, solid story line bringing in the red hulk, solid acting and action scenes are a plenty and the CGI is good. I would expect the next one to have Wakanda upgrades to the suits!"
  },
  {
    "rating": "2.5/5",
    "review": "This film wasn’t short on action, delivering a level of entertainment at the very least. The antagonists in this film are underwhelming, due to lack of screen time and lack of a compelling storyline. Though the entire film didn’t seem to be going in a clear direction and seemed a bit like a hodge podge at times. Danny Ramirez Falcon character being an enjoyable character in this first film appearance. There are aspects that are blatantly impractical, even for a world of fiction and superhero’s. Resulting in a bit of confusion and disappointment."
  },
  {
    "rating": "3.5/5",
    "review": "I liked the movie, but the impression I get is that Captain America: Brave New World is a movie made to tie up the loose ends left from The Incredible Hulk (2008) and Eternals (2021) rather than focusing on properly consolidating Sam Wilson as the new Captain America in this universe. I feel like the script isn't very good at developing the mystery and suspense of espionage and it reaches a point in the movie where there are no more mysteries. Captain America: Brave New World isn't a bad movie, but I can't say it's an excellent movie either, just an average movie with hits and misses."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Lots of action and good storyline."
  },
  {
    "rating": "3/5",
    "review": "It was good but very predictable"
  },
  {
    "rating": "1/5",
    "review": "I couldnt make it through it. Forced is a good way to put it, just hokey, bad writing. It starts like a sequel to the 2008 Hulk, the way they introduced Isaiah Bradley with flag football flags was just dumb, dumb one liners 30 seconds in, new powers out of no where that dont make sense. Thats just 10 min. in."
  },
  {
    "rating": "0.5/5",
    "review": "Derivative exposition. Stylised fight scene. Repeat 20 times. unwatchable."
  },
  {
    "rating": "4.5/5",
    "review": "Flowed well, and the release timing absolutely clutch. Needed a Marvel movie that could hold it's own. Acting superb."
  },
  {
    "rating": "4/5",
    "review": "I don't understand all of the hate & dislike for Brave New World. It was a very enjoyable COMIC BOOK movie. Was it the best MCU movie.....No, but it definitely wasn't the worst. You need movies like this to move the MCU where it needs to go."
  },
  {
    "rating": "3/5",
    "review": "Wasn't bad, but definitely was far from great. Very routine lazy writing I thought. Love Mr. Ford as Red Hulk and I'm a big fan of the Falcon. So I was just slightly disappointed. It was entertaining enough."
  },
  {
    "rating": "5/5",
    "review": "Never understood the hate for this Captain America film, he definitely plays the role correct and constantly reminds others that he is the new and we’re done with the old!"
  },
  {
    "rating": "5/5",
    "review": "I was another good Marvel movie."
  },
  {
    "rating": "0.5/5",
    "review": "Painfully offensively horrible garbage"
  },
  {
    "rating": "1/5",
    "review": "Anthony Mackie doesn't have the charisma to pull it off as Cap. Add to it the story line where he doesn't have any of Captain America's physical enhancements but he can take a beating from a Red Hulk? None of it works."
  },
  {
    "rating": "4/5",
    "review": "Anthony Mackie steps confidently into the mantle of Captain America in Marvel’s latest installment, delivering a performance that feels both earned and timely. Having long stood by the Avengers as The Falcon, Mackie’s transition into the role of Cap is a natural progression that honors the legacy of Steve Rogers while forging a new path forward. The film offers the high-octane spectacle fans have come to expect—complete with explosive action sequences, unexpected twists, and a cinematic scale befitting the Marvel name. The supporting cast boasts notable appearances from Hollywood heavyweights including Harrison Ford, Giancarlo Esposito, and Tim Blake Nelson. While their performances are solid and well-executed, they serve more to bolster the narrative than steal the spotlight. All in all, the film is a thrilling, if familiar, addition to the Marvel Cinematic Universe—driven by Mackie’s compelling leadership as the new symbol of hope and heroism."
  },
  {
    "rating": "1.5/5",
    "review": "This movie felt like yet another filler for something bigger, just like most of the recent entries. It lacked any real weight or lasting impact. The plot was dull and painfully predictable, following the same formula we’ve seen countless times. Characters felt watered down, and the story strayed too far from what made the original Marvel comics compelling. It’s clear they’re more focused on setting up future projects than delivering a strong standalone movies…"
  },
  {
    "rating": "0.5/5",
    "review": "Just watched this movie and to me it was just awful, from super boring story to really bad cgi, This has been one of the worst Marvel movies iv seen in a while"
  },
  {
    "rating": "3/5",
    "review": "Well, it's quite a 6/10, it's a good movie to spend some time. It entertains well using good action scenes, there's a easy story to follow and it's a short/fast movie."
  },
  {
    "rating": "3.5/5",
    "review": "I overall liked the action of the movie, but at times the story seemed rushed and not fleshed out more. Kinda like they were hitting points that they wanted to hit in the movies but not developing those points. Not entirely sure if this pushes the MCU forward."
  },
  {
    "rating": "3.5/5",
    "review": "The first Captain America film without Chris Evans is a HIT! There’s such a great vibe and atmosphere with intense scenes in this movie. Anthony Mackie did an incredible job and the action was amazing. Not only that, the political side was done well. It’s not my favourite Marvel movie but it’s a hell of a good time!"
  },
  {
    "rating": "3/5",
    "review": "While this movie wasn't so bad, it was still very confusing. I didn't mind the plot, but the zombie thing was all over the place, and on top of that we only see red hulk fight once the whole film. The past few years since endgame have been rough for marvel, but hopefully with thunderbolts and fantastic four coming up they can have a big rebound."
  },
  {
    "rating": "3/5",
    "review": "It doesnt make any sense, how can he take a hit from someone as powerful as the hulk and not be mashed potato, if he doesnt have super serum, you could at least make it so he uses his brain to beat him, it even feels and looks like he is a poor steve rogers, the older captain america really made him look exceptional"
  },
  {
    "rating": "2.5/5",
    "review": "No where close to the previous captain America films. Not all on the new captain America. The movie just wasn't as good."
  },
  {
    "rating": "0.5/5",
    "review": "Another lame entry of MCU. Boring, corny, at times silly and childish. Nothing to highlight in this movie except its failure to deliver even a minimal satisfactory cinematic experience."
  },
  {
    "rating": "1.5/5",
    "review": "Weak story and acting. Lame attempts at humor. BS ending"
  },
  {
    "rating": "0.5/5",
    "review": "I hate it soooooo much"
  },
  {
    "rating": "3.5/5",
    "review": "Far better than I expected, based on reviews and internet talk. It fits quite good into the overall MCU storyline. And I really like it didn't have all that timetravel and multiverse stuff. It was a bit old school storytelling and had ties to the 2008 Hulk movie, the 2021 The Falcon and the Winter Soldier TV series and Eternals movie. At last a nod to the ending of the latter."
  },
  {
    "rating": "2/5",
    "review": "Strawberry Hulk is cool btw"
  },
  {
    "rating": "3/5",
    "review": "Solid Flick. Wish they would have built up the true villain a bit more during Marketing."
  },
  {
    "rating": "3.5/5",
    "review": "Good. A little slow tho."
  },
  {
    "rating": "1.5/5",
    "review": "Another $300 down the drain—and for what? Brave New World is less a movie and more a $30 million checklist. Forced acting? Check. Overstuffed plot? Check. Emotional connection? Not even close. The film tries so hard to say so much that it ends up saying nothing at all. Remember when Marvel made us feel something? Now it’s just noise—loud, flashy, and utterly forgettable. The heart that once grounded the Captain America franchise has been replaced with corporate formula and hollow spectacle. Sadly, the only thing brave about this movie is thinking it would actually work."
  },
  {
    "rating": "5/5",
    "review": "Action packed and had me interested the whole way through. Loved it"
  },
  {
    "rating": "1.5/5",
    "review": "Loved Marvel since it started, this was the 1st movie in the Series I couldnt get through. Pass on this film"
  },
  {
    "rating": "1/5",
    "review": "He is not captain America, batman with a shield comes closer."
  },
  {
    "rating": "3/5",
    "review": "Definitely like the new feel of Anthony Mackie playing the role of Captain America. Storyline a bit drawn out and would have served better as a mini series on the Dplus. Other than that very enjoyable if you’re an MCU fan."
  },
  {
    "rating": "3/5",
    "review": "Captain America Brave New World was an underwhelming film. The final battle was bleak and the story droned on a bit."
  },
  {
    "rating": "0.5/5",
    "review": "OVERDONE, repeated and an israeli star??"
  },
  {
    "rating": "1/5",
    "review": "The movie was quite boring and felt rushed. It didn't feel like a typical MCU movie. Wait til it comes out on Disney Plus. Would not recommend."
  },
  {
    "rating": "0.5/5",
    "review": "C- writing with C+ acting. I will never get back two hours of my life. The plot could not engage even 9 year old."
  },
  {
    "rating": "2.5/5",
    "review": "Anthony Mackie deserves so much more, he continues to give and give in his role as Sam Wilson but unfortunately the script does not match his tempo or talent."
  },
  {
    "rating": "3.5/5",
    "review": "I was okay. Not enough action."
  },
  {
    "rating": "3.5/5",
    "review": "Not the best Captain America film but still decent in a way."
  },
  {
    "rating": "5/5",
    "review": "great movie but it was rushed I feel like the movie should have been at least 2 hours"
  },
  {
    "rating": "4.5/5",
    "review": "Great movie when you look at it from a new beginning point of view,being that this could be a start too something bigger for the avengers with a new captain America."
  },
  {
    "rating": "5/5",
    "review": "Great movie love the plot and action"
  },
  {
    "rating": "4/5",
    "review": "pretty good but felt like it should have been a show"
  },
  {
    "rating": "2.5/5",
    "review": "I honestly don’t get the hate this movies getting it has great action, and all-time performances from Ford and Mackie. The movie did lack depth for the villains and sidewinder was heavily underutilized but overall I thought it was a pretty good movie and a small step in the right direction for the MCU."
  },
  {
    "rating": "4/5",
    "review": "Good MCU film! Definitely not the greatest, but entertaining in ways! action was great story was alright. end credit scene could had been better."
  },
  {
    "rating": "3/5",
    "review": "Underwhelming for a captain America movie that lacked the gravitas of the past few Cap movies that included a bunch of cameos and a whole lot of Avengers."
  },
  {
    "rating": "0.5/5",
    "review": "I have done sharts more entertaining that this garbage"
  },
  {
    "rating": "5/5",
    "review": "No movie is gonna be perfect. But it’s a Marvel movie, it’s always gonna be fun, jam packed full of action, and add on to the ever expanding universe that is the MCU"
  },
  {
    "rating": "4/5",
    "review": "Never skip a marvel movie!"
  },
  {
    "rating": "4/5",
    "review": "Liked it, but it was like Captain America: Winter Soldier all over again"
  },
  {
    "rating": "3.5/5",
    "review": "Not the best Captain America movie but it's still a good time."
  },
  {
    "rating": "1/5",
    "review": "Ugh! I hope that the Dark Avengers*, I mean Thunderbolts* blows this away, (not a hard Task(Master!) if you ask me! MCU utterly destroyed one of the best Hulk villians out there, The Leader!!! No justice!! 👎 & yes by the end of the Thunderbolts* that little asterisk is going to rename them the Dark Avengers is what SHOULD transpire!!"
  },
  {
    "rating": "3.5/5",
    "review": "Good movie overall. Wanted to see more of the mastermind villain. Marvel shouldn't have spoiled Red Hulk in the advertisement for this movie since he wasn't in it much. They cut so much from a certain other character that it was pointless for them to be in the movie. Otherwise enjoyable."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie with great action, maybe a little more action with red hulk but great overall! Love marvel!"
  },
  {
    "rating": "5/5",
    "review": "一部回歸漫威巔峰的作品，儘管有些缺點但瑕不掩瑜，是部很棒的電影，很棒的觀影體驗"
  },
  {
    "rating": "4/5",
    "review": "The climax fight between Hulk and Cap America should have been longer and much more screen time for Hulk."
  },
  {
    "rating": "3.5/5",
    "review": "Worth the watch for Marvel fans. But an overall average storyline. But one can't help but think there was just something missing."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was way to over hated in my opinion. This movie was a really serious story following the journey of Sam Wilson as the new captain America. The stuff I didn't like about the movie is that it lacked action. Most of the movie was just Sam Wilson talking with the other characters. I also didn't like the design of the villain. It just felt off and not accurate to the comics. The post credit scene didn't make sense as well. I really liked the red hulk design tho! It looked really well in my opinion. This movie is definitely worth watching!"
  },
  {
    "rating": "1.5/5",
    "review": "I wanted to like it, but it was just plain…..bad. Villain with no depth, Sam supposedly isn’t a super soldier, but….he is. He does all of the same things Captain America can do, but supposedly he’s just a normal guy. And dear lord does this Captain America lecture and talk…then lecture and talk…then lecture and talk."
  },
  {
    "rating": "5/5",
    "review": "loved it, can't believe people hated it!"
  },
  {
    "rating": "1/5",
    "review": "Cant recommend - wanted to like it, but the writing painfully took the spotlight in every scene. Even Fords presidential aura from his Jack Ryan turns could turn it around. This is the last gasp of a franchise that has already lived a good life, and then some. Please someone tell me it was only a TV series, or better yet, just a bad dream."
  },
  {
    "rating": "5/5",
    "review": "Love the new wave of Captain America. Story line as Pilot should be, something to look forward to, to watch the new vibe of the new Captain Merica!!"
  },
  {
    "rating": "3.5/5",
    "review": "Enjoyed the movie overall but found myself trying to compare with Avengers intro movies. Going to be different but should be good 12 years from now. Looking forward to Thunderbolts!"
  },
  {
    "rating": "3.5/5",
    "review": "Decent movie. Not top-tier Marvel, but better than some others! Love Isaiah Bradley!"
  },
  {
    "rating": "2.5/5",
    "review": "This movie met my low expectations and slightly exceeded them as a advid marvel fan this movie was needed to the storyline and overall a decent watch"
  },
  {
    "rating": "2.5/5",
    "review": "I think the movie has good action scenes, but at the story level it seems to me that there are problems that affect its development, the elimination of scenes is evident in parts of the plot (the Seth Rollins part for example) however there are salvageable, emotional moments, which makes it half worth having invested 2 hours in this movie. I consider that the role of \"The Leader\" was a waste, in the comics he is a very good villain, capable of putting his enemies in trouble, however in this movie that ESSENCE was not felt, it felt as if they had changed his personality because \"well because of the plot\", the movie is fine, if you are a big fan of superheroes in general, but if you are looking for a plot with more substance, then I don't know what you are doing watching a Marvel movie in 2025"
  },
  {
    "rating": "3.5/5",
    "review": "With this movie we are so back, I can't wait for Marvels Next plan"
  },
  {
    "rating": "2/5",
    "review": "In my honest opinion, this movie could not be part of the MCU and I would have been happier. The role of Captain America has changed so much since falcon took over. I didnt enjoy the resolution to the movie, the way it ended seemed like they just talked it out and it wasnt solved. It was pretty lame in my honest opinion. Id rate this a 4/10. Steve Rodgers was better."
  },
  {
    "rating": "2.5/5",
    "review": "Meh. Main villain sucked and the Red Hulk was poorly written into the script."
  },
  {
    "rating": "3.5/5",
    "review": "Pacing a little slow in the first part, although very happy to see some veteran actors in it. Better in the 2nd half, but missing a bit of that je ne sais croix."
  },
  {
    "rating": "5/5",
    "review": "Great story line and excellentbactors!!"
  },
  {
    "rating": "4/5",
    "review": "very good! only wish they didnt show red hulk in trailers. then again, many people wouldve spoiled that so much earlier or just not went to see it after hearing he's in it from their friends or whatev"
  },
  {
    "rating": "4/5",
    "review": "Critics don't like it, its bound to be a good movie. These are the same idiots that scored all the horribly cliche Avengers movies in the 90%. This movie was awesome for a superhero movie. Little bit of a different plot. Advanced cinematography. Some of the best superhero fight scenes I've ever seen. Slightly scarier villains than previous Marvels. God I hate how dumb critics are."
  },
  {
    "rating": "5/5",
    "review": "it was great and amazing to see I like the movie a lot"
  },
  {
    "rating": "4/5",
    "review": "This is a pretty good movie. Not as good as the other Captain America’s, but still worth going to the theater to watch. I recommend."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie and one of the best movies this year by far."
  },
  {
    "rating": "3/5",
    "review": "I liked that Sam is very similar to steve. Someone parts in the beginning were cringy."
  },
  {
    "rating": "4/5",
    "review": "I watch this movie a while ago and I had a great time. The action was very good and the plot was actually surprisingly interesting. It took a lot of inspiration from Captain America, Winter soldier and after re-watching that I’d say both of their plots stand up decently well. Also, Harrison Ford did a very good job as president Thaddeus Ross was taking over for the actor that sadly passed away in 2021.But we’re Captain America brave world struggles is the fact that Red hulk barely made any appearances in the movie and it was a bit rushed at times. But Anthony Mackie stole the show as his new version of Captain America and I had a really good time highly recommended. don’t think it’ll be the best marvel movie ever though"
  },
  {
    "rating": "1.5/5",
    "review": "In my opinion, the movie was a miss, not the worst MCU film ever, but certainly not a title any movie wants to come close to. It’s far from the strong debut our new Captain America deserved. The film felt overly restrained, which is a questionable choice for a non-serum Cap. “He doesn’t need it”? That’s debatable. Considering how Stan Lee reportedly disliked Wolverine taking on the Hulk, I can only imagine his reaction to this film. Visually, Red Hulk was stunning, but Captain America needed another hero by his side to balance the dynamic. Anthony Mackie’s Captain America deserved better."
  },
  {
    "rating": "1/5",
    "review": "So bad, the villain was weak af and the whole movie felt off from the reshoots to the action"
  },
  {
    "rating": "3/5",
    "review": "too much political blah blah but the action scenes were fun"
  },
  {
    "rating": "5/5",
    "review": "Me and the kids enjoyed it."
  },
  {
    "rating": "3/5",
    "review": "It's 2025, and unfortunately, Marvel seems stuck in a streak of average films. This one wasn’t terrible, but it felt more like a Falcon movie than a proper Captain America instalment. Strangely, the main character came across more like a supporting role, which really missed the mark. Shame on Marvel—because of that, it’s a 3-star film at best."
  },
  {
    "rating": "3.5/5",
    "review": "Not as good as the Marvel heyday but entertaining"
  },
  {
    "rating": "5/5",
    "review": "I waited until this weekend to finally see this film. I honestly haven't loved a lot of Marvel films since Endgame. To me, this as good as classic Marvel. It's a very well told story, much more of a thriller than even Winter Soldier was. The death of the dialogue and carrying over the best themes and topics of falcon and winter soldier's tv series. Its got a depth that I found extremely compelling. And, the villains were excellent."
  },
  {
    "rating": "5/5",
    "review": "Great storyline for young and old."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie for marvel so far. Boring and very bad storyline."
  },
  {
    "rating": "5/5",
    "review": "I would recommend watching captain America brave new world it is the best flim. I was really excited when the red hulk showed up. The storyline was really good, loved the characters in it. This was the best flim I ever seen. The post credit scene kinda wasn't necessary but the rest was really good so I would give this a watch."
  },
  {
    "rating": "3/5",
    "review": "A mere mortal fighting a hulk was just a bit too much"
  },
  {
    "rating": "5/5",
    "review": "Despite what Ive heard about the film, this was fun and entertaining, and one of the better Marvel films to come out in the past few years after the heavy MCU cycle"
  },
  {
    "rating": "2/5",
    "review": "What if Disney didn't shoot every single thing in front of a green screen and then have the worst CGI laid in?"
  },
  {
    "rating": "4/5",
    "review": "Not every super hero movie has to be Endgame in scale. This was on the same level as any \"solo\" super hero movie that came before it."
  },
  {
    "rating": "3/5",
    "review": "An ok spy thriller marvel movie. I definitely do like this more serious-tone of the MCU. But the story’s ok and feels kind of rushed, and the you can definitely tell where they reshoots were in the film, and also in my opinion they should have kept red hulk a secret to build more hype, overall its alright."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie. I can't wait for the next movie."
  },
  {
    "rating": "2/5",
    "review": "The movie was boring."
  },
  {
    "rating": "3.5/5",
    "review": "Solid MCU movie with a great performance from the lead Anthony Mackie. Has a decent political story with some expensive action towards the end. Villain is not very threatening and is kind of a let down, red hulk at the end is pretty awesome and exciting. Not perfect but not terrible"
  },
  {
    "rating": "3.5/5",
    "review": "It's not too bad. Definitely a great movie in modern marvel terms."
  },
  {
    "rating": "4/5",
    "review": "The special affects were wonderful!"
  },
  {
    "rating": "5/5",
    "review": "Great action and you get to see Han Solo/Indiana Jones as a Hulk!!"
  },
  {
    "rating": "3.5/5",
    "review": "Overall a pretty good movie."
  },
  {
    "rating": "0.5/5",
    "review": "I'm sorry for being so hard on this movie but it was just awful, this is not Captain America this is not the person that will draw me in as the leader to the Avengers."
  },
  {
    "rating": "3/5",
    "review": "A mildly entertaining super hero movie that has come out at a stage in the MCU where mildly entertaining isn't quite good enough."
  },
  {
    "rating": "3.5/5",
    "review": "Pretty fun movie, no classic, but a pretty good way to to spend an afternoon."
  },
  {
    "rating": "3.5/5",
    "review": "Felt like a hulk movie over a captain America movie"
  },
  {
    "rating": "5/5",
    "review": "It honestly had be from start to finish. Made me wanna watch the Hulk movie again for references."
  },
  {
    "rating": "4/5",
    "review": "The movie has epic moments but sometimes you feel that the dialogues are a little slow but it is a good movie to entertain. Comentarios"
  },
  {
    "rating": "3.5/5",
    "review": "FINALLY mentioned Eternal Island, fun movie."
  },
  {
    "rating": "3/5",
    "review": "It's not that bad. It's a good project. It's funny and interesting but it's not like the old movies"
  },
  {
    "rating": "3/5",
    "review": "Para m todo se acab luego de end Game y si bien hay buenas pelculas como Deadpool spiderman y de ms est pelcula mhe la crtica suena bsico aburrido y hasta ridculo no quita de que la pelcula no es ni decente."
  },
  {
    "rating": "2/5",
    "review": "not terrible could have been better without poor marketing steve is still my goat but if we see sam more that could change"
  },
  {
    "rating": "2.5/5",
    "review": "Our family went and saw this movie. It was ok I would say it was more fun to watch then some of the other marvel movies as of late. Not sure you need to spend money on it to see in theaters. Waiting until it is out on Disney plus is just fine."
  },
  {
    "rating": "3.5/5",
    "review": "This was a really good Marvel addition. Definitely worth watching but not enough for me to go see it in the theatre a second time."
  },
  {
    "rating": "4.5/5",
    "review": "Great Movie! Enjoyed the plot and action."
  },
  {
    "rating": "4/5",
    "review": "Harrison Ford as a Hulk earned an extra star for me. Tim Blake Nelson is also the bomb as a villain."
  },
  {
    "rating": "3.5/5",
    "review": "This was definitely not the best movie marvel has put out but one of the better ones in the last few years. Entertaining and worth at least one watch."
  },
  {
    "rating": "1.5/5",
    "review": "This is laughable. You cant be Captain America and not take the serum. The Hulk should have ripped him in half. Absolute joke."
  },
  {
    "rating": "0.5/5",
    "review": "Anthony Mackey made for a reasonably acceptable falcon when he wasn't in any serious scenes in previous films, however, as a lead, he fails to keep a smirk off his face 90% of the time making any scene in which he's supposed to be scared, worried, or any other emotion feel weirdly flippant. That's a more nuanced way of saying he has the acting depth of a toaster. Frankly he wasn't alone in the bad acting department. Moments of the film felt like sci-fi channel slop. Story wise the film was not only uninspired, but also had some deeply troubling moments that were straight up stupid. Why does the villain just turn himself in for no reason whatsoever? Why does talking to red hulk work the second time? Frankly it was just a bad movie in a trend of slop from Disney. #WanderingOff"
  },
  {
    "rating": "5/5",
    "review": "Action pack right from the beginning. It thought it was a nice surprise since Marvel movies haven’t been hitting hard like they during the early phases. I was very pleased with the movie."
  },
  {
    "rating": "3/5",
    "review": "A solid entry in the MCU although the extensive re-shoots took a film that had clear character and soul that was seen in the first trailer and instead made something that was not even close to its potential. Anthony Makie makes a great turn as the new Captain America, I just wish we had film or 2nd season of a show, that gave him more time to step into the role before giving his version of the character responsibilities such as rebuilding the Avengers. Also this film should have been way longer. The short runtime forced the film to reveal all it's cards before really giving it time to build any anticipation or threat."
  },
  {
    "rating": "4/5",
    "review": "The Captain's hat is worn. There was alot of storytelling racial inuendo that was also telling of thing in current times. Great overview in writing. If I had to knit pick... 10 minutes of RED Hulk sucked Good movie will watch it again"
  },
  {
    "rating": "1/5",
    "review": "Boring story and characters."
  },
  {
    "rating": "4.5/5",
    "review": "This was an action movie that was executed to its full. The reluctance of the production company to hold back on the red Hulk is the only hold back to the full surprising climax. This movie continues some stories that needed to told. Yet still serves as a bridge for what's to come."
  },
  {
    "rating": "5/5",
    "review": "We enjoyed it! Happy to have seen it on the big screen!"
  },
  {
    "rating": "3.5/5",
    "review": "Captain America: Brave New World does it's best to mimic the action-espionage tone of Winter Soldier but always manages to remain a step behind. Regardless, the additional of Harrison Ford, the team up of Sam and Danny, and the impressive action sequences are enough to make this a recommend."
  },
  {
    "rating": "4/5",
    "review": "it was ok lol. nice action scenes"
  },
  {
    "rating": "5/5",
    "review": "Great story. Solid plot. Amazing action. And Red Hulk. It was just an overall great movie."
  },
  {
    "rating": "4.5/5",
    "review": "We enjoyed it. Not sure why the critics didn’t, but to me it was up there with the other captain america genre."
  },
  {
    "rating": "3/5",
    "review": "A very by-the-numbers and predictable superhero \"thriller\", where every twist is telegraphed to ensure even people not paying attention will understand the plot. Inoffensive, but like most of these \"epic\" Marvel films the use of CG is so prevalent that nothing feels impressive and you never believe that any of it is real. With how much of the runtime and budget is spent on computer graphics and animation, it's a wonder why studios aren't just releasing fully 2d and 3d animated features to theatres at a fraction of the cost. A good way to kill a couple of hours, but it's a movie you'll watch once and never watch it again."
  },
  {
    "rating": "2/5",
    "review": "It seems like when a number of Marvel executives jumped to DC, it took Marvel's ability away to permanently rid the MCU of terrible villains. I didn't pay to watch the villain end his reign over diplomacy, rather than a battle to the death. Love and Thunder The Marvels Captain American: Brave New World These three and many more see the villain have a change of heart, and that's the only way to stop them. dumb."
  },
  {
    "rating": "5/5",
    "review": "Look the story and visual effects"
  },
  {
    "rating": "3/5",
    "review": "THe actors didn't fit the characters in the film."
  },
  {
    "rating": "1.5/5",
    "review": "These movies somehow keep getting worse"
  },
  {
    "rating": "4/5",
    "review": "It was a good movie. There were scenes that I think didn't flow. It was worth my time."
  },
  {
    "rating": "5/5",
    "review": "I love all the nostalgic characters from the Multiverse Saga and the shows and films that comprise it. A lot of people have so much negativity towards the latest run of films but I believe if they were able to let go of expectations of how they imagine these films or things the comics previously depicted are not exactly portrayed in the MCU they would be more able to enjoy them for what they are. That is my two cents, it makes sense I hope lol. Harrison did great and so did the breaking bad villain guy"
  },
  {
    "rating": "5/5",
    "review": "Had a blast from start to finish"
  },
  {
    "rating": "2.5/5",
    "review": "I feel like Marvel's reached rock bottom after they made Avengers: Endgame. But this ain't bad it's worth a watch."
  },
  {
    "rating": "2.5/5",
    "review": "this is also marvel's moves in the wrong direction. neither the plot nor the film surprised me and did not give me the emotions that I usually got from marvel"
  },
  {
    "rating": "3.5/5",
    "review": "Really not as bad as critics said. It definitely felt like it should of been on disney plus but always good to see anything in a proper theater. I wish we got more character development for Danny Ramirez's character."
  },
  {
    "rating": "1/5",
    "review": "The New Captain America — But Why? Harrison Ford — legend, no complaints there. But the new Captain America... why even do this? I’d have fewer questions if Isaiah Bradley became Cap. At least he has a backstory, pain, internal conflict. But instead, they threw Sam in the suit and acted like it all makes sense. Charisma? Zero. Facial expressions? Maybe three. Leadership or presence? None. Don’t even get me started on Cap’s sidekick. They turned Falcon into a clown. He used to be a solid partner — now he’s just comic relief. And that new shield... it’s not vibranium anymore, must be magnetic. Why? Because literally everyone — from special forces to presidential guards — shoots only at the shield, which barely covers 25% of his body. The rest? Apparently protected by plot armor. Then we have these tiny women, barely 5 feet tall, casually throwing around men three times their size. Seriously? No super serum, no logic — just because. At least Natasha Romanoff had style, skill, and training. This? Feels forced. And that Ross vs Cap fight... a complete mess. Steve Rogers had the super serum, charisma, and battle experience. This new Cap? Just a suit and a shield. No weight behind him. Steve was a symbol. This new Cap feels like a costume with no soul. Everything feels glued together — like the shield itself. But you can’t hold an audience with magnets."
  },
  {
    "rating": "2/5",
    "review": "He is not the captain of this boat."
  },
  {
    "rating": "2/5",
    "review": "Ehh.. several eye rolling scenes. It past the time but wouldn’t watch it a second time."
  },
  {
    "rating": "4/5",
    "review": "I like the tie in hulk movie and falcon and winter soldier with bucky making a cameo appearance. I would this is a just as Winter soldier"
  },
  {
    "rating": "2/5",
    "review": "The biggest issue with this movie is that it wants to be something that it is not!!!! Sam is not Steve Rogers !!!!! it's not a bad movie and it does work wen you are lack of movies to watch and you want something just for chilling The movies does not sustain its narrative Sam has a sense of humor which sometimes works and sometimes not Harrison Ford is the red Hulk, LOL, what a lame battle. It's a nice movie if you want to distract your mind, but don't expect a real thing cus it can ruin your hopes."
  },
  {
    "rating": "2.5/5",
    "review": "Glad they tied stuff from other movies. Definitely watch the Incredible hulk if you have to get references like Mr.Blue and the Mr.Blue song. I will say Falcon (not captain America in my book) didn’t win anything in this movie. The bad guy turns himself in and just convinces the red hulk not to tear him to shreds. Overall, It wasnt the best Disney put out."
  },
  {
    "rating": "5/5",
    "review": "Definitely action packed from the start. loved how they finally tied things from past movies into the whole universe (Celestials). A must see in theaters for sure."
  },
  {
    "rating": "4.5/5",
    "review": "A few characters from previous movies show up unexpectedly and make the story far more interesting!"
  },
  {
    "rating": "3.5/5",
    "review": "Something is definitely missing from the marvel universe these days."
  },
  {
    "rating": "5/5",
    "review": "AMAZINGGG, Anthony Mackie did such a great job"
  },
  {
    "rating": "5/5",
    "review": "Movie had a great storyline & incredible action scenes!"
  },
  {
    "rating": "5/5",
    "review": "I think the world is getting way too critical and like drugs people seem to need more and more in order to get high no longer satisfied with a single hit, and this movie was a hit, well paced and dam good, the perfect kickoff to whatever is coming next... They picked a perfect Captain America to replace the old one."
  },
  {
    "rating": "3/5",
    "review": "It was a decent watch. It felt a bit like filler material in order to set up for the upcoming Avengers Doomsday. I wished the plot was a bit more interesting to follow besides the mind control plot"
  },
  {
    "rating": "5/5",
    "review": "Great movie, lots of action, great story plot"
  },
  {
    "rating": "1/5",
    "review": "boring movie not the real captain America"
  },
  {
    "rating": "3.5/5",
    "review": "Couple slow parts, but overall pretty darn good. I was worried about the bad reviews, but this is definitely watchable, and rewatchable. Its a better than theyve been, Marvel movie. Its FUN."
  },
  {
    "rating": "3/5",
    "review": "It’s just good, nothing special. Good movie to connect with the upcoming events"
  },
  {
    "rating": "2.5/5",
    "review": "This 35th Marvel Studios film is a continuation of the television miniseries The Falcon and The Winter Soldier, and follows Sam Wilson, the new Captain America, who finds himself in the middle of an international incident after meeting with President Thaddeus Ross and must discover the motive behind a nefarious global plan before the true mastermind has the entire world seeing red. How the mighty have fallen! This could have been a standout entry—especially with its strong ties to The Incredible Hulk (2008)—had it been conceived as a proper Hulk/Captain America sequel. Instead, it lands as one of the MCU’s weakest efforts, failing to match the brilliance of the previous Captain America trilogy. Anthony Mackie shines as Sam Wilson, and Danny Ramirez brings fresh energy as the new Falcon, but even their charisma can’t save this mess. The script is the real villain here—clumsy, uninspired, and lacking the sharp political intrigue that defined Steve Rogers’ films. The climax fizzles, the antagonist is forgettable, and worst of all, the film needed The Hulk and he was unfortunately absent. A missed opportunity packed with potential but poorly executed."
  },
  {
    "rating": "4/5",
    "review": "Movie was great! For any sequel, it would be nice to have someone else besides Harrison Ford be the old president and perhaps a more feminine actress play the former window."
  },
  {
    "rating": "4/5",
    "review": "Don’t believe the hype. This was a great movie and Anthony Mackie was great as Cap and Carl Lumbly stole was the heart of the movie."
  },
  {
    "rating": "5/5",
    "review": "I was not surprised the film was good. Anthony Mackie is exceptional. What surprised me is that this film didn't do all that well at the US box office. I get it. People are tired and like to stay home. But COME ON, this is CAP! The story moved along. The plot delivered on ancient promises from the \"The Incredible Hulk\". The nod to the inferior \"Eternals\" was good, in that it brought Adamantium into the MCU, proper like. The new Falcon is great fun. The new \"former Widow\" was delightful and kicks butt. All great. Watch it."
  },
  {
    "rating": "2/5",
    "review": "The worst movie in this franchise by a country mile. Still Hollywood pushing agendas that they can’t turn back from. The story has no essence at all and no real stand out performances from any actors. The directing is questionable and the screenplay writers are a joke."
  },
  {
    "rating": "3.5/5",
    "review": "Has the same problem all the other Marvel movies has where the end of the world is approaching and where are all the heroes? But appreciated that the new Cap finally has a super suit so he can keep up and that he has stopped whining."
  },
  {
    "rating": "2/5",
    "review": "Was intertaining Enough if you’re board but for sure not something I’ll be interested watching again"
  },
  {
    "rating": "3/5",
    "review": "Super fun watch! This is everything we have come to expect from the Captain America/Marvel brand. The action sequences were fantastic. As per most movies within the \"action\" genre the writing leaves a bit to be desired. Overall the CGI was much better than recent MCU films/tv shows. The exception being towards the end with Cap standing near the cherry blossom trees."
  },
  {
    "rating": "2/5",
    "review": "Storyline was blah, character formulations were subpar"
  },
  {
    "rating": "5/5",
    "review": "Great continuation of the story"
  },
  {
    "rating": "4/5",
    "review": "Action and decent plot"
  },
  {
    "rating": "5/5",
    "review": "Sam was great, Harrison Ford as well, best phase 5 movie for me so far"
  },
  {
    "rating": "5/5",
    "review": "much much better than any reviews I've heard. I'm so glad I ignored the noise and saw it. Definitely worth a second watch also."
  },
  {
    "rating": "4/5",
    "review": "Solid feature in the MCU. Lacked protagonist development, but some satelite characters got to shine. Stars did well in their roles."
  },
  {
    "rating": "0.5/5",
    "review": "There’s only one Captain America and this new guy does not measure up. When will Disney learn?"
  },
  {
    "rating": "4/5",
    "review": "Pretty good, not the best and not better than the previous captain Americas. Red hulk debuting was probably the best scene."
  },
  {
    "rating": "4.5/5",
    "review": "Move was pretty good compared to the other previous marvel movies post credits lately need work"
  },
  {
    "rating": "0.5/5",
    "review": "Awful movie, don’t waste your precious family time on it"
  },
  {
    "rating": "5/5",
    "review": "Excellent addition to the MCU line up. Lots of story leads form older movies and shows plus introduction of plenty of new story elements."
  },
  {
    "rating": "4/5",
    "review": "It was a great sequel, had some interesting changes, great characters and story."
  },
  {
    "rating": "5/5",
    "review": "Great to see Anthony Mackie take the shield."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Must See!"
  },
  {
    "rating": "3.5/5",
    "review": "Solid film. Sam earned is role as Captain America!"
  },
  {
    "rating": "4/5",
    "review": "Solid film. The intrigue part could have been a little tighter, but still a great film"
  },
  {
    "rating": "4.5/5",
    "review": "Anthony Mackie is great and how can you lose when youve got Harrison Ford!"
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining to see Harrison go for it at 80!"
  },
  {
    "rating": "1/5",
    "review": "Not enough fight scene. Too much yapping. Boring"
  },
  {
    "rating": "4/5",
    "review": "I saw this movie twice. It not your typical MCU. It more on the line with a thriller exposing cover up. This is not your Steve Roger's captain america but new. Once you understand that, then you will enjoy the movie. When Iron Man 2 came out i didn't like it. Now once I saw how it played into the whole MCU now I love it. And it yhe same with the new Captain America. Watch it as a MCU fan and you will enjoy it."
  },
  {
    "rating": "2/5",
    "review": "The storyline was really weak. And the action wasn’t what expected."
  },
  {
    "rating": "1/5",
    "review": "the story is super boring. great performance by Anthony Mackie tho. others suck"
  },
  {
    "rating": "5/5",
    "review": "Being Marvel's first ever psychological thriller/horror movie, this was a smash. Though it did feel short, I absolutely thought it was magnificent, especially since we finally got to see Red Hulk in the MCU."
  },
  {
    "rating": "1.5/5",
    "review": "Boring, and unfortunately even the action scenes or Harrison Ford didn't save it for me. the story and the writing for this movie were just bad, I got lost and really didn't know what the point of the movie was."
  },
  {
    "rating": "1/5",
    "review": "There’s zero chemistry between the characters, it’s like the actors all met for the first time that morning. The cameos from Liv Tyler and Sebastian Stan both feel rushed and pointless; Tyler being grossly under used and Stan seems like an afterthought whose only purpose is to shore up the MCU chronology. The story feels flabby and disconnected: who’s the ‘big bad’ in this movie? The Japanese, Sterns, Sidewinder or Thaddeus Ross? The post credit scene suggests that we’ll see more from Sterns which makes the whole movie seem like it’s only purpose was to be a two-hour long set up for the next film in the saga. Can’t wait…. I also think it's time to accept that Anthony Mackie wasn't the best person to replace Chris Evans. He's too much of a downgrade."
  },
  {
    "rating": "3.5/5",
    "review": "Now this movie is worth seeing. If you must know if its good enough for Marvel fans to watch and heres my answer: yes it is. The setting, the characters, the theater. All of it is worth watching. Even Captain America vs Serpent."
  },
  {
    "rating": "3.5/5",
    "review": "not bad not amazing"
  },
  {
    "rating": "0.5/5",
    "review": "Shira Haas was so bad 👎"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie. Kept the emery up throughout the whole way. The red hog did not disappoint."
  },
  {
    "rating": "3.5/5",
    "review": "Better than the last few Marvel movie attempts. Some good action scenes scattered throughout and less unnecessary comedy attempts than usual. Seems more of a setup movie to transition along to the next phase and add new characters. Final fight scene was a disappointment compared to the earlier fight scenes with an even more underwhelming ending. The new Captain America is likable but not lovable."
  },
  {
    "rating": "2/5",
    "review": "Hate to say it but it was pretty bad, story was way too similar to Civil War, which shows how lazy the writers are getting these days. Bad editing. Side characters were shallow and just taking up space. (Especially that government plant, iykyk). Had some great performances, which is even more impressive given the script. CGI was stellar, which is all they seem to care about. Overall this is a huge smudge on Marvel's record. They better shape it up soon or the bad is. S gonna outweigh the good. Or has that happened already?"
  },
  {
    "rating": "4/5",
    "review": "Nice steady pace. Plenty of action throughout."
  },
  {
    "rating": "4/5",
    "review": "I loved it! It was fun and the 3-D was great!"
  },
  {
    "rating": "3.5/5",
    "review": "Is it a top-10 Marvel or MCU flick? No. Is it much better than people predicted? Yes. Would rewatch & do recommend. Also sets stage for ____ and _____."
  },
  {
    "rating": "3.5/5",
    "review": "I like the characters, the Red Hulk, Captain America. The story was ok, but could have been better"
  },
  {
    "rating": "4/5",
    "review": "good movie but not enough action"
  },
  {
    "rating": "5/5",
    "review": "It really passes the torch on to the next generation of hero’s"
  },
  {
    "rating": "4/5",
    "review": "I gotta say,this movie made the swears on purpose,even though it's a 12A"
  },
  {
    "rating": "1.5/5",
    "review": "Poor all round. Disappointed with Mackie in lead role. Not his fault completely, poor script and it doesn't really go anywhere. They even managed to make Ford look average."
  },
  {
    "rating": "0.5/5",
    "review": "Just a pathetic excuse for a movie."
  },
  {
    "rating": "3/5",
    "review": "It just didn’t feel like the same marvel’s style movie. It did a lot of flip-flopping around. I got tired of the racial stuff! I don’t believe there would have been a problem at all just having him take over as Captain America. I’m tired of Racial stuff being drug through movies. If they would have just let it go and had him as Captain America, the struggles he had it would have been great!"
  },
  {
    "rating": "3/5",
    "review": "It's not that bad IMO, but Marvel has definitely lost it's charm :("
  },
  {
    "rating": "3/5",
    "review": "I love Captain America however it’s starting to get a bit repetitive now. My cousin and I got a bit bored but overall good acting, and special effects."
  },
  {
    "rating": "5/5",
    "review": "awesome plot and action!"
  },
  {
    "rating": "4.5/5",
    "review": "Loved it! Saw it twice with our grandsons."
  },
  {
    "rating": "4/5",
    "review": "Captain America: Brave New World brings out the true meaning in Marvel with a good plot with not the generic superhero themes and good characters and fight scenes."
  },
  {
    "rating": "5/5",
    "review": "Very good movie! Made us laugh and stay on the edge of our chairs. Always watching for what was gonna happen next. I would recommend it to anybody young and old."
  },
  {
    "rating": "5/5",
    "review": "Great action and all around fun movie!!"
  },
  {
    "rating": "3/5",
    "review": "Captain America: Brave New World in my utmost honest opinion is certainly not the greatest marvel movie ever but neither is it the worst with pretty superb acting great camera angles and nice visuals it’s not that bad of a film but the where it falls short is simply due to the story seeming being rushed and not put together properly which is what stops this movie from being another Avengers or Spider-Man."
  },
  {
    "rating": "0.5/5",
    "review": "Boring. Terrible casting. Small girl secret service agent is a joke."
  },
  {
    "rating": "5/5",
    "review": "Great film, happy to see them setup the film which probably is Avengers Doomsday"
  },
  {
    "rating": "4/5",
    "review": "The superhero movie, Captain America, Brave New World was over all a fantastic experience that you should give a try. It was directed by Julius Ohna and was released in theatres in 2025. The main character, Sam Wilson, is played by Anthony Maccie and the main villains, red Hulk who was played by Harrison Ford and the Brainiac who was played by Tim Blake Nelson. In Captain America, Brave New World, Sam Wilson, who used to be the Falcon, has to take the role of Captain America, a superhero, after his retirement even though he has no superpowers. Throughout the movie he has to solve the world's problems such as preventing a potential world war, caused by Harrison Ford the new president of the USA, all the while having to deal with the immense amount of pressure that being the new Captain America entails. He is going to face superpowers threats such as Brainiac and the red Hulk. In my opinion, Anthony Maccie did an amazing job as Sam Wilson, in certain instances of the movie his face is serious and stressed which conveys his character's doubts concerning his new role. His choreography in fight scenes was also quite enjoyable. Harrison Ford also did a good job, his sultry expressions despite the fact that his character was the president perfectly conveyed his want to rekindle his relationship with his daughter. The special effects in this movie were however quite disappointing. There was nothing special about these special effects, the fire in the final fight scene was unrealistic and took me out of the movie. Other than that it was overall okay. The soundtrack had the typical uplifting aspect superhero soundtracks have. A wide variety of camera angles were used such as panning shots to capture the entirety of a battlefield during a fight scene. This film's message was that you can always redeem yourself which was conveyed by the villain Red Hulk once he accepted to go into custody to rekindle his relationship with his daughter. This is pretty convincing since the Red Hulk's relationship with his daughter took up a lot of the screen time and it left a lasting impression on me. This was a great movie and despite the numerous okay reviews this is still a good movie."
  },
  {
    "rating": "4/5",
    "review": "Was pretty good but a lot of talking in the seats all around us"
  },
  {
    "rating": "4/5",
    "review": "Red Hulk, Green Hulk, Pink Hulk — I don’t care. I'm not a Marvel freak, but I’m a big cinephile. That’s why I watch things I normally wouldn’t give a chance, especially when a company’s IP has mostly produced cringe-worthy stuff. What sets this Marvel film apart from most others is its solid sense of seriousness — and it’s not played off as a joke. Kind of like Endgame, which I actually really liked! The well-crafted and not overly dramatic soundtrack really emphasized that serious tone. If all Marvel movies were made like this, I’d probably be a big fan by now. Our new Captain America might not be the most remarkable actor, but Harrison Ford more than made up for that with his performance. I was honestly surprised he took part in a superhero movie, and I expected a weak showing — especially since Harrison isn’t exactly into sci-fi/fantasy stuff. All in all, Captain America: Brave New World really wasn’t that bad."
  },
  {
    "rating": "3/5",
    "review": "OK I saw the film for one reason: Harrison Simple as that. Been a fan for over forty years. So I had no acknowledge of the characters. None whatsoever. As the film progressed when characters from the Captain America world came in I knew nothing of their backstories. Now \"And Harrison Ford\". Excuse me he was the ONLY name actor in the cast. An A lister and he is in most of film and the first character you see. But got an AND. This should have been done like 1989's \"Batman\". Michael Keaton was a name but Jack was the bigger name and he was listed first. The film took ideas from older films, one is a surprise: Destroy the White House: 1996's Independence Day Meeting with the daughter at end of film: 2017 \"Blade Runner 2049\" Yep Harrison again The surprise film... The mind trick to turn people into assassins: 1988's \"The Naked Gun\". As a person who has always loved the music/soundtracks in films. But this one is a mixed bag. The couple of bits of loud rap music were terrible. Of course, with the brief appearance of Liv Tyler as Betty where was the Aerosmith music? With my lack of Captain America knowledge but Star Wars knowledge from the beginning I thought the Falcon character design looked somewhat Boba Fett. The main villain I thought he looked like an alien. The CGI was good. Keep this in mind as my special effects experience goes back to the original release of Star Wars. Decent film. And released 2-14-25 this was the film I looked forward to the most in 2025."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible. Almost unwatchable. Sad that cap’s shoes cannot just be filled by anyone."
  },
  {
    "rating": "4/5",
    "review": "We loved it and didn't see the time go in. Daughter noticed special effects were quite noticeable but didn't detract from the entertainment."
  },
  {
    "rating": "4/5",
    "review": "The movie overall was great, the story is well written in my opinion and there may be some CGI failures, I still think it's in my top 10 MCU films. Especially Red Hulk and Captain America's fight scene, absolute Cinema."
  },
  {
    "rating": "5/5",
    "review": "loved it, kept the energy needed and added alittle. love the fight scene"
  }
]