[
  {
    "rating": "4/5",
    "review": "I enjoyed it happy to try the 2nd movie."
  },
  {
    "rating": "5/5",
    "review": "I loved it, actually. Just a little confusing from time to time, but everything tied together at the end. I enjoyed Ben Affleck’s performance….his character almost a superhero who always triumphs. Jon Bernthal also was great. I liked his performance and was satisfied that the really bad guys got eliminated by the end."
  },
  {
    "rating": "2/5",
    "review": "I started with the sequel to \"The Accountant\" before watching the original, thinking I needed to catch up on the backstory. However, the second film does a good job of conveying enough context, so watching the first one isn’t strictly necessary. Overall, I found the original to be a decent film, but it certainly doesn't hold a candle to the sequel. At times, it felt a bit flat and dragged on, but it was still watchable. That said, I don’t foresee myself revisiting it since it didn’t leave a lasting impression. I do appreciate Anna Kendrick’s role in this film; it's a shame she’s not in the sequel. She delivers a stellar performance, as she often does, although I think she tends to overact in comedies. In a role like this, however, she truly shines. Ben Affleck also brings a unique depth to his character, showcasing a side of him that isn’t typically seen. Ultimately, I think my experience was colored by watching the sequel first. It set a high bar, making the original feel somewhat lackluster in comparison."
  },
  {
    "rating": "5/5",
    "review": "Loved it. O'Connor did good here. The stellar cast all excels in character, cinematography is real good. The movie creates an ambience in the world of Wolff which intrigues me a lot, the fact that the director actually pulled it off. Great stuff, watched a couple of times and will again"
  },
  {
    "rating": "5/5",
    "review": "best acting,storyline and action with bounus of main role has autism making it an cherry on top"
  },
  {
    "rating": "5/5",
    "review": "What world do the critics live in?"
  },
  {
    "rating": "0.5/5",
    "review": "This is unwatchable. It gave me dumb chills."
  },
  {
    "rating": "3.5/5",
    "review": "It's not bad actually but it's got a lot of issues mostly in the first half. The editing is ok overall but man in the first half it's so jumpy and poorly done. This such a huge focus problem. It can't commit to a set of ideas to develop. Autism, Accounting, the characters, the relationship between Affleck & Kendrick, Bernthal's storyline, the investigation into him, it all feels so scattered, underveloped, and to an extent bloated. It does slow down and starts staying significantly more focused in the second half though suprisngly. The music is ok. It's forgettable at times and just blends in. Everything else is half decent. Some of the acting at times is either a bit too wooden like Affleck who is hit or miss or it's weighed down by very clunky and inconsistent dialouge delivery and lines. Kendrick & Affleck aren't bad together but I swear it's the lines that weigh it down for them. The villian is very forgettable. Simmons & Bernthal aren't bad. Direction isn't terrible either and the fights are probably the best thing here. There pretty well done but it's nothing we haven't seen before. It's kind of amazing the big jump this takes in the second half because of the interesting backstory on Affleck and how it starts only focusing on a handful of things. Anyone who is a fan of any actors in this or unique action thriller subject matters could maybe consider this. Just be prepared to sit through rocky first half."
  },
  {
    "rating": "5/5",
    "review": "Loved Afflek's character, and the chemistry with Anna Kendrick was perfect. Plenty of humor, great (and believable) action."
  },
  {
    "rating": "2.5/5",
    "review": "It’s a workmanlike action thriller that is the second of the Accountant series. There’s a ton of emphasis on stunts and fights and gun battles, not so much on character development and storytelling. It’s a cut below but in the same vein as James Bond or Mission Impossible movies, with considerably less success."
  },
  {
    "rating": "5/5",
    "review": "Whether you are or aren't a fan of Ben Affleck, this story was very well written. Takes a single father with an Autistic child an one who is normal, after their mother left because she could not handle the, scary an unknown side of autism. He shows the boys that life is not fair, but family always has your back and the loyalty of family always comes first. If you have a couple of free hours I highly recommend this movie, and hope you enjoy it as much as I did."
  },
  {
    "rating": "4/5",
    "review": "SPOILERS It started off really strong. Extremely dense and genuinely fascinating, I was in. Then they like, ran out of time or something and suddenly there's like this massive exposition dump that seemed like an attempt to wrap things up really fast. Like, picture season 1 of Andor without the prison arc but instead explained over coffee in a nostalgic flashback. Don't get me wrong, I really enjoyed it hence the rating, but I feel sad that they didn't get the support they needed to make something truly special. Bernthal did his best with what he had, I think. His character felt like it could have been much deeper, and I'm sure they wanted that, but it's hard to connect with him through a silent child in flashbacks. Like, ok he's an adult now, but we know literally nothing about him other than he was there. And he cared about his father I guess? But then he's all pissed that Affleck chose \"Pops\" over him so I guess he hates his dad too? Kinda messy now that I think about it. I still really liked the movie though, it's seriously bad ass."
  },
  {
    "rating": "3.5/5",
    "review": "I was really looking forward to watching this but I was let down,I thought it would have been a 5 star"
  },
  {
    "rating": "5/5",
    "review": "The Accountant is a top class movie with an assassin based beautiful mind style character. Class story that at times trails off into shootouts but the backstory for some of the characters is really well thought out. I loved it and Affleck nails the ruthless but sometimes caring Accountant."
  },
  {
    "rating": "3/5",
    "review": "Mildly entertaining, but nothing remarkable. The main issue is that they chose to place the entire weight of the film on Affleck’s shoulders. A mistake that was thankfully corrected in the sequel. Suitable for a lazy Sunday with nothing else to do."
  },
  {
    "rating": "4/5",
    "review": "Having Boston in common has never been enough to like much of anything Ben Affleck has done; but I did enjoy this movie. I may not have even watched it if not for Jon Bernthal, who I've liked from early in his career....that high school reunion sitcom that didn't make it. This movie definitely has a high body count, and a lot of over the top action; but I found it enjoyable."
  },
  {
    "rating": "3/5",
    "review": "Despite featuring a great performance by Ben Affleck and a sensitive, more unique story that does a great job portraying autism, the movie nevertheless threads too much into generic action movie territory with a underwhelming direction and two dimensional characters outside of the protagonist himself."
  },
  {
    "rating": "5/5",
    "review": "One of my favourite movies. Solid story. Ben Affleck is bearable for once. Good twist at the end."
  },
  {
    "rating": "2.5/5",
    "review": "Okay movie, watched to prepare for the second one and it was simply underwhelming. The story was cool, and it really embraced the drama thriller genre more than I’d hope. The dynamic between brothers didn’t have much to do with the movie aside from being somewhat of a plot twist, despite predictable, Just an alright watch overall, not worth a second viewing."
  },
  {
    "rating": "5/5",
    "review": "really good movie , something a little different cant wait for 2nd movie"
  },
  {
    "rating": "0.5/5",
    "review": "oof that's a stinker"
  },
  {
    "rating": "4.5/5",
    "review": "great fight sequences and shootouts. some scenes too long"
  },
  {
    "rating": "4/5",
    "review": "Well worth watching, but in my opinion not quite as good as the first one: I'm hoping to see Anna Kendrick back for number 3."
  },
  {
    "rating": "5/5",
    "review": "It's a good movie and keeps me interested. I re-watch this movie at least twice a month since it has come out"
  },
  {
    "rating": "5/5",
    "review": "Much better than most are saying. Solid story. Balanced action. Everything come together nicely. I look forward to Part 2."
  },
  {
    "rating": "4/5",
    "review": "Surprisingly great movie. Bit convoluted here and there, but otherwise totally enjoyable."
  },
  {
    "rating": "4.5/5",
    "review": "I don't know what movie critics watched to give it such a low score. Is it because this movie isn't completely boring and has a lot of characters not saying anything or doing anything just \"artsy?\" This movie should have a much higher rating. I am always baffled at how critics review movies. This movie is great!"
  },
  {
    "rating": "4/5",
    "review": "Hadn't seen this in years, but my wife is going to the Accountant 2 with a friend and wanted to watch the first one. I didn't remember it being this good. Its really entertaining, the flow is excellent, lots of action and intrigue. Characters were well developed. Well worth the watch."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed it. Great acting."
  },
  {
    "rating": "2/5",
    "review": "The Accountant didn't make me feel ANYTHING at all, it feels really bland and souless. I'm only watching this one in preparation of me giving the second one another stab tomorrow but personally I really didn't enjoy this and it wasn't amusing or entertaining at all. It feels 45 minutes too long and most of the scenes feel unnecessary. Also I'd rather have a painting of Dogs Playing Poker if I'm honest."
  },
  {
    "rating": "5/5",
    "review": "That was brilliant! I can't believe I missed this when it first came out. Watched it to prepare for \"The Accountant 2\" . Why don't they make movies like this anymore? Nowadays the writing is horrible, plots make no sense, and just violence for violence sake with nothing behind it. This was practically flawless in every aspect. Meanwhile Hollywood is making crap movies like Captain America Brave New World now, trying to fool the public into thinking that's the best they have to offer, spending triple and quadruple the money with ridiculous cgi, when they could be churning out movies far superior like The Accountant. They needs to take a page from this movie, as well as movies like The Town also with Ben Affleck."
  },
  {
    "rating": "5/5",
    "review": "I was going through Ben Affleck IMDb to see what movies he’s recently been in & I found The Accountant. What a great movie better than I thought it was gonna be. The acting was amazing, and I am really surprised that the dumb critics only gave this a score of 53%. I don’t know what movie they were watching, but this movie is much more than 53% and the audience scored it as 77% which is a good score, but it should be much higher if you’re looking for an action packed movie with great dialogue. THIS MOVIE IS A MUST SEE!!! Also, I just saw The Accountant 2 & it is just as good, if not better than part 1"
  },
  {
    "rating": "5/5",
    "review": "Wonderful! One of my favorite movies"
  },
  {
    "rating": "5/5",
    "review": "This was a really good movie, I liked it a lot."
  },
  {
    "rating": "4.5/5",
    "review": "The critics are terrible, because this is a fantastic movie. Ben Affleck and Jon Bernthal are perfectly cast for these roles. I wasn’t expecting much and boy was I surprised. Loved it!!! Should be in the 90% category."
  },
  {
    "rating": "5/5",
    "review": "I thought that this was the best acting that Ben Affleck has ever done. To express so much emotion and grit without using words… It was excellent!"
  },
  {
    "rating": "4.5/5",
    "review": "Well acted and plotted with some excellent action. Nothing not to like here."
  },
  {
    "rating": "5/5",
    "review": "This horribly under-rated movie has been a favorite of mine since it came out! I've seen it 3-4 times -- still love it every time! Great story, Great Action sequences, and Great 'Romance' angle with Anna Kendrick! Can't wait to see Accountant-2."
  },
  {
    "rating": "4.5/5",
    "review": "Great film! Deserve way more praise and recognition."
  },
  {
    "rating": "4.5/5",
    "review": "Critics are ridiculous, this movie is ridiculously good and thought provoking."
  },
  {
    "rating": "1.5/5",
    "review": "Calculate your choices. The Accountant is a 2016 American action thriller film written by Bill Dubuque 💰 Can’t recommend it. Oof, this isn’t good 🙁Probably give it a miss 👎🏼 As a math savant uncooks the books for a new client, the Treasury Department closes in on his activities and the body count starts to rise."
  },
  {
    "rating": "3.5/5",
    "review": "“Sooner or later, different scares people” You know, I’m not a huge Ben Affleck fan.. but I can get down with these movies. After seeing the Accountant 2 premiere at SXSW this year it reminded me that I actually fairly liked the first movie. Afflecks character can easily pivot the mood of the film from intense, heart warming, all the way to comedic on the drop of a dime. After this rewatch I can confidently say, both this movie and its sequel are enjoyable action movies."
  },
  {
    "rating": "4/5",
    "review": "***SPOILERS*** The Accountant is a pretty good movie, but I found it quite predictable and a little too long. The story is good and there are amazing twists in it. Lamar Blackburn being the big baddie was pretty obvious for me, while it was also clear to me that Braxton was the brother, because of the trailers for the second film. Although I don't think that would have been obvious if not for the trailers. The twist for the woman voice and the opening scene are definitely my favourites, I was shocked when the reveals happened. The characters are well-established and quite layered. I loved how we got to see Chris' everyday routine when everything is in order and when there was chaos. The themes of autism, family and morality are extremely well-presented, for example they didn't portray the dad as a full-on n*zi, but they also didn't shy away from showing how far he went with making his sons tough guys. The cinematography is pretty good, the lighting is what I liked the most. The action sequences are amazing, well-shot and well-staged. The editing is great, but the film could've been a little shorter for my taste. I think there was just a little too much buildup. The acting performances are spectacular for an action movie. The cast is amazing, Jon Bernthal has the kind of aura I like, Ben Affleck is just amazing, while Anna Kendrick and J.K. Simmons are also great. The Accountant is weird, because at first I didn't really like it, but after having rewatched it through a reaction video, I like it a lot more."
  },
  {
    "rating": "3.5/5",
    "review": "Feels like a worthwhile watch for anyone curious about what it means to find a sense of peace and self-acceptance—not through stillness, but through understanding the bigger picture and the hidden impact one can have."
  },
  {
    "rating": "3.5/5",
    "review": "I feel this movie was a bit bloated, adding a few moments and characters which weren’t really needed which bloated the run time. Ben Affleck was good though and overall there were more positives about the story than negatives."
  },
  {
    "rating": "3/5",
    "review": "This was a decent action movie with an interesting plot. Ben Affleck and Jon Bernthal both were excellent casting choices but I would have liked to see more scenes with them together."
  },
  {
    "rating": "5/5",
    "review": "A gem of a movie with light touches of humour and excellent action sequences. Highly recommend this movie too all..and if you have an accountant in the family they'll get a kick out of this movie. Great performances by all the actresses and actors involved."
  },
  {
    "rating": "4.5/5",
    "review": "I remember when I first saw this back in 2016. I liked it so much, I watched it practically three times in a row as I introduced it to my brother and a friend after I'd seen it the first time. Then I found out a sequel was coming and was pleasantly surprised. I had no idea until late last year. In preparation for the sequel, I re-watched this and my goodness, what a great film. It had been many years since I'd last seen it so in a lot of ways it was like watching the story for the first time (even though there were some things I had remembered). I'm not sure how accurate Affleck's portrayal of a highly functioning autistic was, but I don't care. This film was solid and the writing was pretty darn good as well. It requires paying attention, as there are intricacies to the plot that require it. But it's not that hard to follow if you do. I fully enjoy the experience of watching the plot unfold and finding out more about the characters played by Affleck and Bernthal. While it's not super action-packed, that didn't matter to me. In fact, I rather enjoyed the limited action sequences, as too many of them tend to desensitize me to what's happening. Highly recommended."
  },
  {
    "rating": "3.5/5",
    "review": "Unique and well acted, plot and twist were very predictable, but I can't say I've ever seen a movie that had a severely autistic man be a hitman before."
  },
  {
    "rating": "2.5/5",
    "review": "Photography: 2.5/5; I give this rating not for the shots (which are good, normal) but for the image quality which for 2016 is poor, it is not even that beautiful grain of old films, it is really bad quality. Music: 2/5; the soundtrack does not exist, there is the classic action movie soundtrack just put there to give a little movement, no characteristic soundtrack that sticks in your head. Actors: 3.5/5; the actors are nothing incredible yes but they are good all in all, especially Affleck did well in the part of the autistic. VFX/SFX: 5/5 I don't think there is much CGI, especially special effects but simple and those that are there are done well so I give it the maximum rating. Plot: 3/5; classic action movie that tries to differentiate itself with the feature that the protagonist is autistic and therefore this theme is also treated, does the movie succeed in differentiating itself? ssssni, that is, in the end everything that happens in action movies happens, it starts with the action, in the middle there is the action, between the middle and the end there is a bit of rest and then it ends with the final battle, there is also a plot twist but it is predictable; the action scenes are well done, there is better but they are not bad. Makeup and hair: 5/5; here too everything is done well. Settings: 2.5/5; nothing special, normal settings from a B-series movie."
  },
  {
    "rating": "4/5",
    "review": "Very entertaining and it shows that people with autism truly are underestimated."
  },
  {
    "rating": "4/5",
    "review": "We all need our mythical heroes. Like Shane, Christian Wolff serves justice and rides off into the west."
  },
  {
    "rating": "4.5/5",
    "review": "The Accountant has a decent story, a fresh storyline at least. I loved it the first time I watched it and have seen it a few times since. Great popcorn flick that has a great cast and no-one is bad in their role."
  },
  {
    "rating": "2.5/5",
    "review": "All the scenes with Ben and Anna were boring AF. Jon Bernthal makes this movie. Let’s just give him his own spin-off and be done with Ben."
  },
  {
    "rating": "4.5/5",
    "review": "It's another one of those movies that make you wonder if the professional critics watched something else. Does everything you want from this type of movie and is exciting throughout without the cheese of some"
  },
  {
    "rating": "5/5",
    "review": "⭐️⭐️⭐️⭐️⭐️ A Brilliantly Crafted Thriller with Brains, Heart, and Firepower! The Accountant is a rare gem — a film that dares to blend high-intensity action with razor-sharp intellect and actually pulls it off flawlessly. Ben Affleck delivers one of his most nuanced and compelling performances as Christian Wolff, a math savant with a mysterious past and a very particular set of skills. He’s both deeply human and completely badass — a combination that makes him one of the most original protagonists in recent memory. What sets this film apart is its ability to be smart without being pretentious, thrilling without being over-the-top, and emotionally resonant without ever slowing down. The plot is tight and full of satisfying twists, the action scenes are slick and hard-hitting, and the underlying message about neurodiversity is handled with genuine care and respect. With a stellar supporting cast, sharp direction, and a story that keeps you guessing until the very end, The Accountant isn’t just a great action movie — it’s a standout film in any genre. It leaves you wanting more in the best way possible. A must-watch, and a modern classic in the making."
  },
  {
    "rating": "4/5",
    "review": "Interesting plot, great acting overall a very good movie."
  },
  {
    "rating": "3/5",
    "review": "Aunque la historia avanza de forma lenta y en algunos momentos puede resultar confusa, la actuación de Ben Affleck destaca positivamente y aporta solidez al filme."
  },
  {
    "rating": "4/5",
    "review": "Love this movie. Hands down one of Ben Affleck's best acting performances. He absolutely nails his character. The story and the messaging is also very powerful. Big fan."
  },
  {
    "rating": "3.5/5",
    "review": "While the plot, setup, and character motivations are hard to understand, the action is good, and Affleck leads the film admirably. I do wish we had more Bernthal though... C+"
  },
  {
    "rating": "4.5/5",
    "review": "Watched it at least half dozen times. If that's the case,it rates a must see in my view. Slow at times, but if you watch it more than once. You will see depth."
  },
  {
    "rating": "2/5",
    "review": "The big twist ending was obvious as soon as the main characters were depicted as adults."
  },
  {
    "rating": "4/5",
    "review": "If you enjoy people who are perceived different succeeding. This movie is for you. I recommend."
  },
  {
    "rating": "3.5/5",
    "review": "Hadn't seen this for years but with the sequel finally coming had to watch again. Ben Affleck leads the film brilliant as the lethal autistic maths whizz, some engaging plot points and good shout outs. Not reinventing the wheel just a cliche story in a way about criminal activity but done with a different approach. Looking forward to Bernthal and Afflecks camaraderie in the sequel"
  },
  {
    "rating": "4.5/5",
    "review": "Aside from some of the holes in the plot and character development ,this movie will keep you throughly entertained. You've never seen Afleck so lethal. My wife and I loved it!. Looking forward to the second chapter of this story. Can't believe we waited this long."
  },
  {
    "rating": "5/5",
    "review": "Great movie!! Highly recommend watching it!"
  },
  {
    "rating": "3.5/5",
    "review": "I recently watched the film in preparation for its upcoming sequel and found it to be a compelling cinematic experience. The movie boasts exceptional acting and an engaging plot, which significantly contribute to its overall appeal. However, I believe the character portrayed by Anna Kendrick could be omitted without affecting the storyline. Ms. Kendrick delivered a stellar performance, but her role appears to add little to the narrative’s progression or resolution. Similarly, a few other characters could potentially be removed with minimal impact on the plot. Despite these observations, I thoroughly enjoyed the film and reflect on it positively. My enthusiasm for the sequel has only increased as I wait for it release."
  },
  {
    "rating": "4/5",
    "review": "This is a film where every actor finds their place perfectly. The Accountant offers plenty of appeal and impact for fans of intense, brooding action thrillers."
  },
  {
    "rating": "5/5",
    "review": "Filme é ótimo em todos os sentidos. Inteligente e com ação no ponto certo. Aguardo a continuação."
  },
  {
    "rating": "3/5",
    "review": "An action drama for math nerds. You know who you are."
  },
  {
    "rating": "5/5",
    "review": "This is such a great movie in every way....Can't believe I didn't hear about until this year...2025. Great role for Ben Affleck and solid performances by Anna Kendrick and J K Simmons and of course John Lithgow is always a treat even in minor roles."
  },
  {
    "rating": "4/5",
    "review": "Awesome film! His brother is such a dick at the end."
  },
  {
    "rating": "5/5",
    "review": "Never listen to the professional critics. Make up your own mind. A moving movie with the always excellent Ben Affleck."
  },
  {
    "rating": "3.5/5",
    "review": "Ben Affleck delivers an outstanding performance in The Accountant, a movie that showcases his versatility and depth as an actor. His portrayal of Christian Wolff, a math genius with a mysterious past, is both captivating and nuanced. Affleck perfectly balances the character’s emotional struggles with his exceptional skills, creating a complex and intriguing lead. His performance alone makes the movie worth watching, as he brings a unique intensity to the role that keeps you engaged from start to finish. The film’s pacing and writing are also commendable. The story unfolds at a steady rhythm, building suspense while providing enough depth to keep the audience invested in both the action and the character development. The plot is intricate yet accessible, blending action with psychological elements in a way that keeps viewers on their toes. The movie skillfully intertwines themes of mental illness, crime, and redemption, giving it a depth that elevates it beyond a typical action thriller. The Accountant may remind you of elements from other iconic films, like Matt Damon’s Jason Bourne, Robert De Niro’s Heat, and Russell Crowe’s A Beautiful Mind. This combination creates a fresh yet familiar vibe, offering viewers a compelling blend of action, strategy, and psychological insight. With all that said, the movie leaves you wanting more, and it’s clear that the groundwork has been laid for a thrilling sequel. I’m looking forward to The Accountant 2 and can’t wait to see where the story takes us next. Overall, this film deserves an 8/10 for its strong performances, solid writing, and engaging action."
  },
  {
    "rating": "2.5/5",
    "review": "A mess,but some good action set pieces. Plus Affleck isn't bad in the lead."
  },
  {
    "rating": "5/5",
    "review": "Solid action film loved it. Don't listen to the critics this is A solid action film not stupid although garbage so they don't like it lol..."
  },
  {
    "rating": "5/5",
    "review": "A masterpiece - I can't say more than that."
  },
  {
    "rating": "4/5",
    "review": "don’t find anything criticisable here!! i mean this storyline and this plot? get outta here!! the movie starts so innocent and after minutes you just get in love and wanna see more i love that they pick autism as a central theme def a movie you should watch if you usually don’t like Ben Affleck"
  },
  {
    "rating": "5/5",
    "review": "At first I thought the film would only focus on the disease. But the plot is spectacular and each thing was well explained. I'm looking forward to the second film."
  },
  {
    "rating": "4/5",
    "review": "Can't believe I waited 8 years to watch this movie. An autistic accountant who works for despicable criminals is called in to audit a technology firm and is put into a decision to walk away clean or try and save the young lady that brought the discrepancies in the books to light, I actually only bothered to watch the accountant because I saw a trailer for the second movie, but I'm glad I did."
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved this movie. Really liked the main character. Different from the Norm."
  },
  {
    "rating": "5/5",
    "review": "Been a while since Ben Affleck was in a movie that suited him! Can’t wait for the sequel."
  },
  {
    "rating": "5/5",
    "review": "A movie crafted with the same precision as the mind of the lead character. Critics of this film have obviously not studied film this is a brilliantly crafted entertaining pop film that is also well cast. Glad to see the audience score and can’t wait for The Accountant 2 !!"
  },
  {
    "rating": "3.5/5",
    "review": "Not a top 100 of all time , but certainly great for what it is. A humorous and quirky take on the action/drama genre. A great way to spend 128 minutes. And probably worth a second watch. 👍👍👍👍👍👍👍"
  },
  {
    "rating": "4/5",
    "review": "I kept passing by this movie because frankly I'm not a fan of Ben Affleck. But I finally gave in and watched it and I am very glad that I did. This is an above average action movie. It has a solid story and a nice twist at the end. I doubt that it's going to become your new favorite movie. It's not going to change your life. But it's a rock solid well put together action movie. And Ben Affleck apparently can play a badass. I had my doubts about that. I stand corrected."
  },
  {
    "rating": "5/5",
    "review": "Fantastic story & action!"
  },
  {
    "rating": "5/5",
    "review": "This movie wonderful. The twists and turns are surprising and the premise of him having autism and growing up how it did makes him an exceptional character."
  },
  {
    "rating": "5/5",
    "review": "It's easy to miss the underlying nuance of treasury agent JK Simmons deliberately recruiting (via extortion) an agent to replace him post retirement. He already knows who the accountant is as well as his moral code but wants his recruit to find that out on her own, not to arrest him, but to \"answer the phone\" when the accountant's adjunct (also a savant) calls with case solving tips. There's a high body count as with many action movies but this under-rated movie has many interesting layers that don't become obvious until the final quarter."
  },
  {
    "rating": "5/5",
    "review": "I do not think of Ben Affleck as one of my favorite actors but maybe it’s all the bad personal stuff I read about him that has made me think this. I like all of his movies that I have seen and The Accountant is at the top of that list."
  },
  {
    "rating": "4/5",
    "review": "Really enjoyed this movie. Thought that Affleck did a great job in this role. Script was decent and the plot was pretty solid. Great action scenes and cinematography. Would love to see what they do with the second one."
  },
  {
    "rating": "4/5",
    "review": "Sophisticated. Keep your eyes and ears open to get all the nuances."
  },
  {
    "rating": "3/5",
    "review": "As much a Ben Affleck has come in for criticism over the years, it’s fair to say that, given the right script (and/or the right part or director), he is actually capable of being more than just a passable leading man (even despite what that song said about him in ‘Team America: World Police!’). Therefore, it’s no surprise that he’d want to keep the momentum of his acting ability rolling by taking roles that may require a little more than just showing up and looking good. We’ve seen plenty of films about hitmen and plenty of those involve a – practically indestructible – leading man taking on scores of faceless bad guys with precision accuracy and never so much as getting a scratch. ‘The Accountant’ could quite easily slip into this kind of genre. However, what sets it apart is that our protagonist (Affleck) is both a hitman, due to his overbearing father taking extreme measures at getting him to ‘toughen up’ and ensure he doesn’t spend the rest of his life getting picked on or taken advantage and also an accountant. If you’re wondering why those two professions somehow work so well, it’s because Affleck plays an autistic hitman/accountant who’s therefore not just a bit socially awkward, but also amazing with figures on balance sheets and killing people with sniper rifles. And, our heroic pen-pusher gets tangled up in a job that involves both his professions when he audits some shady company’s books and gets more than he bargained for when the company’s director (played by the seemingly ever-evil John Lithgow) decides to ‘fire’ their new accountant (in more ways than one!). There’s definitely plenty of like about ‘The Accountant.’ It’s not just the run-of-the-mill action/hitman story that it could have been, as the whole ‘autism’ element does add an extra layer as to why Affleck’s character is like he is. However, an accountant-hitman’s life is never easy and a fellow hitman (Jon Bernthal) is hot on his case. I’ve been a big fan of Jon Bernthal since ‘The Walking Dead’ and he really does seem to be having a lot of fun in this role and it’s a pity he’s not in it more than he is. Instead, much of the plot isn’t taken up with the Affleck vs Bernthal, but with the ‘love interest’ for Affleck played by Anna Kendrick. I have nothing against her as she’s a perfectly capable actress, however it just seemed that this element of the film really was crowbarred in, just to add a love story into something that didn’t really need it. Overall, ‘The Accountant’ is certainly different enough to be worth a watch if you’re a fan of Affleck or the genre itself. However, whereas the premise is slightly original, the execution does contain the usual clichés you’d expect with a film like this."
  },
  {
    "rating": "3.5/5",
    "review": "Probably one of the best roles Affleck has ever performed. Playing an accountant with autism who works for a lot of nefarious groups and a sort of hitman when things go wonky is interesting given his generally wooden delivery. I was hoping we’d get a few sequels given he’s believable in the role as this accountant & killer & my understanding is we finally might."
  },
  {
    "rating": "5/5",
    "review": "Watch this if you're an autistic man, you will have a blast!! Some tropes here and there but overall felt more empowering than what some articles will tell you. Hilarious if you're in the community. (Definitely aimed at men though but I think that should've been clear with the genre)"
  },
  {
    "rating": "4/5",
    "review": "There are problematic tropes in regards to autism (mainly the unrelenting violence), but at the same time, there are also very nuanced and pretty stellar bits that depict positive autistic traits too."
  },
  {
    "rating": "4/5",
    "review": "I thoroughly enjoyed the dynamic between the brothers, but at times, there seemed to be too much happening, leaving several questions unanswered. The pacing was solid, building up to an exciting finale, though I would have appreciated more clarity on some of the deeper plot points"
  },
  {
    "rating": "4.5/5",
    "review": "Very entertaining movie, would recommend 👍🏻"
  },
  {
    "rating": "3/5",
    "review": "Na tentativa de ser um filme original sobre as incríveis peculiaridades do personagem, acaba pecando pela falta de verossimilhança."
  },
  {
    "rating": "5/5",
    "review": "An action movie with a heart? Brings the issue of autism to people in a truly entertaining manner. Affleck is fantastic as usual and I thought the casting overall was brilliant. Since I don't generally like Lithgow he was perfect as the bad guy and I loved Tambor as the old man. The ending really pulled at my heartstrings and the message is an important one. Be nice to kids that are \"different\". If he has you in his scope he will not miss!"
  },
  {
    "rating": "4/5",
    "review": "This was actually a decent movie. Can't wait for the sequel next year."
  },
  {
    "rating": "5/5",
    "review": "Amazing Ben Affleck takes on the role of autistic accountant perfectly I taught so many students with autism over my career and he perfectly plays that character perfectly. One of my favourite movies of all time ."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I’ve seen."
  },
  {
    "rating": "5/5",
    "review": "Fantastic film , Ben Affleck does an incredible job, very believable. The pacing and over all mood of the film is great. I’ve watched it three time and enjoyed it every time. Only thing I would change is the ending is a bit over done . Still it’s a 5 star movie"
  },
  {
    "rating": "5/5",
    "review": "Very underrated movie. One the best movies of all time."
  },
  {
    "rating": "2/5",
    "review": "Disjointed story. Writers tried to put to many storylines together. No follow through. The director and writers wasted a fine performance by Ben Affleck."
  },
  {
    "rating": "4/5",
    "review": "An underrated thriller. Excellent acting. Interesting concept. The final shootout is fairly typical and you have to suspend your disbelief from time to time. Ben Affleck seems drawn to characters who find redemption, and I like the way several of his films end: this one, The Town and The Way Back, to name a few."
  },
  {
    "rating": "5/5",
    "review": "This is good!!! I do not know why it received such a low score!"
  },
  {
    "rating": "4.5/5",
    "review": "Really enjoyed this movie. Great performances throughout. Some very good twists and good action. Great ending too. One of Ben Affleck's better performances."
  },
  {
    "rating": "3.5/5",
    "review": "I thought the forensic accounting stuff was pretty interesting and no, I'm not a nerd. I saw no need to turn Affleck's character into a action hero badass, it would have been better if he had used his brain rather than brawn to solve the case. Still, it's worth a watch, if only for Jon Berthal's excellent turn as a (semi) bad guy."
  },
  {
    "rating": "1.5/5",
    "review": "Weak plot, weak premise, weak everything. Predictable, dull and stupid, surely Affleck can do better than this. Its portrayal of autism is also highly offensive in pretty much every way. We certainly don’t need the upcoming sequel. Watched on Netflix."
  },
  {
    "rating": "5/5",
    "review": "This one is the best performance of Ben Affleck, he just disappeared and becomes “The Accountant”. But the movie itself is a great story, great police thriller and a great crime movie. My favorite from this actor."
  },
  {
    "rating": "3.5/5",
    "review": "A bit confusing and jumbled but well acted by all. Thrilling to the end. Deserving of a lot more than a fifty-something percent."
  },
  {
    "rating": "3.5/5",
    "review": "I would have never watched this because in my opinion Ben has no acting range whatsoever, however, my wife and daughter saw this at the theater when it first came out and both loved it. I recently watched it for the first time and must admit in my opinion it was Ben's best character I've ever seen him play while still stigmatized from how bad he was in movies like Boiler Room."
  },
  {
    "rating": "3.5/5",
    "review": "Not entirely sure what the message of this movie was. Tried to be deeper than it was."
  },
  {
    "rating": "5/5",
    "review": "Loved it. It was a way to over come a disability that was to me a positive way. He didn't hurt anyone who wasn't a bad guy or a threat. Could of been a series. Or definitely a second movie."
  },
  {
    "rating": "4/5",
    "review": "This film is very beige post at the same time it draws you in. The intrigue with the protagonists challenge and and how he overcomes. And what a twist!"
  },
  {
    "rating": "2/5",
    "review": "Ben Affleck's character is really annoying."
  },
  {
    "rating": "5/5",
    "review": "Great action movie. Would love to see a follow up."
  },
  {
    "rating": "2/5",
    "review": "Pretty average movie. I found myself waiting for it to end. That's not good when your watching a thriller. The plot and idea was good but the director did not do that good of a job pulling it off."
  },
  {
    "rating": "4/5",
    "review": "83%. 5/11/24: Pretty cool story about a kid with autism raised with his brother by their Army dad to channel his quirks. He becomes an accountant with dangerous clients and takes on a job and discovered embezzling and gets mixed with some equally bad actors . Good action and solid story. 3.5 rewatch"
  },
  {
    "rating": "5/5",
    "review": "Great action movie. Affleck’s acting was fantastic. Looking forward to sequels. Will watch again!"
  },
  {
    "rating": "5/5",
    "review": "I adore this movie! It brings enlightenment about a topic that the public knows very little about, broaching the subject of the different ways of dealing with autistic children. The love story subplots are equally interesting, including moral codes and perspective."
  },
  {
    "rating": "5/5",
    "review": "Great action flick. The twist was a little obvious though."
  },
  {
    "rating": "3/5",
    "review": "This dumb coworker suggested this and it was pretty entertaining, actually"
  },
  {
    "rating": "5/5",
    "review": "Yo, this movie kicked ass. I was not expecting it to be as good as it was. Affleck was awesome. J.K. Simmons was great. John Bernthral came through like always and killed it. Definitely worth the watch."
  },
  {
    "rating": "5/5",
    "review": "One of my favorite movies. One of the few movies that I have watched several times."
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed this movie more than I thought I would. Ben Afflecks acting skills really surprised me and the plot twists I didn't see coming. My favorite scenes in the movie were the flashbacks of the brothers as kids seeing how they grew up dealing with there circumstances and overcoming them with the help of there father. Very good movie."
  },
  {
    "rating": "4/5",
    "review": "Great movie looking forward to the sequel"
  },
  {
    "rating": "2/5",
    "review": "Everyone involved in the movie appears to have believed it was an excellent production, and yet it turned out terribly. So many successful actors in such a mediocre movie."
  },
  {
    "rating": "5/5",
    "review": "Drew me in from the start, Ben Affleck portrays this character beautifully and the storyline is so good. There are a few twists, one you see coming and a couple you don't. So so so good."
  },
  {
    "rating": "4.5/5",
    "review": "Genuinely a very good, enjoyable film. Surprised at the low critics score on this one."
  },
  {
    "rating": "4/5",
    "review": "Unique in its own way"
  },
  {
    "rating": "1/5",
    "review": "HR Block meets Rambo exploiting autism as its underlying theme! Pathetic!"
  },
  {
    "rating": "5/5",
    "review": "FANTASTIC MOVIE!!! A must see 10/10"
  },
  {
    "rating": "5/5",
    "review": "Without a doubt Ben Afflecks best movie. Seen this numerous times and enjoy it each time. Stoked to here the sequel is in the works."
  },
  {
    "rating": "1.5/5",
    "review": "The opening scene - shot from an awkward, disorienting angle -should have been my first clue not to waste my time watching the movie. It was a jumbled mess that left more questions than answers. Ben Affleck's inconsistent facial expressions were a regrettable portrayal of someone on the autism spectrum."
  },
  {
    "rating": "5/5",
    "review": "love this movie watched it twenty times"
  },
  {
    "rating": "5/5",
    "review": "One of my favorite movies. I have watched it a few times now. Great acting, great story. When you have been around for decades and have seen most every movie released you realize there are only a very few that make you feel really good - that you never get tired of, that have characters you like and action that keeps you riveted and a plot that while maybe not perfect is not completely full of holes. This is one of those great movies. The cast was brilliant, and the filming was genius. The negative critics of this movie in these reviews have shallow and weak views, they are all symbolism and no substance kind of people. I see the garbage movies that get awards in Hollywood by these shallow type of people, the garbage they tend to like, and it actually makes me appreciate this movie even more that they are whining about it in these reviews. It just shows just how wrong they are. This is a great movie."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed the film. Storyline was interesting and well executed. Ben Afleck was very credible in his role and when the movie was finished there were no loose ends."
  },
  {
    "rating": "5/5",
    "review": "The best movie I've seen in months. Little slow starting out, but once it started moving, good action by Ben Affleck. Sitting on the edge of your seat type of thing."
  },
  {
    "rating": "4/5",
    "review": "An absolutely fantastic movie! How anyone could not see the beauty in this story. With all we hear about autism. Everyone always tries to treat it as a disability. What if we were wrong? What if it could be a strength? Ben and Anna are also incredible."
  },
  {
    "rating": "4.5/5",
    "review": "This movie was excellent. Absolutely worth watching."
  },
  {
    "rating": "3/5",
    "review": "The Accountant is an okay film. It is about a math savant who uncooks the books for a new client. Ben Affleck and Anna Kendrick give decent performances. The script is a little slow in places. Gavin O'Connor did an alright job directing this movie. I liked this motion picture because of the action and drama."
  },
  {
    "rating": "3.5/5",
    "review": "\"The Accountant\" is an insane thriller, which is sadly messy and has plenty of tone issues, but those are probably my only complaints of this. This is a great story with a great cast and some banging action, and the twists in this were great as well."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is as idiotic as it is delusional of it's said roles within a fabricated web of lies when it comes to the accounting profession. This movie tries to portray Ben Affleck as a suppressed \"genius\" who can't help but give way to his forms of self mutilation or so called \"discipline\" tactics. This destructive pattern of behavior leads to Affleck shooting big guns at the bad guys in order to save the day. The accountant's balance between the dull and mundane life of crunching numbers and his lethal weapon skills can't coexist. This lifestyle puts up a fight against the weakest links in the sniper industry. Fuck this movie it's fucking stupid. I'd rather watch one of Afflecks Dunkin Donuts commercials on repeat."
  },
  {
    "rating": "5/5",
    "review": "I am often baffled by ratings here. Napoleon is the best example I can think of. Who doesn't love a Ridley Scott historical drama with great acting, cinematography, and an insanely good score!!!!!!"
  },
  {
    "rating": "2/5",
    "review": "Vaguely exploitative junk, which didn't know how to land the ending. The many storylines felt like clunky sets up for anticipated sequels: Jack Ledger? The Affleck/Anna Kendrick interaction was DOA so not credible to drive the action and Jon Bernthal's character played too lurid to be the properly menacing foil required to end the movie properly. Some unintentionally funny bits, like where Afflect's genius accounting chops established by working out you could tax deduct some vehicle expenses (wow), meant the less the whole exercice was thought about the better."
  },
  {
    "rating": "4.5/5",
    "review": "I'm with the audience on this one, The Accountant is an excellent, fast moving movie. I could perhaps say its Ben Affleck 's best performance to date. Well worth two hours of your time. Could there be a sequel ?"
  },
  {
    "rating": "4/5",
    "review": "Watched this with low expectations but actually really enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "Excellant Movie. The story line was great and the Silat was even better. Jonesing for the next installment...."
  },
  {
    "rating": "5/5",
    "review": "Enjoyed it, we found ourselves rooting for a killer. It was intriguing and a good afternoon after-too-much-lunch watch. Ben Affleck was very believable as a man with autism."
  },
  {
    "rating": "4/5",
    "review": "I liked it! It's an action film that delivers on its promise. It's not the most mind blowing script ever and there's definitely room for improvement (such as the elaborate mid film explanation for the protagonists back story and motivations) but there's fighting and guns and cool scenes that are just enough for me to turn my brain off and enjoy."
  },
  {
    "rating": "5/5",
    "review": "To begin with, it is an excellent length film at 2 hours sharp. Within this time, they showed a substantial amount of depth and history of characters and managed to tie all these loose ends beautifully. To contrast all these negative reviews about lack of depth, I say watch a 4 season series and not a 2-hour action film. Character depictions were spot on. In particular, the portrayal of Christian's autism. Elements of personal growth and critical values of the characters."
  },
  {
    "rating": "5/5",
    "review": "Christian Wolff, is a certified public accountant, a very good and very efficient one. He has his own office in a small-town in Illinois. But Christian really makes his living working freelance, finding leaks in the books of organized crime and terrorist organizations all over the world. Christian is also autistic, diagnosed when he was a child. When Christian's face continues to show up with some of the world's most dangerous criminal organizations, the Treasury Department takes notice and starts investigating him. What they don't know is once you get on Christian's bad side, he becomes a very efficient, very deadly, merciless killer. Now when the Living Robotics company in-house accountant, Dana discovers a few accounting irregularities, they hire Christian to audit their books... going back for the past 15 years. Well in less 24 hours, he finds a lot of money has been embezzled. \"61 million, 679 thousand, and some change\" - Christian He still has yet to find who the thief is, but that night Living Robotics' CFO Ed Chilton is murdered, and the next morning Christian returns to find all his work erased! Owner Lamar Blackburn pays him off and tells him he is done... and Christian is unable to finish his work. Christian does not like leaving things unfinished. \"I have a high-functioning form of autism, I have an extremely narrow focus and a hard time abandoning tasks once I've taken them up.\" - Christian But someone else has taken notice and a hitman tries to kill Christian.... unsuccessfully and Dana is next on their list. Christian can easily escape and start over some other place, but he decides to do something, and save Dana. \"If I don't do something, Dana will die.\" - Christian He has a simple plan. \"Find the person who wants to kill her. Shoot them in the head.\" - Christian And then Christian will be finished. Although this movie is a very violent action thriller it is also a character driven dramatic study about one man growing up with autism. The story is smart, clever, with a couple of cool twist and turns... and I love the flashbacks to Christian's childhood. Through these flashbacks we see why Christian is who he is, and why. But it is Ben Affleck's subtle performance that makes the movie. He is absolutely brilliant! Totally a 5 Star performance in a 5 Star movie. \"That was the end of Solomon Grundy.\" - Christian Cast - Ben Affleck, Anna Kendrick, J.K. Simmons, Jon Bernthal, Jean Smart, John Lithgow, Jeffrey Tambor, Cynthia Addai-Robinson"
  },
  {
    "rating": "5/5",
    "review": "Great movie, watch it 5 times already."
  },
  {
    "rating": "5/5",
    "review": "Exciting, edge of your seat thriller. However, Ben Affleck as an autistic svante is a little hard to believe."
  },
  {
    "rating": "5/5",
    "review": "When I first saw the title of this movie I didnt know it was a shooting movie. I thought it was a boring movie of a business accounting. But nope I was wrong and turn out to be a great movie."
  },
  {
    "rating": "5/5",
    "review": "Action, but with real insight into how \"labels\" shouldn't define an individuals ability, and we can all excel at whatever we set our minds at."
  },
  {
    "rating": "4/5",
    "review": "I'd strongly recommend ignoring forever any reviewer who gave this less than 4/5. Expertly paced, slick and original, with the exception of the unnecessary sideshow of the justice woman, compelling stuff throughout."
  },
  {
    "rating": "3.5/5",
    "review": "\"The Accountant\" is an entertaining thriller movie that has its moments. The performances of the cast and the action scenes are highlights, but the pacing issues and underdeveloped subplots hold the movie back from being great. If you're a fan of action movies or Ben Affleck, you will enjoy \"The Accountant."
  },
  {
    "rating": "5/5",
    "review": "I'm more than quite impressed by Ben Affleck's acting in this movie. I once worked with a guy with Asperger's…dude was smart AF (Yale undergrad, Harvard Law). Affleck's acting is just really well done portraying this character. And the writing on this movie, especially the flashbacks, are just well done. Good acting, good action, good writing/dialogue."
  },
  {
    "rating": "4/5",
    "review": "Surprisingly entertaining"
  },
  {
    "rating": "4/5",
    "review": "Enjoyed the movie. Good action. OK story. It just got 4 stars for me."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed this movie. I don't know how I missed seeing it since it is several years old. I enjoyed the overall storyline and the ending. Definitely worth a watch."
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing! Good plot, keeps you interested, targets an amazing population and is well acted and executed!"
  },
  {
    "rating": "3/5",
    "review": "An overkill basically, which I think perfectly describes how its many characters, plotlines, twists, flashbacks overcomplicate its good premise-concept that could have had more potential, resulting in a hard-to-follow narrative."
  },
  {
    "rating": "2/5",
    "review": "Takes blatant influence from John Wick, but this is the very weak and dull version. A seriously flawed film when it comes to believability and story. The young woman accountant leads a totally normal life, and when she is attacked by hitmen and sees them all blown to bits in her apartment, she immediately takes it all in stride and is totally unphased and perfectly willing to have a nice breezy relationship with the man who did all the killing right in front of her. That part is utterly nonsensical. The killer accountant is also boring and uninspiring as an action film hero. The plot and story are a bit too complicated and obviously overthought, but poorly explicated and assembled. It is kind of a revenge story, but not much drives it, and you soon realize it is all meaningless. Evil corporate types, shady dealings, killing, coverups, etc. Standard fare, served lukewarm. The characters are made to try and explain it all through long expository sections of dialogue, but none of it makes any sense that is worth caring about. A film with very little to offer, mostly just hackneyed fighting and shooting and other violence that adds up to \"yep, seen all that before.\" And, just in case it might sell more views - martial arts. Yup."
  },
  {
    "rating": "3.5/5",
    "review": "Good plot and maybe an even better cast! A little unbelievable and exaggerated, but I would recommend for anyone to watch that loves an underdog who comes up and murders a bunch of treacherous bastards!"
  },
  {
    "rating": "4.5/5",
    "review": "I loved this movie. It's an action movie with an interesting plot with an unlikely hero. Hope they make a sequel"
  },
  {
    "rating": "5/5",
    "review": "Its easily one of Bens best movies, and one of my favorite movies, as well as my dad's."
  },
  {
    "rating": "5/5",
    "review": "Great movie and story. Love this movie."
  },
  {
    "rating": "5/5",
    "review": "Once again, the critics don't know what they are talking about and are out of touch with mainstream audiences. Ben Affleck did a great job. This movie was a pure adrenaline rush and action packed. Excellent script, plot, acting, and storyline."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie. Only downside is so called ctitics who dont see it for wat it is, great entertaiment!"
  },
  {
    "rating": "5/5",
    "review": "This movie is so well done and so enjoyable. Ben Affleck shines in this role and the story is more than compelling and it is the type of move you watch until the end and I sure hope there is another one with him in it reprising this role."
  },
  {
    "rating": "4/5",
    "review": "Um ótimo filme de ação para passar o tempo !"
  },
  {
    "rating": "4/5",
    "review": "Way underrated film. Great cast, sharp dialogue, good pace. Worth it."
  },
  {
    "rating": "5/5",
    "review": "This was a massively underrated movie. It's an amazingly paced shoot-em-up that never gets boring. Affleck, JK Simmons, Bernthal, Kendrick, Tambor... you can't even ask for a better cast and they ALL deliver. It really deserves a sequel."
  },
  {
    "rating": "3/5",
    "review": "Not bad, not great. The movie should of gone harder on the nerdier aspects of this flick, rather than go down the shoot'em up path of the final 1/3."
  },
  {
    "rating": "3.5/5",
    "review": "I've been told on many occasions I pick good movies so wth, thought I'd donate my 2 cents with all the profoundly intelligent and intuitive people that give you insight to watch a movie. Quite simply,if you like Ben Affleck,you will enjoy this thrill -ride. I found myself rooting for him from Childhood, autistic, intelligent and doing the framework for his future role as Batman,( this movie might be better). Anyway thumbs up! Not gonna waste any more of ur time by giving away the plot.Its a good watch and worth the time.✌️"
  },
  {
    "rating": "5/5",
    "review": "This movie's story ties in better than any movie I've seen yet. Killer action along with a 100% accurate portrayal of each characters conditions. Absolute must watch for anyone. The score will also make a good addition to any Spotify playlist."
  },
  {
    "rating": "5/5",
    "review": "The critics are so wrong on this one. It's excellent."
  },
  {
    "rating": "4/5",
    "review": "A bit long & complicated but easy to follow with excellent acting. What a line-up of stars in this film! Interesting topic of a math savant with autism combined with intense fighting skills."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie! Lots of action with a great who done it plot! Ben Affleck gave a great performance of a man struggling to deal with himself. I would definitely recommend to all action movie fans!"
  },
  {
    "rating": "4/5",
    "review": "Really enjoyed this movie, moved along quite nicely, a few plot twists to keep you guessing and an open ending suggesting a sequel......good action and always kept my attention....."
  },
  {
    "rating": "1.5/5",
    "review": "Lots of inconsistent in the story line and loopholes..Ben aflek is good the action is good..directing is good..but the story fumble"
  },
  {
    "rating": "4/5",
    "review": "Ben Affleck. Anna Kendrick. What could go wrong? Not much does and I found this to be great commentary on rethinking which side of the aisle a character falls. Ran a bit long for me, but the heart of the story remains throughout particularly the reveal of the accountant's sidekick. It's a team effort through good ol' fashion investigative work. Effective redundancy with so many layers. Appreciate this one."
  },
  {
    "rating": "2/5",
    "review": "Very convoluted plot, too long, formulaic, kitchey, with a silly premise. Affleck's character has Asperger's syndrome, which apparently meant that he could not smile and needed to scowl constantly, so the acting was rather undemanding. A waste of time for me."
  },
  {
    "rating": "5/5",
    "review": "Honestly, I think THE ACCOUNTANT should be embraced, remembered, and looked upon in the near future, not only because of the story or the action sequences, but because of the way people with autism share their experiences from their point of view."
  },
  {
    "rating": "4/5",
    "review": "Rating: 8/10. 80/100"
  },
  {
    "rating": "3/5",
    "review": "Decent movie but it's drawn out and the ending is underwhelming."
  },
  {
    "rating": "4/5",
    "review": "If you like action movies that may have slipped by you when first released, this one is worthwhile. A lot of gun fights and shootouts and you don't need to focus on minor plot details, just relax, watch, and enjoy the show. Runs a little over 2 hours but the time goes fast."
  },
  {
    "rating": "3/5",
    "review": "Plenitude of power fantasies, where no matter the ailment it's up to you to choose if you're going to let the world get you down or become an international assassin/fixer/criminal accountant. This one is for people on the spectrum. It is hard not to roll your eyes because of the hefty number of plot twists that the movie thinks no one will figure out beforehand. And it's also hard not to lampoon the obligatory romantic interest character that they give up on, seemingly because of how awkward it becomes. Ben Affleck's acting is decent even if he is fundamentally playing the stereotype of an emotionally stunted autist who really can't show any expression besides slight concern. However, the volume of his mannerisms makes him gratifying to watch."
  },
  {
    "rating": "5/5",
    "review": "Great film. Great plot. Great action scenes. Great lead character. No idea why critics didn't like it."
  },
  {
    "rating": "4/5",
    "review": "Don't look at what the critics have said. This is a seriously good film and I would highly recommend watching it."
  },
  {
    "rating": "5/5",
    "review": "I think the 'critics' rating of this film just shows how disconnected establishment critics are from what people actually like. The film is action-packed and full of twists and turns that keep the audience on the edge of their seats. Affleck delivers a strong performance as the title character, and the supporting cast, including Anna Kendrick and J.K. Simmons, also give solid performances. Overall, \"The Accountant\" is a well-crafted and engaging film that is sure to please fans of action, thriller, and crime dramas."
  },
  {
    "rating": "3/5",
    "review": "Good action. Decent story. Good acting"
  },
  {
    "rating": "5/5",
    "review": "This was a great action/mystery movie. Not woke at all. None of this 'moral gray area' business; there are good guys and bad guys. Just really solid film."
  },
  {
    "rating": "4.5/5",
    "review": "I liked this film very much. In fact, I watched it twice because I wanted to catch the subtleties that I missed the first time around. The protagonist, the Accountant, is a bit like a superman. I enjoyed the various situations in which he found himself and the ways in which he extricates himself from deadly situations. The fight scenes were extremely well-done and the movie has a plot rather than being filled with constant death and blood like the John Wicks series. I wish, however, that there had been a greater film presence of John Lithgrow and Jean Smart, two of my favorite actors. The actress that played the accountant with the robotics firm, Anna Kendrick was absolute perfect for the character. Alison Wright was a super surprise at the end of the movie and Jon Bernthal was adequate. The only character that I didn't particularly care for was Marybeth Medina played by Cynthia Addai-Robinson. The upshot is: Watch the film twice and everything makes perfect sense."
  },
  {
    "rating": "3/5",
    "review": "I enjoyed this film - the plot seemed quite well thought out, its relatively thought provoking and not just full of action scenes, although there are some quite good action scenes as well. Its by no means a stuffy film, although you could be excused for assuming it might be given the title - I think its fair to say that accountants aren't generally expected to have esp. interesting lives but this one in particular certainly does. Its not entirely original, as there have been a particularly high number of films out in the last 5-10 years about greed incl. corporate greed. It features a decent cast with Ben Affleck, Anna Kendrick and John Lithgow - the stand out performance in my eyes being from Anna Kendrick - her character, Dana Cummings, intrigued me. I enjoyed the plot development and thought it was one of the better action/thriller films I've seen recently, so I'd recommend it on that basis."
  },
  {
    "rating": "5/5",
    "review": "This ticked all the boxes for me. I absolutely loved this! The action, the twists and parts that made me laugh. Had some heart-warming moments, so just the total package. Affleck was sensational in this!"
  },
  {
    "rating": "5/5",
    "review": "This movie is a great movie with tons of depth in it. Without giving any spoilers, it's about a man who has autism and is an \"accountant\" with a past that is hidden and this movie goes into some of his past and how he grew up and what he went through and how it effects him now. There are other main characters that you get to know and they dig into their background a bit as well. There is actually lots of depth to this movie and lots of subtle things done that make you realize it's fairly well thought out."
  },
  {
    "rating": "3.5/5",
    "review": "The accountant starring Ben Affleck is a thriller about a mysterious accountant played by Affleck suffering from Autism who helps criminals around the world. Yet one day as he is being hunted by the government he takes a job that puts him in the middle of a conspiracy. The film's pace is very slow and it takes its sweet time to deliver on the promise of the premise. Affleck does a great performance portraying a man who has many layers, at times a reclusive shy socially awkward man at other times a dangerous assassin. The movie takes long to get interesting which hurts the first act but by the second act we become invested in this story. J.K. Simmons does well in a supporting role as Ray King of the Treasury Department hunting down the accountant. John Berthal as the antagonist is really good as the antagonist. The movie ends with an intense climax and has many things going for it, but is hurt by its very slow pace and slow buildup and sometimes confusing storyline."
  },
  {
    "rating": "5/5",
    "review": "Excellent - made for John and Ben - keep these up, you are both good for these type of movies and if you make these , they will keep on watching."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is surprisedly unvalued on rotten tomato. The action, story and music are fabulous! Movie is about an autistic guy who is also mathematically genius, he goes crazy when vacuum turns on, he wear one shirt, and he does not let anyone hug him, and very sensitive with loud nosies, bright lights ... his turmoil childhood starts the mother left family, after then father trained him and his brother karate and some fighting skills. When he grew up, he become a professional accountant and master killer. Can we imagine the possibilities of autism people have a normal life if involve the special education or this are lifelong issues with them? I love this movie because from story begging the missing puzzle game, the parents, doctors, educators provided different perspectives..."
  },
  {
    "rating": "5/5",
    "review": "Thoroughly enjoyed it. The way that they set the scene, then used flashbacks to explain how the current situation had been reached. Clever twists that meant your perception of 'The Accountant' changed as more was revealed. Kept me involved throughout - and without the need of me needing to ask someone else 'what did that mean'? I actually got it!"
  },
  {
    "rating": "3/5",
    "review": "Could have been epic but too many plot holes."
  },
  {
    "rating": "4.5/5",
    "review": "Wow. this is criminally underrated. as someone with an autism spectrum disorder, i expected the movie to be offensive or misrepresent the autistic community along the same lines as rain man - i.e. \"autism superpowers\", but i gave it a shot and overall it was a great film. affleck does a great job, and the script has clearly been scrubbed by some kind of advisor to make sure they don't add anything offensive. it still is about autism superpowers, but i found it to be quite tactful in spite of that. i would definitely recommend it to a friend."
  },
  {
    "rating": "4/5",
    "review": "This is an underrated movie. John wick, take , revenge movie type elite killer with a good backstory somewhat of a twist."
  },
  {
    "rating": "4/5",
    "review": "Can you imagine an autistic Jason Bourne who's a genius with numbers? That's the accountant played by Ben Affleck. The accountant isn't a spy. He's a forensic accountant who works for the shadiest of characters. The majority of critics disagree, but I think this is a terrific movie."
  },
  {
    "rating": "4/5",
    "review": "Seen it several times, just now once again. I like it. Ben does a good performance. Anna was type casted very well for this movie."
  },
  {
    "rating": "5/5",
    "review": "Great idea intriguing storyline and perfect casting an absolute joy of a film"
  },
  {
    "rating": "2.5/5",
    "review": "While I appreciate The Accountant's unique subject: an autistic hero using his analytical gifts for good (he's basically a CPA with a black belt), Affleck's outing as a mysterious Jason Bourne-like action hero is unfortunately about as dull and lifeless as his turn as Batman! The Accountant begins well enough but becomes more complicated and confusing along the way then, downright laughable by the end. In fact, based on a couple flashback scenes early on, I anticipated the climatic reveal in the first 30 minutes! The wonderful Kendrick does her best with her limited role, but she's miscast here—there's frankly no reason for her presence other than to provide a victim for Affleck to protect. Also, I sensed little romantic connection between the two, if that was what the audience is supposed to accept. Additionally, the talented Smart is wasted and Lithgow looks perplexed and uncomfortable most of the time—I have to admit I felt exactly the same way throughout this film!"
  },
  {
    "rating": "4.5/5",
    "review": "Really loved it. Should be a franchise"
  },
  {
    "rating": "5/5",
    "review": "It was a good movie about someone with autism, it had alot of good action in the movie too."
  },
  {
    "rating": "4.5/5",
    "review": "The most Affleck of all Affleck movies"
  },
  {
    "rating": "4/5",
    "review": "Good plot that slowly brings all the thread together. Very enjoyable."
  },
  {
    "rating": "3.5/5",
    "review": "Between 3 and 3.5 stars. Inteligent action movie with a few surprises hidden."
  },
  {
    "rating": "5/5",
    "review": "LOL, I love this drama!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "2/5",
    "review": "Will Hunting with autism and an assault rifle. A production that obviously suffers from too many cooks in the kitchen. Scattered with little reward."
  },
  {
    "rating": "5/5",
    "review": "Love this movie. Affleck's character is amazing."
  },
  {
    "rating": "4/5",
    "review": "The Accountant struggles to keep track with multiple moving parts of an already relatively complicated plot and has a plot \"twist\" that I figured out from the moment Jon Bernthal's character was introduced but it remains a surprisingly well-made action thriller with a more unique protagonist than we're used to seeing whilst not having him be the usual stereotypical \"Rain Man\"-type manchild, terrific performances, gripping action sequences and successfully executing its A-story. It's not the greatest movie known to man but I wouldn't mind seeing a sequel come out. Also, though their paths sadly don't all overlap, you've got Batman, the Netflix Punisher at the height of those Marvel shows' popularity and J. Jonah Jameson in the same movie, what's not to love?"
  },
  {
    "rating": "4/5",
    "review": "I think what a lot reviewers miss here was the ability to bring the subject of autism into an action thriller and help normalize it for the viewers. I agree that if element were not there, outside of Ben Affleck's excellent performance it would rate more like a few stars. However, the difficulty in the interweaving that parallel thread into action/thriller without stereotyping or over generalizing it was well done and should be applauded. I enjoyed the movie."
  },
  {
    "rating": "5/5",
    "review": "One of my families absolute favourites"
  },
  {
    "rating": "3/5",
    "review": "Sadly it fell apart at an increasing pace after about 30 minutes. Too many threads - was it originally longer. The romance vanished, and most fatally the personality of the investigator and her relationship it are boss completely changed for unsure to cook sure. A pity - a waste of talent and money.!"
  },
  {
    "rating": "2.5/5",
    "review": "5.0/10 — \"Poor\"/\"Inferior\"/\"Amateurish\""
  },
  {
    "rating": "3.5/5",
    "review": "Though its interesting to see a movie about a high skilled accountant, which is not usual; what i didn't like much was the mixture of this character with a weaponry specialist, it simply doesn't match. However, this action thriller is entertaining."
  },
  {
    "rating": "4/5",
    "review": "I liked it, rewatch every time it's on TV."
  },
  {
    "rating": "2.5/5",
    "review": "I'll start with saying Ben Afflect was great in this role and did a really good job. However, that doesn't mean this movie has problems. I felt like this movie has an identity crisis. Like it wants to be this on the run action movie at the start, but then as we keep getting more exposition and back story. Then it goes for a dumb twist and the movie closes in on it self as fast as possible. The whole side plot with JK simmons felt useless. In the end this film was an okay action drama, that you can watch and forget."
  },
  {
    "rating": "5/5",
    "review": "This is one of the best movies I have ever watched. It grabs you from the beginning and you want to watch it again and again to see if there was anything you might of missed."
  },
  {
    "rating": "4.5/5",
    "review": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 1,5"
  },
  {
    "rating": "2.5/5",
    "review": "Somewhere near a decent action thriller film. Perhaps its story is a bit unfocused, but I enjoy the ensemble feel and the license given to Affleck, Kendrick, and Simmons to put decent performances together. Bernthal, Addai-Robinson, and Lithgow also perform competently enough. Sure, the whole plotline is implausible, but as cinema there are few things more surprisingly satisfying than witnessing an unleashed savant, Ben Affleck, effortlessly kill baddies and calculate numbers and stuff. Writing that sentence out really made me reconsider, I must say. Kendrick might not be everyone's cup of tea, but I found her performance extremely likable with a slight lack of direction. Same for Simmons. Same for Bernthal. Same for the whole lot, really. In the moment, you watch it with interest, but this one never makes the leap of ambition to become anything more than serviceable. The villains are dubious and the ending bad enough to drag proceedings down considerably, a shame considering the project's potential. Add this to a few strange plot twists, and I was extremely unbothered when the film ended."
  },
  {
    "rating": "2.5/5",
    "review": "If you have nothing else to watch then you might fire it on, otherwise I wouldn't bother."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie."
  },
  {
    "rating": "4/5",
    "review": "I liked it ; but, I am a degreed accountant and ex u.s. army plus I am a Matt Damon & Ben Affleck fan too. If you like this movie then definitely see THE TOWN ENJOY! One more thing! Every company hides $$$ somewhere somehow so that accounting error the young lady finds is usually how it goes down the auditors are in cahoots with the companies they audit now back to the movie :-)"
  },
  {
    "rating": "2.5/5",
    "review": "The plot is too scattershot, and Affleck's character too cold; simply giving the character a personality disorder does not make him alluring."
  },
  {
    "rating": "5/5",
    "review": "The Accounted is a very well made action thriller with great talented actors."
  },
  {
    "rating": "0.5/5",
    "review": "What a surprise, the Hollywood take on Autism is a man who goes around beating up everyone, shooting up everything, has an aresenal of weapons and a prepper style hide out. Batman without the suit. A cynic might even say they used Autism to avoid having to develop a multi-dimensional character, which is not just lazy but deeply insulting. The most dangerous parts weren't even the shootings, they were the underlying suggestions that if he could just find the right woman he could have a \"normal\" life and be less Autistic. Apart from that, a long sequence of weapons discharge and little plot. It would have been better if it was Batman because that is a one dimensional character for a reason, it serves a purpose."
  },
  {
    "rating": "2/5",
    "review": "Basically a low budget Jason Bourne with some weird promotion of autism being a superpower. The story was frankly garbage. The investigation, the military dad teaching his kids to fight, the weird cover up from the CEO (or whoever he was), and the 'I'm your brother' twist was all as silly as it gets. The characters were also a complete mess, and some of the acting felt noticeably fake (e.g. Cynthia's performance). However, Ben Affleck, Anna Kendrick, Jon Bernthal, and J. K. Simmons gave acceptable performances, albeit far from their best. The action was enjoyable enough, and the cinematography and visual effects were fine, but the soundtrack was forgettable. Below average overall and not worth a watch."
  },
  {
    "rating": "4/5",
    "review": "The ending was quite a letdown. The rest of the movie was fantastic. It's just...we get to the end and are overwhelmed by how improbable it all is. Also Jackson Pollock paintings are just ugly."
  },
  {
    "rating": "3.5/5",
    "review": "2019-2-26 The accountant has a good looking, good figure, tons of money, difficult life, not be able to communicate with people normally. Me having none of those and feeling difficult to get a balance life in the society. Which one is better? Hmm .."
  },
  {
    "rating": "3.5/5",
    "review": "La trama está bien y las escenas de acción son decentes; sin embargo, la actuación de Ben Affleck es excelente."
  },
  {
    "rating": "1/5",
    "review": "So many coincidences, and offensive in so many ways"
  },
  {
    "rating": "5/5",
    "review": "I love love love this movie. Lots of action, great story telling (even if it did take some time to put it all together), and it checks all the boxes for what I judge a movie by (acting, characters, and plot). Great acting, excellent characters, and a superb plot! I would definitely recommend watching as it will have you on the edge of your seat until the very end. On a side note, am I the only one that thought the song played at the end of the movie sounded like Sylvester Stallone singing as Rocky Balboa & John Rambo put together? Ok, maybe that was just me. LOL!"
  },
  {
    "rating": "4.5/5",
    "review": "Hope they make a sequel. Reminds me of John Wick."
  },
  {
    "rating": "5/5",
    "review": "The critics have been harsher than warranted with this film. I enjoyed it immensely with fine acting by all and honestly... it's more than time we start seeing characters with autism portrayed with agency and purpose."
  },
  {
    "rating": "3/5",
    "review": "The Accountant trova forza e debolezza nelle caratteristiche del personaggio di Ben Affleck, che però, dopo la spiegazione iniziale sulle sue patologie, diventa praticamente un uomo perfetto; soldato imbattibile, contabile migliore al mondo e anche in grado di provare sani sentimenti. Cosi diventa troppo facile prevedere un lieto fine. Interessante il ruolo di Jk Simmons."
  },
  {
    "rating": "3.5/5",
    "review": "Could have been better written to enable a balanced narrative structure for a more anticipating/page-turning unveiling regarding true identification rather than being already in the know and waiting for the subplot to figure out which would give the twists the rightfully impactful weight. Nonetheless, the overall delivery is entertaining enough from the typically beneficial, solidly casted performances and well executed action sequences including the peaked climax powered by effective somber score. (B)"
  },
  {
    "rating": "4/5",
    "review": "This movie was a lot more nuanced than I expected. Very well done. Worth watching again."
  },
  {
    "rating": "3/5",
    "review": "Gavin O'Connor dirige a Ben Affleck y Anna Kendrick en ésta historia sobre un contador que se dedica llevar los libros de personas que se dedican a actividades ilícitas. La historia es muy entretenida y no me gustaría arruinarles la experiencia contándoles más detalle. Es una premisa simple, con las herramientas narrativas más utilizadas en éste género. A pesar de los altibajos de la película en cuanto a ritmo y algunos clichés que pueden hacernos voltear los ojos, la película en cuanto a acción y mantener el suspenso hasta el final es muy efectiva. Es una buena película para pasar el rato, sin trascendencia."
  },
  {
    "rating": "3.5/5",
    "review": "The action film with an interesting plot. Different from the others, recommended."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed this one from start to finish as the story keeps engaged and especially the end when it ties it all together. Great cast too and leaves it open for a possible sequel"
  },
  {
    "rating": "3/5",
    "review": "The Accountant is a film that, through a somewhat convoluted plot, fulfills in satisfying those who like to go to the cinema in search of police action. With some well-crafted dark passages, through high-tension scenes and well-defined characters, this is a movie that gets the job done and will keep your attention full."
  },
  {
    "rating": "5/5",
    "review": "Seriously, critics?! Have a word! Great performance by Affleck, in what is a brilliant movie!"
  },
  {
    "rating": "4/5",
    "review": "Despite the professional critics calls of stereotyping aspergers, Affleck does a pretty good job of playing an ASD person. He gets excited doing maths. Guess what, monotone throughout the whole movie except the part where hes doing maths, he damn well nailed it. Its a good movie"
  },
  {
    "rating": "4/5",
    "review": "I found The Accountant to be oddly enjoyable. \"Are you a good dad\"? takes on a peculiar meaning when the military Dad begins by a refusal to get help for his autistic kid - but becomes the perfect Dad for that son. Anna Kendrick is spectacular in a role that almost breaks through to her autistic savior - at least she gets the Pollack!!! This is a fun movie that should have ended with a much briefer shoot out ending that overshadowed the faithful brother reunion. As an ode to the Autistic, this was a hit - particularly the Doctor's daughter with the talking computer that could back door the Pentagon. The Accountant's prison teacher screwed by the treasury agent becomes the beneficiary of The Accountant - because he's \"a good dad\" And you have to love the Airstream fully fitted with top quality art and an arsenal. What's not to like?"
  },
  {
    "rating": "2.5/5",
    "review": "Não é um filme ruim, porém tinha um potencial muito maior. Fica bem claro, no primeiro arco do filme, que o intuito do diretor é alcançar um publico amplo, no sentido de que mesmo abordando temas complexos como distúrbios mentais, o mesmo perde a oportunidade de apresentar uma direção autoral - buscando um ponto de vista mais único da cabeça do personagem, por exemplo. Muito pelo contrario: aqui tudo é explicado, fazendo com que ninguém se perca no filme, mesmo que não esteja prestando atenção. O problema mesmo é que essas explicações não se limitam apenas a trama, mas também ao próprio protagonista. Considero um fracasso que se force tanto uma personalidade autista, como nos primeiros minutos de tela do Ben Affleck, e depois venha nos explicar que ele é autista. Oras, já não estava bem na cara?! O enredo demora um pouco para \"decolar\", mas prende até o fim. O relacionamento com alguns personagens é meio estranho, como Wolf e Dana. O filme não parece se preocupar muito em construir uma base solida para a relação. Uma coincidência por parte dos pais e uma historia de vida já pareceram suficiente para um antissocial arriscar a vida por ela. Não achei que Affleck lidou bem com o papel - Claro que o roteiro não ajudou muito, mas ele não é carismático ou profundo o suficiente para levar o personagem nos seus momentos de tensão. Fora que seu semblante é muito... morto. J. K. Simmons realmente chamou minha atenção aqui, lindando muito bem com seu papel. Jon Bernthal não foge do seu padrão, mas nisso ele é excelente e é inegável."
  },
  {
    "rating": "4/5",
    "review": "I rarely rate 4 or 5 stars. This movie goes above and beyond what most others do. In an age where it’s hard to tell an original story, The Accountant really delivers. Ben Afleck also does a great job of portraying the obscurity in the protagonist. Cast very well throughout. The only reason I don’t give it five stars is because the story gets a little bit confusing about 3/4 of the way though. There are a couple of murky details that you kind of have to iron out yourself by rewatching or picking up on later. (Maybe I just missed something!) The final moments leading up to the climax also seem to drag on a bit. Overall, it’s very much worth the time to watch. Would highly recommend and will probably watch again."
  },
  {
    "rating": "3.5/5",
    "review": "#TheAccountant #MovieReview: 7.5/10 Pros: Great performances all around Ben Affleck Beautiful looking film Awesome action Deep character moments Some funny moments Cons: The script lacks focus Slow pacing throughout Strange character choices and assumptions"
  },
  {
    "rating": "4/5",
    "review": "Great performances exciting story, with interesting (ok also unbelievable twists). An amazingly fun film with a great cast from top to bottom."
  },
  {
    "rating": "1.5/5",
    "review": "Standard shoot-em-up flick but with autistic people"
  },
  {
    "rating": "5/5",
    "review": "This is Ben Affleck's best action performance is really a sucker-punch pack thriller/drama."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved this movie! My husband and I both enjoy it so much that we've watched it many times!! Lots of twists and turns, and to get resolution at the very end was rewarding. I don't understand the haters."
  },
  {
    "rating": "4/5",
    "review": "\"Dana, You deserve WOW - C\" This poignant note follows a segment where Affleck's autistic character comes close to connecting with Anna Kendrick after saving her life and taking her to an expensive hotel because the towels are not scratchy and the water pressure is good. Trying to fathom the world from inside the mind of the autistic is difficult. On one hand, a high functioning savant is crossed with terrible social awkwardness and Chris Wolff. Lewis Caroll, Fredrich Gauss (mathematician covers) has overcome his deficits to excel. It's a great story about family and autistics with the capacity to do incredible things. Due to a father involved in military intelligence who decides his autistic son needs more of the things that upset him - bright lights, loud sounds, etc - The Accountant develops the physical defense and weapon skills that make him dangerous to those who violate his moral code. I own a thousand movies and for some unfathomable reason, I have now watched THE ACCOUNTANT more often than almost all of the others. It ranks up there with WIND RIVER, THE COUNSELOR, and ARRIVAL as movies I can watch over and over while staying home due to COVID 19"
  },
  {
    "rating": "5/5",
    "review": "Finally some love for the numbers guys."
  },
  {
    "rating": "5/5",
    "review": "Brilliant. Can't explain. I've already seen the movie 4 times :-)"
  },
  {
    "rating": "3.5/5",
    "review": "Starts off very strong, Afleck is a badass and such a strong character , would have rathered Rachel Mcadams than Anna Kendrick, she just kinda enhances the unrealistic aspects of the film. The story line becomes weak and implausable towards the end trying to trigger some kind of emotion with the siblings and the chick who can't speak being Chris or Bens assistant is just weird and kinda corny. Worth a watch but only once."
  },
  {
    "rating": "5/5",
    "review": "This was a really good movie, with interesting characters that were multi-dimensional. All of them have their flaws to one degree or another. It made for a really interesting story, with a very unlikely hero."
  },
  {
    "rating": "5/5",
    "review": "yo ha esta película de doy un 10, por el directo gavin oconor por informarse bien por la discapacidad de asperger. yo tengo asperger y comparto mucho rasgo en común con el protagonista, es cierto eso lo de la camisa siempre la misma yo siempre llevo la misma pero la misma ya que tengo 14 iguales. y también soy muy perfeccionista. últimamente veo mucha película y serie basada en mi discapacidad asperger eso me gusta a sin la gente ver que no es una enfermera si no un trastorno. si no ha visto la película tiene que verla y a sin dejarla de decirnos si queremos ser normal como diría la película defines normal buena frases."
  },
  {
    "rating": "5/5",
    "review": "Though the plot is a little extensive and the movie has a few pointless flashbacks, the tie up of all the loose ends in the movie we're truly remarkable. I don't agree with a lot of critics on this film for this original film goes above and beyond. Great action film, great cast, 5/5 stars."
  },
  {
    "rating": "4/5",
    "review": "Sold film. Recommend."
  },
  {
    "rating": "4/5",
    "review": "Fantastic! Affleck does this role so well. He plays a lot of roles like this so he plays this well. Great support from Kendrick. Love Affleck. Great action as well."
  },
  {
    "rating": "5/5",
    "review": "One of my very favorite movies!! FABULOUS!!"
  },
  {
    "rating": "4/5",
    "review": "What more than a few neurotypical people do not understand - our own real challenge is against itself. I like machines. Hardware. Tools. And firearms are all of those. I competed in the most cerebral of the shooting sports - competitive benchrest. Of course, I call it the most cerebral - some folks just call it the most anal-retentive... whatever... It's all weaponized math, and it's a hell of a lot more fun that having some big ol' fellow with a room temp IQ inflict bruises upon your bod..."
  },
  {
    "rating": "3.5/5",
    "review": "Affleck was very exceptional at portraying someone with autism and created someone with little show able emotion yet you still connected with his struggle. Gives you an unique look into how society should view people who are different. Those who lack in \"normal categories,\" can very possibly thrive in others that \"normal\" people struggle in. This movie's main point is everyone was put on this earth for a reason, and nobody was made the same, but many people think we were. Don't fall into the beliefs and social norms."
  },
  {
    "rating": "5/5",
    "review": "The Accountant stars Ben Affleck as the main actor who is portrayed as having Asperger's syndrome who is very good with numbers and opens various businesses in a strip mall and donates all the proceeds to a mental health clinic. Great cast that featured J.K. Simmons as the Director of the IRS and Anna Kendrick of finds a discrepancy in a robotic company's financial statements. Ben is hired by the robotic company to see how the funds went missing. The storyline was unique, strong and very suspenseful. I could relate to the story being an accountant myself sometimes I wish I could have been as badass as Ben is in the movie. Overall great movie, one if Ben's best acting gigs, definitely check this one out."
  },
  {
    "rating": "2/5",
    "review": "Another John Wick look alike that is not able to bring new interesting things to the table."
  },
  {
    "rating": "1/5",
    "review": "Mientras el guion cojea los huecos narrativos se hacen mas grandes cada ves y es que sin esperar mucho Gavin O´ Connor entrega mucho menos."
  },
  {
    "rating": "5/5",
    "review": "Without words... awesome"
  },
  {
    "rating": "3.5/5",
    "review": "It was kinda slow to start off but it gets pretty violent and entertaining later on not a bad film."
  },
  {
    "rating": "5/5",
    "review": "An autistic superhero? Who'd've thunk it? Gripping, well-crafted."
  },
  {
    "rating": "3.5/5",
    "review": "I find this movie to be fun and a good performance by Affleck. Some plot twist are cheesy and maybe don't make that much sense but enjoyable"
  },
  {
    "rating": "5/5",
    "review": "Great entertaining movie"
  },
  {
    "rating": "4/5",
    "review": "Great movie. Very entertaining."
  },
  {
    "rating": "3.5/5",
    "review": "Ben Affleck was awesome!!!!"
  },
  {
    "rating": "5/5",
    "review": "loved it! great movie! suspenseful"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie!!! It was put together perfect! Great cast, great acting, perfectly executed! I’ve watched it 5 times in the past few years when my friends come over and say they haven’t seen it. Major kudos to everyone that was involved in making this movie!"
  },
  {
    "rating": "5/5",
    "review": "Pretty fucking sick!"
  },
  {
    "rating": "3/5",
    "review": "It comes pretty badly unraveled at the end. But the individual action is awesome."
  },
  {
    "rating": "5/5",
    "review": "Ben Affleck was very believable and I am happy to have seen this movie!"
  },
  {
    "rating": "5/5",
    "review": "Great portrayal of a person with autism and extremely engaging story."
  },
  {
    "rating": "3.5/5",
    "review": "I just didn't buy Ben Affleck as someone on the spectrum, but overall a good story, like the exact mix of Rain Man and The Jackal."
  },
  {
    "rating": "5/5",
    "review": "Enjoyed this thoroughly and would love to see a sequel"
  },
  {
    "rating": "4/5",
    "review": "A four star thriller. It’s best to go into this film not knowing much about it. A great cast and some fantastic moments which made this a fun surprise. I see some of the “woke” critics being offended. Entertainment critique may not be suited for them and some audiences."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I ever seen ... Ben affleck is bad ass in this movie ... I can watch it over and over again"
  },
  {
    "rating": "4.5/5",
    "review": "I didn't see that coming..."
  },
  {
    "rating": "4/5",
    "review": "I watched this movie on Netflix and it turned out to be a nice surprise. A well written movie with an interesting plot, unfortunately the character Medina doesn't have a well developed arc which somehow ruined the continuity for me."
  },
  {
    "rating": "5/5",
    "review": "It is an awesome movie and I recommend that everyone watches it. And I do love Ben Affleck's portrayal of the character and portrays a person with Autism pretty well as I am on the spectrum. I like that the movie slowly develops its story while showing some cool action. It also has some good acting in it and is an entertaining watch. And I hope the movie gets a reboot."
  },
  {
    "rating": "1/5",
    "review": "Terrible dialogues. Bad writing. Unworthy of a watch."
  },
  {
    "rating": "2/5",
    "review": "Quite poor. Overly long, weak story and poorly told, full of dull exposition of characters we have no reason to care about at all. I'm baffled that such mediocrity has been well received by so many people. After a certain point, I was just waiting for it to end. Save your time and avoid. 2/5*"
  },
  {
    "rating": "5/5",
    "review": "Stellar! Can't wait for the sequel!"
  },
  {
    "rating": "3/5",
    "review": "This is a lot of weird background filler given that feels forced. But action is done well. The plot twist was so projected and obvious."
  },
  {
    "rating": "5/5",
    "review": "Much to my surprise I really liked this movie. Actually was surprised at the end."
  },
  {
    "rating": "5/5",
    "review": "I loved it! Ben Affleck is excellent and believable in this role. The action scenes are very well done. I'm hoping there is a sequel."
  },
  {
    "rating": "5/5",
    "review": "It was surprisingly good..! Affleck was amazing..."
  },
  {
    "rating": "3.5/5",
    "review": "I think it works as a movie. I did enjoyed it and still watch it if its on tv. I prefer this movie over the other tons of stand-alone action films and feel that this is mainly a result of the cast it has."
  },
  {
    "rating": "4/5",
    "review": "I have found some of the reviews misleading. The movie had an excellent performance from Ben Affleck the plot reveals and action entertaining and carried me along through the movie. Not Oscor material but well worth a look."
  },
  {
    "rating": "5/5",
    "review": "You guys are nuts. This is one of the few movies I have ever paid to watch more than once. Sure, the value of the reveals and twists in the plot are lost in the rewatch, but I found it nonetheless entertaining. I cant wait to see what you peanuts at Rotten Tomatoes give a 90% to."
  },
  {
    "rating": "5/5",
    "review": "#1 ben affleck movie"
  },
  {
    "rating": "4/5",
    "review": "Ben Affleck is very good in this action thriller. The high audience rating comes as no surprise since there's plenty of action and even a few moments that made me laugh out loud."
  },
  {
    "rating": "4/5",
    "review": "Would have liked a sequel."
  },
  {
    "rating": "2/5",
    "review": "Honestly expected better. I thought the movie would have something to say about mental disorder, but it's just a plot device in the movie. Bourne may not be the most realistic movie about amnesia, but it's an important part of his character. Ben Affleck could've been a really smart guy with social anxiety and it wouldn't have made a difference. Instead, his superpower is autism. The action scenes were enjoyable and reminiscent of John Wick, but it's tame in comparison. The action scenes were decent, but it could've been more thought-provoking. Instead, it's formulaic and forgettable."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed the movie and always catch it when it’s on. A lot of twists and great action."
  },
  {
    "rating": "5/5",
    "review": "Loved it. Thought it was very well done and I don't like all Ben Afflick movies."
  },
  {
    "rating": "4/5",
    "review": "Is it just me or is Ben Affleck dropping great movies like a madman? I think The Accountant for sure is one of those. It very a very interesting story and Ben Affleck plays his part of Chris Wolff very well. Although the storyline sometimes felt a bit slow and I personally felt like there were missing a few things in some parts. I found it to be a really good movie nonetheless. There were a some really great twists in the end, which I really enjoyed. I haven't seen much of Jon Bernthal his work but I was so pleasantly surprised. He's cool. J.K. Simmons was once again great, I do feel like he doesn't really play a lot of different characters, he's still great at what he does. Cynthia Addai-Robinson was something different. I've seen her mostly doing these really though characters, and it was refreshing to see her play Marybeth Medina a little bit more vulnerable. Now I'm going to speak out a probably unpopular opinion, which is that Anna Kendrick just isn't my favourite actress. Not saying she's not a good actress. But you know, I'm not really feeling it. Saawrry. The movie started off with some great shots (like closeups and move-ins) which I really enjoyed. So the camera work was great, so was the acting and the story was good. AKA I recommend this. (and I just really like Ben Affleck.)"
  },
  {
    "rating": "3.5/5",
    "review": "Overall a very enjoyable movie with a high popcorn-rating. On the con-side: The flashbacks are clunky, it tries to be too complex & the way Living Robotics tries to boost the stock-price is bullshit - Can be done with a share buyback."
  },
  {
    "rating": "5/5",
    "review": "This a great movie. Very entertaining and a great original concept. Look at the audience rating. The critics are BS and should be fired"
  },
  {
    "rating": "3.5/5",
    "review": "The accountant feature ms strong work from Ben Affleck in a role he’s never done before. I enjoyed the accountant for its uniqueness and for Ben Affleck performance even though the film does have some pacing issues. There’s a couple unnecessary subplots as well. Overall it’s an enjoyable film not as action-packed as some people may want but a good character driven film."
  },
  {
    "rating": "3.5/5",
    "review": "The accountant feature ms strong work from Ben Affleck in a role he’s never done before. I enjoyed the accountant for its uniqueness and for Ben Affleck performance even though the film does have some pacing issues. There’s a couple unnecessary subplots as well. Overall it’s an enjoyable film not as action-packed as some people may want but a good character driven film."
  },
  {
    "rating": "4/5",
    "review": "Nice to see a different spin on the usual action movie"
  },
  {
    "rating": "3/5",
    "review": "A decent watch with an mediocre performance by Ben Affleck and ending. Would not recommend this film however not too bad."
  },
  {
    "rating": "3.5/5",
    "review": "The Accountant is actually quite astute when it wants to be."
  },
  {
    "rating": "2.5/5",
    "review": "Ben Affleck plays an autistic accountant/hitman for some of the biggest criminals organizations, and with that intriguing premise and action sequences, \"The Accountant\" had so much potential, but unfortunately this thriller reveals two plot lines that are too ridiculous to enjoy."
  },
  {
    "rating": "5/5",
    "review": "The back story of a child who is different, and misunderstood, the determination of a father to protect his son, the deep love of a brother, the wanting to love someone special but unable to show emotion, with a bucket load of fight scenes, and an investigator wanting to find The Accountant is a recipe for probably one of the best movies I've seen in a very, very long time. Rarely do I give 5 stars."
  },
  {
    "rating": "4/5",
    "review": "A slow burn to get started, but when it does, it's pretty good."
  },
  {
    "rating": "3/5",
    "review": "If you have nothing better to do some night, the Accountant might pay off for you. This is not some high-concept art film, but there is math, so if you are a nerd who loves gratuitous violence, buckle up! Head shot. Head shot. Couple more head shots just to make sure. Another head shot! Don't worry about the plot, you won't remember it anyway. And Anna Kendrick is not pitch perfect here, the flashbacks took too much time, the whole Treasury agents on his tail thing went nowhere, and the Punisher thing was a predictable groaner - you're my brother, but you do bad things - I am conflicted - fortunately I like incongruity! But... HEADSHOT!"
  },
  {
    "rating": "5/5",
    "review": "I'm not sure if I've ever given a 5 star review on Flixster. I have given a number of 4.5 star ratings to movies I thought were very good for what they were (action, drama, etc). The Accountant blew away my expectations. It's the best thriller I've seen in years. I cared about the characters; I was scared for them, excited for their successes, was legitimately concerned core characters could be killed. I don't usually care this much about characters in a 2 hour movie. I often feel that way about characters in great novels, over hours of reading, but rarely this much in a movie. I'm excited to see there is a sequel in development."
  },
  {
    "rating": "5/5",
    "review": "I found this movie deeply satisfying. The love story is perfect. The way they live happily ever after is just right. If you have worked with people with this sort of autism (as i have) you probably felt the same. Dana deserved a wow, and she got one. on the other hand if you are an n.t., you will likely find the premise ridiculous, and my comment that the love story turned out perfect, downright stupid. heck, you probably didn't notice that this is mainly a love story."
  },
  {
    "rating": "4/5",
    "review": "Fun. Mindless. Over the top. Action."
  },
  {
    "rating": "3.5/5",
    "review": "The movie is interesting and attention-getting, especially considering the source material of it being an accountant. Really neat concept, but I will say for me a big downfall is the ending is a little predictable."
  },
  {
    "rating": "4/5",
    "review": "Good movie, good action, pay attention!"
  },
  {
    "rating": "2.5/5",
    "review": "It's a movie that can't figure out what might constitute a good or a bad guy in the first place, low-grade crime fiction,but its a one time watchable"
  },
  {
    "rating": "5/5",
    "review": "A commentary on the complacent expectations of society marked by a compendium of requisite desecration’s of the human spirit, compassionate brotherhood and moral imperative."
  },
  {
    "rating": "4/5",
    "review": "the accountant is a movie filled with good action, suspense, drama and a star cast that brings the story to life."
  },
  {
    "rating": "2.5/5",
    "review": "\"The Accountant\" offers a story with very little emotion or feeling involved and a boring and sometimes slow pace. But due to Affleck's good performance and some decent action sequences, there is some fun to be had here."
  },
  {
    "rating": "4.5/5",
    "review": "I don’t understand the critic’s consensus. I have a good friend with high-functioning autism spectrum, and I found the portrayal well done. Great twists and good action, a great film."
  },
  {
    "rating": "4/5",
    "review": "Another example of how Critics have lost touch with the audience. This is a good movie."
  },
  {
    "rating": "4.5/5",
    "review": "A unique theme and excellent movie in all aspects"
  },
  {
    "rating": "4.5/5",
    "review": "This is an intense, well-directed action-thriller that boasts some wonderful performances and direction. The plot is engaging, the action sequences (while sparse) are both brutal and captivating, and the end-result is a one of the most creative hitman films to date! This is, however, somewhat slower than other films that attempt a similar narrative, and is more about the drama than the action, but if you're willing to be carried by great performances and drama, then you're sure to love this film!"
  },
  {
    "rating": "5/5",
    "review": "One of Ben Afflecks best movies and performances. All star cast, great storytelling, and action with plenty of plot twists."
  },
  {
    "rating": "5/5",
    "review": "As an aspie (and someone that cannot deal with what I consider negative endings to movies) I absolutely loved this movie and really liked Ben Afflecks representation of someone on the spectrum. I could feel his thoughts all the way through and (even though I'm very touch sensitive) I just want to give him a big hug! (if he allows) I'm not keen on violence (especially the loud noises from said violence) or the flashing lights he used before 'sleeping?' (I thought most of us 'can't' cope with the things he did at that point because it in itself causes meltdowns. Also his meltdown was quite short, (mine last significantly longer then the few moments shown on screen.) Well that's my short version of my view. (I have so much to say about it. But I will be writing all night. But all round I think it should have a way higher score than Tomatoes gives it! >p< (But everyone is entitled to their opinion I suppose.. siiigh.."
  },
  {
    "rating": "5/5",
    "review": "I'm surprised it only has 76 rating; it's a great movie. An intricate plot, not formulaic at all a la Equalizer (which was really good b/c of Denzel). Affleck truly lost himself in this character; he WAS Chris Wolfe. Really, really really worth your time."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely terrible plot - great actors found riddled throughout this \"story\". Although it is understood that movies only have a certain amount of time to give backstory and plot explanations - this movie thought it could do without. It was an absolute struggle to understand the purpose of any of the characters."
  },
  {
    "rating": "5/5",
    "review": "This is a really enjoyable movie. It has some great twists, turns, and surprises. I went in with low expectations and now it's a favorite action flick that leaves you with a feel-good warm sensation."
  },
  {
    "rating": "3.5/5",
    "review": "Sad destiny of autistic main character Affleck plays adds a fascinating twist. But he's too strong...story based on super power subtracts certain taste unfortunately"
  },
  {
    "rating": "3.5/5",
    "review": "Thoroughly entertaining. Worth a rent."
  },
  {
    "rating": "3/5",
    "review": "One of Ben Affleck better roles"
  },
  {
    "rating": "5/5",
    "review": "It will be a cult movie in years!"
  },
  {
    "rating": "1.5/5",
    "review": "It's an Under Mediocre piece of cinema with a good cinematography. The flashbacks in KarateKid-Bloodsport manner are the worst the decisive strike that kills the movie. The mentally retarded hero is a cliche and very implausible. Again the diluted American adventure dream that evolves around money and corporate world."
  },
  {
    "rating": "5/5",
    "review": "I was very surprised how good this was."
  },
  {
    "rating": "4.5/5",
    "review": "Loved it. Draws you in with more questions than kr answers. Looking forward to sequel!"
  },
  {
    "rating": "5/5",
    "review": "Riveting, maybe not a great Batman, but Aleck scores in this film. Thanks to a supporting cast. This movie, however long, succeeds."
  },
  {
    "rating": "4.5/5",
    "review": "Fun thriller, excellent acting by Ben. Enjoyable watch."
  },
  {
    "rating": "4/5",
    "review": "Strengths: I've never been much of a Ben Affleck (Christian Wolff) fan, but he's been very good since he began directing films. Here, he got to play someone emotionless and it worked. Yet, despite not showing a ton of emotion, he still managed to have good chemistry in his scenes with Anna Kendrick (Dana Cummings). Jon Bernthal (Braxton) was also strong on his side of things. JK Simmons (Raymond King) was tremendous and his role is mired in mystery for most of the film. You think he's going one way and we find out he's doing everything for a different reason and it provides us with the best acted moment of the entire film. There are plenty of intense moments and some wild action sequences that I wasn't expecting. Weaknesses: The big twist near the end of the film is kind of easy to see coming. It takes away some of the impact of watching the moment unfold. While the action scenes are exhilarating, they do come off as a bit unrealistic. We understand that he's had training in this sort of thing, but some scenes take it a bit too far. As noted, Affleck and Kendrick were strong together, so it was disappointing to see Kendrick bow out of the movie so soon. The reasons worked for the story, but without her, the movie lacked a bit. Overall: This was quite the unexpected thrill ride. Affleck gives a strong performance, followed up by Kendrick, Simmons, and Bernthal. It's an intense movie that keeps you interested and captivated for most of its run time."
  },
  {
    "rating": "3/5",
    "review": "Tan disparatada como entretenida."
  },
  {
    "rating": "4/5",
    "review": "This contains semi-spoilers, so if you haven't seen it, don't read. Ok...so the trailers for \"The Accountant\" had me interested from minute one, but after seeing ~50% on Rotten Tomatoes, I was a little worried. However, I ventured out this evening and saw it anyway. I wasn't disappointed. I'm not sure if it was lowered expectations or what, but I left pleasantly surprised at what I just saw. Let me just get it out of the way...I've never liked Ben Affleck much. I'm sure he's a good ole guy and all, but he's consistently been one of the worst actors in the modern era. This movie cast him perfectly. Wooden. Emotionless. Very little in the way of dialogue. Perfect. He's got the intellectual-yet-tough look that this character needed. He even looked dumb quite easily when the script called for it. That being said, bravo Ben. As for the story, I went back and forth all during the movie because certain elements were easy as hell to figure out, perhaps intentionally, but by the end, it unraveled in a way that still surprised me in certain ways. It wasn't as simple as I had thought it was while watching. No, it wasn't \"Silence of the Lambs,\" but it wasn't that different in ease as \"Seven\" was. Either way, I guessed the part about the brother from minute one. Same with John Lithgow. However, I was grossly incorrect in guessing JK Simmons' true role in the film and was quite surprised when he was unveiled to be whom he was. And the end, like I said, really came out of nowhere. But in a good way. The action scenes were also very well choreographed and filmed, worthy of a theater's surround sound system."
  },
  {
    "rating": "3/5",
    "review": "Liked it, didn’t get great reviews but I still enjoyed it."
  },
  {
    "rating": "1/5",
    "review": "The plot gets so convoluted that it's not even enjoyable to try to follow anymore."
  },
  {
    "rating": "5/5",
    "review": "I'm not usually a Ben Affleck fan, but he's great in this movie. Awesome flick!"
  },
  {
    "rating": "3/5",
    "review": "I had a little higher hopes for this movie. I just dont know if I believe Ben in this movie. They didnt give enough backstory for me to care. Also I think they underused Anna Kendrick's character."
  },
  {
    "rating": "5/5",
    "review": "loved the slight twist. making something that was generally seen as disability an advantage. a father makes due with whatever he got. Amazing film"
  },
  {
    "rating": "0.5/5",
    "review": "I've tried several times to watch this, but I can't get past the how unbelievable it is. Affleck is blah. Just blah. And how in the hell can anyone hold up that sniper rifle and not blow their damn arm off. Dumb."
  },
  {
    "rating": "5/5",
    "review": "This movie.....WOW. I really had no idea what kind of movie this even was going into it....the previews/commercials really did not do it justice. It is an incredible look at the autism spectrum in a high action, keep you guessing, story. I really was not expecting more then a assassin/special agent type action thriller story when I started this movie. It became clear fairly early that was not what I was in for. If you have children, then a warning this will hit you very hard in the feels :). For those that may not be a fan of Ben Afleck as an actor, I promise that does not take away from this story at all. You may even walk away with a difffeent view of his as an actor. This movie was shockingly good...it is a good action movie that you can absolutely watch with your spouse/significant other that might not enjoy action movies that much. The story is very, very deep and meaningful. Highly recommended."
  },
  {
    "rating": "4/5",
    "review": "i really enjoyed this slow burn of a movie punctuated with excellent close combat fight scenes. Ben Affleck fights to remain calm and finish what he started while protecting himself all at the same time. His portrayal of an autistic accountant fits into the puzzle of what appears to be a wide reaching plot. Although the plot feels a little off at times, when the pieces fit into place it is satisfying. The slowest moving scenes are carefully crafted with the right camera and sound design to help us feel how deliberate both his need for routine and isolation are."
  },
  {
    "rating": "2.5/5",
    "review": "I did the math and The Accountant... is not that good... I had hope for this one... I really did! I hoped that this film would open the slaughter fest commonly known as Oscar season but all potential fell as quickly as the Martha-climax of BvS (Arrival will surely do it!). The problem is, when you begin to enter this stage of the year, movies are contaminated by the pressure of being Oscar-worthy so it's harder to live up than in other months. With a promising cast and a stunner storyline, nothing feels quite to be realized as you'd expect it should. The script is so over complicated, the action is disheveled, the soundtrack is a musical void and what's supposed to be tense is sometimes ridicule. It's such a wad of mediocre filmmaking! Affleck is great in the character and Kendrick does a fine job but her character just feels like a device to get the answers that the screenwriter would otherwise leave ignored. This adds up (no pun intended) to a forgetful movie and that may be one of the things that annoys the much about a film: the prospect, nay, the certainty that I won't remember squat about it in few days..."
  },
  {
    "rating": "3/5",
    "review": "I don't quite know why but I had such high expectations from this movie even if I don't like the leading lady. It was mediocre, started really exciting but turned out to be predictable and boring."
  },
  {
    "rating": "4.5/5",
    "review": "Loved it , very thrilling"
  },
  {
    "rating": "2/5",
    "review": "To be a bad movie, could have been worse. (if this make sense)"
  },
  {
    "rating": "3/5",
    "review": "Yes it may not make total sense, and I wonder whether someone with autism would be capable of all this, but generally an enjoyable and likeable thriller. Affleck's best performance in recent years."
  },
  {
    "rating": "5/5",
    "review": "Teaches you about autism. Also best Ben Affleck movie"
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I watched recently. It's not perfect, but it has a gripping story."
  },
  {
    "rating": "4/5",
    "review": "Great movie!! Great twists."
  },
  {
    "rating": "4.5/5",
    "review": "Really great movie. Afflack was great."
  },
  {
    "rating": "5/5",
    "review": "Great movie. I have a son with Autism and some parts were hard to watch and I had a couple of tears but I really enjoyed this film. Definitely worth seeing."
  },
  {
    "rating": "4.5/5",
    "review": "I totally loved this movie, I am on the autism spectrum and a lot of stuff in it made perfect sense to me, I love a variety of genres so the action/kinda family mix worked just fine for me."
  },
  {
    "rating": "5/5",
    "review": "Great movie. We really enjoyed it."
  },
  {
    "rating": "2/5",
    "review": "Premise is good, but moves at to slow a pace. Investigator element is boring."
  },
  {
    "rating": "5/5",
    "review": "Best advice for all, don't go by so called movie critics, this movie is great, action packed. Finally no super hero movie that's actually better than super hero movies"
  },
  {
    "rating": "5/5",
    "review": "This low score from critics only serves how dynamically out of touch they are with word beyond their own sanctimonious, self-absorbed, self- imporatant view of the world is the only one of consequence. That is just plain pathetic. Reviews that call it an offense against real world autistic human beings makes it clear that they have never known a high function autistic person, the very psychological possibilities for these high functioning autistic people. These Savants see the world in an entirely different way than non-autistic people. They excel in one, two even three skills that transcend the wildest imaginings of non-autistics in the same field. I find it abhorrent that these review fall on sentiment and emotion with absolutely NO knowledge of real world high functioning autistics and sevants. We are only know scraping the surface of autism truly is, as can be clearly be demonstrated reclassifications of autism into a Spectrum in the DSM-V. Knowing the extreme subtleties of autism, this movie had transcendent moments. Was the father's approach the best, no. However, helping autistics to deal with real world situations, as I believe was the father's intent, most certainly is, even if his methodology was extreme. He was special ops, it was all he knew. Adherence to a code or set of belief that provides clear and finite definition to the world of an autistic servant is to be expected. Forming an attachment with Dana, who not only loved numbers, but had caught a desperity that he gave definition is hardly rare. Ben Affleck played this part to near perfection. This movie redefined how lay people view high functioning autistics and sevants. Shame on the critics whose weak, uninformed and frankly ignorant views on something they know nothing about. I would remind them that being a film critic on its own requires very little skill. The truly worthy critics see each film for what it is, and their following reflects. Rolling Stone hardly gives a hack writer any importance."
  },
  {
    "rating": "4/5",
    "review": "This is a action film cliche done well. It does its job, escorting you to entertainment."
  },
  {
    "rating": "2.5/5",
    "review": "Just another Bourne Identity like thing with an added twist. But not as well made, not the attention to detail, & too many blatant plot contrivances. Definitely not geek friendly - contradictions, Hollywood-style law enforcement procedures (i.e. too much magic & convenience). But if you don't usually notice details & like super-soldier-spy with troubled past going round mass-killing for the good, you'll like this."
  },
  {
    "rating": "3.5/5",
    "review": "I hadn't planned to watch it so I didn't know what it was about and had no expectations (high or low). I was pleasantly surprised by this very decent action flick, though Ben Affleck seemed to forget he was not Batman in this movie..."
  },
  {
    "rating": "4/5",
    "review": "Excellent action movie with bonus points for dealing with mental issues in a open way. Ben Affleck gives a very solid performance in the lead role and action and plot are mixed together to provide a solid piece of entertainment."
  },
  {
    "rating": "3.5/5",
    "review": "A Super-Hero For The Nerds That Has Multiple Levels Of Character Depth. Very Cleverly Written & Shot Into A Scene-By-Scene Laying Of Complexity. The Chemistry Between Affleck & Kendrick Is Non-Existant..But That Could Just Be The Character?? Who Knows!?? The Music (Love Mark Isham) Tension & Pace Of Things Keep It Going Without Ever Getting Boring, So It Is All In All A Very Good Ride With A Believable (Of Sorts) Storyline, Which Verges On Comic-Book Style Ending."
  },
  {
    "rating": "4/5",
    "review": "Held my interest throughout. Surprising and satisfying ending."
  },
  {
    "rating": "4/5",
    "review": "With an outstanding performance from Ben Affleck, The Accountant succeeds on multiple levels of storytelling due to its emphasis on the main character and fantastic action sequences, even when a lot of convenience happened in the plot."
  },
  {
    "rating": "5/5",
    "review": "Holyyy cow. Really good movie."
  },
  {
    "rating": "3.5/5",
    "review": "Sometimes this movie falls into a cicle of rethink the story, but the performances were good."
  },
  {
    "rating": "5/5",
    "review": "We thoroughly enjoyed this movie. Can't wait for sequel. The critics got this one totally wrong. We are seniors have watched hundred of movies."
  },
  {
    "rating": "3.5/5",
    "review": "A decent movie with compelling action and an amazing message to everyone about those with special needs. Enjoyable, funny, and well acted. A fine movie."
  },
  {
    "rating": "4.5/5",
    "review": "The Accountant with Ben Affleck and Anna Kendrick is one of the must see movies with great performances and some crazy action scenes!"
  },
  {
    "rating": "5/5",
    "review": "I thought it was great, Affleck definitely shined in this role and Jonny Bernathal was a nice touch."
  },
  {
    "rating": "3/5",
    "review": "J.K.Simmons is the best."
  },
  {
    "rating": "4/5",
    "review": "Very entertaining film that effectively uses flashbacks to help build the story. The all-star cast was really surprising. I just hope all kids with autism don't become trained assasins."
  },
  {
    "rating": "5/5",
    "review": "I have Aspergers Syndrome myself, so i can relate to the main character. Affleck provides an excellent performance in this film, with an a reasonably complex and interesting storyline and a good supporting cast. I don't say this very often, but this is a film that i would like to see expanded, but carefully."
  },
  {
    "rating": "2.5/5",
    "review": "Una historia confusa pero llena de sorpresas"
  },
  {
    "rating": "4/5",
    "review": "(5.0 out of 6) When we see going in deeper into things we don't know which way it will go when what we think will go to our advantage can go to our disadvantage when we don't see somethings coming. When what we see others don't know what we go through, when it's uncommon for others and common for some to know others can stand to see others go through such trauma to only go away in what we can't stand seeing. When where we go in our state of mind we go far from where we once used to go, when we didn't understand what we were going through. When we go deep into things and uncover what others can't see we go a different direction when we know where to go and end up. When what we go through we see to the end when go abouts solving puzzles differently then most people when we see differently what others see. When we see we go to dark places when our pasts reveal what more our skills can be used for when we go places where we are needed. When others know where and whom to go to when what they see in numbers they see much more when they go through its history, timing, people, circumstances, and possibilities thoroughly. When where others go we don't always go when it's more for the in crowd to know, but we are out from those crowds. When what others go through are low places when competition makes them go in power mode. When others go based on what little they can use when we go based on clues for information. When where we go when we are done is a mystery, when we are not always done to go further in what we see what's wrong. When we see what others go through to keep those eyes and mouth shut when they don't want their information to go in the wrong hands. When we see where we must go, when somethings will not end, when it's biological & part of business that we only see we go to kill. When what others can't go until some jobs are done to go elsewhere. When we see others go places that normal people go to we see the human complications we need to go further in seeing. When we see what we must do to save others from going other places when murderers are after us. When we are prepared to go any lengths to go other places to not be seen. When what little others have to go through they analyze deeply to have something to go on. When there are easier access places to go to when the world is filled with information to go online. When we see where others go to not go there when our identity is a mystery. When we see going places are limited when we haven't gone anywhere as most have gone to wish we could go places but we can't when our life keeps us here. When we can go various places without leavong anywhere to know our state of mind goes everywhere. When we know where others are going when the targets are us. When what others don't see closer we go to the lengths in hiding. When we go through life stages as other kids to be trained to deal with life stages another way, when we go handle our personal life as our business life to see we are one of a kind. When we see we must go through somethings alone to leave those behind when we can't make them go through the same thing we go through to know we go solo. When where we go when we face the brink of death we see we go home when we don't want to be in other places. When others go to lengths for revenge, when others go another way, when someplaces we go we can't come out from. When what we couldn't see before we see now where others go, when dealing with other people's information vwe know places they didn't go or should go when there are plenty of holes to go into. When going into one's past reveals holes in where others should be going when some moments others go are for a reason. When others have no place to go when others go in full assault. When someplaces we don't intend to go we go when it's a reunion amongst family in hiding. When what others go to use when other things are gone, we see we can substitute one artificial thing in replace of what's real. When what we don't have to go through we save ourselves the headache. When what we can't do we find other ways to do it when we need to go the same direction as others go when going for so long in different directions we can't go alone for long when we are human with the same skills as everyone else has to communicate, feel, and see what others go through to relate how hard life is."
  },
  {
    "rating": "3/5",
    "review": "Better than I had thought.. A little cheesy maybe but.. ok.."
  },
  {
    "rating": "4/5",
    "review": "I know a lot of people don't like Ben Affleck, but he's actually very good in this movie! It's complex and was very enjoyable to watch."
  },
  {
    "rating": "5/5",
    "review": "The greatest movie of the year!"
  },
  {
    "rating": "4/5",
    "review": "This movie was a pleasant surprise. I really enjoyed the plot and the characters. The movie was very fast paced and fun. The action was very well done and realistic and believable. Awesome actors. Really enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "Well It was a lovely movie... really awesome!"
  },
  {
    "rating": "4/5",
    "review": "I thought it was quite Good. Don't like Critics"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie!!! This movie shouldve been rated a lot higher. I loved every minute of it!!!"
  },
  {
    "rating": "3.5/5",
    "review": "With the exception of once or twice where the filmmakers felt the need to simply drop the audience into the middle of a flashback without segueing into it, this movie to be very entertaining with Ben Affleck's character of Christian Wolff being a very thought-provoking protagonist."
  },
  {
    "rating": "5/5",
    "review": "Why was this movie rated so low? I thought it was excellent."
  },
  {
    "rating": "1/5",
    "review": "Horrible...Can't take this movie seriously ....Characters totally mis-cast in their roles and Ben Affleck's f acting as a grown up autistic child is ridiculous."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed it, recommended"
  },
  {
    "rating": "5/5",
    "review": "it was very good movie"
  },
  {
    "rating": "5/5",
    "review": "I went into watching this film having seen the trailer and expecting no more than a generic action thriller with the slight difference in that the lead has Autism. This doesn't mean i thought it was going to be a bad film I just expected one thing but what i actually watched was so much better. This film has action, granted not a massive amount but when a sequence begins it's exciting, well staged and great to watch. Affleck's performance is fantastic, not only is he a great anti hero as we've never really seen him; he also looks like he fully understood behavioural traits he would need to have whilst convincing the audience he has autism. The supporting cast are also good, and what i liked about this film is that you're so sure it's going in one direction only to totally surprise you by going another. The twists are well placed and good, and also the score is very appropriate for this movie. I loved it, i think it's a masterpiece; and i can't wait to watch it again."
  },
  {
    "rating": "5/5",
    "review": "The Accountant is a great movie. Loved Ben Affleck in this role. Great story with cool action scenes. If you have not seen it, you should definitely watch it!"
  },
  {
    "rating": "5/5",
    "review": "this would be my crazy family if we knew how to fight. I loved this movie!"
  },
  {
    "rating": "3.5/5",
    "review": "I liked it overall... but I just felt like there was so much more potential that wasnt tapped into. The premise of a Jason Bourne on the spectrum is fascinating."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed this. There might be simplistic stereotyping of autism, but it's an enjoyable action movie."
  },
  {
    "rating": "5/5",
    "review": "One of Ben's better performances"
  },
  {
    "rating": "5/5",
    "review": "WB, Has been produce once again great movie like This,Lets talk the cast Ben Affleck acting was Just Glorious, when he played BvS he was aggressive, Brutal and Charming, in this film His Acting was reflecting someone with autism and calm, its just amazing to watch someone with that incredible talent of acting, Anna Kendrick also had a charming personality, there is a time when situation got cold and Anna just make it warm again with well written script, Last But Not least J.K Simmons Acting may be the greatest among those two but Simmons make things understandable to follow certain scene, And overall this movie was enjoyed to watch so many plot twist, you would say \"i didn't see that coming\", fighting scene was incredible.. go watch it for yourself it's AMAZING!!"
  },
  {
    "rating": "5/5",
    "review": "As a math savant uncooks the books for a new client, the Treasury Department closes in on his activities and the body count starts to rise. The Accountant is one of the biggest surprises of the year just like in BVS actor Ben Affleck gives an outstanding performance with the way he talks and acts, Anna Kendrick, Jon Bernthal, J.K Simmons and Cynthia Addai-Robinson were also really good and i loved how they basically took some time off from Christian Wolff's character and they explored the character of Ray King (Simmons) as for Jeffrey Tambor and John Lithgow they were good too but they aren't that much into the film. Another thing that surprised me was the whole autistic thing was handled really well by both Ben and Seth Lee you see threw flashbacks the early stages of it but also how he turned into a killing machine and the soundtrack in some scenes was outstanding there were also 2 easter eggs from Suicide Squad and Superman blink or fall asleep and you will miss them. This film takes also it's time from the whole mathematics thing to action thing and when both hit the screen i went insane the action sequences were filmed extra carefully and the fact that Ben did some of his own stunts was amazing i mean this film made me even like Math at one point. I also loved his relationship between Dana and Christian she was basically his love interest although they never explored that and that was for the better. What they also did with Brax's character and Christian that whole plot twist was insane, this is easily one of the most entertaining and serious action/drama movies i've seen in years"
  },
  {
    "rating": "5/5",
    "review": "This movie was outstanding. It had constant developments and kept your attention. At the end of two hours, I was ready for more. My wife and adult son were with me and we all felt the same. Affleck knocked this character out of the park. I really hope they do a sequel. I would especially like them to develop the relationship with the brother some more."
  },
  {
    "rating": "5/5",
    "review": "This is a captivating, fresh story with complex characters played by a great team of actors and actresses. It elicits the gamut of emotions, from intrigue, to anger, to sadness, to hope, to laughter. Mathematicians will especially enjoy the references to famous mathematicians, including famous recreational mathematicians, but an appreciation of mathematics is definitely not needed to understand and enjoy the movie (just like one can enjoy \"The DaVinci Code\" without understanding religious history). \"The Accountant\" could easily become a favorite series, much like The Bourne movies, Mission Impossible, and others. I plan to see it again and am keeping my fingers crossed for The Accountant II."
  },
  {
    "rating": "1/5",
    "review": "Terrible. Not only one of the worst movies of 2016, but also one of the worst movies I have ever seen. Why do Hollywood executive believe that all extremely intelligent people have terrible social skills and/or are certifiably insane? I have a question about this movie, is Ben Affleck's character supposed to be the hero? Do the writers of this movie expect me to cheer for a career criminal and ruthless killer? Sine he kills bad people in this movie that must make him good right? Well what about all of the times before this movie where he was a hired gun who laundered money for criminals. Also what exactly was the point of the story that featured Cynthia Addai-Robinson and Academy Award winner JK Simmons? That whole story went absolutely nowhere. It is also never explained why Simmons' character kept her on the investigation despite the fact that she is a criminal herself and should have been fired from the Treasury Department. This movie as a whole makes no sense and has plot holes so big an elephant could walk through them. Don't waste you r time with this worthless piece of trash."
  },
  {
    "rating": "5/5",
    "review": "Critic scores 52%??? Perfect example of why you should never pay attention to todays pretentious critic reviews...they just love to flex their cinema knowledge and dissect good movies that us regular people like to watch. Watch this movie, its very good."
  },
  {
    "rating": "1/5",
    "review": "Absolute rubbish. Takes a cliched one dimensional view about children with autism, an improbable plot, and an entirely unbelievable turn of events. An evil empire, a brutalist father, an inexplicable love interest, endless inconsequential shoot-outs and the odd bit of torture. Ludicrous plot, shallow and without any character development. Frankly offensive."
  },
  {
    "rating": "5/5",
    "review": "Great movie. The film nicely develops Christian Wolff's character from a sensitive, all-business savant, - a person who wants to socialize but can't, until Dana Cummings comes into play - into a feeling, caring, mindful person. The film nicely evolves Anna Kendick's role which is a great change from some of her previous acting efforts. JK Simmons and Cynthia Addai-Robinson complement each other as the understanding develops. I often think Ben Affleck is under rated despite some of his excellent portrayals. He's terrific in this role."
  },
  {
    "rating": "3/5",
    "review": "The first 45 min were horribly boring. For god's sake it got better but was never really thrilling."
  },
  {
    "rating": "4/5",
    "review": "Good movie overall. I like the plot, although it would have been a bit more exciting if he dealt more with drug dealers rather than corporate America. Still liked it a lot and think the critics underrated it. It must not have hit a trending politically correct enough theme for them."
  },
  {
    "rating": "3.5/5",
    "review": "THE ACCOUNTANT, shows the meaning to what heroes do when it comes to heist, and inconvenience apparently stands by his life from the past, and how good he is at wiring out details of firm assault, and the substance of Christian Wolff. Acting: Superb, I find little solidness from Anna Kendrick & J.K simmons, but Ben Affleck never blacks out. Directing: Gavin O'Connor is a new director who hadn't made much, he made 3 and they were all, he wasn't perfect on this though that's the problem. Plot: Decent, with every step that makes a lot of sense to me surely is the example on interesting premises like this film we got. Writing: Not bad at all, It could do a little better but I accept the fact that these writers are amazed on the way they write. Overall: Liked It, It was something different for a change, I could always remember the parts where he practice the shootouts with melons that look like real people if they mess with him, And I can apply even the celluloid onto it as well, The word to describe it as... Unforgettable! I'm gonna give The Accountant a B+... Ben Affleck, J.K Simmons, Anna Kendrick, and director Gavin O'Connor I'm surprised!"
  },
  {
    "rating": "5/5",
    "review": "Good, engaging movie. Well written and acted."
  },
  {
    "rating": "2.5/5",
    "review": "My friend summed this move up perfectly \"it's alright I guess\""
  },
  {
    "rating": "5/5",
    "review": "This is a great movie. Don't normally care for Ben, but this time he hit a home run."
  },
  {
    "rating": "3.5/5",
    "review": "I watched on the plane from Havana to Dusseldorf, and although it was impossible to understand anything due to the whispering of the actors and the loud of the plane, it thrilled me a lot. I will watch it maybe another time to enjoy it better."
  },
  {
    "rating": "3.5/5",
    "review": "A nice thriller with full masala. Liked the character played by Ben Affleck it was well rounded giving it the required edge."
  },
  {
    "rating": "5/5",
    "review": "Affleck does an amazing job as Christian displaying his abilities as an actor when it comes to showing the autistic side of his character and then switching up to the action sequences smoothly showing the other side of the character. Kendrick does a fine job but isn't given much to do here. Simmons turns in his usual well done performance but offers a few surprises of his own. And Addai-Robinson, a new face to me, shows that she has what it takes to get more featured rolls. At the heart of it all is the story that captivates the viewer. It takes a topic that is usually reserved for disease-of-the-week status and inserts it into something completely different. Then it twists and turns the story around that basic concept and makes it something unique. For me this movie was one that held me in its grip from start to finish and caught me off guard as well. That's rare these days and make this a movie that I can't recommend highly enough."
  },
  {
    "rating": "5/5",
    "review": "This is a wonderful movie. A lot more of an action flick than title suggests. Was a pleasant surprise as plot unfolded. Ben Affleck is perfect for this part. Well written script and good acting by all. Nice use of flashbacks for character development. Many twists and turns and a bit of a surprise ending. Watch it! You won't be disappointed."
  },
  {
    "rating": "3/5",
    "review": "It is not one of the best work by Ben Affleck. But it is good to watch for a change. It has a slot but dramatic plot."
  },
  {
    "rating": "5/5",
    "review": "I thought this was a highly underrated movie. I watched it first on a cruise and then re-watched it at home on my large screen TV. There are subtleties that are hard to pick up on the first quick run-through. Action packed. Would love to see a sequel."
  },
  {
    "rating": "3/5",
    "review": "enjoyed it a lot, but nothing crazy that makes it a must watch. storyline was pretty confusing in general imo, but maybe that was my fault."
  },
  {
    "rating": "5/5",
    "review": "It's a fascinating, tight, complicated story. I dislike Ben Affleck pretty strongly but I love this movie. I've watched it 5 times so far."
  },
  {
    "rating": "4/5",
    "review": "The Accountant is bolstered by its intricate character played by Affleck as well as its sophisticated tropes and reveals. While its plot may be a bit too extensive and prolong the film still supplies the drama and efforts of being more than solid. 4/5"
  },
  {
    "rating": "4/5",
    "review": "He'll balance your books and deduct your life."
  },
  {
    "rating": "4/5",
    "review": "The US Treasury Department is searching for a man who is the accountant to several global crime figures. They know him simply as The Accountant. The man himself is living a fairly inconspicuous existence as a practicing accountant. He is hired by Living Robotics, a tech firm, to go through their accounts after a junior accountant found some abnormalities. What he finds makes him a marked man... Great movie. Good plot with heaps of intrigue, twists and turns. The writer and director do well to not reveal too much too soon, aiding the suspense. Good action scenes too. Not overdone, and reasonably plausible, i.e. not your impossible, perfectly-choreographed stuff. Solid performance by Ben Affleck in the lead role. Good support from Anna Kendrick."
  },
  {
    "rating": "4/5",
    "review": "A gifted accountant struggles to connect to other people while coping with his own Asperger's Syndrome. Also he kills a bunch of hitmen."
  },
  {
    "rating": "3/5",
    "review": "The Accountant was a great presentation! Ben Affleck plays an awesome role as an accountant, displaying the professionalism in the workplace, as well as the muscle in the action when finding where the money from a missing account goes. Very interesting ending and keeps you interested the entire film. Supurb!"
  },
  {
    "rating": "3/5",
    "review": "I was surprised with this, but it went too far in playing on Autism in order to create a fantastic character. Affleck was not always believable."
  },
  {
    "rating": "4/5",
    "review": "Ben Affleck plays an autistic man with a head for numbers who works for some of the most dangerous criminal organisations in the world. Through flashbacks we also learn about a harsh upbringing that was led by his army colonel father, a man who believed he needed to train his son to defend himself from those that would wish to exploit him and so our accountant is also a man with the ability to take anyone out with efficient and deadly force. When the authorities begin to pick up the trail of the accountant, he covers his tracks by taking on a legitimate job but it's this job that leads not just the FBI but a group of elite killers on his trail to cover up what he has uncovered. I thought this was a surprisingly decent film, the first half is a mystery which then develops into an action thriller. The only thing that I felt was a little out of place was the casting of Anna Kendrick who seemed a little too chirpy for the particular role she was playing."
  },
  {
    "rating": "5/5",
    "review": "I didn't read many reviews about it and only heard it was a \"good movie\". I thought The Accountant was an incredible movie! I felt like I got more then my money's worth. I thoroughly enjoyed every minute of it and it held my attention throughout the duration of the movie. I am a big fan of Ben Affleck and thought his acting in it was outstanding. If you enjoyed the Bourne movies you will love The Accountant. The story and plot behind was very well done. It is suspenseful and holds your attention. I would easily give this movie a 10 out of 10 and will absolutely watch it again."
  },
  {
    "rating": "5/5",
    "review": "Jason Bourne but way smarter - Ben Affleck nailed it"
  },
  {
    "rating": "5/5",
    "review": "It's not that often a great story gets translated into a classy script and then benefits from top level acting. Thankfully this film manages to do all that and more. The unique story line combined with some excellent acting and action scenes is a triumph and is not just for those who crave some realistic looking action. Ben Affleck does a great job and makes the unusually talented and afflicted 'Accountant' believable."
  },
  {
    "rating": "5/5",
    "review": "The movie is beyond description- i mean, that is how to tell a good story. Talk about love of the father, brothers in all sense of the word, the power of focus and the making of gentlemen through the fire. Its title though fitting in a way, is a deception in a sense via an innocuous name. We get a rare insight and angle to Asperger's Syndrome or \"AUTISM\" as many know it"
  },
  {
    "rating": "1/5",
    "review": "Terrible movie. Plotholes, bad acting, too many storylines."
  },
  {
    "rating": "4/5",
    "review": "SCOTT: (Dr. Scott Allison, Professor of Psychology, University of Richmond) Greg, can I count on you to review The Accountant? GREG: (Greg Smith, Founder of Agile Writers of Richmond, VA) Sure, but there s no accounting for taste. Let s recap. SCOTT: We meet an autistic child named Christian Wolff (Seth Lee/Ben Affleck), whose parents are very worried about his ability to lead a normal life. We also meet Christian s younger brother Baxter (Jake Presley/Jon Bernthal). Christian s dad (Robert C. Treveiler) decides that young Christian doesn t need special psychological help for his autism; he only needs toughening up. Along the way, Baxter receives the same military-style upbringing. GREG: Flash forward 30 years and Christian Wolff is invited to review the books of robotics company Live Robots. He finds a discrepancy but is told to stop the investigation. Meanwhile, agents at the FBI have taken an interest in Christian s extracurricular activities. It seems he was the perpetrator of a killing of a mob boss that the director of the FBI was involved in. Further investigation reveals that Christian is deeply involved in the bookkeeping of several drug and crime lords. Who is this mysterious accountant? SCOTT: Greg, I enjoyed The Accountant, probably far more than I should have. Perhaps it s because Ben Affleck is at his best when he delivers an understated performance. Perhaps it s because this movie defied Hollywood s norm of portraying a disabled person as impeccably virtuous. Or perhaps because we have an intriguing story here with a number of memorable performances, most notably by J.K. Simmons, Anna Kendrick, Cynthia Addai-Robinson, Jon Bernthal, and John Lithgow. The story structure is interesting in first showing us revealing snippets of Wolff s childhood struggles with autism, and then abruptly moving deep into Wolff s hero s journey as a 40-year-old accountant. Or rather his anti-hero s journey, as Wolff may be a genius but he has used his genius to help some really bad dudes. As is typical of a hero, Wolff is missing something important that he must find to obtain true happiness. In this case, it is a connection with people. The character of Dana Cummings enters his life to help him discover this missing quality. GREG: I also enjoyed The Accountant more than I expected. While there were a few plot holes, they weren t too egregious as to interrupt my enjoyment of the film. We ve been fed a lot of superhero movies this year, and in many ways, the Accountant is a superhero as well. He has super intelligence as well as super fighting and weapons abilities. In many ways, the Accountant is similar to Affleck s other role of late - Batman. In writing circles we have a concept called Saving the Cat. This is an act by an otherwise rough character that softens his persona for the audience. In The Accountant, Wolff saves Dana s life in a situation that amounts to pure altruism. He has no stake in her survival, yet he goes out of his way, risking his own life and his mission to get Dana to a safe place. This ingratiates him to us, and so his anti-hero status is softened. SCOTT: That s an interesting cat concept, Greg. Our hero Wolff is a complex character, helping out bad guys but also revealing fabulous mental superpowers and saving people like Dana. We may not agree with his criminal associations, but we empathize with his severe autism and can understand how he was led down a dark path by his father s parenting failures. It didn t help that Wolff is mentored in prison by Lamar Black (Jeffrey Tambor) who shares with Wolff the secrets of cooking the books. GREG: Yes, Wolff has a couple of dark mentors. I found it curious that his father took him out of the special school for autistic children, yet Wolff gave copious sums to them as donations. It implies that the school acted as a mentor to his inner self, rather than to his physical capacities or to train his autistic mind. I had trouble with labeling the father as a dark mentor. After all, he taught Wolff to defend himself against bullies. However, both Wolff and his brother end up in the employ of seedy characters doing dark deeds. In the end, their father s military training does appear to be dark mentoring. SCOTT: Good point about the father. We go out of our way to label these characters as either good mentors or dark mentors, but in doing so we lose sight of the fact that most fathers are probably a mix of both good and bad. That certainly seems to be the case with Wolff. Should we create a category of mentor called the mixed mentor? Something to chew on. Overall, The Accountant grabbed my interest from the outset and held my attention for the full two hours. I wanted to know what happened to this struggling little boy with the cold, demanding father. And then when we find out, I wanted to know if the struggling man, who is still a boy in many ways, can finally grow up and transform into something better. The answer is yes, and I was left fully satisfied as a moviegoer. I doubt The Accountant will win any awards but it did win my heart. I give it 4 Reels out of 5. As mentioned, this film portrays the hero s journey in an unconventional way, giving us an overview of Wolff s childhood and then jumping ahead 30 years to Wolff in early middle-age. This is the point in the story when Wolff is ripe for transformation, as his love interest enters his life and he has several moments of truth to deal with. Wolff s journey is not one that we see very often in the movies, and I enjoyed it. I give him a rating 3 Heroes out of 5. Mentorship has a strong presence in this movie. In addition to Wolff s two darkish mentors, J. K. Simmons character, Ray King, serves as a strong and also darkish mentor to his prot g Marybeth Medina (Cynthia Addai-Robinson). The mentors in this film earn a rating of 4 Mentors out of 5. Movie: Mentors: Heroes: GREG: The Accountant was a surprise in many ways. Firstly, it made an accountant interesting - quite the daring feat. Secondly, the accountant in this story is fairly emotionless. That is a difficult role for an actor. Such other notable characters in film come to mind - Spock from the Star Trek franchise and the eponymous Lucy from 2014. Affleck really delivered the goods. While he was characteristically stoic throughout the film, we definitely came to sympathize and ultimately root for him in the end. And while this was clearly an action/adventure, there was plenty of character development and relationships at play. Pile on that this was an origin story for a new kind of superhero (which often takes up half a film), and you can see that a lot was packed into 120 minutes. I also award 4 out of 5 Reels. I think this is a bit of an anti-hero story, Scott. As we note in our book Reel Heroes & Villains, the anti-hero is an otherwise villainous character who is the protagonist. Wolff deals on the wrong side of the law and kills with impunity. However, we see him apply his super skill to save an old farming couple and Dana. I liked this anti-hero and award him 3 out of 5 Heroes. And while I agree with your assessment of the mentors in this film, dark though they were, I don t have as much enthusiasm for them as you do. They are pretty average mentors that we have seen before. I can only muster 3 out of 5 Mentor points. Movie: Mentors: Heroes:"
  },
  {
    "rating": "4.5/5",
    "review": "Originally going into this movie I was scared it was going to be just another run of the mill generic action film. But I was very pleasantly surprised that it wasn't. Ben Affleck plays the accountant in the movie, a very different type of man, but an extremely gifted man too. Anna Kendrick plays a woman who briefly works alongside Affleck and kinda gets dragged into all the mess he gets into. The movie has an intriguing plot that is interesting and entertaining to see unfold. There are things we are unsure of until the ending, which is what kept me watching to be honest. Knowing that there was probably going to be a good pay off at the end is what kept me engaged and focused on this movie. At the beginning I did not think I was going to like it at all, just didn't seem like my kind of film, but I was wrong. You don't have to love action movies to enjoy this movie, in fact the action aspect of the film is not a very large portion of what the movie is, it spends more time getting to know the main characters and giving backstory to them so you can connect with them better. The good writing does that for the characters too. The interactions between Kendrick and Affleck are well done and I also liked the interactions between Affleck and his brother in the film. Overall it's a smart well done movie."
  },
  {
    "rating": "5/5",
    "review": "The Accountant is a Batman Movie without the mask & cape. It has Ben Affleck as the accountant or Batman, a caring voice in the phone or Alfred,J.K. Simmons as Director King or Commissioner Gordon,Cynthia Addai-Robinson as an uptight Federal Agent with controversial past or Rene Montoya. Like Batman, Wolff has serious socialising problems, doesn't trust people, see through every task he takes.Even Wolff's dialogue's are ripoff from Batman. The brother Braxton was the unnecessary added element. It's an awesome Batman type thriller. The Director is clearly a fan of Batman & Action Comics , specially Frank Miller version.The Film is Dark, Violent, Action packed, Complete. There is no big plot holes. Some occasional mishaps like wearing Army Uniform incorrectly or having wrong date for foundation of US treasury department, but those is only visible to people whose only job is to criticise movies. for the rest of the folks,who loves a good action thriller , The Accountant is an automatic choice."
  },
  {
    "rating": "5/5",
    "review": "My high expectations for 'The Accountant' was satisfied 100%. This movie was so intelligently done and was absolutely investing from beginning to end. From the very opening moment, I was gripped into the story and did not break out of the hold until credits rolled. The mystery, the action, the intelligence of this movie is done so well, I can not be more fulfilled in what I could want in a film... Everyone in 'The Accountant' had a rightful fit and knocked home- runs out of the park when they were on screen. Easily, Affleck had a performance of a lifetime, for me. His secretive yet extremely intelligent and underlying charismatic character of Christian Wolff is done to perfection. Jon Bernthal, once again, and I will not stop posting this until I see a performance I am not impressed with. does phenomenally well with the character he portrays of Brax. His confident intensity is prevalent in nearly every character he plays and it is done so well again in Brax. Now in attempt to not lengthen this section even more, I pay great respects to J.K. Simmons, Anna Kendrick, Jeffrey Tambor, Cynthia Addai-Robinson and everyone else because every name did so well to contribute to this story. No one felt unnecessary... My only negative points come from minor spoilers of the film, so if you would be interested to discuss, feel free to contact me but otherwise, the negative points do not persuade me enough to feel differently of the film as a whole. It was too strong of a movie creative wise and performance wise for minor issues to take too much of a position in my stance."
  },
  {
    "rating": "2.5/5",
    "review": "Was not a fan of this one. This film has some great action sequences, but a poor performance by Ben Affleck plus a storyline that just isn't that interesting bring this one down. This film follows Christian Wolff (Ben Affleck) is a freelance accountant that works for criminal organizations and unmasks insider financial deceptions. When the Treasury Department's Crime Enforcement Division (FinCen) led by Ray King (J.K. Simmons) starts to close in on Christian's involvement in illegal activities Christian takes a legitimate job with a robotics company called Living Robotics Corporation to go through their numbers. There at the company he works with their accounting clerk Dana Cummings (Anna Kendrick). The two of them soon find out that over $61 million has been embezzled from the company. Before they can uncover where the funds are coming out of Christian is dismissed and Dana is fired. Shortly after men are send after Dana who are thwarted by Christian. The two of them must work together to uncover the secret of the Living Robotics Corporation meanwhile while also dodging Ray and his data analyst Marybeth Medina (Cynthia Addai-Robinson) who are slowly closing in on Christian's background and true identity. So right off the bat the storyline is a bit too convoluted. It isn't hard to follow along and the film itself even has a bit of a \"twist\" at the end, but it just doesn't seem like that big of a payoff the ending itself is super anti-climatic. Anna Kendrick isn't used that well in the film. She is there to show more of a human side to Christian, but she really kind of drops off in the last 40 minutes of the film. I don't know if she originally had a bigger part, but she seems really out of place in this film. I normally like Ben Affleck too, but trying to believe he's an autistic guy with some crazy powers is just a bit too much for me (yet I can believe he's Batman right?). It just doesn't work and I felt like he was trying too hard here. Lastly, Addai-Robinson as Marybeth is kinda random too. She's this tough as nails analyst that is being blackmailed and she just once again doesn't seem necessary to the film. Not to mentions some of the dialogue she delivers is absolutely atrocious. The film is also so dang predictable. Outside of the flashback story that is told through Christians dreams and Ray retelling the story it just never works. Overall, this is a rental at the very least since there are some cool action sequences, but the story and acting falls very flat."
  },
  {
    "rating": "4/5",
    "review": "4/1/17?? I watched this several months ago. I really liked it so I was a bit surprised that it did not get good reviews. I can't remember enough about it to give it a good review months later though."
  },
  {
    "rating": "4/5",
    "review": "Amazing build up to the plot, good action and an incredible story."
  },
  {
    "rating": "4/5",
    "review": "Very enjoyable with good action."
  },
  {
    "rating": "3/5",
    "review": "I am a huge fan of espionage films, and while Accountant doesn't have the intriguing backstory to create the most compelling character (think Bond/Bourne), it is still a fun watch. While the movie is piled with an overabundance of plotlines, the action is fast and intense, and Affleck and co are pretty solid."
  },
  {
    "rating": "4/5",
    "review": "Not a bad flick. Ben's character, while somewhat 2-dimensional, was enjoyable. The action came at a decent pace with nice breaks in-between to provide contrast. Anna Kendrick's character came off well in contrast to Ben's. Started watching it on the plane, and had to watch the end when I got home. Not perfect, but solid entertainment. Nice twist at the end also. ;)"
  },
  {
    "rating": "5/5",
    "review": "This is the best movie I have seen this year so far. I came to the theater with a mild expectation because this year so far, I haven't seen movies good enough to fit my movie lover's expectation yet. This movie sure passed it. In the duration of this movie, I never felt bored for a second. It was able to keep me interested from the beginning to the end. Plot is somewhat average but does get its job done. It is just like your usual crime/drama movie, but its autism and accountant setting makes everything a lot more interesting. The director uses a couple of flashbacks to provide more contexts for character development and this does a good job to make the protagonist more believable and likable. However, the whole story feels a little bit forced. I wish they could make its plot more natural. The real shining aspect of this movie is acting. Among great acting of almost all characters, Ben Affleck is especially fantastic. His acting is natural, vivid and with such subtlety. It is so convincing that you could image you could have a friend or coworker just like him. He jumps back and forth from an autism victim, to genius accountant and then to a precise and efficient killer, gives a lot of complexity to his character, which, somehow, is still very believable. His interaction with Anna makes him more human and likable."
  },
  {
    "rating": "5/5",
    "review": "This has to be one of my favorite movies this year. The part of a math savant, Christian Wolff, was made for Ben Affleck. One of his best yet. Enjoyed the heck out of some of the characters - John Lithgow, good to see him in something other than a comedy - J.K. Simmons, I could watch him in any part, he is especially good in this one 'cause you don't know quite how to take him until he unfolds his story for you. Jeffrey Tambor, Anna Kendrick, Jon Bernthal as Brax - too many good roles to mention. And no slouches either, Seth Lee and Jake Presley, who played the younger versions of Christian and Brax. I really didn't see a badly played part in this one. This is a violent picture, lots of deaths add up, but I'll tell you, it's a good movie and it keeps you involved to the very end. I will see it again and probably end up buying it when it comes out to be bought. I like it that much!"
  },
  {
    "rating": "5/5",
    "review": "Ben Affleck is superb in the role of the protagonist Wolff. His portrayal is both awkward and centred, an accurate and respectful interpretation of an individual with autistic challenges. JK Simmons is, as he typically is (i.e. Whiplash), a deliverer of three dimensional characters that is developed over time from an initially dislikable two dimensional generic mean boss, to one with human strengths and weaknesses and a level of self honesty that is very well done. As the film progresses, Affleck infuses more depth into his character, the whole thing builds like the paintings that are are first glance ancillary but as we watch become mirrors for the characters. Anna Kendrick does a decent job in her role and I for one am grateful that the director did not do the expected thing with the young female role. This decision lessens her participation but makes the character more memorable and likable. Without spoilers, I didn't guess about Bernthal's character until very close to the reveal and the final other character reveal I will not go into because it is brilliantly done, and extremely subtle. This more mature Affleck is really turning very high quality, and I think he has more in him."
  },
  {
    "rating": "5/5",
    "review": "There is one thing to be said about pace. It is most difficult to pull off in our microwaved two-minute noodle world. Pace takes guts. But Gavin O'Connor and Bill Dubuque pulls it off, Masterfully. It is also refreshing to see Anna Kendrick's deeper acting talent starting to emerge from the stereotyped groove her career almost entrenched itself in. I believe that she is developing into a force to be reckoned with, as her unique \"damsel in distress\" role delivers. Ben Affleck seems to be an all or nothing rated actor. Some love him (most, I think), some don't. But it's not whether you love him or not. It's whether he pulls you into the character he portrays. And I believe he does. An enjoyable movie interests you quickly, then grips you tightly and thrills you to the close. And this movie ticks all of the blocks. Can't wait to see more of O'Connor and Dubuque's work."
  },
  {
    "rating": "4.5/5",
    "review": "I have watched this movie. It surprised me on many levels. It treated about a clever kid who because of his autism and his rigid education became one of the most efficient \"accountant\" for world's most criminal and nefarious organizations. Ben Affleck in this role really outdid himself. JK Simmons ,John Lightow, Anna Kendrick and Jon Bernthal played their roles very well. The movie also treats about another subject that family is everything."
  },
  {
    "rating": "5/5",
    "review": "When it released in theatre i dismissed it thinking it might be another dull movie on an accountant. I thot another Bourne rip off or shaky cam stuff. Boy i was so wrong. This movie is a very good drama/thriller. Saw this recently on a rented DVD. Affleck stars as The Accountant who has some dark secrets and illegal dealings. He had a rough childhood as an autistic kid who was raised by his army dad who made sure that his kids learn military training n Indonesian martial arts so that they r not exploited. Affleck credibly adopted the traits, behaviors and symptoms of autism. His performance was very good. The movie starts slowly but its not boring. There is sufficient character development n the story has good amount of twists n turns. There are several intersecting story lines in this film and one branch of that is the federal department tracking The Accountant. There is ample amount of action, both gun firing n hand to hand combat. The headshots r brutal, the body count is high n the movie ended well leaving room for a much needed sequel. But it is not ur typical action like John wick or The Equalizer. Thankfully it is not shot in hand held camera a la Jason bourne n Taken style jus to make it appear fast paced. The movie is engaging n entertaining. The suspense n tension is maintained throughout. Director O'Connor succeeded in normalising autism and showing that behavioural conditions should not get in the way of anyone's life."
  },
  {
    "rating": "4.5/5",
    "review": "This film connected with me on so many levels. It delivered in ways I was not expecting. I was laughing, cheering, crying, and ultimately walked out of that theater feeling more than satisfied. I want to go see it again. Something that is great about this film is that there are things you will pick up on more clearly through a second viewing, but it is not required to fully enjoy the film. Like I said in my title, I can say without a shadow of doubt that this film is better than any other film released this year. However, I will follow that by saying I have yet to see \"Hell or High Water\". So it's more like 99.9% sure. We will see how it holds up against the remaining anticipated releases. I do honestly believe it should be nominated come award season. This film is phenomenal and if you do not see this film before you die, you are doing yourself a disservice."
  },
  {
    "rating": "5/5",
    "review": "Rain Man becomes John Wick. Christian Wolff(Ben Affleck) a freelance accountant, who is also an autistic savant, making him perfectly good with numbers and figuring things out perfectly, but is unable to connect with people on an emotional level, he also works as a contract killer. But soon finds himself in over his head when he meets Dana(Anna Kendrick) a young accountant for his new client, and soon FBI agents begin to start closing in on him. A very well made action thriller, it's not over the top action, the movie carefully sets up it's story perfectly. Ben Affleck gives a brilliant performance has someone with high functioning autism, I believe he did his homework on autism, and it really shows in his performance. Jon Bernthal steals some scenes has a menacing hit-man/bodyguard. J.K. Simmons is also good, so is Anna Kendrick, although I wish that could have expanded her character more. I admired the way it explains Afflecks character in flashbacks and how he became who he is. I also like is just when you thought it was gonna have plot holes, and then corrects it. Although one surprise I kind of saw coming, but I really loved this movie, I think it overshadows Jason Bourne"
  },
  {
    "rating": "5/5",
    "review": "This film is TERRIFIC! The screenplay is cleverly well done and complicated enough to make you want to see it again - to figure out what you might have missed. The action is almost non-stop - but not overdone (to me). We felt all the actors were well cast and did a fine job - grumblers must just have to nit about SOMETHING. We ended up seeing this movie twice on our own. We thought it was so good, we saw it a third time with friends (to entice them to watch it) - and enjoyed it once again (this from someone who only wants to repeat watching a movie after at least 7 years - if ever). I haven't heard of anyone who enjoys having a movie that makes you think about it and discuss it a bit afterward who didn't find it a thoroughly entertaining and WELL SCRIPTED movie."
  },
  {
    "rating": "3.5/5",
    "review": "Recommended as an action movie, I would say its a worthy of a rental for a rainy day."
  },
  {
    "rating": "5/5",
    "review": "Great film! Loved the story and the action behind it. The superhero for accountants everywhere... and great message for unique and special kids everywhere!"
  },
  {
    "rating": "2/5",
    "review": "Plot had holes and acting was weak"
  },
  {
    "rating": "3.5/5",
    "review": "One of the better recent Ben Affleck offerings. Anna Kendrick is great. A bit hard to follow at times, but generally speaking, I enjoyed it!"
  },
  {
    "rating": "4/5",
    "review": "Batman and Punisher clash in this film and somehow John Jonah Jameson is in the picture. Fans of Pitch Perfect will love it too because you know why ;) Good pacing and overall a very enjoyable film featuring a pretty convincing act by Ben Affleck. Ben Affleck and Anna Kendricks have good chemistry and I like what she told him about everyone is constantly trying to find a place where they belong to. Pairing Ben Affleck, Anna Kendrick is the right equation for 'Accountant' https://www.usatoday.com/story/life/movies/2016/10/13/ben-affleck-anna-kendrick-accountant-pairing/91967212/ The Accountant Best Quotes - 'Sooner or later, different scares people.' http://www.moviequotesandmore.com/the-accountant-best-quotes/"
  },
  {
    "rating": "4/5",
    "review": "Great flick. Slow to start. But the pace does build. Seems Ben wants a series similar to Matt. Still needed to see Ben kick someone with his shin..."
  },
  {
    "rating": "4/5",
    "review": "One of the best thrillers of 2016. Great acting and really interesting story. The only nitpick is the predictability of the plot twists. If they could have had a director like David Fincher behind the camera, it would have elevated it to a even higher level of excellence."
  },
  {
    "rating": "5/5",
    "review": "This movie is WAY better than reviews here suggest. Smart, ORIGINAL, and an actual STORY as opposed to typical Hollywood films that consider blowing everything up a plot device."
  },
  {
    "rating": "5/5",
    "review": "I thought this movie was outstanding. I feel like I need to watch it again to catch some things I missed, as it is one of those movies that tend to get a little confusing pretty quickly. Ben Affleck played this role very well. Overall thought it was a really good watch. Would definitely suggest this to anyone looking for a good suspense movie."
  },
  {
    "rating": "4.5/5",
    "review": "I absolutely loved the movie. It was well balanced from start to finish."
  },
  {
    "rating": "5/5",
    "review": "Great movie, I regret not seeing it in the theatre. I've watched it more than a few times on HBO now and this has quickly become one my favorite Affleck roles. It's a fast paced movie and never a dull moment, great fight choreography and plenty of firepower. I really hope WB proceeds with plans for a sequel."
  },
  {
    "rating": "1/5",
    "review": "Why is the acting so horrible? I love Anna Kendrick but Ben Affleck is just so terrible he brings everyone down with him."
  },
  {
    "rating": "5/5",
    "review": "LOVED THIS MOVIE! Don't like Afleck. I think he is a dreadful Batman... BUT this movie was so much fun! Best action flick in recent memory. Loved the brotherly love/comraderie. Would have loved even more if someone had actually given him cause to use the bazooka, ð??? lol. I'd love a sequel!"
  },
  {
    "rating": "5/5",
    "review": "Loved this action packed edge of my seat Thriller! I wanted More...we need a sequel with more information about how the Dr hooked up again with Chris when his father said \"No\" and what about the doctor's daughter...how did her voice come through as so sophisticated?"
  },
  {
    "rating": "5/5",
    "review": "One unique action movie with a great story line and some classy acting plus a fantastic performance by Affleck"
  },
  {
    "rating": "5/5",
    "review": "It's not that often a great story gets translated into a classy script and then benefits from top level acting. Thankfully this film manages to do all that and more. The unique story line combined with some excellent acting and action scenes is a triumph and is not just for those who crave some realistic looking action. Ben Affleck does a great job and makes the unusually talented and afflicted 'Accountant' believable. After this performance Ben Affleck must surely be at the top of the list to play '007'."
  },
  {
    "rating": "5/5",
    "review": "Absolutely Amazing Story line and casting. Affleck steel the show for me."
  },
  {
    "rating": "1/5",
    "review": "is not the best Ben Affleck's movie..."
  },
  {
    "rating": "5/5",
    "review": "My husband and I really enjoyed this movie"
  },
  {
    "rating": "4/5",
    "review": "Despite the negative reviews, Ben Affleck brings it here. Never mind that Affleck is well known for so many action-packed movies, & remember the soulful days of Good Will Hunting. There is heart in this film, as well as a few surprises, one of which I didn't even see coming. Moreover, as someone who needs decent character development to really connect with a movie, I felt compassion &, in some instances, loathing for certain characters. Simply stated, this is not a movie for people who often miss nuances & easily misunderstand the intent."
  },
  {
    "rating": "4/5",
    "review": "Good will hunting gone criminal"
  },
  {
    "rating": "5/5",
    "review": "Simply excellent. Epitomizes the good bandit story and the acting was exceptional. Generally I can't stand anything with Ben Affleck - gotta give him proper respect here he embodies the character. I actually hope to see a sequel this character has tremendous potential. I simply loved it."
  },
  {
    "rating": "2/5",
    "review": "Plodding, disjointed marginally acted flick that probably could have been more compelling with a better cast. Having said that...I must say it did have riveting moments. \"We should go\"."
  },
  {
    "rating": "3/5",
    "review": "Ben Affleck plays a highly-functioning autistic man who cracks books by day and skulls by night, squashing threats of both a physical and financial nature for a wide range of criminal enterprises. I appreciate the basic concept, of a man with zero social capabilities who finds rhythm and peace in his very precise, specific line(s) of work, but the surrounding story is so worried about pulling one over on the viewer that it often feels too clever for its own good. Character motivations are a major issue, for example, with many players making an absurd, nonsensical about-face at crunch time. Even the anti-hero protagonist isn't immune to this, having less than no time for his female counterpart (Anna Kendrick) one day, then suddenly risking life and limb for her the next. That disconnect badly affects their on-screen relationship, far more than the abundant personality quirks brought about by his disorder. Affleck is great in the lead role, delivering precisely the mix of nerdy intellect and rough physical wherewithal necessary to bridge the two core aspects of his character. He works very well as both an antisocial genius and a ruthless, methodical, cold-blooded killer, and makes us forget about how unlikely a pairing that really is. That makes me think there's potential for more films in this franchise, even if its gimmicky, over-twisted first plot was a letdown."
  },
  {
    "rating": "5/5",
    "review": "An autistic boy grows up to right wrongs that doesn't fit with as moral code. Well played by Ben Affleck."
  },
  {
    "rating": "5/5",
    "review": "Underrated and highly misunderstood. Anyone who says this film makes Asperger's a superpower clearly doesn't pay attention or give much thought to films. The character's skills are the result of his unique upbringing, and years of honed practice, not his Asperger's. As shown by the other kids in the School who DIDN'T become assassins. Anyone else (let's say his brother) would have turned out the same, brought up under the same conditions, without Asperger's."
  },
  {
    "rating": "5/5",
    "review": "The Accountant = So. Good. Rotten Tomatoes obviously can't handle movies that can't be easily put into 1 genre. This is a legit movie."
  },
  {
    "rating": "5/5",
    "review": "This movie was great and the ending was shocking it wasn't too full of the action so it could give us a good enough backstory this movie should ve certified fresh in my opinion."
  },
  {
    "rating": "5/5",
    "review": "I had low expectations and generally thought the movie would suck. Surprisingly I thoroughly enjoyed the movie. There are a few scenes with bad dialogue, the scene when Dana walks into his trailer and he turns around stuttering, \"why are you here you can't be here sit down, sit down right there.\" I found hysterical. Also when she comes and sits next to him while eating lunch at the fountain. The look on his face like, oh my god it's her again, was funny as hell. I thought the acting was fine. As an action movie I'm not expecting a Daniel Day Lewis level of performance. But something memorable and magnetizing. Anna Kendrick wasn't anything spectacular but considering how little I like Ben Affleck, he did a great job. This is in my top few movies for the year as far as how much I enjoyed watching them. it frankly reminded me of how I felt after guardians of the galaxy. Going in with low expectations and coming out blown away by how much I actually enjoyed that movie. The plot may not be brilliant but it sure has more meat to it than any other major action film I've seen lately. John Wick I thought had better action sequences but it's plot was thinner than my hundred year old grandmothers hair. This made up for action with an actual plot and backstory, something John Wick only talked about but we never saw. I have a hard time understanding the low rating. Even my girlfriend who doesn't like action really enjoyed this movie. Stop trying to be a critic and go into an action flick with proper expectations and you will enjoy this movie."
  },
  {
    "rating": "4/5",
    "review": "Thrilling and intense but just a little disappointing, The Accountant hits more than it misses, but it's far from perfect. Ben Affleck gives a strong, committed performance, absolutely nailing the behavior and mannerisms of someone with High-Functioning Autism. Anna Kendrick also gives a great performance despite not having as much screen time as I expected. Regardless, she and Affleck have good chemistry together, and seeing them standing next to each other made me realize 1. How tall Affleck is (6'4\") and 2. How short Kendrick is (5'0\") and it honestly made me laugh a little. The film as a whole does leave much to be desired. The pacing is uneven at times, and there's more exposition than is probably necessary. That being said, the action is fun and intense, the flashbacks are appropriately used, and I'm honestly excited for any future sequels that may come."
  },
  {
    "rating": "2.5/5",
    "review": "The good news about this movie is that the bad news isn't so bad: it works as a bad cable movie. You know, the ones you throw on and kinda forget about? Except that Affleck tries so hard for you to want to watch him but then when you actually watch the movie you kinda have to chuckle. I did a lot of chuckling in this movie."
  },
  {
    "rating": "4/5",
    "review": "My husband and I both thought this was a fast moving, interesting movie with a lot of twists. Can't understand the rotten tomatoes votes."
  },
  {
    "rating": "4.5/5",
    "review": "It has some moments where it drags on with dialogue, but other than that this movie is worth watching with Ben Affleck being John Wick in this good movie."
  }
]