[
  {
    "rating": "1/5",
    "review": "Movie had mildly funny moments but no character development"
  },
  {
    "rating": "5/5",
    "review": "It was cool definitely had Bullet train vibes"
  },
  {
    "rating": "3.5/5",
    "review": "Better than I expected and quite funny"
  },
  {
    "rating": "4/5",
    "review": "Well done choreography, but the character development is unpleasant."
  },
  {
    "rating": "5/5",
    "review": "This movie will have you on edge the whole way through It was an excellent movie."
  },
  {
    "rating": "1/5",
    "review": "Too much pure violence."
  },
  {
    "rating": "3.5/5",
    "review": "A film that is definitely original, but the story is very muddled and never really concludes as it is open to a sequel but given the insanely poor box office it is a sequel we are unlikely to get. That is unless it is made by a streaming service like Prime or Netflix, and with streaming I think this may become a cult classic. It sadly just shows Josh doesn't have the status he once had when he was looking like the next big star in early to mid 2000's."
  },
  {
    "rating": "3.5/5",
    "review": "Starts out great but then the action is broken up and some avoided all together. At times they tried too much comedy otherwise it was. A fun movie, despite the social justice undertones A one timer though wouldn’t watch again"
  },
  {
    "rating": "5/5",
    "review": "Fun acton movie, lots of laugh, lots of action!"
  },
  {
    "rating": "4.5/5",
    "review": "FIGHT OR FLIGHT totally surprised me. It blends over-the-top action with comedy, reminiscent of films like EVIL DEAD or SISU. While it initially presents as a serious action thriller, it quickly (and wonderfully) evolves into something unique and truly memorable. The lead performances pull you into the action seamlessly, and the film has a couple of shots that are totally iconic. One scene in particular features a character in a visually stunning altered state of consciousness that would have delighted Timothy Leary. A must-see for action fans looking for something totally different... and amazing!"
  },
  {
    "rating": "0.5/5",
    "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Great movie. Lots of action ( lots of gore too), comedy, and a good plot. Not a clean ending, definitely a sequel ending. Recommended!"
  },
  {
    "rating": "4/5",
    "review": "This movie was action packed, and funny! It is a bit gory especially the chain saw sequence in case anyone doesn't like the blood and guts."
  },
  {
    "rating": "3.5/5",
    "review": "Didn’t see a trailer before watching this so rawdogged it and was blown away by how much fun it was. The scenes outside the airplane were rough but thankfully only had a few short things and make up for it with some of the most fun and creative action kills that seems to go nonstop throughout the movie. Josh is fully back and better than ever"
  },
  {
    "rating": "4/5",
    "review": "It was like Bullet Train on steriods and LSD! If action is your preference, then go see this. For the most part the action does not stop. Good to see Josh Hartnett again."
  },
  {
    "rating": "3.5/5",
    "review": "Fireflight is reminiscent of Bullet Train. A non-stop action-packed kill fest. If you're squeamish don't see it. You're not supposed to take this film seriously."
  },
  {
    "rating": "3/5",
    "review": "Josh acted well however it felt like a B level movie kinda NetFlix like ……. Too much blood for my taste."
  },
  {
    "rating": "4.5/5",
    "review": "Josh Harnett was pretty great. Funny, action packed, thoroughly enjoyed"
  },
  {
    "rating": "5/5",
    "review": "It had a really good twist of events throughout the film. The action and acting was great for what was going on!"
  },
  {
    "rating": "4/5",
    "review": "If you're expecting a theatrical performance that's award worthy, this is not the film for you. If like me, sometimes, you just want to sit down and watch something action packed, quite violent with a thin plot where the science doesn't totally hold up, then this is the movie for you! I'd rate this on a par with most Jason Statham movies, Sometimes a good action packed beat 'em up ticks the box. I did appreciate the humor throughout the movie and would probably watch it again. I watched the trailer and went in with no expectations of grandeur. For once the trailer wasn't the entire movie, but gave a good synopsis of what to expect!"
  },
  {
    "rating": "5/5",
    "review": "Its a really fun ride!"
  },
  {
    "rating": "4/5",
    "review": "Could have used the F word a lot less, but still a good movie..charitha was outstanding…pretty little lady.."
  },
  {
    "rating": "1.5/5",
    "review": "Movie had no story. It was just blood and killing. Totally a waste of time. Too supernatural for the storyline if at all there was any."
  },
  {
    "rating": "4.5/5",
    "review": "We loved watching this! So much action and fun! We welcome the Hartnessaince!"
  },
  {
    "rating": "5/5",
    "review": "Great action movie I loved it !"
  },
  {
    "rating": "1/5",
    "review": "Too over the top, didn’t make much sense and ended on a cliffhanger for a sequel that will probably never happen."
  },
  {
    "rating": "0.5/5",
    "review": "pretty bad. don’t waste ur time or money."
  },
  {
    "rating": "3/5",
    "review": "Fight or Flight is messy, fun, and delivers exactly what it promises. The setup is solid, the action is chaotic in all the right ways, and Josh Hartnett sporting bleach blond hair and full dad-badass energy brings real charm to the role, especially doing his own stunts. But it’s far from flawless. The shaky cam is excessive, the final act feels like five different endings mashed together, and some of the dialogue sounds like it was written by a teenager who just discovered swearing. A few twists are also a bit too easy to see coming. Still, if you're in the mood for stylish nonsense with throwback energy and a leading man who knows how to own the chaos, it’s a fun ride just expect turbulence."
  },
  {
    "rating": "4.5/5",
    "review": "This movie was ridiculous, and a whole lot of fun! I avoid bloody flicks like the plague. But this was merry mayhem, with humor and a frontal attack on everything tame. Good thing they shot it before the FDA outlawed Red Dye #3! The characters were never to be taken seriously, just enjoyed for the nutty extravagances the plot weaved. I laughed a lot. You will too."
  },
  {
    "rating": "5/5",
    "review": "This was entertaining"
  },
  {
    "rating": "5/5",
    "review": "I went in not expecting much from this movie. But I have to say it was very entertaining. It comes off on the trailer as a serious film but it’s more of a comedy. It was worth the watch"
  },
  {
    "rating": "4/5",
    "review": "FINALLY, a pre-Summer, great fun, interesting story, highly entertaining flick that strikes most of the right chords for an action mystery thriller. And, what an awesome role for Josh Hartnett! He may have just found his stride. In every way. And, none of that generational nonsense that wrecks other movies. The producers and directors and writers knocked this one out of the park. Highly recommended!"
  },
  {
    "rating": "5/5",
    "review": "Ive seen this 3 times now. Extremely fun movie. Hilarious and full of action."
  },
  {
    "rating": "1/5",
    "review": "The worst movie I watched in 20 years"
  },
  {
    "rating": "3.5/5",
    "review": "3.25/5.0 STARS - It's good to go into this with a healthy suspension of disbelief and the understanding that the film doesn't take itself too seriously. Feels like a better title for this movie would be \"Assassins on a Plane\" because that's encapsulates exactly what this story is about, and as you can imagine, the mayhem of the whole situation is a character in itself. Josh Hartnett shines in the role of Lucas Reyes, an ex-Secret Service agent who takes a mission that offers redemption and a possible pathway back to his former life. He's tasked with apprehending (and protecting) a cyberhacker/terrorist called \"Ghost\" who has boarded a plane for San Francisco. Unbeknownst to Reyes, most of his fellow plane passengers are assassins/bounty hunters who are also gunning for Ghost. What follows is a riotous adventure full of violence, hilarity, and a psychedelic drug trip. Worth watching for Harnett's performance alone. Video review: https://youtu.be/WirLWjK1zFY"
  },
  {
    "rating": "0.5/5",
    "review": "The story is riddled with plot holes, so dont bother analyzing it. However, if you're watching purely for the action—just to see people brawl without worrying about the narrative—then this might be the movie for you.\""
  },
  {
    "rating": "3/5",
    "review": "Not a bad film, not a good film. Josh Hartnett plays the character well, and delivers the quirky antics of his character well also. Although quite predictable."
  },
  {
    "rating": "2.5/5",
    "review": "A TV movie that somehow made it to the big screen, fun, but nothing to write home about. Like 'Bullet Train,' but on a plane and with a smaller budget."
  },
  {
    "rating": "1/5",
    "review": "Oofta. I'm surprised by all of the reviews calling this decent. This reminded me of a bad made-for-tv movie. There were a few quick humorous bits, though."
  },
  {
    "rating": "3/5",
    "review": "If you like a lot of fighting and bloody gore- you will love it!"
  },
  {
    "rating": "5/5",
    "review": "this movie was so fun! Josh did amazing and the director seemed like a seasoned pro, a very wild ride!"
  },
  {
    "rating": "4.5/5",
    "review": "Everything was well done until the end!"
  },
  {
    "rating": "4/5",
    "review": "Super fun flick! Think Bullet Train...on a plane....Bullet Plane. A blast!"
  },
  {
    "rating": "4/5",
    "review": "Loook! Don’t take it seriously! It’s a fun movie with typical movie tropes; it made me laugh and it had some good action but the plot isn’t the best however, it was a good experience with friends 😆"
  },
  {
    "rating": "4.5/5",
    "review": "Such a fun ride. Snakes on a Plane meets The Raid.. Minus Snakes.."
  },
  {
    "rating": "4/5",
    "review": "I really loved it. If you love action movies. Definitely go see this movie. Plus anything with Josh Hartnett in it is going to be good. I’m glad he’s back doing movies again. 2 back to back good movies!!!"
  },
  {
    "rating": "5/5",
    "review": "Just a great time of a movie! Funny, entertaining, and action filled!"
  },
  {
    "rating": "3/5",
    "review": "Made an account here just to write this. This is just such a dumb while entertaining movie, there are points where you almost feel a \"click\" when it stops taking itself seriously. Sooo many things don't make sense. And that is ok. Just focus on Josh Hartnett's performance (Charithra Chandran is great, too). It's so funny and captivating I honestly would have given this movie one star more if the movie had been the camera just focusing on his expressions and action shots. Only complaints: Criminal underuse of Katee Sackhoff and the way too fake \"HQ\" scenes."
  },
  {
    "rating": "4/5",
    "review": "One of the best action movies Iv seen in a while. Has a mix of die hard and John wick action! Definitely worth a watch"
  },
  {
    "rating": "3.5/5",
    "review": "Not the best, but not the worst either 😜 The perfect disengage-the-brain action flick! 🤩👊 Plus, it’s always nice to see #KateeSackhoff 🧐✌️"
  },
  {
    "rating": "4/5",
    "review": "Movie was a lot of fun!"
  },
  {
    "rating": "3.5/5",
    "review": "Die Hard on a plane with a little Bullet Train chaos thrown in. Josh Hartnett is clearly having the time of his life, and the action is relentless. Dumb? Absolutely. But it’s a good kind of dumb."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie! love Josh Hartnett! definitely recommend"
  },
  {
    "rating": "3.5/5",
    "review": "Surprisingly good. Story was great, acting was great. And the Violence was very creative. Only complaint was that it got slapstick and way too over-the-top when it did not need to. The story and acting would have carried the film without the silliness."
  },
  {
    "rating": "3/5",
    "review": "This movie was a weird one. The premise itself is something that leads to a good action flick -exiled (and depressed/drunk) Secret Service Agent given one last escort mission to redeem himself and come home- but the execution is a little off keeping it from 4 stars. I think it was the pacing. Some of the comedy beats were true gold, IMO, like the Yoga class in the background of a scene or the senior pilot ragging on his junior for relying on a useless manual. The fight scenes themselves were also well done, with excellent choreography if one suspends their disbelief a bit. As Kung Pow: Enter the Fist would put it - that doesn't seem physically possible! Unfortunately, between the very fun action sequences (and are planes really that big on the inside, with that many secret compartments???) and visual gags there really is too much awkward silence to make this a must see. I will not be purchasing a copy, but if I saw Fight or Flight on TV I would probably let it run. There is one FANTASTIC comedy bit with 'toad venom', but I wouldn't want to spoil it."
  },
  {
    "rating": "3/5",
    "review": "A fun ride even though nothing new here. But its entertaining and Josh has fun with the role. Definitely worth a watch"
  },
  {
    "rating": "2/5",
    "review": "Another Josh Hartnett vehicle with an interesting premise that is poorly written, sloppily executed and with a frustrating conclusion. Some of the fighting would be more enjoyable with less Shakey cam. Josh really goes for it, again, but he can't carry this flight."
  },
  {
    "rating": "3.5/5",
    "review": "Loved the stunts, action and the cast. Hartnett is a comedic hero and was amazing as the reluctant hitman. If you like comedy that's violent and bloody - this is the movie for you."
  },
  {
    "rating": "4/5",
    "review": "The chainsaw scene is worth the price of admission alone. There isn’t much depth to the story although it is serviceable by action standards. Josh Hartnett was great, also enjoyed the female companion. If you’re an action fan, definitely put this on your watchlist and go see it in movies. It was meant to be experienced at a movie theater.."
  },
  {
    "rating": "5/5",
    "review": "What a bloody good time!! A lot of action and some funny moments. Josh Hartnett was great in the movie and it helps he’s easy on the eyes."
  },
  {
    "rating": "5/5",
    "review": "SO. MUCH. FUN. More movies with Josh Hartnett like this please."
  },
  {
    "rating": "5/5",
    "review": "Excellent. Full of action and a little humor."
  },
  {
    "rating": "5/5",
    "review": "Just got home from watching this movie. Good action packed thrill ride full of chills spills and laughs."
  },
  {
    "rating": "4/5",
    "review": "It was an action-packed movie. It's worth seeing!"
  },
  {
    "rating": "1/5",
    "review": "Total waste of time."
  },
  {
    "rating": "4/5",
    "review": "A good action comedy. I enjoyed it overall"
  },
  {
    "rating": "3/5",
    "review": "It takes a while to get to the action but it’s decent."
  },
  {
    "rating": "5/5",
    "review": "John Wick meets Bullet Train on an airplane."
  },
  {
    "rating": "5/5",
    "review": "High octane, ultra-violent roller coaster ride! Most fun I’ve had at the movies this year!"
  },
  {
    "rating": "4.5/5",
    "review": "Action all the way!!"
  },
  {
    "rating": "5/5",
    "review": "Very fun movie! Looking forward to the sequel!"
  },
  {
    "rating": "3/5",
    "review": "A crazy ride with lots of action and many plot holes. Josh Hartnett is very good as a desperate, drug and alcohol addled 'agent' and Charithra Chandran is not bad either."
  },
  {
    "rating": "3.5/5",
    "review": "It is an entertaining, action packed, funny, insane and stupid movie, just enjoy the ride."
  },
  {
    "rating": "5/5",
    "review": "It was like bullet train"
  },
  {
    "rating": "4/5",
    "review": "The movie has a lot of action and is fast paced. It has a plot with twists and turns. If you like action packed movies with some humor, like The Kingsmen, you will enjoy this movie. I enjoyed it. It also makes a statement that should mean something to everyone that watches it. Please enjoy the movie! Not for young children."
  },
  {
    "rating": "4/5",
    "review": "Good movie, loved the action. Movie flowed. Would definitely see it again"
  },
  {
    "rating": "5/5",
    "review": "If you love action movies as much as I do this is for you. It’s crazy, insane and funny at times. And they left it wide open for a sequel."
  },
  {
    "rating": "4/5",
    "review": "Full of action with laughs in between"
  },
  {
    "rating": "5/5",
    "review": "Absolutely fun, violent scenes, quick story but still solid"
  },
  {
    "rating": "3.5/5",
    "review": "Great action. Storyline a little unserious , unexpected gore"
  },
  {
    "rating": "0.5/5",
    "review": "That movie was bad, actors over acting, weird story Didnt like it"
  },
  {
    "rating": "3.5/5",
    "review": "This is really really fun. Vibe is very similar to bullet train. Fun characters, story, fights and visuals. Worth a matinee"
  },
  {
    "rating": "3/5",
    "review": "John Wick on a plane, or at least tries to be. The double-crosses are too easy to see coming and Josh Hartnett's drunk and drugged ex-agent going up against a plane filled with professional assassins strains the believability threshold."
  },
  {
    "rating": "5/5",
    "review": "Funniest movie this has got to be one of the best movie of 2025 the action with the chainsaw and the crazy fights were the best part there needs to be a series to this movie there needs to be more parts to this movie made"
  },
  {
    "rating": "5/5",
    "review": "Action packed, although there were some scenes that were too gross for my eyes"
  },
  {
    "rating": "3.5/5",
    "review": "Not a bad film. Lots of brutal action, reminiscent of John Wick and, as others have stated, Bullet Train."
  },
  {
    "rating": "3.5/5",
    "review": "It was action packed and funny at the same time."
  },
  {
    "rating": "2/5",
    "review": "It’s chaotic in both the ways you’d want and [wouldn’t] want: It’s as Josh Hartnett and as Bullet-Plane as you’d want, but it’s a very convoluted and uneven film.🍀"
  },
  {
    "rating": "2/5",
    "review": "My excitement going into Fight Or Flight was surprisingly high, but I felt very underwhelmed with what felt like one hundred minutes of a recycled action movie story. Josh Hartnett never fails to disappoint me and I highly respect him for doing his own stunts in the film, and the action was the most fun I got out of this movie. But I think the movie lacks highly in action sequences and focuses too much on a story I could honestly care less for. The story is paced very awkwardly and other than Josh Hartnett’s character, the story and other characters were very lacklustre and brings the movie down with itself. The movie can be a lot of fun at times, but it just wasn’t for me so I recommend just streaming this one"
  },
  {
    "rating": "3.5/5",
    "review": "It was good fun. great fight scenes. funny although I seemed to be tye only one getting the jokes."
  },
  {
    "rating": "5/5",
    "review": "Very fun, and non stop action."
  },
  {
    "rating": "4/5",
    "review": "Josh Hartnett brings the charm once again in Fight or Flight. While it’s another entry in the assassin movie genre, the film sets itself apart with humor, fast-paced action, and a few smart twists. Don’t expect something groundbreaking—just sit back, relax, and enjoy the ride. It’s pure fun."
  },
  {
    "rating": "5/5",
    "review": "The movie was a lot of fun, it was much better than I expected it to be based on the previews for it. It had an actual storyline, and left an opening for a part two."
  },
  {
    "rating": "4.5/5",
    "review": "This is a movie that achieved its purpose. It was funny, entertaining, charming and gruesome. It didn't try to send a message or create a heavy story line that required studying every line of dialogue, and yet these charming actors could, with a single tear, deliver emotion felt by the audience. I would love to see a sequel to this film. The audience deserves to see more of these characters and their continuing story!"
  },
  {
    "rating": "5/5",
    "review": "Funny with a lot of action. Could be another one to come."
  },
  {
    "rating": "2/5",
    "review": "They were dropping too many F bombs for my taste buds."
  },
  {
    "rating": "5/5",
    "review": "If you like Bullet Train, this is for you"
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed it. Action packed. What's up with Katee Sackoff? She had some bad plastic surgery..."
  },
  {
    "rating": "4/5",
    "review": "Like bullet train, but in a plane. Josh Hartnett was so awesome. Funny and action packed. Couldnt ask for more"
  },
  {
    "rating": "5/5",
    "review": "This movie was alot of fun. Great action and great humor."
  },
  {
    "rating": "3.5/5",
    "review": "Lots of action, gory insane deaths, moments of funny sprinkled throughout. I think the action was the point as the plot was thin."
  },
  {
    "rating": "3.5/5",
    "review": "Well, that was hard to dislike! The enthusiasm thrown into the action is just contagious. Fun, I must say. Over the top at times, but still a gas. Definitely a popcorn movie. Go watch and have a blast! Ha."
  },
  {
    "rating": "4/5",
    "review": "my husband enjoyed it I did to some extent. the action was packed, and the storyline was basic. it will get you through an hour and a half fairly entertained. Nothing to run to see, though."
  },
  {
    "rating": "5/5",
    "review": "Fun action packed movie."
  },
  {
    "rating": "3/5",
    "review": "\"Bullet Train\" and \"Smoking Aces\" are better, smarter and funnier than \"Fight or Flight.\" Wait for it on cable."
  },
  {
    "rating": "4/5",
    "review": "I liked it .It was well paced and funny"
  },
  {
    "rating": "4/5",
    "review": "Fun and funny movie. Reminded me of Bullet Train with main character. In action movies, a must see movie"
  },
  {
    "rating": "5/5",
    "review": "Great action movie with consistent fun and plot elements throughout. If you like the trailer, then you will enjoy the movie."
  },
  {
    "rating": "3.5/5",
    "review": "Tons of action with unusual ways to kill! Cold blooded villains!"
  },
  {
    "rating": "4/5",
    "review": "This movie is ridiculous and is a ridiculous amount of fun. I will likely see it again soon."
  },
  {
    "rating": "5/5",
    "review": "This was my Mother's Day movie and we absolutely LOVED it!!! Highly recommend this action filled comedy sprinkled with sweet and touching moments. Love Love Love this movie and will be seeing it again in theaters!"
  },
  {
    "rating": "3/5",
    "review": "Too much blood and guts"
  },
  {
    "rating": "1.5/5",
    "review": "pretty gory cute lead actor unrealistic plot"
  },
  {
    "rating": "4/5",
    "review": "Great thriller and a lot of unknowns"
  },
  {
    "rating": "2.5/5",
    "review": "Josh Hartnett is gorgeous, and the movie was worth watching him for an hour and an half--but otherwise a waste. The plot was stupid--another airplane capture, enclosed capsule plot, with nonstop and senseless violence. Insufficient weight to overcome the movie's total implausibility. But Hartnett is a stunner."
  },
  {
    "rating": "5/5",
    "review": "I am not typically and “action” movie person but this one had me laughing and involved each second. My 14 year old son has also given his stamp of approval. I highly recommend!"
  },
  {
    "rating": "5/5",
    "review": "Fantastic film. Loved loved loved!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! I really enjoyed it"
  },
  {
    "rating": "4.5/5",
    "review": "I absolutely loved Fight or Flight! Josh Hartnett delivers a standout performance, blending action, comedy, and sheer charisma in a way that keeps you hooked from start to finish. The film’s wild energy and unpredictable twists make it a thrilling, unforgettable ride. A must-watch for anyone craving high-octane fun!"
  },
  {
    "rating": "3.5/5",
    "review": "I liked it! Mindless fun for a Sunday afternoon. If you like a lot of action, endless fight scenes and predictable plot lines (and I do) then this is the movie for you. Oh and if youre squeamish about over the top blood and gore you might want to sit this one out."
  },
  {
    "rating": "2/5",
    "review": "Very bloody and gorry, could have been better with that story line."
  },
  {
    "rating": "3.5/5",
    "review": "Buckle Up for a Hight-Octane Ride James Madigan's Fight or Flight certainly delivers on its promise of high-octane action, throwing audiences headfirst into a claustrophobic battleground aboard a 16 hour flight. Fans craving the kinetic energy of films like Bullet Train will find plenty to enjoy here, with Josh Hartnett anchoring the chaos as disgraced agent Lucas Reyes. The action sequences themselves are undeniably fun. Madigan orchestrates a series of inventive and brutal confrontations within the confined spaces of the aircraft. From close-quarters combat in the aisles to resourceful weaponizing of everyday objects, the film keeps the adrenaline pumping. However, while Fight or Flight manages to keep its engines roaring on the action front, it unfortunately doesn't quite reach the cruising altitude of its more sophisticated cousin, Bullet Train. Where David Leitch's film excelled was in its razor-sharp dialogue and richly developed ensemble cast, each character with their own distinct quirks and compelling backstories. Fight or Flight, in contrast, feels somewhat less nuanced in these areas. Ultimately, Fight or Flight is a solid action thriller that will likely satisfy those looking for a thrill ride above the clouds. Josh Hartnett delivers a compelling lead performance, and the action is undeniably entertaining."
  },
  {
    "rating": "4/5",
    "review": "Action packed and lots of fun- can't wait for the sequel"
  },
  {
    "rating": "3.5/5",
    "review": "Slow start, good fights and closing."
  },
  {
    "rating": "4/5",
    "review": "Keeps you captivated"
  },
  {
    "rating": "3/5",
    "review": "\"Fight or Flight\" earns some points for being fully aware of what kind of movie it is. This is an over-the-top action movie that primarily takes place in one location, and it is an entertaining enough one at that. I do think there are actually a few recent movies with similar concepts that are better, \"Bullet Train\" and \"Kill\" to name a few recent ones that come to mind. That being said, this movie has enough action and comedy to make it a light viewing experience. The story has some intrigue, and the way it plays out is enjoyable enough. Overall, it is an okay action B-movie, but one that fully owns it, and I think more action movies should take this approach."
  },
  {
    "rating": "4/5",
    "review": "The action was great. The plot line was a little thin. But was funny at times. Did not regret seeing"
  },
  {
    "rating": "5/5",
    "review": "I enjoyed it a lot. I like action movies and this one has a lot of action."
  },
  {
    "rating": "3.5/5",
    "review": "Action, baby! Jackie Chan-ish move by Josh, nice !!"
  },
  {
    "rating": "5/5",
    "review": "Movie was very nice it is great success I like! Went with friends."
  },
  {
    "rating": "1/5",
    "review": "The movie was awful...I feel betrayed by the theater for charging me for the tickets and giving it credibility alongside decent movies. The hot dogs were so much better than the movie, albeit, pretty pricy. Hartnett and Chandran did a very nice job with a goofy script using Airplane as a base model and the Texas Chain Saw Murders as inspiration. Their chemistry was nice and they deserve credit for working so hard on an awful project. Our society is so past using the F bomb in EVERY sentence...that's what immature writers and directors use when they have no skills or talent and have a contract to fulfill...just use F in every sentence and sent it to the director to make it work."
  },
  {
    "rating": "3/5",
    "review": "The movie was quite enjoyable actually. The action was constant on your seat and the humor was just enough. They could of tapered off the cussing for sure so I have to take a star off for this. There were a couple spots where he miraculously healed so half star off for that. You just cant heal that fast even in fiction, lol. Would I recommend, yes. Just not with kids."
  },
  {
    "rating": "5/5",
    "review": "Action Packed from the get go. Enjoyed it all."
  },
  {
    "rating": "5/5",
    "review": "a fun ride, looking to see the sequel"
  },
  {
    "rating": "5/5",
    "review": "Josh Hartnett high on toad venom sticking an ice axe in someones head was just the thing I needed after a busy weekend."
  },
  {
    "rating": "5/5",
    "review": "good slap stick violence w/ a good cast"
  },
  {
    "rating": "5/5",
    "review": "Awesome - can't wait for the sequel!"
  },
  {
    "rating": "3/5",
    "review": "Decent but not 5 stars."
  },
  {
    "rating": "3/5",
    "review": "Theres lots of action but mostly kill sequences and less story line. I would prefer less kill sequences to bring out a more developed story of the characters and communication."
  },
  {
    "rating": "5/5",
    "review": "Josh Hartnett KILLED THIS ROLE. it’s a must see action comedy with heart. I was able to take my mom and brother and we all came out of it with a smile on our faces, and looked forward to seeing the sequel. VERY UNIQUE AND WELL DONE ACTION SHOTS. Some twists, and just enough comedy to keep you entertained the whole time. I loved it, even with the small amount of stereotypical action storyline they had at the end. Would def recommend and watch again. Trust me! Plz see it!"
  },
  {
    "rating": "3/5",
    "review": "Entertaining, but mostly nonsense"
  },
  {
    "rating": "4/5",
    "review": "Action with comedy, no dull moment, enjoyed it."
  },
  {
    "rating": "3.5/5",
    "review": "lots of actions, but insuficient reasoning."
  },
  {
    "rating": "3/5",
    "review": "Decent action movie with some funny parts"
  },
  {
    "rating": "5/5",
    "review": "It was amusing and entertaining"
  },
  {
    "rating": "4/5",
    "review": "Lots of action. Good humor. Big body count. worth seeing. Not to mention a Minnesota actor is always a bonus"
  },
  {
    "rating": "1.5/5",
    "review": "Lots of blood and guts. Action I liked but overall not much of a plot. Not realistic."
  },
  {
    "rating": "5/5",
    "review": "Its good movie and funny"
  },
  {
    "rating": "4.5/5",
    "review": "Fast paced humorous graphic novel like movie."
  },
  {
    "rating": "5/5",
    "review": "Really good action packed movie you’ll enjoy it!"
  },
  {
    "rating": "3.5/5",
    "review": "I like the action packed assasin/merc movies, so this was right up my alley. The ending was ok."
  },
  {
    "rating": "4/5",
    "review": "Had some kinda cheesy parts but overall good fight scenes, humor, and glad to see Josh Hartnett making movies again."
  },
  {
    "rating": "4/5",
    "review": "A lot of action and plenty of fun throughout. I thought Josh Harnett was fantastic along with the rest of the cast."
  },
  {
    "rating": "2/5",
    "review": "Had some good moments, had a lot of corny moments"
  },
  {
    "rating": "0.5/5",
    "review": "Horrible! Full of violence. At times confusing. I ended up leaving before movie ended. Don't waste your money."
  },
  {
    "rating": "5/5",
    "review": "Great blend of humor and action"
  },
  {
    "rating": "5/5",
    "review": "This movie was a lot of fun! Glad to see Josh Hartnett getting roles again! He's fantastic!"
  },
  {
    "rating": "5/5",
    "review": "I didnt expect to like it!!! I was pleasantly surprised, from beginning to end. Its extremely violent, but its the bad guys that get killed."
  },
  {
    "rating": "0.5/5",
    "review": "So bad. Like really bad. Kinda like naked gun. But worse"
  },
  {
    "rating": "3.5/5",
    "review": "With the typical example of moviegoers these days, the best example of this movie is compared to Bullet Train with Brad Pitt and all the gore / cartoonish violence that comes with these movies. The setting is a plane and just like Bullet Train there is no logical plot sense but if you like a rock them and sock them type of movie… Go Enjoy It"
  },
  {
    "rating": "5/5",
    "review": "Awesome film. If you liked Bullet Train, this one is for you."
  },
  {
    "rating": "2/5",
    "review": "The movie went pretty fast the fighting was a little over rated. It was a okay movie just to watch. Not a repeat type of movie."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie! Remained engaged throughout the entire movie !"
  },
  {
    "rating": "4/5",
    "review": "This movie is a blast!! If you enjoy action/comedies such as \"Bullet Train\" then you'll love this!!"
  },
  {
    "rating": "4/5",
    "review": "Super entertaining and fun campy gore! Better than I expected!"
  },
  {
    "rating": "4.5/5",
    "review": "Finally a movie I like Hartnett in. For the genre of Funny and action/fight scene movie it's great. Try not to read a synopsis as it may give away the first twist too soon. Second!"
  },
  {
    "rating": "5/5",
    "review": "It was a wild ride from beginning to end! A good bit of bloody scenes but hilarious and witty overall."
  },
  {
    "rating": "1/5",
    "review": "What drugs is Josh Hartnett actually on? This movie is a mess. He looked strung out throughout, which I suppose works, but there was something off about him in general. Script is all over the place, fighting is insanely over the top. I was so disinterested, I fell asleep. This has all been done, and done better overall. Watch \"Redeye\", for example: better actors, script, action."
  },
  {
    "rating": "4/5",
    "review": "Such a fun movie, its like bullet train but on a plane! Hilarious moments and overall such a good movie"
  },
  {
    "rating": "4/5",
    "review": "Crazy action with plenty of interesting kills and no shortage of broken bones and blood An entertaining time at the movies and perfect for the summer movie season"
  },
  {
    "rating": "4/5",
    "review": "Action-packed from beginning to end and very funny!"
  },
  {
    "rating": "5/5",
    "review": "The cast had a wonderful time with this story. In the same vein as Brad Pitt's 2022 \"Bullet Train\", the action doesn't stop until the airplane does. Charithra Chandran generates fabulous chemistry with Josh Hartnett. Terrific fun!"
  },
  {
    "rating": "2/5",
    "review": "Absurd plot. Made no sense whatsoever. Way too much violence."
  },
  {
    "rating": "4.5/5",
    "review": "Fun, chaotic, and a little heartwarming too. Went in with low expectations, left cracking up and wanting to do a rewatch."
  },
  {
    "rating": "5/5",
    "review": "Fun action movie, made for a big screen. Easy to follow, exciting to watch, full of surprises. Great acting by the two main leads. Love seeing Hartnett back on the big screen."
  },
  {
    "rating": "3/5",
    "review": "Didn’t know what was happening until the ending of the movie."
  },
  {
    "rating": "1.5/5",
    "review": "This was terrible. When you see 100 studios at the start making a movie you know it’s going to be trash."
  },
  {
    "rating": "3/5",
    "review": "So previously we saw Josh Hartnett is Trap (2024) and honestly originally I loved that film, since then we know M. Night Shyamalans next film is NOT a Trap 2 or a Trap sequel (unfortunately), we have been transformed into a Josh Hartnett action film. Honestly Fight or Flight isn't bad, it's filled with plenty of fake (and ugly) CGI blood, most of the jokes don't land well (for me) but the most silly ones (not meant to be funny) do. Josh Hartnett is absolutely hilarious in this film and the whole film is honestly so silly and I'm all here for it. The kills and overall action if pretty great considering the film constantly keeps you on your feet reminding you this is a action film. The film feels very similar to Killers Game (2024) that being the bounty and cool kills/comedy plot, but unfortunately for this film the plot is absolutely awful, but like I mentioned it's revived by it's just silly and mental action sequences. That ending is absolutely ridiculous and the last 10 minutes is just revolting."
  },
  {
    "rating": "4/5",
    "review": "good movie, and great plot. gci was not good but apart from that, very interesting"
  },
  {
    "rating": "3/5",
    "review": "action packed, gory and funny at the same time. definitely rewatching it"
  },
  {
    "rating": "3/5",
    "review": "The movie has a lot of good action scenes and comedic moments"
  },
  {
    "rating": "5/5",
    "review": "An absolute roller coaster of a ride. The kill scenes were very unique and the reactions from the main characters were priceless. This is what happens when a director has a vision and an idea and runs with it. Josh Hartnett is absolutely comical on this flight."
  },
  {
    "rating": "5/5",
    "review": "Movie was entertaining and filled with hilarious scenario's. Would definitely recommend to those that are into action comedies."
  },
  {
    "rating": "4.5/5",
    "review": "Fight or Flight is so much fun! If you're a fan of action movies, don't miss this one. The ending sets up a sequel and I can't wait."
  },
  {
    "rating": "5/5",
    "review": "Went in totally blind and I gotta let you know, what a fantastic friggin movie. we had no idea what we were letting ourselves in for, but couldn't have asked for a better movie. Violent as hell, but funny as hell too. To be honest, it's like a funner version of Bullet Train. Go watch this movie. You will NOT regret it."
  },
  {
    "rating": "1/5",
    "review": "This was probably the worst movie that Ive seen in years! Gordy, bloody and gruesome. And unbelievable."
  },
  {
    "rating": "2.5/5",
    "review": "Didn’t like all of the violence, but kind of liked some of the characters and the story. Sounds like there may be a sequel."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie, action packed and comedic at times"
  },
  {
    "rating": "2.5/5",
    "review": "It was ok, I thought it would be better. I got kind of bore with the guy in the lead just killing people. I didn't really like the ending, could've been better. Too much blood & violence for me. I like action movies but it was just too much killing. Wish it had more plot than that. I usually like Josh Hart but not this movie much."
  },
  {
    "rating": "5/5",
    "review": "This was a fun movie, I just wish they had advertised a little more and had it in more theaters near me. Felt kinda like Bullet Train But with more over the top action and gore."
  },
  {
    "rating": "5/5",
    "review": "An absolute wild ride from start to finish."
  },
  {
    "rating": "5/5",
    "review": "AWESOME! Action packed! I want to see it again! Fight or Flight 2?? 💯🔥"
  },
  {
    "rating": "3/5",
    "review": "This film wasn't terrible, but it was a bit over the top. It had its funny moments and touching moments."
  },
  {
    "rating": "2/5",
    "review": "Its not very good but it is highly entertaining in a ridiculous sort of way."
  },
  {
    "rating": "5/5",
    "review": "Entertaining action movie summer flick! ( bloody but still entertaining)…let see what happens for part 2!"
  },
  {
    "rating": "5/5",
    "review": "awesome movie. better than expected"
  },
  {
    "rating": "3/5",
    "review": "This was a wild ride of a movie. I did enjoy it I will say if u liked bullettrain with Brad pit u will like this. It is a its in that style of movie except takes place on a plane."
  },
  {
    "rating": "3/5",
    "review": "Blood guts and gore with the usual ok jokes."
  },
  {
    "rating": "4/5",
    "review": "Movie was a good time and had a unique premise. Josh H. is great as usual."
  },
  {
    "rating": "4.5/5",
    "review": "Action throughout balance of wit and serious moments good storyline. Kept my interest entirely. Waiting for 'Fight or Flight 2'. Enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "This is a good action movie."
  },
  {
    "rating": "5/5",
    "review": "I thought it was great left a smile on my face. Not to serious a little bit of a surprise. Airplane meets Deadpool"
  },
  {
    "rating": "2.5/5",
    "review": "Not enough of a story, too much gore and violence."
  },
  {
    "rating": "4/5",
    "review": "Loved this movie..Lots of action and some comedy made this a very fun movie"
  },
  {
    "rating": "4.5/5",
    "review": "Totally fun and entertaining!!"
  },
  {
    "rating": "5/5",
    "review": "I’m going to watch this again. Love d it! Action!"
  },
  {
    "rating": "3/5",
    "review": "it was a fun movie but sometimes tried to ber too dramatic."
  },
  {
    "rating": "5/5",
    "review": "Better than expected, good story great action."
  },
  {
    "rating": "3/5",
    "review": "A spiritual successor to 2022s Bullet Train, without quite the same star power, #FightorFlight is an admirable entry into the over-the-top, zany, campy, dumb action genre. What you see is what you get, but Hartnett is surprisingly strong action lead and is clearly having a blast."
  },
  {
    "rating": "4/5",
    "review": "Loved it - I mean, it's not a classic, can't give it 5 stars, but for what it is, it's awesome. Great spoof of action movies, just gets more and more over the top. Amazing way to spend an evening!"
  },
  {
    "rating": "2/5",
    "review": "No plot....just gore"
  },
  {
    "rating": "5/5",
    "review": "Excellent for who likes fighting and action thrilled movie with blood and ghoul ."
  },
  {
    "rating": "4.5/5",
    "review": "It’s like bullet train on a plane . It was a very fun movie !!"
  },
  {
    "rating": "1/5",
    "review": "Worse movie I have ever seen!"
  },
  {
    "rating": "5/5",
    "review": "Very entertaining movie."
  },
  {
    "rating": "2.5/5",
    "review": "The acting was solid, and the fight choreography was good, but there were technical glitches throughout (idk if it was the projector, the file drive or just how it was filmed) that made white pixels appear on screen every few minutes or so, the comedy fell flat and the \"big reveal\" made no sense"
  },
  {
    "rating": "4/5",
    "review": "It was an exhilarating high-octane action thrill ride, the perfect kind of film to get you warmed up for Summer."
  },
  {
    "rating": "4/5",
    "review": "The movie has a slow start but once it starts, it starts. Absolutely fantastic choreography and each action scene is better than the last. I'd argue that whoever planned the fight scenes attempted to show the main character warming up through the course of the film as he'd been in retirement for years by the beginning of the movie. As far as the story goes, the dialogue and world is your standard modern 2020s cliche stuff. It's somewhere in-between Beekeeper and Bullet Train, but I will say it doesn't lay on the social pandering too heavy and the movie doesn't take itself too seriously. All in all, fantastic movie."
  },
  {
    "rating": "3/5",
    "review": "Fun movie but story is not new"
  },
  {
    "rating": "5/5",
    "review": "Great fun! Think bullet train meets snakes on a plane."
  },
  {
    "rating": "3/5",
    "review": "Great to see Josh Hartnett back, and he's looking good. While the various fight scenes are fun and creative, it is all built on the back of a silly - very, very silly - premise. Clearly, they are looking to start a franchise. Meh!"
  },
  {
    "rating": "2/5",
    "review": "could have been a decent action movie until it quickly turned into a D-grade comic book. I only gave it two stars because of Josh"
  },
  {
    "rating": "5/5",
    "review": "Some movies are worth buying on 4k UHD when they come out and this is one of those movies"
  },
  {
    "rating": "5/5",
    "review": "So few movies now days are worth paying movie ticket costs. This movie is definitely an exception. I am not an action movie fan but somehow this movie filled with action doesn't seem to fit the same bill. It is funny but not laugh track forced constant funny. You find yourself smiling while people are throwing chainsaws and hooks. I looked to see if other people were smiling at those moments because I kind of felt like maybe it's wrong I'm smiling so much and everyone in my row had the same smile. I hope they make another one. Go see it!"
  },
  {
    "rating": "4/5",
    "review": "I loved the fast steady pace of excitement. It was funny and gory . I enjoyed every minute! Well done!"
  },
  {
    "rating": "3/5",
    "review": "Kinda predictable but entertaining"
  },
  {
    "rating": "4/5",
    "review": "Josh has proven he's got the goods yhe last few years and he more than capably leads this movie. There's some comedy moments early on that fall flat, but once the movie settles in it is a clever and well staged. A worthy vehicle for a star who has finally found his groove."
  },
  {
    "rating": "5/5",
    "review": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Gleefully and absurdly violent. Very fun movie that knows what it is and gets to the point fast. Happy to see Josh Hartnett so much fun."
  },
  {
    "rating": "4/5",
    "review": "Great action and suspense. Lots of twists to keep it interesting."
  },
  {
    "rating": "4.5/5",
    "review": "The movie was excellent"
  },
  {
    "rating": "5/5",
    "review": "Nonstop action. I know this is another action plane movie, but I found this one had different twists. Lots of blood and gore."
  },
  {
    "rating": "5/5",
    "review": "This was a good movie, I like that it had a little comedy mixed in with the fast-paced action"
  },
  {
    "rating": "3/5",
    "review": "“Fight or Flight” offers enough absurdity and mayhem to provide an enjoyably blood-filled flight despite its shortcomings weighing the experience down. This is the type of movie that aims to delight audiences with an undemanding yet enjoyable roller coaster of violent carnage and merciless chaos instead of being the next “John Wick”. Regarding its humdrum plot and runtime, this strategy may not be the perfect in-flight movie for everybody, including me. However, with the right mindset, it’s best seen as a watchable mid-afternoon streaming movie that benefits from Hartnett’s performance as the crazed, unconventional protagonist, the claustrophobic action scenes, and amusing humor. If a film that embraces its flawed and violently silly concept is what you seek, then “Fight or Flight” may be the trip worth taking. Everyone else may be better off riding a different plane to their destination."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Very fun watch."
  },
  {
    "rating": "4.5/5",
    "review": "Fast, Fun, and Gore!! Josh Hartnett played a very humble and very likable character. Definitely go see."
  },
  {
    "rating": "0.5/5",
    "review": "what idiots think shaky camera shots are good. not to mention the out of focus shots---they blurred the pretty girl to show the bloody guy--what!"
  },
  {
    "rating": "3.5/5",
    "review": "Abrupt ending but hey I dig it"
  },
  {
    "rating": "3.5/5",
    "review": "Kung fu + bar fights = creative chaos."
  },
  {
    "rating": "4/5",
    "review": "Great movie. Very entertaining. Think Bullet Train in the air. Josh Harnett was funny and engaging. Non-stop action."
  },
  {
    "rating": "3/5",
    "review": "Mindless, bloody action film with some humor and drama thrown in. It was fun to see Josh Hartnett in this role. Katee Sackhoff was perfectly cast as his boss. If you enjoyed the film Snowpiercer or Bullet Train or the 2023 Indian film Kill, then you may enjoy this movie. It is closer to Bullet Train in its tone."
  },
  {
    "rating": "4/5",
    "review": "Nicely done. Fight scenes were really good, better then the Bourne series because the cameras were stable, not shaking all over like Bournes. Weird how Josh Hartnet can leave Hollywood for 12 years and comes back better than ever."
  },
  {
    "rating": "5/5",
    "review": "Crazy rollercoaster experience"
  },
  {
    "rating": "4.5/5",
    "review": "Excellent action packed movie with some funny elements. Lot of blood & guts. Good storyline. Some far fetched moments but fun pic overall. Wasn't expecting it to be so good. Highly recommend."
  },
  {
    "rating": "1/5",
    "review": "Poor man's Brad Pitt directed by the poor man Madigan. Lets all say a little prayer for this guy. Way to get on that Assassins in a close space train... lol weak ass copy cats."
  },
  {
    "rating": "5/5",
    "review": "Great Action Flick I Enjoyed It Hopefully They Make A Part Two"
  },
  {
    "rating": "2/5",
    "review": "Action sciences were a little cheesy. Acting was also forced at times."
  },
  {
    "rating": "3.5/5",
    "review": "Decent film , worth a watch 🤷🏾‍♂️"
  },
  {
    "rating": "2.5/5",
    "review": "I like the plot, but it would've been better if it was more dramatic and not over the top. I guess it's going for a more humor type theme, but it wasn't that funny. Acting wasn't terrible, and the only character that stood out acting wise was the Latin guy that died in the bathroom. He was really good"
  },
  {
    "rating": "5/5",
    "review": "Very entertaining movie. Great to see Josh Hartnett. Really fun night at the movies."
  },
  {
    "rating": "5/5",
    "review": "The whole time I watched this, I wondered if the black eye was real because he did all his own stunts. Lots of action. Lots of perfectly timed comedy. \"The Ghost is a 16 yr old girl.\" Lol. <=== When you see it you'll laugh as much as the theater did. Sooo good."
  },
  {
    "rating": "3/5",
    "review": "It was an over the top action packed movie with background music forced to the foreground of every battle that took away from the reality of the moment. A b movie that took itself less seriously similar to a cartoon Very similar to bullet train"
  },
  {
    "rating": "5/5",
    "review": "It was the non-stop action for me."
  },
  {
    "rating": "5/5",
    "review": "Pretty funny and highly recommend."
  },
  {
    "rating": "4/5",
    "review": "If you like non-stop action, not too serious, funny movies you'll enjoy this. It's a fun fast paced movie."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie, with lots of violence but it was \"light-hearted violence\", if there is such a thing - not comedic violence. It does not require a lot of thinking to watch. You root for the protagonist. The movie left off at a good point for a sequel."
  },
  {
    "rating": "1.5/5",
    "review": "It was funny gorey!!!"
  },
  {
    "rating": "3.5/5",
    "review": "Movie started out with an interesting plot developing and was Enjoyable until it got a little too Much! If you like Action and Fighting this is your Movie!"
  },
  {
    "rating": "3.5/5",
    "review": "Lots of combat here and succeeds in doing it in original ways. Although Monty Python did the best lopping off of limbs and without benefit of a chainsaw as was used here. The use of , er, chemical weapons add a fun twist in the action. Hartnett is charming and Chandran aint bad either."
  },
  {
    "rating": "3.5/5",
    "review": "A highly entertaining movie. Doesn't overstay its welcome and gets to the base of the store with a few twists and turns along the way. Well worth your time to see this in the theater. Josh Hartnett, nailed the roll of an elite assassin and we’re all the better for it."
  },
  {
    "rating": "5/5",
    "review": "It was a good movie from start to finish Josh Harnnet played a good tough guy, action hero, super spy, rough and tough John Wick if your just looking for some entertainment and some bloody shocking moments check this one out."
  },
  {
    "rating": "3.5/5",
    "review": "Great time at the movies. Funny, highly entertaining action comedy"
  },
  {
    "rating": "5/5",
    "review": "The absolute most fun I've had in quite a while ! Action, humor, personality, all done with style and personal connection ! Much like Bullet Train, on a plane but with better performance and story. I'll definitely see it several more times. So tired of the Marvel re-try, horror and cartoon genre,"
  },
  {
    "rating": "4/5",
    "review": "worth watching! fun and action packed movie. good plot and acting."
  },
  {
    "rating": "5/5",
    "review": "Great movie, great action, John wick style but with more gore with just the right amount of humor. A must see for any John wick fans/action films."
  },
  {
    "rating": "3.5/5",
    "review": "Action packed, good'ol fun and decently paced. Fight scenes are well choreographed and the camera angles captured everything very well. The one-liners and comedic points are very hit or miss. Two out of Five times it got a chuckle out of me. I didn't feel a deep conection between the main characters though they did try and pretend one was there- overall the fights were well paced but the guts of the movie weren't. Still incredibly fun!"
  },
  {
    "rating": "4.5/5",
    "review": "Too violent, bloody, for many people, but okay for me. The humor is great, reminds me of some Ryan Reynolds movies."
  },
  {
    "rating": "4/5",
    "review": "Action packed. If the movies Non-Stop and Bullet Train had a baby."
  },
  {
    "rating": "4/5",
    "review": "Funny and action packed"
  },
  {
    "rating": "3.5/5",
    "review": "Action packed movie. Little gory here and there, but that’s the style of the movie so expect it!!"
  },
  {
    "rating": "5/5",
    "review": "Great fun movie. Hope it does well and there is a sequel or franchise."
  },
  {
    "rating": "1.5/5",
    "review": "It tried making up for the most abysmal starting 30min. Every scene withe blonde, I longed to be deaf. Main guy wasn't bad, and I quite liked the Indian girl. Action was the highlight but the writing and the comedy is what you'd expect from a movie with a cliche title like this."
  },
  {
    "rating": "3/5",
    "review": "If you just go watch with out expectation you're going to have fun."
  },
  {
    "rating": "4/5",
    "review": "Good alternative to Bullet Train. A bit more cheesy but still entertaining."
  },
  {
    "rating": "5/5",
    "review": "All I can say is I enjoyed it from beginning to the end. It had all the action and the unexpected was the female. She was able to hold her ground when it came to fighting."
  },
  {
    "rating": "4/5",
    "review": "It was funny and a good story but the violence was a bit too graphic for me"
  },
  {
    "rating": "5/5",
    "review": "Excellent Thrill Ride"
  },
  {
    "rating": "3/5",
    "review": "Decent action flick that doesn't take itself too seriously. Probably wouldn't watch again but it wasn't bad."
  },
  {
    "rating": "5/5",
    "review": "Suspenseful with alittle comedy. Had plot twist."
  },
  {
    "rating": "5/5",
    "review": "A bar-fight in the sky, charming characters accompanying high octane action that manages to stand out in an era of film oversaturated with big brawl action."
  },
  {
    "rating": "5/5",
    "review": "Great movie with Josh Hartnett bringing it to the next level. Good action and it's done with fun in mind."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed this action packed adventure with twists and turns all the way to the end!"
  },
  {
    "rating": "4.5/5",
    "review": "Non stop action! Very entertaining way to spend a rainy afternoon!"
  },
  {
    "rating": "2.5/5",
    "review": "It was OK story line is not that exciting."
  },
  {
    "rating": "3/5",
    "review": "Husband loved \"Fight or Flight\", while wife not so impressed. Very active movie with curse words as dialogue..zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzneeded husband loved \"Fight or Flight\" while wife was not impressed. Very active with many curse words."
  },
  {
    "rating": "3/5",
    "review": "Not bad could’ve been better"
  },
  {
    "rating": "1/5",
    "review": "Horrible worthless movie. A sequel? Really?"
  },
  {
    "rating": "5/5",
    "review": "I love the action with funny monents"
  },
  {
    "rating": "4/5",
    "review": "Lots of fun once it got going!!! Hartnett was great! Looking forward to the next one!!!!"
  },
  {
    "rating": "2/5",
    "review": "The movie had a lot of John Wick style action and killing but rather than done in a serious vein it was more a farcical comedic Evil Dead feel. It was like it couldn't decide if it was supposed to be serious or comedic. Weak 2 stars."
  },
  {
    "rating": "5/5",
    "review": "funniest action movie ever !"
  },
  {
    "rating": "5/5",
    "review": "I cant beleove he didn't shoot one person the whole movie. Fun way to use their surroindings. Transported for an hour an a half from the dull world around you."
  },
  {
    "rating": "4/5",
    "review": "Action and hilarious. Great fight scenes. And well written."
  },
  {
    "rating": "5/5",
    "review": "It was a fun ride! Reminds me a lot like Bullet Train starting Brad Pitt. Great action and sporadic comedic moments kept the me wanting more!"
  },
  {
    "rating": "4.5/5",
    "review": "It was funny and action packed. Wow a lot of blood. Someone learned to make fake blood and got carried away."
  },
  {
    "rating": "5/5",
    "review": "Love it. Gratuitous violent adventure!"
  },
  {
    "rating": "2/5",
    "review": "\"Fight or Flight,\" a 2025 action film featuring Josh Hartnett, has some notable missteps that detract from the overall experience. First and foremost, the decision to give Hartnett blonde hair was a questionable choice; it feels like an attempt to make him appear younger, but instead, it just looks out of place. In his previous film, \"Trap,\" he embodied a more mature character, and trying to reinvent him as a youthful hippie was a misguided endeavor. Additionally, his wardrobe throughout the movie was equally puzzling. The action sequences, however, were entertaining, set entirely aboard a plane. This quirky premise, with a mix of assassins and a ghostly presence, led to an all-out brawl that kept things lively. It’s important to note that this film leans heavily into the action-comedy genre, so it’s best not to take it too seriously. While the movie had its fun moments, I found it to be rather simplistic and lacking excitement. It felt as if it borrowed elements from various other films without adding any fresh creativity of its own. Hartnett’s performance was decent, but he often took a backseat to the other fighters, coming off more like a punching bag who, after sustaining significant injuries, somehow manages to bounce back thanks to an adrenaline shot. I have a strong suspicion that \"Fight or Flight\" will struggle at the box office. It lacks the energy and inventiveness needed to make a lasting impression. It ultimately feels flat and predictable, which leads to a viewing experience that is easily forgettable. In fact, after watching several films on the same day, I found it hard to recall this one, even having to look up its title to jog my memory. That’s the kind of impact this movie leaves—it’s likely to fade from viewers' minds soon after the credits roll."
  },
  {
    "rating": "5/5",
    "review": "Was fun pop corn action movie. Non-stop action from beginning to end. Enjoyed it."
  },
  {
    "rating": "1/5",
    "review": "The movie was TERRIBLE! STUPID, SENSELESS, NO REDEEMING VALUE. Josh Hartnet must be really hard up for movie roles to star in this waste-of-time Movie! There were 5 patrons in theater, 2 walked out in first half hour. I walked out after one hour. So glad I did not pay money for the ticket!"
  },
  {
    "rating": "5/5",
    "review": "The movie was absolutely terrific—an exhilarating blend of fast-paced action and sharp, well-timed humor. From start to finish, it kept me fully engaged, delivering thrilling sequences and plenty of laugh-out-loud moments. I walked out of the theater grinning from ear to ear, still chuckling at some of the best lines."
  },
  {
    "rating": "5/5",
    "review": "Loved it ! Lots of action !"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Go watch it !"
  },
  {
    "rating": "4.5/5",
    "review": "Presumptuous to end the film with the expectation of a sequel…but I loved the characters, so hopefully “Fight or Flight” makes some money!"
  },
  {
    "rating": "1.5/5",
    "review": "How many gross ways can you graphically kill someone---everyone--- inside a plane with almost no story? Too many obvious Easter eggs. Set up for a sequel..I'll pass"
  },
  {
    "rating": "3.5/5",
    "review": "It was a bit too bloody toward the end for me. The action was good!"
  },
  {
    "rating": "3/5",
    "review": "It was ok not that exciting to see."
  },
  {
    "rating": "5/5",
    "review": "Great fun, perfect summer action movie."
  },
  {
    "rating": "5/5",
    "review": "This movie is fun from the start! The action never stops and you root for the lead through out!!"
  },
  {
    "rating": "4/5",
    "review": "Is this movie Gone With the Wind? No. But in the vein of John Wik, Sisu and many other movies of the type, it’s just gory action goodness. Don’t overthink it, just sit back and laugh your ass off while watching a gory action movie that takes place at 37,000 feet."
  },
  {
    "rating": "3.5/5",
    "review": "Josh Hartnett is back! I really liked him in this movie and recently in Trap. Lots of stylized fighting and good kills. Plenty of laughs too. It has a slightly convoluted storyline and the acting from some is kind of bad, (Sorry Katee) but overall I think you'll like it."
  },
  {
    "rating": "2/5",
    "review": "Slow moving and confusing, not much intrigue."
  },
  {
    "rating": "1/5",
    "review": "Overly fake fighting. Lots of gore. Weak plot. Strange ending. Didn't enjoy"
  },
  {
    "rating": "0.5/5",
    "review": "Ranged from slow, awkward scenes to fast-paced fake fighting and gore. Stupid, nonsensical ending. Poorly done movie!"
  },
  {
    "rating": "3.5/5",
    "review": "it is a fun action pack movie. If you bullet train, then this is the movie for you"
  },
  {
    "rating": "2.5/5",
    "review": "Josh Harnett was the best thing about the movie, but it was more like a B movie version of Brad Pitts Bullet Train movie without a lot of the humor and character development. I would wait for streaming. Again, Josh Harnett was amazing."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie violent and at times bloody but good characters fun and very believable"
  },
  {
    "rating": "4/5",
    "review": "I really liked it. I mean, I love any movie that Josh is and he was so good in this and funny and I liked it. Yes it was some violence, but I can handle it being a woman because it was not cruel violence to women is what I dont like! I enjoyed it thank you so much. I hope it does well and it seems like there could be a sequel with them continuing!"
  },
  {
    "rating": "4/5",
    "review": "A great action bee movie that punches above its weight class. Good fun."
  },
  {
    "rating": "5/5",
    "review": "Me encantó Superó mis expectativas y prejuicios. Tiene un cast adorable. Está divertida en clave Acción. No creo que amerite un profundo análisis, es una excelente peli para viernes. Viernes de soltar el estrés con algo de violencia coreografíada y unos villanos oldstyle ochentero (entre aterradores y fríos / ridículos hilarantes). Es muy TrenBala, si hubiesen hecho bien TrenBala."
  },
  {
    "rating": "4/5",
    "review": "Good action, too silly for me."
  },
  {
    "rating": "3.5/5",
    "review": "Movie was super fun and entertaining- one of my fave performances from Hartnett"
  },
  {
    "rating": "5/5",
    "review": "Wow what a fun movie! Great action and surprisingly funny! This is why people go to the theaters. Glad to see that hottie, Josh Hartnett, back in action. I definitely recommend seeing in theaters."
  },
  {
    "rating": "4/5",
    "review": "Fun, over the top movie"
  },
  {
    "rating": "3/5",
    "review": "Good , action packed movie.. but a little dumb"
  },
  {
    "rating": "4.5/5",
    "review": "I loved it, and I can't wait to see 'Fight or Flight' again!"
  },
  {
    "rating": "5/5",
    "review": "Josh Hartnett is so funny in this. They did an amazing job with a small budget. Good action, creativity in how it plays out, and the humor all lands. If you enjoy action-comedy with dark humor then you'll like it."
  },
  {
    "rating": "5/5",
    "review": "I didn’t know what this film was going to be like going into it, but what a fun ride! Great action / comedy!"
  },
  {
    "rating": "5/5",
    "review": "Reminiscent of first “Diehard” Hartnett is amazing w the action/comedy genre!! Non-stop action AND a great story line! Hoping for a sequel!!"
  },
  {
    "rating": "4.5/5",
    "review": "I went with a friend on opening night and we both enjoyed the flick. I liked the cast, their performances and the wild editing/visuals (which I thought were a little under-utilized). Overall this was a fun flick and I found myself laughing several times - I'd watch it again."
  },
  {
    "rating": "3.5/5",
    "review": "For a very gory action movie that was mostly predictable, it was entertaining and fun to watch."
  },
  {
    "rating": "4.5/5",
    "review": "Surprisingly funny and entertaining"
  },
  {
    "rating": "4/5",
    "review": "There were enough breaks in the action so you don't feel like it's just a slugfest. Josh Hartnett is fantastic!"
  },
  {
    "rating": "5/5",
    "review": "New Brad Pit Stronger Almost Like a Bollywood Move Non Stop Go and see fantastic ending. GOOD OVER EVIL"
  },
  {
    "rating": "5/5",
    "review": "Wow did not know what to expect but this was an amazing movie! Gory yet funny and totally worth the watch!"
  },
  {
    "rating": "4.5/5",
    "review": "From the trailer I was expecting something silly and over the top. Boy was it ever! Awesome lol!!"
  },
  {
    "rating": "5/5",
    "review": "Very fast paced. Lots of humor and action perfectly balanced. You wont be disappointed."
  },
  {
    "rating": "2/5",
    "review": "Humor was too campy to take the rest of the movie seriously."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie must see!"
  },
  {
    "rating": "4.5/5",
    "review": "Lots of Action and comedy"
  },
  {
    "rating": "4/5",
    "review": "Josh was great in it, the story line of the movie was wonderful, a bit too much fighting going on for my liking it just kept going on and, yes thats what the movie is called but all done on the plane. But other than that it was a great movie, Id recommend it!"
  },
  {
    "rating": "5/5",
    "review": "Had an absolute blast in this. Josh Hartnett goes for it and is having so much fun in this goofy movie. It doesn't take itself too seriously and has several cheer-worthy action moments. Def recommend"
  },
  {
    "rating": "4/5",
    "review": "A campy over the top action movies that knows what it is and embraces it"
  },
  {
    "rating": "1/5",
    "review": "Started out okay, but got more ridiculous as the movie continued. When the movie was over and the lights turned on, I was the only one who stayed for the ending."
  },
  {
    "rating": "2/5",
    "review": "It was funny but way to much violence for me. Half the people in the movie was killed. I liked the premise of the movie but the execution was over done."
  },
  {
    "rating": "5/5",
    "review": "Great action movie with fun kills, a must see!"
  },
  {
    "rating": "5/5",
    "review": "Yo this movie was fun AF! Genuinely wonder if a sequel is in the works?"
  },
  {
    "rating": "5/5",
    "review": "THIIS MOVIE WAS AWESOME!!! Looooooved it"
  },
  {
    "rating": "5/5",
    "review": "So much fun at the theater!! Action was so good and let's. be honest, Josh Hartnett is pretty easy on. the eyes too. Loved!"
  },
  {
    "rating": "4.5/5",
    "review": "Fun filled new age dark comedy with a good ending"
  },
  {
    "rating": "3/5",
    "review": "it wasn't bad. lots of action."
  },
  {
    "rating": "3/5",
    "review": "The movie resembles Kill Bill set on a plane, similar to the Cassidy Airplane Fight Scene from Preacher Season One. Harnett's character follows the typical trope of an agent on one last mission. I'm curious about Rifftax's take on this film. Overall, it felt like a straight-to-DVD release."
  },
  {
    "rating": "0.5/5",
    "review": "That was a horrible movie. Should have never been a comedy."
  },
  {
    "rating": "3/5",
    "review": "A lot of exposition and bad dialogue, but some fun kills."
  },
  {
    "rating": "4/5",
    "review": "Woo! What a ride! JH nails his role. Movie was action packed and full of comedy as well. Go see this in theatres or watch at home!"
  },
  {
    "rating": "4/5",
    "review": "It was definitely a popcorn flick. Lots of action!"
  },
  {
    "rating": "4/5",
    "review": "A Fun, Laugh out Loud, Gory ride !!"
  },
  {
    "rating": "5/5",
    "review": "A fun movie to watch."
  },
  {
    "rating": "4/5",
    "review": "Lots of action. like the ending"
  },
  {
    "rating": "4/5",
    "review": "Nonstop action thrill ride!"
  },
  {
    "rating": "4/5",
    "review": "Very good, with plenty of action sequences. Cliffhanger ending, so likely a sequel is coming!"
  },
  {
    "rating": "1/5",
    "review": "I walked out of the movie because I thought it was so bad."
  },
  {
    "rating": "3.5/5",
    "review": "Some things were totally unreal. Good Movie. A lot of action trough out"
  },
  {
    "rating": "2/5",
    "review": "Really excited for Hartnet’s leading man days, but this was almost a Bullet Train parody? Fun but falls short."
  },
  {
    "rating": "4/5",
    "review": "Lots of action w/ original storeline."
  },
  {
    "rating": "4/5",
    "review": "Lots of action and just enough humor."
  },
  {
    "rating": "4.5/5",
    "review": "Incredibly fun movie"
  },
  {
    "rating": "5/5",
    "review": "This movie was a little different then I expected. I really appreciate the action because it kept me awake. Especially when the agent kept putting out hits on Josh and the little Indian girl"
  },
  {
    "rating": "5/5",
    "review": "This movie had non-stop action! It was gory, but in a fun way. It was funny too. The ending was pretty interesting and left the option for a sequel. I hope they make one!"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie! I will definitely watch again!"
  },
  {
    "rating": "5/5",
    "review": "Great movie was original funny and had a good amount of action loved it"
  },
  {
    "rating": "4/5",
    "review": "Great actors, acting, story and action."
  },
  {
    "rating": "1/5",
    "review": "Just watch Bullet Train, this was very boring. The action scenes were very spread out and short. The story wasn’t very engaging. The only good thing about the movie is Josh Hartnett"
  },
  {
    "rating": "4/5",
    "review": "Once things shift to the plane, it was so much fun! Hartnett was aces. Great stunt work. That chainsaw scene is NUTS 😱🩸✈️"
  },
  {
    "rating": "4/5",
    "review": "It was good.action packed and lots of blood splattered everywhere."
  },
  {
    "rating": "5/5",
    "review": "Can't wait for the second one!! I hope he brings his ex dowwwwnnnn!!!"
  },
  {
    "rating": "4/5",
    "review": "Lots of action. Definitely blood. Kept my attention. It's a movie, just enjoy the break from reality."
  },
  {
    "rating": "5/5",
    "review": "LOVED THIS! Over the top mayhem, humor, suspense, ingenuity....and Josh Hartnett is hot. (So is the female lead, in a kick-ass kinda way.). Lots of fun if you want completely implausible action and humor, and the ending implies a sequel."
  },
  {
    "rating": "5/5",
    "review": "It was entertaining and fast paced with sprinkles of hallucinogenics"
  },
  {
    "rating": "4.5/5",
    "review": "Over the top fun. Going to think twice the next time I get on a plane. :)"
  },
  {
    "rating": "5/5",
    "review": "Pretty much action packed lots of blood very entertaining movie"
  },
  {
    "rating": "4.5/5",
    "review": "This movie was awesome! Tons of action. Very funny!"
  },
  {
    "rating": "5/5",
    "review": "Josh Hartnett was fantastic! Good combination of over-the-top action and humor."
  },
  {
    "rating": "2.5/5",
    "review": "i am usually a flight guy when it comes to a fight or flight scenario, but i wasn’t about the flee the theater after ubering there and buying myself nuggets… but i did have to fight at times through some pretty eyeroll worthy dialogue and stiff performances in order to stay in my seat. whenever Hartnett was going full tilt though, it was a entertaining ride… it’s just the space in between those moments really test you."
  },
  {
    "rating": "4/5",
    "review": "A mercenary takes on the job of tracking down a target on a plane but must protect her when they're surrounded by people trying to kill both of them. Pros: Hartnett and Chandran were great in the leads ad had good chemistry together. Fun action scenes with good use of the single location. Insanely violent, gory, and a blast of a third act. Cons: Wish we got more of Marko Zaror. Fairly generic plot."
  },
  {
    "rating": "3/5",
    "review": "Its a bit far fetched and quite absurd, but it was entertaining nonetheless. Acting was so so. Story line what story line? It was there, but not well written or thought out in my opinion. Action packed and lots of blood. If thats your thing, youll like it!"
  },
  {
    "rating": "4/5",
    "review": "I especially liked the trippy effects when he dosed himself with toad venom. The characters were well drawn, but the plot was way too simplistic"
  },
  {
    "rating": "1/5",
    "review": "This want to be action movie, Falls far short! All of the Gory would be funny fight scenes. We're just as bad!"
  },
  {
    "rating": "2/5",
    "review": "Story plot and violence. Was just a lot of fighting l don’t go to this movie if your don’t like watching 70% of the film is about fighting."
  },
  {
    "rating": "5/5",
    "review": "PHENOMENAL!!! Pleasantly surprised with the ending, absolute must-see!"
  },
  {
    "rating": "4.5/5",
    "review": "This is a very entertaining and fun movie to watch. If you know what the premise is and go into it to enjoy some gory kills and laughs, you will not be disappointed. My wife and I really enjoyed this thrill ride."
  },
  {
    "rating": "5/5",
    "review": "Great movie! Very entertaining. Basically John Wick on a plane."
  },
  {
    "rating": "5/5",
    "review": "A very fun movie with lots of action, humor and even gory scenes. Josh Hartnett was excellent in this one."
  },
  {
    "rating": "4/5",
    "review": "It was very good. Funny, gory sometimes quite violent but would like to see it again"
  },
  {
    "rating": "2/5",
    "review": "Movie was action packed and full of some laughs but overall the story was predictable. Josh Hartnett held this movie together and the other actresses or actors were just not important. Reminds me of bullet train with Brad Pitt. Nothing special unless you like random acts of violence"
  },
  {
    "rating": "4/5",
    "review": "Nice action fun movie"
  },
  {
    "rating": "4/5",
    "review": "Very good movie, tons of action mixed with a little comedy as well."
  },
  {
    "rating": "5/5",
    "review": "So wild! Lots of fun!"
  },
  {
    "rating": "5/5",
    "review": "I love scary movies, action, fantasy-type, and/or deeply disturbed slasher stories😳 it’s just a thing of mine💁🏻‍♀️ I went to see the new Josh Hartnett Fight or Flight movie and it was SO GOOD. It was over-the-top slaughter, like a Tarantino movie, but had a plot I could get into and similar dark humor that I felt Josh Hartnett nailed. Where has he been? This was such a surprise from him—he was funny, emotional, strong, believable, it just all came together for me. Im actually surprised I felt compelled to share how much i loved it, but go see it and laugh!"
  },
  {
    "rating": "5/5",
    "review": "Movie was fun, hilarious and non stop action"
  },
  {
    "rating": "5/5",
    "review": "Such a fun ride. Great action scenes and Josh was really funny."
  },
  {
    "rating": "5/5",
    "review": "Hilarious! Cant believe Josh did his own stunts. What a stud!!!"
  },
  {
    "rating": "5/5",
    "review": "This movie is a wild ride from start to finish, so much fun. The chainsaw....THE CHAINSAW!"
  },
  {
    "rating": "3.5/5",
    "review": "Hartnett and Chandran do a great job as action stars, mixing the suspense with comedy. It's fast paced, the fight scenes are well choreographed, and it was definitely a fun night out at the movies."
  },
  {
    "rating": "5/5",
    "review": "it is a very good movie it's your typical insane off the wall type of action film"
  },
  {
    "rating": "5/5",
    "review": "A lot of action! And it was funny"
  },
  {
    "rating": "1/5",
    "review": "One of the top 10 worst movies I ever seen. Wow! I could have made a better movie. Waste of time. Horrible!"
  },
  {
    "rating": "4.5/5",
    "review": "Wow - what a fun ride!! Josh Hartnett is the action figure you never knew you needed - this was an action-packed, laugh out loud thrill of a movie…"
  },
  {
    "rating": "2/5",
    "review": "Welp the Mystery Movie was: Fight Of Flight and it was not good. LOL It was legit Bullet Train on a plane. They should have just called it Bullet Train two. Like they did with Speed on the boat instead of bus. Plot was dumb, reveals were dumb. Cast was decent. Action was ok. Humor was ok. The so=called twists and turns were not that great. It was just kind of a big mess, and we have seen it pretty much all before. There were some cool kills, esp one. Which was a highlight. Damn, Josh Hartnett chose tho leave Hollywood, and he has been coming back to star in some stinkers. First Trap now this. He better start picking better parts before Hollywood asks him to leave this time. Not the other way around. Wait for streaming. Do not waste your hard-earned money. No likes yet Comment?"
  },
  {
    "rating": "3/5",
    "review": "One of the more ridiculous movies I’ve ever seen, but it knows it’s ridiculous and leans into it. Josh Hartnett bumps it up a star. Definitely not needed to be seeing in theaters. Lots of fun kills, but pretty dreadful acting and storyline."
  },
  {
    "rating": "3/5",
    "review": "Fighting choreography 8.5/10. Gore 8/10. Plot 3/10. Dialogue 2.5/10. Comic relief 6/10. Character depth 2/10. Thrill 2/10. Antagonist 1/10"
  },
  {
    "rating": "2.5/5",
    "review": "Josh Hartnett’s charismatic assassin makes it easier to overlook the movie’s flaws, but even the fun fight scenes and funny moments don’t make up for such a predictable story."
  },
  {
    "rating": "3/5",
    "review": "It's big on action but light on plot. A fun movie if you don't take it too seriously and are ok with graphic fight scenes. It reminds me of The Kingsmen but a little bloodier and sillier."
  },
  {
    "rating": "2/5",
    "review": "Scattered brain and frenetic. Ultra violent at times. As bad as Netflix original streaming."
  },
  {
    "rating": "5/5",
    "review": "It’s a good action movie with comedic surprises in there. Glad to see Josh Hartnett making a comeback"
  },
  {
    "rating": "5/5",
    "review": "Waaaaa... Watched this without even knowing much about it. BLEW ME AWAY!!! Honestly, it was just TOO MUCH FUN. Proper nostalgic vibes—took me straight back to the 90s when I used to munch on prawn crackers and watch wire-fu films after school. You know, those mad, blood gore sword fights? It's that sort of over-the-top, but it absolutely works. Josh Hartnett? Bruv, he’s ridiculously watchable, just nails the role like he was born for it. And then—get this—Marko Zaror shows up, and then Juju Chan as well?!! Mate, if you're into action films with real martial artists pulling off incredible fight sequences, this is next-level stuff. It’s like they added a sprinkle of authenticity just for the action nerds like me. The fight scenes? Absolutely sick. No exaggeration—it’s all flipping epic."
  },
  {
    "rating": "5/5",
    "review": "This film is sooo good. It’s a shot in the arm pure adrenaline from start to finish. The cast are amazing and I hope to see a sequel. It’s got potential with the dynamic duo Josh & Charithra. Bravo to the film crew and cast."
  },
  {
    "rating": "5/5",
    "review": "First 10 minutes i thought \"this is not my cup of tea\"... But I must say, i am glad i stuck with it. Good action, a lot of laughs and giggles thrown in, Hartnett gives a good performance. You'll enjoy it!"
  },
  {
    "rating": "4.5/5",
    "review": "A solid non Wokie non wokie film . Its a bit better than the joker they dint burst ous in song HAHAHAHAAHAH. the fight seens were brilliant"
  },
  {
    "rating": "3/5",
    "review": "Bullet Train and John Wick on a plane very decent fight scenes and low budget but it works."
  },
  {
    "rating": "3.5/5",
    "review": "Blonde Josh Hartnett covered in blood was everything I didn’t know I needed. A fun action-comedy!"
  },
  {
    "rating": "4/5",
    "review": "It's bullet train on a plane. An absolutely mental movie that's full of OTT violence but it's a brilliant watch."
  },
  {
    "rating": "0.5/5",
    "review": "What a mess.Every inch of this movie a painful mess."
  },
  {
    "rating": "3/5",
    "review": "Good to see Hartnett back, even if its a little silly. Not sure where his ex-girlfriend agent's serious, suck in face came into play - but otherwise was a fun plane romp."
  },
  {
    "rating": "3.5/5",
    "review": "Wow just an adrenaline fuelled fun ride. Definitely has similarities to bullet train, just with a lot more gory violence. I do like Josh Hartnett and this was a different type of role than I've seen him play before. Crazy story, crazy action and just a little bit of a crazy movie."
  },
  {
    "rating": "1/5",
    "review": "The dialog is so bad it is painful to watch. I literally skipped forward past them. The action scenes are B-movie regular crap, but watchable. I think this movie destroyed some careers."
  },
  {
    "rating": "5/5",
    "review": "Was really surprised with this one! John Wick on a plane with great performance from Josh Hartnett. Great fun and full of action."
  },
  {
    "rating": "3/5",
    "review": "This flight goes nonstop to hell. Fight or Flight is a 2025 action film directed by James Madigan ✈️ After an interesting, funny, and enjoyable first half, this all starts to take things a bit too far and gets silly… Not bad, but not my favourite either 😉 It’s ok, but I feel mixed about this one 😉 I’d recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼 A mercenary takes on the job of tracking down a target on a plane but must protect her when they're surrounded by people trying to kill both of them."
  },
  {
    "rating": "4.5/5",
    "review": "Not too bad for a B rated movie. Definitely watchable. Like others have said it's like Snakes On A Plane meets John Wick meets Bullet Train. Has a TON of moments that make you go OOOOOOOOHHHH that hurt. Love how they end it assuming there will be a sequel. Can't wait for part 2!"
  },
  {
    "rating": "3.5/5",
    "review": "'Fight or Flight' is an entertaining B-movie that delivers a ridiculously bloody fun ride that action fans will surely relish."
  },
  {
    "rating": "5/5",
    "review": "Bullet train meets john wick on a plane. Just a fun movie."
  },
  {
    "rating": "5/5",
    "review": "A-movie in B-movie clothing. The debutant in The Ghost has amazing emotional and comic timing, Josh is like a Keanu with a comic streak, an unexpected gem of a movie!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely fantastic. Think Bullet-Train but in the sky. 10/10"
  },
  {
    "rating": "4.5/5",
    "review": "The movie is 9.8 out of 10.. The story was just short, very entertaining and not afraid to hype the mood. I would like more of these kinda movies"
  },
  {
    "rating": "4/5",
    "review": "Super entertaining, Josh Hartnett delivers, it's good to see him back in movies. Premise is simple, fun and not much else is needed, good movie"
  },
  {
    "rating": "4.5/5",
    "review": "Effing great stuff! Action editing is terrific. Story is good platform for this splatter comedy. Yu gotta love it. (if you are into this genre). Message to \"audience member\"... Instead of calling you an idiot or a moron, rather allow that anyone can give any opinion on this platform. However, misleading ignorant reviews can hurt the validity of the platform, which is not a good thing."
  },
  {
    "rating": "5/5",
    "review": "very good action flick and everybody does well. the josh guy is now a tough guy who could play these roles often. watch this you'll really like it."
  },
  {
    "rating": "0.5/5",
    "review": "So bad.. Hartnett has to pay the bills I suppose because he certainly didn't take this Job for the plot or any good writing. Annoying characters, poor shakecam fighting and 5ft girls whoopin 6ft beefcake assassins over a supercomputer that would tell the world about child forced labour. It's a shame because Hartnett is a good actor imo but not in this."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved it. Josh really brought fun to the role. And it's definately not about the story line, but the ride (or should I say flight) to the end. Not going to spoil it, but had a great time watching the movie."
  },
  {
    "rating": "4/5",
    "review": "It's basically Bullet Train set on a plane, Bullet Plane if you will, but it's shorter, gorier, more over the top and Josh Hartnett is a delight. The scene connected to a toad is one of the funniest things I've seen over the past couple of years."
  },
  {
    "rating": "5/5",
    "review": "John wick of the sky. Epic movie non stop. Josh harnett is great."
  },
  {
    "rating": "4/5",
    "review": "I need to review this as I left one for a shocking film I saw earlier this week. Fight or Flight is over the top, funny, bloody and non-sensical but it's a good watch. I see it as Bullet Train on steroids. Well worth a look!"
  },
  {
    "rating": "4/5",
    "review": "Delightfully different and refreshingly fun. Crazy non-stop action comedy thriller, that just keeps going. Josh Harnett comes back to ours screens in outrageous fashion as a down on his luck ex secret service agent, just looking for a bit of peace and quiet but can’t seem to catch a break. Top notch 👌🏼"
  },
  {
    "rating": "4/5",
    "review": "This is fun, full of fight scenes that have you squealing from the gore one minute to squealing with laughter the next! Great way to spend 90 minutes being entertained!"
  },
  {
    "rating": "3/5",
    "review": "Дешево и сердито, Хартнетт повеселил, конечно это трешак, но гораздо бодрее, чем проходняки с Кейджем или Траволтой💣🔥"
  },
  {
    "rating": "5/5",
    "review": "Josh Hartnett was outstanding. They should make more movies like this. Good thriller action and funny. I have to tell my friends and family about this movie. And I hope they put it on DVD. This movie is awesome. ⭐⭐⭐⭐"
  },
  {
    "rating": "2.5/5",
    "review": "I really enjoy d this it was non stop Action packed and was typical action and fun my I only issue was the ending just not good enough we need a good fast paced actiion with a matching ending it was crap no imagination"
  }
]