[
  {
    "rating": "4/5",
    "review": "Anya taylor was killing it!!"
  },
  {
    "rating": "5/5",
    "review": "This movie is amazing! Only thing on Apple TV I really enjoyed."
  },
  {
    "rating": "3/5",
    "review": "The first half, where the relationship between the two main characters is established, is quite good. The second half, a substandard mix of Aliens and Stranger Things, is quite bad."
  },
  {
    "rating": "2.5/5",
    "review": "Both those actors are amazing... and they DID do a fine job. I just think the issue lies with the story line its self and how it was written and directed. Some pretty ok action scenes but for the most part I was really disapointed with the creatures and how the gorge came about. The ending I thought was really stupid, knew it was going to happen the way it did. Everyone probably did. Very Cliché. I cant even say I'd really recommend it personally but who knows maybe you will love it."
  },
  {
    "rating": "5/5",
    "review": "It's a must watch don't go for the score it's a 10/10 movie worth it it's such an amazing movie woooooh! Loved it #coming_from_an_indian"
  },
  {
    "rating": "2/5",
    "review": "Let's start with the strong parts: the cast is great, the actors carry what is otherwise a pretty average movie that lacks bite in its final act. The visual effects are pretty great as are the vistas surrounding the titular gorge (filmed in Norway). The bad: plot is predictable and not without plot holes large enough to drive a jeep into - e.g. the petrol in any of the ww2 vehicles present in the gorge would long have evaporated by the time the events of the movie take place), jump scares aren't that scary (though YMMV - my skittish other half kept jumping whenever the obviously telegraphed monsters appeared) and, given this is meant to be a horror flic, it lacks bite. !Spoiler alert! The movie telegraphs that a weapon developped during WW2 got released during an earthquake causing humans and animals to mutate into part-plant (sometimes part bug) monstrosities with a 5 day time window being telegraphed for mutation to start showing. Both characters are in the fog causing this mutation, and even remark how they need to quarantine themselves afterwards to make sure they are mutation-free. Somewhat disappointingly, both manage to make it to the end of the story entirely untouched by their time in the gorge."
  },
  {
    "rating": "1.5/5",
    "review": "too cheesy. The signs back and forth were too cutesy. The last half was better than the first half."
  },
  {
    "rating": "0.5/5",
    "review": "It should be called the gouge because I tried gouging my eyes out through the whole movie"
  },
  {
    "rating": "5/5",
    "review": "This is a very good movie. I've already watched 24times for last 3months. Thanks I've not gone for the rating and watch this good movie."
  },
  {
    "rating": "4/5",
    "review": "This is a very good movie....!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "It was fun to watch a thriller/romance that wasn't polluted with coarse language or lots of sexual activity. There was one sex scene, but it was tastefully done with \"blurring out\" the nude short nude scene. Produced by the leading man Miles Teller ...good job Miles!"
  },
  {
    "rating": "4/5",
    "review": "The Gorge is a film that gives us that feeling of adrenaline and suspense that we like to feel. In addition to the very well-made and scary creatures that harmonize with the chemistry of the cast. But, in the end, there is an ending here, and it was a somewhat disappointing ending, generic and without what made it start."
  },
  {
    "rating": "3.5/5",
    "review": "Delightful fun until the abyss. What happens in the gorge should stay in the gorge. It is a 1950's sci-fi nonsense bad guys, produced by a nonsense post World War military blunder, cultivated by a contemporary nonsense bad guy (Sigourney Weaver no less). But the chemistry of its leads and the chemistry between them, make this a very watchable film,"
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing. It had every genre in. The gorge kept me on edge. It was thrilling and beautiful."
  },
  {
    "rating": "5/5",
    "review": "It successfully fulfilled its purpose of being entertaining."
  },
  {
    "rating": "2.5/5",
    "review": "It was scary but it was a good choice"
  },
  {
    "rating": "4/5",
    "review": "Um romance com suspense, basicamente uma fanfic de Scooby doo, com Sr.eSra.Smith e algum jogo de zumbi da sua infância. Bobo, mas fofo. Não parece ter sido feito com o intuito de ser um filme recorde de bilheteria, mas de ser algo bobo e fácil de assistir. E as vezes a gente só precisa assistir algo bobo, de fácil compreensão mesmo."
  },
  {
    "rating": "4/5",
    "review": "Definitely has re watch value for me. Engaging characters. Ending seemed a bit rushed but overall a good movie"
  },
  {
    "rating": "4.5/5",
    "review": "Honestly a very unique kind of movie. Just when you think you've seen everything, you haven't. I rate this as one of my favorite horror/thrillers however I'm not a big horror fan. It's not too much horror tho, there's a great balance between thriller and horror. It definitely reminds you of playing the 2 player zombie shooting games at arcades. The only part I wish was a little more touched on was the lighting control. It's very dark and often difficult/straining to watch."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was much more than what I thought it was going to get when I turned it on. They could have ruined it with how the monsters looked/their back story.. but the backstory was solid & the monsters were animated well enough to not complain. Good love story overall."
  },
  {
    "rating": "5/5",
    "review": "Loved it. A bit of everything, action, thriller, romance, mystery, the Gorge kept me interested until the end as I wanted to know what was down there and if they ended up together in the end."
  },
  {
    "rating": "3.5/5",
    "review": "Such a cool concept with many great aspects. Unfortunately it loses its footing when exposition comes in. Yet I love how bold & outrageous it is. Some really remarkable scenes that look gorgeous. A wild blend of genres that hit & miss."
  },
  {
    "rating": "4/5",
    "review": "Was a decent action movie. Falling into the gorge brought out a lot of CGI that seemed well done."
  },
  {
    "rating": "4/5",
    "review": "A nice surprise. The romance was nicely written and acted, and the \"horror\" parts were very suspenseful."
  },
  {
    "rating": "3/5",
    "review": "I enjoyed the general idea of this movie. The love story they have going on is cute, and there was a few loud noise jumps that got me. Overall it was decent, however it started to move a bit fast towards the end and lacked deep enough roots/plot points to get me attached. I think the concept was fantastic, it just would have been better executed in a 1 season tv series or something."
  },
  {
    "rating": "4.5/5",
    "review": "Fun plot and kept me entertained."
  },
  {
    "rating": "5/5",
    "review": "Although great actors, I was only mildly interested in watching, but I was quickly dragged into the story. The genre mix is unusual, so I understand why some people may not like certain parts. Luckily I like romance and action, so it seemed pretty good to me. The horror was not over the top or distracting. The story was nicely paced and I appreciated the plot and ending. Would definitely recommend a you might be surprised."
  },
  {
    "rating": "3/5",
    "review": "A decent movie to kill some time, I'm glad it came out on streaming and not in the theaters."
  },
  {
    "rating": "4/5",
    "review": "One of those movies that would've been a decent cinema success in the days before streaming. Tiny but effective cast, good chemistry between the leads. Some minor plot holes but it's very enjoyable for what it is: A mix between Pitch Black and Annihilation with a romance thrown in for good measure"
  },
  {
    "rating": "0.5/5",
    "review": "This was a truly terrible movie. Everything about it. Please, I beg of you, skip this one. Save yourself."
  },
  {
    "rating": "4/5",
    "review": "Not bad kinda entertaining"
  },
  {
    "rating": "5/5",
    "review": "The Gorge is a gripping cinematic experience that masterfully combines heart-pounding action, deep emotion, and surprising tenderness. It hooks you from the opening scene and never lets up. The narrative fearlessly explores trauma, connection, and redemption, paired with stunning visuals and a haunting soundtrack. The cast delivers authentic, compelling performances, grounding even the wildest moments. The direction strikes a perfect balance between thrilling sequences and poignant, introspective moments, giving the film remarkable depth. It’s both exhilarating and profound, appealing to fans of suspense, rich characters, or fresh storytelling. The Gorge lingers long after the credits. My partner and I loved it, chuckling at the quirky romance blossoming amidst the chaos of a hellish battlefield."
  },
  {
    "rating": "0.5/5",
    "review": "This is one of those astonishingly bad movies that make you wonder “how did this get made”? You watch for a while because you cannot look away, like a car accident. The fact that there are positive reviews at all has made me think there’s some kind of conspiracy going on. It’s really horrendous, unwatchable. It makes you think it is based on a video game, but it is not. We started watching because Apple is pushing is aggressively. If I dissuade one person from watching it I will have done a good deed. It does not get better if you keep watching."
  },
  {
    "rating": "3/5",
    "review": "Their love affair was more convincingly when they were separated by a gorge and communicating with placards."
  },
  {
    "rating": "3/5",
    "review": "Terribly unrealistic but good for all those heartwarming, romantic reasons."
  },
  {
    "rating": "5/5",
    "review": "Review: The Gorge Rating: ★★★★★ The Gorge is a cinematic thrill ride that blends intense action, raw emotion, and unexpected heart. From the very first scene, it grabs your attention and doesn’t let go. The storytelling is bold and unafraid to dig into the complexities of trauma, connection, and redemption, all while delivering jaw-dropping visuals and a hauntingly beautiful soundtrack. The performances are standout—each character feels grounded and real, even in the most surreal moments. The direction is tight, with a perfect balance between high-stakes sequences and quieter, emotional beats that give the film real depth. It’s a rare gem that manages to be both exhilarating and meaningful. Whether you're into edge-of-your-seat suspense, layered characters, or simply want to be moved by something original, The Gorge is absolutely worth the watch. It stays with you long after the credits roll. This was truly a favorite of my partner and I. We laughed at the characters and the silliness behind falling in love on the literal front lines of hell."
  },
  {
    "rating": "3/5",
    "review": "This is a well-paced action/romance that doesn't pretend to be otherwise. A fun time"
  },
  {
    "rating": "4/5",
    "review": "It's good. The plot and premise are easy to understand, so don't listen to those saying otherwise. The leads did a good job and had good chemistry. I normally don't go into movies like this for the romance, but I was actually invested the most in that aspect of the movie while watching it. It elevates the entire thing surprisingly well. Everyone listening to Yeah Yeah Yeahs - 'Spitting Off the Edge of the World' right now got sent there by this movie. My wife and I enjoyed it."
  },
  {
    "rating": "0.5/5",
    "review": "Gorge my eyes out so I can never see this movie again."
  },
  {
    "rating": "4/5",
    "review": "(NO SPOILERS) \"The Gorge\" really took me by surprise. I wasn’t expecting much — just one trailer, a colleague's offhand comment that it’s a decent B-movie — but I ended up getting way more than I bargained for. It’s kind of straddling the line between an A and a B production, but in terms of story, it's genuinely interesting and refreshingly original (from what I gather, it’s not based on anything). The movie kicks off right away by introducing the two leads — Miles Teller and Anya Taylor-Joy — and pretty quickly things get intriguing. At first, it’s just the two of them guarding some mysterious gorge, communicating via paper notes through a telescope. But then the plot evolves into an action-packed sci-fi filled with monsters, secrets, and unexpected twists. The atmosphere is spot-on, the score fits perfectly, and the action is fun and at times genuinely suspenseful. Stylistically, it feels like a more polished genre piece, but what really elevates it is the chemistry between the leads. Teller is solid, but Anya Taylor-Joy absolutely owns this movie. Okay, I’ll admit I’ve got a soft spot for her, and with the short dark hair in this role, she was just irresistible — sexy and magnetic. Every scene she’s in was instantly more enjoyable, and I won’t lie, that probably bumped up my score a bit. But bias aside, this is a clever mix of romance, sci-fi, and action, set in an original world that dares to step outside the usual genre boundaries. No, it’s not a groundbreaking masterpiece, but it’s got charm, style, and a story that keeps you watching. Definitely recommended for a cozy movie night — ideally with wine, popcorn, and good vibes. |7/10|"
  },
  {
    "rating": "5/5",
    "review": "This was a fun watch with good chemistry between the stars."
  },
  {
    "rating": "4.5/5",
    "review": "The gorge was pretty exciting, the romance, the thrill, the effects. It made the film engaging, I really like films that has a good balance of action and romance. I mean the chemistry between levi and dasha was very chef’s kiss, I hope too see more films like this."
  },
  {
    "rating": "3.5/5",
    "review": "While not necessarily as original or as gripping as it could've been, The Gorge has plenty on screen to make it it worth your time if you just sit back and enjoy it for what it is. The chemistry between the two main characters is it's strength and makes you care enough to follow them into The Gorge of monsters who appear to resemble many action horror video games. It's not going to be a game changer but sometimes, as in the case of The Gorge, that's just fine."
  },
  {
    "rating": "4/5",
    "review": "I didn’t expect much from The Gorge, but it turned out to be a thrilling sci-fi action ride. Anya Taylor-Joy and Miles Teller have great chemistry, and the futuristic setting was convincingly portrayed. The pacing was tight, making it an exciting watch from start to finish."
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies I have watched in a while- we deserve better."
  },
  {
    "rating": "5/5",
    "review": "First part was kinda predictable, the twist was nice, the ending just perfect"
  },
  {
    "rating": "5/5",
    "review": "Very nice and enjoyable movie !"
  },
  {
    "rating": "4/5",
    "review": "Actually enjoyed this. Back story of monsters in the gourge seemed lame. But build up and acting brought this one home."
  },
  {
    "rating": "3.5/5",
    "review": "Brilliant story, I enjoyed the funny humour love story to the film. I enjoyed the suspense and thrillingly plot of this movie it's worth a watch"
  },
  {
    "rating": "2/5",
    "review": "I watched half before I bailed out. The first 10 minutes are intriguing. After that it's just a mediocre love story with a bunch of shooting and creepy monsters."
  },
  {
    "rating": "5/5",
    "review": "I really think its a great movie that you can wqtch more than one time"
  },
  {
    "rating": "3/5",
    "review": "More often than not, genre and tone mixing distracts from a film’s story, but interestingly enough – may it be due to the star power and chemistry of both leads, or the direction of Scott Derickson – The Gorge mixes traditional romcom with B-movie sci-fi horror to an enjoyable outcome. Levi (Teller) and Drasa (Taylor-Joy) are two elite snipers receiving an identical mission, guarding opposite sides of a remote, top-secret gorge for one year with no contact with each other and the outside world. Levi’s predecessor explains that the perimeters are armed with sentries to contain creatures within the gorge, nicknamed “The Hollow Men”. His predecessor is then killed by their employer, alluding to a darker secret. Months later, Drasa violates the no-communication protocol by writing signs, having a sharpshooting contest and playing loud music. Hollow Men attempted to climb out of the gorge utilizing this distraction but the couple managed to defend their respective boundaries. Their bond grew, leading to Levi finding a way to zipline across the gorge to spend a romantic night with Drasa, however the next morning Levi accidentally falls down the Gorge as the creatures attacked again. Drasa consequently parachutes after him. We then follow the pair as they struggle to survive a hellish landscape filled with monsters, on top of discovering the gorge’s secret; a failed bioweapons lab abandoned after a containment leak. All maintained by their employers in order to extract samples and make super soldiers. Most of the plot warrants suspension of disbelief, thesurvival of both leads in an area filled with monsters is B-movie and video-gamecoded. Predictable, but enjoyable due to its charismatic leads, it proved itsworth as a tv movie amongst its contemporaries but it’s not something worthwatching on the big screen."
  },
  {
    "rating": "5/5",
    "review": "Very entertaining movie."
  },
  {
    "rating": "1/5",
    "review": "D INNER stupid idiots"
  },
  {
    "rating": "4/5",
    "review": "The Gorge is an intriguing film with standout performances from its talented cast. I genuinely enjoyed the movie, but I found some of the writing to be a bit corny at times. Certain lines, especially when expressing love, felt awkward and out of place, which detracted from the overall experience. Despite this, the actors brought their characters to life with authenticity and depth, making it a worthwhile watch."
  },
  {
    "rating": "3.5/5",
    "review": "Did anybody already pull the obvious joke? No? Well then here it is: It was gorge-ous. I can recommend it as a nice and relaxing film. Teller and Taylor-Joy are acting well together. It manages to stay clear from any modern \"message\" and still not falling back to any old time damsel in distress tropes. Both are strong characters, but no assholes. The CGIs sometimes let’s me down. I think more practical effects would have been more grounded and would have allowed more immersion. The first act (the romance) is the best, though. The rest is nice to watch. It is ok. Brain off, popcorn and let it roll. It won't stick with you long, but it is better than many modern productions."
  },
  {
    "rating": "2.5/5",
    "review": "Started out with an interesting premise, but quickly devolved into nonsense with characters behaving stupidly. Suspend disbelief and it's an ok action movie with a ridiculous romance angle. The original ratings were crazy high, so at least the current reviews seem a little more honest."
  },
  {
    "rating": "5/5",
    "review": "Awesome! Fun and entertaining."
  },
  {
    "rating": "5/5",
    "review": "I approached The Gorge with some apprehension, expecting a romantic tale set against a horror backdrop. However, watching it with my daughter, wife, and three older friends (both male and female), we were all thoroughly captivated. The film masterfully blends romance, a gripping storyline, robust character development, and intense action sequences. Unlike many movies that leave lingering questions, The Gorge provides a satisfying conclusion, addressing all plot points comprehensively. It's a cinematic experience that resonates with a diverse audience, and I wholeheartedly recommend it. A solid 10 out of 10."
  },
  {
    "rating": "5/5",
    "review": "En mi opinion la combinacion de romance y accion es algo atractivo de la pelicula muy buena en mi concepto"
  },
  {
    "rating": "3.5/5",
    "review": "So good the cinematography was good the design overall aesthetic was splendid for me, Miles teller was great but Anya Taylor Joy took my heart only thing is the ending felt little okayish could have explored more about the hollow people but definitely worth a watch."
  },
  {
    "rating": "4/5",
    "review": "A slightly different action story with a touch of romance. Add a bucket of popcorn and you've got 2hrs of easy fun."
  },
  {
    "rating": "4/5",
    "review": "Good film worth a watch I liked it more than other recent sci-fi & horror franchises that these so called high rated reviewers love, they're most likely the same as those 1980s film critics who gave bad reviews to John Carpenter's The Thing."
  },
  {
    "rating": "4/5",
    "review": "Great movie. Original idea. Well acted and directed. Fun action, but also interesting character development. Enjoy!"
  },
  {
    "rating": "3.5/5",
    "review": "Good enough to pass the time. Good character development and 2 great leads."
  },
  {
    "rating": "2.5/5",
    "review": "This is NOT a terrible movie. BUT... The romance angle at the core of the film is it's bright spot. Between Miles Teller and Anya Taylor Joy, their chemistry feels real. Outside of that, there's too much going on in this mixed bag genre flick. THE GORGE falls right in line with every other Miles Teller film (except Whiplash)....Middle of the road."
  },
  {
    "rating": "5/5",
    "review": "OMG this is pure awesomeness mixed with the perfect amount of romance."
  },
  {
    "rating": "4/5",
    "review": "Took it as an unabashed B picture (if overlong) with an A picture budget, and had fun!"
  },
  {
    "rating": "4/5",
    "review": "Not too shabby for my taste. Anya Taylor isn't as hot as she was, but still packs a punch. Enjoyable Saturday night movie. If you're into the sci-fi-zombie genre."
  },
  {
    "rating": "2.5/5",
    "review": "This is what a cliche action movie is."
  },
  {
    "rating": "0.5/5",
    "review": "If you want to have lines in another language in your movie, you should hire a team that speaks natively in that language to correct the scenes. As a Lithuanian there were scenes where subtitles said 'Lithuanian' and none of the words even sounded like the language neither in vocabulary sense, nor phonetically. I know The Brutalist got a lot of hate for using AI to correct the Hungarian pronunciation, but this movie is a perfect example of what happens if you don't do that. If you don't want native speakers to play the foreigner requiring role, then please don't butcher someone else's language. Terrible execution that made it hard to watch the movie itself."
  },
  {
    "rating": "0.5/5",
    "review": "So bad! Anya Taylor Joy is pouty and flirty and so incredibly terrible. Top 10 worst movies I’ve ever seen.."
  },
  {
    "rating": "0.5/5",
    "review": "Rubbish, start to finish"
  },
  {
    "rating": "1.5/5",
    "review": "Predictable tripe. I can't think of anything else to say."
  },
  {
    "rating": "2.5/5",
    "review": "Cheesy, full of plot holes, generally ridiculous - a mash up of sniper movies, video games like Last of Us, romcoms and conspiracy thrillers. Sigorney Weaver was totally wasted. Cast was ok, acting was fine - but movie is dumb. Was pretty cringe tbh."
  },
  {
    "rating": "1/5",
    "review": "It started out promising and was kinda entertaining but God this movie is so dumb. If you don't want the watchers in the towers across the gorge communicating with each other maybe don't make them hot singles with access to markers and an endless supply of drawing pads! If you know you're exposed to toxic gas, wouldn't you immediately try to cover your mouth? I don't want to say any more because it would include spoilers but there's so many plotholes, honestly I don't know how it got made. If you decide to watch it, leave your brain at the door--it will only hold you back."
  },
  {
    "rating": "4/5",
    "review": "\"The Gorge\" was a pleasant surprise, a rarity these days. The first hour sets up the interesting premise and details the relationship between the two protagonists, a pair of snipers wonderfully played by Teller and Taylor-Joy, tasked with keeping -- something -- from escaping the gorge. Then the second half turns to full-out action and horror, featuring a variety of scary creatures and a deadly environment, all of which truly kept me on the edge of my seat. A wonderful time is guaranteed for all!"
  },
  {
    "rating": "3.5/5",
    "review": "My daughters and I watched this film fairly recently and definitely enjoyed it, there is a great set up with plenty of mystery and intrigue. The main actors are superb as you would expect from them and it develops nicely. The problem, is once you get the reveal it sort of loses it's way. The ending while adequate could have been so much better. The problem with streaming films is they often do not end well. There are so many great ideas out there but with they appear to just have no clue how to finish their stories. I do wander if this reflects a churn them out attitude, rather than actually producing something of genuine quality. I have watched a high number of straight to streamed movies and can only think of 2 or 3 that have anything like a decent ending especially in sci fi. Streaming services need better writers."
  },
  {
    "rating": "5/5",
    "review": "My bf and I absolutely loved the movie, it deserved to be in theaters. Great acting, great cgi, loved the plot and the fact it was so tense sometimes. The filming was amazing. It was refreshing to see a movie with not so many head characters."
  },
  {
    "rating": "4/5",
    "review": "I think that's a really suspenseful Horror Sci-Fi. Acting, camera scenery everything is top."
  },
  {
    "rating": "3/5",
    "review": "Fun in the first half, but kind of lost me once they were in the Gorge, Easy film to chuck on on a Saturday night."
  },
  {
    "rating": "4.5/5",
    "review": "Thoroughly enjoyed the film and new concept. Ending could have been focused on slightly more to give a complete feel."
  },
  {
    "rating": "1.5/5",
    "review": "Terrible movie, the acting has a good level but after a while it goes down the drain pretty fast. This is one of those Post Streaming Movies that 20 years ago would have never made the cut to be produced."
  },
  {
    "rating": "1/5",
    "review": "The Gorge had potential with its sci-fi setup, but it quickly devolved into just another predictable monster flick. What started with promise turned into a total snooze—nothing fresh, nothing thrilling. If you’re hoping for depth, surprises, or a story that sticks with you, this one’s a skip."
  },
  {
    "rating": "4.5/5",
    "review": "We watched the Gorge, a scifi suspense movie about two special sniper opps played by Anya Taylor and Miles Teller, from Whiplash & Top Gun. Thinking this was going to be a less intricate plot and more of a let’s see where this goes premise, I was actually pleasantly surprised with the depth of the relationship and sci-fi fantasy development of the film, making it less of a dry stoic thriller. I anticipated a whole silent tense suspense thriller using minimal dialogue and a lot of reserved acting that would only let up toward the last 3rd of the film but it was full of life from the first interaction between them. I wished Id watched it in theaters for the heightened tension. It would have been worth it as one of the few movies that came out this year. Now on the creative sci-fi horror direction, wow that wasn’t stale, it was juicy with dark designs and eeriness and tech. Being a more stylish artistic and metaphorical hell was a good choice as the unfeeling meaningless bio-horror that has been over done in modern films, and it brought it back to a 90s imaginative Del-Toro, Event Horizon type of interpretation which brought elements of “evil” playing a part into the scifi in a way that was intriguing and not corny. The sound design was also a plus, the intimate quiet buildup and the eerie pulsating techno music really pulled me in like older horror scifi that give you a sense of dread and exoticness. I miss esoteric scifi concepts and visions that used to spark my imagination, and this kinda satisfied that litch without being too bizarre. The best part that carried the movie was the performance and chemistry of the two actors with their quick-reactions, daring decisions and vulnerable performance. They never disappoint in both of their specialities- his being a witty, driven, mtraumatized, enduring, upcoming military opps, and Anya being a spunky coy petite talented European girl who always is willing to go for the kill to defend herself and others."
  },
  {
    "rating": "3.5/5",
    "review": "It's a well made movie but to watch without compromise yourself with the history. The acting from the main roles are good. The pace towards the ending could let you down"
  },
  {
    "rating": "3.5/5",
    "review": "Has its moments. The first time things kick off was a rush."
  },
  {
    "rating": "3/5",
    "review": "Good concept, some good acting from the 2 main roles, from Sigourney, not so much. Some surprises and action that will keep you on the edge of your seat. I loved the King Kong oversized insect scene. But the ending was dull and everything else weren't explained properly, but overall something to watch."
  },
  {
    "rating": "1/5",
    "review": "I am astounded by the positive reviews. Within five minutes, I was thinking, well, this is dumb. But my friend and I kept watching to see what would happen. It remained dumb throughout - seriously one of the stupidest movies I have ever seen. The plot was absurd and largely incomprehensible, and the \"love\" story was no better. There was *zero* chemistry between Anya Taylor-Joy and Miles Teller, and their interactions were super cringey. Sigourney Weaver is always great but she honestly looked embarrassed to be participating in this nonsense."
  },
  {
    "rating": "3/5",
    "review": "Great acting from Miles Teller and Anya Taylor-Joy. Their romance and chemistry felt organic, and I think it's important to clarify that their relationship was built over months. However, I feel too much time was spent delving into their relationship, that took away from time that could have been spent building the antagonist. The Hollow men where just that, a hollow and lifeless concept that should have been a lot more exciting. Sigourney Weavers character felt like another empty suit with no real character. Poorly written movie saved by immense acting performances."
  },
  {
    "rating": "2/5",
    "review": "There’s some good acting in this movie and the story has some interesting features to it but it mostly couldn’t really keep my attention. The action was cool but the story often times was unnecessarily slowed down and the connection between the two main characters wasn’t very relatable to me. A movie soon to be forgotten."
  },
  {
    "rating": "5/5",
    "review": "I expected to turn this off and go to bed in the first 15 minutes. Instead, I enjoyed the whole thing. Ending is predictable but the build and tension between the main characters was a fun ride! Bioshock meets Pirates of the Caribbean…I’m here for it! Great movie."
  },
  {
    "rating": "4/5",
    "review": "Nice setup, a good amount of stress inducing. It couldve been a lot but it's silly. A 'I don't mind it' kind of silly."
  },
  {
    "rating": "1.5/5",
    "review": "It's so cheesy. The forced romance ruined it IMO. They don't even seem concerned finding zombie monsters exist in this gorge. Instead they focus on the main characters acting like high schoolers pining over each other at summer camp with action in between. The monsters and potential horror in the premise is totally lost because of the romance, cheesy one liners and us knowing nothing can really happen to them. It's so corny."
  },
  {
    "rating": "4/5",
    "review": "Miles and Anya both gave great performances, the story was okay but somewhat expectable"
  },
  {
    "rating": "3.5/5",
    "review": "A bit slow, as the characters were revealed. Totally enjoyable witha few jump moments."
  },
  {
    "rating": "5/5",
    "review": "I would not change a single thing about this movie. Honestly, i read a lot of rotten tomatos scores and reviews but this is the first review i write, simply because i loved the film. Now, to be honest, if you go to this movie expecting to see the next big horror/thriller movie you would be disappointed. However, if like me you like character driven love stories with a bit of mystery, this is your thing ! The movie is all about their chemistry and dedication to each other. Two assassins who have given up on life and are ready to give an year of their time to sit in a tower, actually learning to care and protect each other is a theme, not often explored by today's media. The 'hollow men' design was not the best thing for me as i have seen everything in horror zombie games, but i can understand why they did it. I strongly recommend this movie, regardless of its little flows. Go and enjoy two amazing actors bring their roles to life !"
  },
  {
    "rating": "4/5",
    "review": "Good movie, Cold war “Easter egg"
  },
  {
    "rating": "2.5/5",
    "review": "It wasnt as good as I thought it will be.I feel disappointment. It could be better with writing. It feeled like it was written by your dumb cousin whos 12. On the good side it had terryfic special effects and nice romantic history. The plot unsurprising. You can compare it to the movie you can experience once but when you watch it another time its the most boring film you watched."
  },
  {
    "rating": "4/5",
    "review": "Really enjoyed this movie. It’s got a lot - secrecy, romance, horror, action and fantasy/sci-fi. Worth a watch."
  },
  {
    "rating": "3/5",
    "review": "Absolutely loved it, and thought all these things would happen with the monster zombie things.... And it didn't? Would watch a prequel set a few years earlier where they can include lots more of the monsters and make it more action packed. Also an origin movie."
  },
  {
    "rating": "3/5",
    "review": "Entertaining Action for Valentine’s Day As a movie released for Valentine’s Day, it works really well. If you’re tired of the usual romance films, this is the perfect excuse to fill the love-movie slot you have to watch with your partner that day—without feeling like a sacrifice. The most interesting thing about this sci-fi movie with action, mystery, creatures, and romance is that, without a doubt, the best part is the romance itself. Beyond that, the production value is quite impressive, with action scenes and special effects that far exceed what you’d expect from a film like this. However, the real highlight—the factor that makes the movie enjoyable—is the lead couple. Miles Teller delivers a solid performance, while Anya Taylor-Joy once again brings that extra spark she always seems to have. Overall, it’s a decent film. Don’t expect anything extraordinary, but as a Valentine’s Day alternative, it shouldn’t disappoint."
  },
  {
    "rating": "5/5",
    "review": "Everyone with negative comments about the \"premise\" can put their opinions where the sun dont shine because apperentlly we cant have fun anymmore and fiction cannot exisdt in entertainment this performance was swonderful and if you cannot recognize that then you simply suck. This movie has soviet tree zombies and hella nukes. Anya taylor joy and that guy from fantastic 4 were a great couple. shame there was no on screen sex. The buildup of the story was perfectly exectuted. just like that soldier at the beginning. I will die on this hill. Absolutely splendid performanced from sigourney weaver. super evil. I really wish we heard more poetry from the buff guy. Excellent shower scene. Overall, well rounded movie. You'll like it if you like the maze runner."
  },
  {
    "rating": "2.5/5",
    "review": "I went into this with the lowest possible expectations and the nonsensical premise and video game style action met that low mark. But the charm of the lead actors make for some tolerable moments."
  },
  {
    "rating": "1/5",
    "review": "The Gorge is a waste of your time. It starts with some semblance of a good idea but quickly crushes it. The film continues the trend I’ve noticed of never watch a film made for streaming. Every time I try I am terribly disappointed. At times it tries for a literary tone but throws that out the window after some short lip service. It is mindless meandering through multiple film genres."
  },
  {
    "rating": "1/5",
    "review": "It seemed like they had a great idea, then realized they couldn’t execute it so they gave up halfway and made their protagonists ridiculously OP and the plot ridiculously contrived. It’s like an adult started telling the story and fell asleep after the love scene, then a 12-year-old picked up where the adult left off. I want my hour back!! lol Ugh it’s so bad."
  },
  {
    "rating": "4/5",
    "review": "I don't care what others said about but I loved it. I mean sure the part at the lab was a tiny bit long, otherwise it had everything,,, romance, action, adventure, kind of mystery and more romance lol. Drasa and Levi you are loved"
  },
  {
    "rating": "1.5/5",
    "review": "more pop cultur for teens than art. Acting was sweet and convincing but hte production is in my opinion more a uninsiering cgi yombie action romance. strong minus the wapon realism is verry bad considering that both main characters are supposed to be the worlds best marksman"
  },
  {
    "rating": "5/5",
    "review": "Beautiful scenery, great acting, insane plot and a quirky romance between two people with nothing to lose. Loved this movie. It’s a must watch and imho much better than any blockbuster cinema release that’s out at the moment. Great cast with strong chemistry. I thought the cgi was great. The plot and cgi etc. are kinda the backstory to the way people can connect with each other… even over a gorge."
  },
  {
    "rating": "1.5/5",
    "review": "I simply was not captivated by anything in this movie and that was the biggest disappointment over everything else because I wanted so much to like it."
  },
  {
    "rating": "0.5/5",
    "review": "For about 30 minutes I thought I was watching something interesting. Then it dropped off a cliff (a gorge, if you will). So full of plot holes you could call it cinematic Swiss cheese. Just rubbish, really, absurdity heaped upon absurdity. As for the \"romance\"? Are they kidding? Not a flicker of light between the two leads. (Full disclosure: my wife made me watch it!)."
  },
  {
    "rating": "4.5/5",
    "review": "This movie exceeded my expectations. First of all, the story was interesting with twists and turns that I didn't see coming. I can say that without hesitation. There were also a lot of great adventure and romance elements, both of which are things that I always love in a movie. The acting, writing, visual effects, sound design, and other aspects were all on point, which added to the viewing experience. The writers did a great job of making me really care about these characters, and the high-stakes consequences of the main character's choices made the movie that much more intense. It was a great movie that had me engaged from beginning to end. I can't recommend it enough."
  },
  {
    "rating": "2/5",
    "review": "As action movie is no that bad but they abuse of bad CGI, story was interesting the first half hour then it gets boring, plot holes everywhere, the kind of flick to watch while cleaning the house."
  },
  {
    "rating": "5/5",
    "review": "Me and the wife really enjoyed this movie. It had a good story that and kept us watching from the start. It also included a soundtrack called \"spitting off the edge of the world\" which was equally awesome which introduced me to the band Yeah, Yeah, Yeahs who I never knew existed! A complete breath of fresh air compared to many movie ideas, and it's a MUST see!!!"
  },
  {
    "rating": "3.5/5",
    "review": "The movie was an enjoyable watch, with both lead characters delivering strong performances that carried the film. Miles Teller did justice to his role, adding an intriguing layer of mystery to his character. A deeper exploration of what defines the Gorge could have been introduced earlier, and the storyline could have been more compelling. However, it maintained a logical flow and didn’t feel entirely nonsensical. Overall, it's a decent one-time watch."
  },
  {
    "rating": "5/5",
    "review": "HOLY F***ING SH*T!! What a movie! What an ending! This film is an absolute rollercoaster of mystery, suspense, and adventure. From start to finish, it had me glued to the screen—I couldn’t predict a single twist! The storytelling was masterful, the pacing flawless, and the atmosphere utterly immersive. It’s the kind of movie we’ve all been craving for so long, a perfect blend of thrills and surprises. And oh my God, the jump scares? Perfectly timed, heart-stopping, and utterly terrifying. Every scene felt like a punch to the gut in the best way possible. The characters were compelling, the visuals stunning, and the soundtrack amplified every moment of tension. I would watch this in theaters again and again without ever getting tired of it. An absolute must-see for anyone who loves edge-of-your-seat storytelling and unforgettable cinematic experiences!"
  },
  {
    "rating": "1/5",
    "review": "Miles and Anya are not believable at all. A waste of good cinematography, with a below par plot and horrible script. The gorge comes off as a parody of the movie it’s trying to be."
  },
  {
    "rating": "1.5/5",
    "review": "Literally embarrassed for these two accomplished actors. This watches more like an 80s soap opera, mixed with 90210 and topped off with some guns to have some sort of action. From “we aren’t supposed to communicate” to I’m gonna shoot an RPG with a rope across Satans canyon we are guarding to come get freaky with you. Don’t..just don’t waste your time."
  },
  {
    "rating": "2.5/5",
    "review": "\"I love you even though I've only known you for 5 days\" basically sums up the depth of the love story here; Was cringe but overall enjoyable to watch. But not something I'll go out of my way to watch a second time"
  },
  {
    "rating": "3/5",
    "review": "not bad but not super great, I had to kind of turn my brain off to watch this movie still was fun to watch though."
  },
  {
    "rating": "3.5/5",
    "review": "It’s okay. It could’ve had multiple movies. It lacked depth (no pun intended)."
  },
  {
    "rating": "1/5",
    "review": "Pulpy premise and characters pandering to the adolescent male gaze — or just general arrested development."
  },
  {
    "rating": "4/5",
    "review": "Good movie. Worth watching. Yeah the plot doesn't get fully explained but you don't need any more information than you get to enjoy. Bangin movie while stoned, gripping watch."
  },
  {
    "rating": "3.5/5",
    "review": "An overall worthwhile watch. The character development and romantic storyline work well and the plot in itself is very interesting. The only let down at points is the dark scenes, which sometimes makes it difficult to know what's going on."
  },
  {
    "rating": "4/5",
    "review": "Watch this thrilled romantic movie making,camera,action scenes are pretty good. I will give 4*"
  },
  {
    "rating": "2.5/5",
    "review": "Great action sequences, some humorous bits and excellent special effects couldn't overcome a thin overarching story. A fun but predictable film to watch on a Friday night."
  },
  {
    "rating": "0.5/5",
    "review": "The single dumbest thing I’ve ever watched. Nothing makes sense, nothing is explained. It’s two people occasionally firing gigantic guns down a ditch while having zero chemistry. This thing is a misery."
  },
  {
    "rating": "4.5/5",
    "review": "I kept thinking about this movie for a month. I'm a sucker for romantic-scifi with happy endings, I won't apologize for it."
  },
  {
    "rating": "4/5",
    "review": "Wreszcie coś oryginalnego. Film klimatyczny, motyw zawartości wąwozu trochę niedopracowany ale i kino tak warte zobaczenia."
  },
  {
    "rating": "1/5",
    "review": "Filmed in dark vision. Even in full daylight you cannot see anything so you cannot engage with the story."
  },
  {
    "rating": "2/5",
    "review": "This could have been something special, but it all goes wrong too quickly. The premise of two individuals watching over a gorge with so much at stake is just stupid - but let's say you suspend your disbelief (and you won't, because you'll keep being reminded of the stupidity of the idea) - there are major problems with this movie. It would have been great in the hands of John Carpenter in the '80s. There is no sense of jeopardy, terror, surprise, or creeping dread. It just exists with no actual viewer emotion around anything or anyone in it. Certain CGI elements are actually poorly and lazily designed."
  },
  {
    "rating": "4/5",
    "review": "Since I am a fan of survival movies, and a sucker for snipers so I may be little bias toward this. I think the movie is absolutely awesome. Similar to tomorrows war without the time travel element. The fact that the creatures inside the gorge once human, they are not like zombies and I think the movie depict that. To be honest enough zombie movies .... Not a big fan of Anya but she was perfect for the role as a bit crazy assassin. The romance between them were not corny but tasteful. perfect amount of action with absolutely awesome performance by Miles. Although they destroyed the gorge with the \"Stray Dog\", and that was awesome. I would like to see part 2, If they were asked to guard a real gate to hell and not a man made one this time."
  },
  {
    "rating": "5/5",
    "review": "I am Serinda, a resident of West Virginia, and I am sharing my experience of being defrauded by a cryptocurrency Ponzi scheme. A few months ago, I encountered a crypto exchange website that deceptively mimicked a legitimate crypto exchange, and their support team proved exceptionally unhelpful. Unbeknownst to me, I was ensnared in a cycle of incessant fee demands, purportedly required to access the funds they instructed me to deposit. They had fabricated a fraudulent exchange platform designed to lure individuals into depositing their crypto tokens with the promise of significant returns. Regrettably, I was oblivious to the deception. My realization dawned when the exchange website rejected my withdrawal requests. In desperation, I contacted DUNE NECTAR WEB EXPERT. They not only facilitated the recovery of my crypto funds but also educated me about the mechanics of the scam. While the experience was devastating, I am grateful for their assistance in retrieving my crypto tokens from that fraudulent exchange website and its team. I strongly urge everyone to exercise extreme caution and conduct comprehensive due diligence before investing or transferring cryptocurrencies to any website or team. DUNE NECTAR WEB EXPERT can be contacted via: - Email ( Support @Dunenectarwebexpert . Com ), Telegram ( Dunenectarwebexpert ), Mobile Number ( +1- 617-283-4687 )."
  },
  {
    "rating": "1/5",
    "review": "I encourage you to avoid this commercial crap. So sad that Taylor-Joy and Weaver are in such a film. It might be enjoyed by Marvel fans? Ignoring the glorification of murder, I enjoyed the slow-paced unfolding of story over the first 30-40 minutes. But then it erupted into idiotic big-gun-shooting of monsters, after some ridiculous implausible stunts. Oh dear, what a waste of my time."
  },
  {
    "rating": "3.5/5",
    "review": "IT WAS VERY NICE. I actually liked it. I liked the setup, the execution, the special effects, it had a nice backstory, a good concept, not exactly done with as much forethought as I would have liked but still? Nice. I enjoyed it. I see a lot of crappy Sci Fi and a LOT of horrible horror. This one rang true and it was the love story more than anything else that I enjoyed. It had echoes of Enemy Mine and Hell In The Pacific while being a well done romance instead of enemies becoming friends. They skipped that part and kudos for not bothering with that nonsense. Taking politics out of it and making it about the mission and about human connection made this movie much better for it. I could tear it down a few pegs in terms of the whole genetic engineering gone loonietoons and so on but meh, who cares. Sometimes you get to watch Miles Teller and Anya Taylor Joy shoot at each other for fun. And to me? THAT'S FUN. Or to the more relevant point, NICE."
  },
  {
    "rating": "3.5/5",
    "review": "The story overall makes sense? The action is good? Its well directed and well acted? A memorable action movie due to how competent it is compared to other modern action movies."
  },
  {
    "rating": "5/5",
    "review": "16-3-2025 \"Three things cannot be long hidden: the sun, the moon, and the truth.\""
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed The Gorge a very suspensful movie with a lot of action. Two superb ex-military marksman are given the task of guarding a gorge from concrete bunkers/towers. It is a one year assignment and they are provided very little information as to the nature of what they are guarding. All they are told is whatever is in the gorge don't allow it to escape. Very good acting with a strong story filled with suspense."
  },
  {
    "rating": "3.5/5",
    "review": "I enjoyed this film. It caught my eye as I browsed the Apple TV+ library, looking for something new I hadn’t seen before. Lo and behold, I found this, and I have to say I wasn’t disappointed, although the outcome and direction of the film were slightly different than I anticipated. But the film won’t bore you out of your skull. It is a slow start that heads into an endless streaming rush of excitement up until the finale. Most of all, this film is an excellent outlook on man's hubris and how we take things one step further than necessary. Because we are human, we tend to make mistakes whose outcome affects us and the world around us. This is evident in the film's central plot, as you understand the lengths people would go to keep the biggest secret possible, regardless of the expense or who."
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed this movie. Teller and taylor-joy have some great chemistry. Action was good cgi heavy but a very fun popcorn flick. Few jump scares which got me. Well worth a watch"
  },
  {
    "rating": "2.5/5",
    "review": "The through line of the relationship is promising but it really sputters and they have to move to the big reveal of what is going on. It is not that big and really does not hold water. Then the movie just becomes a boring video game. Then the final scene makes no sense with a plot hole as big as the gorge itself."
  },
  {
    "rating": "0.5/5",
    "review": "Couldn’t even make it through the whole movie."
  },
  {
    "rating": "3/5",
    "review": "A sweet love story wrapped in a sci fi bow. Nothing special but it was enjoyable."
  },
  {
    "rating": "3.5/5",
    "review": "The Gorge is the latest film from Apple studios and it’s is a fun, wild, but often uneven film. The movie starts off very mysterious building up a little backstory for our two main leads that is somewhat generic. The backstory of our main heroes is not what you came to see from this film. You came to see a lot of action and see what wild things are in the gorge. I will say I was pretty surprised by the creativity and crazy elements that we get to witness halfway through this film. I will not spoil anything here for you. The movie keeps you interested the whole time but however has a cliche type of ending. The Gorge gets a solid 3 1/2 stars out of 5."
  },
  {
    "rating": "4.5/5",
    "review": "I love this movie from the start to finish. Trent Reznor of Nine Inch Nails did an amazing job on the phone score. I hope there is a sequel. If you like action and you like sci-fi, this is a win-win."
  },
  {
    "rating": "4/5",
    "review": "Enjoyed myself with this one. Felt some of the vfx were questionable and some of the story dragged in the 2nd quarter but the hour mark hits into high gear and is then great and high paced. Overall story and experience were very enjoyable"
  },
  {
    "rating": "4.5/5",
    "review": "While playfully delighting, the Gorge does occasionally careen toward cliche. Otherwise, there is little not to like here. An encore would be welcomed."
  },
  {
    "rating": "3.5/5",
    "review": "The Gorge is a cool but forgettable film. Frankly I hoped for a little bit better than a generic sci-fi horror from Scott Derrickson. It did took me by surprise with its ever-shifting nature, evolving from a romantic two-hander involving two elite snipers into a sci-fi action horror blockbuster. Miles Teller and Anya Taylor-Joy anchor the film with compelling performances and great chemistry, while Dan Laustsen’s gorgeous cinematography and Trent Reznor and Atticus Ross’s score elevate it past some of its narrative pitfalls. While it begins to feel aimless by the halfway mark, the action ramps up and attempts to distract from its overall lack of depth. It’s just unfortunate that the initial intrigue gets pushed to the back burner by the end, though the time we spend with our leads is charming enough. It hits its mark, just not always with pinpoint precision."
  },
  {
    "rating": "1/5",
    "review": "Pretty confused by the high ratings for this one. The acting was not bad but the story was predictable and the action/dialogue was cheesy. Definitely would not recommend or ever watch again"
  },
  {
    "rating": "4/5",
    "review": "An odd combo, sci-fi, horror, action, ROMANCE. Protagonists have great chemistry, just enough gunfire, monsters. Romance that’s believable combined with spot on music and Great editing. Hope there is a well thought out follow-up, same crew."
  },
  {
    "rating": "5/5",
    "review": "The story is fairly obvious. The actions the characters take are easy to call. The premise, isn't exactly brand new, but MAN is it a fun movie. There's nothing ground breaking or earth shattering here, but if you're looking for a fun escape movie, you're on the right track. Definitely the most fun movie I've seen in a while, The Gorge is a win."
  },
  {
    "rating": "4/5",
    "review": "Fun, fast paced and well acted. Some suspension of disbelief is required to enjoy the movie, but it's worth it."
  },
  {
    "rating": "3.5/5",
    "review": "This movie is a bit different. I liked the way it built up became a romance story with an interesting middle piece as the 2 characters survive chaos and eventually make it out. It was exciting - for a formulaic movie. The effects were great and action scenes not too gory in view of the creatures involved. The ending is a bit of a shrug of the shoulders because how did he survive? It is too interesting to miss ... the suspense and the build up was good."
  },
  {
    "rating": "5/5",
    "review": "I personally loved this movie the cgi was very good I liked the story also loved the ending. I give it a 5 star rating"
  },
  {
    "rating": "3/5",
    "review": "Good romantic suspense film until they go into the gorge. Then it’s cheesy and ordinary the 2nd half through the ending."
  },
  {
    "rating": "1/5",
    "review": "Awful and annoying, as most of the movie is shot in a complete darkness by possibly blind cameraman and director, even when the darkness was absolutely not needed. So, most of the movie you're staring at a dark screen, cursing and trying to guess what is going on. I have really tried, but couldn't finish it."
  },
  {
    "rating": "5/5",
    "review": "My husband and I recently watched \"The Gorge\" on Apple TV+, and it was an exhilarating experience from start to finish. Directed by Scott Derrickson, this film masterfully blends science fiction, romance, and action, creating a unique narrative that kept us on the edge of our seats. The story follows two elite snipers, Levi Kane (Miles Teller) and Drasa (Anya Taylor-Joy), tasked with guarding a mysterious gorge. As they uncover the gorge's dark secrets, including monstrous creatures and the remnants of a bioweapons research lab, the film delves into themes of love, sacrifice, and redemption. The chemistry between Teller and Taylor-Joy is palpable, bringing depth to their characters' evolving relationship. Sigourney Weaver's presence adds a layer of gravitas, enriching the film's narrative. One of the standout elements of \"The Gorge\" is its impeccable soundtrack. The music perfectly complements the film's intense action sequences and tender, romantic moments with an edge. The rock-infused score adds a very edgy, cool, and eccentric vibe to the film, amplifying the atmosphere and enhancing emotional depth and tension at just the right moments. Whether it's the haunting melodies during suspenseful scenes or the edgy rock tunes accompanying heartfelt exchanges, the soundtrack is an essential part of the film's storytelling. Visually, the film is stunning, with breathtaking landscapes and intense action sequences that are both thrilling and beautifully choreographed. The storyline kept us engaged with its unexpected twists and emotional depth, culminating in a satisfying and heartfelt conclusion. While the film's ambitious mix of genres might not be for everyone, we found it to be a captivating and well-executed cinematic experience. Whether you're a fan of science fiction, romance, or action, \"The Gorge\" offers something for everyone. Overall, \"The Gorge\" is a thrilling and heartfelt journey, elevated by its perfect soundtrack and the tender, romantic moments that carry an edge, making it a film that you will watch again. Gina Helm: My husband and I recently watched \"The Gorge\" on Apple TV+, and it was an exhilarating experience from start to finish. Directed by Scott Derrickson, this film masterfully blends science fiction, romance, and action, creating a unique narrative that kept us on the edge of our seats. The story follows two elite snipers, Levi Kane (Miles Teller) and Drasa (Anya Taylor-Joy), tasked with guarding a mysterious gorge. As they uncover the gorge's dark secrets, including monstrous creatures and the remnants of a bioweapons research lab, the film delves into themes of love, sacrifice, and redemption. The chemistry between Teller and Taylor-Joy is palpable, bringing depth to their characters' evolving relationship. Sigourney Weaver's presence adds a layer of gravitas, enriching the film's narrative. One of the standout elements of \"The Gorge\" is its impeccable soundtrack. The music perfectly complements the film's intense action sequences and tender, romantic moments with an edge. The rock-infused score adds a very edgy, cool, and eccentric vibe to the film, amplifying the atmosphere and enhancing emotional depth and tension at just the right moments. Whether it's the haunting melodies during suspenseful scenes or the edgy rock tunes accompanying heartfelt exchanges, the soundtrack is an essential part of the film's storytelling. Visually, the film is stunning, with breathtaking landscapes and intense action sequences that are both thrilling and beautifully choreographed. The storyline kept us engaged with its unexpected twists and emotional depth, culminating in a satisfying and heartfelt conclusion. While the film's ambitious mix of genres might not be for everyone, we found it to be a captivating and well-executed cinematic experience. Whether you're a fan of science fiction, romance, or action, \"The Gorge\" offers something for everyone. Overall, \"The Gorge\" is a thrilling and heartfelt journey, elevated by its perfect soundtrack and the tender, romantic moments that carry an edge, making it a film that you will watch again."
  },
  {
    "rating": "3.5/5",
    "review": "The Gorge is an visually striking action thriller with an great unique concept and a great cast. While it starts off a bit slow, once it picks up it's very interesting, the chemistry between the leads are one of the film's biggest strengths. The action is pretty solid, with good special effects especially on the monster designs. The cinematography is really immersive, adding to the film's overall vibe, and the soundtrack is a bop. It really feels like this film should have been in cinema/theatres instead of straight to streaming it really deserved the big screen treatment. The second act is where the movie truly shines, keeping the tension and excitement high. However, the third act, while still engaging, unfortunately loses a bit of the momentum and didn't hold my interest as much as the middle of the film. It's a close call between a 4 and a 3.5, but ultimately, 3.5/5 felt right."
  },
  {
    "rating": "3.5/5",
    "review": "Overall great, but not must-see. The first half of the movie was certainly the better half, while things were still somewhat mysterious. Once the action starts, you could watch it at 2x speed without feeling like you've missed a thing."
  },
  {
    "rating": "3.5/5",
    "review": "It's okay, but the trailer already gives away most of the plot."
  },
  {
    "rating": "2/5",
    "review": "I had high hopes considering the cast, but this is a classic example of how corny writing and ridiculous plot holes can ruin the experience. The cast seemed equally bored and unconvinced. Thanks to the middle school level script (and a terrible fake Russian accent), things that should have felt high-stakes felt forced; things that should have been genuinely horrifying were cartoonish and goofy. The entire film was fighting to convince me to accept it's world...all the way to the credits."
  },
  {
    "rating": "4/5",
    "review": "Shocker of the year so far! Gotta love a Rom Action Horror! It’s even better because the romance only about 30-38 mins in and after its go time"
  },
  {
    "rating": "1.5/5",
    "review": "Terrible. I only saw this movie because I love Anja Taylor-Joy, and this is the first time I have not liked one of her films. It didn't' start off bad, but after the first hour time dragged and I was anxious for the movie to be over. I would only recommend this movie for a date night for ages 18-21. No one else would like it."
  },
  {
    "rating": "0.5/5",
    "review": "The comments section is more entertaining than the second half of this movie. It's like a producer came into the room and yelled \"more skull spiders!!!"
  },
  {
    "rating": "5/5",
    "review": "Really enjoyed it good dumb fun. Like two movies both of them good."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute dog shite. Laughably bad, the poor caliber of the writers shines through every piece of dialogue and the scenarios. Not to mention the plot is just plain idiotic and the \"monsters\" not really scary or intimidating, just dumb in both behavior, conception and design. Shite film. \"Movies\" like this is an embarrassment to cinema that not even the two charismatic lead actors can salvage."
  },
  {
    "rating": "0.5/5",
    "review": "So much promise... the trailers, the first 30 minutes give or take... then... pure stupidity!!! This movie turned into such a dumb movie, dumb premise, dumb choices, dumb baddies, and major plot holes. What a waste of good actors AND my time!! Don't waste your time with this excuse of a movie!"
  },
  {
    "rating": "5/5",
    "review": "I loved it might watch it a 2nd time"
  },
  {
    "rating": "1/5",
    "review": "It’s obvious going in there will be giant plot holes. It’s one of THOSE movies.The writers aren’t gonna waste time with a tight script. But this movie was absolutely ridiculous! It’s rare when there are more holes than there is script. But that’s the case with this one. If you’re in the mood to turn your brain off completely, not snooze mode, but all the way off, you might enjoy the action. But otherwise, nothing in the plot makes even a shred of sense. Obviously the writers don’t seem to care, so I’m not sure if that reflects poorly on us or them."
  },
  {
    "rating": "4/5",
    "review": "An enjoyable action film with a minimal cast and interesting storyline. Won’t change your life but a great looking film and the leads are believable in their respective roles."
  },
  {
    "rating": "5/5",
    "review": "Totally entertaining and fun to watch. Overlook the script and enjoy the ride, action, romance, betrayal all wrapped in one package of fun. Good actors makes it a must see."
  },
  {
    "rating": "3.5/5",
    "review": "A fun time movie with action and excitement. It brought a good story and gave you a popcorn crusher. I would like to see if they could find a way to add to this"
  },
  {
    "rating": "1.5/5",
    "review": "Blech. Didn’t make it 15 minutes so take this for what’s it worth, not much, just like the movie. Obvious question first 15 minutes in…..so, the US found it okay to drop two nuclear bombs onto Japan to end WW2, but didn’t bomb in the Gorge at that time? And if it’s not explained up front…meh. Turned it off. Went to bed. More than one star because I respect the actors..they have to make a buck"
  },
  {
    "rating": "3.5/5",
    "review": "As a huge fan of everything APPLE TV does I was counting the days from this one come out... and I'm not usually like that. The premise is amazing (impossible not the watch the trailer), the main cast is awesome (also their chemestry)... so there was everything to become a hit. But didn't happen! Everything was great until they went to the gorge... What a missed chance.."
  },
  {
    "rating": "4/5",
    "review": "Action packed and romantic!"
  },
  {
    "rating": "3.5/5",
    "review": "I thought I wouldn't like the movie, but in the end I actually really enjoyed it. I'll probably watch it again."
  },
  {
    "rating": "4.5/5",
    "review": "This flipping movie is so good, Miles Teller is so awesome sauce and Anna Taylor-Joy is hot"
  },
  {
    "rating": "5/5",
    "review": "I was pleasantly surprised to find this romantic comedy so exhilarating. The special effects were extremely well done. There’s a scene in a forest with some zombie horses that absolutely is breathtaking. The chemistry between our two actors is palpable."
  },
  {
    "rating": "5/5",
    "review": "A masterpiece of epic proportions, this movie has you dialled in the whole time, and on top of all of the action, adventure and agog it’s a love story too!"
  },
  {
    "rating": "3.5/5",
    "review": "This movie wasn’t quite what I was expecting, but it still made for a good time! Miles Teller and Anya Taylor-Joy's performances were the true highlights, adding depth to their characters and bringing an unexpected romance to life. While the trailers portray this as a suspenseful action thriller, it was the slow-building relationship between these two that truly stood out. The action and suspense were definitely present, but the romantic storyline definitely stole the show. At its best, the film delivers an original and compelling mix of suspense and romance. At its worst, it’s a decent watch carried throughout by great performances."
  },
  {
    "rating": "3.5/5",
    "review": "o filme tem uma premissa interessante, defender um desfiladeiro onde criaturas lovecreftianas abitam, o mistério inicial a estética, te prendem bastante no começo, uma pena o filme não conseguir manter essa ideia ao longo dele, o ato 4 quase me fez dar uma nota mais baixa, muito viajado e acabou ate mesmo tirando o brilho dos homens ocos, mas em compensação o romance desse filme é muito bom, os personagens tem uma baita química , tanto Teller quanto a Taylor-joy entregaram ótimas atuações, uma trilha sonora boa, falo sem medo, a química desses dois salva muito esse filme"
  },
  {
    "rating": "3.5/5",
    "review": "Special effects and props are pretty damn good. I smell talented artists putting real effort into work? I’d play it if it was a video game, was an okay movie with a a Cooky concept. Overall entertaining 🫲😯🫱"
  },
  {
    "rating": "3/5",
    "review": "C.G.I. is first rate, but the story is not. The convoluted love story just doesn't mesh well with the Sci-fi action parts of the film. If you have nothing else to watch, The Gorge is a DECENT film, but NOT A GOOD ONE."
  },
  {
    "rating": "3/5",
    "review": "This story had a great setup and premise. Unfortunately it does not payoff. They didn't spend hardly any time in the gorge, and what was down there felt like I was watching a video game. The movie had a lot of promise. If only they had done something similar to 'Annihilation' and made it creepier. I had a lot of rolling eyes moments. Glad it was streaming."
  },
  {
    "rating": "1/5",
    "review": "Beautiful people, terrific effects, stupid movie"
  },
  {
    "rating": "5/5",
    "review": "one of the best movies I saw recently in terms of atmosphere and story. there were not a moment in film where I was bored or uninterested. I really liked the story and pace. 5 stars."
  },
  {
    "rating": "5/5",
    "review": "It nails it in fun and romance. Also in thrill and action."
  },
  {
    "rating": "2/5",
    "review": "The Gorge tries to be too many things - Romance, horror, mystery, action. It ends up forgettable."
  },
  {
    "rating": "2.5/5",
    "review": "The Gorge is a brilliant concept with multiple roles and multiple parts. On the one hand, we have two of our protagonists kindling love from a distance, and on the other, “the gorge” that keeps them apart. Essentially, what seems to be a simple plot, is architecturally a psychological one, as both characters are insinuated to keep their eyes upon one another for the dangers that lurk beneath. Zach Dean’s writing for the film was a multi-faceted one, comprising multiple acts, and story arcs to be fulfilled. Building an entire world and its mythology for audiences to see. Neglecting that it could take from, what was instantaneously, a simply marvel concept to begin with. Scott Derrickson’s direction does little to no mitigation to the script, condensing the film down to a two-hour film that meddles in its beginnings only to run to its finish. Miles Teller & Anya Taylor Joy both salvage this film with their notably convincing charm, able to draw human moments from what would otherwise be unrelatable subjects to a film."
  },
  {
    "rating": "4/5",
    "review": "This movie is a perfect date-night horror. It is certainly not very thought provoking, nor is the dialogue very strong, or the references to whiplash and the queen's gambit even remotely subtle. Despite this, it is a great deal of fun to watch, especially one done so with a significant other, to cash in on those cheesy romantic upswings."
  },
  {
    "rating": "1/5",
    "review": "CRINGE is the word i wanna say it...i dont normally write reviews but this movie just makes me feel what a waste ....story plot has great potential but this movie how they made ruined the story...the romantic part was so cringe..."
  },
  {
    "rating": "2/5",
    "review": "Video game vibes and a fun concept, everything around it was just lazily done and badly paced."
  },
  {
    "rating": "3.5/5",
    "review": "I thought the movie was decent. Tactical romance. Revealing truths. Funny, action, adventure, love suspense."
  },
  {
    "rating": "3.5/5",
    "review": "Great movie, Don't always listen to critics. See it for yourself first."
  },
  {
    "rating": "4.5/5",
    "review": "Simple and solid. Great graphics without macho presence. All in all a great movie."
  },
  {
    "rating": "5/5",
    "review": "Entertaining, excellent acting and a romantic drama that helps unravel the enigma of the unknown, apocalyptic."
  },
  {
    "rating": "3.5/5",
    "review": "Fun at first, though totally illogical and full of plot holes, it then just degenerates into silliness, and you start longing for it to be over…"
  },
  {
    "rating": "4.5/5",
    "review": "Spoiler. Superb up till they settled for it being a man-made virus rather than actual hell or at least something ancient. Would have been much more interesting and kept up the intensity, like the creatures are trying to pull them into hell. Once evil was taken out of the picture it became a still decent but much more basic action film, where they then needed to better develop the bad guys but kinda just skipped over them from there. Good romance."
  },
  {
    "rating": "0.5/5",
    "review": "This utter rubbish of a film is a random mix of genres with a ridiculous non-plot, embarrassingly written dialogue, awful awful awful acting, and utterly boring. Why would anyone hire Anya double barrel name to protect humanity? Who brings leather miniskirts on a military mission? More to the point, who cares? These characters are so uninteresting it's like they live in a video game. Feels written by an AI on drugs"
  },
  {
    "rating": "5/5",
    "review": "Immaculate. I just loved it. I want so much more. Gimme more of the romance, action, story, all of it. I loved the movie, Anya Taylor-Joy is always great at action badass characters. and Miles Teller made me fall in love with him in this movie. I want a second movie, they could definitely do a good sequel without making it feel forced. Maybe something along the lines of the company is still at it and has managed to make some semblance of augmented soldiers and is now after the 2 sniper pros that put a stop to them before. Idk it could be really really good!"
  },
  {
    "rating": "2/5",
    "review": "Good background movie."
  },
  {
    "rating": "2.5/5",
    "review": "The premise was promising; the first act really gives you a lot of questions and a lot of anticipation. The romance was cute, all through out I guess. As cute as can be expected from a romance between two seasoned killers. The second act started out awesome, the change of color does a good job of switching up the anxiety gears. But… not enough came out about the hollow men.. we saw how they were made, but I felt that we could have benefitted from the why they do what they do now. Like when Anya was taken and then hung up, surely that creature had motivations. Perhaps that could have taken us deeper into the horror potential of the film. Loved the strange nervous system hive mind contraption; hated that it was killed off too soon. Again, more lore perhaps. The escape was very interesting to watch, so were the fight scenes. Then the third act seemed to.. regress… big baddie dies just like that..arghhhh…, third act dropped the ball… loved the stakes in the film for the most part; was hoping for infection threat to be more than just something they talk about. …. Overall, it is enjoyable. But could be better. PS: chemistry between the leads was just okay… just…"
  },
  {
    "rating": "1/5",
    "review": "Confused what it is and badly executed though effects and some shots are quite good - don’t bother unless you want something brain numbing"
  },
  {
    "rating": "4.5/5",
    "review": "It was nice. I would've liked some more plot development on the actual Gorge. Some lore would've been appreciated. As expected, the cast was amazing. The Hollow Men were quite terrifying. Sit back and enjoy."
  },
  {
    "rating": "3/5",
    "review": "**Review of *The Gorge* (★★★☆☆)** I had high hopes for *The Gorge*, and while it delivers in some areas, it left me a little underwhelmed by the end. First off, the cast is fantastic — Miles Teller and Anya Taylor-Joy have great chemistry, and they really sell the romance and tension. Scott Derrickson knows how to craft atmosphere, and the first two acts really nail that mysterious, slow-burn thriller vibe. The setup of two operatives on opposing sides of a dangerous gorge is intriguing, and there are some genuinely effective jump scares. But then the third act hits, and it kind of falls apart. It shifts gears from a mysterious, atmospheric thriller into a generic action movie — explosions, shootouts, and all. The lore behind the creatures felt a bit thin and predictable; I kept hoping for some deeper twist or reveal that never came. The pacing was also all over the place — it starts strong but starts to drag in the middle before rushing through the climax. Honestly, the whole time I kept thinking this would make an amazing video game — the setting, the tension, the action — but as a movie, it just doesn't quite stick the landing. Still, worth a watch for the cast and early tension."
  },
  {
    "rating": "3.5/5",
    "review": "The Gorge boasts a creative premise, elevated by the undeniable chemistry between Miles Teller and Anya Taylor-Joy. Strong practical effects and solid action keep things engaging, though the film loses steam in the back half once the mystery unravels—but it’s still a solid choice for a night in"
  },
  {
    "rating": "3/5",
    "review": "I was enjoying this film until I saw what was down in the gorge. It became too silly. And why only two people? Why? Just why? Passed some time but couldn't watch it again."
  },
  {
    "rating": "5/5",
    "review": "If you miss the action sci fi movies of the 90s and 00s this one is a must watch."
  },
  {
    "rating": "5/5",
    "review": "https://youtu.be/wCHVS1t4Sns?si=a7isfBnxUom6oq6Q"
  },
  {
    "rating": "3/5",
    "review": "The performances and chemistry of Teller and Taylor-Joy allow this movie punch above its weight. The script is not awful but has enough potholes to leave a viewer to move one by the second act if not for actors. The third act mild twist - minus the cliche ending - was a definite step forward too."
  },
  {
    "rating": "4.5/5",
    "review": "Really entertaining, both actors are favorites of mine (top gun maverick and furiosa both great movies too). Great chemistry between them and great acting. Mix of sci-fi, action, romance and suspense. Will probably watch again"
  },
  {
    "rating": "0.5/5",
    "review": "Atrocious excuse for a film how are the ratings so high? It’s tone deaf, can’t find it’s own rhythm and just so bad wtf"
  },
  {
    "rating": "1.5/5",
    "review": "I moped out when these world class snipers started shooting bottles off each others heads from across the gorge for fun."
  },
  {
    "rating": "5/5",
    "review": "Fun action packed. two great actors. Will watch again in the future."
  },
  {
    "rating": "2.5/5",
    "review": "A story of two halves, two totally different Genres. First half is a beautifully crafted romance between two elite snipers sitting a gorge apart, and second half is as boring as any other low budget movie. It's end could have been much better if they had tried a little bit"
  },
  {
    "rating": "1.5/5",
    "review": "What in the Baggins is this? The plot: two exceptionally good looking people, both world-class snipers (of course), she in sexy clothes (of course), are hired to guard a mysterious gorge. Proficient in every weapon known to man, the handsome duo fall in long-distance love, fight off saber-wielding Evil Ent/White Walkers riding dead horses in a blasted out Mirkwood Forest replete with tree spiders – when not busy, the Ents spawn in slimy cocoons. Our heroes beat off an army of these devil creatures, blow stuff up, topple down waterfalls and hoist themselves up perpendicular cliffs with nary a scratch. At some point the heroes happen upon a deserted-for-decades bio-chemical warfare lab whereupon they become bio-chemical computer experts with know-how to operate every machine since the Cold War. Lo and behold – the dastardly plan is revealed: it’s a plot to breed super soldiers lead by The Dark Corporation. A bit more fighting goes on; they blow up The Gorge and the Dark CEO, nevertheless they’re fine, find time to say “I love you” and meet up in a Jason Bourne Mykonos finale somewhere on the coast of France."
  },
  {
    "rating": "3.5/5",
    "review": "Some love stories unfold in candlelit rooms, against the backdrop of sunsets or in the midst of grand orchestras. But The Gorge dares to ask—what if love is born in the heart of darkness? What if romance isn’t a fleeting whisper but a burning light in an abyss so deep it swallows everything? Scott Derrickson’s The Gorge is marketed as a sci-fi action thriller with horror elements, but at its core, it is a story about connection, about two souls colliding in a place where neither should have ever met. Miles Teller and Anya Taylor-Joy play two elite snipers stationed on opposite sides of a vast, ominous chasm, each tasked with an assignment that quickly becomes something much more profound. The gorge itself—a hollow, endless void—becomes a metaphor for both separation and destiny. From the moment the protagonists first interact, the tension is palpable. At first, it’s the natural wariness of two professionals sizing each other up, trying to determine if they are friend or foe. But as the film progresses, something unexpected happens: warmth begins to creep in. The film cleverly uses its sci-fi horror elements not just for spectacle but as a way to push these two closer together. In many ways, their growing affection is more thrilling than the gunfights or supernatural elements lurking beneath the surface. There is something undeniably intoxicating about the way their relationship unfolds—hesitant at first, then urgent and undeniable. The danger surrounding them doesn’t just heighten the stakes; it amplifies every glance, every whispered conversation over the radio, every shared silence. The gorge itself is a stunning paradox. It is, by all definitions, a lifeless place. Cold, dark, and vast, it represents separation, danger, and death. But within that void, something extraordinary happens—love flourishes. The film plays with this contrast beautifully, turning what should be a symbol of despair into one of fate. Without the gorge, these two would have remained strangers, caught up in their own separate missions. The very thing that threatens to consume them is also what allows them to truly see each other. There’s a poetic irony in that, one that elevates the film beyond just another sci-fi thriller. The Gorge isn’t just about surviving the abyss—it’s about proving that even in the bleakest circumstances, love can take root and thrive. Perhaps the most heartbreaking aspect of The Gorge is the idea that its two leads are, in the grand scheme of things, expendable. They are soldiers, trained professionals, people whose lives are not meant to be written in history books. And yet, within this hidden war, within this forgotten battlefield, their love story becomes something monumental. This is what makes The Gorge stand out. It doesn’t offer a fairytale romance. It doesn’t promise a happy ending. Instead, it delivers something raw, something urgent—love that exists because it has to, because it is the only thing that makes the struggle worthwhile. Teller and Taylor-Joy bring this to life with performances that are both restrained and deeply emotional, never overplaying the romance but letting it simmer beneath every scene. Is The Gorge a perfect film? No. Some will find its sci-fi elements overwhelming, others may wish the romance had been given even more room to breathe. But for those who see past the gunfire, past the horror, past the darkness, there is something undeniably powerful at its heart. This is not just a film about survival—it is a film about meaning. About how, sometimes, love is not found in grand gestures or ideal circumstances. Sometimes, love is forged in the most unexpected places. Sometimes, love is the flickering light in the deepest abyss. And that? That’s the kind of story that stays with you."
  },
  {
    "rating": "3.5/5",
    "review": "The story of two elite Snipers who are brought in to protect their respective sides of a deep, dark, mysterious Gorge from it's terrifying inhabitants. The film stars Miles Teller (Levi, Sniper from the West), Anya Taylor Joy (Drasa, Sniper from the East), and Sigourney Weaver (Bartholomew, Levi's recruiter). The Director Scott Derrickson does a marvelous job with the story of isolation, fear, and the fight for survival. There is great chemistry between Joy and Teller which definitely adds a nice touch to this Romance/Horror film. The Cinematography and special effects will definitely give you goosebumps or at east it did for me. Overall it is a really good film lead by three fantastic actors."
  },
  {
    "rating": "5/5",
    "review": "I haven’t seen this around anywhere , knew nothing about it until I came across it scrolling for movies to watch. I absolutely LOVED this movie. It took me by surprise how bloody good it was , sci - fi lovers this one is for you. This is perfect , entertaining, thrilling everything else."
  },
  {
    "rating": "5/5",
    "review": "The Gorge — Darklake — When even as far as Wuhan from Fort Doom/Detrick and Cold Springs Harbor Laboratory isn't far enough — von Verschuer, von Braun, Schreiber, Strughold, Hagen, Blome and Paperclip at their best — Still today? — And great movie! First time I've seen Miles Teller and Anya Taylor-Joy in a movie, fantastic and even sexy, and Sigourney Weaver adds real class. First time glad to see her go :( Jack Coyle of the Associated Press is working for 'them' ;) Sad part is, in a way... But audience ratings rule."
  },
  {
    "rating": "3.5/5",
    "review": "i really liked it - i liked the premise, i thought it was executed well, & i thought all parties played their parts well. i enjoyed it."
  },
  {
    "rating": "0.5/5",
    "review": "These people should never be allowed to make a movie ever again."
  },
  {
    "rating": "3.5/5",
    "review": "It was good to watch an uncomplicated linear story with nobody trying to be the next great film. It just a solid narrative story with a bit of action, some fantastical elements to bring it all together, mystery and a little romance to spice it up. We have a very small cast, limited sets and special effects which all goes with the narrative well. This would have gone bad if it had a bigger budget, but this is just a solid, entertaining movie. Everyone from the writing directing. Camera, actors, special effects all just delivered quality. I had given up on Hollywood been able to create these sort of movies. I assume the budget was small and all the parts just work."
  },
  {
    "rating": "4/5",
    "review": "The Gorge Ist eine Computerspiel Verfilmung von einem Spiel, dass es nicht gibt. Während die erste Hälfte einem Point & Click Adventure entsprechen würde, wird die zweite Hälfte zu der Resident Evil Verfilmung, wie sie schon immer hätte sein sollen. Die Darsteller sind typische Survival Spielefiguren. Mit dieser Haltung wird der Film ein Spass. Macht es euch zu Hause gemütlich. Kerzen. Fressi Fressi. Trinki Trinki. Und schaut euch das an. Ein wenig \"Ding aus einer anderen Welt\" Gut gemachte Creatures. Stimmungsvolle gelungene Bilder und Atmosphäre. Und auch das Sigourney Weaver (Alien) mitspielt, ist ein gutes Zeichen. Fortsetzung, aber auch gerne ein Spiel zum Film, kann gerne kommen. Top"
  },
  {
    "rating": "5/5",
    "review": "A film that is something fresh and entertaining...this film needs more credit than it has"
  },
  {
    "rating": "3.5/5",
    "review": "The final action sequence isn't that impressive but the first 50 minutes are pretty great"
  },
  {
    "rating": "3.5/5",
    "review": "The Gorge is a wild mix of genre elements—sci-fi, romance, horror, and adventure all packed into one. While it may sound like a chaotic mess, for the most part, the collaboration between Miles Teller and Anya Taylor-Joy remains quite enjoyable to watch."
  },
  {
    "rating": "5/5",
    "review": "Good acting.. nice movie.."
  },
  {
    "rating": "5/5",
    "review": "good movie, my fav❤️‍🔥❤️‍🔥"
  },
  {
    "rating": "5/5",
    "review": "a gnarly monster flick with memorable beasties galore."
  },
  {
    "rating": "5/5",
    "review": "The Gorge is a thrilling mix of action, romance, and sci-fi with stunning visuals and a gripping story. The lead actors have incredible chemistry, making the emotional moments hit just as hard as the action. With breathtaking cinematography, intense sequences, and unexpected twists, this film is a must-watch. Highly recommended!"
  },
  {
    "rating": "3.5/5",
    "review": "Miles and Drasa are snipers hired to keep an eye on a gorge where strange monsters try to come out of it. They eventually fall in love even though they’re on each side of the gorge. Pretty good action sequences and special effects but the falling in love part it super cheesy and almost unbearable since it’s supposed to be an action horror survivor story. 🍿🍿🍿🍿/5 on Apple TV +"
  },
  {
    "rating": "0.5/5",
    "review": "Who came up with this, Peter Griffin? It literally, feels like written and directed by Peter Griffin."
  },
  {
    "rating": "3/5",
    "review": "Totally fine little sci-fi, action, horror movie that seems to understand what it is and doesn't overstay it's welcome. Feels like the type of thing I would have really liked if it was 13 years old and going to the theatre with my buddies."
  },
  {
    "rating": "5/5",
    "review": "Fantastic concept. In a time where it’s rare to find sci-fi movies with a hint of romance this movie is it. Movies can’t always be perfect and this is worth the watch."
  },
  {
    "rating": "3.5/5",
    "review": "Worth watching if it's on a streaming service you already have, but it's a bit confused. The first half is mostly romance, then it rather abruptly switches to mostly sci-fi action/thriller. This also makes the pacing rather awkward: the first half feels like a drawn out introduction, even though it's probably the better half of the film."
  },
  {
    "rating": "5/5",
    "review": "Sangat bagus keren film nya"
  },
  {
    "rating": "4.5/5",
    "review": "Good acting and good story. Perfect movie!"
  },
  {
    "rating": "5/5",
    "review": "I just watched The Gorge, and I have to say, it completely blew me away. From the very first scene, the film pulls you in with its stunning visuals and gripping action. The story centers around two characters on a dangerous, high-stakes mission, and the chemistry between them is electric. The mix of intense, edge-of-your-seat moments and emotional depth kept me hooked the entire time. What I really loved was how the film balanced breathtaking cinematography with heart-pounding suspense. The action sequences were so well-done, but it wasn’t just about the adrenaline; there were moments that genuinely tugged at my emotions, making me care about the characters' journey even more. I also appreciated how the film doesn’t rush through the plot, taking time to build tension and give us a deeper connection to the characters. The performances were top-notch, and I really felt for the characters as they navigated the ups and downs of their perilous situation. It's a movie that keeps you on your toes, and by the end, I was left thinking about it long after the credits rolled. If you’re into thrillers with great character development and jaw-dropping moments, The Gorge is definitely a must-watch."
  },
  {
    "rating": "5/5",
    "review": "Good movies, the thriller vibe from this movie 5 star, worth it to watch"
  },
  {
    "rating": "5/5",
    "review": "I’m absolutely not into romance movies whatsoever. I’m one that if it’s not scary it’s not worth watching. However, this has the perfect mixture of scary (tense, worrisome) moments and the romance is a good plus. Actors are genuine. Must-See!"
  },
  {
    "rating": "5/5",
    "review": "Exciting, keeps your attention, great acting"
  },
  {
    "rating": "4/5",
    "review": "로맨틱한 시작, 중반부 장르 반전 되는게 흥미로움. 아냐 테일러 조이의 캐스팅이 좋았음."
  },
  {
    "rating": "5/5",
    "review": "the george is a nice movie"
  },
  {
    "rating": "5/5",
    "review": "this movie very enjoyable, the storyline is not boring, i hope this movie gets good ratings"
  },
  {
    "rating": "5/5",
    "review": "Scott Derrickson’s The Gorge is a winter treat. Levi (Miles Teller) and Drasa (Anya Taylor-Joy) are elite snipers from different world powers who have been assigned to guard the titular location, a massive canyon in an undisclosed country. While Levi is stoic and strict in his routine, Drasa is the opposite: playful and playful. She initiates the canyon-crossing flirtation by blasting “Blitzkrieg Bop” at full volume and challenging Levi to a shooting contest. Levi arguably lets down his well-trained guard too soon, but we’ll have to see the movie."
  },
  {
    "rating": "5/5",
    "review": "amazing feel so good"
  },
  {
    "rating": "4.5/5",
    "review": "Very good movie. Love the action in this movie"
  },
  {
    "rating": "4/5",
    "review": "I rather enjoyed it it was a little messy. A fresh new look at mash-up instead of recycled movies"
  },
  {
    "rating": "2/5",
    "review": "A rushed romance, predictable plot but interesting worldbuilding. I would've enjoyed more scenes in the gorge and more lovecraftian horror and suspense. So ist hast potential for a series or a remake."
  },
  {
    "rating": "4/5",
    "review": "Nice start, mysterious middle, a bit sucking CGI end. But overall nicely done action movie with developing relation over the gorge. Made my evening fine."
  },
  {
    "rating": "5/5",
    "review": "This is the best combination of romance and action in a movie currently on of the best movies of 2024 and 2025, it is so entertaining and very good choice of actors, it was seeing Anya with Miles, great movie and I would definitely watch many times."
  },
  {
    "rating": "1.5/5",
    "review": "What starts as a seemingly intelligent and classy thriller soon descends into a cliched and silly cgi-fest. Give this a wide berth."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed it alot. For a very small cast it pulled me into it. Defiantly a date night kinda movie"
  },
  {
    "rating": "5/5",
    "review": "Best movie so far this year amazing actors."
  },
  {
    "rating": "3/5",
    "review": "Part love story, part sci-fi action thriller. There’s a certain charm to this film and it’s mostly due to the chemistry between the 2 leads. All my gamers (especially my action horror junkies) will get a real kick out of the 2nd act."
  },
  {
    "rating": "5/5",
    "review": "This movie is the perfect combination of fear, suspense and romance."
  },
  {
    "rating": "3/5",
    "review": "Watching the trailer for The Gorge I gathered that it would be a unique movie as it tries to blend monster horror, romance, and action-adventure—a combination created to offer a light, escapist experience after a long day. The film's original premise sets it apart as a potential background watch during a casual meal or a relaxed evening, daring to defy traditional genre boundaries. At first glance, the film’s bold ambition is evident. It shifts gears abruptly—from quirky, rom-com moments to bursts of action—mirroring the unpredictability of its narrative. There are fleeting hints of innovative storytelling, it feels a bit like Annihilation and When Harry Met Sally. However, these transitions often feel more like disjointed experiments than a cohesive blend of genres. As the narrative unfolds, several shortcomings emerge. The film leans on outdated clichés—such as contrived military salutes and other hackneyed moments—that sap its credibility. Early scenes border on cheesiness, undermining the film’s intended tone and leaving the horror elements underdeveloped. The chemistry between the leads occasionally shines through, it is often overshadowed by a predictable storyline and mechanical performances. Notably, Anya Taylor-Joy, whose involvement initially raised high expectations, seems to be navigating familiar territory rather than delivering the nuanced depth that I had hoped for Moreover, the dialogue frequently falls flat, and the film’s heavy reliance on CGI and exaggerated sound effects creates a dissonance, particularly during extended nighttime visuals that leave the audience disoriented. Despite high production values and a few standout moments, the film’s rushed ending and uneven script ultimately prevent it from reaching its full potential. The Gorge for me is neither a complete triumph nor an outright failure. It offers enough entertainment to serve as a fun, if imperfect, diversion—ideal for when you’re ready to switch off your analytical brain on a rainy afternoon. However, for something that started off strong and combined the unique genres, a more cohesive narrative, better script, as well as the right balance of CGI, this could have been a great film. A good exercise in showcasing restraint rather than over doing it all. A fun, nothing too serious flick to chuck on on a rainy day 6/10"
  },
  {
    "rating": "4.5/5",
    "review": "I put this movie on to have it playing in the background while I slept but I couldn't keep my eyes off of it and ended up watching the entire thing. It was a good movie. Some parts were typical of a movie, but overall it was a good watch. Miles Teller was the reason I kept watching. Great actor and he seems to have gotten in pretty good shape for it."
  },
  {
    "rating": "4.5/5",
    "review": "Exciting, keeps your attention, great acting"
  },
  {
    "rating": "2/5",
    "review": "The leads were okay. Miles was great but unfortunately Anya Taylor Joy isn't the most convincing as someone who's head over heels in love. The tone of this film was so confusing, it started off as a mystery, then turned into a full blown romance. Like actually romance, cheesy music and dancing and all of that. Then it turned into some conspiracy mutant action in the second act. The cgi left a lot to be desired and the antagonist wasn't even threatening. Everything that happens here is \"super easy barely an inconvenience\". If the antagonist was more developed it would have bumped this film up to a 3/5. If The Hollow Men turned out to be suffering souls looking for help that would've made the conflict a lot more interesting. All in all this is like a Romeo and Juliet sci-fi action flick. Very meh"
  },
  {
    "rating": "4/5",
    "review": "Overall solid movie, nice action. the storyline was really interesting and didn't give away too much at the start, you can figure out where it's going but not how it's going to get there. The romance stuff was rushed but still there was nice chemistry between the two leads, not bad at all."
  },
  {
    "rating": "2/5",
    "review": "illuminati psyop. They like to tell us what is."
  },
  {
    "rating": "1/5",
    "review": "Lost some brain cells watching this. Fairly disappointing performances especially by Miles Teller. Cheesy depictions of spooks/vets. But most importantly, the story is super lame and empty. Strikes me as a knock-off of Annihilation but dumbed down by several orders of magnitude. Do not recommend unless you're just looking for meaningless explosions."
  },
  {
    "rating": "5/5",
    "review": "The film's crowning achievement lies in the effortless, yet unexpected, spark of chemistry between the leads. This serendipitous connection elevates the movie to a wholesome masterpiece. A breath of fresh air in a recent drought of memorable cinematic experiences."
  },
  {
    "rating": "4/5",
    "review": "Good movie worth the watch"
  },
  {
    "rating": "4/5",
    "review": "It was good start off little boring I really wanted movie speed up at gorge parts they where better parts and picked from time to time when things aliens what you call them attack at times I expected movie take place half in gorge and half on top it’s still good defiantly did not expect it be romance kinda felt Romeo and Juliet theme war movie recommend giving it chance action scenes make pace better"
  },
  {
    "rating": "1.5/5",
    "review": "The premise is fun. Story and ending leave very little to the imagination. Does not close the corporate takeover. Start with the suspense build good then falls off very quickly."
  },
  {
    "rating": "2.5/5",
    "review": "I started it so I had to finish it, which seems to be how the movie’s creators felt as well."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie!! It has the action, nonflashy romance, and interestingly enough plot that you want to see in a movie of this kind. There is no ruining-the-mood plot-twists nor ideological speeches about good or evil, it's just the characters dealing with their own circumstances and using the best of their skills to survive. Nice!! It's been a while since I've watched something this good in such a simple way!! There is no irrelevant drama, and I had no headaches nor had to yell at the TV because a character did something illogical or dumb, it gave me what I needed to watch for a great weekend. Cheers!!"
  },
  {
    "rating": "3/5",
    "review": "Enjoyed the film, despite glaring script issues. The acting was what we come to expect from these two phenomenal leads. The story/script is honestly mid but has a great premise just poorly executed. Cliche character tropes and what's revealed is even worse and the most expectable outcome. Despite these major flaws The Gorge is a fun movie and great for casual audiences. out of 100 id give it a 67"
  },
  {
    "rating": "3/5",
    "review": "The whiplash-inducing manner in which this film jumps from genre to genre would almost require a health hazard warning. The fact that it still somehow holds together and works is testament to Scott Derrickson's sheer determination and slick direction, not to mention his effective, perhaps unashamedly brazen, wrangling of logic-defying genre movie tropes, of which there are many, that manage to make this viewer happy to overlook them but not before some serious eye-rolling. The film begins intriguingly as a high concept mystery thriller as Miles Teller's American ex-Marine Levi and Anya Taylor-Joy's Lithuanian assassin Drasa were recruited separately for their sniper skills to guard opposite sides of a huge mysterious gorge. Soon, some seriously long distance flirting develops into a full-on romantic interlude whilst we discover that sensitive Levi writes poetry and Drasa is grieving over her dying father. Thankfully before this turns into an outright weepy, Derrickson, who's known more for his horror movies and the first Doctor Strange, reverts back to what he does best as all hell breaks loose in Zach Dean's screenplay and we find out what's hidden in that gorge is an Upside Down version of Oppenheimer with a bit of Sleepy Hollow thrown in for good measure. One of those films that doesn't really make any sense if you start scrutinizing the details (Do they have regular Amazon delivery of steaks and champagne?) but if you can go with the flow, it's an enjoyably silly and reasonably well made film, where everybody involved is aware that they are better than the material they're given, yet still give it their all to try to make it work. Essentially a B-movie with a A-list cast and budget and for a direct-to-streamer movie, it's comparatively better than a lot of the nonsense we've had before."
  },
  {
    "rating": "1.5/5",
    "review": "Love the actors but the movie was shallow and quite frankly a huge missed opportunity for what could have been an amazing movie. Sad."
  },
  {
    "rating": "3.5/5",
    "review": "Jump scare moments and silent hill vibes"
  },
  {
    "rating": "0.5/5",
    "review": "Dumbest movie. Don’t waste your time."
  },
  {
    "rating": "3/5",
    "review": "The Gorge was watchable. The acting was decent. I’m not very familiar with Miles Teller, but he did a decent job with this role. Anya Taylor-Joy was, as usually, delightful. Their chemistry was acceptable. The weakest part of the “acting” was the dialogue (not the actor’s fault). The writing needed more work, especially after the story moved down into the Gorge. The plot was generic and dull and just stopped with no wrap up. In contrast, the music was good. I think the ending should have gone the other way; that would have fit better with the themes of the story."
  },
  {
    "rating": "3/5",
    "review": "Dragged on a bit long. Found the protagonists to be likeable. The story was still somehow lacking, it wasn't awful but not great either. A solid 3 stars."
  },
  {
    "rating": "1/5",
    "review": "Somebody got paid for this movie. No matter how much it was too much. One of the worst. Rotten Apples and Rotten Tomatoes describe this overacted, under written Sci-fi cliche. Meet me in France to discuss further. Purge the Gorge.."
  },
  {
    "rating": "5/5",
    "review": "Comfort food in movie form. In a landscape of remakes, sequels and superhero slop we finally get a big star original film with no BS and a wholesome core. It’s not high art but it’s not trying to be. It’ll universally satisfy fans of action, romance, sci fi, horror, it’s ticking every box. More of this please!"
  },
  {
    "rating": "5/5",
    "review": "Definitely worth a watch"
  },
  {
    "rating": "5/5",
    "review": "It realy was a great movie,the actors,the story realy everything!"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. The stars were great. I am amazed how many movies I enjoy that the ‘critics’ don’t like. Wouldn’t movie critics want people to see movies? Instead of criticizing a movie they should just describe the type of person who might enjoy that movie. If I see a low critic score and a high viewer score I am pretty confident it is a fun, enjoyable movie. What does that say about critics? 🤨"
  },
  {
    "rating": "5/5",
    "review": "Great combination of action, romance, humor and even a little creepy factor. The storyline was good. Very entertaining!"
  },
  {
    "rating": "5/5",
    "review": "Excellent movie, enjoyed the story from start to finish"
  },
  {
    "rating": "4/5",
    "review": "“The Gorge” masterfully blends sci-fi, romance, and action, delivering a captivating narrative that keeps viewers engaged. Miles Teller and Anya Taylor-Joy shine as elite snipers stationed on opposite sides of a mysterious chasm, their chemistry driving the film’s emotional core. The story’s decision to leave certain elements unexplained invites audience imagination and hints at potential future explorations of its rich lore. Director Scott Derrickson skillfully balances high-octane action sequences with intimate, dramatic moments, creating a dynamic and immersive experience. Overall, “The Gorge” is an exceptional film that leaves viewers eager to revisit its intriguing world in future installments. ￼"
  },
  {
    "rating": "5/5",
    "review": "Loved every moment i spent watching this movie. It has a mixture of every genre i love. I highly recommend this."
  },
  {
    "rating": "3.5/5",
    "review": "Despite a quite boring and predictable plot, Taylor-Joy and Teller's acting make this a fun watch. CGI is fine looking, nothing to write home about but nothing distracting. The Romance felt a bit underexplored, especially for being the main selling point of this film, and the plot felt a bit rushed towards the end, a product of the film both not wanting to extend its already chunky runtime as well as dawdling a bit in the earlier set up scenes. These early scenes also only served to raise more questions then they answered. Also, slight nitpick but that scene where Drasa has super bright green eyes seemed like setup for a later plot point, but went unexplained. What was that about?"
  },
  {
    "rating": "5/5",
    "review": "Absolutely enjoyed this movie! Must watch for everyone!"
  },
  {
    "rating": "2.5/5",
    "review": "Had a great buildup to what was inside the Gorge, only for the reveal to be disappointing. The buildup is honestly really good, but once we find out what’s inside, nothing’s mysterious anymore. The ending is also very rushed"
  },
  {
    "rating": "5/5",
    "review": "Incredible si-fi rom-com movie!"
  },
  {
    "rating": "5/5",
    "review": "Its pleasing to watch, action and love story"
  },
  {
    "rating": "1/5",
    "review": "One word- preposterous. Great cast, rubbish storyline."
  },
  {
    "rating": "4/5",
    "review": "Better than you would think. Give it 10 minutes then decide."
  },
  {
    "rating": "3/5",
    "review": "Entertaining, but the first half vastly outweighs the second. Still a fun watch though."
  },
  {
    "rating": "3.5/5",
    "review": "The Gorge (2025) is a movie that gets a lot of things right, blending action, romance, and a bit of suspense into a well-paced story. The plot is simple yet clever, unfolding naturally without unnecessary complexity. It keeps things engaging with steady character development, making you feel connected to the leads as their situation evolves. While some critics seem to take the romance out of context, it actually makes perfect sense within the story. It’s not just there for the sake of it but develops realistically based on their circumstances. Sure, there are some plot holes, but unless you're watching just to nitpick, they don’t take away from the experience. Visually, the movie stands out with dramatic lighting and smart camera work that keeps you immersed. Even daytime scenes carry a certain mood that adds to the film’s atmosphere. The cinematography is well thought out, with the right angles capturing the emotional depth of the characters while also making the action sequences hit hard. Speaking of action, while there’s plenty of it, the movie does lean more into its emotional core rather than being a full-on action spectacle. The CGI is solid, blending in naturally without feeling overdone, and while some moments might remind you of other films, it never feels like a cheap copy. The performances are strong, with both leads carrying the entire movie effortlessly. Their chemistry feels real, and their dialogue doesn’t come off as forced or unnatural. The script is well executed, moving the story forward at the right pace without dragging things out. The music and sound design complement the film nicely, enhancing key moments without overpowering them. Overall, The Gorge has a high rewatch factor, the kind of movie you'd want to show a friend just to experience it again. If Apple gives it a sequel, there's a lot of potential to expand on what made this one work so well."
  },
  {
    "rating": "4/5",
    "review": "The Gorge's premise and genre shift from tantalizing romance to survivor horror is a good time. It's easy to over look any plot holes as you root for Teller and Taylor-Joy to succeed in there mis-adventure."
  },
  {
    "rating": "2/5",
    "review": "If not for the glimpse of well done romantic tension, I would give it 1 star."
  },
  {
    "rating": "1/5",
    "review": "Men made this movie. I didn't even double check. I just know. The entire film is just exposition through dialogue. There are too many scenes of someone just explaining the movie to someone else. It's the laziest writing I've ever seen. Not to mention the cringiest dialogue. Not even Teller and Taylor-Joy could save it. I don't understand why either agreed to do it after reading the script. It's just so bad. So terribly bad."
  },
  {
    "rating": "5/5",
    "review": "Muito bom, recomendo, tudo na medida certa pra mim."
  },
  {
    "rating": "5/5",
    "review": "Every minute of this film felt necessary. It is a perfect combination of romance, action, & horror."
  },
  {
    "rating": "3.5/5",
    "review": "Not a GREAT movie but it does the job the actors are good, the plot is meh and the vfx are fine at best but I enjoyed the watch. The romance plot is not plausible but it is a movie and we like when things are easier than it really is ahah. Anyways worth a watch because sometimes we like a simple movie that does not take itself too seriously."
  },
  {
    "rating": "5/5",
    "review": "I haven't seen such a film in a long time that can combine action and romance, in my opinion this film is absolutely masterpiece and has not the slightest flaw. Thank you"
  },
  {
    "rating": "5/5",
    "review": "i found i very great movie the romance was great and I was surprising how a great action film can have romance like this"
  },
  {
    "rating": "5/5",
    "review": "LOVE THIS FILM! It's about time we had something different in the action and horror universe than the same old story. This is a great script, the actors do a fantastic job of portraying the characters. Gripping and very well done. I agree that the ending could have been done a little different, but I take it as the idea, visuals and storyline was so good. 5/5!! Give it a watch 😀"
  },
  {
    "rating": "5/5",
    "review": "The best movie of 2024 and 2025. Wow I can't ask for more the chemistry, the tension, the characters well played."
  },
  {
    "rating": "5/5",
    "review": "Its good I like to know about the lore of it more"
  },
  {
    "rating": "5/5",
    "review": "Omg! I loved it so much. The whole thing was incredible and I loved the actors. 💗"
  },
  {
    "rating": "5/5",
    "review": "As this movie started, I unfortunately lost a bit of focus. The opening just didn’t draw me in, but as the movie progressed and the mystery of the gorge began to unfold, my nerves and dopamine levels increased (in a good way). The natural chemistry between Miles and Anya felt real and was definitely one of the film’s biggest achievements. Once the action started, it was fast-paced yet entertaining, delivering several moments where I didn’t anticipate what was coming - and got my scare, something I need once in a while... The last movie I watched that made me feel this way was Annihilation. Great movie."
  },
  {
    "rating": "4/5",
    "review": "I watch this just like I play a video game—excellent cinematics, but I feel it could be more creative. The dark scenes are all on point!"
  },
  {
    "rating": "4/5",
    "review": "Scott Derrickson blessed us with an absolute marvel that is The Gorge. The thrilling long-range scenery, the plot, the smoothness, the action, romance, and suspense—it was an all-rounder. I love watching Anya Taylor-Joy in general. After The Menu, I believe that this is her most beautiful movie. But we can't really compare these two movies as they are completely different. It is just that I savour The Menu. She is so adorable. I cherish her voice, accent, and beauty. Now our Whiplash king, Miles Teller, ate his role in the lead once again. He was more charming than ever. He deserves to be seen in more action and thriller movies. Thanks to the filmmaker who put these two gems together and introduced us to a treasure. The duo looked phenomenal from both the couple's and agents' perspectives. The chilling scenes from inside the gorge kept me on the edge. The climax of the movie made me so anxious yet so enthusiastic at the same time. Somewhere, the music could have been more intriguing, but that didn't matter much when the actors were so entertaining. I would sincerely like to send my regards and gratitude to the whole crew who made this movie possible."
  },
  {
    "rating": "5/5",
    "review": "SUPERB MOVIE SUPERB"
  },
  {
    "rating": "5/5",
    "review": "Best rom com I have seen this year!"
  },
  {
    "rating": "1.5/5",
    "review": "How did she know to look directly over to him at exactly the right time every time. Annoyed me. The writers wrote, two characters that fall in love , at the top of their page opened a bottle of wine and finished for the day. So bloody obvious, all of it. The predecessor getting shot when he leaves, the big shoot out on her bday, also only one time? At least warm us up a little with a few coming up before a big crowd, the zip line and then zip line getting stuck, ugh so many. It has more than one star because I did finish it so I guess there's that. Things I liked: Her gilet - cute"
  },
  {
    "rating": "5/5",
    "review": "Enjoyed the show thoroughly from the start till the end."
  },
  {
    "rating": "1/5",
    "review": "The Gorge on Apple TV promised a thrilling ride, but it only half-delivered. I’d give it a 1 out of 5. The first half hooks you in with some genuinely engaging moments—there’s a spark there that keeps you invested. But then it all unravels. The CGI is a letdown, looking more like a rough draft than a polished effect, which pulls you right out of the experience. The second half? Bland as unseasoned toast. The twists are telegraphed from a mile away, stripping away any chance of real suspense. For a movie billed as a suspense flick, it’s baffling how it manages to feel so flat and predictable. It’s like they forgot the suspense part entirely. Save your time—this one’s a gorge-ous misfire."
  },
  {
    "rating": "0.5/5",
    "review": "Someone saw Annihilation and decided to create a story around the twig people in the Shimmer. Plus add in snipers for hire and a love story. Not worth the time."
  },
  {
    "rating": "4.5/5",
    "review": "It was definitely an interesting movie I really liked it and it was a romantic movie to watch with ur loved one intense and romance watched it three times that’s how much I liked it one of my favorite movies now"
  },
  {
    "rating": "4.5/5",
    "review": "A very entertaining film, it mixes romance with great chemistry between the characters, action, horror and mystery very well developed throughout the film, without underestimating the intelligence of the viewer. The protagonists are well developed within the proposal, charismatic and Anna Taylor Joy and Milles Teller are great. First-rate fun, I highly recommend it, I loved it!"
  },
  {
    "rating": "1.5/5",
    "review": "Other reviews suggest this is worth watching. It isn’t. It’s just another rendition of two people pointing guns at everything they see, here zombie tree things."
  },
  {
    "rating": "4/5",
    "review": "Grata surpresa. Simples e divertido. Na medida. Pediu para passar com aquela cara de pau. Então permiti. Bom filme. SE minha vó tivesse duas rodas seria uma bicicleta."
  },
  {
    "rating": "2/5",
    "review": "A mish mash of genres cute romantic comedy, overtone of Mr and Mrs Smith, with a bit of Second World War spy intrigue and a dash of ice warriors left over costumes from Game of Thrones. On the whole, the characters were likeable but not believable, great photographic scenes and for action fans this will be good! Lots of explosions and escapades. I dont regret watching it but they could have done so much more with this - the bones of a great story but got steamrolled by Hollywood machine."
  },
  {
    "rating": "4/5",
    "review": "Definitely worth the watch. The love story arch is not a simple trope as many reviews would suggest. There is enough action to keep you entertained in a movie about protagonists that have a military background, as well simple comedy to give some laughs in the \"slow\" moments. An interesting story that is somehow fresh in 2025. If there is any interest in anything firearm related they got most everything right from the guns on the wall following the eras mentioned in the film to how the actors handle them. Some things are a little exaggerated but overall the gun play is better than a lot of hollywood flicks. biggest gripe...grenade launchers have an arming distance of more than 12 feet."
  },
  {
    "rating": "2.5/5",
    "review": "Though I don’t consider myself a professional movie reviewer, I found myself reflecting critically on The Gorge. The film seemed to struggle with authenticity; many of its moments felt contrived rather than organic. While there were action scenes that aimed to thrill, they ultimately fell short due to a lackluster script that hindered any real emotional engagement. The clichéd boy-meets-girl narrative, a trope that many viewers have seen countless times before, unfortunately, felt tired and uninspired. Additionally, for those with military experience, the challenges faced regarding ammunition in the plot might resonate, but even that subplot didn’t elevate the overall viewing experience. All things considered, I would rate this film a modest 2.5 stars out of 5."
  },
  {
    "rating": "4/5",
    "review": "I am a huge fan of the 3 main actors in this movie from Sigourney Weaver to Miles Teller and Anya Joy-Taylor I have repeatedly found some of my favorite films and series, and the Gorge is a story type that suits them all well with compelling visuals and veteran acting skill that create a world of stunning military dramatics and a love story in a hopeless place all while trying to find a way to honor duty and protect the world and still honor the life they never envisioned for themselves. A beautiful story in the end, though wrought with many dilemmas I was satisfied with the movie albeit the beginning was a bit slower than I'd hoped."
  },
  {
    "rating": "2/5",
    "review": "It was an ok movie...something to watch if you want to pass time and there aren't any good ones available for viewing. The ending felt forced or should I say, felt incomplete."
  },
  {
    "rating": "1.5/5",
    "review": "Not really. Predictable and boring."
  },
  {
    "rating": "1/5",
    "review": "Just a poor movie. You get shocked awake once in a while from a loud bang, but it has no ability to keep your attention. Everything is in the dark, so it is also difficult to see. The added sounds and electronic sound is just a cheap side effect meant to sound Tense."
  },
  {
    "rating": "0.5/5",
    "review": "actually the worst movie i’ve ever seen. so corny"
  },
  {
    "rating": "5/5",
    "review": "It's definitely a movie of its own. The storyline is not as sophisticated as other movies, it runs on a simpler theme like when as a child you'd watch your favorite movie, most of details don't matter nevertheless it was your favorite. This movie would get much more merit to the younger audiences."
  },
  {
    "rating": "5/5",
    "review": "Muy bien realizada, hermosa fotografía y muy compatible historia. Recomendada para disfrutarla 3 veces."
  },
  {
    "rating": "4/5",
    "review": "The Gorge actually delivers. They could’ve taken the easy way out and not made the gorge anything exciting but they didn’t. Beautiful visuals, ok comedic elements, and lots of action."
  },
  {
    "rating": "3.5/5",
    "review": "Filme: Entre Montanhas Assistido: 25-2-25 Elenco: @miles.teller @nayataylorjoy @sigourneyweaver.hun @sopedirisu Modelo: #fantasia #ação #romance Duração: 2h 7m Ano: 2025 Minha opinião: Ver um filme com Teller e Taylor Joy os dois atores em destaque em Hollywood, não poderia perder um filme deles. Não sei se este filme é o melhor para extrair deles suas performance. Mas a performance de Taylor em ação foi boa. O filme mistura o estilo de Stranger Things, existe um outro mundo em uma fenda, desde do fim da 2ª Guerra. Onde uma arma química fundia o DNA humano com outros como de plantas e animais. KKKkkkk mas é isso mesmo, e que vivem desde aquela época de 40. E assim são colocados vigilantes do lado ocidental e oriente (EUA e Russia) e a cada 1 ano são trocados os vigilantes. E agora pelo lado americano Levi (Teller) e Drasa pelo lado russo (Taylor-Joy). Os motivos para a estória do filme acho esdruxelas, mas da para curtir o ínicio do romance dos 2, até o momento que Levi cai e Drasa vai atrás para salva-lo. E onde encontram seres mutantes que já estão lá a quase 80 anos. E este mundo que eles estão é onde lembra Stranger Things. E lá eles descobrem o laboratório e um arsenal de armas. E para salvar o mundo e da Bartholomew (Signorney) eles armam um plano para destruir tudo e salvar o Mundo. A química entre Taylor e Teller foi boa. Roteiro e enredo poderia ser muito melhor. A estória que motiva o filme é uma piada. Mas a atuação dos 2 salva. Vale apena assistir? sim Nota: 7 por causa de Teller e Taylor Joy."
  },
  {
    "rating": "5/5",
    "review": "I liked it. Sure, it's a bit silly, and the situation is both outlandish and predictable, but so what? It's escapist stuff, and sometimes we need to sit back and let it wash over us."
  },
  {
    "rating": "5/5",
    "review": "A fantastic film full of action and surprises. Had me on the edge of my seat"
  },
  {
    "rating": "5/5",
    "review": "A beautiful, memorable film. I recommend everyone even if you do not like movies."
  },
  {
    "rating": "3/5",
    "review": "The Gorge is a quite predictable, but fairly enjoyable movie with great lighting and colour grading. The characters are generic, not layered, but their interactions are interesting to watch. I liked both of them, but they didn't grow and didn't have anything to be intrigued by, only their relationship and the actors's chemistry. The concept is cool, but the story is predictable. The dialogues are sometimes just so unrealistic. The cinematography is good. It's lighting and colour grading is very similar to Silo's, which I love. The editing is generic and the beginning of the movie is too long. The score is unique, but it wasn't great, because I knew the ending of dramatic moments, because the music told me what would happen. For example I knew when he would or would not fall into the gorge. The acting is also just okay even though the casting os good and the actors' chemistry keeps the movie going. The Gorge is neither original nor well-crafted, but it's still an enjoyable ride."
  },
  {
    "rating": "5/5",
    "review": "I loved it! I wasn't bored at all. The story kept me locked in!"
  },
  {
    "rating": "5/5",
    "review": "I found it to be a nice surprise."
  },
  {
    "rating": "2/5",
    "review": "A just-okay attempt at the sci-fi/fantasy genre. With lead actors so well known, one may think The Gorge would be a sure-fire hit, but the film fumbles when trying to find its footing. The world building is blurry at best, and though the premise is promising, the concept of the gorge itself lacks serious definition. What could have been an exciting and riveting action movie muddies the waters by introducing a romance plot a quarter of the way through the film. The chemistry between the lead actors feels forced or feigned, and the believability of their romantic connection seems to be far-fetched. An entertaining but not particularly smart movie."
  },
  {
    "rating": "2.5/5",
    "review": "Perfectly fine streaming movie."
  },
  {
    "rating": "5/5",
    "review": "O filme foi um boa surpresa. Envolve ação, ficção e romance com um bom cenário e uma boa história. Diversão garantida."
  },
  {
    "rating": "5/5",
    "review": "Was a very enjoyable experience. Took me back to the days where movies were about the story not the action. I would say it's a must watch and you won't regret it."
  },
  {
    "rating": "4/5",
    "review": "Way better than I thought it would be. When they finally get into the Gorge I was like okay I'm invested."
  },
  {
    "rating": "3/5",
    "review": "I found the film intriguing at first. Then they explained what was going on and I thought,\"That's pretty lame.\" The film then turns into a standard action flick. I'm rating it as high as I am because of Anna Taylor-Joy. Not only is she nice to look at she's truly a first rate actress. Fact check: the movie has an alleged film clip from 1946 that mentions DNA. Watson and Crick published their discovery of the double helix in 1953. Easily correctable mistakes like this bug me."
  },
  {
    "rating": "4.5/5",
    "review": "This felt like a summer blockbuster. Edge of Tomorrow vibes. Great job casting the leads"
  },
  {
    "rating": "3.5/5",
    "review": "Good premises and nice romance for the first half. Then, the movie becomes a predictable zombie-style story"
  },
  {
    "rating": "5/5",
    "review": "Absolutely fantastic, nonstop action, a compelling love story, and incredible scenes that make you want to watch the movie over and over. Also, the symbolism with the T.S. Eliot poem “The Hollow Men” throughout the movie is just another reason why this is the best movie that has come out in years. Acting was phenomenal and both of the main characters had great chemistry."
  },
  {
    "rating": "1/5",
    "review": "This is quite possibly the worst movie i have seen. It is just awful. It has no redeeming qualities. Do not watch it. Do your taxes instead. It will be more fun"
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie, and even if some of the romance scenes were cheesy. Overall, they were sweet and nice to watch. It's a blend of movie genres. It starts out a bit slow at first and goes from thriller, romance, thrilled, romance, horror, and the deeper this couple explores the Gorge the deeper it dives into Sci-Fi. I really enjoyed watching them explore and fight their way through the Gorge and just the overall looks of it. It also had a nice ending I did not expect. 5/5!"
  },
  {
    "rating": "5/5",
    "review": "Best movie Everrrrrrrrrr ."
  },
  {
    "rating": "4/5",
    "review": "a movie with little words but a grate story."
  },
  {
    "rating": "2/5",
    "review": "Entertaining, but the special effects are poor, the leads were poorly cast (both need to mix-in some physical training), the screenwriting is terrible, and some of the scenes are laughable. And for goodness sake, at least figure out if a former Marine civilian is supposed to salute someone indoors. It's a small thing, but just inexcusably sloppy like a lot of the film. And by the way, the AI bots giving this 4 or 5 stars and referencing the \"combination of 3 genres\" or variations of that review are pretty obvious. Ignore those."
  },
  {
    "rating": "2/5",
    "review": "This movie is slow to start and fast to finish. Anya Taylor-Joy and Miles Teller make the most of what they're given. Their charisma goes a long way to make their characters feel more endearing, but any substance beyond that gets lost in overly expository dialogue, choppy action sequences, and an apparent lack of budget for lights on set."
  },
  {
    "rating": "4.5/5",
    "review": "It was an unexpectedly good watch, usually, I find those types of movies boring and unfunny it was the opposite with that movie I was kept at the edge of my seat with good humor and the movie was at times emotional and not the forced type."
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed this movie. The overall plot was very interesting to me. I liked watching the dynamic between the two characters as they get to know each other day after day, close enough to see each other, but far enough apart that they can’t have an intimate conversation or touch one another. When they finally do get a chance to be close, everything goes to hell and we learn more and more about the secrets that the gorge holds. The “evil, international private company/paramilitary group” has been done to death but I feel like there’s always a way to bring a dash of something new and exciting to it and The Gorge did this beautifully in my opinion. It grabbed my attention and held it throughout the film. The trailer didn’t nearly do it justice, as I wasn’t expecting a lot of the movie from the trailer, but I was more than pleasantly surprised."
  },
  {
    "rating": "3.5/5",
    "review": "The film's first half successfully builds tension and intrigue, drawing viewers into the enigmatic setting and the protagonists' developing relationship. However, as the narrative progresses, it succumbs to conventional tropes, leading to a predictable and somewhat underwhelming conclusion. Despite the strong performances and initial promise, the latter part of the film feels rushed and lacks the depth anticipated from its outset. In summary, while \"The Gorge\" offers a captivating start with commendable acting and a unique blend of genres, it ultimately falls short in delivering a satisfying and original ending. The film is worth a watch for its strengths, but there's a lingering sense that it could have achieved more."
  },
  {
    "rating": "3.5/5",
    "review": "A cross genre sci-fi/ romance/ fantasy /action /horror movie. Yes that description is actually correct but somehow this mashup works sufficiently due to the quality of the lead actors even if the attempt at originality is not fully realised. You have elements of Alien (appropriate casting for Sigourney), some similarities to the terrible Pratt / Lawrence hook up in Passengers and a (sort of) mutant story thrown in for good measure. Visually it's pretty decent and certainly worth a view even if you could drive a rather large truck through some of the plotline threads. Look out for the tilts to previous roles played by Miles and Anya, you get a bit of Whiplash and The Queen's Gambit."
  },
  {
    "rating": "5/5",
    "review": "Fun, entertaining, endearing!"
  },
  {
    "rating": "5/5",
    "review": "Love films like this. It was like an action adventure version of the horror movie the mist. Totally entertained the entire time and exactly what I needed on a Sunday night"
  },
  {
    "rating": "4/5",
    "review": "Not especially intelligent or original but entertaining as hell! Great romance combined with horror and bizarre landscapes that reminded me of Annihilation. Also loved the music during end credit texts... It was hypnotizing and great closure for the experience."
  },
  {
    "rating": "3.5/5",
    "review": "I had no expectations and it became a new favourite. A bit of everything mixed perfectly."
  },
  {
    "rating": "3.5/5",
    "review": "If you're bored, stream this movie and you'll forget your boredom, because it's a good mix of horror, sci-fi and action with a bit of romance. Not a great film, but good entertainment."
  },
  {
    "rating": "2.5/5",
    "review": "What if Annihilation was a romance with a bunch of the second half of Aliens thrown in? That's what I kept thinking as I watched recent paramours guy and girl snipers descend into the cloudy mists of The Gorge. There's an awful lot of convenient things here like giant pads of paper that make communicating across the gorge a piece of cake, or an easy-to-find movie that explains exactly the mystery of the Annihilation-esque creatures. There's also too many plot holes such as how there's been a (spoiler time) ongoing chemical leak for like 80 years that affects all living things and not only has the gas not gotten out at all (not through wind or water) no mutant birds, bats, bugs, snakes, squirrels, or whatever have escaped. Also one of our heroes is dragged off only to be held captive by one creature who is suddenly in no hurry to kill her. The acting from Miles Teller and Anya Taylor-Joy keep this film watchable even if the long-distance romance of the first third was a bit schlocky. Sigourney Weaver is back in another of her antagonist roles. Ultimately I can't say I regretted watching The Gorge, but I wouldn't have missed much if I hadn't."
  },
  {
    "rating": "4/5",
    "review": "As unique as your gonna get it caught my attention pretty quick , great cast"
  },
  {
    "rating": "4/5",
    "review": "This dose a pretty good job with action and story is interesting they had skull spiders that was Sikk 🤟🏽 although I knew when the old guard was killed by the people who hired him I knew something was up but I don't hear many people talking about it not sure why it's solid I know there has to be streaming movies but I fell like it can do more harm then good in some cases honestly."
  },
  {
    "rating": "3/5",
    "review": "\"The Gorge\" is entertaining enough to watch once. This movie is a blend of three major genres that usually don't mix well including action, romance, and horror. I felt the movie felt like it was trying to be too many things and all of them felt a bit underveloped. I still think the talents of Miles Teller and Anya Taylor-Joy are enough to carry the movie, particularly their chemistry when it comes to romance. I also thought the premise was neat and the visuals in the movie were enjoyable. Overall, this movie is okay but it does feel like it had the potential to be better, but still will surely please multiple genre fans."
  },
  {
    "rating": "0.5/5",
    "review": "My 16 year old daughter and I were excited for this movie to come out because we love ATJ. Oh man. Why did she do this to herself? The bills can't be THAT high? This film was embarrassingly terrible and took a push for us to even finish. It took over two hours to act out this fantasy apparently written by an 8th grade theater class?"
  },
  {
    "rating": "4.5/5",
    "review": "Não esperava absolutamente nada e o filme entregou e muito. Belas atuações e uma história surpreendente."
  },
  {
    "rating": "5/5",
    "review": "I think it was a refreshing take on a plot that felt familiar but still surprising. Plus all the actors played their roles well. A Romance-Horror movie was actually something I enjoyed. Over 2 hrs & it didn’t feel like it. I would have liked a little more monsters. The soldier being killed in the beginning would have been better dropped in Gorge & becoming a monster that may have helped them. Other than that a solid 5 out of 5!!!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely stunning! One of the best movies I saw during the last year."
  },
  {
    "rating": "0.5/5",
    "review": "Garbage. A childish and cheesy romance, the rest...don't get me started. Waste of valuable life time."
  },
  {
    "rating": "5/5",
    "review": "Spectacular. While it’s a thriller and suspenseful, also gives you a nice laugh every once in a while."
  },
  {
    "rating": "4/5",
    "review": "It is impossible to hide three things for a long time: the sun, the moon and the truth. the film is good, but banal. I could predict almost every action of the characters, but that doesn't make the movie uninteresting. the plot is quite well developed, has a lot of details, which allows us to feel the history of the gorge. I would also like to say that, unlike other fighters in the gorge, the heroes may run out of bullets. In many films, the main characters have an endless supply of ammunition and they almost never get injured. and this implausibility is infuriating. Fortunately, she's not in this movie. I should also add that although there are very few characters in the film (Dras, Levoy, Bartholomew, J.D.), there are no understatements in it. there is no sense of one omniscient hero who tells the viewer about what is happening. and now to the cons, the movie is pretty good, but banal. I could predict almost every action of the characters. and this is one major disadvantage. but that doesn't make the movie uninteresting. There is also a small plot issue (spoilers carefully) why hollow people don't end. You've been guarding the gorge for about half a century, which means that hollow people have been on the towers for half a century. If there were only 2,500 cavalrymen, then why didn't they all die already? The riddle is generally a good movie. for a four. I definitely recommend it for viewing. Have a nice viewing! We are the hollow men We are the stuffed men Leaning together Headpiece filled with straw. Alas!"
  },
  {
    "rating": "5/5",
    "review": "This movie has it all! It's for smart people and it touches on a lot of topics. We actually felt like we were in the movie. Mystery, action, romance, conspiracy, scifi, pain, suffering and hope! Great cast, Great special effects, Great story!!! 5 Stars all the way!!!"
  },
  {
    "rating": "4/5",
    "review": "If you like resident evil,silent hill,etc. action video game films that turned out great btw you’ll like this."
  },
  {
    "rating": "3/5",
    "review": "Decent action scenes and interesting story with its clearly divided chapters that each served their own purpose. I liked the dark atmosphere of the Gorge lit with streaks of vivid color. But, a few things: (1) Levi's adventure from the dropoff point to the West Tower felt extremely rushed and cut up as they squeezed all of that into like 20 seconds; I get they were probably trying to shorten the film but it was very noticeable. (2) The dynamic between the leads was too cliche and sentimental. (3) Most of the Gorge tree human hybrids belong better on the set of Power Rangers; too PG and costume-like. P.S. I got the brief nods to Anya's chess mini series (The Queen's Gambit) and Miles' drum film (Whiplash), which I've also seen. Those productions were also better in most ways, although I did mostly enjoy this ride."
  },
  {
    "rating": "0.5/5",
    "review": "This and Trump…. Are the worst things I’ve seen SO FAR this year."
  },
  {
    "rating": "3.5/5",
    "review": "A fun movie, nothing spectacular, but a satisfying flick to watch on a date night"
  },
  {
    "rating": "0.5/5",
    "review": "Surely a high schooler wrote this. Plays like a video game that’s been played on a pc. Chess and jazzy drums couldn’t save it."
  },
  {
    "rating": "2/5",
    "review": "Such a let down. I can’t believe they got these two great actors for a video game cut scene movie. It’s starts out ok, snipers, top secret mission, mercenaries, etc Then it’s a breakfast club love scene across a gorge. Then resident evil meets game of thrones white walkers with terrible cgi Tie it all together with thin reason for all of it. Dreadful"
  },
  {
    "rating": "4/5",
    "review": "Good production design and mood. Also, thank you for TV streaming movies that are being produced in 16:9; 1.78:1 and 1.85:1 aspect ratios, using the majority of tv screen format. If such productions are made mainly to be shown through TV streaming, pls use such aspect ratios that take advantage of the entire tv format for composition."
  },
  {
    "rating": "2/5",
    "review": "The concept had a ton of potential but it just ended up being the most obvious movie possible. Fun if you’re with people, stupid if you start thinking about it in any way lol. 4/10"
  },
  {
    "rating": "5/5",
    "review": "it’s an interesting movie with great visuals and uncommon plot.. romance, actions, mystery, horror everything was there.. hope to see The Gorge 2 soon.. will wait for the second part where to hunt the super soldiers 😌"
  },
  {
    "rating": "4/5",
    "review": "Great story line and plot. Some of the action scenes went way over the top in unbelievable territory, but it was an obvious story of science fiction so it was just what I was looking for for the evening. I loved that there was no gratuitous nudity that would not have helped the story. A fun action / romance story."
  },
  {
    "rating": "5/5",
    "review": "It is a fun romantic horror movie with a happy ending."
  },
  {
    "rating": "5/5",
    "review": "This movie absolutely rocks. A novel romance movie disguised as an action movie, but also great action. Chef's kiss."
  },
  {
    "rating": "5/5",
    "review": "I LOVE IT!!!!! SO MUCH."
  },
  {
    "rating": "4/5",
    "review": "Sure, the references to Annihilation, the White Walkers of Game of Thrones and Mission: Impossible are a bit too obvious, but between Anya Taylor-Joy and Miles Teller's romance and the horrific action scenes, you can't get bored. Well played and well directed..."
  },
  {
    "rating": "3/5",
    "review": "Starts very strong, slips into predictability and ends boring. Based on the strong first third of the film I'll give 3 stars as I really enjoyed it. The final two thirds were a let down unfortunately."
  },
  {
    "rating": "5/5",
    "review": "Plot holes for sure but directed well and the two leads spark well off each, Anya Taylor-Joy is just well, a joy to watch, Wouldn't be surprised to see her in more action roles. A lot of fun with some genuine jump scares along the way!"
  },
  {
    "rating": "5/5",
    "review": "This movie certainly has a unique premise. Plot holes abound and not state of the art cgi but still fun to watch. I'll call it a romantic / thriller / horror. Has a little bit of everything."
  },
  {
    "rating": "3.5/5",
    "review": "Very solid. Better than expected."
  },
  {
    "rating": "5/5",
    "review": "good film a divertissement"
  },
  {
    "rating": "4/5",
    "review": "Very good film. Top of the year for now."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible movie. Everything about it is bad."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely sucked. I think Anna Taylor Joy made this movie even worse, her acting was even more cheesy than it usually is. The CGI was a joke and looked just like a video game. Also, the movie could have easily been 1/2 the time…."
  },
  {
    "rating": "1.5/5",
    "review": "The pacing and story are just terrible. The only good thing about this movie was Sigourney Weaver and she was only in it for about 5 minutes. There were so many things that did not make sense and the outcome was completely predictable and bad."
  },
  {
    "rating": "3.5/5",
    "review": "A unique main plot line captivates with convincing on screen chemistry from its co-stars which makes for an enjoyable watch. Areas of the plot left with little to no explanation and a tendency to fall into the pitfalls of predictability. On the whole a good watch from two very talented actors."
  },
  {
    "rating": "4/5",
    "review": "The film does take itself quite seriously, but it pays off. Expectations set by the trailer and write up were in my opinion exceeded. There are enough unexpected turns, and not too many cheesy lines. A quality modern fantasy/horror/romance with pretty good CGI. While the film is not particularly complex, it is definitely still one to sit back and enjoy."
  },
  {
    "rating": "4/5",
    "review": "Nice little way to spend a Sunday afternoon. Won't win any Oscars but it isn't trying to do. It was just meant to be a fun way to turn off your brain for two hours and it succeeded."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Thank god for a movie that isn’t a remake."
  },
  {
    "rating": "0.5/5",
    "review": "Did DeepSeek write this movie?"
  },
  {
    "rating": "4/5",
    "review": "It's good, really good. I liked it a lot. It's not the typical love story. It's exciting and scary and no boring spaces between the movie. It's like Resident Evil with romance and more realistic. Hope to get a part 2."
  },
  {
    "rating": "4/5",
    "review": "(Reviews you can understand and trust) An excellent movie for Saturday night viewing, both entertaining and endearing. It’s certainly better than most multiplex fare these days, that’s for certain. The leads are believable and have an under the radar vibe that creates the required bond for their relationship … and for us to care when things inevitably go bonkers. Their initial communication across the expanse is clever, but what sets that portion of the movie apart is the writing (literally), which will invoke at least a few “awe’s,” as in, “how cute!” The Sci-fi is acceptable (and obligatory), as is the story, but it has its moments. The scenes within the church, lab, and final escape attempt are top notch. Go ahead and gorge on The Gorge. You’ll exit the couch more than satisfied."
  },
  {
    "rating": "3/5",
    "review": "I liked the premise but the time line should have been set prior to drone technology. Trying to suspend my disbelief that the threat posed was actually a threat is difficult, being aware of the technology available. Once the secret is revealed the whole import for the main actors roles feels unnecessary. Loved the concept. Sad about the lack of attention paid to plausibility."
  },
  {
    "rating": "4/5",
    "review": "This was a solid & entertaining movie. I could see someone calling the shift in tone jolting but it was refreshing and really highlighted the shock our protagonists felt. The movie was very original & I appreciated the good story that has a beginning, middle & end with no loose ends or ambiguity. The ability to tell an original story without leaving one guessing in order to leave the door open for sequels is a lost art and this movie delivered."
  },
  {
    "rating": "4/5",
    "review": "Up to about an hour into this movie I thought it was going to be one of the best movies id ever seen. However the tension is completely broken after the mystery of gorge is revealed about halfway through. It was still really good - but it was almost absolutely excellent."
  },
  {
    "rating": "5/5",
    "review": "A fresh, unique break from the recycled plots that Hollywood has been churning out recently. A love story with a heavy sci-fi element is fun, exciting and absolutely watchable. The chemistry between Anya Taylor Joy and Miles Teller is real, palpable, and sweet. I was immersed the entire time, investing in these characters and seeing them have a positive outcome. Fantastic fun, start to finish."
  },
  {
    "rating": "3.5/5",
    "review": "ORIGINAL CONCEPT SCENARIO, ENJOYABLE DUO BUT SOME OVER THE TOP SCENES : \"The Gorge\" is a wild, over-the-top ride that never fails to entertain, largely thanks to its charismatic duo. The film boasts an original concept, blending intense sci-fi with a dash of horror, and at times, it evokes the tense atmosphere of World War Z alongside the eerie vibes of Stranger Things(I had a few jump scares). While the movie pushes its limits with extravagant moments, it still manages to captivate with its inventive narrative and engaging performances, earning a solid 7/10. Note that its mature themes and intense content make it better suited for viewers aged 16 and older rather than a younger audience(not -10 years old like it's suggested at the start of the movie)."
  },
  {
    "rating": "5/5",
    "review": "Best si-fi romance I’ve seen in years. Finally a film where the main characters were not competing against each other but actually worked together. The story was quite simple but the chemistry was off the charts, you could tell how much they enjoyed their time together, didn’t feel forced at all. You know girls can be strong, capable and independent without putting others down. And the male lead, Levi? Chef’s kiss, caring, respectful but still muscular as well, if I was Drasa, I would totally fall for him too! 10/10 recommend people who love this genre of films!"
  },
  {
    "rating": "5/5",
    "review": "Best sci fi, action, romance flick I've seen in years. The only thing I hate about this movie is I can't see it again for the first time. Lot's of snobs giving it 2 or 3 stars. My wife would give this film a 0.1 star. But she hates movies like this. I happen to love this movie. People who hate movies like this shouldn't be reviewing them."
  },
  {
    "rating": "5/5",
    "review": "This movie was super fun to see, it was a mix of warfare, love and sci-fi! There was never a dull moment, both actors are amazing and played the part perfectly! The plot twist as well and the governmental history behind it! Loved it."
  },
  {
    "rating": "1.5/5",
    "review": "Not much to save beyond the aesthetics."
  },
  {
    "rating": "4.5/5",
    "review": "Enjoyable action movie with a plot that holds water."
  },
  {
    "rating": "5/5",
    "review": "Anya Taylor-Joy es de las mejor de la película igual que siempre, muy interesante toda la película y muy buen plot twist. Recomendada."
  },
  {
    "rating": "4/5",
    "review": "I just watched The Gorge (2025), and wow—what a ride! It’s got everything: action, romance, and just the right amount of mind-bending twists to keep you hooked. Miles Teller and Anya Taylor-Joy have amazing chemistry, and their performances really pull you in. The story keeps you guessing, and the visuals are stunning. It’s the kind of movie that sticks with you after the credits roll. Definitely worth watching!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Keeps you on your feet. Compelling plot. Miles Teller and ATJ had great on-screen chemistry. Their characters communicate relatable emotions despite unrelatable circumstances. The combination of mystery, romance, and suspense make this movie a must watch."
  },
  {
    "rating": "4/5",
    "review": "Enjoyable movie with an interesting plot."
  },
  {
    "rating": "3/5",
    "review": "I admit I’m a bit of an elitist. I hate formulaic action movies, super-hero movies, thrillers and the like. I want movies to have plots that make sense; for an original path to be taken; for human emotions to be explored in some meaningful way. This movie had none of that. Yet somehow I kinda enjoyed it. If you’re just looking for a movie to help pass by a couple of hours, this is a decent way to do it."
  },
  {
    "rating": "5/5",
    "review": "Great movie! Miles Taylor & Anya taylor-joy had great chemistry together. There were a few plot convinces but other than that, fantastic movie"
  },
  {
    "rating": "5/5",
    "review": "I loved it. It had all the fun beats of an action thriller, plus a romance that felt genuine. The cinematography was better than most, and some shots were quite well done in my opinion. Acting and dialog was solid throughout. The plot was outlandish, but semi-plausible. Much more believable than most movies that everyone \"gives a pass\" to. Go into it blind, and just enjoy it for what it is, not what you expect or want it to be, and you'll have fun. I see the critics are rating it lower than the public. Critics simply don't have the zeitgeist on cinema culture all the time."
  },
  {
    "rating": "5/5",
    "review": "Brilliant !! Beautiful acting. Up-close horrors of real-life quadcopters and bio-weapons research. A sci-fi film befitting the world today."
  },
  {
    "rating": "5/5",
    "review": "Loved the action and the chemistry between ATJ and Miles Teller. Great story and fun movie overall."
  },
  {
    "rating": "4.5/5",
    "review": "The combination between horror and romance balanced with almost perfection. Anya Taylor Joy puts on yet another great acting performance. And I never thought I’d see miles teller with a full beard. However, I loved what they did with the chess bit, it was definitely a queens gambit reference."
  },
  {
    "rating": "5/5",
    "review": "Going into this sci-fi romance action movie I said to my wife, “I am so excited, this has the making of everything that is Edge of Tomorrow - new unique sci-fi concept, action, romance, and some huge threat that must be stopped by the pair to save humankind”. While The Gorge isn’t as good as Edge, I still loved it. I saw a critic say that it’s basically Romeo & Juliet mixed with The Last of Us mixed with Annihilation, and that’s a great way to describe it. If you haven’t seen any of those, then I’d basically say it’s just a great popcorn date night flick that will appeal to fans of just about any genre."
  },
  {
    "rating": "5/5",
    "review": "A really good movie."
  },
  {
    "rating": "2/5",
    "review": "Great suspense and mystery at the beginning; switched off when it got silly. The ‘Hollow Men’ reference feels forced."
  },
  {
    "rating": "5/5",
    "review": "The movie was very solid in my opinion; the suspense was great. The romance was tasteful and not over the top like in many modern horror movies. The acting was good, love Teller and Taylor-Joy. All in all, a great movie that would definitely recommend."
  },
  {
    "rating": "5/5",
    "review": "Better to watch it without knowing any details about this movie prior!"
  },
  {
    "rating": "5/5",
    "review": "Great Movie Really enjoyed it"
  },
  {
    "rating": "5/5",
    "review": "Entrega tudo e mais um pouco"
  },
  {
    "rating": "5/5",
    "review": "Thoroughly enjoyable, part romantic comedy, part sci fi horror. A nice thrill ride, as Miles Teller and Ana Joy Taylor do a great job. Well worth the watch on Apple TV +."
  },
  {
    "rating": "3.5/5",
    "review": "The idea of two people on opposite sides watching over a gorge so monsters can not come out is a fun concept. For the most part, the film delivers on the idea while having an enjoyable romance on top. Miles Teller and Anna Taylor Joy have incredible chemistry and I brought the build-up of their relationship. It has a fun tension and romantic-filled first act with an excellent action video-game-like second act. Unfortunately, the film is let down a bit by a dull and overly convenient final act. Still, this is a solid two-hour popcorn flick that entertains the audience."
  },
  {
    "rating": "4.5/5",
    "review": "While the plot can be fairly predictable, it doesn't take away from the fun of the film. You aren't going to be shocked by any twists or reveals, but the acting is great and the story is fun. The first introduction to the antagonists within the Gorge is one of the most fun and suspenseful actions scenes I've seen on film in a while. I was initially concerned the story would drag with the main characters being separated and unable to communicate other than through messages viewed through binoculars; but the pace was solid and it never felt slow, even on a rewatch after I knew what was going to happen."
  },
  {
    "rating": "3.5/5",
    "review": "The first hour had one of the most compelling storylines ever. The loneliness, haunted pasts, two elite snipers separated by duty, and a hellish mystery. It had immense potential, but there you go. Instead of a work of art, we get more Hollywood BS. The relationship between the two is underdeveloped. Instead of two well-written characters with real depth, after the first hour of the movie, they turn into two clique action superheroes. As for the Gorge, the best part about a mystery is... THE MYSTERY. But if you really must resolve the mystery... really? The trees from Narnia? That was the best thing writers could come up with...?"
  },
  {
    "rating": "3/5",
    "review": "I enjoyed the premise of this big budget flick but I can’t help thinking this was a huge missed opportunity to make a much more meaningful movie. Aside from the basic premise of two towers protecting a dangerous and mysterious gorge, there are no new ideas here. The characters and plot are so predictable, this movie almost feels nostalgic of the kind of massive budget Hollywood filmmaking of the Marvel era. Why did Apple greenlight this movie when they could have made 10 better, more thoughtful for the same money? Go figure."
  },
  {
    "rating": "5/5",
    "review": "Great cast, though there's a few plot holes, I had a lot of fun watching this. Effects are really awesome too. In my personal opinion, there's not a single moment in the movie where you go \"Well this is boring.\""
  },
  {
    "rating": "1.5/5",
    "review": "Anya Taylor-Joy and Miles Teller are extremely watchable, thus the 1.5 stars. But if I were either of them, I would fire my agent. The pastiche of various movie genres really doesn't work. Nor do the horror bits stolen from The Last of Us, Peter Jackson's King Kong, etc. I don't think there's one original idea in this movie."
  },
  {
    "rating": "4.5/5",
    "review": "There's a little bit of everything in The Gorge - and it all works! It's fitting that it was released on Valentine's Day, as it's first and foremost a romance. Having said that, it's also a thriller, with elements of sci-fi, conspiracy, horror, and more. If that sounds a bit scattered, for me and my wife it was just the right mix. There was always something going on and the interaction between the two leads made for a totally enjoyable experience. Honestly, I think Apple TV+ could have released The Gorge in the theatres and it would have done pretty well, but they haven't had much luck selling their feature films to mass audiences. That's fine with me, as the occasional movie just adds to the overall value of our Apple subscription, which is worth every penny. All around, The Gorge is a thoroughly enjoyable movie and a perfect date-night choice."
  },
  {
    "rating": "5/5",
    "review": "Loved it. Great story, great actors, and effects too."
  },
  {
    "rating": "5/5",
    "review": "Surprisingly, really solid movie! Loved the idea acting was great, I would watch it again. The cinematography was superb writings well. You get a nice mix of action and romance. Good charter development. Keeps you on the edge. Recommend!!"
  },
  {
    "rating": "0.5/5",
    "review": "This is probably the dumbest film I have seen in a long time. The screenplay is absolutely laughable, the action is mediocre, the lines are corny, the visuals look like a video game and the actors have no chemistry. The only scene that I kinda enjoyed was when Drasa played chess and Levi played drums. That was funny. That’s all."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie!! 🍿 I’ve seen it three times already.I think apart 2 should be in the works. Loved the chemistry between them…just awesome💕🎉"
  },
  {
    "rating": "3.5/5",
    "review": "This is a pure popcorn film, something like National Treasure or the first Pirates movie. If you go in with low expectations you will be presently surprised. It’s not something to get Apple TV+ for but if you have it and need some fun, it’s a good watch. I enjoyed the two main leads and the plot managed to make sense in-universe."
  },
  {
    "rating": "1.5/5",
    "review": "Le pitch était prometteur, le résultat est décevant. La dimension fantastique va en s’intensifiant mais aboutit à un épisode assez classique à mi chemin d’Une Nuit en Enfer / Sleepy Hollows après quoi l’intrigue se révèle très prévisible."
  },
  {
    "rating": "2/5",
    "review": "SO promising. Good actors, great romance idea and then.....bad."
  },
  {
    "rating": "3.5/5",
    "review": "Like a short story, compressed timeline, snapshots of events. Both Taylor-Joy and Teller, the central characters, can hold the screen. Taylor-Joy in particular is becoming a star turn. I thought the acting across the board was first class, from the main two actors, intense and convincing. Decent script, convincing setting and fairly convincing sets - maybe too much smoke/fog. Some weaknesses in the story, explanations and understanding came too easily, but frankly it's an unusual, simple, little Sci-Fi movie. The earth did not move but I enjoyed The Gorge."
  },
  {
    "rating": "0.5/5",
    "review": "This was so stupid. I have to the think this was written and directed by a teenager from the high school drama club."
  },
  {
    "rating": "1.5/5",
    "review": "(sung) Tree Eye Joe!"
  },
  {
    "rating": "5/5",
    "review": "Myself and my 2 teenage daughters really enjoyed this. Excellent movie."
  },
  {
    "rating": "5/5",
    "review": "I watched on a friday night and thought it was great. Very interesting story line and filmed very well. Love story meets Game of Thrones!!!! I am sure it is not for everyone but would highly recommend it. Get some popcorn and enjoy!!!"
  },
  {
    "rating": "1/5",
    "review": "Just an entertaining movie. Not that bad but completly forgetable."
  },
  {
    "rating": "5/5",
    "review": "ABSOLUTE MUST SEE!!!!!!!"
  },
  {
    "rating": "1/5",
    "review": "Awful movie, silly ridiculous plot filled with holes with an extremely cheesy and oppressive love story that dismantles what could have been a decent film. Don’t waste your time watching!"
  },
  {
    "rating": "4/5",
    "review": "Such an unusual concept, I had to know what happened."
  },
  {
    "rating": "5/5",
    "review": "absolute love for authentic ideas like this, bring mystery to our world. more please."
  },
  {
    "rating": "3.5/5",
    "review": "I was shocked to discover that The Gorge is an original idea, not a video game adaptation, because it looks and plays out like one. Despite its apparent flaws, the movie's romantic subplot is endearing owing to Teller and Joy's chemistry, and the innovative premise and ambitious execution are commendable. This is one streaming movie action flick that's better than most."
  },
  {
    "rating": "3/5",
    "review": "Dont think to hard(the movie is one big plot hole) and enjoy the movies for what it is. A somwhat original and not over done movie"
  },
  {
    "rating": "0.5/5",
    "review": "Too silly. Ridiculous. Nonsensical."
  },
  {
    "rating": "4/5",
    "review": "Much better that it's current rating. Not a huge Anya fan, but great chemistry with her counterpart. Unexpected turn of events and an interesting sci-fi take on 1940s research. Great viewing for a Sunday afternoon."
  },
  {
    "rating": "2.5/5",
    "review": "Not a good movie by any metric, but it was fun to turn my brain off for a while and enjoy some of the cool scenery, mutated humans, and skull spiders! The only thing that kind of angered me was how the movie sets them up to be equals in both survival and marksmanship but as soon as Miles falls into the Gorge and Anna jumps in after him, he becomes the white male action hero, and Anna becomes his lovable sidekick who always needs to be saved. I think it would have been a better movie if Miles and the \"romance\" part were cut out of the movie completely. Anna is an incredible actress and could have easily carried the movie by herself."
  },
  {
    "rating": "3.5/5",
    "review": "Interesting plot with touch of conspiracy which make a nice storyline. Pretty entertaining for a 2 man-show 120 minutes to spice up your weekend."
  },
  {
    "rating": "5/5",
    "review": "What an AMAZING premise!! Such a refreshing plot w/ a minimal cast. A mixture of Doom & Aliens, but w/ a VERY, cute romance amid the dark hell. \"Cute\" if ur a gal, which i am, so. What's amazing to is the plot keeps u in suspense throughout movie. That dark gorge was a perfect counterpoint, against the gorgeous setting they filmed the movie in. Too bad they didn't put this in the theatres first, it would of done really well b/c the recent movies the past yr have been a bit dull & unoriginal."
  },
  {
    "rating": "4/5",
    "review": "Excellent entertainment. Pay no attention to the naysayers."
  },
  {
    "rating": "2.5/5",
    "review": "First half of the movie was pretty entertaining but at some point it was just missing an actual plot. I got very confused around half time. A lot of things remained unexplained/ didnt make sense to me."
  },
  {
    "rating": "5/5",
    "review": "I absolutely devoured this movie. I thought it was so original (as original as a movie can be these days). I loved the way it flowed through different genres but still felt completely connected! It was truly a romance film and yet still had amazing action, really interesting cinematography, jump scares (for me personally), and was quite twisty. The twists were somewhat predictable but still very well executed. I really enjoyed this movie overall, and I highly think others should watch it. I definitely recommend it to those who loved The Cabin in The Woods!!"
  },
  {
    "rating": "4/5",
    "review": "Loved this movie. Solid action, good romance, good characters, enjoyed the story."
  },
  {
    "rating": "2.5/5",
    "review": "Started fun even though the premise was not airtight then got so ridiculous and dumb. Was saved slightly by the lead actors."
  },
  {
    "rating": "4/5",
    "review": "Loved it. Great chemistry between the two stars! More a romance than action/ sci fi, but that's what made it great."
  },
  {
    "rating": "1/5",
    "review": "Just completely awful. Came on here for the first time just to give this loser a 1 star."
  },
  {
    "rating": "1.5/5",
    "review": "Well, Rotten Tomatoes just experienced \"an error\", and disappeared my elaborate novel about the derivative nature of today's entertainment. I don't have the energy nor the mood to try to do it all again, so i'll just leave the main argument, The Gorge is a professionally made movie with actors whom we know to be very good (from different movies), but which is bad anyway. It's bad, because it feels like an asset flip (all the monsters are basically the leshen from The Witcher), with a script generated by the following chatGPT prompt: \"gimme a basic movie script outline, based on movies like Annihilation, The Mist, Attack on Titan, The Great Wall, World War Z, pick something from each, mix it together, and make an action movie out of it. Oh, and important thing, i contracted two actors, young guy and a woman, kinda famous, so there absolutely have to be man and a woman. They have a dangerous job, at first they just kinda look at each other, then they get together later, make it an achievement. Something like that, oh and put in some stuff for nerds - like chess, painting pictures, composing opera, some nerdy stuff like that, people sometimes confuse props evoking certain stuff for the stuff itself. Oki, thx!\""
  },
  {
    "rating": "4.5/5",
    "review": "What a fun Friday night movie! We got monsters, explosions, a little love story and … no spoilers but there is also another movie trope that works just fine. Two of our best young actors give this movie everything else it needs. Worth the watch.. dare I even say worth the theatre ticket and popcorn?"
  },
  {
    "rating": "5/5",
    "review": "This is one of the best movies I have seen in a while would highly recommend great storyline and romance."
  },
  {
    "rating": "4/5",
    "review": "The idea is amazing. The creatures are spectacular but I personally think that the romance ruins a little bit the movie. Yes, it adds a mix to the events but it seems too cliche. Anyways, it's a good movie but just not that good"
  },
  {
    "rating": "4/5",
    "review": "I wish I had gone into this without reading a review. This is right up my street. A perfect Friday night beer and pizza movie. Clearly geeked out at one cast member as I had no clue they were in it. I enjoyed both the genres. My only complaint - how many notepads did they have in storage?! It does end a little abruptly but had a lot of fun"
  },
  {
    "rating": "4/5",
    "review": "Was sceptical based on other reviews, but I thoroughly enjoyed it."
  },
  {
    "rating": "4.5/5",
    "review": "great movie for 2025 worth watching 🥰🥰🥰"
  },
  {
    "rating": "2.5/5",
    "review": "SO much potential killed with a forced love story."
  },
  {
    "rating": "3/5",
    "review": "Don't want to spoil it for anyone, so no plot points. Worth watching if you get a free copy, but wont convince me to sign up to a new subscription. Which I guess is the point of streaming movies. From a technical standpoint, some of the scene transitions are quite clunky and don't seam together. Story started intriguing and then slowly faded into....I know exactly where this is going. 😥"
  },
  {
    "rating": "4.5/5",
    "review": "The Gorge – A Perfectly Balanced Thrill Ride Just finished watching The Gorge, and honestly, it hit all the right marks. The story was tight, just enough depth without overcomplicating itself. What stood out the most was how the romance between the two snipers wasn’t just a subplot but the beating heart of the film. It wove itself seamlessly into the action, the tension, and every moment of suspense. Anya Taylor-Joy? Phenomenal, as always. There’s something about her performances that makes every character feel alive. She doesn’t just play a role, she becomes it. And Miles Teller? Equally impressive. Although his performance in Whiplash will always take some beating. He brought the right balance of grit and vulnerability, making the chemistry between them feel raw and believable. The action? Sharp. Well-paced. Not too over-the-top for film genres like this. never lacking. Just the right amount of everything really, suspense, emotion, and intensity. It’s rare for a film to walk that line so well, but The Gorge nailed it. Easily one of the better films I’ve seen in a while. Give it a watch, switch off and enjoy the ride."
  },
  {
    "rating": "4/5",
    "review": "Such a good movie.I fee the chemistry between the actor and the actress."
  },
  {
    "rating": "3/5",
    "review": "It was great until the fell in the gorge, downhill from there."
  },
  {
    "rating": "4/5",
    "review": "This is the best movie made, of the niche Romance, Action, Horror genre. That's not a big deal, but it's a little special. The actors did a terrific job. excepting the comically evil Sigourney Weaver's character."
  },
  {
    "rating": "2.5/5",
    "review": "A complete mess of a film, but still enjoyable. While the concepts introduced in this film are incredibly interesting they end up falling flat. With each idea introduced the other is forgotten, which creates a very surface level Storyline. With those flaws id say the action/romance makes up for it on some level, Anya Taylor-Joy's poise being the most intriguing aspect."
  },
  {
    "rating": "4/5",
    "review": "It held my attention, it was easy to follow and the characters had a great connection. I would certainly recommend to my friends."
  },
  {
    "rating": "3/5",
    "review": "Saw mixed reviews about this one. But it looked like something I’d like so gave it a shot. I liked it. The premise is solid. The writing and dialogue could have been better. As well as some of the visuals. But overall it was entertaining."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie. Has everything you want in a movie."
  },
  {
    "rating": "4/5",
    "review": "The story was good ! the action was great ! The romance was excellent ! In latinoamerica, when we say we want to watch a GOOD movie, this count as a GOOD movie ! Go watch it ☺️ Plus Miles shirtless, OMG 😍"
  },
  {
    "rating": "4/5",
    "review": "Buena acción, sin complicaciones argumentales, buenas actuaciones, romance no exagerado. Me gustó."
  },
  {
    "rating": "5/5",
    "review": "Top notch movie, thoroughly entertaining and some serious scares; had me and the dog on the edge of our seats. Chemistry was dazzling between the two main characters. Definitely worth a watch, specially sci-fi horror fans."
  },
  {
    "rating": "4/5",
    "review": "Although some people feel that this storyline is not realistic enough I think that it is high on entertainment value and allows for scriptwriters discretion."
  },
  {
    "rating": "5/5",
    "review": "This movie has everything! Love story mixed with action and sci-fi! I wasn't expecting to...., but i love the actors, love the story, love this film! And finally an original not a remake!!!! 5/5 from me"
  },
  {
    "rating": "1.5/5",
    "review": "Clearly made for a quick fix streaming service. Script writing embarrassing."
  },
  {
    "rating": "5/5",
    "review": "This is what entertainment is about. Action, romance, monsters and bonkers predictable story. Turn your brain off and have a good time!"
  },
  {
    "rating": "5/5",
    "review": "I loved it, would watch again. Don’t miss it. Best movie of the year so far"
  },
  {
    "rating": "2/5",
    "review": "The Gorge promised a lot but didn’t quite deliver. The initial appeal—whether it was the stunning views, the premise, or the hype—quickly faded once you got past the surface. It’s not a total wash; there are flashes of brilliance (the scenery was decent, or maybe a couple of scenes hit the mark), but they’re buried under a slog of mediocrity. Too much felt underdeveloped or overhyped, leaving me wishing for more substance. It’s not the worst I’ve encountered, but it’s far from memorable. Two stars for effort and potential that just didn’t pan out."
  },
  {
    "rating": "4/5",
    "review": "Storyline could have been better and the ending was a little rushed should have been more to it but that being said this is a very entertaining movie action packed if you looking for a action packed movie and not that big on storylines straight to the point this is the movie for you I enjoyed it for how entertaining it was wasn’t any boring or dull moments was constant with action and the Main two characters was easy to root for I would have give it 5 stars if the ending wasn’t rushed but still a good movie 4/5 stars"
  },
  {
    "rating": "5/5",
    "review": "I loved it. It was very different from what’s out there, you get a feel good, thrilling, romantic, action packed ride. I don’t give a shiiii if there’s holes in the story. I really enjoyed it! Wished I coulda seen in theaters"
  },
  {
    "rating": "5/5",
    "review": "Solid movie, the storyline was entertaining, no dull moments in the movie. The acting and chemistry between Teller and Taylor-Foy was captivating and made me root for them. I was captivated by the story that I wish there was more to it , ending felt a little fast. With how entertaining this movie was , I wouldn’t have minded watching a bit longer for it to develop a little more."
  },
  {
    "rating": "4/5",
    "review": "Great action, good story. Our two protagonists were very well played and easy to root for. Will definitely rewatch with friends."
  }
]