[
  {
    "rating": "1.5/5",
    "review": "Mescal is horribly miscast. Who was responsible for that?!? Not a shade on the first one."
  },
  {
    "rating": "0.5/5",
    "review": "As a fan of the original, I was really looking forward to the release of Gladiator 2. I must have watched the original thirty times, but this, I had a hard time watching the full movie. This offering is badly written, directed and acted. Even without comparing it to the original, as a stand alone film, it's bad. Real bad. If you like Avengers type movies then this might work for you. There's more holes in this than a tramps underpants. Hollywood seems to have lost its soul churning out this type of scrap. The so called \"respected\" actors are to blame her as well, taking the big pay check without any regard for their fans who are paying hard earned cash and giving their precious time to go a see this muck. Drivel"
  },
  {
    "rating": "4/5",
    "review": "I just couldn't buy this man being Maximus's son and having so many of his qualities after only watching him fight a few times as a kid. Other than that, I loved Connie Nielsen, Pablo, the Emperors, and of course the MAJESTIC Denzel Washington"
  },
  {
    "rating": "1.5/5",
    "review": "Generally poor. Ridley Scott should go no where near any historical films. He's no good at them. A bloke riding a rhinoceros? Sharks in the arena? And that leaving aside the historical fantasies. But, worst of all, it's boring. The audience can't engage with the characters When the general dies in the arena ( couldn't be bothered to remember his name) the reaction was \"So what\". A dull disappointment."
  },
  {
    "rating": "3/5",
    "review": "Fire the casting director immediately. Denzel Washington was a terrible choice. Idris Elba wouldve been much better if a black man was needed. Main character was fine acted, but doesn't come close to Crowe. Ok that's fine, very rare for a man to have his calm rage. The emperors were adequate, barely. Overacted at times and underated at others, and that goes for the whole movie. By far though, paying top dollar for Denzel Washington was a terrible plan. This could've been another epic. But the dialogue was so uninspired and weak. Did they just not have the budget to reshoot the scenes enough to get them right. The cinematography really wanted to be as good as gladiator, but the magic I experienced, if any at all was just shreds of the previous movie. Hearing the themes brought back some of the previous magic. Perhaps it's just the lack of Crowe and Phoenix's acting that inspired everyone to be better than they could be. But at the very least, demote the casting director."
  },
  {
    "rating": "2/5",
    "review": "Doesn’t hold a candle to the original. Film itself isn’t horrendous but disappointing in comparison to its predecessor - which was masterful in its writing, storytelling, score and character development. Whilst there are some good performances in this (mainly Denzel Washington, but also Pedro Pascal), there’s not quite enough character development and as a circumstance it seems somewhat thrown together with the odd reference to the first film, without properly delving into it. This makes it tough to really resonate with the characters this time around. The score doesn’t come close to the original either, and the realism of the first film is also less prevalent here. Writing could also be better. Whilst this review might suggest this film isn’t worth your time, I wouldn’t go quite that far. It’s a decent enough action movie, but that’s as far as I’d go. Maybe its predecessor being so brilliant always doomed this sequel to mediocrity, but I don’t think you can be anything but a bit disappointed with it, especially if you’re a fan of the first film. In a recent trend of movie revivals, this is miles off what Top Gun Maverick is to Top Gun. A real shame."
  },
  {
    "rating": "2/5",
    "review": "If it stood on its own it would have been an entertaining Hollywood flick with average dialogue, unrealistic elements but big stars and high quality action. But to have this type of film follow on from one of the all time greats is a crime. Denzel was great as always, as was most of the cast to be honest. I just could not enjoy it as a prequel to its far superior predecessor."
  },
  {
    "rating": "0.5/5",
    "review": "What a garbage movie. Held nothing of the cinematic adventure that was the first one, which is so confusing since Ridley is such a great film maker. Arguably his worst movie. It served no purpose and did not entertain."
  },
  {
    "rating": "2/5",
    "review": "I will give one star for the visual spectacle. And one star for Denzel's performance. The rest of it was weak to horrible. The script is clumsy, most of the performances middling at best. None of the baddies came close to Joaquin Phoenix's malevolence. None of the heroes came close to Richard Harris or Russell Crowe. And the awkward shoehorning of modern political sentiments into it was terrible... from the colonizer guilt expressed by Pascal to Mescal's ridiculous speech about Rome needing to be a sanctuary city. Just... no. No."
  },
  {
    "rating": "2.5/5",
    "review": "While Denzel carries this film that is basically appears to be a CGI filled version of the first Gladiator film, does little to build on it. Paul Mescal failed to pick up where Crowe left off, lacking any real charisma or charm that would make the audience root for him the way they did for Crowes Maximus. Joseph Quinn and Fred Hechinger deserve credit for their work as they brought something fresh and fun to the film"
  },
  {
    "rating": "0.5/5",
    "review": "The historical inaccuracies not only are insulting, but really ruin the movie. They aren’t a director taking liberties. They show absolute incompetence and sheer laziness. To say that the Trojans fought in the Battle of Salamis is unforgivable. I’ve heard Ridley Scott and his so called historical coordinator (who should never work in Hollywood again) talking about prioritizing movie-making and effect over historical accuracy, but that’s complete rubbish. Naming the Trojans instead of the Greeks is pure amateur-hour, and adds absolutely nothing positive to the movie. The newspaper shows ignorance, not effect. Is the history of Rome, gladiators, and the Flavian Amphitheater so dull you have to add sharks with lasers and bad CGI baboons? They had access to crocodiles, why not use them? The fight choreography was boring and dull to boot. That’s expected when two of your main characters in fight scenes are actors over 50. Main character is a dud too. If I don’t buy an actor’s toughness in an action film, good riddance. He looks more like a lead for a new Twilight series. Ridley Scott and his so-called historical coordinator should be embarrassed and ashamed of this movie."
  },
  {
    "rating": "4/5",
    "review": "A great follow on with some very good performances."
  },
  {
    "rating": "1/5",
    "review": "it's a disaster. i just tried to finish it because of the gladiators and i like to finish what i started. it was torturing most of it. so disconnected. would have been best if the left it at just \"The Gladiator\" we mustnt have a sequel."
  },
  {
    "rating": "2/5",
    "review": "A real disappointment. Terrible CGI at the start, unconvincing characters, and severely lacking plot and character development. That said, if you like a very visual film and you're going just for the entertainment, you'll enjoy it. Just don't expect any depth."
  },
  {
    "rating": "1/5",
    "review": "Terrible. You're kidding yourself if you think this movie is good — everyone was miscast. They had some heavy hitters: Russell Crowe Joaquin Phoenix Oliver Reed Their replacements never even came close to matching these guys' screen presence. I found myself not caring at all!"
  },
  {
    "rating": "5/5",
    "review": "A must watch, especially in theatres. A very enjoyable action movie and I liked the fact that they used just the right amount of elements from the first film."
  },
  {
    "rating": "3/5",
    "review": "This was Gladiator with bad CG animals. Very disappointed."
  },
  {
    "rating": "5/5",
    "review": "Better than I thought. While it did have some iffy digital effects we got to see someone killed by a baboon, rhino, and a shark in a gladiator movie. Had a great story and was much more violent than the original movie. Also it was very fun to see Pedro Pascal play the role he got."
  },
  {
    "rating": "5/5",
    "review": "Phenomenal performance and must see"
  },
  {
    "rating": "3.5/5",
    "review": "Doesn't come close to the original, however it's still a worthy watch."
  },
  {
    "rating": "2.5/5",
    "review": "Over-rated. I love Denzel as much as anybody, but IMHO, his performance was sub-par by his standards. I'm glad I didn't pay 15 bucks to see this film."
  },
  {
    "rating": "0.5/5",
    "review": "Well - I made it to about 25 minutes - it was so bad I signed up to rotten tomatoes to write this"
  },
  {
    "rating": "3/5",
    "review": "It was like a greatest hit of the first one. Visual great, minus the terrible CGI, acting good, but no memorable lines."
  },
  {
    "rating": "2.5/5",
    "review": "Visually stunning but quite boring."
  },
  {
    "rating": "3/5",
    "review": "May have been better. Still not a bad movie by any means"
  },
  {
    "rating": "1/5",
    "review": "I was not entertained. The plot was thin. The audience has no connection to the battles because their wasn’t any storyline. Denzel’s American accent was laughably out of place. A super disappointing sequel to a great movie."
  },
  {
    "rating": "3/5",
    "review": "This movie is very good in overall entertainment but the plot and story telling is pretty subpar"
  },
  {
    "rating": "3.5/5",
    "review": "The film was great, but the best moments in the movie were of course carried by Denzel Washington’s character. The movie was okay, it wasn’t bad though."
  },
  {
    "rating": "0.5/5",
    "review": "Bloody awful. The bit with the sharks got a giggle but apart from that it’s terrible."
  },
  {
    "rating": "4/5",
    "review": "Took me awhile to watch this, but it was was actually pretty good. Nothing will ever be as good as the first, but it was OK. The first one I cried twice."
  },
  {
    "rating": "1/5",
    "review": "Bad CGI, bad plot, bad casting of main character that you cannot connect, bad fight scenes without inspiration. Ridiculous names and costumes especially of the starting scene. This was a disaster and if there was not the first movie that was a masterpiece would be rated below 4/10. Not a single good idea, what a shame."
  },
  {
    "rating": "4/5",
    "review": "The wait is finally over. Gladiator II is finally out and we can finally have closure. Well depending on who you ask. If you ask me Gladiator II is your prototypical sequel. Some might even say it's a retelling of the initial story but that isn't for me to decide. I’m here to discuss the here and now. And what we have here is your standard revenge plot with a small dash of political intrigue. Not enough for my liking but I have to give them credit for creating a couple of good storylines. Read Full Review @ ajwallacereviews.com"
  },
  {
    "rating": "4/5",
    "review": "Good length of time."
  },
  {
    "rating": "1.5/5",
    "review": "A movie sequel that did NOT need to made.....with a blah script and average performances and drawn out direction. Why/how does Denzel Washington's American accent fit into the movie? Because no one really cared when making this movie....just a move to cash in on."
  },
  {
    "rating": "5/5",
    "review": "Awesome follow up to Russell crowes Gladiator definitely recommend"
  },
  {
    "rating": "1/5",
    "review": "Awful awful movie!!! I loved the first one and is still my fav movie but second gets a zero. Never felt real and a disrespect to the first one."
  },
  {
    "rating": "1.5/5",
    "review": "That was painful. Ah the scar is on the same shoulder!, he picks the damn sand up like Russel! The only decent soundtrack came from Glad 1, the plot was hokey. They reminded the audience \"what a coincidence, how funny you end up where your father was\" (etc). The whole thing wreaked of desperation from Ridley nonetheless"
  },
  {
    "rating": "1/5",
    "review": "As someone who loves Gladiator from the 2000's, this movie is nothing more than a disappointment. Sure, it's hard to make a sequel of a such a masterpiece (Gladiator from 2000's - not to be mistaken here), but seems like they didn't even try. It's just so, so bad. Lets start with a plot. Poor, predictable. The CGI part - seems like either they hired some students to fix them or did it based on YouTube's \"How to start in CGI world\" tutorials. Yes, CGI is fake in general, but Gladiator 2 takes \"fake\" to the next level. It's a shame to watch. Alright, now acting. Even such a wonderful actor as Denzel can't pull a crappy and boring script and make a masterpiece out of it. Yes, Mr D stands out - no doubt, but he can't lift the whole movie on his shoulders. Acting is vague, without too many emotions in it tbh. \"Are you not entertained?!\" - as a famous quote from G1. Well, there's no chance to enjoy this movie at all, unless you set bar low. Like dead low. Watching this movie for over 2hrs is a job. A job you don't want to have. If you'd like to see a great Gladiator 2 movie. Watch the \"Gladiator\" from 2000's twice."
  },
  {
    "rating": "2.5/5",
    "review": "It Was Ok Kind Of Predictable"
  },
  {
    "rating": "4/5",
    "review": "What a perfect sequel, definitely in the top 10 movies of 2024"
  },
  {
    "rating": "4/5",
    "review": "they enjoyed the film. it was a good action movie. storyline could have been better and some stuff was unrealistic. Denzel Washington was great, as he always is."
  },
  {
    "rating": "3.5/5",
    "review": "Growing up Saturday afternoons on cable TV used to play movies like this and it was fun."
  },
  {
    "rating": "5/5",
    "review": "We rewatched Gladiator before watching the sequel. The acting was superb, and the story was great, but definitely not better than the original. There were great fight scenes, and overall, it was very entertaining."
  },
  {
    "rating": "4/5",
    "review": "Not quite up to the standard of Gladiator but still very good - excellent sound and visuals and strong performances by several leads, most notably Paul Mescal and Denzel Washington."
  },
  {
    "rating": "5/5",
    "review": "Very good action movie!"
  },
  {
    "rating": "2.5/5",
    "review": "As she so often does, Nicole Kidman chooses challenging, complex roles and delivers them with exceptional skill. The chemistry between the lead characters is strong and adds depth to the story."
  },
  {
    "rating": "1.5/5",
    "review": "Did I watch the same movie as all these critics? The last movie series in which I remember this kind of drop off between the first and second movie must have been Lion King 2: Simba's Pride. Denzel was almost as manic as the script. The world didn't feel like it was based in any kind of coherent logic. Pedro was wasted and Mescal was a dud (though he also had a lot of terrible writing to make it worse). Connie Nielsen apparently forgot how to act since the original. I hope Maximus gets his vengeance in this life or the next for this travesty."
  },
  {
    "rating": "3.5/5",
    "review": "It was enjoyable. Some parts were kind of dumb and it was clearly lacking what first film had. I've watch Gladiator probably 25 or 30 times.... I doubt I will watch this one more than twice."
  },
  {
    "rating": "3/5",
    "review": "Gladiator II fizzles out in its arduous effort to prove that the illusion of Rome no longer exists. The ultimate gladiatorial epic had a forgettable and boring return. It's not exactly a carbon copy of its predecessor, though it's ultimately overshadowed by gaudy exaggerations that don't have the same resonance as the original. The overall experience is unsatisfying. Perhaps the bar has been set too high, seeking to match the madness and menace that Phoenix achieved with his performance, or Crowe's brooding charisma. However, when evaluating the film independently and not as a sequel, we find a work that features the cinematic references typical of a director like Ridley Scott, capable of entertaining us until, at the end, the pyramid of cards collapses. The sequel to Gladiator is insipid and suffers the most unfortunate thing that can happen to a sequel: falling into oblivion."
  },
  {
    "rating": "4.5/5",
    "review": "First movie better story. Second movie better action."
  },
  {
    "rating": "1/5",
    "review": "Complete and utter garbage. The lead actoe may well have been a plant as he had the same character and charisma. Character development was zero, thr cringe worthy lines and bad cgi make you realise at every moment you are watchung a seond rate film. Nothing like the first. Lines that make no sense, the main character not earning trust but suddenly.everyone looks up to him and treats him as a hero. Ive seen wood act better and have more charisma and be less stiff. I give this a solid 1 out of 10 for the visuals"
  },
  {
    "rating": "0.5/5",
    "review": "Dreadfully bad, terrible casting and equally poor acting...can't believe this slop was made by the same director as the first Gladiator. Nothing in this sequel feels authentic; something about modern film production is just so soulless and cheap it almost incites anger. Cast this away to the dustbin of history and forget that it was ever made."
  },
  {
    "rating": "0.5/5",
    "review": "Everything feels wrong, even grostesque. It's an insult to the first movie. I will never get those 2 hours back."
  },
  {
    "rating": "3.5/5",
    "review": "Good production value, but storyline was not all that exciting or provide much original content. Enjoyed the cast, though this film did not really provide them too much depth to shine so most the time it was a bit 'business as usual' for them. The sequel came way too late after the first to have real cohesiveness and impact."
  },
  {
    "rating": "0.5/5",
    "review": "You've got to be kidding. How can anyone like this cringeworthy sludge. It's like R. Scott has forgotten how a script works. He can still film set pieces beautifully but everything else about this charisma-free incoherent stupefying mess is just *face palm* --- There is no drama anywhere. The plot is inane. The ending is expensive amateur hour.. as two hostile < armies > wait patiently and silently for two men fight to the death (for no reason anyone would know) and then wait silently as the victor covered in blood, makes an appeal to pacifism -- I had to turn it off there, it was shameful to watch something so deadbrain. I dare you to quote a single line of this utterly forgettable mess. R. Scott's direction/production here reminds me of the Biden Presidency... a senile man doesn't know when it's time to turn the job over to someone competent."
  },
  {
    "rating": "2/5",
    "review": "I was barely able to finish the movie. I wanted to turn it off multiple times. There's no character development to make us love or hate the central cast. Just relies an cliches or caricatures, and it's really rushed. Admittedly I'm comparing it to the first film, and it pales in comparison so drastically that it's intensely disappointing. Russel Crowe's character in the first film earned his love, respect, and admiration, from his friends, soldiers, fellow gladiators, and enemies. Even his owner is willing to die for him. In this film it's like we're all just supposed to assume Lucius has garnered the respect he's given and earned his heroic leadership role, but we don't actually see any of that happen. It never ceases to amaze me how films with bigger budgets, modern technology, and the benefit of a rock solid prequel can bomb so hard. Who watches this in post production and says \"yes, this is ready to release. this is the masterpiece we wanted, and that the fans deserve!\"? Maybe at that point they're so deep in the process that they've lost perspective. I dunno. Anyway, skip it. It's not worth your time. Oh, and how the hell are we supposed to imagine they got 12-ft sharks into Rome, and kept them alive long enough for an elaborate water battle in the Colosseum?"
  },
  {
    "rating": "5/5",
    "review": "Emotional , powerful and adventurous"
  },
  {
    "rating": "2/5",
    "review": "Loved the big reveal at the end, but this film had big gladiator sandals to fill and just couldn't do it. Not even with Denzel Washington on board. Won't be adding it to the home library."
  },
  {
    "rating": "1.5/5",
    "review": "Decent fight scenes and CGI are the only redeeming qualities in this one. Basically a redo of the first movie with worse actors, worse writing, and a less engaging plot."
  },
  {
    "rating": "3/5",
    "review": "CGI was good but over all boring. Could have left out the ridiculous riding the rhino like a horse into the arena and fighting on it, then parking it like a car…smh"
  },
  {
    "rating": "1.5/5",
    "review": "This movie was one of the worst directed, worst acted and most un-interesting I've spent sitting through. There was no one to really root for, and that includes the hero. Bad and silly CGI like sharks swimming in the Colosseum. It seems that the editing was rushed with no interest in making this turkey a bit better. The emperors were horribly acted and the movie relied on things we've already seen in the original Gladiator. This to me is a Ridley Scott disaster."
  },
  {
    "rating": "3.5/5",
    "review": "I really wanted to love it, but ended up just liking it instead. Paul Mescal is a favorite of mine (All of Us Strangers is a master class in acting) so I was a bit disappointed with what he was given to work with. The film as a whole has some big 'holes' in it... plot twists that made little sense, relationships that went from bad to loving in a flash without explanation, that kind of thing. But let me tell you about Denzel Washington... He was simply magnificent! Every moment of screen time I was mesmerized. He's one of the greatest actors of our lifetime. I'm also glad that they took animal torture and murder and removed the sentimentality by making them other-worldly and viscious. I hate anything that kills animals, but being that they were unreal made it palatable."
  },
  {
    "rating": "3/5",
    "review": "Some exciting fights and battles, but ultimately a very slight achievement compared to the first movie. Mescal is underwhelming as Lucius and in fact looks nothing like the boy Lucius in the first movie. Ultimately the movie has some value reminding us how easily a great state can devolve into an aggressor run by mad leaders (can you say USA 2025?)"
  },
  {
    "rating": "1/5",
    "review": "This is by far the most unnecessary sequel of sequels and I have seen The Son of the Mask."
  },
  {
    "rating": "5/5",
    "review": "I still enjoy the movie. I just wish they would of tried to make this movie after the first one.Could of been different. But still bought the steelbook for my collection."
  },
  {
    "rating": "3/5",
    "review": "I don’t think they should’ve made a gladiator II."
  },
  {
    "rating": "1/5",
    "review": "What a disappointment. Watch the first one, you'll understand."
  },
  {
    "rating": "1/5",
    "review": "Dreadful writing. Unfortunately, it’s not saved by its mediocre directing. Oh, how the mighty have fallen."
  },
  {
    "rating": "1/5",
    "review": "Catastrophic movie ."
  },
  {
    "rating": "0.5/5",
    "review": "Stupid boats in the coliseum"
  },
  {
    "rating": "5/5",
    "review": "Movie gets way to much hate the acting is incredicle, the costume desgin is out of this world and the cgi is great. Story Could have felt better but I think they did a great job"
  },
  {
    "rating": "4/5",
    "review": "Gladiator's the rare exception of a sequel actually being good, even though it follows an all-time classic that never should've had a sequel. Denzel's the hero; probably one of his best acting jobs the last 20 years. Mescal's meh, but the emperors otherwise provided some fun moments. Overall the machiavellian twists and turns provide a fun angle for this one that helps push it away from the original and it's vengeance saga, so that ultimately this feels pretty original itself."
  },
  {
    "rating": "2.5/5",
    "review": "Just okay. Not coming close to the first one. Underwhelmed."
  },
  {
    "rating": "3/5",
    "review": "This is not a bad sequel just not as impactful as the first one. The performances were good and new things were added to this franchise in this sequel. Overall, this movie felt like a swan song for the predecessor and in that it was done properly."
  },
  {
    "rating": "2/5",
    "review": "Such an empty movie. Awful casting, the main characters have no charisma or screen presence. The character development is shallow and barely there. Halfway in I couldnt care less what happens to anyone in the movie. Denzel is so out of place here. The emperors look like they're on drugs and don't represent the real life characters."
  },
  {
    "rating": "3/5",
    "review": "not excited about a sequel of a movie so great but alas Paul Mescal and Pedro are here so had to watch it. Basically they repeated the same story, a little twist would've made that more interesting"
  },
  {
    "rating": "4/5",
    "review": "A good script that was well executed and made a suitable sequel to a great film"
  },
  {
    "rating": "1.5/5",
    "review": "What were they thinking with this one the story felt so disconnected and out of place. The only entertaining part was Denzel yet again. 4/10"
  },
  {
    "rating": "1/5",
    "review": "Aimed at a 13 year old audience. I'm surprised creators of this wast of time of a movie didn't throw in some ghosts, magic, witches, dinosaurs and a few transsexual characters too. I'm sure actors made money but it didn't do their reputations any good."
  },
  {
    "rating": "3.5/5",
    "review": "The original Gladiator is a masterpiece, and while not as good Gladiator 2 is still a worthy sequel. Great visuals and choreography and really good performances all around."
  },
  {
    "rating": "5/5",
    "review": "Crítica de Gladiador 2 Gladiador 2 chega carregando o peso de um legado monumental e, surpreendentemente, sai da arena com a cabeça erguida. O filme mantém toda a estrutura que fez do original um clássico: a corrupção entranhada de Roma, o espetáculo brutal das arenas e a tensão constante entre honra e poder. Desde o primeiro ato, fica claro que há respeito pela obra anterior, e isso é algo que os fãs mais puristas agradecem. Os novos imperadores, os irmãos Gêmeos (Grega e Caracala), brilham como antagonistas. Mimados, arrogantes, voláteis são uma releitura fiel do que foi Commodus, e talvez até mais perigosos por estarem em dupla. Caracala, em especial, entrega uma performance desequilibrada que remete diretamente à loucura de Calígula, especialmente na referência ao cavalo Incitatus como cônsul, um detalhe histórico que os cinéfilos e historiadores vão captar com gosto. A trilha sonora continua arrebatadora, emocional e grandiosa, conduzindo o público como um coro romano moderno. As cenas de batalha mantêm o mesmo ritmo visceral e emocionante do primeiro filme, com coreografias intensas e realismo sangrento. A volta de rostos conhecidos do primeiro filme eleva ainda mais a carga emocional e a imersão há momentos em que a nostalgia se mistura com o impacto do novo, criando algo realmente especial. Dito isso, Gladiador 2 não está livre de falhas. O CGI dos macacos no início é simplesmente desastroso um detalhe que poderia ter sido facilmente evitado e que destoa do restante da produção. A morte do General Acacius é outro ponto fraco: sem impacto, sem construção, sem importância real. Sua presença no filme é quase nula, e sua saída passa batida, como um personagem que nunca chegou a importar. Outro ponto que precisa ser dito: este filme não precisava existir. Em essência, é uma cópia direta do primeiro. A estrutura é a mesma, os conflitos são similares, e a sensação de déjà vu é constante. Se não fosse por Denzel Washington que domina a tela com carisma e presença o filme correria o risco de se tornar monótono. Ele carrega o enredo nas costas, entregando um personagem magnético e cheio de camadas. Mesmo assim, Gladiador 2 entrega o que promete: emoção, brutalidade, e uma Roma tão suja e fascinante quanto antes. É uma sequência que respeita o original, mesmo que não o supere e, para muitos fãs, isso já é o suficiente para aplaudir de"
  },
  {
    "rating": "4/5",
    "review": "I finally got around to watching Gladiator 2! I loved the battle sequences and all the performances, especially from Denzel Washington and Pedro Pascal. The story follow Lucius Verus Aurelius, the exiled Prince of Rome, who becomes a prisoner of war and forced into fighting as a gladiator for a man who plots to overthrow the twin Emperors Geta and Caracalla. The action sequences were brutal and intense, the cinematography phenomenal, brilliantly transporting you back in time to Ancient Rome. Gladiator 2 honors the legacy of the original film and skillfully weaves in themes like the consequences of power and greed, loyalty, and sacrifice. Gladiator II is a fantastic historical epic that shows that Ridley Scott is still a phenomenal filmmaker. The sets, costumes, and production design were crafted with amazing attention to detail. If you’re a fan of the original Gladiator starring Russell Crowe, definitely give Gladiator II a watch!"
  },
  {
    "rating": "3.5/5",
    "review": "Not as good the first, but worth the watch."
  },
  {
    "rating": "1.5/5",
    "review": "Don‘t know what this movie wants to be. A remake? An hommage? What‘s pretty annoying are the fast cut scenes. There‘s no athmosphere at all. Action is well made and kudos for Pedro!"
  },
  {
    "rating": "3/5",
    "review": "It couldn't live up to the expectations of the first but overall it is a good movie."
  },
  {
    "rating": "5/5",
    "review": "One of the best sequels ever made. Absolutely epic! Wonderfully written, brilliantly arranged, looks and sounds jump off the screen. It even lifted up the first movie. It wasn’t derivative at all - it honored the first movie while following through on things that you would expect with the added creativity this movie brings. Every second was masterful. This will age like a fine wine."
  },
  {
    "rating": "1/5",
    "review": "Why is it Romans all look and speak British. Imagine doing this with any other culture..."
  },
  {
    "rating": "0.5/5",
    "review": "Huge fans of the first Gladiator film. Excited to watch Gladiator II in part due to the good reviews, but compelled to comment/review as we were so hugely disappointed. Struggle to find any positives in a film that falls so far short across all dimensions. This is an unadulterated cashcow violation of the original film/franchise and a great opportunity lost. Given the poor quality feel a new distrust for reviews/ratings and wonder how many of the reviews are bots/paid and how many are from genuine audience members and critics."
  },
  {
    "rating": "4/5",
    "review": "Denzel's performance carried this film. But still fell short expectation. Original Gladiator is a classic not to be compared."
  },
  {
    "rating": "0.5/5",
    "review": "Factoring in the big budget and the stellar cast, for how miserably it failed to deliver, this has to be pound for pound one of the worst movies of all time. No consistency, laughable script, mediocre plot, sub-par characters and character arcs. Oh my goodness. I'm always compelled to say this is a stain on the legacies of some great and iconic actors."
  },
  {
    "rating": "2/5",
    "review": "Denzel and Nielsen rock, the plot is annoyingly dumb, the big battles make little sense, and even if one ignores the historical stupidity the writing is bad"
  },
  {
    "rating": "1/5",
    "review": "This was laughably bad on multiple levels. They really ‘jumped the shark’ with the flooded colosseum scene in particular."
  },
  {
    "rating": "5/5",
    "review": "This was epic, straight up wild from start to finish 🍻"
  },
  {
    "rating": "5/5",
    "review": "Filmão as criticas são descabidas!!!!"
  },
  {
    "rating": "4/5",
    "review": "Contrary to a number of previously published reviews from people who are big fans of the first film, this is certainly not a disappointment. The style and scenes are all very artfully put together and I personally think it is a good successor to the first film. I am not easily satisfied but I definitely recommend watching this!"
  },
  {
    "rating": "2/5",
    "review": "Unnecessary movie, already forgotten what its about. Lots of shouting, boring, predictable"
  },
  {
    "rating": "3/5",
    "review": "Disappointing how derivative it was of the original. If you’re going to be derivative though, the first GLADIATOR is a good pick. Saved by some great production values and a typically exceptional Denzel Washington performance."
  },
  {
    "rating": "5/5",
    "review": "Definitely, a good and enjoyable sequel."
  },
  {
    "rating": "1/5",
    "review": "Half way in and the movie still hasn't fully captured me. Gladiator was a masterpiece and I strongly feel they should've left it at that. There are so many stupid things in this movie. I understand moviemakers want to project excitement and grandeur and what not. A guy riding a rhino, a boat with hardly any speed breaking through another boat, the overall bad acting and bad scenes, and so much stupid CGI. Not even sure Gladiator lend itself for a sequel, the story was pretty much finished. Gladiator II feels like milking the idea and going way overboard. So much senseless CGI as well. So many plotholes and things that make 0 sense. There are a few actors in the movie that I absolutely adore. But am not giving stars for stars, am giving stars for the movie. In my opinion the movie isn't worth it. Way overhyped etc."
  },
  {
    "rating": "0.5/5",
    "review": "Boring, long, and un-needed. Cast can’t compare to the original- and while Denzel tries his best, crappy writing makes this a long, boring slog of a film."
  },
  {
    "rating": "4.5/5",
    "review": "No, it wasn't the first one. However, this was a great movie. I expected to be disappointed, but I really enjoyed the whole movie. It was pretty damn good. There was lots of good fighting, and the plot was good as well. People bashing on it never gave it a chance."
  },
  {
    "rating": "1/5",
    "review": "A completely unnecessary sequel. It doesn’t compare to the original Gladiator, which was remarkable and unbeatable."
  },
  {
    "rating": "1/5",
    "review": "Absolutely corny beyond words. Actors start to finish awful script . Main character gets on nerves after first 15 min and couldn’t make russel crowes toast for breakfast. Pedro pascal says ROME what the f kind of accent is this? Same with Denzel my goodness not sure what’s more silly the things he says or the way he says them. Bad lines can’t be hidden. Big mess of bad made up accents that no one sounds the same at all. Over the top sexual stuff and the white pale make up way over done had no substance added nothing was annoying. Weak pointless sequel. Don’t waste your time."
  },
  {
    "rating": "2.5/5",
    "review": "Has its moments but none of them are moments like the first and Paul Mescal as a ‘maximus’ type character is a complete miscasting, he has very little presence and even less charisma for such a big role, I really don’t understand where the thinking was behind that one. It looks great though and definitely is visually arresting but without a strong lead it falls very short. Denzel does well though and the emperors are suitably repulsive but the first film… it sure ain’t. Bit disjointed in flow as well."
  },
  {
    "rating": "1.5/5",
    "review": "It’s just bad. Stain in Denzel’s career one of my favorite actors."
  },
  {
    "rating": "3.5/5",
    "review": "It’s hard to follow a masterpiece like the first Gladiator movie. But once you get though the beginning, it gets better."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was just bad, the cgi was the main selling point and that sucked too. The story was mediocre at best and recycled scenes from the original which just made me remember, oh yea! I could be watching a better movie! Horrible movie, legit walked out halfway through because of how badly it sucked"
  },
  {
    "rating": "1/5",
    "review": "Smh .....why? Why would make part 2?!?!? Dumb movie"
  },
  {
    "rating": "5/5",
    "review": "For all action lovers this movie is amazing even though it might be brutal but i like it because it isnt as sad as the first one"
  },
  {
    "rating": "2/5",
    "review": "Ctrl C + Ctrl V windows 8"
  },
  {
    "rating": "3.5/5",
    "review": "Better than I thought it would be, but not as good as the first"
  },
  {
    "rating": "4.5/5",
    "review": "This movie is absolutely cinema. The visuals are stunning and I found the acting very good. My only criticism is that it was extremely similar to the first gladiator movie, it could've stood to be abit more different."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible. Bad history and CGI. Completely unnecessary and boring"
  },
  {
    "rating": "0.5/5",
    "review": "I tried so hard to get through the first 30 minutes of this shadow that tries so hard to be Gladiator but falls on it's face. Maybe I'll try again later but it is so lackluster I wonder how this was ever shown in theaters."
  },
  {
    "rating": "4/5",
    "review": "Enjoyable sequel with a reasonable story continuity of the first installment"
  },
  {
    "rating": "4.5/5",
    "review": "Ridley Scott continues to be unmatched in his ability to create and capture epic spectacles with a story that I didn't expect to be as worth while as it was so many years after it's first and praised predecessor. While the majority of this 2 hour 30 minute epic is almost flawless, it's weird to feel that it's story felt rushed throughout, pushing from one moment to the next far too quickly. I would have gladly welcomed a 3 hour version of this film. Even through a surprisingly rushed paced story it still gave enough time to allow each story to create tension and a dread of what outcome could prevail in a edge of your seat fight between Mescal and Pascal."
  },
  {
    "rating": "3/5",
    "review": "Gladiator 2 is entertaining enough to sit through, but it feels lackluster compared to the original. The story is hollow, with little setup or backstory to make you invest in the characters. The battle scenes, while well-shot and occasionally engaging, lack real weight because the stakes are never clearly defined. Paul Mescal doesn’t quite have the presence to sell himself as the gladiator, so when it’s time for his big speeches, they feel awkward and even a bit corny. Denzel Washington is easily the standout, carrying the film as much as he can, but it’s still not enough to make this a must-watch. If you skip it, you’re not missing much."
  },
  {
    "rating": "2/5",
    "review": "Rushed/Story Made No Sense."
  },
  {
    "rating": "5/5",
    "review": "I loved the story, I never watched the first one but I was able to understand what was going on and I enjoyed it!"
  },
  {
    "rating": "3/5",
    "review": "Incredible actors, but such a typical blockbuster written film. So predictable and just blah, who cares."
  },
  {
    "rating": "1.5/5",
    "review": "Watch the first movie, the original Gladiator. Then watch this. Not even on the same level. Who gets paid to rathe this movie like other people have given good reviews. It’s not good. It’s not worth the watch. Typical studio trying to make money off a old great film but can’t come up with original ideas."
  },
  {
    "rating": "1.5/5",
    "review": "Weak performances of most actors. Denzel lifting all he can but the dialogue throughout the movie is incoherent and uninteresting. Yet another movie trying to tell a story of love, death and betrayal, but resulting in a cartoonish wannabe, not worth the time. Sadly."
  },
  {
    "rating": "2.5/5",
    "review": "Why are we rewriting history to be more politically correct"
  },
  {
    "rating": "5/5",
    "review": "Absolutely wonderful production and execution of this film. From start to finish it had me excited and intrigued to what was next in the best way possible."
  },
  {
    "rating": "1.5/5",
    "review": "Beautiful looking, but not much of a foundation to hold up the epic energy."
  },
  {
    "rating": "5/5",
    "review": "Execution across the board."
  },
  {
    "rating": "0.5/5",
    "review": "TOO MUCH REPEATING, AND COPYING, AND MIMICKING (DA MIMIC)!!!! DON'T GET ME STARTED ON THIS FILM IT'S THE ORIGINAL BUT WORSE!!! It heavily disappointed my dad so the film is actually 0/10 Gladiator 1 was goated, this film 0/10 Go watch the original 10/10 not THIS JUNK!!!"
  },
  {
    "rating": "2.5/5",
    "review": "The movie had the feel of Gladiator but falls short of the original by miles. The character development I found weak to the point you never really hate anyone or really love anyone. Russell Crowe, Joaquin Phoenix and Richard Harris captivated us from beginning to end while Paul Mescal leaves us feeling indifferent. Denzel was good but when you think of Training Day we needed a little King Kong ain't got s*** on me attitude from his character. The water scenes at the Coliseum are laughable where laughter should not be in such a film. SPOILER ALERT. Lucilla's death was pointless as far as I was concerned and it looked like Lucius would save her but failed. Him saving her and fighting Macrinus while being hurt as Maximus did with Commodus would have been a very nice parallel whilst leaving Lucilla alive would have cemented both movies together nicely. The death of Acacius was also a real waste as he was the only character that even came close to Maximus. I was hoping he and Lucius would come together and take down the tyranny of Rome giving Lucius a true father figure and family that he had so lacked after Lucilla sent him away. Acacius was not a real Roman anyways so just another disappointing dead end. I watched it and was entertained mildly however my recommendation is to watch this one first and then watch the back story Gladiator . At least you will walk away totally satisfied."
  },
  {
    "rating": "0.5/5",
    "review": "Oh, come on already... time for the great Ridley Scott to retire. A cheap remake of the original with bad acting, bad dialogue, and a shallow characters.... Time to find some new story tellers...."
  },
  {
    "rating": "3/5",
    "review": "Pretty good movie 👍 up until a certain point in the movie it felt like a remake of the first movie but rushed, and then at a certain point things started to shift to another direction"
  },
  {
    "rating": "3/5",
    "review": "Unlike the first, this is utterly mediocre."
  },
  {
    "rating": "4/5",
    "review": "Not as good as the original. To much CGI"
  },
  {
    "rating": "4/5",
    "review": "I watched Gladiator and then this film the next night. Not knowing much about either, I wasn't sure what to expect. I thoroughly enjoyed both! And Gladiator II was very well done and, I would say, competes with Gladiator. Good storytelling, compelling acting and a plot that keeps your attention. Definitely watch the first one and then this one to catch all references."
  },
  {
    "rating": "1.5/5",
    "review": "I don't get the positive reviews. The acting was good except for one exception: the lead. Unbelievable. Seemed like they picked some UPS driver because he claims to have done two years of drama class in High School and said \"you will be the star of this\" because he also works out at the gym. The story was not that compelling. The obvious focus on \"the whiter the person, the more they are the villain\" has become a trope so overused that I guess I have to expect it, at this point, to the point where they artificially made the Kyle and Chad the emperors (IG influencers? Hard to be sure) as white as they could. The ending was a predictable \"why can't we all just be friends\" phoned in ending. I'm giving it 1.5 stars because I didn't turn it off, so any time I finish a movie it gets a baseline 1.5 stars because I didn't flee from it in horror. If I was to give it a positive, the director work was pretty good, typical Ridley. But there was only so much he could do with that story and that lead actor."
  },
  {
    "rating": "1/5",
    "review": "So far, the Ridley Scott retirement tour is total ass. This was worse than Alien: Romulus, which is really sad considering the sheer amount of wasted on screen talent."
  },
  {
    "rating": "2.5/5",
    "review": "Leider ist der Film mit dem Hauptdarsteller eine Fehlbesetzung ! Langweilig und nicht historisch erzählt."
  },
  {
    "rating": "2.5/5",
    "review": "Gladiator II is a disappointing, unnecessary, and inferior sequel. The story is a complete retread of the first movie, with the revenge plot, evil rulers to overthrow, and a gladiator who rises up to inspire the people. The only real difference is that everything is just worse. Paul Mescal is fine, but he's not as great as Russell Crowe. The evil emperors are fine, but they're not as great as Joaquin Phoenix. The music score is fine, but it's not as great as what Hans Zimmer did for the first. The cinematography is fine, but it's not remotely as gorgeous as it was in the original. The film lacks any real originality and keeps leaning on flashbacks and dialogue from Maximus in the first movie. I just couldn't care about any of the characters. It does have some cool gladiator battles, and Denzel is a pretty fun villain—but that's really it. Do better, Ridley Scott!"
  },
  {
    "rating": "5/5",
    "review": "Not as good as the first one but still a good movie Pedro pascal is an amazing actor and Denzel Washington is very good"
  },
  {
    "rating": "2/5",
    "review": "Terrible. No emotion. Very forced. Money grab"
  },
  {
    "rating": "2.5/5",
    "review": "The story could took different directions. Definitely not a film I would watch again like part 1."
  },
  {
    "rating": "4/5",
    "review": "I understand where some people say this movie lacked, but man what a continuation. Amplified applause!"
  },
  {
    "rating": "0.5/5",
    "review": "It's a rip off the first movie. The plot is obvious and far fetched."
  },
  {
    "rating": "2/5",
    "review": "Blatant attempt at encashing the success of the infinitely superior Russel Crowe flim. This one's more like a TV movie with little gravitas."
  },
  {
    "rating": "2/5",
    "review": "What a shame!! The original Gladiator is one of my favorite films, but this sequel was a weak and largely ineffectual effort that only reminded me of how incredibly powerful the performances were in original. Russell Crowe's intense and powerful presence in the original film was unforgettable, as was Joaquin Phoenix's embodiment of evil as Commodius. None of the actors in the sequel could match the performances in the original. This film teeters between unconvincing charactatures of the emperors, and the sometimes powerful performance of Denzel Washinton, who seemed to take his role seriously most of the time. A big disappointment."
  },
  {
    "rating": "1.5/5",
    "review": "This movie is a disaster. Poorly written, bad performances, too long, bad CGI, miscast, and badly directed. This is by far the worst Ridley Scott film I have ever seen. Pedro Pascal was fun to watch and that was it. Denzel doesn't fit the role and performances across the board seem unnatural. So glad I didn't see this one in the theatre. 2024 will go down in history as the year of bad sequels and remakes (Gladiator 2, Dealpool 3, Alien Romulus, Mad Max Furiosa, Ghostbusters Frozen Empire, Nosferatu... just to name a few). Trust me skip this and go watch Those About To Die on Peacock, much better if you're looking for decent Gladiator action."
  },
  {
    "rating": "1/5",
    "review": "Where to begin…terrible script, no continuity with the original, poor character development, shoddy and unbelievable narrative, budget CGI, a good set of actors wasted on meaningless dialogue, ridiculous and unbelievable action sequences (guy riding a tame rhino?!). Turned off after an hour, shocked that Ridley Scott produced and directed it, it’s awful."
  },
  {
    "rating": "0.5/5",
    "review": "An awful sequel no one asked for. Most were rooting for the sharks...."
  },
  {
    "rating": "3.5/5",
    "review": "An excellent cinematic experience, even if it’s not an excellent film."
  },
  {
    "rating": "2/5",
    "review": "This movie struggled all the way through. I didn’t like the editing style at all. The plot and dialogue were laughable."
  },
  {
    "rating": "1/5",
    "review": "Forgettable, pointless, underwhelming."
  },
  {
    "rating": "1.5/5",
    "review": "I really wanted to like this movie because Gladiator is my all-time favorite movie. I feel that this second movie took away from the first. Maximus loved his wife so much, but supposedly had an affair that resulted in a child? The movie would've been better if they didn't tie Lucius to Maximus like that. I the acting was great and the fighting was awesome, but they ruined Maximus' character."
  },
  {
    "rating": "5/5",
    "review": "Gladiator 2 quickly became one of my favorites and immediately went into my Letterboxd top four. This movie is one I will continue to watch and recommend for years to come (along with the first one). While it had many pleasant ties to the first one I feel it developed its own unique and interesting storyline along with well developed characters. It is a film with a powerful story that has an impact on you and has a powerful message that adds to the impact. Paul Mescal did an amazing job following in the footsteps of Russell Crowe. It gave me the sort of adrenaline rush I crave from movies that makes me want to come back again and again for more (which I did). It had so many great scenes and so many great characters. This movie and it's cast has definitely become my Roman Empire. I fear you do not know what real cinema is until you have watched this movie."
  },
  {
    "rating": "2.5/5",
    "review": "Bad casting with denzel...doesn't have the heart the 1st film has....should have stayed a what if..."
  },
  {
    "rating": "4/5",
    "review": "I actually didn't know if I'd like this movie. And although it wasn't as good as the original it was very well done and exciting.. with the exception of the ocean in the colosseum.. other than that its a very good movie.."
  },
  {
    "rating": "2.5/5",
    "review": "Not as ambitious, bold, or creative as the first, Gladiator II traces along a lot of the lines drawn by the first with a few variations added in. As a result, it doesn't take itself as seriously as the predecessor, and that does help make it a bit more fun in a foolish kinda way. It does manage to hold its own against the original for much of the runtime before becoming an anticlimatic dragging mess."
  },
  {
    "rating": "5/5",
    "review": "For all the people that are talking trash about this movie, they must have been distracted while watching it. I thought it tied up the story from the first one. Outstanding cast and ended the way it should have!"
  },
  {
    "rating": "1/5",
    "review": "Terrible plot, casting and acting. Denzel is good but he can’t carry this movie"
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies I have seen in my entire life"
  },
  {
    "rating": "2/5",
    "review": "A mediocre film; not bad and not very good. It is in my estimation pretty boring and nowhere nearly as entertaining as it's predecessor. It is predictable and and never really ignites any real interest. Why is Hanno admired and allowed to lead his fellow gladiators? This is never explained nor does there appear to be any reason why he is the leader. I streamed this film in stages, viewing it over a relatively long period of time. It did little to pique my interest or excitement."
  },
  {
    "rating": "1.5/5",
    "review": "A mockery of the original classic, an unworthy sequel. Despite the stunning visuals, every moment filled me with pain."
  },
  {
    "rating": "3/5",
    "review": "By no means is this as good as the first one, but that would be really hard to beat. It was an enjoyable action flick but it relied a lot on nostalgia from the first movie. I wish it would stand on its own two feet."
  },
  {
    "rating": "5/5",
    "review": "Wspaniałe kino historyczne. Może fabuła trochę mija się z prawdziwą historią ale opowieść jest wspaniała. Niestety ale już nie kręci się takich filmów."
  },
  {
    "rating": "2/5",
    "review": "Complete shite of a film. The only saving grace was Denzil Washington."
  },
  {
    "rating": "1.5/5",
    "review": "“Gladiator II” attempts to recapture the grandeur of its predecessor but falters by imposing modern sensibilities onto ancient Rome. While visually striking, with impressive set designs and action sequences, the film struggles with historical authenticity, often feeling too Americanized. The narrative closely mirrors the original but lacks depth, relying on unfinished CGI elements and forced political parallels. Strong performances, notably from Denzel Washington, provide some engagement, but the film ultimately feels thematically shallow. By trying to fit modern societal issues into a Roman setting, “Gladiator II” sacrifices authenticity for contemporary commentary, resulting in an uneven experience."
  },
  {
    "rating": "0.5/5",
    "review": "Too many political social issues attached to this film. Love most of what Denzel Washington does. This film shouldn't be associated with the Gladiator. Clearly all about social BS. A disgrace to all aspects of the first Gladiator film."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is so so so bad. The acting is poor and unconvincing. The cgi is (unbelievably) bad. The story and writing is bad. It’s so heavy handed, there is no subtlety in it. There are lots of interesting stories about Rome, there is no excuse to make a movie this bad about it. Why not tell a different story? It’s so bad. What a waste of time. I’m trying to come up with something good to say—the lighting maybe? Costume and set design? Jesus it sucks."
  },
  {
    "rating": "1/5",
    "review": "Simply annoying to watch. So many strange facial expressions and weird smiles by the characters, the characters were so silly in the things they said and how they said them. Overall poorly developed script. The people in the crowd yell \"boo!!\" Full of those little things that just don't make sense. Or things like the guy's friend he met in prison was later the guard of his cell, and obviously just gave him the key to escape, just like that. Fight scenes are just plain stupid and predictable like the last fight with denzel, in slow motion, so cheesy. The emperors were really annoying characters. Hated it 💯"
  },
  {
    "rating": "2.5/5",
    "review": "It's a copy of the first movie but felt rushed. Good action sequences but character development and more intense arena fights are lacked"
  },
  {
    "rating": "1/5",
    "review": "Boring, little substance compared to the original."
  },
  {
    "rating": "4/5",
    "review": "A light action film with elements of history in a pinch. A perfectly fine film and that's all, the cast is excellent."
  },
  {
    "rating": "4/5",
    "review": "This long awaited sequel to one of the greatest films of all time could never live up to its predecessor; however, it is very good. The story takes place sixteen years after the death of the last great Emperor of Rome, Marcus Aurelius. The story could be watched as a stand alone; however, it continues and ties in the original. Connie Neilson is great in reprising her role. Denzel Washington is very good. Pedro Pascal is very good. The Twin Emperor's channel Joaquin Phoenix. Paul Mescal is good in the lead. He is not Russell Crowe bit good. Ridley Scott continues to be epic and make epics."
  },
  {
    "rating": "3/5",
    "review": "It was enjoyable, but no where near as good as the first Gladiator. Denzel Washington stole the show with his stellar acting. However at times Washington's swagger reminded me of a movie he did years ago called American Gangster and seemed more suited for that time then ancient Rome. Some of the animal scenes were kind of silly. I wished we could've seen more of Pedro Pascal. He did such a wonderful standout job in The Game of Thrones. What a wasted opportunity."
  },
  {
    "rating": "1.5/5",
    "review": "This movie is best categorized as: the bad early-2000s sequel that the studio simply forgot to make. If you want bad writing, bad CG, bad action, and way too much color correction, this is your flick!"
  },
  {
    "rating": "3/5",
    "review": "Mescal is spectacular. Denzel is impeccable. The film is more fan service than it is an engaging and worthy storyline. This fanfare can be enjoyable, yes, but when historical accuracy wavers, it loses some of its appeal. More was expected out of a long-anticipated remake."
  },
  {
    "rating": "0.5/5",
    "review": "Hot garbage. Bad character building, flashbacks were poorly done, and used too many references to things that didn't exist during the time period."
  },
  {
    "rating": "2.5/5",
    "review": "If you saw Gladiator, this sequel will disappoint. This is more about family forgiveness."
  },
  {
    "rating": "1/5",
    "review": "Meaningless, expensive trash."
  },
  {
    "rating": "2/5",
    "review": "This is a film that after watching it once, I would not wish to endure it again. What is Ridley Scott doing? This was rubbish and so predictable, with no real feel for the movie at all. If this is what Ridley Scott has become, it's best he retires."
  },
  {
    "rating": "1/5",
    "review": "Don’t expect anything living up to the great movie that was “Gladiator”. This is Sci Fi Channel level CGI with a story that made 0 sense. If you want a good laugh go for it."
  },
  {
    "rating": "2/5",
    "review": "Great acting, but the story line was rushed and paled in comparison to the original. Why can’t the studios just leave a classic alone? Not every movie needs a sequel."
  },
  {
    "rating": "0.5/5",
    "review": "I cannot believe how many four and five star reviews there are to this piece of garbage. The only thing worse than the storyline was the character development"
  },
  {
    "rating": "1.5/5",
    "review": "Rubbish…Denzil is the only good thing to come from this movie. Script is poor, English accent of main character is annoying and why? Duplicate of original story. Too many similarities. Disappointed"
  },
  {
    "rating": "2.5/5",
    "review": "Gladiator's latest instalment focuses more on the arena than the showdown. It's action sequences and visual effects are more than enough to conjure up the thematic warrior story but it was too ordinary compared to the resources it had. CGI was decent enough to look good with the dusty background of the arena. Audio effects were strong enough to give life to the blades. Great performances. Denzel's confident work was remarkable. Excellent cinematography and good action sequences that adds value to it. On it's own Gladiator II is a fun movie and it has revived discussions about it's predecessor yet again."
  },
  {
    "rating": "3.5/5",
    "review": "I really enjoyed this sequel .I will admit when it was first annouced or getting mentioned over a year ago i was worried . The action was great along side the story . Denzel Washington ,Paul Mescal ,Connie Nielsen and Pedro Pascal were all great ."
  },
  {
    "rating": "5/5",
    "review": "... and the echo RESOUNDS, with strength as it's own film and honor to the original. COLOSSAL - JAW-DROPPING - HEROIC - MAGNIFICENT I thought the sheer scale of Gladiator was peak... but Gladiator II takes it to a BIBLICAL SCALE. Dare I say... colossal... they just don't make movies like this anymore. A million extras. All in costume. Sets the size of cities. This really connects to the first film. It actually makes it feel as though Gladiator was incomplete, but in a natural way, and Gladiator II carries on the story seamlessly. There were so many reference points to the original film's plot-line, it almost created a sort of pattern... but in a good, ancestor-descendant, follow-in-the-footsteps sort of way. Gladiator II still makes plenty of its own unique plot points. The twin emperors. The gladiator owner with a different motive. The different types of fight scenes and battles in the arena. --- SPOILER ALERT --- A great example is the eluding to Hanno's death throughout with the afterlife scenes, but it's a fresh take that he doesn't die in the end. For such a huge film, the cast is surprisingly small. Mescal and Pascal lead, with Neislen and Washington close behind; Quinn and Hechinger take supporting roles. Mescal is actually the perfect man to cast as Hanno... too much to say, but he's got this face-set-like-a-flint look, and it's perfect. Neilsen steps back into her role confidently, the only main character to return from the original film (ha, because all the other o.g. characters are dead). The twin emperors definitely have the childish Commodus vibe... Quinn brings this wide-eyed, crazed look, while Hechinger has a foolish air about him... but, perhaps too much so. I wanted to see their effect on the empire more directly and their power that has maintained their ruling status for so long. Washington's performance had some moments that felt too modern and casual to be Ancient Rome... he needed to be more... set in the time period to be more believable. Perhaps in this wonderfully overwhelming scale... some of the emotion is lost in favor of more action, more blood. The chemistry between Mescal and Connie as son and mother was just bursting, but felt held back just a bit. Another scene with them could have really anchored this in that emotion from the first film. Even so, Gladiator II still held this... rage and resolve underscoring the whole story; just a different type of emotion. Of course, to address those points (emperors' impact & added emotion) would take up more screen time. But I was so ready for this film to be a solid 3hrs long... I wish it was... This sequel definitely redeemed the cheesy special effects/afterlife scenes from its predecessor. Seeing the afterlife through Lucius' vision was unique from Maximus' perspective, and painfully poetic. ... my main critique was actually the score. I was really looking forward to the score, but I don't think Gregson-Willaims could quite live up to Zimmer's masterpiece. I wasn't sure who was scoring the film until the opening credits, and felt significant disappointment that Zimmer was not returning to score. Speaking of the opening credits... Ridley needs to open ALL of his films like that. Holy crap. That is ART. And the title card? Don't even get me started. This film had my jaw-dropped from that exact moment on. For those of you who missed Dune: Part Two in IMAX/Dolby... DO. NOT. MISS THIS ONE."
  },
  {
    "rating": "0.5/5",
    "review": "Am I able to give this movie zero stars?!?! What a ridiculous waste of my life that I can never get back. The acting was tragically bad, the storyline comical, & themes pathetically underdeveloped."
  },
  {
    "rating": "1/5",
    "review": "Terrible. An uninspiring main character given rambling nonsensical speeches to laugh his way through a carbon copy of the first. It feels like a high quality rip off written by AI."
  },
  {
    "rating": "4.5/5",
    "review": "Well done and a great sequel to the film."
  },
  {
    "rating": "2.5/5",
    "review": "Well... um.... I mean... just... no."
  },
  {
    "rating": "5/5",
    "review": "And \"Gladiator II\" is an epic. Love, vengeance, loyalty, betrayal, lost faith, returned conviction.. nice movie.."
  },
  {
    "rating": "4/5",
    "review": "Pleasantly surprised. A sequel is often difficult to pull off, but they did well. Acting was great. Denzel Washington was superb. No complaints with the CGI. The biggest complaint, the sharks. Even though sharks was an interesting twist, it didn’t align with the time frame. Overall, well done."
  },
  {
    "rating": "1/5",
    "review": "Shield you eyes from this movie if you like Rome or Antiquity."
  },
  {
    "rating": "5/5",
    "review": "Nice film l hope they can make a new film againn"
  },
  {
    "rating": "1/5",
    "review": "Poor acting (except Denzel) No emotion in the characters.The lead character was bland, cliche lined and just unbelievable. The CGI is terrible, like a cartoon. The creatures are unrealistic and silly. Movie was totally predictable and campy.We hated it"
  },
  {
    "rating": "2/5",
    "review": "Relies too much on the original and storyline shades the old one but very weak. Performances except for Danzel's very lightweight."
  },
  {
    "rating": "0.5/5",
    "review": "Put 2.5 hours of your life into anything else- not worth it. Did anyone put any effort into this? Did the directors and writers think the audience would appreciate this unoriginal boredom? What a waste of time and money on everyone's part. How in the actual f+++ did RT audience give this an 82%?? Google reviews is way more accurate - less respect for RT these days. Moving on. Bye."
  },
  {
    "rating": "1.5/5",
    "review": "As a massive fan of the original Gladiator, I went into Gladiator 2 hoping for at least a fraction of the emotional weight, gripping storytelling, and cinematic grandeur that made the first film a masterpiece. Unfortunately, this sequel fails to justify its own existence. The story feels like a lazy rehash, desperately trying to capture the magic of the original but instead coming across as hollow and uninspired. The characters lack depth, the pacing drags in places, and the action sequences - while visually impressive - feel like a spectacle for the sake of spectacle rather than being driven by any real narrative weight. The performances are serviceable, but none of the actors manage to replicate the raw intensity that Russell Crowe and Joaquin Phoenix brought to the original. The dialogue is riddled with clichés, and the attempts at emotional moments fall flat due to the weak character development. Perhaps the biggest issue is that Gladiator 2 simply didn’t need to be made. It tarnishes the legacy of the original rather than adding anything meaningful to it. A forgettable and unnecessary sequel that will leave fans of the first film frustrated and disappointed."
  },
  {
    "rating": "1/5",
    "review": "It's just a bad copy of the first film. It tries to imitate by changing few details the story of the first one. First 30 minutes were completely random, it's just a subsequence of random videos one after the other with the only thing that the actors remains the same."
  },
  {
    "rating": "1/5",
    "review": "Everything in here feels forced - the story, the reference to the original, even the spectacle. It tries so hard to surpass the first movie and fails in every aspect. The opening battle is worse, the rhino fight scene compared to the tigers in the original is just dumb - it is litterally defeated by a wall - the water battle is worse than the chariots, the ending is... well it's underwhelming to say the least. It's a movie that leaves you wondering: Why would anyone make this?"
  },
  {
    "rating": "3/5",
    "review": "Decent if unspectacular sequel that features some big name actors camping it up pretty good while turning the violence and gore up to 11. Surprisingly, the film doesn't even look great, as the CGI doesn't seem to live up to the best we see these days."
  },
  {
    "rating": "4/5",
    "review": "A worthy sequel. Not as great as the masterpiece that was the original, but still very good."
  },
  {
    "rating": "2.5/5",
    "review": "While entertaining it simply does not live up to the original. Character development is lacking and the story is all but absurd. Far too many tired tropes of the son inheriting his father's legacy, the puppet master pulling the strings from the shadows, and the loss of a love that drives the protagonist. The film lacks the power Joaquin Phoenix brought as an antagonist or the power Russell Crowe brought as Maximus. Pedro Pascal is present only to draw an audience who have gone crazy for him and movie companies seem to cram him into everything now. His performance is underwhelming. A previous flavor of the month who was in everything for a while, Denzel Washington, seems out of place and entirely uninterested in this role. Set design is amazing and the fight scenes are glorious. It's a decent popcorn flick with good action, poor acting , and no surprises."
  },
  {
    "rating": "3/5",
    "review": "Solid C+. Unlike previous movie, Gladiator 2 feels rush just to get the third act, it makes all characters feel shallow and forgettable except Denzel Washington character."
  },
  {
    "rating": "2/5",
    "review": "The actors are good, and the story is okay. But the rest... I found this film very average. I like Ridley Scott, but I think he failed to make a good movie. The 4K image makes it feel like a studio setting in an American soap TV series. The CGI is overdone. The scene with the boats in the arena feels like something out of a fantasy film and ruins the atmosphere in favor of trying to look like a video game. It doesn’t even come close to its predecessor."
  },
  {
    "rating": "5/5",
    "review": "Tidak jauh berbeda dari yang pertama. Selalu mengagumkan dari segala sisi. Aku hanya bisa terpaku terbawa suasana di filmnya. Karya bagus."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was worse than the first"
  },
  {
    "rating": "1/5",
    "review": "The Movie Gladiator II is a flop! Denzel Washington character is just not believable. The Character of Gladiator and the Character of General should have been switched. Just unbelievable of the fake animal dogs fighting in the Colosseum. Story Line also very bad. Sorry but I wish I was there while making the movie, to let them know……."
  },
  {
    "rating": "3.5/5",
    "review": "The much anticipated sequel to the beloved Gladiator (2000) had a lot to show with little substance. Such a notable part of the original was that the gladiators were terrified on the cusp of battle — some even pissing themselves, if I remember correctly — and Maximus (Crowe) giving heartfelt speeches to those who were about to die. Here, Hanno/Lucius Verus Aurelius (Paul Mescal) (I don’t think that’s a spoiler??) Literally just commands “Go!”. Okay. The arena battles are insane, from the baboons to the rhino rider to the naval melee (with sharks, that I don’t think actually happened…) that felt way more thought out than the same in the original. Two brothers run the Empire — Geta (Joseph Quinn) and Caracalla (Fred Hechinger). Although Hechinger is 25, he plays Caracalla like an 11-year-old and passably so. Denzel plays Macrinus, a former slave-turned-slaver with ambitions of the highest order. Yes, Denzel is good because Denzel is always good. But his rise to power is hasty and difficult to follow. *Here Be Spoilers* A time also comes where it seems it feels like a foregone conclusion that Hanno/Lucius will die from his injuries and then just… doesn’t. Gladiator II doesn’t have the heart of the original. “Are you not entertained?!” Sorta. Love anything to do with the Roman Empire and Scott’s movie was a financial success for that reason, but outside of cool action and bizarre ways to kill slaves, there’s not that much here."
  },
  {
    "rating": "3/5",
    "review": "First one was better. Sharks in the arena?! Seriously?! Not worth my movie theater money but would definitely entertain me at home."
  },
  {
    "rating": "3/5",
    "review": "Ok......but not worth watching again"
  },
  {
    "rating": "4.5/5",
    "review": "I wasn't expecting much but I was pleasantly surprised."
  },
  {
    "rating": "1.5/5",
    "review": "Not even close to the first one, just between bad to regular action movie with awful CGI."
  },
  {
    "rating": "2.5/5",
    "review": "Yeah. Just. Silly really but was a spectacle I guess. There is far worse than this out there but it's not even a shadow on the original."
  },
  {
    "rating": "1.5/5",
    "review": "The fact that this got so many good reviews shows how much we’re used to bad movies. After the first Gladiator, this fails to answer a basic question: Why?"
  },
  {
    "rating": "2.5/5",
    "review": "I thought I was watching the original remade with a new cast. The story line was almost identical. Some good action, some bad cgi, but I guess it was worth watching once."
  },
  {
    "rating": "3/5",
    "review": "Bland and predictable. Like waiting for dinner to be served at my beloved grandmother's house in the early 1970s in England.....I just knew it was going to be a piece of dead animal, taters in some guise i.e. boiled, mashed, fried or baked, and two veg with gravy poured over the lot. Denzel must have really needed the money."
  },
  {
    "rating": "1/5",
    "review": "I tried to watch this movie twice. Both times I ended up getting bored after 30-45 minutes and just turned on something else. There's just something deeply uninteresting baked into it's DNA. Whether it's the acting, the writing, the direction, or some combination of all these, the movie was profoundly uninspired. Don't waste your time."
  },
  {
    "rating": "1.5/5",
    "review": "This movie is no good from beginning to end. Gladiator 1 is one of my favorite movies and the second does not even come close. 2 thumbs down."
  },
  {
    "rating": "2/5",
    "review": "Sharks? Really? Rough plot."
  },
  {
    "rating": "1.5/5",
    "review": "Good action and CGI. Did not live up to its predecessor."
  },
  {
    "rating": "0.5/5",
    "review": "I stopped watching after the boat and shark scene. This was a disgrace to a great movie."
  },
  {
    "rating": "1/5",
    "review": "Worst movie I have seen in years. Acting was terrible. Script was predictable . Pace was boring. All it did was show off AI."
  },
  {
    "rating": "0.5/5",
    "review": "Truly awful. Written by AI? I don’t even have the energy to enumerate all the reasons this movie sucked. Save yourself the 2.5 hours."
  },
  {
    "rating": "2.5/5",
    "review": "It’s a tough one this …. I gave the first original Gladiator 9/10. Gladiator 2 delivers the sequel quite well. It’s alright! I went into it thinking it just won’t be anywhere near as good as the original with it’s over ‘Hollywood ised depictions’ and in some respects I was correct. But….. It was half decent - I was actually quite surprised. It’s a bit ‘fairy tale’ like and you have to overlook that…. And just enjoy the movie. It had a lot to live up to against the original one so I wanted to rate it on its own merits. IMDB have it bang on as always (rotten had gone downhill in the last few years it used to be a reliable source for reviews) but IMDB 6.5 nailed it. Some will watch this and rate it 3/4 Some Will give it an 7.5/8. It was never going to be a 9/10-10. But it is surprising worth a watch I thought at 6.5. Which is my rating maybe even a 7 for Denzel’s part in carrying the movie. I feel the main actor did an ok job albeit a little wooden next to Russel Crow in his prime (let’s face it). But he did a good portrayal of Lucius to be fair. Overall a half decent movie just don’t go into it thinking it will be anywhere near the original by Ridley Scott. There worlds apart. If your a huge fan or the original give it a whirl but expect to rate it 6.5/7-10 at the end. This won’t blow you away but more ‘tick a box’. Gladiator didn’t really need a sequel it was almost perfect in its own way as a stand alone movie. Anyway I hope you enjoy it and I’m not lynched by the mob for saying positive things about the sequel 😂😂😂"
  },
  {
    "rating": "4/5",
    "review": "I recently finished normal people on Hulu, which stars Paul who plays Lucius in gladiator 2. He was so incredible in normal people and I really did enjoy him in this as well. I’m not sure why his acting skills are getting any criticism. While it’s seems Denzel is getting the most accolades, I found his American accent a bit off-putting and while his character was the big bad he definitely wasn’t the star in my opinion. The twin emperors weren’t at the level of villainous that Joaquin Phoenix was which was probably why they needed Denzel. I enjoyed Pedro and it was wonderful to see Connie back in her original role. While not as good as the original, it was still very enjoyable and much better than I had expected."
  },
  {
    "rating": "0.5/5",
    "review": "Proof hollywood should make movies and not spend their time with politics. Just bad story, bad acting. Hollywood just focus on doing your job, make good movies and stay out of my business when we are the ones that make your careers possible. Cancel yourself"
  },
  {
    "rating": "1.5/5",
    "review": "Wasn’t that good at all, having Denzel in the film didn’t make it any better. It’s more of a 1 time watch film."
  },
  {
    "rating": "2.5/5",
    "review": "As a child, seeing Russell Crowe fight for justice in the arena left me in awe and set me on a unrealized path toward becoming a gladiator myself. The sequel was less impactful in every metric. Although, its possible that this movie was not made for me. Perhaps it was made for the next generation of aspiring gladiators."
  },
  {
    "rating": "0.5/5",
    "review": "Just terrible. Watch the first one if you want great action, real character development, a hero you root for and a villain you hate, and genuinely emotional impact. What the second one if you want a weak, generic retread without any of the elements that made the first one work."
  },
  {
    "rating": "5/5",
    "review": "Denzel’s performance as usual incredible! The follow up to the original was intense and heart pounding action ! Would have loved for Maximus to know that this was his kid 😟"
  },
  {
    "rating": "0.5/5",
    "review": "Cmon! are serious!!!!!!!!!!"
  },
  {
    "rating": "1/5",
    "review": "The introduction to characters was rushed. The storyline was a rinse of repeat of G1. Paul Mescal was therefore unconvincing and a poor second to R Crowe"
  },
  {
    "rating": "2/5",
    "review": "No heart, no excitement, CGI sharks, bad writing and sub par acting. Original Gladiator is one of the best movies ever - this taints it. Should've just been a stand alone film. Mescal can carry the role as lead man and Denzel is... Denzel in Roman times? The emperors are awful, not sure why they decided to go that route. Overall BLEH, I wasted $6, you've been warned."
  },
  {
    "rating": "0.5/5",
    "review": "Wow…..what can I say. An insult to a masterpiece indeed. From the poor opening CGI to terrible cinematography and even the set design and manufacturing. Sharks in the Colosseum? Really? No!!!!!! It was good to see a few clips from Gladiator and a little original music at the end but I thought about turning this off within the first 30 mins. Time to retire Scott or at least stop letting others puppeteer you. Please don’t make another, this one was disturbing enough. Rest in peace Maximus…..if you can after this nonsense."
  },
  {
    "rating": "1/5",
    "review": "Painfully obvious it was craptastic, no purpose, no point, absolute shittaker dialogue. the original Gladiator would be offended, I’m offended for him. Don’t watch it, save your popcorn!"
  },
  {
    "rating": "3/5",
    "review": "Nowhere near as good as the first one."
  },
  {
    "rating": "3/5",
    "review": "Gladiator II is true to its roots, and Mescal is a strong lead. It doesn't hit as hard or as original as the first - but an epic watch all the same."
  },
  {
    "rating": "3.5/5",
    "review": "solid movie, a sequel that was not needed but is worth a watch."
  },
  {
    "rating": "4/5",
    "review": "Not as good as the first Gladiator movie but still a pretty entertaining watch and a well made film."
  },
  {
    "rating": "1/5",
    "review": "This movie tried its best to live off of the first Gladiator movie but nothing could have made this a good movie. Too Many plot holes. Too much stolen from part 1. Poor acting. It does have action in the form of constant fight scenes but the dialogue is awful. Yawn fest."
  },
  {
    "rating": "4/5",
    "review": "Wonderful cast, great storyline. Enjoyed this the entire time."
  },
  {
    "rating": "3/5",
    "review": "Although the performances of the actors are superb, the story in this movie feels rushed and sometimes forced. Some parts really felt like there was a focus on the story, but there were also moments that seemed to prioritize the duration of a scene over telling the story. In my opinion, this movie could have had a third part if they had focused more on the story; otherwise, they should have stopped after the first movie. Great acting and action, but a rushed and forced story."
  },
  {
    "rating": "2/5",
    "review": "Wonder why such high audience reviews. It was entertaining, good cinematography, good script, and good action scenes. However, not sure if it’s poor writing or poor casting or both….Paul Mescal lacked charisma and just wasn’t very convincing as a leader. It felt like they tried too hard w/ too many school pep rally scenes that weren’t pumping anyone up."
  },
  {
    "rating": "2/5",
    "review": "Well maybe it is that I expected to be up there with Gladiator, nope it´s far by a lot of it. Visually what you can do with computers is awesome, but the writing? It seem forced trying to tie it to the first movie. Sharks at the Colosseum? Really? Acting wise? Denzel makes a good villain. Mescal had too big shoes to fill after Rusell Crow in G1 Pedro Pascal is just another extra in the movie."
  },
  {
    "rating": "0.5/5",
    "review": "Poor story line with almost no character development. Good fight scenes for the most part, but even the fighting doesn’t make sense at times. It was painful to get through. It is not even a shadow of the original Gladiator."
  },
  {
    "rating": "4/5",
    "review": "While not measuring up completely to the original, in an age where legacy sequels tend to be more flash than substance, Gladiator II does a commendable job of both tying itself to the original while not relying on it to heavily to move the story forward."
  },
  {
    "rating": "2.5/5",
    "review": "I found it to be a bit of a damp squib in comparison to the original. Where Gladiator had real emotional gravitas, great acting and a gripping story line, this just didn't. I found most of the acting to be second rate. Paul Mescal seemed miscast, but then the script wasn't good enough to give him any chance. By the third quarter I had lost interest and was coasting in."
  },
  {
    "rating": "1/5",
    "review": "Gladiator 2: A Disappointing Sequel to a Legendary Film It’s truly a shame what they did with Gladiator 2, a film that had everything it needed to be a worthy successor: an enormous budget, a stellar cast, and the legacy of one of the greatest movies of all time. Unfortunately, the result is a forced, uninspired sequel that feels like a desperate attempt to tie itself to Gladiator rather than standing on its own as a compelling story. The plot is ridiculously contrived, bending over backward to create connections to the first film in ways that feel unnatural and, at times, outright absurd. Instead of crafting a fresh and meaningful continuation, the movie relies too much on nostalgia and forced references, failing to capture the emotional depth and intensity that made the original so powerful. It is often said that sequels struggle to match the magic of their predecessors, but in this case, Gladiator 2 falls disappointingly short. It’s not just a weaker follow-up—it’s a film that seems to exist solely because of its name rather than because it had a story worth telling. What could have been a grand return to ancient Rome instead becomes a hollow spectacle, proving once again that some classics are better left untouched."
  },
  {
    "rating": "4/5",
    "review": "I loved it! Paul Mescal was incredibly good/mesmerizing in the movie. Excellent performance. It also ties very well with the original storyline. Some of it was a little too CGI, ie sharks. The rulers were strange. However, a comment later in the film makes the one a little more understandable for why he is how he is and the ending causes it to make sense why there are two. They don’t live up to the menace of Joaquin Phoenix in Gladiator. I would watch it again. It is not as good as Gladiator but still a very good movie. Are you not entertained? Yes we are!"
  },
  {
    "rating": "1.5/5",
    "review": "Story line was there for the crucks of a great movie. Over dramatisation and theatrical events in the movie ruined any scraps of accuracy of not historical events but just what the Romans were capable of. Within 10 minutes we see a naval fleet assaulting huge city walls. Crazy."
  },
  {
    "rating": "5/5",
    "review": "Happy to see a sequel film to a classic sensation. The storyline was phenomenal. Would love to see a third film."
  },
  {
    "rating": "3.5/5",
    "review": "Echoing its predecessor while upping the bloodsport and camp, Gladiator II is an action extravaganza that derives much of its strength and honor from Denzel Washington's scene-stealing performance."
  },
  {
    "rating": "0.5/5",
    "review": "A horrible attempt of a carbon copy of the first movie"
  },
  {
    "rating": "4/5",
    "review": "Quite good! Obviously did not do better than the original, but was still an entertaining movie with amazing sets and costumes. The characters were fun to watch. Denzel looks great in his costumes and does a good job acting. The movie uses the original score to good effect. However, I do believe the emotional weight from the score still carries over from the original and not so much this one."
  },
  {
    "rating": "4/5",
    "review": "Okay but way too predictable to watch a second time."
  },
  {
    "rating": "2/5",
    "review": "Gladiator 1 is one of my all-time favorite films, the latest iteration doesn't even begin to match its predecessor. It's mediocre at best."
  },
  {
    "rating": "3/5",
    "review": "Nobody is bad in this movie but the plot is a less engaging rehash of the first film."
  },
  {
    "rating": "1.5/5",
    "review": "While Denzel Washington makes a good enemy, and the bones of a great story are there it really fails in its execution. The naval battle would have been great if there weren't sharks swimming around in it. The two armies coming together and letting two guys hash it out was not the best either. The fact is that it had great potential and was poorly executed."
  },
  {
    "rating": "2.5/5",
    "review": "\"Gladiator II stumbles into the arena like a seasoned warrior who's had one too many hits to the head - technically proficient but missing the soul that made its predecessor legendary. It’s the cinematic equivalent of a solidly built chariot with a wobbly wheel—good enough to get you to the finish line, but not without some bumps. The first two-thirds? Surprisingly strong, setting up an expanded world with a decent sense of scale. But just when it should be tightening its grip, the film drops its sword and stumbles into a finale that feels less like an epic climax and more like a hastily scribbled footnote. The biggest issue? A pacing problem so severe it feels like the filmmakers were afraid we'd check our watches. Characters move from one big moment to the next with zero emotional buildup, giving the whole thing the depth of a marble floor. And then there’s the CGI—dear gods, the CGI. Who in the writer’s room thought, *you know what this Roman epic needs? Sharks and combat baboons*? This isn’t *Gladiator*, it’s *Gladiator: Legend of the Hidden Temple Edition*. Meanwhile, the emperors are played like they wandered in from a rejected Monty Python sketch, when history already provided plenty of real villainy without the cartoonish antics. Thankfully, Denzel Washington rolls in like a boss, giving us a villain that actually works—sharp, restrained, and effortlessly menacing. But even he can’t fully save a film that ultimately feels like a well-shot, well-acted, but ultimately disposable sequel. It’s not bad. It’s just… there. Watch once. Not as bad as critics portray. 6.4/10"
  },
  {
    "rating": "4.5/5",
    "review": "Great movie. You must watch the 1st movie to really enjoy this movie."
  },
  {
    "rating": "1/5",
    "review": "Not worth your time! As a stand alone film it's pretty terrible, but considering it's the sequal of an epic modern day classic it's complete rubbish. I've never walked out of the cinema before the end of a film (and probably never will because I'm so tight), but I was damn close this time."
  },
  {
    "rating": "1/5",
    "review": "The most offensive sequel ever made. How the approval rating are as high as they are is incomprehensible."
  },
  {
    "rating": "1/5",
    "review": "Sorry not a patch as a follow on, over acted to the ninth degree with totally implausible fight scenes. Denzil W only highlight and even he struggled to help this. Not even with a rainy afternoon just rewatch 1"
  },
  {
    "rating": "0.5/5",
    "review": "How this boring, terribly written pile of crap got a high rating is baffling. I turned it on and off several times because it's so boring. Paul Mescal is a fine actor, but he just doesn't have that \"it\" charisma that Russell Crowe had. It mad no sense that the men wanted to follow him. He seemed bored. Pedro Pascal looked like he didn't want to be there. Connie Nielsen brought some gravitas but was underused. Denzel was the only one who looked like he wanted to be there and was having fun chewing the scenery. Boring. Just boring."
  },
  {
    "rating": "5/5",
    "review": "Was bloody great! Didn't take itself too serious and was what it's supposed to be. Not an Oscar winner but an entertaining 2 hrs if tine..."
  },
  {
    "rating": "2.5/5",
    "review": "Some CGI was bad enough to take me out of the experience. Story and dialogue were pretty weak."
  },
  {
    "rating": "1.5/5",
    "review": "I didn't had any expectations with this film and i kinda saw how terrible this movie will be since the first trailer. The positive: A least the film wans't boring at all and Denzel have the best acting. The negative: The script is really weak and souless, Paul Mescal doesn't have the same presence than Russell Crowe, the CGI animals were to fake to my eyes. I think Ridley Scott should take a break."
  },
  {
    "rating": "4/5",
    "review": "It certainly isn't in the same league as it's predecessor, but Gladiator II is still an incredibly entertaining movie with plenty of heart pounding action and drama."
  },
  {
    "rating": "1.5/5",
    "review": "The movie was a far cry from the first movie. The movie didn't really connect with the protagonist or other characters. There were historical inaccuracies and things that were simply not believable to the point where it wasn't entertaining."
  },
  {
    "rating": "2/5",
    "review": "GLADIATOR II plays fast and loose with history in order to spin a story that often feels less like a sequel than a nostalgic remake. The decadent sibling emperors are compelling, and Denzel Washington's performance is memorable. Beyond that, a too-familiar plot, some subpar CGI, and a forced sense of the \"epic\" all further deflate this rather tedious spectacle."
  },
  {
    "rating": "2/5",
    "review": "Extremely disappointing."
  },
  {
    "rating": "3/5",
    "review": "Zero historical accuracy, its a hodgepodge of Roman history moments in a bad collage and in wrong times, like the invasion of Numidia 200 years late, the Battle of the Milvian Bridge 100 years early, the killing of Caracalla at the wrong time and place and the demise of Macrinus in a totally bogus fashion. Action OK too much CGI, the baboons looked terrible, Naumachia fine it happended in other venues not the Coloseum but ok but rhinos and sharks total fantasy. Why call it a historical epic its either an alternate universe or set on a fictional land, if you are not going to be true about the historical times do pure fantasy in the Revan Empire for example. No cafes (not even coffee discovered yet) in Rome and no daily newspaper, there was no printer yet......SO entertaining but galling to history buffs"
  },
  {
    "rating": "5/5",
    "review": "A good movie. Coincidentally, Very relevant and reflective of current situations."
  },
  {
    "rating": "1.5/5",
    "review": "Very thin and sophomoric plot line which serves as a vehicle merely to get from one boring fight scene to another and another and another. Extremely bad writing and acting with the exception of Washington."
  },
  {
    "rating": "0.5/5",
    "review": "A weak sequel, filled with named actors who barely phone in credible performances. Like \"Alien: Covenant\", this was like watching another director make a soulless sequel to a film without understanding the originals inherent magic - except that the director here was the original director."
  },
  {
    "rating": "3/5",
    "review": "If they were going to make \"this\" Gladiator 2, it really needed to happen 20+ years ago. Its absolutely LOADED with dialogue and references to the original, but its just been too long for the average person to pick up on them. Its a pretty good movie...not great and definitely not as good as the original but solid enough. It is notably missing a convincing antagonist. The buffoon twin emperors and the \"just want to watch the world burn\" (with no explanation) guy aren't cutting it. However, the biggest issue for me was the scenario. Gladiator 1 removed all obstacles and powerful antagonists to the \"dream\" Rome, but somehow all the powerful well-intentioned characters gave it up to the moron twins 15 minutes later?"
  },
  {
    "rating": "4/5",
    "review": "I was very wary at first, but all in all it was a very decent movie, although it didn't have the same bravado as Gladiator.."
  },
  {
    "rating": "5/5",
    "review": "It is a hard to follow what was arguably the best film ever made. Ridley Scott did not disappoint! The plot is plausible, the depiction of Rome, Roman life and Colosseum scenes were accurate and riveting. I love this film on every level!"
  },
  {
    "rating": "3/5",
    "review": "Not bad,far from original.great set and costumes.Mescal was good...denzel was oscar worthy.lives off the fumes of the first one,and gets as much out of the story they can.good movie...but original was great."
  },
  {
    "rating": "2.5/5",
    "review": "Historical accuracy is on level with a Monty Python movie and that is generous. The siege by sea scene is 100% utter horrid if you have any knowledge of that era. Even if you know nothing of that time the cut scenes are mismatched. One time the wall goes to the water and the next it is 20 feet away from the water. That is just one example of the terrible consistency of one shot to the next. Some of the action scenes are okay so I gave it an extra 0.5 stars for that raising the score to 2.5 instead of 2."
  },
  {
    "rating": "2.5/5",
    "review": "Slightly more interesting than the first one."
  },
  {
    "rating": "2/5",
    "review": "The character building is weak. The dialogue is disappointing. If this had been the first movie there wouldn’t have been a sequel. I love Gladiator and had great expectations for this sequel."
  },
  {
    "rating": "0.5/5",
    "review": "One of the most disappointing movies ever. I loved the first one. This has none of the charm or intensity of the first one. Nothing was earned, just a cheap sequel. Thumbs way down."
  },
  {
    "rating": "1/5",
    "review": "Can't say there is any reason I would revisit this movie in the future, you know, like you do for most movies. From the blatant overlays of the original, to the sci-fi channel cgi effects, just boo. The characters were lacking in backstory and besides, casting actors that the audience believe were meant for that role just didn't happen here. Truly sad cause yah, I was expecting it to surpass the original and it was a waste of time. Better to just go watch Gladiator for the 15th time and enjoy the brilliance!"
  },
  {
    "rating": "0.5/5",
    "review": "Seriously, don’t believe anything good you’ve heard about this movie. It was so bad we turned it off after 1 hour. Ridley Scott is 87 and seems to have gone a bit senile. i dont mind extreme action and suspension of disbelief but nothing made any sense. although it was good that someone trained a rhino to turn left and right like a horse. and good that the killer baboons stopped fighting when their leader got killed, and instead of escaping up the walls, just stood around. why did the romans risk everything to attack by ship instead of docking on the beach and laying siege from the land - which was after all their strength. Every single thing in the movie was stupid and illogical. The script is terrible. Even Derek Jacobi sounded like he didnt know what he was saying. Denzel Washington and Tim McInnerny are excellent actors but their performances will make you cringe. It also doesn’t help that Paul Mescal lacks any charisma (or acting ability). The original was such a good movie (and story) and frankly this is an insult to it. A battle-hardened roman commander is believable as a gladiator, completely unlike a tiny, wimpy mommy’s boy who has been hiding in a village his whole life. And if he was so ‘rage filled’ why didnt he kill the emperor when he was chatting to him, instead of reciting poetry. As i said, we only watched the first hour so it may have got better, but i seriously doubt it."
  },
  {
    "rating": "2/5",
    "review": "Glad I got to watch for free but it's still a couple of hours I won't get back CGI animals and a camp plot like a pantomime with swords."
  },
  {
    "rating": "2.5/5",
    "review": "I finally saw it... Gladiator II—well, just like Beetlejuice 2, it didn’t need to happen. Yet another sequel to a classic where the original director returns long past their prime, proving that sometimes, it’s best to retire on a high note. It’s not bad, but it’s not particularly good either. The whole thing feels like a straight-to-video sequel—watchable, sure, but lacking the inspired and superior storytelling of the original. The biggest flaw in this movie is making Lucius, Maximus' son. That’s a massive stretch. Maximus' entire arc in Gladiator was about avenging his family and fulfilling his duty to Rome, not some secret bloodline twist. Making Lucius his son feels like a cheap way to force a personal connection to the sequel when it’s totally unnecessary. Worse still, these kinds of sequels have a way of watering down the impact of the original film’s triumphs. The original film is such a self-contained masterpiece—why mess with it? Sure Gladiator II is an OK action flick if you’ve never seen Gladiator but for anyone who has it bounds to be another disappointment."
  },
  {
    "rating": "1/5",
    "review": "Awful and ridiculous script, terrible CGI and awful wooden acting. I don't understand why this film is getting such good reviews, perhaps it's because of the director?? It's also ridiculous, somehow the coloseum is able to be filled with salt water and sharks are able to be transported and put in there??? A gladiator riding a Rhino??? Everyone's raving about Denzel's performance, he was certainly the best actor by far, but his storyline is equally as ridiculous as the rest of the movie. About the only thing I quite liked where the manic emperors and that's not saying much. Too much like the original, pointless, poorly scripted, badly acted and the gladiator scenes don't even inspire."
  },
  {
    "rating": "1/5",
    "review": "Terrible. Not even worth the nostalgia for Gladiator 1"
  },
  {
    "rating": "5/5",
    "review": "Action packed, Denzel did a great job in this role, must see"
  },
  {
    "rating": "2.5/5",
    "review": "I would pass on this one. Night riot occurring outside, while the indoor scenes occur with the sun shinning in through the windows. There were a lot of inconsistencies which make this a hard watch."
  },
  {
    "rating": "2/5",
    "review": "For an action movie, the action is infrequent and there is at least one limp speech for every action scene. The plot turns into a hackneyed ' chosen one ' story."
  },
  {
    "rating": "1/5",
    "review": "Big stinky poo. Not much else to say."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is awful as most are nowadays. I can't believe Denzel did this piece of crap. Makes Gladiator 1 look useless as Maximus lost his life for Rome. This sequel makes that useless with Lucius having to do the same thing over again. Scriptwriters have zero imagination nowadays. Sequels that suck or remakes is all we get."
  },
  {
    "rating": "3/5",
    "review": "Movie makes fun at all. But the story is dumb. So dumb. It feels like a garn to connect the action sequence. So dumb."
  },
  {
    "rating": "0.5/5",
    "review": "Extremely poor storyline and special effects. Rushing through the story, actors over-doing, low intellectual level, and embarrasing many flaws and lack of attention to details. A shame with that cast."
  },
  {
    "rating": "0.5/5",
    "review": "Holy cow.... lacklustre performances all round. Dodgy effects and the continuity lead must have taken that month off. I honestly can't think of one good thing to say about this awful film. Formulaic and frankly a fair proportion of it just stripped from the orgional. What the hell was Ridley Scott thinking"
  },
  {
    "rating": "1/5",
    "review": "I came to this movie thinking it would be great because the first one was and there were so many good actors in gladiator two, but I was wrong. It started off good for like the first 2 minutes then something happens to the main characters wife and they did it so bad you could not care less that she died. Also he was supposed to look mad and act mad but the guy who acted the main character was not a good actor. I watched like an hour in then I skipped another hour then watched my favorite character die in a stupid way then just turned it off. So to sum it up do not watch this movie has no story and the main character sucks."
  },
  {
    "rating": "3/5",
    "review": "This was a good popcorn movie, but I don't think it will become a classic. I was entertained throughout the movie without giving it much analysis. It's a movie I can watch without paying too much attention to the details."
  },
  {
    "rating": "2/5",
    "review": "What made the movie so uncomfortable to watch was its lack of argument. Even tho the Lucius homecoming premise was originally smart and very good for a sequel, it was badly executed, showing a copy - paste of the original Gladiator but with a younger, blonde protagonist and CGI. Apart from that, the movie just feels like the same formula, with practically the same characters with different names and the twins were literally Marco Aurelius split into two personalities, a lot less masculine and mostly irrelevant to the story, to the point of just being some instruments to showcase the \"evil\" character Denzel was interpreting, doing nothing that contributed to or altered the plot . Still, the worst detail that absolutely ruined the movie for me was that it completely nullified the whole argument and ending of the first Gladiator, portraying Maximum's sacrifice as something completely worthless. This is a painful and repetitive characteristic of sequels that don't have a firm enough base to develop an independent plot, having the need of complementing or rewriting the last one instead to justify it's existence. Sadly, the film, even tho it had a tremendous potential, ended up feeling more like a remaster of the first one rather than a separate story influenced by the consequences of it's predecessor (like good in-related sequels do)."
  },
  {
    "rating": "1/5",
    "review": "Could not be worse. I can suspend disbelief just so far. When a gladiator rode in on a saddled and bridled rhinoceros, doing dressage moves on it, I was completely gone. Unbelievably stupid."
  },
  {
    "rating": "5/5",
    "review": "Very good movie great 👍👍👍👍"
  },
  {
    "rating": "0.5/5",
    "review": "Totally ridiculous & how anyone can take this movie seriously is beyond me. They’re paying Denzil 20 million because it needs something to save it. He’s good in all his scenes, but ships & sharks 🦈 in the coliseum?!? Oh, that’s my wife floating in the flotsam & jetsam of a thousand dead bodies & destroyed ships from all the fiery bombs that the trebuchets torpedoed us with, so lucky I found her so easily! ( & so we’ll preserved!) C’mon! Totally ridiculous & an insult to the first movie. Should have spent the 400 million helping homeless people imo."
  },
  {
    "rating": "4/5",
    "review": "An enjoyable sequel, but no real comparison to the original. What was missing? The impact of the opening battle in Germania, for example, with its dramatic use of shadow and light accompanied by a fine Hans Zimmerman score. A better back story provided by Richard Harris playing Marcus Aurelius. The dramatic tension between Crowe and Phoenix throughout. The two silly emperors in II didn’t have the single-minded menace of Phoenix, who should have won an Oscar. Paul Mescal was fine, but Crowe projected a real magnetism in Gladiator I that brought the film to another level."
  },
  {
    "rating": "1/5",
    "review": "Yeah but no but I was more invested in the characters of Sharknado 2"
  },
  {
    "rating": "4/5",
    "review": "Denzel carried most of it imo. Great action sequences"
  },
  {
    "rating": "3/5",
    "review": "I was underwhelmed throughout. I don't know why a film needs to \"Jurassic Park-But with more teeth\" this. And by that I mean, they've got incredible material to work with, Gladiators! ancient Rome, their was no need to jazz this all up and make all these crazy CGI battles. Less is more here. I didn't care about any of the characters as the development of them all was trash. Denzel everyone raves about and says he scene steals? it's not hard to honestly when Mescal is too focused on trying to mimic Russel Crowe's voice and tone in the first film that he puts nothing into his actual performance, ZERO charisma from this guy, couldn't care less about him. And that is the same with the rest of the cast. Felt nothing for anyone. Didn't need to be made, will never need to re-watch it."
  },
  {
    "rating": "4.5/5",
    "review": "Whilst it follows the same storyline as the first film, I enjoyed this. I thought Paul Mescal was very good in the lead but I hate Denzel being a villain in anything! Yes, he scene steals, what else is he going to do? Hated that Connie Nielsen was killed off, Lucius will rule without either of his parents now, that was uncalled for."
  },
  {
    "rating": "1/5",
    "review": "I've just sat through over 2 1/2 hours of boring storylines. The acting was very stiff, storylines seriously rushed from one to another. CGI very mediocre. They tried to much to keep dropping hints about Gladiator l. Don't bother watching it as it's very boring and very poorly written and directed."
  },
  {
    "rating": "4/5",
    "review": "Gladiator 2 Ridley Scott hat darauf gepfiffen, es sich mit seinem eigenen Meisterwerk anzulegen und hat Gladiator 2 so gedreht, wie es Roland Emmerich tun würde. Er bietet eine solide Story und das was wir sehen wollen: Originelle Gladiatoren Kämpfe. Meine Skepsis war unbegründet. Der gesamte Cast liefert eine sehr gute Leistung ab und auch da gibt es einprägsame Bilder. Allen voran Denzel Washington. Fast schon der heimliche Star vom Film. Eine Oscar Nominierung würde mich nicht wundern. Die Zeit vergeht schnell. Ein gutes Zeichen. Es wird sich auch nicht allzu lang mit Drama aufgehalten. Vielleicht achtet ihr auf den ersten, seltsamen Affen ( so einen habe ich noch nie gesehen) gegen den der Hauptdarsteller antritt. Soll der Ähnlichkeit mit der Figur von Denzel Washigton haben? Ein Äffchen spielt bei den beiden Imperatoren auch eine tragende Rolle. Es gibt nicht soviel Drogen, um so zu sein wie diese beiden Imperatoren. Alleine wegen denen lohnt schon der Kinobesuch. Die müssen nur im Bild sein. Das reicht schon. Auch gibt es eine Andeutung auf Romulus und Remus und den Wölfen. Man beachte Alien: Romulus. Heisst der Nächste vieleicht: Remus? Empfehlenswert."
  },
  {
    "rating": "0.5/5",
    "review": "So. I watched this POS for 35mins. First. At least with the original, there was a tiny bit of historical accuracy, along with basic combat mechanics. It would seem that the writers and directors of this drivel, would like us to disregard any historical evidence and combat mechanics. I give a long leash on creative endeavours and suspended disbelief, but the first few fight scenes of the initial battle with fighting ships and equipment that were far beyond historical accuracy, leaves me to ponder who this movie panders to. Second. The challenge from “Whoever Denzel Washington (Playing Denzel Washington)” is supposed to be, to the lead character with “ Denzel’s” enforcer, results in a fisticuffs with his enforcer using spiked gloves and striking the lead character multiple times in the face with no damage. 35 mins in, I have to acknowledge my disbeliefs and say, “Am I this desperate to be entertained, that I will continue giving another 120 mins of my life to this POS?” The answer is “NO!”…….I have had better entertainment value at colonoscopy…..which I just had. Sad……just sad.😞"
  },
  {
    "rating": "2/5",
    "review": "Some things are just better left alone! Trying to follow up the first Gladiator is an extremely tall order and the second fell short in every way. Denzel is easily one of my favourite actors but the whole time I couldn’t help but think about how out of place he seemed."
  },
  {
    "rating": "3.5/5",
    "review": "Worth watching for some spectacular visuals, but falls short of the original in pretty much every other way."
  },
  {
    "rating": "3.5/5",
    "review": "While there's a lot more action scenes and a lot more bling it wasn't as inspiring as gladiator. Don't get me wrong I enjoyed it, but its not in the same league as the 1st."
  },
  {
    "rating": "3/5",
    "review": "Overall plot is worth ignoring and just staying for the spectacle."
  },
  {
    "rating": "1.5/5",
    "review": "Poor writing, poor acting, poor premise."
  },
  {
    "rating": "3.5/5",
    "review": "It was fine, not anything close to the original. They tie in to the original was fantastic but the plot line felt rushed and there was no feelings to the characters that you got in the original Gladiator."
  },
  {
    "rating": "4.5/5",
    "review": "Was in two minds whether to give this a go…much as I enjoyed the first film thought was likely to be either a repeat or pale copy. In fact I was pleasantly surprised. While the action (battle and fight) scenes were a touch too long they never overwhelmed the plot. Some impressive cameos from renowned actors in the smaller roles and the main characters were developed just enough to remain interesting. Some curious (very probably) unintentional satire about a once great empire, corroded by corruption and greed, consequently falling into disregard. And difficult (at the current time) not to see a parallel between the two decadent and narcissistic emperors with two extremely high profile players on the political stage currently. Best recommendation, given my usual ‘how soon will I look at my watch grading process’ I didn’t. It’s a long time since I said that about any film!"
  },
  {
    "rating": "3/5",
    "review": "*spoiler alert* I thought, overall, the movie was good. The acting was good, especially Washington. With that said, as the main actor, Russell crow was just way better. Also, I still don't know how maximus is luscious father. In the the movie she was in an arranged marriage, maybe something happened to her husband and maximus hit that on the front line when she came to visit her father. It just seems like unnecessary stretch. Instead of interesting, and adding drama to the story, I was just simply confused, constantly watching for clues to explain this one specific detail so the story made common sense, all the while losing focus, and completely missing important other details. Overall I'd recommend this movie, but it would the \"if you have time\" type rather than the\"you need to drop everything and watch this very great movie right now\" type."
  },
  {
    "rating": "1.5/5",
    "review": "I loved the first movie! This one is a major disappointment. Denzel Washington is as bad as Michael Douglas playing Liberace."
  },
  {
    "rating": "2.5/5",
    "review": "Ridley Scott’s Gladiator 2 earns its simple “2” not as a bold sequel but as a reminder that it’s a shadow of its predecessor. While it tries to recapture the magic of Gladiator (2000), it ultimately falls short, relying too much on nostalgia without bringing anything truly fresh or memorable to the arena. Let’s start with the visuals. Given the advancements in technology since the first film, one would expect Gladiator 2 to be a visual feast, but somehow, even with modern CGI, the film fails to impress. Those were baboons? Really? The battles lack the gritty, visceral feel that made the original so immersive, instead feeling overly polished and weightless. The story introduces new characters, but ironically, the ones we wanted more of—Pedro Pascal and Denzel Washington—aren’t given nearly enough screen time. That’s a bad sign when the supposed protagonist, the actual Gladiator, struggles to hold our interest. Pascal and Washington bring presence, but their limited roles leave the film feeling unbalanced. One of the biggest missteps is Scott’s reliance on recreating iconic moments from Gladiator. Whether it’s callbacks to famous lines or attempts to mirror Russell Crowe’s most powerful scenes, these moments feel hollow and forced. What once felt raw and emotional now comes across as uninspired mimicry. That said, Gladiator 2 isn’t a total disaster. It’s still a big-budget, well-produced action movie that delivers enough entertainment to make for a decent popcorn flick. If you can set aside comparisons to the original, there’s fun to be had in the grand spectacle of it all. But as a worthy successor to one of the greatest historical epics ever made? It doesn’t even come close. Final Verdict: 2.5/5 stars – entertaining enough, but ultimately a forgettable sequel that fails to carve out its own legacy."
  },
  {
    "rating": "0.5/5",
    "review": "This film shouldn't have been made. The writing, pacing, and plot are cringeworthy from start to finish."
  },
  {
    "rating": "3/5",
    "review": "\"The film is not as powerful as the first one, and the depth of the story in the first part is much stronger. It's hard to compare the two. However, I really enjoyed the cinematography and the special effects in the sequel. While it may not have the same emotional impact, it still offers an entertaining experience"
  },
  {
    "rating": "1.5/5",
    "review": "Great cast, garbage story. All very predictable and empty."
  },
  {
    "rating": "2/5",
    "review": "A much weaker echo of the first movie. It wasn’t all bad and there were some great moments. It’s been over twenty years since Gladiator, I would wait a bit longer till it’s available to stream for free."
  },
  {
    "rating": "2.5/5",
    "review": "The movie felt a little bit rushed, not in it's runtime, but in the way scenes happen. Scenes are not given time to breathe. Although i understand that in 2+ hours it might be difficult to take the time necessary to develop the plot.The fight choreography is nothing special, and even bad, here. I have seen low budget movies and tv shows with far better fight choreography. At the end of the day, this was never going to be as good as the first. And i didn't expected it to be. But some very important areas, like the fight choreography and polishing of the plot/script, were underdeveloped and underdelivered. It felt like things were happening because the writer/director wanted it to happen, instead of a natural sequence of events, which is a shame, because there were moments in this movie where they could hit the nail on the emotional impact. But i would still recommend it. I don't think you will be bored. Just don't expect much."
  },
  {
    "rating": "2.5/5",
    "review": "Expected more out of this movie really disappointed"
  },
  {
    "rating": "1.5/5",
    "review": "The acting was a mixed bag of wooden (Lucious), Over done (the emperors, Lucilla) and some excellent (Acacious, Macrinus). The pacing moved so fast without getting to know the characters. So many weird half hearted efforts to make lucious seem like his motivations are: freedom? his wife? opposing rome? So. Many. Contrivances. Probably my biggest pet peeve in films. The war scenes were so much less accurate than the first Gladiator."
  },
  {
    "rating": "1.5/5",
    "review": "While attempting to use the original’s formula for cinematic success, it grossly lacks in character development. To take one easy example (and there are many)- look at the evil emperor role. In the first- you get Commodus’s background, motives and personality traits. Gladiator dedicated time to that- which is important as he’s the primary antagonist. In this film- the evil emperors are simply there, and simply evil. The director even saw fit to help you out by giving them red rings around their eyes, just so you know they’re evil and sadistic. Even the hero, sold to you as an escaped young boy with a humble background, suffers from “Rey Syndrome” (instant fighting and leadership skills due to parentage). The character interactions are forced as well. Sudden loyalties and sudden hatred appear as needed to fit the story. I would’ve much preferred a longer epic or even two films, if it meant more character and story development. At the end, I felt complete apathy for every character. This film’s box office success can only be seen as further testament to the original's excellence."
  },
  {
    "rating": "2.5/5",
    "review": "It's not bad but the storyline is slow and predictable"
  },
  {
    "rating": "1.5/5",
    "review": "What a horrible sequel! Sharks and ships!?!?!?! Denzel was the only reason I watched it in the first place and I'm highly disappointed."
  },
  {
    "rating": "3/5",
    "review": "Well for number 2 it's good, BUT few sceens are abit to far fetch the ending could of been better unless there is going to be a follow on. But nothing will ever ever beat Gladiator 1 with Russel Crowe but yes it's worth the watch"
  },
  {
    "rating": "1/5",
    "review": "Terrible acting, too much CGI, absolutely garbage film trying to relate to a much better film before. The aggressive need to appeal to nostalgia was grossly overdone. The acting was flat and the production was even worse. Do not waste your time. A true example of how Hollywood has fallen"
  },
  {
    "rating": "1.5/5",
    "review": "Hard to believe that Ridley Scott directed this movie after having watched the first one. Unfortunately Gladiator 2 feels like a tacky knockoff of Gladiator 1.. with lacklustre acting and a cheap script. The twin villains were incredibly cringe and totally not believable."
  },
  {
    "rating": "4.5/5",
    "review": "I loved Gladiator and wondered if they were going to be able to cature that same magic in the sequel. They did in many respects but fell short a little in others aspects of the original movie. Denzel Washington was fantastic in the movie and he gave it that extra boost. The actors who played the bother emperors were the stars of the film and worth watching, just to see their performance, even though they didnt take up a great deal of screen time they sold the evil of the empire. The two actors were phenomenal as emperors on the edge of their own youth and sanity and greed and lust to be entertained at the cost of anyone. I would say the weakest aspect of the movie was the plot. The movie was entertaining but the plot gave no surprises and some relationship changes were forced into shortr periods of time then they shouod have. This was forgivable for the sake of the story and for the time available."
  },
  {
    "rating": "4/5",
    "review": "A bloodthirsty sequel to Scott’s 2000 classic. Well thought out casting and some amazing scenes. Slightly lacks the emotional depth of the previous film, and the ending is rather abrupt, but nevertheless a great watch."
  },
  {
    "rating": "0.5/5",
    "review": "So much expectation and so much more disappointment. Gladiator is an epic movie and this sequel was horrible in regards to storyline…. abysmally bad. Embarrassed that I purchased on Fandango due to all the reviews."
  },
  {
    "rating": "1.5/5",
    "review": "Sharks in the Colosseum? The movie was pretty lame and bad acting. And the twin emperors; I don't know what Ridley Scott was thinking. 2 hrs of my life wasted."
  },
  {
    "rating": "1.5/5",
    "review": "Too much CGI, stupid unnecessary scenes like filling the coliseum with sharks… Cast not good enough, Denzel carrying the film. Such a poor sequel to a legendary film. Really disappointed"
  },
  {
    "rating": "4/5",
    "review": "I thought this was a great sequel. A lot of action and gore. I would’ve given it an extra point, but the characters that you wanted to be endeared to such as acacia, the queen, and the wife died so I think that deflated the movie a bit. But the performances were good. And The gladiator Paul Mescal, and Denzel, Washington’s performance, was great"
  },
  {
    "rating": "2.5/5",
    "review": "Everything 4-5 star except the script. The first movie had great creative writers who developed character and told a great story. This script was sorely lacking. We go to movies for the story. Special effects and the rest help tell it."
  },
  {
    "rating": "2/5",
    "review": "It was okay at best... It almost felt like a major big budget movie That corners were cut and was hurried just to get it completed... If you want to watch this movie and enjoy it do not go into it comparing to Gladiator as you will leave extremely disappointed"
  },
  {
    "rating": "0.5/5",
    "review": "The movie makes no sense. Another movie ruined by modern day film makers."
  },
  {
    "rating": "1/5",
    "review": "Extremely disappointing film. I am relieved I couldn’t make it to the movies to see this and only paid $6.99 to stream. The story line was boring and drawn out, and it felt cheap. Just no. A slap in the face to the first film."
  },
  {
    "rating": "4.5/5",
    "review": "I have waited 25 years for this movie! I loved EVERY minute of it! The cast, acting, every edge of your seat, anxiety inducing moment was superb! I am upset with some of the outcomes, but all in all, 10/10! I will gladly rewatch gladiator and gladiator 2 the rest of my life. Wonderful production!"
  },
  {
    "rating": "5/5",
    "review": "I LOVE THE MOVIE. Would I watch again, ANYDAY OF THE WEEK. Would I tell my friends and family to watch it, Yes, yes I would."
  },
  {
    "rating": "4.5/5",
    "review": "Action was great and entertaining, performances were incredible. Paul Mescal looked like he wanted to smooch the healer REALLY bad!"
  },
  {
    "rating": "0.5/5",
    "review": "After watching the first 30 minutes of this movie I couldn’t take any more. The cast was weak and the dialogue sucked. They all phoned in their parts including Denzel who is one of my favorite actors. This is not the first Gladiator, it’s a very weak imitation. If it were any worse it would be a “ B movie “, I can’t recommend it to anyone unless you need something to put you to sleep. It wasn’t worth the wait. Unfortunately this isn’t the first peace of crap Hollywood has produced lately it just one of many. The writers, directors and cast should be embarrassed about the quality of this movie."
  },
  {
    "rating": "2.5/5",
    "review": "A história até que entretém, mas está longe de ser tão bom quanto o primeiro filme. E algumas falhas de roteiro, tipo, tubarões no coliseu??? E como aqueles gêmeos loucos chegaram ao poder??? Não houve explicação lógica para isso."
  },
  {
    "rating": "4/5",
    "review": "Atmosphere was close to the original. Actors were fantastic."
  },
  {
    "rating": "2/5",
    "review": "You can't stack this one up against Russel Crow's Gladiator. Almost across the board, the wrong actors were selected. They aren't bad actors (who doesn't love Denzel), just didn't hit the mark. Main character is lackluster and one dimensional. Story was predictable and cliche. The digitized animals were from Disneyland. Music was mediocre. But the scenes, locations, and costumes were all solid. Overall— Please no more Gladiators!"
  },
  {
    "rating": "3/5",
    "review": "Denzel was great. The plot and writing were very mediocre. Not even approaching the quality of the original. I was pretty bored by the end."
  },
  {
    "rating": "1/5",
    "review": "Pedro Pascal died!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Sadly disappointing, 24 years since the first one which was a masterpiece. This is substantial proof that novel movies let alone ideas are sparse. Denzel sounds like he is from LA, the CGI baboons are eerily bad and the storyline is the same but different. Some things DO NOT require a sequel. Hence why you don’t see a Mona Lisa II."
  },
  {
    "rating": "4.5/5",
    "review": "Ridley Scott took his sweet time getting around to this sequel to 2000's Oscar-winning \"Gladiator.\" The wait was mostly worth it. Rising star Paul Mescal picks up Russell Crowe's sword as Lucius, the son of Crowe's character who was sent from Rome as a child following the events of the first film. Denzel Washington brings all his considerable star power and charisma as Macrinus, who runs a stable of gladiators but has much bigger ambitions. Connie Nielsen, as Lucius' mother Lucilla, and Derek Jacobi, as a Roman senator, are the only two actors from the original film who are in the sequel, and they are fine (particularly Nielsen). Pedro Pascal is also along for the ride as a general (and Lucilla's husband) and he has some solid moments. But the movie, which is very bloody but bloody terrific, belongs to the mesmerizing Mescal. Though \"Gladiator II\" was criminally overlooked by the Oscars, it will likely be viewed in 20 years as the film that catapulted Mescal to superstardom. Mescal has already played Stanley in \"A Streetcar Named Desire\" on stage in London (and will soon be bringing it to New York) and he's definitely got a bit of a Brando vibe, but with a more contemporary twist. I can't wait to see what he does next."
  },
  {
    "rating": "2/5",
    "review": "Pedro and Denzel save the movie from what of been a snore fest with its cheesy references to the first, trying to piggy back on its success. It’s a movie that you will watch once to see the gladiator series to its conclusion but will never miss not seeing it a second time….. it missed so many opportunities for it to make a fantastic film but ultimately falls short on so many fronts. Pity."
  },
  {
    "rating": "1/5",
    "review": "Whilst Denziel gives 110% effort, it can't make up for the terrible CGI and a script written by a 14 year old trying to pass off the Gladiator 1 script off as his own work, hastily copied on the bus before class."
  },
  {
    "rating": "0.5/5",
    "review": "At best a very average film, at worst a film that put poor special effects and ridiculous Hollywood fantasy way ahead of actual storyline or any type of actual interesting plotline. The first film was a sensation, this one would barely be noticed if it wasn't for the first. Denzel Washington's performance is good, but the plotline drags throughout the film and it becomes laborious to watch the obvious twists and turns that the writers have thrown together in a bid to extend the film to a gruelling 2.5 hours to meet the criteria of an 'epic'. It's a pity that this film was ever made as it tarnishes the first, it's actually almost offensively bad which is a shame for the actors involved who are actually the only bit that I wouldn't criticise."
  },
  {
    "rating": "3/5",
    "review": "Just mid all around. Bland writing, boring speeches, the fights are too stupid to be taken seriously."
  },
  {
    "rating": "5/5",
    "review": "One of my favourite films of 2024, as someone who had only watched the original Gladiator recently in preparation for this film I thought it lived up to my expectations. The original is better, as it always is. But I thought this one had a great storyline, great graphics and overall a great watch. I’d recommend!"
  },
  {
    "rating": "2/5",
    "review": "Hard to replace such a charismatic actor as Russel Crow. And who likes a sequel without the original lead actor!? The only good actor they hired wasn't even the replacement but the slave dealer. A few good fighting scenes, bowring script, nothing original and they had what, 10+ years to come up with a script."
  },
  {
    "rating": "1.5/5",
    "review": "I liked the first movie. This movie is a mess. Disjointed plot. Bad dialogue. Skills and backstory that don't make sense along with the main character's accent. Lack of emotional cohesion. Archers who can't hit the obvious target. Bad emotional plotting. It would have been a tiny bit better if DW's character had just been to destroy Rome all along rather than try to seize and keep power himself. Unsatisfying mess overall."
  },
  {
    "rating": "5/5",
    "review": "It was an awesome movie where it picked up where the first gladiator left off. Denzel Washington was stellar"
  },
  {
    "rating": "0.5/5",
    "review": "I didn't even finish it. The sequel tries so hard to grasp the magic of the original and falls way short. The lead character is dull, and there are many parts that are copied from the original, but it falls so flat. Also, making Lucius Maximus's son? They dare taint the memory of Maximus like that. Get outta here."
  },
  {
    "rating": "2.5/5",
    "review": "Mr. Washington is unquestionably the film's greatest strength. Macrinus's machiavellian transformation is a wonderfully clever reversal of Proximo's and Maximus's characterizations from the original. The inherent contrast in behavior--the different ways each of these men goes about justifying their actions--is enough to legitimize the story's progeny as a spiritual successor, if not a direct descendant. And considering the age of the original film, tailoring the sequel exclusively around Macrinus may have been a better way to go."
  },
  {
    "rating": "1.5/5",
    "review": "Felt like a sad copy of the original, with nothing original at all. Nothing interesting about the plot, and the acting was poor. Overall waste of time. Just rewatch the first one."
  },
  {
    "rating": "3.5/5",
    "review": "Good editing and cgi, interesting movie, but it lacked depth."
  },
  {
    "rating": "2/5",
    "review": "This movie would be much better if they changed the name and removed all ties to the original Gladiator. Completely ruined Russell Crowe’s character. Not Denzel’s best role. Fast paced and bad CGI. Meaningless character deaths. Such a shame, I had high hopes."
  },
  {
    "rating": "3/5",
    "review": "Sorry, but it does not work twice. Except for Denzel Washington, his way with words is way more exciting than all the sword fighting. Perverted emperors are as forgettable."
  },
  {
    "rating": "2.5/5",
    "review": "I don’t know…:it was entertaining for a bit…but I think they tried to hard. I felt nothing for all the characters….Denzel is an amazing actor and I think he was extremely underutilized and rushed. I would definitely not watch it again."
  },
  {
    "rating": "0.5/5",
    "review": "God awful. If only I could get those 2 hours back. Please don't male the same mistake. Ridley Scott should be ashamed."
  },
  {
    "rating": "1/5",
    "review": "Watching this film was a tedious undertaking which left me saddened for its elderly director, Ridley Scott."
  },
  {
    "rating": "1/5",
    "review": "I'm really starting to lose faith in rotten tomatoes. How are the ratings so high for this? It was hack nonsense! Devoid of any emotional weight and only entertaining for its relationship to the original, though anyone who truly loves the original might find it hard to stomach."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible acting , terrible plot with an extremely lame ending , shocking how we are in 2025 and writers have not advanced in their writings of Movie script. This movie was beyond lame, terrible cast terrible acting , dont even waste your time"
  },
  {
    "rating": "1.5/5",
    "review": "Overacting and horrible CGI, and bad plotline"
  },
  {
    "rating": "3.5/5",
    "review": "It was very true to Gladiator with the music and the way it was filmed. Felt abit long like the story dragged a little."
  },
  {
    "rating": "2/5",
    "review": "What a load of shite!! Sorry.. should have left it well alone. Hasn’t got the heart of G1. Can watch the first one over and over but this one I shan’t watch over. So overrated by critics."
  },
  {
    "rating": "1.5/5",
    "review": "I apparently watched a different movie than everyone else because they seemed to like it. I found this and Scott’s last movie Napoleon overhyped and underwhelming. I expected some rehash here, but not to the point that it was throwing every great line from the first one back at us again. While it does have a shining performance from Denzel in the mix this movie is what the term “jumped the shark” embodies and then he actually jumps the shark! I see many reviews blowing past that but they must be ready for a swim."
  },
  {
    "rating": "1.5/5",
    "review": "It's so cheesy that it's like that's what they were going for. And a lot of the time, they blow right past cheesy into full cringe. I'm surprised the cast would perform without bags on their heads. Fantastic sets but brutal cgi. Sometimes Scott puts out great films. Other times, he puts out Gladiator II."
  },
  {
    "rating": "1/5",
    "review": "There is nothing good about this sequel. Absolutely awful."
  },
  {
    "rating": "1.5/5",
    "review": "Gladiator 2 is a soulless attempt to recapture the magic of the original. Lacking the emotional depth, gripping storytelling, and raw intensity that made Gladiator a classic, this sequel feels unnecessary. The characters are forgettable, the action relies too much on CGI, and the pacing is uneven. Even the score fails to leave an impact. Rather than honoring the original, Gladiator 2 serves as a disappointing reminder that some films should be left alone."
  },
  {
    "rating": "1.5/5",
    "review": "Shocking plot and writing. Felt like each character from the previous movie was force fit into a storyline that then struggled to make sense. Some good action sequences but even these felt stretched. As a HUGE fan of the original this was such a disappointment :("
  },
  {
    "rating": "2/5",
    "review": "Boring and weird. Couldn't finish it"
  },
  {
    "rating": "4.5/5",
    "review": "The story, while similar to the last three main Star Wars films in that there isn’t much different here compared to the original Gladiator, more than sufficed. It actually exceeded my expectations. While I believe Denzel Washington’s performance is getting a little too much notice, it was Paul Pascal‘s obvious commitment to the lead role that makes the film sing. Additionally, Connie Nielsen‘s performance was more than adequate. Director Ridley Scott still knows how to paint a fascinating picture of ancient Roman times, to the point where occasionally I shook my head, wondering how he was doing it."
  },
  {
    "rating": "1/5",
    "review": "They guttered the first movie with this sequel. Absolute garbage. But I give it 1 star for the production quality. It could have been great if there was a plot and a script. Sadly no scene is understood since the characters has no motives to explain their actions or how they are related to one another. It’s like the idea behind this movie was to just shoot every scene from the first movie and then ”fix it in post”. I question how it has gotten 82% rating from the user votes here. Are you guys actually real people who has watched this movie?"
  },
  {
    "rating": "0.5/5",
    "review": "The original was a career defining film where Russell Crowe, Joaquin Phoenix and Connie Nielsen delivered performances that will stand the test of time. It’s a shame that Ridley Scott decided to cast a shadow on its legacy by making Gladiator II, complete with CGI sharks, costumes that look highly flammable, and Botox. I wish I could unsee it."
  },
  {
    "rating": "4/5",
    "review": "Expecting this to be a cash in but I really enjoyed it and I wasn’t bored really ever. Which is huge."
  },
  {
    "rating": "1.5/5",
    "review": "If you're expecting to watch an epic movie like the first Gladiator, don't bother. This movie wasn't nearly as good as the first one. The entire movie you're wondering \"How did two complete morons take control of the Roman Empire?\" Denzel seemed very out of place in the movie, basically playing a typical Denzel character but in ancient roman times. The way they 'upped the ante' with the over the top WTF battle in the arena was completely ridiculous. This movie is fine for a single watch, but its not something I'd ever re-watch this movie like I do with Gladiator."
  },
  {
    "rating": "2/5",
    "review": "For the first hour I was invested in the story, and I was having an absolute blast with the action sequences. But after what you think the final battle would be it just drags itself on for an hour and 26 minutes. It gets over convoluted and you don't even know who's evil or who the big bad is anymore. If it ended earlier I would have given this a much better review because like I said before I had an absolute blast for the first hour. But it lost me and my engagement and I was bored out of my mind and it honestly felt like homework just to finish the film."
  },
  {
    "rating": "1/5",
    "review": "Lets see ... an undersized Gladiator fighting in a shark filled Coliseum on a viking warship ... as we expected. Aside from the bad AI .. a familiar story with familiar characters. Shocking this is a Ridley Scott film."
  },
  {
    "rating": "2.5/5",
    "review": "Surprised that Ridley Scott put his name on this film. He needs to retire. I felt more sorry and sympathy for the mandrills and rhinoceros than I did for the humans."
  },
  {
    "rating": "5/5",
    "review": "The first film I went to see five times in the theatres, and never got bored of. The beauty of this movie is in everything it doesn't say: every time there'll be something you missed the last round, and the characters give way to infinite speculation and analysis through script and actor performance both. While by far not the most groundbreaking film I've ever viewed, somehow, it has become my most watched, most talked-about, and the one that I've put all of my friends through as well. Haven't found one who didn't like it yet, or who didn't still find themselves intrigued afterwards."
  },
  {
    "rating": "1.5/5",
    "review": "Lame screenplay and utterly predictable and trudging plot. Sharks and rhinos fighting in the colosseum alongside gladiators. Ridiculous. Ridley Scott is a god, but he needs to retire."
  },
  {
    "rating": "2/5",
    "review": "\"Hey General, the draw bridge is stuck\" \"Never fear, I will dodge a bunch of arrows, climb the tower and cut a rope you guys are standing right next to\" This movie is full of bad writing like this. It gets an extra star because it's still a gladiator movie."
  },
  {
    "rating": "4/5",
    "review": "Ridley Scott can rest upon his laurels of so many brilliant movies and it appears he did not attempt to eclipse Gladiator and Russell Crow et al remarkable performances. This grand undertaking is best summed up when watching a man ride a rhino. A spectacle and entertaining, but utterly ridiculous. I look forward to watching it again. On a technical note the CGI is too obvious."
  },
  {
    "rating": "0.5/5",
    "review": "Very Bad. The dialogue felt rushed and choppy. It felt as if the movie was supposed to be an hour longer but they cut it down to make it a shorter run time. Just rewatch the original."
  },
  {
    "rating": "1/5",
    "review": "I'm 31 minutes in and I think I've seen enough to know that that Gladiator 2 should not have been made. One scene after another a near direct take from the first movie. Sad that Ridley Scott has come to this, the lack of artistic desire, and phoning it in just to make a buck."
  },
  {
    "rating": "3.5/5",
    "review": "Prepare yourself .. for the free-est movie of the season. Gladiator Again. I mean Gladiator II. Walk don’t run! To this heaping stinker ever shot on not 35 mm film. 1996s Jumanji won’t miss their cgi nightmare baboons. Denzel played Denzel playing proximo Siskel and Ebert would have removed their thumbs."
  },
  {
    "rating": "5/5",
    "review": "From acclaimed director Ridley Scott’s cousin, “Didley Squat”, comes a masterpiece that is still waiting to reveal Itself. Didley strikes again!"
  },
  {
    "rating": "1/5",
    "review": "What an absolute waste of time."
  },
  {
    "rating": "1/5",
    "review": "Where do I even start!?? Between the terrible plot, acting or editing. Terrible movie, that honestly should have never been made. I'm a huge Gladiator fan, the original in my top 10 of all time. Extremely disappointed as I had such high expectations."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible … doesnt even come close to the quality of the original"
  },
  {
    "rating": "2/5",
    "review": "Never explained why he was sent away, why the twins are ruling. And how easily the senate is weak and Denzel rises to the top while murdering kings in front of guards and people?"
  },
  {
    "rating": "1.5/5",
    "review": "Exact same storyline as 1"
  },
  {
    "rating": "0.5/5",
    "review": "I have no clue how this movie has a score in the 70's, It is terrible. It is a more ludicrous version of its parent. Mescal is no Russel Crowe, and Denzel couldn't even bother to do an accent. And let's not leave out over use of CGI. This sequel didn't add anything more to the story that mattered. Why can't we leave well enough alone?"
  },
  {
    "rating": "1/5",
    "review": "Gladiator 2 is a shadow of the original. The plot is predictable and the movie just doesn't draw in the viewer. The directing quality nowhere near matches the 1st movie. It is a B movie, at best."
  },
  {
    "rating": "1/5",
    "review": "Denzel was great as usual,sadly he couldn’t redeem this travesty"
  },
  {
    "rating": "2.5/5",
    "review": "Another helping of gladiatorial ultra violence many years after the first film. This is Denzil's film of course and Mescal struggles to make much of the title role. Some good set pieces but what's the point?"
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie. It was action packed and not extremely predictable like similar movies have been. While it’s over 2 hours, you don’t notice the time because it keeps your attention."
  },
  {
    "rating": "5/5",
    "review": "Loved the animation, the music, and it brought back the best memories from childhood. Certainly a must see"
  },
  {
    "rating": "1/5",
    "review": "I cannot believe Ridley Scott allowed his name to have anything to do with this film. It was absolutely ridiculous and extremely boring. I’m not sure why everyone is so enthralled with Denzel Washington’s performance; he was amazing in Philadelphia, Malcolm X, and Fences. This film was a waste of his time and celebrity. The plot made no sense. The timeline was completely off. Lucille was murdered by her brother at the age of 33 in 182. Caracalla and Geta were not born until 189. I detest when writers take that much creative license with historical figures. People watch these movies and believe them to be factual. I do not and will not recommend this movie to anyone who enjoys films."
  },
  {
    "rating": "2.5/5",
    "review": "Great action scenes thin on plot"
  },
  {
    "rating": "1/5",
    "review": "It's garbage. It's the same story as the first movie without adding anything. In every role, the characters from the second movie are weaker than the first. The gladiator is no Russell Crowe. Where the emperor was once spine tingling creepy, these are now just clowns. The scene where the other gladiators cheer our hero on is not earned; it's just a cheap copy of the original. Even the master of ceremonies is high-school-prom vapid. It keeps showing flashbacks to the original movie in an effort to borrow gravitas that this movie does not create. Watch the first movie a second time and you'll get more out of it than watching this one."
  },
  {
    "rating": "1/5",
    "review": "The title should already tell it that Gladiator’s II story is lackluster and for sure not comparable with the original. The movie looks like nobody cared about it with its bad CGI. The acting part of Paul Mescal and Pedro Pascal's performance was good but Denzel Washington was the one that did steal the show as he had the best performance of all. The cast of the first Gladiator like Derek Jacobi and Connie Nielsen with the later ones' performances was not good to read. Nowadays we see more and more the use of Botox which is okay to do so if chosen but also not ideal for actors especially because their job is to read facial expressions and with that, it can be difficult to do so. Overall okay to watch if it's on TV but for sure not in the same league as the first one."
  },
  {
    "rating": "1/5",
    "review": "Gladiator II was as bad as the original was good. So disappointing. Great cast, great director, but no heart, storyline, or purpose. Really looked forward to it, but was sad for a few days after watching."
  },
  {
    "rating": "1.5/5",
    "review": "Think of it as a spoof comedy and you'll be fine. If taken seriously, the plot doesn't make sense, the battles are cgi cartoons, and the characters are cookie cutter. I expected Denzel Washington to put on a pork-pie hat and fall into his character in Training Day. And then they hang the ending oain a stupid fight and a speech. Who are these guys, again?"
  },
  {
    "rating": "0.5/5",
    "review": "A sad film with some of the worst CGI ever. The killer baboons were laughable. The storyline was disjointed and not believable at all."
  },
  {
    "rating": "0.5/5",
    "review": "What a disappointment. They were so desperate to make a sequel, they threw out the strong storyline of Maximus, to make room for this disaster. The movie tried to use over the top ridiculous scenarios to compensate for it's poor storytelling."
  },
  {
    "rating": "3.5/5",
    "review": "As far as epicness goes this movie pales in comparison to the first Gladiator. Russell Crowe is a much better actor than Paul Mescal. Mescal is good in his own right but side by side Crowe is by far superior. This movie being a little far fetched and over the top was (in my opinion) trying to hard to match the energy from the first movie. It just doesn't. It's not bad. If you like action and swinging swords, you'll enjoy it. Just don't go into the fray with high hopes bc they won't be met."
  },
  {
    "rating": "3/5",
    "review": "Movies fine could have been better they wasted pedro pascal denzel Washington's is an idiot tease the badass sword fight very disappointed"
  },
  {
    "rating": "4/5",
    "review": "Not quite as epic and contemplative as the first Gladiator. I understand the desire to escalate everything and make it bigger, badder & more violent than the first, but it seemed to lose a bit of the charm that the first one had. Still, it was a very good film. Great performance from Mescal and Washington, great action sequences, set and costume design, etc. The cinematography didn't seem as nuanced as the first film and left a little to be desired in certain scenes but it was decent. With as many large-scale scenes that this film had, you can tell that a LOT of work, planning and effort went into it. So, my overall rating would be a 4/5, a very good film worth watching. As a side note, the trailer for this movie contained some crucial elements to the story that somewhat spoiled some parts, so when I watched the movie I already knew some of what would be happening and it wasn't as effective; the producers, etc. really should have given that more thought."
  },
  {
    "rating": "1/5",
    "review": "I never watch sequels but the buzz about this one was so great that I put aside my own rule and watched it... What can I say? I'm always right. To say that this is a bad movie is an understatement. Silly script, ridiculous fights, two Cezars, protagonist and antagonist (Mescal and Pascal) characters look the same so you don't know who's who (even the names of the actors sound the same!!) , stupid plot... My only comfort is that I didn't pay to watch this nonsence. Ridley Scott really shoudn't make novies anymore. I'm still recovering from huge disappoinment that was Napoleon."
  },
  {
    "rating": "1.5/5",
    "review": "Watch this movie to appreciate what a classic the first one was. Then watch the original to rinse off the bad taste this one leaves in your head. The AI generated arena fight sequences. Please NO! Where is the writing that made the first one an uber-classic! Every dialogue in the first one, transcended the moment. This one falls flat, Just like AI generated Rhino, and just as hard. This Gladiator is a forgettable ode to the original."
  },
  {
    "rating": "3/5",
    "review": "What a fabulous cast. Connie Nielsen is so good and regal and beautiful. Pedro, well, he always seems to leave us at the wrong time (Game of Thrones) lol. Many different accents going on...sometimes with the same actor. All actors were so good. It just did not have the pull. I hate to see a lead strong female character to be sacrificed early on. The animal realness was terrible. Denzel seemed bored. I can't blame him. So was I."
  },
  {
    "rating": "0.5/5",
    "review": "Movie is horrible. Do not waste your time."
  },
  {
    "rating": "5/5",
    "review": "Historia original, musica de diez y el reparto de lo mejor que existe para una secuela de esta talla. Me fascinó."
  },
  {
    "rating": "5/5",
    "review": "Despite of the 1st Part, I can see that this part becomes legendary epic."
  },
  {
    "rating": "1.5/5",
    "review": "Simply a bad movie. The script is downright poor and the development of the story isn't paced well. The last fight is just downright stupid. It looks great if something and you can see the budget of the film very well!"
  },
  {
    "rating": "2.5/5",
    "review": "It's just the same film as in part one, except that this time the characters have virtually no personal connection to each other and therefore tend to come into contact with each other by chance when their own plans become intertwined. There is no attempt to fathom out why and how someone turns out the way they do, they just fill stereotypical roles. That's why you don't have any emotions at all when watching the film and nothing will be remembered. It is a film that sometimes delivers beautiful images, but in reality is completely superfluous."
  },
  {
    "rating": "0.5/5",
    "review": "It genuinely felt like a snl sketch of a movie… it was so so generic and a pale comparison to the original. Did aye eye write this script?😭 i feel so sorry that all of the effort was put into a terrible predictable story."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is lazy film making. Soldiers ride into town, boy runs off and rider asks remaining kids \"have you seen this boy\"? What exactly could he possibly be showing them? Did they sketch a portrait? Strange. Horrible CGI baboon scene, they managed to make Cgi look worse than 20 years previous. I finally turned it off when Denzel says to a guy in English (who thinks he doesn't think speaks his language), \"what language do you speak?, I can speak them all. He gets annoyed when the guy doesn't answer. Maybe he doesn't understand English and you got to try something else?? This movie was terrible in the first 20 mins and I like everyone involved in the making, but where is the love?"
  },
  {
    "rating": "4/5",
    "review": "It was really good the fighting the story old rome it was nice alot happened but I did see a few things from those about to die in there."
  },
  {
    "rating": "5/5",
    "review": "Gladiator II is definite must watch. Great action and setting. The costumes are also on point. Absolutely couldn't get enough of it. 🔥"
  },
  {
    "rating": "4/5",
    "review": "This movie isnt going to do anything to dispel the stereotype that everyone living in Las Vegas works on the Strip or in a casino. But then if you live your life based on stereotypes youre probably not going to see this movie anyway. Almost a week into its run, there were only two other patrons in the theater where I saw this film. But low movie attendance has been the norm since the pandemic, especially the kind of movies I prefer. I note that it will begin its run at my local art theater, The Beverly Theater, in over a week, on January 25th. Im curious whether it will attract a larger audience there during its run? I read in IMDB that when the script was sent to Pamela Andersons agent that he rejected it before giving it to her to consider. It was her son who saw the script, got it into Andersons hands, she loved it and then fired that agent. I can kinda see why the agent rejected this script. Assuming that an agents primary goal is to elevate his clients status and marketability, all in service to make the big bucks, this movie does none of that. Its an unflattering portrayal of flawed aging women and men in an industry thats moved on, but theyre still holding on to what it used to mean or the attention that it brought to them a long time ago. It takes a lot of bravery to be willing to tell this story and not sugar-coat it or give us some kind of tacked on happy ending. This is what happens to dreamers when no one can hear the music anymore except the dreamers themselves. If this had been a TV movie someone would have tragically died and then everyone connected to the story would have seen the light and made better choices. This is not that kind of simplistic crap. The characters are a bit unlikeable and the situation is on a definite downward trajectory. But it is such an important story to tell. How do we hang on to the good things that we had in our lives but also recognize that there are some careers that one cannot do forever. Our value, our meaning in life, shouldnt be so dependent things that dont last forever. We should be able to hold on to the memories while exploring the next chapters in our lives."
  },
  {
    "rating": "1/5",
    "review": "Why are sequels always so disappointing? As soon as I saw the bamboon scene I was out - absolutely terrible CGI for a 2024 film. Poor casting and acting. This was a hard watch."
  },
  {
    "rating": "1.5/5",
    "review": "Easily one of this years worst movies. The story line was juvenile and weak. Terrible. Wait for the paperback on this one"
  },
  {
    "rating": "2/5",
    "review": "As a big fan of the first one this Gladiator II was a HUGE let down. The Writing and dialog where terrible. There where no Quotable lines through out the whole movie while part 1 had like 10 in the first 10 minutes. The intro naval battle was a big disappointment as well."
  },
  {
    "rating": "3/5",
    "review": "IT was OK at best dialogue was cringe at best of times like someone announcing exactly what they are doing before they do it in today's terrible movie standards it's a 5 out of 10 in comparison to the first movie 1 out of 10 but ya know visuals were good and neat except animals they can't seem to get those right."
  },
  {
    "rating": "1/5",
    "review": "Save yourself the disappointment of this, and just rewatch Gladiator and appreciate its brilliance. Shortly into this, I knew it was terrible, but they lost me completely with the sharks. I can only assume Ridley needed the money."
  },
  {
    "rating": "2/5",
    "review": "A bloated, turgid, endless, and gory return to the dream that was Rome."
  },
  {
    "rating": "1/5",
    "review": "Glad I didn’t pay to watch it in theatres. It was just boring. The fight scenes were dull and predictable and there was no sense of connection between the main character and the people around him. The movie seemed to lean too heavily into a ‘tell’ rather than a ‘show’ narrative story structure, so none of the characters had particularly memorable scenes"
  },
  {
    "rating": "1.5/5",
    "review": "The amount of bots it must haven’t taken to keep the user reviews afloat is staggering. Pretty crazy how shamelessly they are using that strategy now. The delusional idea that review bombing over the years was faked instead of genuine disappointment is the direction of the art-form. That’s how they justify the bots. By gaslighting themselves into believing they have talent. Protects their ego but ignores the reality that talent has left film; mostly cause the production teams with talent quit. This film is a perfect example and comparisons like this to its predecessor will be studied in future film classes to show the transition from a golden age to a dark age of film."
  },
  {
    "rating": "1.5/5",
    "review": "I'm highly disappointed. I think Ridley Scott as director and screen - cool. Anothet 100,,8beyond much, but we have Ridley to us today. And it pains me to say that I truly did not like this movie the theme. Kept in play with the original alligator but kept in play. And then go beyond 16 years. Progress didn't explain the poverty that Ridley Scott chose to portray in this round, it didn't talk about. The years of transition, it went into an attempt to do character building that didn't Avail itself enough time to do so."
  },
  {
    "rating": "2/5",
    "review": "Too many cliches for me"
  },
  {
    "rating": "3.5/5",
    "review": "A pretty fun sequel that makes up for some of its early-on melodramatic dullness with a pretty solid second act, creative battle sequences, and a thoughtful peaceful resolution to the Roman uprising. The main character is kind of an angsty wet blanket , but he gets better in the second half. Special shoutout to the opening siege of the city, the baboon & rhino fights, and the Colosseum naval battle (even if the sharks were pushing it into cartoon territory). I enjoyed Pedro Pascal as the conflicted war general and Denzel Washington easily stole the show as the clever scheming political manipulator. The twins were weird, but entertaining as the crazed emperors, even if they look WAY too pale and Celtic to be Roman. Though I must say, the role of women in this movie is a little disappointing as the Palestinian actress was originally the female lead, but had all of her scenes cut despite playing a crucial role as one of the revolutionaries (for TOTALLY un-political reasons). That only leaves us with two wives who are mostly just there to be fridged and make the main male lead feel sad and mad. One of them is just there for “mommy issues” melodrama while the other one doesn’t even get a single line of dialogue! That being said, this was still a very entertaining historical epic that serves as a decent legacy sequel to the original Gladiator."
  },
  {
    "rating": "2.5/5",
    "review": "When you copy and paste the first movie plot and apply it into the sequel you still get an entertaining movie, but your left wondering why didn't they try anything new."
  },
  {
    "rating": "1/5",
    "review": "Loved the first one but visuals came first in this one . A rushed mess. Couldn’t care less about any of the characters."
  },
  {
    "rating": "0.5/5",
    "review": "I sincerely hope, that someday someone will make a film about Ridley Scott as bad as this raping of history and good taste he unleashed onto us. I am not only talking about historical inaccuracies, this film is not historical in any way, it is like a bad fanfic of the actual history. I am talking of the bleak characters, stupid story (the moment alone where the hero catches a bunch of strikes with spiked gloves with the midface without showing a single scratch thereafter) and pointless gore. To sum up- maybe it is not a good idea for 87 old senior to keep working at such an age."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was unbelievably bad. Not a patch on the original. It just doesn't have anything worth mentioning of merit despite a stellar cast. Managed an hour of it and couldn't take anymore of this drivel. In short, it was crap."
  },
  {
    "rating": "1/5",
    "review": "Terrible movie. The original was good, but this is a shameful attempt to use the success of a previous movie to cash in."
  },
  {
    "rating": "5/5",
    "review": "Oh what a brilliant addition to follow the original masterpiece. I was absolutely terrified to see what would happen when I heard a 2nd Gladiator was coming. I am beyond thankful that I was wrong and that they did an absolute fantastic job. This is by far a 2nd masterpiece to go alongside the story of the 1st masterpiece."
  },
  {
    "rating": "1.5/5",
    "review": "A rip-off of the first film—sloppier, uninspired, rushed, and poorly acted."
  },
  {
    "rating": "5/5",
    "review": "It is worth seeing it in the theaters , big screen excellence ."
  },
  {
    "rating": "4/5",
    "review": "solid continuation of the story with a great cast"
  },
  {
    "rating": "2.5/5",
    "review": "I can’t lie, I thought this movie was very overrated. Normally, I’d enjoy listening to Denzel Washington read the phone book. But like the rest of this plotless movie, even he was too over the top for me. I thought the CG was almost cartoonish and very fake looking. This was a bunch of special effects and CG in search of a movie. Predictable down to the heavy handed references to the original and the big “plot twist.” Stream it for free, don’t rent or buy it."
  },
  {
    "rating": "2/5",
    "review": "Paul Mescal had the emotional depth of a wet sandwich. Denzel was distracting, but not in a good way. The movie was almost beat for beat the same as the first. Oof, what a miss."
  },
  {
    "rating": "1.5/5",
    "review": "Another sad sequel that insults the audience's intelligence at every turn. I recommend getting drunk if you want to enjoy it. Characters are all flat and hilariously ridiculous. They might as well be caricatures. Action and fight choreography are just ok. This film desperately shows flashbacks of Gladiator 1 in its effort to be engaging. Decent production value but that's about it."
  },
  {
    "rating": "2/5",
    "review": "Love Denzel, Washington. He has a minor role in this movie. The opening half hour, where Rome sacks on African city in a huge battle scene, I feel like I have seen 100 times before and other movies. That's the way I felt about much of the movie. None of it is really original. A lot of the acting is just flat out bad. Hope Denzel got a good paycheck, cause this was a waste of his talent, and he surrounded by inferiors in my opinion."
  },
  {
    "rating": "1/5",
    "review": "I walked out of this movie in protest to what so many filmmakers are doing these days, which is rehashing scenes, storylines, and even lines from old movies that made us actually feel something. This film felt like the temu version of the first Gladiator film, which was more passionate, epic, and left the audience wanting more, but definitely not this. This was not it."
  },
  {
    "rating": "0.5/5",
    "review": "We are not entertained."
  },
  {
    "rating": "1.5/5",
    "review": "Ridiculous sequel to the original gladiator with a contrived, predictable script and dialogue almost taken line by line from the original."
  },
  {
    "rating": "1/5",
    "review": "Was excited to watch but not impressed by the storyline. Denzel seemed uninterested portraying his character and no way was this sequel close to the amazing performances in the first movie."
  },
  {
    "rating": "3.5/5",
    "review": "Was a good movie it kind of felt like the first movie with some of the same action of becoming a gladiator. The thing that was disappoint was the battle scene in the arena with ships and water that had sharks. I could accept water if diverted water from a aquifer but they had sharks and we all know that sharks require salt water and geography getting salt water and live sharks to Rome would have been impossible for the era."
  },
  {
    "rating": "0.5/5",
    "review": "Too theatrical, too cartoonish, just google Caracalla and compare to what you’ve seen in this movie, looks like complete copy of first one just in different decorations. Not good, first one was a lot better."
  },
  {
    "rating": "0.5/5",
    "review": "Gladiator 2 is a movie set in one of the most dramatic periods in recorded history, with incredible sets and stunning visuals. If only the producers had actually read anything about that history, or hired a lead that could capitalize on the incredible opportunity. The writing takes the wild story of Caracalla and completely ignores it. They create their own flaccid attempt at drama instead of pulling from the actually exciting events of the time. They create multiple fictional characters out of nothing to do things that are less exciting than the actions of characters who actually existed at the time. Mescal's acting as the lead is lazy and emotionless. He slouches through dead-eyed speeches, with the vocal dynamics of a tree sloth. He is clearly out of his element, which is made all the more apparent by a lazy cash-grab script. Denzel carries the show as always, but his performance was hamstrung by a poorly written and wildly unrealistic fictional character. What makes things worse is that his character's historical namesake, Macrinus, had more drama and more realism than the nonsense they wrote for Denzel. Overall, it is another example of Hollywood lazily butchering a classic IP in the name of profit, I am genuinely disappointed."
  },
  {
    "rating": "0.5/5",
    "review": "Awful, so disappointing on every level."
  },
  {
    "rating": "1/5",
    "review": "This could have been great. All star cast but the writing was horrible."
  },
  {
    "rating": "3/5",
    "review": "Great production and it kept my interest. It lacked gravitas though. Without Joaquin Phoenix and Crowe, there just wasn't much of a spark."
  },
  {
    "rating": "3.5/5",
    "review": "I wasn’t expecting much and it’s likely lower than it deserves because the allegory to our times left me Pedro Pascal “so sad”."
  },
  {
    "rating": "0.5/5",
    "review": "I really expected more given the director and the cast. It was like an 8th grader tried to make a movie by way of procrastinating lines and scenes from the original."
  },
  {
    "rating": "3/5",
    "review": "The sequel no wanted and wasn't needed. The first was a great movie. This one does suffer from the typical sequel problems. It seems a bit contrite and long in the tooth. The only thing that makes this movie palatable is the performance of Denzel Washington."
  },
  {
    "rating": "2.5/5",
    "review": "My husband and I were were excited about seeing this movie. We loved the first Gladiator. However, this sequel was not close to being as great at the first one. We were very disappointed with the sepia-like coloring and the cheaply made special effects."
  },
  {
    "rating": "1/5",
    "review": "I would think it would be invaluable to keep your helmet on during a battle."
  },
  {
    "rating": "5/5",
    "review": "Those who do nothing are always willing to criticize those who do something."
  },
  {
    "rating": "1.5/5",
    "review": "Nowhere near the first instalment. PM is not a hero in the veins of Aussie guy.. And is a re-iteration of the 1st movie in general..roughly.. WOW..shows what a name RS.. can get away with...anyone else pitching this mediocre flogging of a dead horse would not get bought..try harder & stay humble RS!!"
  },
  {
    "rating": "2/5",
    "review": "Main character is a terrible actor. Storyline moves way too quickly. Seems like this should have been a series."
  },
  {
    "rating": "4/5",
    "review": "Of course it is impossible to match the first movie. This film very good, but not quite great. The writers did a good job of coming up with a story that ties back to the first without it being ridiculous. Much better than the typical snooze-inducing remakes or cringy super hero movies."
  },
  {
    "rating": "3.5/5",
    "review": "I’m struggling with my star placement between 3 stars & half of the fourth star. I definitely feel like the movie was a good watch if you would just like something that is going to entertain, drama filled, & action filled but if you’re comparing to the first gladiator you will be disappointed."
  },
  {
    "rating": "3.5/5",
    "review": "I thought it missed the mark a little. Some of the action was unbelievable & the story a but bland."
  },
  {
    "rating": "4.5/5",
    "review": "An amazing return from the legendary gladiator. Pedro Pascal did a great role, along with others. The original Gladiator put up a hard challenge for the sequel to compare to, but this film beat that challenge. I would give it an 87%"
  },
  {
    "rating": "1/5",
    "review": "Plot is a waste of time."
  },
  {
    "rating": "3.5/5",
    "review": "Great action sequences and beautiful scenery, but very straight forward plot."
  },
  {
    "rating": "1/5",
    "review": "Terrible. Where was the fact checker? Opening scene - pumpkins in the garden. There were no pumpkins in ancient Rome. Sharks in the naval reenactment - pure fantasy. Acting? Wooden. Denzel says \"Hose him off\". They didn't use the term \"hose\" in ancient times. Not even close to the original Gladiator."
  },
  {
    "rating": "2/5",
    "review": "The first Gladiator was excellent. Gladiator is a lazy remake that’s is not. Save your time and watch the first one again…."
  },
  {
    "rating": "0.5/5",
    "review": "Every scene felt rushed, I had no time to feel or take in each scene (no emotional attachment). This could of been a great movie of its own but it has no right to be a \"Gladiator 2\" The night time scene where they're walking outside of the Coliseum and there's a bunch of homeless people laying outside of it as if this was L.A. Rome was clean and upkept, it was the greatest City that ever existed on Earth. Streets made of gold and marble and in this you have dirt streets with homeless laying out front. I can keep going but I won't ... but I will, you had scenes where you show old buildings but at this time Rome was in its peak where there was no broken Stone it just looked very bad it didn't look like ancient Rome this is really a bad movie I'm sorry everything about it they acting the soft male voices the two crazy guys, it just reminded me of a Hollywood party"
  },
  {
    "rating": "0.5/5",
    "review": "A rare Ridley Scott fail - from turning the Coliseum into a giant aquarium, replete with sharks, to a protagonist that looks like a gust of wind would blow him right out of the arena. And not a strong gust at that. The plot is virtually the same as Gladiator I. But this one adds buckets of absurdity and tedium into the mix. My advice - save your money and your time."
  },
  {
    "rating": "2/5",
    "review": "The character development in Gladiator 2 feels shallow, making it hard to connect with or care about the characters. The visuals and CGI also leave much to be desired, lacking the gritty, immersive quality from the first film. To make matters worse, some scenes suffer from poor acting, which takes away from the experience. If you’ve never seen the original, you might find some enjoyment here and Denzel does a good job as always. However, for fans of the first film, this one falls flat. A real disappointment."
  },
  {
    "rating": "0.5/5",
    "review": "The worst of R.S. As a copy from original 1 and nothing to say on this one, worst writing ✍️"
  },
  {
    "rating": "0.5/5",
    "review": "If the first gladiator did not care about history this one hates it, without having an original plot, nor the qualities of a colossal. The hate for rome here blossoms. Can't stand this. They even got the dude from the 300 to seal the cloaca maxima that this movie is. And we allowed them to navigate through it. Shame. Lead actor does not work as well. History and roman history have so much more interesting actual events than this. You could pick or represent actual events 100000x times better than this. Uh and to bank on the first movie you will literally have a 4 min slideshow of it at the start of the movie"
  },
  {
    "rating": "4/5",
    "review": "Screw what others say. Gladiator II is an epic masterpiece that captivates from start to finish! Stunning visuals, powerful performances, and a gripping storyline make it a worthy sequel. It brilliantly honors the original while carving its own path. 8 out of 10 🤙 from this guy."
  },
  {
    "rating": "1/5",
    "review": "Absolutely stunk! My favorite movie is Gladiator! This was horrendous! Bad acting! Fighting scene as elaborate was not felt! Denzel’s character came across as a gangster from NY city not Rome!"
  },
  {
    "rating": "0.5/5",
    "review": "Sacrilege. Disgrace."
  },
  {
    "rating": "2.5/5",
    "review": "The bad CGI was really distracting from the good actors"
  },
  {
    "rating": "1.5/5",
    "review": "What a disservice to the original. It's like Michael Bay and Uwe Boll teamed up to produce this movie."
  },
  {
    "rating": "0.5/5",
    "review": "What’s a piece of junk. I can’t believe this movie receive such a high rating. Sharks in the coliseum? Really? This movie, even though it is exactly the same story as the first one, cannot hold a candle to it. Gladiator - super good, Gladiator 2 - not good."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is awful. This is an offense to history, the first Gladiator and anything resembling a good movie. Seriously, do not watch. Sharks in the Colosium. I'm not not joking...f word sharks in the f word Roman Colosium...go do or watch anything else..."
  },
  {
    "rating": "5/5",
    "review": "It was an intense movie"
  },
  {
    "rating": "3.5/5",
    "review": "The movie starts really, really slow and feels like a carbon copy of the original movie. However, the characters are presented in a way that makes sense to the story, and the story makes sense as a progression from the first. There was only one thing presented that felt like fan service, but I won't mention it here. By the end, I was slightly entertained."
  },
  {
    "rating": "4/5",
    "review": "Not as good as Gladiator, as a stand alone it was very entertaining. Enjoyed it very much."
  },
  {
    "rating": "4/5",
    "review": "I understand where some people say this movie lacked, but man what a continuation. Amplified applause!"
  }
]