[
  {
    "rating": "3/5",
    "review": "A Working Man (2025) Deserved a Better Edition Since It Is Overlong (11,698 –17 May 2025 – by Claudio Carvalho) In Chicago, the former British military Levon Cade (Jason Statham) works at a construction company as foreman. He has a daughter, Merry Cade (Isla Gie), that is under the custody of his father-in-law Dr. Jordan Roth (Richard Heap), who hates him since Levon’s wife committed suicide. He considers the owner of the construction company, Joe Garcia (Michael Peña), his wife Carla (Noemi Gonzalez) and their daughter Jenny (Arianna Rivas) as his family. When Jenny completes the first semester of her university, she celebrates with her friends in a bar. Out of the blue, the Russian traffickers Viper (Emmett J Scanlan) and Artemis (Eve Mauro) kidnaps her. The police do not find any clue to Jenny and Joe and Carla offer US$ 70,000.00 to Levon to find Jenny, but he refuses. He visits his blind friend Gunny Lefferty (David Harbour), who lives with his wife in the woods, and he says that Levon should help Joe’s family. Now Levon goes to the bar where Jenny was to look for evidence. Then he follows the bartender Johnny (David Witts) to his home to learn what happened to Jenny, and soon he learns that the Russian mafia is involved, in the beginning of the dangerous journey of Levon to rescue Jenny. “A Working Man” (2025) is an action movie by David Ayer with Jason Statham, presently the best actor of action films. The plot is unoriginal, with the “hero” helping his friends to retrieve their daughter that was abducted by Russian mobsters but is also too long with almost 2 hours running time (1 h 56 min to be more precise). Consequently, there are a great number of gangsters with Russian names difficult to recall sometimes who is who. One question, why after rescuing Jenny, Levon leaves the powerful weapon provided by Gunny on the pool table to be burnt? My vote is six. Title (Brazil): “Resgate Implacável” (“Rentless Rescue”) My Blog: https://maniacosporfilme.wordpress.com/"
  },
  {
    "rating": "1/5",
    "review": "Arguably one of the worst films I’ve ever seen and that’s from someone who’s watched most Van Damme and Seagal movies. With a script that seems culled from the worst of the straight to vhs movies, 90s cliched bad guys and B movie cinematography: nothing works. Absolute stinker, no one involved should work again ( possible exemption for Arianna Rivas). Avoid."
  },
  {
    "rating": "3/5",
    "review": "Another Jason Statham movie with good action scenes but really poor plot writing. The main bad guys have a mix of \"oO tell me more\" with some really cheesy poorly named people. The plot needed to be more gritty, but like the last few its almost as if they are trying to lighten the situation outside of the action scenes, not in what they are saying just in the style they are portrayed."
  },
  {
    "rating": "1/5",
    "review": "Love Jason but the writing was so bad!"
  },
  {
    "rating": "3/5",
    "review": "O filme NÃO ruim de Jason Statham, porém.. SEM NENHUMA PERSONALIDADE. Ação bem boa e competente. Porém junto disso vem um mar gigantesco de coisas genéricas e caricaturas, previsibilidades e mais alguns pontos fracos. Dito isso, longe de ser ruim. Eu me diverti e acabei gostando, porém é inegável todos seus pontos fracos. É mais um bom e divertido filme de ação de Jason Statham."
  },
  {
    "rating": "5/5",
    "review": "The Movie was very good!"
  },
  {
    "rating": "1/5",
    "review": "Just horrible! The script was garbage. The acting even worse and the action, if you want to call it that, was minimal and laughable. I hope Stathem was paid well for this nightmare."
  },
  {
    "rating": "5/5",
    "review": "i really love it i really like it"
  },
  {
    "rating": "5/5",
    "review": "Absolut cinema, with all the action you want, with a deep longing for salvation. Would definetly watch again!!!"
  },
  {
    "rating": "4/5",
    "review": "Just a oldschool Jason Statham movie nothing you havent seen before but entertaining."
  },
  {
    "rating": "4/5",
    "review": "Like always… starting to get boringggggg!"
  },
  {
    "rating": "2.5/5",
    "review": "Not a clear idea of who the baddie was Jason action was lacking vigar"
  },
  {
    "rating": "3.5/5",
    "review": "Not terrible, not great. Nicely shot. The writing isn’t insufferable either, which was kinda surprising given how generic the plot is. There are worse ways to while away an evening."
  },
  {
    "rating": "2/5",
    "review": "John Wick and Equalizer this is not, Stallone style Expendable exaggeration expenditure it’s more like… Statham needs a paycheck, sure, he works for it !! But aside from the usual overblown cliches… it’s all the same . Beekeeper had a bit more heart in simplicity and effectiveness. This is an overblown dud for cokeheads."
  },
  {
    "rating": "2/5",
    "review": "The script is really weak. The bad guys cartoonish. You've seen this so many times before. Statham is going on autopilot here unfortunately."
  },
  {
    "rating": "1/5",
    "review": "Utterly rubbish. Trying to mix, equaliser, taken, etc etc. Jason tries but the writing is appauling. Errors everywhere. Fake Russians. I could go on, and on and on....."
  },
  {
    "rating": "1/5",
    "review": "This is the worst film with jason straytham in. I Usually love his movies. 😳"
  },
  {
    "rating": "5/5",
    "review": "I've always been a Jason Statham movie follower.This movie for was brilliant,I thoroughly enjoyed every moment of it.I give it a 10 out of 10,a definite rollercoaster of a ride movie,well worth the wait."
  },
  {
    "rating": "3/5",
    "review": "The script was 100% written by AI which was instructed to include every cliche imaginable. Still, no one expects a Statham movie to have Tarantino dialogue. So for what it is, it’s what you expect. Not bad."
  },
  {
    "rating": "0.5/5",
    "review": "Cretinous action by numbers statham vehicle. Was on prime so I let it play to give it a chance. Lots of shooting and etc etc. Couldn't get interested enough to stop looking for a new bike on ebay. Fast forward to the end eventually. Who are these films made for? Do their spinal cords reach their brains?"
  },
  {
    "rating": "5/5",
    "review": "Too the almighty \"critics\" that bash this movie with their holier-than-though opinions...well you know where to stuff it. This movie is Jason Statham. And it was better than his last couple movies by far. Straight up, good ol' killing action. Don't listen to the negative reviews, whatch it!"
  },
  {
    "rating": "5/5",
    "review": "Finally something really good in Streaming amazing as always please we need more of it🥺💕🤯"
  },
  {
    "rating": "4/5",
    "review": "Like John Wick, but with construction tools. It’s a popcorn-movie, killing fest. Entertaining, without being overly “preachy”. Not for children. Violent fantasy, crime , action film."
  },
  {
    "rating": "1/5",
    "review": "If you took a generic Statham action flick and turned it into an Xmas pantomime you would get 'A working man'; It's laugh out loud bad. I really believe some of the cast (and definitely the wardrobe staff) knew how bad it was and decided to ham it up like it was the 24th of December and they were in panto on a London stage."
  },
  {
    "rating": "2/5",
    "review": "Run of the mill Statham movie..Should of been great tho considering who directed it and with the quality of acting talent alongside being produced by 'Sly'. Action scenes r wot u expect,storyline sorta works,dialogue doesn't really flow..just kinda misses the mark..Disappointingly average."
  },
  {
    "rating": "2.5/5",
    "review": "Typical Statham film, a bit pants, but lots of action; no need to think much. It's basically Taken, with someone elses daughter. Still better than Disney's snow white, but that's low hanging fruit. Just rewatch the transporter films, they're all better."
  },
  {
    "rating": "3.5/5",
    "review": "Jason Statham reunites with director David Ayer in *A Working Man*, a gritty action-thriller that delivers the expected punches but stumbles in its execution. Statham portrays Levon Cade, a former Royal Marine turned construction worker, who is thrust back into a world of violence when his boss's daughter is kidnapped. The film attempts to blend high-octane action with emotional depth, exploring themes of redemption and fatherhood. While the action sequences are intense and showcase Statham's prowess, the film suffers from a disjointed narrative and underdeveloped characters. Critics have noted that the movie \"falls short due to a disjointed and inconsistent narrative\" , and that it \"lacks urgency and coherence\" . Despite these shortcomings, some viewers may appreciate the film's attempt to delve deeper into its protagonist's psyche. In summary, \"A Working Man\" offers the familiar thrills of a Statham-led action film but doesn't quite rise above its genre conventions."
  },
  {
    "rating": "2/5",
    "review": "This was ok, not as good as I expected. Jason Statham smiled during parts of the movie when he was with the character who played his daughter. That was a bit of a departure and I liked the extra dimension to the character. It seemed like a poor mans John Wick in parts and didn't seem to know what it was aiming for. There were lots of unbelievable parts of the plot and we did a lot of 'That's ridiculous' and 'That would never happen'. Emmet Scanlon, a respected actor in the UK , played a bumbling idiot and his dialogue was B movie. David Harbour was under used and the character added very little to the plot. I usually like Jason Statham movies and the plots are usually good, but not this one. I missed it at the cinema and watched it on streaming. So pleased I hadn't bought a cinema ticket."
  },
  {
    "rating": "1/5",
    "review": "Middle school leggings wearing girl meets a Jason Staham movie and ruins it. Wait for the DVD release and borrow from the library. That way it wont cost you anything to turn it off when it sucks worse than a cringey art film when expecting a pure unapologetic shoot em up movie. Remind me not to watch anything written by Sylvester Stallone anymore. The last Rambo film was half \"children's movie\" too. What the heck is this guy thinking."
  },
  {
    "rating": "5/5",
    "review": "I loved it. The whole Cast performs very good in character, cinematography manages to capture moments and emotions nicely. Lots of action in typical Statham fashion, which is a good thing. Story is okay-ish, but overall, easy to watch and very very entertaining"
  },
  {
    "rating": "3.5/5",
    "review": "I liked the movie, average movie of Statham, lol."
  },
  {
    "rating": "2/5",
    "review": "Decent movie. It has some great action, but I can tell that this film had a lower budget ,and that bothered me a little. It is a decent movie, but it wouldn’t be my first choice if I were asked to put on a recent action movie. I probably wouldn’t rewatch it, but I’m not saying it's not enjoyable; it’s just not my cup of tea, if you will."
  },
  {
    "rating": "3/5",
    "review": "Just watched A Working Man, and it was a bit of a mixed bag. Statham does his thing, tough guy action with ruthless efficiency, and some of the fight scenes are quite inventive, especially when he starts to use tools from the construction site as weapons. But the story? Ultra generic. It's like we've all seen this stuff before: kidnapped daughter, ex-military dad, Russian bad guys, blah blah. The tone kept changing from serious to ridiculous, and the villains were just sort of. present. Even the good supporting cast like Michael Peña and David Harbour didn't get much to do. Not bad if you only want some punch-kick-boom entertainment, but don't expect anything new or memorable. Good fights, forget the rest."
  },
  {
    "rating": "4/5",
    "review": "Love a good bit of statham, just switch your brain off and enjoy the WORKIN' MAAAAAN"
  },
  {
    "rating": "3.5/5",
    "review": "Its Statham playing the same character he always plays, and I gotta say he does it reasonably well. It's not as good as some of his earlier work, but the casting was pretty solid and the action sequences weren't too shaky."
  },
  {
    "rating": "2/5",
    "review": "Poor man's \"Man on Fire\"."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie. Statham's character is similar to those he's played in the past and plays so well. Excellent action sequences, really good story."
  },
  {
    "rating": "2/5",
    "review": "A fan of Jason but this movie is not \"it\"... Poor story telling and too much action"
  },
  {
    "rating": "1.5/5",
    "review": "Yep, it’s another Jason Statham action movie. David Ayer directed the last Jason movie, The Beekeeper (2024), which was a fun time. A Working Man feels mostly the same, with Jason seemingly playing the same hidden badass character—again. It retains all the same problems as before: bad writing, dumb dialogue, forgettable characters, and overly cartoonish villains. David has certainly learned nothing from the previous movie. What makes this one worse, though, is that there are too many characters, too many villains, and the movie is just too long. It does have some fun action set pieces, but that’s really all it has."
  },
  {
    "rating": "1/5",
    "review": "I belive this was an after though movie. Worse movie ever. At times it was out of focus so bad. Watch something else unless very bored."
  },
  {
    "rating": "5/5",
    "review": "The movie was classic Jason Statham, action packed till the end, and the story was great also!"
  },
  {
    "rating": "3/5",
    "review": "Jason Statham’s detour into John Wick’s world. However, it doesn’t feel fresh. It’s like the taco-bell menu, same ingredients just a different shell. It can wait for streaming."
  },
  {
    "rating": "2/5",
    "review": "Watchable and forgettable. I guess just like the life of a working man - another day, another budget copy of recent, better action movies."
  },
  {
    "rating": "3/5",
    "review": "Decent action but no Beekeeper"
  },
  {
    "rating": "2.5/5",
    "review": "I was a HUGE FAN of The Beekeeper for it's B-Tier Cheesey Action & Antics, and Taken is \"One Of My ABSOLUTE FAVORITE Action Movies Of All Times\". Unfortunately, that doesn't guarantee you'll enjoy this film that is essentially those two films roled into one. This film struggles to balance the \"Campy Style\" with \"Serious Action\". The script itself could have used a few more drafts, especially with plot beats that feel like they're going no where and dialogue that is hard to follow at points. Also, Jason Statham's character and the girl he is trying to save both have WAY TOO MUCH PLOT ARMOR!!! At points, it seems like the bullets are swerving around him when he's in a narrow field of sight for the bad guys to shoot him, and if you remember what they said in Taken about the time-table with trafficing women, this girl should already be LONG GONE or DEAD. She's taken on a Friday night, and for some odd reason her family waits until Monday Morning to ask their friend for help, knowing his skill set. At other points, the girl pulls stunts that should be getting her executed on the spot, especially when it's established that the group owns a Clean-Up Crew, but they have to wait till late at night to try and take her far away to put her down, giving Levon Cade plenty of time to save her. Some have stated this might have worked better as a mini-series on TV and I have to agree with them. This movie isn't making me want to head straight back to see it again, and the more I think about it, the more problems I find with it. The action is still cool, and there's some funny moments here and there, but they also constantly set up moments that don't go where they CLEARLY SHOULD GO, Including with Levon's daughter. You can wait to stream this or just skip it all together. C+ & 6.2/10"
  },
  {
    "rating": "4/5",
    "review": "Lots of action, some comedy. Too much swearing."
  },
  {
    "rating": "0.5/5",
    "review": "A mashup of Taken and The Equalizer with an ex military bada$$ who reverts to his skills to track down a girl who was being taken into the sex trafficking industry. Stathom’s action scenes were pretty awesome as usual, but the plot was unoriginal"
  },
  {
    "rating": "4.5/5",
    "review": "Normal Jason Statham movie and worth the watch"
  },
  {
    "rating": "4/5",
    "review": "This is an action pack movie with great storytelling. Recommend this movie."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie, Statham keeps you entertained throughout the whole movie. John Wick meets Taken... must watch."
  },
  {
    "rating": "5/5",
    "review": "A good action flick worth seeing. This movie has real testicular fortitude."
  },
  {
    "rating": "3/5",
    "review": "if you like Jason this is a typical Jason movie but not his best."
  },
  {
    "rating": "3/5",
    "review": "Jason Statham can't go wrong, this time in his version of Taken."
  },
  {
    "rating": "5/5",
    "review": "Super good movie!! It's a must watch"
  },
  {
    "rating": "5/5",
    "review": "Awesome action packed ! Loved It! PS Why do we still have critics?...there day is done, they have lost there spark....Adios go get a real job! lol"
  },
  {
    "rating": "2/5",
    "review": "A Working Man tries to resurrect the old-school action formula with a story of a former soldier drawn back into violence. However, despite its rugged setup, the film struggles with shallow drama, clichéd dialogue, and uninspired execution. Jason Statham does what he always does — stoic, punching his way through a flat script. Despite a few glimpses of potential in its early scenes, the film quickly devolves into repetitive brawls, awkward editing, and soulless cinematography. Director David Ayer’s usually gritty touch feels recycled here, offering no real tension or emotional payoff. It’s a watchable but forgettable action flick, lacking the weight or originality to stand out."
  },
  {
    "rating": "1.5/5",
    "review": "Possibly the worst movie I have seen in the last decade. Do not waste your time."
  },
  {
    "rating": "3.5/5",
    "review": "It was ok - the basic J.S. Type of movie ride - less dialogue and more fighting and guns"
  },
  {
    "rating": "0.5/5",
    "review": "WTH was Stratham thinking when he accepted the bribe to star in this horrible movie. This is not with watching. It wasn’t worth making either."
  },
  {
    "rating": "1.5/5",
    "review": "What did I just watch? Ok firstly the positives. I’ve seen all the Statham movies from transporter 1 to 10. I always loved him. I’m the guy who watched big trouble in little China, escape from New York and From dusk till dawn. I loved these old cult movies. I always rated Statham movies 6 to 8 out of 10. They never John Wicked me and they never achieved cult status, even though he’s actually not that bad an actor (good for an action British actor) and his combat sequences are always top notch. However for this particular movie: The negatives are far too many to mention. However I’ll try, Spoilers: They brought in a 15 year old born in 2010 and said ‘write me a good Statham action movie’ but the script was 5/10. So then they brought in an 8 year old writer born in 2017 and said not contrived and not enough cheese, make it more predictable. Then this 3-4/10 was created. You know the plot and the story from the moment Jason is working as a foreman, site manager after the first 10 minutes. You have seen this movie 10,000 times over and over. It’s Taken, it’s every Hollywood action movie. In fact it’s so cheesy, predictable and contrived you will be rolling your eyes all the way through it. However as previously mentioned the action scenes are pretty good. There fairly brutal - but John Wick and Rambo from the 1980’s and Arnies Predator did it better. In fact I would go as far as to say this movie is cheesier than predator. Let me help you understand … Jason works as a foreman / site manager in construction. He ex special forces except he’s not special he’s an elite - a Royal Marines ex soldier. Royal Marines are not super men, they are human beings. I promise you. I was a real life paratrooper and the paratrooper in this (the coloured dude) hasn’t got a chance against the god that is Jason Statham the man who can take down any human or any super hero or villain in any time scale anywhere any how. He’s stronger than Thor. He’s faster than Spider-Man …. He’s just a man guys 😝 Just because your an ex royal marine (the elite land force of the navy) doesn’t mean you can take down an entire Russian mafia ring, alive for generations. Then they steal the plot from Taken. Stealing from Liam Neesons movie script. Then comes the Rodger rabbit villain or mask villain equipped with gold and black skull cane with glowing red eyes who dresses like a vampire. I’m not 6 I’m 43 (lol / lmfao). Then comes the elite mafia 2 ex con millennials. One female who has tattoos and looks like a marvel villain who just pushes and bullies an 18/22 year old kidnapped kid. Her partner another weak ass millennial with a ‘cool modern haircut’ is a little wuss with a gun who traded his recent star bucks job for a evil ST kidnapper. Jason breathes on them and they explode (lmfao). Then cue the 2 elite elite villains after the coloured ex paratrooper is murdered in 2 mins by Jason. The 2 elite villains … I was peeing my sides at this point. One looks like a crack head with a GPMG (large general purpose machine gun or Russian looking origin) and a shiny Gary glitter coat, whose gun is bigger than he is. The other is uncle festa from the Adams family with an M203 grenade launcher / assault rifle type from a call of duty video game. The guys who wrote / directed this clearly have no clue on actual military background / experience or training. They would have been better coming to me for advice on this (lol) or at least someone with 1 years military experience for tips. Lol I bet even Jason was laughing at the script surely Jason is a human being who knows a tiny ounce about the military. Anyway in short …. It’s unbelievably cliche / contrived / and cheese pie on a stick at the cheesy fair winning cheesy awards. Tell you what …. If your bored have a drink get some mates round and have a good laugh. It’s probably that entertaining. As for me …My GF fell asleep 5 mins in and I was left watching this tripe."
  },
  {
    "rating": "5/5",
    "review": "I like the movie a lot and it was great and amazing to see"
  },
  {
    "rating": "5/5",
    "review": "I know this is a B movie it's good"
  },
  {
    "rating": "5/5",
    "review": "Que es un hombre trabajador y que se tiene que enfrentar a varias cosas para sobrevivir y seguir adelante por qu tiene que trabajar"
  },
  {
    "rating": "2/5",
    "review": "I tried but I just couldn't get into it. The movie is as bland as it's title."
  },
  {
    "rating": "5/5",
    "review": "Jason Statham never ever disappoints. Sorry naysayers, in a world were bad guys are winning, I don’t care how “predictable” you say this movie is, I disagree. It’s not because we live in a world where it’s predictable that evil wins. I enjoyed the fact that there is even the concept of a lone man who, with principles and skill, intelligence and a acumen for kicking ass, can do more with a goal than a bunch of people that just go throughout their day doing nothing extraordinary, nothing miraculous nor anything that helps anybody but their simple basic need to survive. I loved this movie and I loved even more that the girl was not a victim, but constantly fighting and constantly trying to save herself. It’s a movie worth watching and a mantra we all should live by - have something worth fighting for, have integrity worth dying for and be the best at everything you do. Follow me @andrealemusique on all social media."
  },
  {
    "rating": "1/5",
    "review": "A Working Man is the cinematic equivalent of a shrug—uninspired, clumsy, and bafflingly pointless. It's not just that the acting is wooden; it's that it feels like no one involved even read the script past page two. Stallone, wearing both the writer and producer hats, manages to deliver a screenplay so disjointed it makes a late-night infomercial look like The Godfather. The plot lurches from scene to scene with no logic or purpose, stitched together with tired tropes and dialogue that sounds like it was lifted from a parody. Jason Statham, normally a reliable presence in action roles, sleepwalks through the film like he’s counting down the minutes until he can fire his agent. Even the action scenes, which should at least be entertaining, are painfully staged and bizarrely edited—as if someone dared the crew to shoot everything in one take and call it a day. The costumes? Distracting. The tone? All over the place. The end result? A film that confuses volume with intensity and pacing with chaos. This isn’t just a bad movie. It’s a wasted opportunity—and a reminder that even big names can churn out bafflingly bad content when there’s no one brave enough to say, “Maybe we shouldn’t.”"
  },
  {
    "rating": "1.5/5",
    "review": "The names Statham and Stallone is about all it has going for it. I give it a B-. The directing is atrocious. All of the artsy-fartsy camera work destroyed the movie. All of the views totally avoiding the action. Bleary views of a bunch of colorful nothingness instead of showing us the action as it is occurring. Clearly meant to suck us into some mood, versus showing us the action. Looks like if one didn't know Jason's fighting skills, one would not understand what is going on in any given scene."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible, poor direction, sound issues, cinematography sucked , stiry poorly pulled together, most of movie was out of focus. Jason you could do much better. Loved BeeKeepers.. The place for artistic license is not action film. This film sorry ti say SUCKED"
  },
  {
    "rating": "5/5",
    "review": "Great movie Jason never disappoints and the producing team was good."
  },
  {
    "rating": "0.5/5",
    "review": "This is another stathom film. Another rubbish one. The acting is terrible, the storyline is even worse. It's predictable terrible and not thought out. I can't believe films this bad actually make it to production. On the plus side I cut my toenails."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie,lots of action."
  },
  {
    "rating": "5/5",
    "review": "This a very good action movie that will keep you on the edge of your seat."
  },
  {
    "rating": "3/5",
    "review": "I love Jason Statham, but this movie just didn't get off the ground for me. It was so unbelievably far-fetched, and a lot of the acting reminded me of a bad Siegal film. I would recommend watching it on tv, not spending money on it."
  },
  {
    "rating": "5/5",
    "review": "A great film with Jason Satham as always. There are many movies where someone (girl etc.) needs saving but 'A Working Man' still delivers exceptionally."
  },
  {
    "rating": "3.5/5",
    "review": "The action sequences were fast paced and fit the story."
  },
  {
    "rating": "3.5/5",
    "review": "I love actions movies"
  },
  {
    "rating": "4.5/5",
    "review": "An awesome throwback to 80s and 90s action films! They don't make em like they used to anymore!"
  },
  {
    "rating": "3/5",
    "review": "I like seeing Jason Statham but from all his movies this may be lesser one."
  },
  {
    "rating": "1.5/5",
    "review": "Jason Statham is beginning to become the new Bruce Willis. I've always liked most of his stuff, but lately, it seems like he will do any garbage they put in front of him. A Working Man is just that, garbage that is almost unwatchable."
  },
  {
    "rating": "2.5/5",
    "review": "“A Working Man” is yet another movie about the same ole guy who you wouldn’t expect to be good at fighting is suddenly good at fighting trope and to make matters worse, the protagonist is played by the most fitting, immersion breaking actor, Jason Statham. The story has no ambition and the plot is nothing more than mediocre at best as it abandons the expectations it sets for the audience by becoming more about forcing its way to a solution rather than earning it even after the opening scenes show much promise to what viewers might see. Clearly this genre of action is getting noticeably tiresome in just a span of 5-10 years."
  },
  {
    "rating": "1.5/5",
    "review": "Oh dear. Terrible script, terrible direction, terrible acting. Desperately trying to be better than it is. Statham is just going through the motions, he is probably thinking about rewatching Lock Stock when he gets back home."
  },
  {
    "rating": "1/5",
    "review": "A cringe generator crime movie with fake gigantic moon backdrop."
  },
  {
    "rating": "3.5/5",
    "review": "Bones crushing, bullets flying, heads rolling 'A WORKING MAN' is proof that Jason Statham and David Ayer should keep it going. Ngl though, it felt unnecessarily long for a movie that should have gotten it over with fast. Nonetheless, 'A WORKING MAN' brings back the charming Jason Statham in all his masculinity and splendor delivering yet again, another action flick but at the expense of humor this time! This movie also limited the action with too much dialogues that should have been cut short, but Jason Statham's power house performance combined with David Ayer's impressive direction saved this movie from collapsing! It's worth the watch."
  },
  {
    "rating": "3.5/5",
    "review": "It was good.. I don't go to the movies ever..I like the main Character Jasen Statum...lots of shooting"
  },
  {
    "rating": "0.5/5",
    "review": "This movie ruined my weekend"
  },
  {
    "rating": "2/5",
    "review": "The writing and acting are some of the worst I've seen in recent memory and easily Jason Statham's worst movie imo. The action is what you expect from all his movies but the script was like it was written by a child."
  },
  {
    "rating": "3/5",
    "review": "A classic predictable Jason Statham movie, same old ex-military plot; nothing more, nothing less. However it was longer and more complicated than I anticipated."
  },
  {
    "rating": "5/5",
    "review": "Definitely not one for the critics. Fully understand that. This is our man JS doing what he does best. For those seeking an entertaining film with characters you can both get behind and join JS in pumping the baddies with lead, glass, hammers...whatever is lying around...this is for you. Personally, having recently watched the blunderbuss that is G20, its a relief that there is something out there that captures the genre perfectly. And! It's set up for a sequel. In many ways, its a little John Wicks."
  },
  {
    "rating": "2.5/5",
    "review": "Laughably formulaic, i.e. predictable and shallow. Can't recommend it unless you truly have nothing better to do."
  },
  {
    "rating": "3/5",
    "review": "Decent Action, Nothing special story, decent victim- actually felt like she was fighting for her life."
  },
  {
    "rating": "5/5",
    "review": "fantastic film, just as good as The Beekeeper."
  },
  {
    "rating": "1/5",
    "review": "How many more times is it going to be necessary to do another white guy saves the world movie? This was not at all worth the time it took to watch it."
  },
  {
    "rating": "5/5",
    "review": "A lot of action. Good flick."
  },
  {
    "rating": "3/5",
    "review": "Your average action flick. Not as good as beekeeper. Written by Stallone apparently and there’s a lot of similarities to last blood but overall it’s a good popcorn movie"
  },
  {
    "rating": "4/5",
    "review": "Fun movie. Typical Statham."
  },
  {
    "rating": "2/5",
    "review": "Would be a good Jason movie, but the filming was awful. I don't want to see the ceiling or a brick wall. I want to see the characters acting. Half way thru, I couldn't take it anymore. Stop watching and watched a different movie."
  },
  {
    "rating": "3/5",
    "review": "I got exactly what I was looking for, at this point it is easytoprdicr that. Nothing more nothing less."
  },
  {
    "rating": "5/5",
    "review": "Excellent non stop action. Better than what I expected. If you like the equalizer with Denzel and John wick trilogy then you would love this movie"
  },
  {
    "rating": "1.5/5",
    "review": "Loud, boring, and terrible. Filled with unoriginal gunfights, it's just one mindless action sequence after another. Thumbs way down."
  },
  {
    "rating": "4/5",
    "review": "good movie. Alot better than the Bee Keeper."
  },
  {
    "rating": "2/5",
    "review": "Stratham's plots are starting to wear thin and predictable and although I like action movies in this trope I got bored half-way and turned it off. It needed a lot more depth like \"The Beekeeper\"."
  },
  {
    "rating": "5/5",
    "review": "Jason Statham knows how to deliver! Good story, great pacing, interesting to the credits."
  },
  {
    "rating": "4.5/5",
    "review": "Very good movie. Jason Statham took people on and beat them all. We'll written."
  },
  {
    "rating": "1/5",
    "review": "I quite like Jason Statham and you know what to expect but this film is just a lazy money spinner, got through about an hour of it and switched off ... Don't bother .."
  },
  {
    "rating": "3/5",
    "review": "Best part: Jason Statham. Worst part: the plot, been there, done that."
  },
  {
    "rating": "3/5",
    "review": "Jason Statham showed off his fighting skills as per usual. The acting and storyline left a bit to be desired, IMO. It wasn't awful. I just expected more."
  },
  {
    "rating": "0.5/5",
    "review": "It's been a long time since I've seen such a horrible film. This has the feel of once great action star turned to terrible films to pay the bills. Stallone has absolutely no business writing a screenplay and I know to avoid anything his name is attached to in that regard now. As far as the film, horrible sums it up. Cheesy dialog, over played bad guy types and one of the worst plots I've seen. Trash acting through out the whole thing. Watch it free but avoid wasting your time even then. This is easily a movie worth passing on."
  },
  {
    "rating": "1/5",
    "review": "Acting was terrible and the plot was stereotypical."
  },
  {
    "rating": "4.5/5",
    "review": "A great action thriller with a plot that's also emotionally engaging. Of course it requires suspension of disbelief here and there, but isn't this why we go to the movies? Overall a very engaging rollercoaster ride. Loved it."
  },
  {
    "rating": "5/5",
    "review": "Action packed !! I just want to know when the part 2 will be released. I loved the movie. Definitely will watch again."
  },
  {
    "rating": "3/5",
    "review": "Definitely the worst Jason Statham film I've seen so far. I can see why Liam Neeson was originally considered for the role — it's like Taken, but with cheesy lines and comedic elements (intentional or not) 🧐✌️"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie. See it"
  },
  {
    "rating": "5/5",
    "review": "It was so intense. I was on the edge of my seat the whole time. Jason showed up and showed out. The storyline was consistent and exciting."
  },
  {
    "rating": "2/5",
    "review": "So I will be short , beekeper is mutch better, this movie not so good ... 😒"
  },
  {
    "rating": "4/5",
    "review": "No one left the theater for bathroom or popcorn breaks."
  },
  {
    "rating": "2.5/5",
    "review": "This is a Jason Statham movie. That could be the entire review really…He plays the same character in every movie. A normal guy with a special ops type past that sets off on a one man mission to save someone. He does so single handedly and somehow almost like a super hero. Several actors do similar characters in all movies, but I have never seen someone play the same character in virtually the same movie so many times. Even Liam Neeson occasionally gives us some variety. This would really be a 3 star movie on its own, but they cannot just keep making the same movie over and over and expect people to love it."
  },
  {
    "rating": "2.5/5",
    "review": "Although Staham gives a convincing performance, Ayer's poor direction and some bad shots (incongruous and frustrating) combined with some poor acting make it a one-time only film."
  },
  {
    "rating": "4/5",
    "review": "good guy wins, girl makes it home, little girl gets her Dad"
  },
  {
    "rating": "3.5/5",
    "review": "We liked it. Fast-paced and exciting with a good ending"
  },
  {
    "rating": "1.5/5",
    "review": "Human traffickers beware. A Working Man is a 2025 American action thriller film directed by David Ayer 🔫 Can’t recommend it. Oof, this isn’t good 🙁Probably give it a miss 👎🏼 Levon Cade left behind a decorated military career in the black ops to live a simple life working construction. But when his boss's daughter, who is like family to him, is taken by human traffickers, his search to bring her home uncovers a world of corruption far greater than he ever could have imagined."
  },
  {
    "rating": "4.5/5",
    "review": "Excellent movie. Acting was great and story was compelling. Worth your money."
  },
  {
    "rating": "5/5",
    "review": "This movie was fast paced thrilling movie. Jason Statham is the absolute best!"
  },
  {
    "rating": "4/5",
    "review": "It was interesting, however I took away 1 star because there was some shooting scenes that were just \"too\" Hollywood...."
  },
  {
    "rating": "5/5",
    "review": "It's Jason Statham, what's not to like!"
  },
  {
    "rating": "4/5",
    "review": "Very standard issue Statham. But that alone gets 3 stars! Cons: the Russian mafia was a little cliche and some of the action scenes were filmed in such a way to give motion but we just lost detail on the incredible stunts. Pros: the integration of topical subjects like human trafficking and the fierce actress that played the \"victim\". A solid afternoon movie with a bucket of popcorn."
  },
  {
    "rating": "2/5",
    "review": "There were only a few action sequences in the film, and the final battle was the only great one. Not a lot of shaky-cam, which is a plus. It’s filmed well, I’ll give it that, but it’s kind of a bore. What kind of job will Jason Statham have in the future? Ice Cream Truck Driver? We will have to see."
  },
  {
    "rating": "1.5/5",
    "review": "A low point for all involved. What were they thinking? My nine year old daughter can script a better, more intelligent movie. I like action movies but this was awful. Cannot recommend."
  },
  {
    "rating": "5/5",
    "review": "True Jason Stathom ... action from start to finish! Did not disappoint!"
  },
  {
    "rating": "1/5",
    "review": "An attempt was made. If you love Jason Statham, then this is right up your alley. This is his attempt at Taken, but instead he just kinda lucks into finding the girl that someone isn't dead already."
  },
  {
    "rating": "2.5/5",
    "review": "I love Statham movies! I don't expect much, but this was just dumb. Didn't even finish it. It features every Statham trope... The expert who doesn't do that anymore. He's retired, his violent ways are behind him.. But these guys have gone too far, and he's pissed! If you love mindless Statham movies, there are tons of great ones. This isn't it. After this I realize they should just number them. Each year, you get Statham #28, next year is Statham #29. In closing, Bee Keeper was good, and Ruse de Guerre is great! Watch those."
  },
  {
    "rating": "5/5",
    "review": "Great story and all the action you can stand. Jason Statham is awesome."
  },
  {
    "rating": "2.5/5",
    "review": "I don't understand who watches these movies anymore to give such high audience score, i'm not saying the movie was bad but it was not even close to 5 stars as i've seen around here. Action itself was decent 3.5 or 4 out of 5, with a few exaggerated parts, but that’s to be expected. Storyline was at best 2 out of 5, let’s face it, it wasn’t really there. As for dialog, that was horrendous, just a bunch of jibber jabber most of the time. Yes it’s a movie with Statham, yes I like Statham, but this is one of his greatest misses, and it was so long I actually got bored watching it. Wrath of man had far better plot, it stayed in the grey really well, and at least that was a revenge story for his son, this was a rescue mission for an acquaintance, just to do it, and at the same time put his real family in danger, and for some reason, the Russians had information that he had a daughter but never went for her to the school."
  },
  {
    "rating": "1.5/5",
    "review": "Shoot, shoot, shoot, stab, stab, stab, kill, kill, kill ..... Add a stock plot and stupid comic book Russian villains and you know what you're in for. If you're not bored of that stuff yet, feel free to waste a couple of hours. Otherwise give it a hard pass."
  },
  {
    "rating": "5/5",
    "review": "Love the movie the actor is great. Jason is great"
  },
  {
    "rating": "3/5",
    "review": "A working Man is exactly the kind of movie made for Jason Statham. It’s action-packed, filled with violence, and centers around a man willing to go above and beyond to save his loved ones. Sure, it’s predictable and cliche, but if Statham has proven anything, it’s that he’s the only action star of his generation who can still fill a theater with an audience eager to see him on screen."
  },
  {
    "rating": "4/5",
    "review": "I like the action, but overall storyline is pretty predictable."
  },
  {
    "rating": "4.5/5",
    "review": "A solid Jason Statham movie. Good production, great bad guys, lotsa guns, explosions and more. If it does well there is room for a sequel where one can expect hell of a lot more. Nice to see Stallone still producing & writing screenplays."
  },
  {
    "rating": "2.5/5",
    "review": "The critics have this right. Doesn't make a bit of sense so if you enjoy an invincible man killing everyone then you'll enjoy this."
  },
  {
    "rating": "4/5",
    "review": "Um Filme de ação que cumpre o seu papel com uma trama interesante para o público que aprecia o gênero, mas sinto que falta um pouco de personalidade para o filme, mas em geral em filme divertido de se assistir que chama a sua atenção."
  },
  {
    "rating": "4/5",
    "review": "It’s Taken 2024 and mostly for the better."
  },
  {
    "rating": "1.5/5",
    "review": "Blah blah blah, same stuff, just recycled from every other movie that's just like this one, nothing new."
  },
  {
    "rating": "5/5",
    "review": "very good and entertaining 👏 as always with Statham"
  },
  {
    "rating": "4/5",
    "review": "Jason kills more people than Friday the 13th Jason and I'm here for it. Don't mess with the ppl that Jason loves bruh...his movies keep delivering"
  },
  {
    "rating": "3.5/5",
    "review": "Statham is the man! Not one of his best but worth a watch!"
  },
  {
    "rating": "5/5",
    "review": "You ever mess with anybody that Jason loves, he will find you and get you."
  },
  {
    "rating": "4/5",
    "review": "It was a decent movie with a good storyline. Really great action scenes"
  },
  {
    "rating": "5/5",
    "review": "I really enjoy this movie, the story, the action & life justice. Excellent actor Jason Stantton is one the best. It was my type of movie."
  },
  {
    "rating": "4.5/5",
    "review": "This is exactly what you are looking for in a Statham movie. Great action, a bit of humor, and Jason Statham. Fun, fighting, and fantastic. Critics just do not know what those three things are anymore."
  },
  {
    "rating": "5/5",
    "review": "Great movie loved the action great plot and keeps you on the edge of your seat"
  },
  {
    "rating": "5/5",
    "review": "This is a good Jason Statham movie."
  },
  {
    "rating": "3.5/5",
    "review": "It's a very good movie. I wouldn't of put michael pena as the father of the abducted girl. He wasn't credible in her abduction. and also abductee Ariana Rivas, wasn't credible either as being abducted. Over all Jason Statham did a very good job. The two hired bad guys could have been more credible menacing bad guys as well, overall, had these mentioned actors been better credible actors this film could have been a 5 stars!!!!!! I liked it alot"
  },
  {
    "rating": "1.5/5",
    "review": "Embarrassingly bad script that grabs every typical scene from the hostage hunting genre. Not so much relax and enjoy but have a lobotomy and endure."
  },
  {
    "rating": "5/5",
    "review": "Loved this movie! Full of action and thought provoking"
  },
  {
    "rating": "5/5",
    "review": "Action packed. Diverse actors."
  },
  {
    "rating": "1.5/5",
    "review": "Dull, predictable snoozefest. There's no stand out action to redeem it either."
  },
  {
    "rating": "5/5",
    "review": "Movie was great so much action. Love the character I love how it's very serious and they understand why we cared about these type of movie we need movies more like this I mean its incredible"
  },
  {
    "rating": "4/5",
    "review": "Great movie! Not as good as the Beekeeper but am really good!"
  },
  {
    "rating": "3/5",
    "review": "This movie should have just been straight to TV movie. Or in today's world, straight to streaming. It wasn't awful but it was just average and a typical Jason Statham movie. This is a movie you watch once and move on."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is garbage! The writing is lazy the story is ridiculous and a lot of the scenes are nonsensical and poorly shot. The dialog is so bad i can't wrap my head around it. Statham is Statham but for the rest of the cast Jesus wtf!"
  },
  {
    "rating": "3/5",
    "review": "Easy watching but not the best"
  },
  {
    "rating": "2.5/5",
    "review": "Lacking in heart or charm Adequate action scenes but villains lack flavour The Beekeeper was vastly superior"
  },
  {
    "rating": "3/5",
    "review": "A decent action thriller, with its own dramatic strength and more than interesting characters. It lacks a bit of flair in its execution of the action, but that doesn't prevent it from being an entertaining film to watch and enjoy quietly in front of the screen."
  },
  {
    "rating": "3/5",
    "review": "Todas las películas donde actúa Jason Statham parecen una saga, intérpreta casi siempre al mismo tipo pero aun así son muy entretenidas y esta no es la excepción. Llena de acción y una historia buena es más que suficiente para tener un momento tenso y entretenido."
  },
  {
    "rating": "5/5",
    "review": "It's a Jason Statham movie, and for that I'm biased"
  },
  {
    "rating": "1/5",
    "review": "No idea how this film has 87% (at the moment) for audience! The Beekeeper was great but this was awful! The acting was utterly terrible, the characters were laughable, the script was appalling. Honestly don't waste your time, wish I hadn't!"
  },
  {
    "rating": "1.5/5",
    "review": "I'm a fan of Jason Statham but this movie screams low budget for higher profits,very disappointing"
  },
  {
    "rating": "3/5",
    "review": "A fun action film that is a nod to old school action movies from the 90's. They are not the most complex films with amazing acting or anything amazing like that - but these films are fun and entertaining none the less! We need the odd film or two every year like this that is mindless fun entertainment and who better to provide it than the great action star Jason Statham? If you wanna see him whoop ass for almost 2 hours - definitely a must see!"
  },
  {
    "rating": "1/5",
    "review": "Seems like they were going for a John Wick vibe, but this was bad. Very bad. Like I wasn't expecting a masterpiece by any means from another boilerplate Jason Statham action movie, but this was so bad. And I say this as someone who loves a good predictable action movie. I enjoyed the Beekeeper for example. That was a lot better than this. Just the acting, the pacing, tonal consistency, etc, the stuff that makes a movie good, was not present in this for whatever reason. So much of the dialogue in this movie was so incredibly wooden. This movie felt almost like if you asked AI to make a generic Jason Statham action movie. Looks like they were attempting to set up a potential sequel near the end. Please don't. This was awful."
  },
  {
    "rating": "1.5/5",
    "review": "Corny actors, there are some good moments but overall it’s predictable The Russians never looked intimidating at all Clothes are shocking despite them being mafias The mafia boss looked like a robot with no charisma no menacing look to him When the mother realised her daughter is missing bad acting no emotion no tears even the fathers acting was shocking. Jason was the only thing good about the movie the rest was predictable and boring The atmosphere was like a Fortnite game to colourful, should of kept it dark and mysterious instead of flashy lights flashy clothes FOR the next movie A WORKING MAN 2 Put more brutal scenes make the scenes more intense and suspensful and get better actors"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie, great action,Jason Statham is a badass."
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies I’ve ever seen. No story, terrible acting and ridiculous dialogue. I want my 2hrs and $19 back."
  },
  {
    "rating": "5/5",
    "review": "it was a great movie. it is a need to see . alot of action ."
  },
  {
    "rating": "5/5",
    "review": "Love best action movie ever"
  },
  {
    "rating": "4/5",
    "review": "Really enjoyed it - its entertainment with some plot - not Academy Award material but will keep you watching."
  },
  {
    "rating": "3/5",
    "review": "Aside from being overlong and having not particularly strong villains, it's exactly what you expect. If what you expect is what you want, you're good."
  },
  {
    "rating": "4/5",
    "review": "Good action. Lots of shooting. it was fun. Bad accents however"
  },
  {
    "rating": "5/5",
    "review": "I loved all the action of Jason Stathams charector fighting and shooting and using grenades and trying to find his friends daughter. The story was really good."
  },
  {
    "rating": "5/5",
    "review": "Action packed movie, very good..definitely recommend"
  },
  {
    "rating": "5/5",
    "review": "Jason Statham never disappoints!! Great action!"
  },
  {
    "rating": "3.5/5",
    "review": "Usual action from Jason Statham who is now a bit over the hill to play this part. I'm not really a fan of action movies but my husband is. It was interesting as it contained a kidnap & who doesn't like a good kidnap movie. It is worth a watch I guess but wouldn't pay to see it in the cinema."
  },
  {
    "rating": "3/5",
    "review": "too much cussing and story kinda dumb."
  },
  {
    "rating": "2/5",
    "review": "The plot and dialogue feel like they have been constructed by a Long Language Model that has only been given data from the YouTube comments sections of rock-rap music videos from the early 2000s."
  },
  {
    "rating": "5/5",
    "review": "This movie was very convincing"
  },
  {
    "rating": "0.5/5",
    "review": "Even the opening credits of the film looked very cheap and made me fear that the film itself would be bad. But the film exceeded expectations – it’s not bad, it’s awful! A collection of primitive clichés. At the moment when the main character appears in full height in the doorway and slowly, one by one, kills two villains with a shotgun, while they are shooting at him with automatic rifles from three meters away and miss, I realized that the filmmakers consider me (the viewer) an idiot and turned it off. Disgusting."
  },
  {
    "rating": "2.5/5",
    "review": "Poorly written and literally stupid in parts (the Russians look like Blade rejects and that giant moon 😂) this is the worst Stath flick I've seen in a while. Go watch Wrath Of Man or Safe again instead."
  },
  {
    "rating": "4/5",
    "review": "It was action packed!"
  },
  {
    "rating": "5/5",
    "review": "Much better than expected. Combination of Taken with John Wick. Surely better than Snow White and looking forward to a sequel!"
  },
  {
    "rating": "5/5",
    "review": "Loved it. Great story and action packed."
  },
  {
    "rating": "5/5",
    "review": "Great Jason Statham action movie!!"
  },
  {
    "rating": "5/5",
    "review": "Best Action movie since Beekeeper. Excellent writing by Sly Stone - Major Dont miss this on the Big Screen!"
  },
  {
    "rating": "1.5/5",
    "review": "Watching this movie was a waste of time the storyline is awful and a lot of things were rushed in this movie. The story line is very flat honestly probably one of Jason's worst movies ever"
  },
  {
    "rating": "5/5",
    "review": "Great Statham movie. predictable, but really good."
  },
  {
    "rating": "2.5/5",
    "review": "Rehash of similar movies."
  },
  {
    "rating": "5/5",
    "review": "I recommend This Film, for Not being filmed in camcorder mode!"
  },
  {
    "rating": "3/5",
    "review": "Has everything you go to a Jason Statham movie for, great action and fun, however it lacks in character development and I felt the story was rushed"
  },
  {
    "rating": "4/5",
    "review": "This straightforward film achieves a satisfactory balance of action and modest production, narrowly distinguishing itself from typical low-budget movies. Jason Statham's dependable thorough action skills are once again on display."
  },
  {
    "rating": "5/5",
    "review": "Great movie… love the action"
  },
  {
    "rating": "5/5",
    "review": "Definitely a predictable storyline but still a very good entertaining action movie."
  },
  {
    "rating": "2/5",
    "review": "Ahhh yes. The newest Jason Statham film in which he plays a former soldier/spy who tries to live a quiet life and escape his violent past; but gets drawn back in after somebody kills or kidnaps his loved one. Ladies and gentlemen this is A Working Man to a tee. Last year he was a Beekeeper, this year he’s a construction worker. In all seriousness, A Working Man is an ok film. It isn’t terrible like some folks are saying, there are bright spots in the film. But it does suffer from lackluster filmmaking that makes it very forgettable. It’s almost a perfect mixture that makes the film ok, kind of like mixing the weird drink combinations. You think it will taste bad, but it actually doesn’t taste that bad but you wouldn’t have it again. Starting with the performances, they were ok. The cast knew the roles they were given and just played their roles. Jason Statham does an ok job. He knows the assignment and what type of character to play so it worked for him in A Working Man. What also worked for the film was the action. The action in the film was fun. It was able to keep the viewers attention from when an action sequence began to when it ended. I will say out of all the recent Statham action films, this one I felt had the least amount. But it made up for it when the scenes came up. The last two aspects of the film to talk about in a combined manner is both the writing and runtime. The writing in the film is its biggest hindrance. It feels very first draft and you can tell because it hits every beat we see in any other action film. From the beginning of the film all the way to the end, you will guess almost everything that is going to happen. Which is fine, because you’re not going into this expecting Oscar worthy writing. But on the other hand, the writing could’ve been tightened up because there is no way this film should clock in at 1hr and 56 minutes! It is crazy to me that this is almost a two hour film. But on the other hand, not really because it felt like it was almost 2 hours and was dragging along in the middle and towards the end. 25-30 minutes could’ve been cut to have it by about 90 minutes. Overall, A Working Man is a serviceable action film. I wouldn’t say not to watch it, but I feel it’ll be a watch when it hits streaming later in the spring than in theaters. But if there is one thing to take away from its release, it beat Snow White in its opening weekend. That’ll be the description on the Blu-Ray copy."
  },
  {
    "rating": "5/5",
    "review": "Jason Statham, Bloody and Well Shot Action Scenes. This movie is a blast!"
  },
  {
    "rating": "3/5",
    "review": "It's more of the same that Statham offers, I would have given an extra star if the director didn't used those filters that made every scene look like they are in a green screen background, it was a good enough movie to watch once"
  },
  {
    "rating": "4/5",
    "review": "Thoroughly enjoyed every minute of it."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Love it. Unstop action 😃. A must see movie."
  },
  {
    "rating": "3/5",
    "review": "Standard Jason Stathom movie"
  },
  {
    "rating": "5/5",
    "review": "Lots of action and no dull moment. Loved the whole movie."
  },
  {
    "rating": "4/5",
    "review": "Lots of action I was hoping and expectation. Down side over use of the f—- word was distracting in a way. Also had sound issues at the AMC THEATER IN SARATOGA"
  },
  {
    "rating": "5/5",
    "review": "ACTIONS MOVIE IS TRUE STRATHAM FORM!"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie lots of action"
  },
  {
    "rating": "4/5",
    "review": "This movie was very good lots of action!"
  },
  {
    "rating": "2/5",
    "review": "I don’t know why I subject myself to a Jason Statham movie expecting something new Overly dramatic… action and storyline carbon copy of everything else he's already done. Sorry this one was a not worth 2 plus hours"
  },
  {
    "rating": "5/5",
    "review": "Great movie love these kinda movies"
  },
  {
    "rating": "5/5",
    "review": "Every single Jason Statham movie is a winner if you give this low stars just means your not into action packed statham movies dudes this generations Jean-Claude Van Damme but with more skills."
  },
  {
    "rating": "3/5",
    "review": "When I tell you about a movie where Jason Statham takes on human traffickers, you know exactly what you’re getting yourself into. The movie is A WORKING MAN, reuniting Statham and director David Ayers just one year after working together on THE BEEKEEPER, which I loved. Based on the book Levon’s Trade by Chuck Dixon, this tells the simple story of Levon Cade (Jason Statham), a former Royal Marine Commando who’s now a foreman of a construction company. He works for Joe Garcia (Michael Peña) and his wife Carla (Noemi Gonzalez) and daughter Jenny (Arianna Rivas). Jenny gets……taken……and you know the rest. This movie tries to have a JOHN WICK approach to world-building, where there’s an underground network of baddies pulling the strings, but they cram way too many of them in. The further up the bad guy chain we go, the more cartoony they get. One guy literally looked like the Penguin with his top hat and sculpted cane. When the movie was leaning in on the silly fun pow bang boom that Statham is now known for, I was having lots of fun. Statham has this thing down to a science by now, but this one just feels more repetitive and generic than usual. For me, the sillier and more outlandish the better. Don’t take yourself too seriously. This is why I loved THE BEEKEEPER. This action movie might not be unique enough for me these days, but I still had myself a good time and I think you will too if you turn your brain off. There are more books that A WORKING MAN is based on, so I wouldn’t be surprised if we see Statham’s Levon Cade again."
  },
  {
    "rating": "1.5/5",
    "review": "Stallone is a 90'ies VHS/dvd filmmaker. Hard to believe David Ayer took part in this mess.."
  },
  {
    "rating": "5/5",
    "review": "10/10 because Statham’s always delivering action every time!"
  },
  {
    "rating": "5/5",
    "review": "\"A Working Man is, without a doubt, the best movie of the year. It’s a powerful, emotionally resonant film that speaks directly to the heart of the everyday struggle, dignity, and perseverance of the working class. From the very first scene, it draws you in with its grounded storytelling, authentic characters, and a quiet strength that builds throughout the film."
  },
  {
    "rating": "5/5",
    "review": "Typical Jason Statham movie. Entertaining and Family Friendly."
  },
  {
    "rating": "5/5",
    "review": "Stratham is an attraction, and his films always deliver action! great to see Stallone involved as well."
  },
  {
    "rating": "2/5",
    "review": "Movie was for that kind of story too long. Bad acting and bad dialog. I enjoyed the action scenes, but the rest was just bad."
  },
  {
    "rating": "5/5",
    "review": "Always enjoy Jason's movies"
  },
  {
    "rating": "3/5",
    "review": "Meh... Pretty standard fare for a Jason Statham movie. Nothing really new here. Still worth a watch if you're a fan."
  },
  {
    "rating": "2.5/5",
    "review": "A generic but enjoyable enough Jason Statham action movie. Nothing feels new or exciting but they don’t really do anything wrong to make you angry either. Statham does a good job in the role and has a great bond with his daughter in the film thwy guides his decisions. The action is entertaining and fast paced but not groundbreaking. But, the movie is way too long for its own good and the villains are not memorable at all. Just fine. 5/10"
  },
  {
    "rating": "5/5",
    "review": "Really enjoy the action."
  },
  {
    "rating": "5/5",
    "review": "Great movie very action packed! Loved it"
  },
  {
    "rating": "2/5",
    "review": "Typical Jason Statham movie, but this one just didn’t hit. Kinda boring, and even the action felt tired and played out. The Beekeeper was way better."
  },
  {
    "rating": "5/5",
    "review": "Definitely one of Statham‘s better films"
  },
  {
    "rating": "2.5/5",
    "review": "Some good fight scenes- especially the first one involving construction tools- but, at almost two hours, too long for a Jason Statham movie. Statham or Liam Neeson or whoever always go on a rampage through a city (causing trouble, killing people) but the police never investigate...in real life, if a cat gets stuck up a tree, it makes news around the world!"
  },
  {
    "rating": "5/5",
    "review": "I went to have a good time and have fun. The movie delivers on both. Don't listen to the so called \"critics\"."
  },
  {
    "rating": "5/5",
    "review": "Jason is exceptionally talented actor, this movie was impressive!"
  },
  {
    "rating": "4/5",
    "review": "The acting wasn't great but the action was very entertaining. I went to see a Jason Statham action movie and I wasn't disappointed. If you want to see the same sort of movie you won't be disappointed either."
  },
  {
    "rating": "4/5",
    "review": "Working Man is a solid entry in the Jason Statham catalog. For fans of his style, it delivers what you'd expect . . . gritty, action-packed, and engaging."
  },
  {
    "rating": "5/5",
    "review": "Good story about love and family."
  },
  {
    "rating": "4/5",
    "review": "Gerat movie except the one character that got his cheek bit. This character brought the stars down from 5 to 4. Sly can write but screwed up on this character."
  },
  {
    "rating": "5/5",
    "review": "if you're a Jason Statham fan he brings it."
  },
  {
    "rating": "3/5",
    "review": "Typical movie of chase and kill the bad guy. Fun watch, but not great."
  },
  {
    "rating": "0.5/5",
    "review": "Spoilers: This has to be the worst movie Jason Statham has ever done. Over played plot \"girl gets kidnapped by the Russian Mob to be sold\". Terrible supporting cast with horrible acting skills. I have seen every movie this man had done and to be a huge fan this is a disappointment. If you choose to watch this just expect a little disappointment."
  },
  {
    "rating": "5/5",
    "review": "Nicely paced, and good action"
  },
  {
    "rating": "5/5",
    "review": "Love this movie and all his movies as far as that goes. Always action packed."
  },
  {
    "rating": "5/5",
    "review": "yeah. Great movie. another Statham classic."
  },
  {
    "rating": "1/5",
    "review": "Generic script. Stale film. Bad acting. It might as well be a silent film of 'the equalizer'."
  },
  {
    "rating": "5/5",
    "review": "Awesome 👌, Amazing"
  },
  {
    "rating": "3/5",
    "review": "A Working Man is a satisfactory throwback to the “one man as unstoppable army” films from the Eighties.  Although it’s well made and Jason Statham is reliably tough, the overwhelming seriousness of the story prevents it from being more than a standard search-and-kill-everyone mission.  Credit to director David Ayer for jazzing things up with an assortment of outlandish villains and phantasmagoric sets.  Mildly recommended. detroitcineaste"
  },
  {
    "rating": "3/5",
    "review": "Like all the others have said, this latest Statham installment is his regular cookie cutter movie. Instead of a Beekeeper he's a military vet who's a construction worker lol he uses more guns in this movie so there's a little more action. If the movie was 20 minutes less I think it would have been better... It's too long, I was waiting for it to be over. People will rate it high because of the action but even though it was better than most of his movies, Wrath of Man and Beekeeper were better."
  },
  {
    "rating": "2/5",
    "review": "There was certainly no hurry in finding the girl. There was way too many actors and extras in this film. The plot was fractured for the sake of dialog. Somehow 10 thousand rounds missed our hero at less than 50'. A hundred sparks fly off of a motorcycle as it's being shot from behind, but not a single round hit the rider. I just can't."
  },
  {
    "rating": "1/5",
    "review": "Life is very short. Do not waste one minute of your time on this movie. Statham should be embarrassed - but I'm sure his bank account is growing."
  },
  {
    "rating": "1.5/5",
    "review": "Wait for Netflix.. no in theater"
  },
  {
    "rating": "3.5/5",
    "review": "Practically \"the beekeeper\" but jason character is obviously a construction worker. Still wroth a watch"
  },
  {
    "rating": "4/5",
    "review": "The critics are dumb, If there was more of an agenda in this movie they would have given a better rating. Recommend the movie, good action, a storyline, and overall a good watch."
  },
  {
    "rating": "5/5",
    "review": "Jason is a very talented actor and this movie was Awesomely Awesome!!!!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Action packed and really great plot"
  },
  {
    "rating": "2.5/5",
    "review": "Generic Statham action - rescue the young woman from very bad guys - with a pinch of John Wick vibe thrown in to give it more flavor. I think it could have been improved by cutting 20 minutes. Despite the director's chops, it's not as good as the Beekeeper."
  },
  {
    "rating": "5/5",
    "review": "Felt like if I were watching any other film of Jason, an action movie with perfect fighting scenes."
  },
  {
    "rating": "4.5/5",
    "review": "Other than a slow buildup, it was an awesome movie with a lot of action and excitement in one of the best things about this movie was that Jason Statham is in it which I really enjoy because I think he is a great actor and I like basically every movie that hes in so if Hes in this movie, it is definitely good so he will be the main character in this movie. it definitely doesnt disappoint. There isnt any more than like 30 minutes of slow buildup but once it gets going, it doesnt stop through the whole movie pretty much definitely go see it with your friends and family or your S/O"
  },
  {
    "rating": "1.5/5",
    "review": "The only working man here is the director. Really worked hard on writing the most awful dialogs and caricatures."
  },
  {
    "rating": "1.5/5",
    "review": "I usually love Jason Statham movies. This one is filmed weird and jumps all over the place. I could not get into it."
  },
  {
    "rating": "5/5",
    "review": "Action from beginning to end."
  },
  {
    "rating": "3.5/5",
    "review": "A ton of action, with a precedented amount of tacky thematics"
  },
  {
    "rating": "2/5",
    "review": "Love Jason Strahan, but this movie was all over the place. Typical good guy bad guy movie with plenty of violence thrown in. It could have been so much better. Better plot, better actors, and so much better storyline. It was just meh!"
  },
  {
    "rating": "5/5",
    "review": "great movie. action packed"
  },
  {
    "rating": "4/5",
    "review": "Interesting story. Action packed throughout. I consider it a must see on the big screen."
  },
  {
    "rating": "5/5",
    "review": "I schedling of Gr9 to watch is auwsome. Besides that showing older movies ie on their anniversary release gives us movie goers extra. Another great event"
  },
  {
    "rating": "5/5",
    "review": "“Edge of seat” action…totally enjoyed!!!"
  },
  {
    "rating": "5/5",
    "review": "Excellent action packed movie!"
  },
  {
    "rating": "3/5",
    "review": "Not as good as I thought it would be."
  },
  {
    "rating": "4/5",
    "review": "Yes, it's a typical Jason movie, but in a good way. War for the right things. War fought well."
  },
  {
    "rating": "5/5",
    "review": "There was a lot of action throughout the movie. Jason acted his role very well."
  },
  {
    "rating": "0.5/5",
    "review": "The script was not well done. Even with the violence it almost put me to sleep."
  },
  {
    "rating": "5/5",
    "review": "typical Jason Statham fare, love his movies."
  },
  {
    "rating": "4.5/5",
    "review": "Jason Statham, is a great actor. Lots of action on this movie, and I expect it to be a sequel."
  },
  {
    "rating": "5/5",
    "review": "This movie delivers exactly what it promises. Great action people getting killed and some great one liners. Jason Statham never disappoints"
  },
  {
    "rating": "4/5",
    "review": "Solid action movie, Jason didn't disappoint, as always."
  },
  {
    "rating": "5/5",
    "review": "Love this movie very action packed highly recommended funny and really brings a strong message. A point in this movie that is currently a big problem with trafficking."
  },
  {
    "rating": "3.5/5",
    "review": "Love Jason Statham! This movie was so exciting and action packed. It was definitely worth the price of admission to the movies to see it. I recommend it!"
  },
  {
    "rating": "3/5",
    "review": "After a while, the killing got boring"
  },
  {
    "rating": "5/5",
    "review": "Jason Statham never disappoints great movie!!"
  },
  {
    "rating": "5/5",
    "review": "Liked that it was action packed and kept my interest"
  },
  {
    "rating": "5/5",
    "review": "Good action movie!! Jason Statham never disappoints"
  },
  {
    "rating": "3/5",
    "review": "I really enjoyed The Bee Keeper, so I had the same high hopes for A Working Man. The plot had all of these opportunities to be really good as well as the cinematography had the potential to be really good, but neither were great. The plot was just a mix of a bunch of angry Russians and human trafficking, mostly filmed in dark alleys or dark clubs. You can only have so many under lit scenes before it all starts blending together. The best part of the movie was the dialog and interaction the main character has with his daughter. Three stars may be generous, but there was some fun dialog. Visually though, it was underwhelming and just a lot of dark and shadowy scenes."
  },
  {
    "rating": "5/5",
    "review": "So good, Jason Statham never disappoints"
  },
  {
    "rating": "5/5",
    "review": "Plenty of action from start to finish. Jason Statham classic!"
  },
  {
    "rating": "5/5",
    "review": "Typical Statham movie. Action packed. He kicks butt as usual. Not at all boring."
  },
  {
    "rating": "5/5",
    "review": "ALL JASON’S MOVIES ARE GREAT!!"
  },
  {
    "rating": "5/5",
    "review": "Good storyline and a lot of action"
  },
  {
    "rating": "4.5/5",
    "review": "You know going in it is going to be action packed. You also know there will be alot of killing. But you can't look away. Loved the friend and wife."
  },
  {
    "rating": "5/5",
    "review": "Jason did not disappoint! A++"
  },
  {
    "rating": "5/5",
    "review": "We are a fan of Jason Strathan so his movies are always exciting and, the storylines are always good. This movie did not disappoint and lived up to our expectations! It's definitely worth going to see!!"
  },
  {
    "rating": "4/5",
    "review": "Full of action! Loved it!"
  },
  {
    "rating": "3/5",
    "review": "Very slow all the actors besides Jason were sub par!!!! Only really saw this movie because I'm a big fan of Jason."
  },
  {
    "rating": "5/5",
    "review": "Jason Statham movies are pretty much the same. Nonstop action once he starts going Shoots , stabs , beats up all the bad guys If you want high octane movie , this is the one"
  },
  {
    "rating": "5/5",
    "review": "Absolutely love movies that have Jason Statham in them! Love the action!!"
  },
  {
    "rating": "5/5",
    "review": "This was a great movie!!!"
  },
  {
    "rating": "0.5/5",
    "review": "This has to be the worst Jason Statham movie ever. I felt like it never ended in the movie theater. Bad writing and plot. It's so easy to understand the movie and what the end is like. I feel sad for the director and writers."
  },
  {
    "rating": "2.5/5",
    "review": "Fun but unbelievably predictable tired plot. Wish I wouldve waited until I was streaming for free. However, some may like it."
  },
  {
    "rating": "4/5",
    "review": "Thin plot ,but Stathams best film for me, great action throughout."
  },
  {
    "rating": "5/5",
    "review": "Suspense really good!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Dreary and unpleasant. The \"plot\" is nonsensical and there is no acting. Even as a Statham vehicle, it had no redeeming value. One of the worst films ever made."
  },
  {
    "rating": "5/5",
    "review": "Action packed!! Jason is always great!! Fun afternoon out!! Loved it!!"
  },
  {
    "rating": "4/5",
    "review": "Great action movie. I felt that the plot was a little bit forced, and it was a bit all over the place, but overall it was a great action movie. If youre going into it just for the action, you will enjoy it. If youre looking for a great storyline, it is lacking the depth to create a good plot."
  },
  {
    "rating": "4.5/5",
    "review": "Jason is as awesome as ever! Great action movie delivering high adrenaline all the way to the end. Has the story been done before? Sure. But who cares when it’s done well!"
  },
  {
    "rating": "3.5/5",
    "review": "Statham has been making the same movies with different titles for a while. With that being said you know what you are going to get. This is a solid but most likely forgettable action movie."
  },
  {
    "rating": "1.5/5",
    "review": "Not well filmed!! Cant see most of it"
  },
  {
    "rating": "5/5",
    "review": "Great story, the action seems real. The only silly part is when the teenage girl kills bad lady with her legs."
  },
  {
    "rating": "5/5",
    "review": "We liked the storyline, actors and the suspense."
  },
  {
    "rating": "1/5",
    "review": "Low budget production"
  },
  {
    "rating": "2.5/5",
    "review": "The hero is too invincible"
  },
  {
    "rating": "4.5/5",
    "review": "Is it a cut and dry Jason Satham movie? Yes. But I'm okay with it. Jason Satham had his niche in the movie industry and he does it well. If you like his previous movies, you'll like this one too."
  },
  {
    "rating": "5/5",
    "review": "This movie was great like all his others!!!"
  },
  {
    "rating": "0.5/5",
    "review": "This is one of the worst movies I have seen in a long time. Way way too much in your face gratuitous violence, topped off with an overabundance of swearing. The primary actors were good, so that was a plus. I am clearly not the target market for the film - but hard to see how anyone could enjoy it."
  },
  {
    "rating": "4/5",
    "review": "Lots of action with some occasional comedy. What else would you expect from a Statham movie?"
  },
  {
    "rating": "1/5",
    "review": "It was predictable, long, and boring. this movie has been made every year for the past 50 years."
  },
  {
    "rating": "1.5/5",
    "review": "Very corny. The child actress was the best actress. The movie was all over the place."
  },
  {
    "rating": "2/5",
    "review": "At least The Beekeeper has clearer point of view and cleaner action sequences. This is just bland. 😅"
  },
  {
    "rating": "3.5/5",
    "review": "Nonstop action from this notorious vigilante is in order here, good storyline, some blank area in plot but a definite thumbs up!"
  },
  {
    "rating": "5/5",
    "review": "a lot of action packed movie very very good movie will recommend it to all my friends"
  },
  {
    "rating": "5/5",
    "review": "I don’t know if it was the theatre experience that made this movie so good or the movie itself. Probably a little bit of both! I’d watch this movie again"
  },
  {
    "rating": "5/5",
    "review": "Great movie with Jason Stathem doing what he does best. Was it over the top at times? Sure, but fun throughout and worthy of a trip to the movies!"
  },
  {
    "rating": "1/5",
    "review": "IT WAS NOTHING BUT BEATING SOMEONE UP... HARD TO FOLLOW THE STORY LINE... THE FILMING WAS VERY DARK AND HARD TO SEE WHAT WAS GOING ON... BORING AND JUST PLAIN AN AWFUL MOVIE... SORRY WE BOUGHT 3 TICKETS TO SEE IT.... I LEFT FEELING RIPPED OFF......"
  },
  {
    "rating": "5/5",
    "review": "Great movie. Very violent and a lot of dark fighting scenes but overall a great movie and he’s an amazing actor."
  },
  {
    "rating": "2.5/5",
    "review": "A combination of The Equalizer, and Taken. Very predictable storyline. Expected the intensity of The Beekeeper got much less"
  },
  {
    "rating": "4/5",
    "review": "Hard to go wrong with JS. You know what you’re going to see or you wouldn’t be going."
  },
  {
    "rating": "3.5/5",
    "review": "I like watching Jason Statham beat up the bad guys but this time it seemed he got every break. I know most of these movies have the same plot points but there didn't seem to be any real threat to him not succeeding. Still, it was a fun watch but not something I would go out of my way to see."
  },
  {
    "rating": "4.5/5",
    "review": "Good story line and great action."
  },
  {
    "rating": "5/5",
    "review": "Excellent, hard-hitting action. I love how he delivers in his good Samaritan role of good versus evil. I'm already looking forward to a sequel."
  },
  {
    "rating": "3.5/5",
    "review": "I loved the movie and the action, and especially the \"good overcomes evil\" theme. What I literally \"HATED\" were the horrible evil demonic movie previews before the movie. There were kids in that theatre watching those!!!"
  },
  {
    "rating": "5/5",
    "review": "really good 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽"
  },
  {
    "rating": "1.5/5",
    "review": "So predicable. Love jason but just what you would expect. The rest of the cast is not very good"
  },
  {
    "rating": "5/5",
    "review": "It was like Taken on steroids! Hes just so cool to watch! A really good cast, Stallone was a cowriter, and Jason and Sly were co-producers. It had a really good story."
  },
  {
    "rating": "2/5",
    "review": "Not the best movie for Jason. He basically tried to carry the whole movie with subpar cast mates. Plot was lacking with a predictable ending. Oh, well, better luck next time."
  },
  {
    "rating": "4/5",
    "review": "you can never go wrong with a Jason Statham movie. full of action"
  },
  {
    "rating": "5/5",
    "review": "Great action as always with Jason"
  },
  {
    "rating": "3/5",
    "review": "I liked the movie because it had action, but I wished we had got a little more backstory into the men's life on Why he left the military?"
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! Action packed, everything you would expect from a Jason Statham movie and more!"
  },
  {
    "rating": "0.5/5",
    "review": "It's exactly like taken. Not interesting."
  },
  {
    "rating": "1/5",
    "review": "Way to much of the F Word"
  },
  {
    "rating": "5/5",
    "review": "This action movie was really good and grabbed my attention from the very beginning. It was packed with nonstop action almost the entire time, which kept it exciting. There were even a few moments that made me laugh and some surprisingly emotional scenes. Id definitely watch it again."
  },
  {
    "rating": "5/5",
    "review": "Fantastic!! Action Pack!"
  },
  {
    "rating": "5/5",
    "review": "Very fast paced. Loved the suspense"
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved it!!"
  },
  {
    "rating": "5/5",
    "review": "I really liked it I always enjoyed Jason Statham he always has a good cause of why he does what he does. He was determined to help family daughters Etc. At first I was confused as to why the girl was taken and who taken her and why it took me a while to figure things out."
  },
  {
    "rating": "1/5",
    "review": "Thought it would be good but the story was bad and the acting was bad too. We are Statham fans this was his worst."
  },
  {
    "rating": "5/5",
    "review": "Great story and fantastic action as it moves forward very quickly."
  },
  {
    "rating": "1/5",
    "review": "Same old, same old... The Bee Keeper movie was much, much more engaging. I just wanted this one to end so it would confirm what I already knew."
  },
  {
    "rating": "2/5",
    "review": "Why so many f-words?"
  },
  {
    "rating": "4/5",
    "review": "A little too dark and violent."
  },
  {
    "rating": "4/5",
    "review": "Jason Statham at his best action movie did not disappoint. Waiting for the sequel to any of his movies. The movie will also be hit with Vietnam veterans for weapons of that era in the film. Sylvester Stallone as co-producer definitely had a big hand in producing , The Working Man."
  },
  {
    "rating": "3/5",
    "review": "The Beekeeper was better! this was aight! but forgettable IMO"
  },
  {
    "rating": "2/5",
    "review": "Too much violence, not enough depth."
  },
  {
    "rating": "5/5",
    "review": "Great actors and movie!"
  },
  {
    "rating": "2.5/5",
    "review": "A little disappointing and formulaic. Wrath of Man was a far superior movie."
  },
  {
    "rating": "1.5/5",
    "review": "Bad Director and just as bad acting. Special effects over done and predictable lines and fake scenes. UGH Where can I get my money back?"
  },
  {
    "rating": "5/5",
    "review": "If you are an action or a Statham fan. This movie is for you. Absolutely loved it. Full of action from start to finish."
  },
  {
    "rating": "4/5",
    "review": "Pretty standard Statham fare. I liked the soldier trying to live a better life theme. And the girl he was trying to rescue is no damsel in distress. Pretty good."
  },
  {
    "rating": "5/5",
    "review": "I absolutely Loved this movie, the detail and character thought that went into this film was amazing"
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies I seen this year. I hate to see Statham become the next Bruce Willis of Liam Neeson. The movie was predictable, gratuitous, and ultimately, boring. The depiction of the under belly of society was stereotypical and cartoonish. There are a ridiculous number of holes in the plot. I enjoy Statham but this was cookie-cutter, white hat hokum. Stallone needs to work on his story telling. Don't pay for this one. It will be streaming for free soon."
  },
  {
    "rating": "0.5/5",
    "review": "Nothing about this movie wasn't terrible. It failed on all points. Plot, Score, Acting, Cinematography, Stunts, Costume, all of it, terrible.."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie so action packed . Highly recommend it"
  },
  {
    "rating": "5/5",
    "review": "Little better story line and plot then some earlier Jason Statham movies. Great action throughout most of the movie."
  },
  {
    "rating": "5/5",
    "review": "I'm my opinion it's everything taken wanted to be. LOTS of action. Jason statham absolutely killed the main role one of the best movies 2025 has had so far!"
  },
  {
    "rating": "5/5",
    "review": "Awesome - just like all Jason Statham movies!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Lots of action and of course, Jason Statham is PHENOMENAL! I can definitely see them making a #2."
  },
  {
    "rating": "3/5",
    "review": "It was decent, too much plot filler throughout though. Not quite as good as the beekeeper."
  },
  {
    "rating": "3.5/5",
    "review": "The man, the legend violently returns in a tried-and-true plot formula that is \"A Working Man.\" Backed by Stallone in both producing and screenplay, Levon Cade (Jason Statham) takes immediate exception with a Russian crime organization, specifically their human trafficking arm, after the daughter of his friends and employer is kidnapped. With a Royal Marine Commando background, said organization and others (affiliated biker gang) don't stand a chance as he stabs, shoots, drowns, blows up, and neck snaps anyone in front of him. Some may argue that it's the same story, different profession (construction foreman), and they're probably right, but this action hero has achieved spellbinding status at this point and there's absolutely nothing we can do about it!!!"
  },
  {
    "rating": "5/5",
    "review": "Always like Jason Statham movies. Lots of action & good story line."
  },
  {
    "rating": "5/5",
    "review": "He saves the young lady and takeout the bad guys !!!! He is the the James Bond and Rambo all in one !"
  },
  {
    "rating": "4.5/5",
    "review": "I mean, I am a huge fan, so I went in totally expecting a specific kind of movie with specific kind of action and acting and specific storylines. I like his movies and his acting in these fun specific types of movies. Plus I enjoyed it inside a theater. It was a fun time at the movies. And it had the predictable fun ending I wanted. Period. Great movie. Worth the time."
  },
  {
    "rating": "5/5",
    "review": "Sly and Statham keeping 90’s action movies alive!!!"
  },
  {
    "rating": "5/5",
    "review": "Statham will remain Statham. Jason and action are like 5&6. Too much talk don't do the work. Nice watch. But I still prefer Beekeeper to this though."
  },
  {
    "rating": "3.5/5",
    "review": "Action packed. Classic Jason Statham movie. I was not disappointed."
  },
  {
    "rating": "2/5",
    "review": "Absolute absurd movie, I was expecting this movie to have more action"
  },
  {
    "rating": "3.5/5",
    "review": "Jason's done it again."
  },
  {
    "rating": "3.5/5",
    "review": "If you like Jason Statham go."
  },
  {
    "rating": "5/5",
    "review": "You wont be disappointed! Once again, Jason Stratham delivers like only he can do!!"
  },
  {
    "rating": "4.5/5",
    "review": "Loved the constant action and fight scenes. Unbelievable but still a good bang for the buck"
  },
  {
    "rating": "4/5",
    "review": "If you're a Jason Stathom fan it's a good watch!"
  },
  {
    "rating": "5/5",
    "review": "Great Entertainment, compelling drama and action!"
  },
  {
    "rating": "4.5/5",
    "review": "It was exactly what I expected from Jason! lol"
  },
  {
    "rating": "3/5",
    "review": "It's a lot of profanity and killing"
  },
  {
    "rating": "3.5/5",
    "review": "Typical Jason Statham movie. Predictable plot and predictable amount of violence."
  },
  {
    "rating": "5/5",
    "review": "Wow absolutely amazing. On a whim me and my partner thought hey let's go cinema and watch something. This has to be one of the best films I've seen in a long long while. Much love to all who made this 🤘🏻"
  },
  {
    "rating": "5/5",
    "review": "A lot of action, one of his best movies. I really loved it"
  },
  {
    "rating": "0.5/5",
    "review": "فیلم خیلی کند کسل کننده شخصیت پردازی افتضاح مبارزات نه چندان جالب روایت بد داستان کلیشه ای بودن داستان ویلن های نچندان جالب حفره های بزرگ داستانی نور پردازی بد سکانس های تغیب وگریز بد فیلمبرداری بد درحین مبارزات بدترین فیلم از این بازیگر محبوب"
  },
  {
    "rating": "1.5/5",
    "review": "CAUTION, SPOILER ALERT: I went with 2 other guys to see the movie. Afterwards, I waited for their reaction; theirs was the same as mine: we've seen this story before: a daughter gets kidnapped and then gets rescued. The hero dodges 700,000 rounds of ammunition. End of story."
  },
  {
    "rating": "1/5",
    "review": "Another one of the same nothing new or original Jason statham playing Jason statham"
  },
  {
    "rating": "5/5",
    "review": "We loved it! Action packed, a little gruesome but overall we liked it!"
  },
  {
    "rating": "3.5/5",
    "review": "Fairly generic Jason Statham action film, not great but not terrible."
  },
  {
    "rating": "3.5/5",
    "review": "Good action, but the story was weak, and the pacing was slow."
  },
  {
    "rating": "4/5",
    "review": "A little far fetched with fight scenes but a good movie"
  },
  {
    "rating": "3.5/5",
    "review": "Jason Statham plays a formidable action star in every one of his movies, but he can take a beating! Jason is a hard worker, full of action, and he can't get a scratch! A WORKING MAN is full of action."
  },
  {
    "rating": "2.5/5",
    "review": "OK, Not as fulfilling as Beekeeper"
  },
  {
    "rating": "5/5",
    "review": "This movie was awesome and had plenty of action please go see"
  },
  {
    "rating": "5/5",
    "review": "Great movie watch it in dbox ."
  },
  {
    "rating": "4/5",
    "review": "Typical action movie."
  },
  {
    "rating": "5/5",
    "review": "Action packed but not too gory. Best movie Ive seen in a while."
  },
  {
    "rating": "4/5",
    "review": "If it ain't broke don't fix it. Jason Statham continues doing low key action movies that are very entertaining. If you want an old school action flick this one fits the bill."
  },
  {
    "rating": "4/5",
    "review": "Love Jason Statham - disliked the length of this movie. They really dragged it out unnecessarily."
  },
  {
    "rating": "5/5",
    "review": "As usual great action movie!"
  },
  {
    "rating": "1.5/5",
    "review": "This movie was a remake of TAKEN just with the Russian mob."
  },
  {
    "rating": "4.5/5",
    "review": "Does not disappoint! It is definitely a Jason movie."
  },
  {
    "rating": "3/5",
    "review": "Some good acting. Some bad acting. Some improbable situations. But the pacing is good and watchable."
  },
  {
    "rating": "5/5",
    "review": "This was a very good action packed movie!"
  },
  {
    "rating": "5/5",
    "review": "loved the story line and the action was incredible! great acting"
  },
  {
    "rating": "5/5",
    "review": "well if for some reason you have to use the restroom you will have to wait until the movie ends!!! Riveting action with a bonus of so many “bad” guys + cancel any plans of traveling to the USSR."
  },
  {
    "rating": "5/5",
    "review": "Action from beginning to end...hope there's a sequel"
  },
  {
    "rating": "5/5",
    "review": "I found the movie was everything I expected it to be and a lot more. The movie had a lot of drama and action and you always know what to expect when you watch a Jason Statham film. It's a throw ride from beginning to end!"
  },
  {
    "rating": "5/5",
    "review": "Typical Jason Statham movie. Enjoyable as much as ever."
  },
  {
    "rating": "1.5/5",
    "review": "A bad movie. Higher profile actors were in this movie and they did a servicable job, but way too much of the dialogue was performed by very bad actors, especially the girl in main bad couple. The only thing she knew how to do was scream the F-Bomb, and they gave her ample chances to do so. The action was corny, the emotional scenes were corny, the action wasn't that exciting. The dialogue clarity and sound mixing were bad: The theater had to turn it up way too loud to be able to hear the dialogue making the gunshot be almost as loud as actual gunshots. Don't get me wrong, I like Jason Statham movies, but this is one of his worst."
  },
  {
    "rating": "4.5/5",
    "review": "The movie had action from start to finish!"
  },
  {
    "rating": "3/5",
    "review": "I was expecting more than what I got from Jason this time. The movie feel really odd and I just can't put my finger on why ... the lack of transition between scenes, the many cheesy dialogue lines, the weird brotherhood that try to copy the John Wick universe, the cringe dance scene in the bar with the young chicks, the road the movie took was so long for no reason or the lack of great action scenes. I still gave it a very good note in my book and it's because the soundtrack was great, the final action scene delivered and I liked the idea of the movie but it was just not delivered well."
  },
  {
    "rating": "4/5",
    "review": "As always Jason Statham movies are action packed, but during the movie I think some of the action was used to lengthen the movie more than continue the storyline. All in all still a good movie."
  },
  {
    "rating": "0.5/5",
    "review": "What a mess. Statham felt lifeless, the villains wore sparkles and flowy hair like they were headed to Eurovision, not running a human trafficking ring. The kidnapped girl somehow turned into a trained killer by the end? Absolutely ridiculous. Cringe-worthy writing, zero emotional weight, and a total waste of potential. Hard pass."
  },
  {
    "rating": "5/5",
    "review": "As always Statham delivers another Kick-A Hit. Not to be missed f youre a fan !"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie exceeded my expectations John Statham was outstanding"
  },
  {
    "rating": "1.5/5",
    "review": "A poor remake of Taken with a lack of story line flow."
  },
  {
    "rating": "5/5",
    "review": "That girl was cringey, but the rest was cool"
  },
  {
    "rating": "5/5",
    "review": "Staham never disappoints!!!!!! Great Action Movie!!!!"
  },
  {
    "rating": "1.5/5",
    "review": "Too long, recycled concept. Too bad"
  },
  {
    "rating": "1/5",
    "review": "I am truly surprised this was rated so well. I thought it was a stinker! The plot was so hard to follow. The continuity was nonexistent. Good fight scenes, but they could not save this movie."
  },
  {
    "rating": "5/5",
    "review": "A lot of action, dragged a little in the beginning, but overall give it an A+"
  },
  {
    "rating": "1.5/5",
    "review": "Woof. I expect pretty much the same movie from Jason Stratham but this was appallingly bad."
  },
  {
    "rating": "4/5",
    "review": "Always love Jason Statham but the plot of this one got a little crazy towards the end"
  },
  {
    "rating": "3/5",
    "review": "Some of the worst dialog in a movie the only good actor in the movie is jason Statham. The action was solid. I would recommend it if you just want to watch an action movie"
  },
  {
    "rating": "0.5/5",
    "review": "Worst Jason Statham movie ever!!! Feminine Russian guys in glitter jackets as the bad guy? Women trafficker with her face tatoos acting tough is ridiculous! Rich girl who bites off the guys cheek, escapes, get picked up by police and given back to bad guys, then she somehow has military training and chokes out one of the traffickers??? This movie was a total mess! I would give it zero stars if I could."
  },
  {
    "rating": "2/5",
    "review": "Jason Statham is one of my favorite actors . This has to be his worst movie he’s ever done. It should’ve went straight to video as a B movie."
  },
  {
    "rating": "4/5",
    "review": "Plenty of action and a good enough story."
  },
  {
    "rating": "4/5",
    "review": "Action packed Statham special. You get what you'd expect."
  },
  {
    "rating": "0.5/5",
    "review": "I wish 0 stars was available to rate this film. Save your money and time don’t watch this movie I beg you."
  },
  {
    "rating": "3.5/5",
    "review": "I enjoy his movies . I like his the way he develops his character."
  },
  {
    "rating": "4.5/5",
    "review": "Jason at his best This just kicks so much ass remind me of the transporter a little bit I think there's a possible sequel but never know they're supposed to be a beekeeper sequel so see what happens action is crazy in here though."
  },
  {
    "rating": "4/5",
    "review": "This movie has lots of action As many of the jason statham movies do."
  },
  {
    "rating": "5/5",
    "review": "Awesome move! Jason never disappoints!"
  },
  {
    "rating": "3.5/5",
    "review": "3.5 for this movie is pretty accurate. It’s not the worst Jason Statham movie but it is also not the best. The plot was drawn out. I did like the whole Russian gang/mob though. If you like fast and a lot of shooting you’ll love this film."
  },
  {
    "rating": "1.5/5",
    "review": "More of the same as the last couple of movies."
  },
  {
    "rating": "2.5/5",
    "review": "Una película buena que lo que más destaca es la acción, pero no quita que la trama sea genérica, entretenida al momento, pero sin momentos memorables y muy olvidable"
  },
  {
    "rating": "1.5/5",
    "review": "Sort of a mess hard to follow although you knew what was going to happen anyway."
  },
  {
    "rating": "5/5",
    "review": "Such a great action packed movie🤩🤩🤩"
  },
  {
    "rating": "5/5",
    "review": "Love this movie. Lots of action."
  },
  {
    "rating": "5/5",
    "review": "Another great movie from Jason Statham."
  },
  {
    "rating": "4.5/5",
    "review": "Lots of action, swift moving, like Statham a lot"
  },
  {
    "rating": "2/5",
    "review": "It was okay. But too much killing and not enough character development for me"
  },
  {
    "rating": "4.5/5",
    "review": "Great movie but they left two or three threads unfinished..."
  },
  {
    "rating": "4/5",
    "review": "Lots of action and an endless supply of bad guys to get rid of. Definitely recommend watching this movie. Thumbs up!"
  },
  {
    "rating": "5/5",
    "review": "Great suspense movie!!"
  },
  {
    "rating": "3.5/5",
    "review": "Good show but language was pretty bad. It would have been just as good without constantly using the Fword"
  },
  {
    "rating": "3/5",
    "review": "Obviously not a great movie and some of the plot and characters are pretty clunky but overall fun popcorn movie."
  },
  {
    "rating": "4/5",
    "review": "It's an action movie. Yes it's predictable and another \"I'm out of the game\" movie but it's action packed and fun."
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing. One of Jason’s best movies"
  },
  {
    "rating": "5/5",
    "review": "Basic non stop, action thriller. No need to think, just turn off the brain and enjoy."
  },
  {
    "rating": "5/5",
    "review": "action and tactical 10/10 whatever jason movie im down with that even movie critics giving negative comment. big fan from malaysia"
  },
  {
    "rating": "3.5/5",
    "review": "It was ok but it certainly doesn't change from his action films. The storyline was ok. If you like Jason and his action films, you'll like this one."
  },
  {
    "rating": "0.5/5",
    "review": "They basically took the last 5 movies Jason Strathan was in and just changed the name on the top."
  },
  {
    "rating": "5/5",
    "review": "Jason Statham IS a BADASS! This was Just as GOOD if NOT BETTER than the BEEKEEPER!"
  },
  {
    "rating": "3.5/5",
    "review": "Acting could have been better. Still love Jason Statham and will watch all of his movies. Still entertaining. Better on the big screen."
  },
  {
    "rating": "3/5",
    "review": "It was better then U thought it was going to be."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies 🍿 I’ve seen lately!! Truly amazing movie and great story"
  },
  {
    "rating": "5/5",
    "review": "Another classic by Jason statum"
  },
  {
    "rating": "3.5/5",
    "review": "I wish the leaning into the fighting at the beginning had a bit more of a build up, other than that…. I really enjoyed this movie. Jason Stathom delivered again!"
  },
  {
    "rating": "5/5",
    "review": "Great action, interesting plot. nice connection to Beekeeper. Positive message and outcome."
  },
  {
    "rating": "0.5/5",
    "review": "Jason S can only play one character which is funny because he managed to Screw this one up….. And it was his character… the one he's played a million times. Besides being a cooky cutter script it was concluded, silly, and stupid."
  },
  {
    "rating": "4/5",
    "review": "Enjoyed it. Wasn't as good as the mechanic films or Beekeeper but was fun. Good action film"
  },
  {
    "rating": "5/5",
    "review": "Great action! How can you go wrong with any movie Jason is in?!"
  },
  {
    "rating": "5/5",
    "review": "If you liked the movie Taken, by Liam Neeson, then this movie is for you. It's Jason sathem version of it with his iconic twist."
  },
  {
    "rating": "5/5",
    "review": "Action from start to end. I love it!"
  },
  {
    "rating": "4.5/5",
    "review": "Solid enough to get a sequel. I'm certainly interested in more modern vigilante films like this."
  },
  {
    "rating": "5/5",
    "review": "Solid Movie. Gotta love Jason Statham!!"
  },
  {
    "rating": "5/5",
    "review": "Nothing, it was a really good action film. Hope for a sequel."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is a intense thriller movie it's interesting 🤔 I was impressed with this movie I thought I had to leave but nope I enjoy it"
  },
  {
    "rating": "5/5",
    "review": "great action. Very much like Equilizer meets Bee Keeper"
  },
  {
    "rating": "5/5",
    "review": "Could have used a few more tools as weapons kills. Otherwise completely delivers on premise. Very fun."
  },
  {
    "rating": "2/5",
    "review": "**2/5 - Statham Deserved Better** As a longtime Statham fan, I went in hoping for another gritty ride like *The Beekeeper*—which, while not perfect, at least had some sting. *The Working Man* (ironic title for how lazy the script felt) plays like a discount *Taken* knockoff, with none of the urgency or emotional pull. The plot's thinner than a gas station sandwich, and I’ve seen more compelling villains in a Saturday morning cartoon. Every henchman felt ripped from a “bad guy starter pack.” I don’t mind a brainless action flick now and then, but this one didn’t even try to entertain. Not asking for Shakespeare here, but at least give me a reason to care who’s getting punched. Even Statham, usually a reliable tough guy anchor, felt wasted. By the third act, I was more invested in checking the time than in any character’s fate. File this under \"forgettable.\""
  },
  {
    "rating": "2.5/5",
    "review": "I think In the middle is so boring and action scene doesn't seem to know much about it."
  },
  {
    "rating": "2/5",
    "review": "A film so generically by the numbers that it struggles to justify its own existence. David Ayer should really find something that lets his Latino Goth fetish fly."
  },
  {
    "rating": "4/5",
    "review": "Usual Statham Movie, action sequence are good, thin storyline, predicable"
  },
  {
    "rating": "3.5/5",
    "review": "Honestly I loved it kinda out there but still very enjoyable"
  },
  {
    "rating": "4.5/5",
    "review": "The action scenes have always been very good in a jason statham movie plus the story telling is superb"
  },
  {
    "rating": "5/5",
    "review": "Non-stop action thriller"
  },
  {
    "rating": "5/5",
    "review": "Action packed movie. I wasn't bored at all. I didn't think the movie dragged like others did. Kind of reminds me of John Wick. The movie was very intense. For fans of action movies."
  },
  {
    "rating": "1/5",
    "review": "Zero emotional or logical motivation for the plot whatsoever. Cartoonish antagonists, awkward acting... One of those movies that may be \"so bad that it's good\". I can't fathom at all how the screenplay-- or even the script-- made it to production. WTF"
  },
  {
    "rating": "5/5",
    "review": "Jason statham action is really good. Compared beekeeper this movie is so better. But need to work action screenplay scenes it’s not realistic some gun shooting !"
  },
  {
    "rating": "4/5",
    "review": "Storyline was too predictable"
  },
  {
    "rating": "4/5",
    "review": "I appreciate the film's seriousness. Some expected it to have some comedy, but I really appreciate how the main character takes the time to do his job. Work which is the focus, very honorable and a man of his word. It's a delightful movie to watch. I would definitely watch it again."
  },
  {
    "rating": "5/5",
    "review": "It was a really good movie. You will enjoy it ."
  },
  {
    "rating": "5/5",
    "review": "Great Action-Flick, Jason Statham delivers as he always does. He's been playing these roles for so long, he just slips into this one like putting on a comfortable pair of boots, and the same can be said for Sylvester Stallone's script writing here. Good action with heart entertainment all around. I highly recommend this one, especially if you are an action fan."
  },
  {
    "rating": "2/5",
    "review": "Believe the critics. You are either a Jason fan or you not and I’m not. I just don’t get his movies. IMO this is a streaming over. Good luck."
  },
  {
    "rating": "3/5",
    "review": "hey I just watched for the action interesting inner working of Russian mafia. intersecting royal marine and army tech"
  },
  {
    "rating": "5/5",
    "review": "Awesome have to see it."
  },
  {
    "rating": "5/5",
    "review": "Great suspenseful movie!!"
  },
  {
    "rating": "2/5",
    "review": "Wasn’t a very good movie. Plot wasn’t good. A lot of violence."
  },
  {
    "rating": "2/5",
    "review": "This movie just wasn't working for me, man. There's some pretty solid action in here but a lot of the movie is painfully boring. Feels like a slog to get to the good parts."
  },
  {
    "rating": "3.5/5",
    "review": "It was fun movie , action packed . But nothing spectacular"
  },
  {
    "rating": "3.5/5",
    "review": "It had the typical Statham flair fight scenes, which were great <3 lots of explosive scenes, shooting scenes, had a definite \"Taken\" vibe to it, but overall was actually kind of disappointed, especially since it was Directed by Statham and Stallone...two of my favorite action Guys :( I think the whole drug acquisition on his part was just a filler, felt like they ran out of material to fill the time? Definitely worth one watch maybe twice to see if I missed something...."
  },
  {
    "rating": "1.5/5",
    "review": "Very predictable and unrealistic. Thumbs down"
  },
  {
    "rating": "5/5",
    "review": "This was so good that it leaves you wanting more so I’m really hoping for a sequel!"
  },
  {
    "rating": "5/5",
    "review": "Was a action packed movie and story was good"
  },
  {
    "rating": "0.5/5",
    "review": "Warning. These reviews must be fake. This is one of the worst movies we’ve ever seen. The plot, acting, everything was awful. We walked out it was so bad and I like Statham. Rotten tomatoes needs to look into these reviews. It was hard to watch start to finish. A super “B” movie sad to say."
  },
  {
    "rating": "5/5",
    "review": "great movie, fully action-packed and full of suspense."
  },
  {
    "rating": "3/5",
    "review": "Dragged in places, but Jason Stan always does good action movie"
  },
  {
    "rating": "5/5",
    "review": "Good movie. Good script. Lots of action and lots of very good acting. If you are looking for a good action movie this is it !"
  },
  {
    "rating": "5/5",
    "review": "A lot of action and great acting . I highly recommend watching this movie as Jason S. does it again."
  },
  {
    "rating": "4/5",
    "review": "Movie was good. The actor that played the dad of the kidnapped girl not so much. He was very unbelievable the acting part where he was supposed to cry he had no tears, it was very unbelievable acting. I don't know who this particular person was, maybe they should think of replacing him in the future."
  },
  {
    "rating": "0.5/5",
    "review": "It was a flop the pink Panther was better than that"
  }
]