[
  {
    "rating": "0.5/5",
    "review": "We have an obsession for killing time and scrolling through nonsense and I’d like to make a sincere thank you to this film for the meaning of “that’s 2 hours of my life I’m not getting back”"
  },
  {
    "rating": "5/5",
    "review": "This was cerebrally entertaining without the usual vocal or visual profanity. Great job for both movies. The characters meshed well, story line consistent, acting by all superb."
  },
  {
    "rating": "4.5/5",
    "review": "Just watch the damn film"
  },
  {
    "rating": "3/5",
    "review": "actually pretty good but ngl some of the magic its kinda not possible so its a bit over the top, i didnt want the fbi and interpol to fricking kiss bc there not the main character like just get the heck out of here but the plot twist was unexpected (not that good tbh). But the visually i like it and it gives off tumblr instagram vibes (well this was made in 2013) not my favourite aesthetic but its ok. also, WAS THAT FLASHING NESSARY BRO???? TOOK OF A WHOLE 0.5 FOR THAT BULLSH*T"
  },
  {
    "rating": "3.5/5",
    "review": "The cast is great and while it isn't as slick as I think it wants to be, it is still a fun watch."
  },
  {
    "rating": "1/5",
    "review": "Was this the worst movie I’ve ever seen? Probably not. Can I think of a worse movie? No."
  },
  {
    "rating": "4/5",
    "review": "A good movie - with a surprising twist - it's a shame it comes out of nowhere."
  },
  {
    "rating": "5/5",
    "review": "As much as I hate Jesse Eisenberg and his annoying voice and acting, I love this movie. It's one of those movies that you can only watch once to experience the twists and turns it has in the magic."
  },
  {
    "rating": "4/5",
    "review": "Now You See Me is a slick and entertaining heist thriller that blends magic with crime in a way that keeps you engaged from start to finish. The plot is well-paced, introducing its characters quickly but effectively, making sure each magician stands out with their own style. The mystery unfolds in a way that keeps you guessing, with some moments that feel genuinely clever and others that rely on misdirection. While the twist works, it feels like it was designed more for shock value than something deeply layered, but it still delivers on the fun factor. The directing does a solid job of balancing action with the illusion-based storytelling, making each trick feel larger than life. The cinematography leans into the sleek and stylish, using dynamic camera movements that enhance the sense of spectacle. There’s a good rhythm to the editing, making sure the pacing never drags, though some moments feel a little too quick, as if rushing to the next big trick. The sound design and score add to the energy, keeping the excitement high throughout. Acting-wise, the cast is strong, with Jesse Eisenberg, Woody Harrelson, Isla Fisher, and Dave Franco each bringing distinct personalities to the group. Mark Ruffalo plays his role well, though his character sometimes feels overshadowed by the magicians. Morgan Freeman and Michael Caine add weight to the film, though Freeman, as always, feels like he’s playing a version of himself. Mélanie Laurent is a welcome addition, though her role is somewhat underdeveloped. The script is sharp, filled with witty dialogue and a sense of mystery that works well for this type of film. While it may not be a deeply thought-provoking movie, it’s a stylish and enjoyable ride that keeps you entertained throughout."
  },
  {
    "rating": "2/5",
    "review": "It was remarkably mediocre. The FX were fun, and the basic premise was good. The writing was amateurish. The chemistry between the characters was almost non-existent. How Larent's character came to like Ruffalo's character was a mystery. His character treated hers very poorly, but somehow we're supposed to believe they've got some connection? Just, no. The chase scenes were good, and the premise was strong enough to not give this one star. So, there's that. I see this film as a: an easy paycheck for some respected actors b: a horrifically wasted opportunity. It's Oceans Eleven for stupid people. Grade: C"
  },
  {
    "rating": "3.5/5",
    "review": "When people talk about what does modern pacing feel like in a movie in the 21st Century, this is Exhibit A. It's like if JJ Abrams made the Prestige in a way. It's not a bad thing, it's entertaining but it SO CLEARLY wants to keep throwing new twists and turns at you so you don't think about how insane it would be for all this to have even the remotest chance of occuring. Don't Think Consume Product and Floor It. It feels like it thinks it's olot twists and turns are cut from the same cloth as The editing isn't bad either but man it jumps around so much. It's like a heist thriller movie mixed with a action flick with magicans. During the car chases and fights it feels like a Bourne Movie. You can follow it pretty easily without paying much attention. Despite being an insane complex plot it's very much a turn your brain off type of flick. Were led to believe the 4 magicians at the start which are so sloppy with how there edited but than Mark Ruffalo becomes the focus. Than sometimes back to the main 4 and than crazy heists/setups happen with no setup at all. The acting is good and so is the cinematography. The actual heist tricks themselves are the highlight and pretty memorable. Easily the highlight of the film. Ruffalo is great also and the ensemble cast does pretty good overall. There all memorable. The one STUPID thing is the whole Ancient Egypt Secret Order which is SOOO stupid. If you take that out it feels like nothing is lost. I have yet to see one film involving ancient Egypt links to modern times that doesn't have problems. (Catwoman, X-Men Apocalypse) The music isn't bad but feels a bit generic and is well used though. I think most people would find this actually entertaining and get enjoyment out of it. Especially if your a fan of any actors in this too. But someone who can easily see through the smoke and mirrors and wants something of substance will have a harder time getting invested and suspending their disbelief than others here."
  },
  {
    "rating": "0.5/5",
    "review": "Boring , predictable, and the ending draws on for nearly 30 minutes."
  },
  {
    "rating": "4.5/5",
    "review": "This movie was definitely better than the 2nd one. Has a lot of twists and turns, and the magic was incredible! :)"
  },
  {
    "rating": "2/5",
    "review": "Movie was terrible and it took me 50 minutes in to realize it. What the movie lacked was consistency. Everything about this movie was inconsistent. The plot, acting, and even the character development. The plot didn't make sense and was inconsistent. The movie tried too hard to give plot twists and just made it nonsensical. The two main characters were obviously supposed to be intimate, but they both lacked chemistry and it seemed like they didn't like each other. The character development was good awful. A lot of screentime was spent building the main character to prepare the audience for the other twist, but a lot happened in the film that just contradicted itself. When a movie tries to make a strong plot twist you have to make sure previous scenes don't contradict later scenes. For example, with the way Mark Ruffalo fought and chased Dave Franco there's NO WAY you can turn later say Mark's character was behind it all. When you rewatch a movie with a strong plot twists there have to be hidden cues like \"ah how'd I miss that!\" Instead with this film, if you rewatch it, you'll be like \"Wait, it doesn't make sense to do that if you're gonna use the plot twist in the end.\" As aforementioned, lack of consistency. Morgan's character was abused and made a fool of. That is just a total waste of his strength. The movie went all in on their plot twist to really shock the audience and in the end that just made it feel like the first 50 minutes were a waste."
  },
  {
    "rating": "4.5/5",
    "review": "A thrilling movie that keeps you guessing at every single turn on what the Four Horsemen might do and why they do it. With an aspect of faith, and a multitude of twists and turns, the movie walks you blindly into a festival of cards and charades. It has some of the most realistic moments I've seen in a “magic” movie and plenty of excellent writers to keep the all-star cast accompanied. With Mark Ruffalo and Jesse Eisenberg at the helm, they are complimented handsomely by Isla Fisher, Dave Franco, Michael Caine, Morgan Freeman, and so many other amazing actors."
  },
  {
    "rating": "4/5",
    "review": "«Now You See Me», directed by Louis Leterrier, is a captivating heist thriller that artfully blends magic and deception. The film revolves around a group of illusionists known as the four horsemen, who pull off a series of daring bank heists during their performances, robbing corrupt businessmen while entertaining crowds. The film features an ensemble cast, including Jesse Eisenberg, Woody Harrelson, and Isla Fisher, each bringing their charisma to the roles. The plot unfurls through clever twists and turns, keeping viewers guessing about the true motivations of the characters. The film's pacing is brisk; it balances the thrill of the heists with the intrigue of cat-and-mouse games involving an FBI agent and an Interpol detective. While the film entertains with its stylish visuals and clever setup, it prioritizes spectacle, leaving some character backstories underdeveloped. Compared to other heist films, such as «Ocean's Eleven», it lacks a certain depth but compensates with its unique thematic focus on illusion versus reality. In conclusion, «Now You See Me» is an exhilarating film that captivates with its innovative approach and spectacular heists. While it may not dive deep into character exploration, its entertainment value and clever plot twists make it a must-see for fans of thrillers."
  },
  {
    "rating": "5/5",
    "review": "one of my favorite movies"
  },
  {
    "rating": "4.5/5",
    "review": "Very fun movie about magicians. Sometimes got a bit complex in terms of word choice for a non-native speaker, but overall storyline is great, with many twists and turns"
  },
  {
    "rating": "4/5",
    "review": "Filme: Truque de Mestre Assistido: Set/24 Elenco: @jesseelsenberg @davefranko @islafisher @michael_caine_official @morganfreeman @woodyharrelson @markruffalo Modelo: #aventura #ficção Duração: 1h 55m Ano: 2013 Minha opinião: Um filme interessante que traz uma proposta diferente; a mágica. Como exemplo o filme “O Ilusionista” mais um filme muito bom. Aqui temos um mágico X, que reúne uma equipe de mágicos medianos e depois de um tempo os transformam em Super Mágicos; Daniel (Jesse), Merritt (Woody), Jack (Dave) e a simpática Henley (Islar). Tudo começa no dia que o dinheiro de um Banco na Europa some e chove no meio da mágica, depois tem outra mágica que surpreende a todos e nisso tudo temos Tadeus (Morgan) que quer sabotar tudo. Até o dia clímax com uma mágica onde beneficia pessoas que perderam dinheiro de investimento para Arthur (Caine) e tudo é devolvido e ao final Tadeus é incriminado e preso. O filme tem boas atuações e bons CGI e efeitos. Roteiro e enredo muito inteligente e com um ótimo enredo. Parabéns pela construção deste filme. Tanto que a continuação com a parte 2. Vale apena assistir? Sim commcerteza Nota: 8,5"
  },
  {
    "rating": "5/5",
    "review": "I absolutely adored this flick. It's fun, snappy dialog, beautiful effects, keeps you guessing until the twist end, and had me rooting for the protagonists without ever thinking, \"morons deserve what they get.\" Think of it like a cross between Usual Suspects and Oceans 11."
  },
  {
    "rating": "4/5",
    "review": "Very clever with a hint of crime. A unusual combination that works so well."
  },
  {
    "rating": "3/5",
    "review": "It was a really good movie, only I wish there would have been more magic tricks and more Dave Franco!"
  },
  {
    "rating": "3/5",
    "review": "i enjoy these movies but i wish Mark Ruffalo would shave and see a barber-not sexy!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved the movie, very clever, twists and turns, great acting and actors I love! I will watch this many times!"
  },
  {
    "rating": "3.5/5",
    "review": "Entiendo que no es perfecta, el ritmo es lento en algunos momentos y se siente raro ver al personaje de Mark Ruffalo interactuar tomando en cuenta el final. Pero gracias a la química de los personajes y la trama bien elaborada, tenemos una película muy entrenida, divertida e interesante."
  },
  {
    "rating": "5/5",
    "review": "An absolutely amazing movie, with many twists and turns and creative usage of magic tricks."
  },
  {
    "rating": "3/5",
    "review": "O filme tem uma ótima ideia porém não consegue executá-la da melhor forma em todos os momentos. A reviravolta final é péssima e acaba por ser um dos muitos motivos que torna um filme divertido com potencial para ser bom em algo medíocre."
  },
  {
    "rating": "2.5/5",
    "review": "A highly entertaining movie but that final twist was absolutely terrible and was not necessary and ruins the entire movie for me."
  },
  {
    "rating": "3.5/5",
    "review": "Thought this was a very well played out film, lots of twists and turns. The four of them trick the FBI throughout as they perform various magic rituals."
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing. Unique magic tricks and a new form of heists involving entertaining suspense. 10/10. I loved it. If u didn't then u have no taste and u a haterrr"
  },
  {
    "rating": "3.5/5",
    "review": "Interesting Movie, I'd recommend watching."
  },
  {
    "rating": "3.5/5",
    "review": "Some parts were pretty good...but it kinda dragged after a bit."
  },
  {
    "rating": "3/5",
    "review": "It is extremely coooooool. Lots of veeeery smaaaart people. On the border of being tooooo much of everything."
  },
  {
    "rating": "4/5",
    "review": "pretty good movie ngl"
  },
  {
    "rating": "5/5",
    "review": "Loved it! Perfect cat and mouse movie leaving you guessing the entire time."
  },
  {
    "rating": "4/5",
    "review": "I don't care what people say; I like this movie. Mark Ruffalo and the rest of the cast do a really great job."
  },
  {
    "rating": "4/5",
    "review": "I like this movie better than most, I think the action and magic aspect of this film is underrated. The stars put together for this film do a great job and make this movie worth watching."
  },
  {
    "rating": "4.5/5",
    "review": "I was confused but also amazed so I'm counting it as a win"
  },
  {
    "rating": "4/5",
    "review": "A classic. Very entertaining and innovative"
  },
  {
    "rating": "5/5",
    "review": "I love this movie! If you want magic, fun, comedy, and excitement then look no further. Grab your popcorn and try to figure out all the cool tricks and plot twists!"
  },
  {
    "rating": "3.5/5",
    "review": "It was pretty entertaining but really out there and unbelievable. It was hard to follow at times. It's worth the watch"
  },
  {
    "rating": "1.5/5",
    "review": "Incredibly boring. Big name actors with empty roles. Cinematography is stomach turning, too many close ups of faces. If you have common sense or observe environments you will be disgusted by the blatant fakeness of this film."
  },
  {
    "rating": "5/5",
    "review": "Loved it! The actors are great and so is the story. Keeps you interested and on your toes. I have watched it 3-4 times. Fun movie"
  },
  {
    "rating": "1/5",
    "review": "A magic movie that instead of showcasing magic represents a bunch of dumb wizards. Crap"
  },
  {
    "rating": "5/5",
    "review": "it's fun to watch! i really like the soundtrack, if's humorous and it's overall just really entertaining. :)"
  },
  {
    "rating": "5/5",
    "review": "I love this movie. It has such a good story line. I know somethings are really unbelievable but I think that's good for a movie. Like I feel movies should be a fun ride not omg that's not realistic."
  },
  {
    "rating": "4/5",
    "review": "I love this series so much! Love the way they film the movie and love the story. Magic and satisfying. Recommend!"
  },
  {
    "rating": "4/5",
    "review": "le plot twist de zinzin"
  },
  {
    "rating": "4.5/5",
    "review": "Proof that film critics don't know what they are talking about. This is a great film. Yes, it's cheesy, has over acting and in some places has holes but who cares there's a place for that! Solid gold fun!"
  },
  {
    "rating": "5/5",
    "review": "Just so fun. Don't think about it too hard."
  },
  {
    "rating": "1/5",
    "review": "Had potential, but the pace of the film distracted and so did the aggrandizement. I saw it because my sister had it and I thought I'd give it a whirl. I should have just skipped it. It was on VUDU."
  },
  {
    "rating": "2/5",
    "review": "the positives, Isla Fisher's lipstick game was strong, woody H is always fun. Morgan Freeman is a national treasure! Negatives Mark Ruffalo , rest of cast Mélanie Laurent had no lipstick game and was annoying, Caine sleepwalks his way through it, does this role in his sleep, contrived plot"
  },
  {
    "rating": "0.5/5",
    "review": "Unbelievably uniquely bad, to the point where it's hard to believe this is a real movie and not a parody. At certain points this is indistinguishable from an Austin Powers movie or an SNL sketch. How in God's name is this movie rated as highly as it is? This may legitimately be the worst movie I've ever seen in my life, because as far as I can tell, it takes itself seriously. The plot is 100% convoluted and contrived gobbledygook. The writers were just trying to be clever with as many twists and bluffs, double-bluffs, triple-bluffs, etc, as possible. The result is the cinematic equivalent of Homer Simpson's makeup shotgun. They just threw a bunch of bright flashy garbage at a wall and hoped some of it sticked. Well, it didn't. I feel very bad for the French actress because she's actually very talented, gorgeous, and subtle. All the other actors are kind of low-rent people who will do anything for a check, especially Freeman at this stage of his career. He's technically in the movie but mainly just sits and stares and tries not to fall asleep. To all involved in the making of this film: Everyone who watched this movie is now dumber for having watched it. I award you no points, and may God have mercy on your soul."
  },
  {
    "rating": "3/5",
    "review": "Entertaining enough, but this movie gets dragged down by trying to overcomplicate things, particularly the ending."
  },
  {
    "rating": "2.5/5",
    "review": "Just alright. I wanted it to be so much better. Director Louis Leterrier tries to have us look past the illusion of magic. There’s always a trick to everything making it hard to distinguish what’s real or not. You have a good cast in here from Jesse Eisenberg to Isla Fisher to Woody Harrelson to Dave Franco to Morgan Freeman to Michael Caine to Mark Ruffalo. The film is fascinating in the beginning watching all these magicians perform their own tricks. A bank robbery in France is what catches wind of a federal agent determined to catch them and debunk their so-called wizardry. The movie then turns into an on-going investigation piecing together the puzzle bit by bit. The rest of the film becomes less interesting just focusing on Ruffalo when it should be more on the actual magicians. It should’ve been more thrilling and fun with its premise."
  },
  {
    "rating": "4/5",
    "review": "Really enjoyed this even though it's kind of hackneyed"
  },
  {
    "rating": "4/5",
    "review": "Spectacular and interesting"
  },
  {
    "rating": "4.5/5",
    "review": "This was a well paced film that delivered on a grand scale. It is a bold and entertaining heist movie that keeps you on the side of the those doing the crime. The film starts as it means to go on and that is fairly full on. Morgan Freeman is excellent in his role, but it is a role that was probably only necessary to give the story of the film any credibility. But by doing so, it itself perhaps causes parts of the story to be over explained, which is all very convenient, perhaps too much so. The film has four good leads outside of the big stars. It was good to see Michael Caine in the film and his presence gave his character the gravitas that a less well known actor might not have been able to give. The film is funny and there are plenty of laughs to be had throughout. The first running chase scene was the only bit of questionable direction as it was a bit messy, but otherwise it felt quite tight. The ending was a bit hasty and lacked credibility in the way it was done, but did not spoil the film. Heist movies are really only ever vehicles for pure entertainment not to be taken too seriously and as a piece of escapism, this film delivered exactly that."
  },
  {
    "rating": "3/5",
    "review": "3 & 1/4 stars. Tricky plot covered by good acting. Lots of loose ends but that's what the sequel is for, right?"
  },
  {
    "rating": "4/5",
    "review": "Misdirection. This film is full of it, in the best way. From the very first scene with the 7 of diamonds, the story is fast-paced and intriguing. The main cast of characters are full of charisma, and the supporting cast is strong as well. I found myself glued to the screen and eagerly guessing what was going to happen next. The final show was a tad disappointing, with the buildup and payoff for the first two shows extremely high. Still, a great heist/mystery/magic movie that brought something fresh to the film scene. Best Character: Daniel Atlas Best Scene: The Louisiana show Best Quote: \"The closer you think you are, the less you'll actually see.\" - Daniel Atlas Best Piece of Score: \"Welcome to the Eye\""
  },
  {
    "rating": "4.5/5",
    "review": "A very interesting movie about trickery and deception."
  },
  {
    "rating": "3.5/5",
    "review": "What a twist at the end man, no spoilers. So first of all, these guys are f*cking wizards, do I care, no not really, I had so a good time with this movie. This movie is really, but really fast paced. In the first 15 minutes of the movie, we got introduced to 4 characters and there story how they got to the operation the \"eye\" and begin the first show. Some things don't make any sense how they did it, but sometimes i was like, wow that's cool, it made me think about the movie oceans eleven. The camerawork in this movie, is brilliant to the fast pace of the movie. All the performances were great, not a single weak one. Overall really amusing movie, definitely check it out."
  },
  {
    "rating": "4/5",
    "review": "Magnificently slick. Superb casts, excellent performance in a wholly engaging plot."
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining and original"
  },
  {
    "rating": "1/5",
    "review": "You will never see the twists coming because they make no sense whatsoever."
  },
  {
    "rating": "5/5",
    "review": "Fantastic direction and twists and turns were on a different level entire"
  },
  {
    "rating": "3.5/5",
    "review": "I think it was a decent movie, it lacked a little character development and backstory but it was a good movie overall"
  },
  {
    "rating": "4.5/5",
    "review": "Really great cast and the story was so good and kept me always wondering what would happen next. Nothing was ever what it seemed and I enjoyed that. Great plot twist at the end too!"
  },
  {
    "rating": "3.5/5",
    "review": "Pretty good movie. I've watched it a couple times. The first time watching it is incredible."
  },
  {
    "rating": "3/5",
    "review": "Great movie, I enjoyed it"
  },
  {
    "rating": "2/5",
    "review": "Now You See Me includes a theatrical cut and an extended cut of the film that runs ten minutes longer and I opted for the longer extended cut for my viewing. The film packs in big names and a big budget script making for a polished and attractive picture, unfortunately the script doesn't match up to it's production value. The plot, while having many twists and turns as you would expect for a movie about magicians, seems shallow overall and it's a shame as it could have been much more complex and layered in it's story. There is nothing that is really \"bad\" per se but the film with this many great actors and a big budget and seemingly interesting plot was a bit of a letdown."
  },
  {
    "rating": "1/5",
    "review": "So wholly preposterous as to be literally unbelievable. Gaping plot holes, infantile dialogue and some really lackluster performances with really poor writing smeared all over it results in a waste of a couple of completely good hours."
  },
  {
    "rating": "4/5",
    "review": "Die Unfassbaren - Now You See Me, will uns verzaubern, ob sie es geschafft haben? Ebenfalls war der Film gut ob es gereicht hat? Vier Sterne."
  },
  {
    "rating": "2.5/5",
    "review": "Coming into this movie, I thought there was going to be a lot of magic tricks throughout the whole film -- well, I wasn't wrong on the magic trick, alright, but I was wrong that it was going to be constant. This movie is somewhat unique, using magic tricks to do 3 impossible hiests, and giving a billion dollars to a lot of people. Well, this movie (to be gin with) started out good, but it slowly got boring to me in the end. I did enjoy this hiest movie, but there was this one big plot twist I could have never seen coming. As much as it is unique in its own ways with using magic tricks, it still hurts me to stay this movie was a bit of a disappointment! I did enjoy the cast memebers (for sure Woody Harellson and Mark Ruffalo) and theirr acting, and I did grealty enjoy the whole plot of it, but in the end well: it just wasn't my favorite movie."
  },
  {
    "rating": "3/5",
    "review": "Not my cup of tea. Plenty of good performers here, but overall it seemed weak and not as spectacular as it could've been. The ending plot twist seemed a little dry and not as breath grasping as it could've been."
  },
  {
    "rating": "3.5/5",
    "review": "Nice twists all the way through."
  },
  {
    "rating": "4/5",
    "review": "Dumb as hell I'd watch it over and over again. The performances are great and the twists are wonderfully entertaining. Don't think too much about the plot and just enjoy the show. 8/10, good job."
  },
  {
    "rating": "3.5/5",
    "review": "It's fine ! Sometimes you know a film is not going to make you think too much ... and sometimes that's exactly what you want . The cast do a good job of a thin plot but it was a popcorn and soda pleasant movie ."
  },
  {
    "rating": "4.5/5",
    "review": "Muy buena película, muy entretenida y frenética en todo momento. Esta cinta es de mis favoritas, se muy bien que no es una obra maestra, ya que tiene muchos errores, conveniencias, etc. pero es que su trama me parece muy original y entretenida, junto a un elenco lleno de estrellas que se lucen. Además, tiene muchos giros inesperados, tanto en como lograron hacer sus trucos de magia, como en la trama misma. Todo el tema de la magia me parece excepcional, me encanta como lo hacen en esta serie de películas, tiene algunas escenas impresionantes. El elenco tiene en general muy buenas actuaciones, este esta conformado por estrellas como Jesse Eisenberg, Woody Harrelson, Mark Ruffalo, Isla Fisher, Dave Franco, Morgan Freeman y Michael Caine. Los efectos especiales también están muy bien logrados, tanto en escenas de acción como en las que se utiliza la magia. En conclusión, me parece un film muy bueno, que destaca principalmente por su trama super entretenida y frenética, acompañada por un cast perfecto. La recomiendo."
  },
  {
    "rating": "0.5/5",
    "review": "when this movie came out maybe the CGI was cool, and the magic tricks were maybe believable, but as of now, this movie is literally worthless. The twist doesn't even work"
  },
  {
    "rating": "3.5/5",
    "review": "\"The closer you look, the lesser you see.\" - this line sums up the movie better than I ever could. Turn your brain off and you will have a good time. Go in expecting 'The Prestige' and you will come out disappointed. Final Rating: 68/100"
  },
  {
    "rating": "1.5/5",
    "review": "One of the dumbest movies I’ve seen in a long time with equally terrible acting."
  },
  {
    "rating": "4/5",
    "review": "Such a great movie, thrilling and suprising and all characters were interesting for me."
  },
  {
    "rating": "1.5/5",
    "review": "Paper-thin characters introduced like a sports team line-up, all full of themselves and spewing \"bad-ass\" lines trying way too hard to sound cool, like they were written by a teenager or something. Halfway through the movie the explanation to the \"big mystery\" is spelled out to us in every detail by Morgan Freeman, who did himself a big disservice by playing in this crap, and then all interest in continuing to watch the movie completely dies. At which point I press pause, get out of full-screen and close the player. The End."
  },
  {
    "rating": "4/5",
    "review": "Other than the acting and the plot being amazing, there's not much more that blows me away about this movie. Although I would say this is a must see for people who are into crime and magic stuff (like me)"
  },
  {
    "rating": "3.5/5",
    "review": "The movie isn't the best, but its good. The story goes good, characters have their moments, the magic tricks really surprised me and the acting was great. I loved the plot twist with the FBI agent. The only thing that could have been done better is if the story would focus more on the 4 horsemen instead of the FBI agent (played by Mark Ruffalo) trying to catch the 4 horsemen. Other than that, a really enjoyable and fun movie and would watch again! 7/10"
  },
  {
    "rating": "4.5/5",
    "review": "I thought it was good and the heists were brilliant but I think it focused to much on the FBI trying to catch the four horsemen instead of focusing on the four horsemen"
  },
  {
    "rating": "2/5",
    "review": "A very unrealistic plot, with few magic tricks, all only possible with editing."
  },
  {
    "rating": "5/5",
    "review": "Best movie ever with unpredictable plot twists and a wonderfully surprising ending"
  },
  {
    "rating": "1/5",
    "review": "I couldn't suspend my disbelief. This is an absolutely horrible movie. It starts daft but vaguely interesting and goes downhill rapidly from there. By the end i couldn't even be bothered to have feelings about it."
  },
  {
    "rating": "2.5/5",
    "review": "A stupid ending but it was a great ride up until that point."
  },
  {
    "rating": "3/5",
    "review": "almost as good as the first. not enough Isla Fisher!"
  },
  {
    "rating": "5/5",
    "review": "It's a perfection omg plus jack wilder is so hot fuck me daddy🤧"
  },
  {
    "rating": "0.5/5",
    "review": "I wanted jack to die but the movie sucks so it didn't happen"
  },
  {
    "rating": "4/5",
    "review": "Amazing story, incredible acting but sadly after the second movie was created I have to rate it down one star because it was slightly over complicated. The plot is thrilling and for anyone who likes or does not like magic this is a MUST SEE!"
  },
  {
    "rating": "2/5",
    "review": "What a waste of a perfectly interesting premise. All the heist movie fun is bogged down by contrived plot, flat characters, overused tropes, and unrealistic, overly expository dialogue. The poor writing overshadows anything good the movie has to offer, and Morgan Freeman, Michael Caine, Mark Ruffalo, Mélanie Laurent and Woody Harrelson's charisma combined isn't enough to make it compelling. It's just a few notches up from boring at passably enjoyable."
  },
  {
    "rating": "5/5",
    "review": "How did I miss this movie when it came out in theaters? What an entertaining, fun and unpredictable story! I wished I had seen it with a crowd. I really enjoyed all the magic that was performed in the movie and it was nice to see how some of the tricks were done. It made me think of the time I saw Siegfried & Roy perform in Vegas. So magical! It's also got just the right amount of comedic moments interwoven into story. The set pieces were fabulous. Never once was I distracted from the movie because I didn't want to miss a single moment. And I love the twist in the end with Mark Ruffalo. Excellent performances from this all star cast. An absolute must see!"
  },
  {
    "rating": "2.5/5",
    "review": "This film is pretty damn mediocre."
  },
  {
    "rating": "2.5/5",
    "review": "\"Now You See Me\" is a fun ride, but its strange way of telling its story and last minute twist are its main flaw"
  },
  {
    "rating": "3/5",
    "review": "People tend to be overly critical about this film because they had high expectations about its accuracy, but I didn't. I expected a farfetched plot that would entertain me for a couple of hours and that's exactly what I got, plus some high quality acting. This doesn't intend to be the film of the year, or to depict what magicians do IRL, it's just a funny story to pass the time and, in that sense, does its job."
  },
  {
    "rating": "4.5/5",
    "review": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 1,5"
  },
  {
    "rating": "4/5",
    "review": "A lot of movies prove to be enthralling, the difference with this one? It involves magic. I haven't always been interested in magic but the second I played this movie, I knew I would not regret playing it. Can I say I didn't expect the end? Only partly. But that doesn't take away the magic of the film, you have to admit, the director did a fantastic job. Jesse and Woody had been in movies together before this one, so the chemistry has been carried on. Dave Franco has also proven to be an impressive actor in movies I've watched in the past. I feel that the actors portrayed the characters quite well, helped us understand them throughout the movie so that we got attached to them, having us hold our breath at certain parts."
  },
  {
    "rating": "2.5/5",
    "review": "Pros: The twist (Which I did speculate but it was still good) Mark Ruffalo Morgan Freeman The entertainment level Cons: Certain casting choices Dull performances from good actors Plot holes Editing Overall, it could have been great, but wasn't."
  },
  {
    "rating": "5/5",
    "review": "As theft movie is good, it has a great cast and entertains you as it promises. If you like tricks and actions that leave you \":O\" you will like it."
  },
  {
    "rating": "4/5",
    "review": "A film full of magic which will puzzle your brain, but the genius of the film is.. we get to see how they did it after being amazed of their tricks. A very good cast and plot leaves fans wanting an encore, which is how we got the sequel!"
  },
  {
    "rating": "2.5/5",
    "review": "The film is entertaining enough for the most part, many of the tricks are interesting in the begin-ning (and to a limited extent have good explanations). The strong cast carries much of the movie entertainment-wise. The film is quite dumb though."
  },
  {
    "rating": "5/5",
    "review": "Such a fun movie! At times it is over the top, but it never takes itself too seriously."
  },
  {
    "rating": "3/5",
    "review": "Even though he is \"intriguing\" due to a cast of charming stars, he is foolish for forced performances and lost by a superfluous script and plot that little knows what he presents and how he presents it."
  },
  {
    "rating": "4.5/5",
    "review": "One star off for not developing the cast to much. This movie is entertaining as hell and the characters are loveable and funny. The magic tricks are easy on the eyes and are always amazing to look at. The way the cast gets their jobs done are fantastic and they are always twenty steps ahead of everyone elese."
  },
  {
    "rating": "3/5",
    "review": "A bit confusing at times, not too memorable, but able to pass the time."
  },
  {
    "rating": "0.5/5",
    "review": "How this movie got 51 percent on RT is amazing to me, it's literally the most obnoxious, pretentious, mind numbing movie I've ever seen, the people that watch and enjoy these movies are the same people that watch Adam Sandler movies, mindless idiots. Do yourself a favor and DO NOT watch this piece of garbage."
  },
  {
    "rating": "0.5/5",
    "review": "I managed to watch 30 minutes. Then I lost the will to live. Absolute bollocks."
  },
  {
    "rating": "3.5/5",
    "review": "I liked the action packed scenes and the twist were fun and humorous however it felt a bit forced and unrealistic."
  },
  {
    "rating": "1.5/5",
    "review": "Got 20 mins in before the great cast was overwhelmed by the cheesy script, feeble storyline and nauseating camera spins."
  },
  {
    "rating": "5/5",
    "review": "Not a super reviewer, just an ordinary viewer who appreciates being transported into a silver screen world once in a while. If a movie succeeds in this endeavor, then I give it a nice rating. What is important is how you feel when you walk out the door. You can second guess the plotlines and check for errors during scene changes and then show all of us who read Rotten Tomatoes reviews how clever and erudite you are. (applause). Me? I'm here for the enjoyment. Personally I liked the show. Seen it several times now and always follow it with the sequel. Mine is the simple life. Watching the magic again in the spring."
  },
  {
    "rating": "4/5",
    "review": "Now You See Me is a great movie. The movie's got a great story with some great twists, interesting characters, brilliant acting, great dialogue, decent cinematography, smart action sequences, great illusions, good humour, brilliant visual effects and some very hit and miss pacing for the build ups throughout this movie. Overall, Now You See Me is pretty much an underrated gem and it's honestly a really good movie."
  },
  {
    "rating": "3.5/5",
    "review": "Nada mas ni nada menos que sorprendente. Entretenimiento asegurado."
  },
  {
    "rating": "2/5",
    "review": "Weak plot, badly under-utilised cast with terrible script. It tries to be clever but completely fails. I held out for a decent ending but it deceived me in all the wrong ways. It says something when the best character is played by Dave Franco..."
  },
  {
    "rating": "5/5",
    "review": "I absolutely LOVE this movie. It was fun and unpredictable."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie!! Wow just watched it 4 times at least."
  },
  {
    "rating": "3.5/5",
    "review": "Very nice and interesting film that manages to make the magic intended as a scam for a higher purpose fascinating, in general the film is very entertaining and impactful and always manages to maintain an aura of mystery and continuous chasing by everyone. The only flaw lies in some twists and turns that literally have no sense"
  },
  {
    "rating": "3.5/5",
    "review": "Despite its nonsensical ending and convoluted plot, its talented cast, fast-paced and thrilling narrative, and magical visuals bring enough entertainment to casual audiences."
  },
  {
    "rating": "3.5/5",
    "review": "Now you see me is a fun and entertaining movie. I thought the four horsemen were creative with their tricks. I enjoyed the acting in it and it's just a fun movie. It is kinda silly and some of the tricks don't really make sense at least not to me but it is fun. It's not great but I enjoyed it"
  },
  {
    "rating": "3/5",
    "review": "It's not good, but not bad"
  },
  {
    "rating": "2/5",
    "review": "The film's tension and story is headed in the right direction, but while its script grabs some attention, it's not quite what I'd call \"magical\". 4.6/10"
  },
  {
    "rating": "3/5",
    "review": "a good movie with a lot of twist. This movie will keep you guessing until the end. Unfortunately once you learn the trick the movie is not worth seeing again."
  },
  {
    "rating": "4.5/5",
    "review": "I absolutely love Now You See Me. This was the third time seeing this film I believe but it had been a while. It was impressive because the movie felt so fresh and exciting. I was a huge fan of this movie the first time I watched it, and I was a huge fan of it again. The twists and turns are always exciting and real, and I really like the characters."
  },
  {
    "rating": "4.5/5",
    "review": "Such a good movie so much fun so much deception! Everything is not what it seems!"
  },
  {
    "rating": "3.5/5",
    "review": "And a good movie to watch when you have nothing to do"
  },
  {
    "rating": "3/5",
    "review": "This film has an impressive cast, a laughably unrealistic plot, a few plot twists, solid acting, and good cinematography and editing. Despite the plot I did enjoy the film, particularly the first half. The concept is unique and something fresh. However, the second half is pretty weird and more unrealistic and there's not much character development in this film."
  },
  {
    "rating": "3/5",
    "review": "This is a completely watchable magic thriller with an all-star cast, decent visual effects, and a few goods jokes. This is by no means a movie deserving high praise, but for what it's going for, I think that it really worked. Mark Ruffalo gave the best performance no doubt, he really sold me as a guy with a troubled past with a plan to resolve his vendetta, I bought into his story and really sided with him more than the main characters. The main characters are magicians played by Jesse Eisenberg, Woody Harrelson, Isla Fisher, and Dave Franco, that were all brought together by a mysterious figure who wanted them to join the elite magic organization \"The Eye\". All of the performances were decent besides Ruffalo's great one, but the part I didn't like was the very secret elite magician cult that they were trying to join, it really bogged the story down with unessecary backstory and an almost supernatural feeling that creates tonal discrepancies. Morgan Freeman was also very enjoyable to watch as well, he knew how everybody pulled off the magic tricks which led to long exposition sequences that sometimes make the tricks less impactful or exciting, but I found most of them to be somehow achievable and grounded in reality. The ending is also sloppy and confusing, they did a complete 360 on Ruffalo's character and made him in league with \"The Eye\" which didn't make much sense given what we saw his character go through in this film; the end is also unsatisfying because they get accepted to \"The Eye\" because they were told they were, and they just go back out and do more magic, all of the build-up was for this moment and it didn't deliver. I already didn't believe in it, but that was all the character were striving towards so I expected something grander and maybe even smarter to occur, but it was a typical Hollywood tacked on a twist ending. Back to the positives, I found the action sequences to be very well filmed and entertaining, the editing was a bit to fast for my liking, but I really got invested into that aspect of the film. The special effects weren't big and cheesy and overdone, it was held back and the few that were used were very polished. This is a perfectly watchable magical heist thriller with a great Ruffalo performance, but as soon as you switch on your brain and try to apply logic to the scenarios depicted, you really do realize that this film is style over substance."
  },
  {
    "rating": "3/5",
    "review": "With its balance of mystery and sleight of hand, Now You See Me is a perfect bit of summer fun, though it's not going to a classic by any measure. At the very least, studios should be rewarded for putting time into new concepts rather than rehashing old material constantly. (3/5)"
  },
  {
    "rating": "0.5/5",
    "review": "FUCK THIS SHITTY ASS MOVIE, I'M OUT!"
  },
  {
    "rating": "0.5/5",
    "review": "What a mess! Punchline doesn't make any sense. Terrible film."
  },
  {
    "rating": "5/5",
    "review": "This movie has a lot of eye tricks and it's so awesome"
  },
  {
    "rating": "4/5",
    "review": "good action and trick"
  },
  {
    "rating": "5/5",
    "review": "It’s actually a pretty good movie. Don’t know why it gets so much hate."
  },
  {
    "rating": "4/5",
    "review": "Love the movie. It's fresh. It's original. Not another boring remake or sequal. The fantastic plot twist at the end is what makes the movie"
  },
  {
    "rating": "4/5",
    "review": "It moved too fast, which resulted in weak character development, and the twist at the end was too radical, but at least it was consistent with the misdirection."
  },
  {
    "rating": "5/5",
    "review": "A great movie all though.Champack boss.💥💥💥💥In the hole.BADASS MOVIE."
  },
  {
    "rating": "5/5",
    "review": "Good movie must watch"
  },
  {
    "rating": "5/5",
    "review": "It's clever and really well written with some great sprinkles of humor!"
  },
  {
    "rating": "5/5",
    "review": "100% my favorite movie!"
  },
  {
    "rating": "5/5",
    "review": "This is A mind blowing movie if you immerged in it from the beginning."
  },
  {
    "rating": "3.5/5",
    "review": "Excelente pelicula, de esas con giro inesperado al final."
  },
  {
    "rating": "4/5",
    "review": "Now You See Me was Fantastic! While not 5 star, it certainly was a 4 star movie and well worth watching. My wife and I watched with our 13 and 15 year old and they loved it. Very fresh, and fun. Can't wait to see NYSM2!"
  },
  {
    "rating": "3/5",
    "review": "Why are any of these people in this?"
  },
  {
    "rating": "3/5",
    "review": "decent and different"
  },
  {
    "rating": "2.5/5",
    "review": "5.7/10 — \"Mediocre\"/\"Passable\""
  },
  {
    "rating": "4.5/5",
    "review": "rewatched this one today and seriously love the writing, visuals and the way the characters were played out."
  },
  {
    "rating": "4.5/5",
    "review": "I can't download this movie"
  },
  {
    "rating": "4/5",
    "review": "Good thriller with a solid cast."
  },
  {
    "rating": "5/5",
    "review": "Very good movie interesting"
  },
  {
    "rating": "5/5",
    "review": "LogrÃ³ captar mi atenciÃ³n y mantener mi interes por su resoluciÃ³n."
  },
  {
    "rating": "5/5",
    "review": "The critics on this website can suck mad ****. Movie was great and well directed, and the cast is all but perfect. The sequel is just as good if not better, too."
  },
  {
    "rating": "2/5",
    "review": "A perfectly good example of how an awful soundtrack can ruin a potentially good film."
  },
  {
    "rating": "5/5",
    "review": "Loved this movie. Kept me guessing the whole time."
  },
  {
    "rating": "4/5",
    "review": "Great fun movie. Great twists. Great Actors"
  },
  {
    "rating": "3/5",
    "review": "6/10 uninteresting"
  },
  {
    "rating": "4/5",
    "review": "NOW YOU SEE ME is not the best heist movie out there, but it stands out for one specific reason: ILLUSIONS! I personally love illusions. I know a friend who likes to make things disappear from time to time ;). This movie grabs on to this fun idea and creates a suspenseful movie filled with these cool tricks and I really did enjoy myself. Yes, the plot is not always very clear, and there are some inconsistencies, but I did like the idea, and the movie, in general. So, there you have it."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved this movie"
  },
  {
    "rating": "3.5/5",
    "review": "Now You See Me is an interesting concept with mediocre execution. Although it doesnâ(TM)t create anything legendary, it will most likely provide an entertaining ride for those who watch it. So, even though there isnâ(TM)t much to stand out in this film, there isnâ(TM)t much to hate on either."
  },
  {
    "rating": "5/5",
    "review": "Illusionist/Trickster Doing Crimes, Full of Stunning Action & Thriller. VFX, Cast, story etc everything are just tremendous, I really liked the Film. Best Regards"
  },
  {
    "rating": "4/5",
    "review": "Super fun, kinda reminded me of Ocean's 11 but with magicians."
  },
  {
    "rating": "2.5/5",
    "review": "the ending is worst part but its an okay movie not anything special"
  },
  {
    "rating": "0.5/5",
    "review": "This is the worst movie I have ever watched. It is contrived, poorly acted and the plot is one deus ex machin after another. And those are its better points."
  },
  {
    "rating": "1.5/5",
    "review": "One of the hokiest, most absurdly contrived films I've ever seen."
  },
  {
    "rating": "0.5/5",
    "review": "Most not interresting film ever i saw , and now when we all know that guy is a murdered lay with womans when they don't want sex with him oh no. Rapist . Telling abput it is like call other white guy nigger on million eyes on you so."
  },
  {
    "rating": "4.5/5",
    "review": "Interesting movie with a shocking ending (****3/4)."
  },
  {
    "rating": "2.5/5",
    "review": "Simply a OK movie. Concept looks interesting looking for the sequel."
  },
  {
    "rating": "5/5",
    "review": "I loovveeee this movie. Unlike most of the viewers I found this so captivating and original and everything was so uncalled for and exiting. For all of you who found this dull: you have no imagination and should enjoy life more! I'd like to see you all make a movie or a story this extraordinary!!"
  },
  {
    "rating": "5/5",
    "review": "Best movie I have seen in a while. It feels like movies are getting more and more dull and unoriginal but this proved otherwise. It's so origininal and I've never seen a movie like this one. It's saddens me how it's so underrated because it deserves so much more. I'm glad that the haters have been ignored and that a third movie is being made. It's like people hate different. What I like the most is that everything is connected even the little elements and the ending was so uncalled for. This movie is even smarter than it thinks it is. I don't mind that some don't like this movie because you either see it or you don't."
  },
  {
    "rating": "3/5",
    "review": "Occasionally interesting, the way ten characters interact can be quite dull and therefore even the more brilliant actors or actresses become extremely dull. The plot is interesting and the performances also, however the film carries no message and the actual film itself is unenjoyable to watch. Some of its more talented cast, particularly Jesse Eisenburg, do not perform well at all and instead of complimenting the film they decrease it's enjoyment."
  },
  {
    "rating": "0.5/5",
    "review": "Has the illusion of an interesting movie and nothing comes of it. And that stupid kiss at the end. Bad"
  },
  {
    "rating": "5/5",
    "review": "Great Movie with an unforeseeable twist"
  },
  {
    "rating": "3.5/5",
    "review": "The movie wears its ethos right on its sleeve, and without little else up its sleeve beyond that. There's a lot of sleight of hand and misdirection, not much more than smoke and mirrors, but goofy, dumb fun nonetheless."
  },
  {
    "rating": "2.5/5",
    "review": "It's dumb as hell, but fun to make fun of if you're into that kind of thing."
  },
  {
    "rating": "4/5",
    "review": "Great film bar the last 5min. I was so expecting more. Up till that it was great"
  },
  {
    "rating": "1/5",
    "review": "this was big pagga or grosse pagga, weird plot twist at the end but you felt it coming"
  },
  {
    "rating": "3.5/5",
    "review": "Fast-paced and entertaining with only a few faults."
  },
  {
    "rating": "5/5",
    "review": "A really good movie!"
  },
  {
    "rating": "3.5/5",
    "review": "A fun, exciting film, that'll knock your socks off."
  },
  {
    "rating": "0.5/5",
    "review": "This movie thinks its way smarter than it is"
  },
  {
    "rating": "3/5",
    "review": "Watching this movie was like watching someone with ADHD tell a story: such unnecessary tangents. The bare minimum of entertaining to justify not turning off. The best part of the movie was how much Dave Franco kept getting shut down."
  },
  {
    "rating": "5/5",
    "review": "One Of My Favourite Crime Thrillers Of All Time!! Badass And Mind-blowing! Super Underrated!!"
  },
  {
    "rating": "5/5",
    "review": "This is one of my favorite movies. I recommend it to everyone"
  },
  {
    "rating": "1/5",
    "review": "Really disappointing."
  },
  {
    "rating": "4/5",
    "review": "The sequel is much better, but this was good too."
  },
  {
    "rating": "3.5/5",
    "review": "I was pleasantly surprised by this movie! It isn't perfect, but I had a lot of fun watching it. I thought it started out much better than it ended, but it was still very much worth watching. I would be able to watch this a few times for sure."
  },
  {
    "rating": "5/5",
    "review": "Best Movie In this genere"
  },
  {
    "rating": "3.5/5",
    "review": "A pretty decent movie which portrays 5 magicians who carry out bank robbery during their performances."
  },
  {
    "rating": "2.5/5",
    "review": "Meh, very snazzy, but what was the point...?"
  },
  {
    "rating": "3.5/5",
    "review": "Now You See Me stars a talented cast, has great visuals and the magic trick sequences are mind-blowing. However, it can be difficult to follow, the ending is idiotic, there isn't much character development and there is uneven editing in action sequences and I specifically mean ACTION sequences making it hard to see who's chasing who. Maybe that was intentional but come on, at least show some consistency instead of giving me a headache. Ok, fine, I like the movie a little more than most. But, then again, I've never been the best at criticizing movies though there were some I honestly really hated. One setback is that the film seems unsure of who its protagonist is. Is it the Four Horsemen or is it Mark Ruffalo? However, I still give credit for all the magic tricks and how the Horsemen are always one step ahead, even if things can be rather far-fetched. Didn't find the plot twists to be awful, though. Turn off your brain a little and this can be a passable, if uneven, caper movie."
  },
  {
    "rating": "0.5/5",
    "review": "Just horrible. These actors should be embarrassed for being in such a horrible movie. I really like most of these actors, but this movie does not work. I kept watching thinking it might get better, but it never did. You couldn't pay me to watch the sequel."
  },
  {
    "rating": "4/5",
    "review": "Now You See Me is a Mystery / Crime film, it's about four magicians who are brought together to form a group called the four horseman. They use the shows as ways to take money from the rich and give to the poor, this leads to the police playing a cat and mouse game with them trying to catch and arrest them for the crimes they are committing bringing in Morgan Freeman - who's character tries to show how famous magicians do their tricks - to help them out. All of the magic done in this film can actually be done in real life, apparently they had real magicians on set to help them perform the tricks. Whilst we are on the topic of the magic pretty much all of the tricks really blew me away and most of the best bits of the film came from when the four horsemen where on the stage delivering their tricks. This is most prominent in the second film in which not much of the film takes place on stage but whilst they are on stage it feels like something really special. However, this does not take away from the rest of the film, especially the second one which I personally believe to be the better of the two. The first film has an all star cast with the four horseman being played by: Jesse Eisenberg, Dave Franco, Woody Harrelson and Isla Fisher. I feel like these guys all had good chemistry which slowly built over the course of the film with the beginning having them be quite arrogant, thinking they are the best magician to the end of the film when they become a really close group. The film also stars Morgan Freeman as I have already said, Micheal Caine and Mark Ruffalo. The ending of this film comes out of nowhere and it really shocked me however, the second time I watched this it kind of seemed out of place and it wasn't really suggested at all throughout the movie so it kind of seemed like a twist for no reason."
  },
  {
    "rating": "1/5",
    "review": "A truly terrible film. By the time the twist at the end arrived I had lost the will to live. I was annoyed with myself for seeing it out to the end. please don't make the same mistake!!"
  },
  {
    "rating": "1/5",
    "review": "THEY MADE A SECOND ONE? Nope. Silly, lame, messy."
  },
  {
    "rating": "4/5",
    "review": "after long time watched a good movie... better than those 90+ ratings on rotten.."
  },
  {
    "rating": "3/5",
    "review": "It's no Ocean's Eleven but it's fun."
  },
  {
    "rating": "4/5",
    "review": "big divide between critics and people. I liked the movie :)"
  },
  {
    "rating": "0.5/5",
    "review": "This movie sucks and you suck for liking it."
  },
  {
    "rating": "5/5",
    "review": "Simplesmente sensacional. Os truques são incrivelmente bem pensados. Now You See Me usou o ilusionismo de uma forma inovadora e fantástica ao colocar os mágicos ilusionistas como ladrões de grande escala. Os truques que usam pra se safar e o modo como usam é perfeito. E aquele mind blow do final... foi de cair o queixo. Eu não esperava aquilo. Paguei um pau do caralho para aquela cena."
  },
  {
    "rating": "4.5/5",
    "review": "Fuckin amazing way better then it is rated"
  },
  {
    "rating": "3/5",
    "review": "SCOTT: (Dr. Scott Allison, Professor of Psychology, University of Richmond) Greg, now that we ve seen Now You See Me, now is the time to review it. GREG: (Greg Smith, Founder of Agile Writers of Richmond, VA) It was a fun movie filled with surprises. I enjoyed myself. SCOTT: Now You See Me begins with four street magicians eking out a meager existence. They are Daniel (Jesse Eisenberg), Henley (Isla Fisher), Jack (Dave Franco), and Merritt (Woody Harrelson). One day they are all summoned to an abandoned apartment by an unknown mastermind criminal hellbent on using their magic to pull off major heists. Calling themselves the Four Horsemen, they first appear to rob a French bank of millions of dollars during the middle of their Las Vegas act. When FBI agent Dylan Rhodes (Mark Ruffalo) and Interpol agent Alma Dray (Melanie Laurent) cannot prove their guilt, the Four Horsemen are free to perform their next act in New Orleans, where they plunder the bank account of their main financial sponsor, Arthur Tessler (Michael Caine). GREG: Scott, at first it appears that the heroes of this story are the four characters comprising the 4 Horsemen. But as the story evolves, it is clear that we are following Dylan and sidekick Alma in a classic buddy-cop movie with a twist. Veteran magician turned magic-debunker Thaddeus Bradley (Morgan Freeman) is following the Horsemen and warns Dylan that they will always be one step ahead of him. I was pleasantly surprised by this movie. What could have been a series of vaudevillian stage tricks turned awesome through the magic of CGI instead turned into a clever set of questions: How did they do it? What will they do next? Will they get caught? Who is the Fifth Horseman? I was kept guessing and it kept me involved from beginning to end. SCOTT: I was less impressed by the movie than you were, Greg. The entire film is one giant magic trick whose secret is revealed at the very end in a very gimmicky way. Yes, the performances of all the actors involved were fine, but there is no discernible hero in this story. At first, we are led to believe that the four horsemen are the heroes, but they are soon revealed to be mere pawns of the true agents of power in the movie. In fact, virtually every character in this film turns out to be a magician s prop or accessory. A likely candidate for the story s hero does emerge but then disappears like a cheap trick. We re left with a movie with a lot of sleights of hand but with a hand that is more than slightly empty. GREG: Gee, Scott, I d hate to see a magic show with you. I think the fact that all the tricks led to a surprising climax is what makes this a movie to see. There were a lot of well-known actors in this film. They all played their characters well. It s tricky to have so much star power in one film and not have one character take the lead. Director Louis Leterrier did a great job of balancing the lead characters so that everyone had equal time. As for the hero structure, Now You See Me plays a straight cop/chase/thriller until the very end. It is a great bit of misdirection that the suspicions jump from player to player before a final twist. And it is the breaking of the rules that makes this film entertaining. I have to admit that I was suspicious of who the mystery character could have been, but I didn t put it all together before it was dished out for me in the final scenes. And that is what makes a great mystery great. SCOTT: I think you ve put your finger on a lot of the good qualities that this movie has, namely the performances of several iconic actors (e.g., Morgan Freeman and Michael Caine) and a series of magic tricks and crime scenes that leave us wondering, How d they do that? I concede these points and I recommend Now You See Me to people who are infatuated with magic shows. But when I see a movie, I want to witness a story that has depth beyond a mere gimmicky ending, which I believe this movie disappointingly delivers to us. The movie fails as a mystery because there were absolutely no clues for us to figure out The Big Reveal at the end. The film is basically a two-hour long magic trick, and while it s not a bad magic trick, I found myself wanting more. GREG: Fair enough, Scott. I went into the movie expecting a two-hour long magic show and I wasn t disappointed. I ll grant you that you won t see a particular character have overcome a major internal flaw (or do you?). But when I go to see a magic show, part of the fun is trying to pit my intelligence against that of the magician. I try to see if I can figure it out and overcome the deception. I got that feeling while watching Now You See Me. Penn & Teller used to do a show where they would take a well-known magician s trick and expose it for all to see. The viewers were given all the gory details of how the trick was prepared for and then executed. Then, they would perform that trick live in front of a studio audience. What was amazing was that even after knowing how the trick was done, the audience was still in awe because the performance of the trick was so expertly performed that you were still amazed. That is what Now You See Me brought to the screen for me. So, for an entertaining show that didn t disappoint both in story, execution and magic, I give Now You See Me 4 out of 5 Reels. And for an atypical but still enjoyable hero story following FBI Agent Dylan Rhodes through the maze, I give it 3 out of 5 Heroes. Movie: Heroes: SCOTT: Greg, I completely agree that there s something powerful about watching a live magic show. Notice I said live . Watching magic tricks performed in the movies, where CGI effects rule, is not nearly as interesting. I recommend Now You See Me for diehard fans of magic and for fans of Morgan Freeman, Michael Caine, Woody Harrelson, and the other fine actors here. The movie itself is a thin slice of white bread. I give it 2 Reels out of 5. As for the hero of the story.... there wasn t one. Yes, there were characters in this movie but no reel heroes who underwent a journey or who changed in any significant way. I can almost buy the argument that there was one character who approximated a hero, but by the film s conclusion this character, as we knew him or her, magically disappears. For that reason, I m giving this movie only 2 Heroes out of 5. Movie: Heroes:"
  },
  {
    "rating": "3.5/5",
    "review": "I really enjoyed this movie it's pretty freaking cool and innovative."
  },
  {
    "rating": "1/5",
    "review": "Like watching a bag of hot garbage."
  },
  {
    "rating": "2/5",
    "review": "You know that moment in every heist movie where they suddenly reveal that they tricked you? \"It was that person all along!\" or \"Wait...that's what happened?\" Well, this is just scene after scene of those moments. For an hour or so that can be pretty fun, but the tricks played on the audience during this film got more and more implausible (and eye roll inducing, honestly). There is nothing wrong with messing with the crowd a bit, but you should probably respect an audience more than this. Also, seeing this cast waste their talents on cute drivel was a major bummer."
  },
  {
    "rating": "3/5",
    "review": "\"Now You See Me\" is fast paced, subversive fun, but it's substance vanishes into thin air as soon as the credits roll."
  },
  {
    "rating": "4/5",
    "review": "Kept me wondering the whole time. Watched with Ashlee. 7/16/17"
  },
  {
    "rating": "0.5/5",
    "review": "very boring and senseless"
  },
  {
    "rating": "4/5",
    "review": "Minor flaws ignored, Now You See Me is a fantastic thriller-action hybrid, boasting a talented cast and endless plot twists."
  },
  {
    "rating": "3.5/5",
    "review": "I was disappointed with this when I first saw it due to not liking the ending. I still don't really dig the twist but the ride to get there is a lot of fun. The magic is cool and it's pretty exciting throughout."
  },
  {
    "rating": "3/5",
    "review": "Not bad at all... It's not easy to follow, but spectacular and attractive, and the revelations at the end make everything have a logical sense."
  },
  {
    "rating": "3/5",
    "review": "Flashy, sleek, and sexy, Now You See Me hides a thin plot behind cool magical efforts and largely succeeds at an entertaining ride."
  },
  {
    "rating": "3.5/5",
    "review": "You really need to concentrate when watching this picture! Sometimes it is a bit unlogical and fast moving, but then again it is gripping and exiting!"
  },
  {
    "rating": "4.5/5",
    "review": "I thoroughly enjoyed this movie. I honestly did not figure it out, and that is rare for me. Four magicians/illusionists basically team up to become Robin Hood - stealing from the rich and unworthy and giving to the poor and bamboozled. The magicians are fun loving and likable, but I would have preferred getting to know them better. A few twists to keep things interesting, with the major reveal actually surprising me."
  },
  {
    "rating": "3/5",
    "review": "Enjoyable fun, however it's a shame that movie special effects were used to do some of the 'magic' rather than keeping it real."
  },
  {
    "rating": "4/5",
    "review": "Great Concept. Modern Day Robin Hood! Biggest Pro: Re-watchable Biggest Con: More character development"
  },
  {
    "rating": "2.5/5",
    "review": "Lame overstated acting from what should be a reasonable cast is disappointing. The plot is ludicrous and nonsensical. Just shoddy but easy to watch if you switch mind right off."
  },
  {
    "rating": "5/5",
    "review": "This was the best movie I had seen in theaters from Hollywood in a LONG time. I left the theater happy and feeling like I had just been entertained. Hope to see more movies from Hollywood that get back to entertaining audiences."
  },
  {
    "rating": "4/5",
    "review": "I thought it was a good movie. Full of twists."
  },
  {
    "rating": "3/5",
    "review": "Nowhere near as smart as it tries to make you believe it is, but an entertaining enough romp nonetheless."
  },
  {
    "rating": "0.5/5",
    "review": "A stupid, pretentious, nonsensical movie that made me waste two whole hours of my life."
  },
  {
    "rating": "1/5",
    "review": "Stupid and pretentious."
  },
  {
    "rating": "3/5",
    "review": "Really fun and clever film."
  },
  {
    "rating": "5/5",
    "review": "Awesome film. Loved it."
  },
  {
    "rating": "2/5",
    "review": "Simply hideous. 4 magicians get together for reasons that are totally unclear for a stupid three tiered magic trick. They fool everyone, the police, the public, everyone. Character arcs are spoken of, and are instantly forgotten about. This movie is 2 hours long, but it feels like it should have been 4 just to explain everything going on, A complete waste of time."
  },
  {
    "rating": "4/5",
    "review": "A sleek, sneaky and fast-paced thriller that will leave your pulses racing long after it's over. It's that good!"
  },
  {
    "rating": "4.5/5",
    "review": "A very deceptive and confusing but straight-forward movie. The drama and tension between characters was a charm to see. I loved how much you had to pay attention to detail or examine the characters carefully in order to not be miss-leaded. And that’s brilliant! The anonymous mystery behind the story added quite a bit of texture to the plot, as well as the constant suspense and plot twists. All in all, a fantastic and really well made film. So good that I am super keen to watch the next movie. :)"
  },
  {
    "rating": "4.5/5",
    "review": "its a really great film frankly i am starting to think that rotten tomatoes is broken"
  },
  {
    "rating": "3/5",
    "review": "Hmm. It's alright but not as clever as I expected. No Isla Fisher in the next one so probably won't bother"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie! Love the twists"
  },
  {
    "rating": "3/5",
    "review": "It's a fun nonsensical flick"
  },
  {
    "rating": "2/5",
    "review": "Lots of fun chase and spectacle, but more holes in the logic of the movie than in swiss cheese."
  },
  {
    "rating": "2/5",
    "review": "This is a film that cannot exist without CGI - as the plot relies so heavily on the absurd. A popcorn film that wants you to believe its way smarter than it really is - even the Mark Ruffalo character's revelation can be seen a mile away. In the end, you don't really buy it."
  },
  {
    "rating": "3/5",
    "review": "Un film tutto sommato apprezzabile che nonostante molte incertezze riesce comunque ad intrattenere con facilità."
  },
  {
    "rating": "5/5",
    "review": "Now You See Me offer a magical adventure for the audience to be taken on as four magicians are brought together to conduct some amazing feats of magic while the FBI are hot on their tails. With a brilliant cast, lovable characters, a great plot not to mention a few unlikely twists along the way, this is a film definitely worth watching."
  },
  {
    "rating": "3.5/5",
    "review": "Fun and full of twists and turns. Worth watching a second time."
  },
  {
    "rating": "3/5",
    "review": "Es divertida por lo que es, por querer ver los trucos de magia y por quÃ (C) lo hacen, pero despuÃ (C)s de un tiempo los trucos ya no se ven como trucos sino como magia real y no es lo que esperaba, el final me sorprendiÃ³ eso mejorÃ³ la pelÃ­cula."
  },
  {
    "rating": "3/5",
    "review": "It's a good movie and all, but it's forgettable"
  },
  {
    "rating": "2.5/5",
    "review": "Upon first viewing this film, it manages to succeed at being an entertaining and funny commentary about the arts of magic, despite its clumsiness to telling the story. However, just like a real magic show, once we've learned all of the magician's secrets, it becomes completely pointless to ever see it again. Oh and don't get me started on that dang romance subplot that is shoehorned into this film. Hollywood at its most obvious."
  },
  {
    "rating": "3.5/5",
    "review": "Wild ride, enjoyable entertainment....fun!"
  },
  {
    "rating": "3/5",
    "review": "Though I liked the sequel much more than this first go-around, it's still a decent-enough watch."
  },
  {
    "rating": "1/5",
    "review": "Una bazofia de película!"
  },
  {
    "rating": "3/5",
    "review": "Magic is all about misdirection, and this movie leads you to believe you are watching a crime thriller but instead the big reveal is that it's a romcom. Fuck."
  },
  {
    "rating": "2/5",
    "review": "Woody Harrelson plays it well, the remainder are wasted & dear oh dear does it think it's clever."
  },
  {
    "rating": "5/5",
    "review": "The BEST Movie ever!!!"
  },
  {
    "rating": "4.5/5",
    "review": "It makes everybody believe in magic. Nobody could of suspected the twist in this movie. It makes people want to do magic and learn all the tricks of it."
  },
  {
    "rating": "1/5",
    "review": "Seriously? Unless you are under 8 years old and have no idea how good stories are developed, character development , or just all around originality do not watch this movie. Yes, it has big actors and modern technology so there are some funny parts and cool CG but unless you also watch Barney on Saturday mornings .... PASS"
  },
  {
    "rating": "4/5",
    "review": "Fun movie, lots of magic and action."
  },
  {
    "rating": "3/5",
    "review": "I missed a good magicians movie. Positives: Jesse Eisenberg, Dave Franco, Morgan Freeman. Negatives: A bit slow, at times it felt too long."
  },
  {
    "rating": "2.5/5",
    "review": "Grossly overrated; do tricks just to join the eye? FBI agent was fifth member all along"
  },
  {
    "rating": "3/5",
    "review": "This movie makes its purpose very clear. Have good visuals and keep you on the edge, which I think is accomplished."
  },
  {
    "rating": "3/5",
    "review": "It's alright. The story could've been cleaned up better."
  },
  {
    "rating": "4/5",
    "review": "Con men/magic. It's excellent 4/5"
  },
  {
    "rating": "5/5",
    "review": "Interesting exciting movie overall, loved it!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie seemed like it was made for little kids. I want to say it was made for six year olds but that feels offensive to six year olds. An hour in, there was nearly no back story, no information to hint that Art is a corrupt business man until the BIG REVEAL that he is. . Epic waste of my time. We didn't finish it. And we rented the 1st one AND the 2nd one because the trailers were another one of the magicians tricks leading global me to believe they were gonna be good."
  },
  {
    "rating": "3.5/5",
    "review": "Decent magician film. Best thing about this movie is Isla Fisher."
  },
  {
    "rating": "3/5",
    "review": "I mean it doesn't make a a lot of sense writing wise, and its very hammy, but pretty fun to watch."
  },
  {
    "rating": "2/5",
    "review": "Kinda hokie pokie. They are trying to tell what would seem like a good story but turns out to be a little more show then go."
  },
  {
    "rating": "4/5",
    "review": "I thought it was great!"
  },
  {
    "rating": "2.5/5",
    "review": "Was trying to review the sequel but this movie is ok."
  },
  {
    "rating": "3/5",
    "review": "Too many twists and turns on this ocean's magic"
  },
  {
    "rating": "3.5/5",
    "review": "It's a good movie mostly for entertainment not for a great story at all."
  },
  {
    "rating": "5/5",
    "review": "I love both 1 and this one. I hope y'all make a 3. My mom and I love it. You should watch this."
  },
  {
    "rating": "2.5/5",
    "review": "Generic film that thinks it's fun and then throws some ridiculous twists and turns in"
  },
  {
    "rating": "5/5",
    "review": "A good movie full of amazing magic tricks."
  },
  {
    "rating": "1/5",
    "review": "Awful. Cheesy jokes, boring, just bad."
  },
  {
    "rating": "4/5",
    "review": "fun,exciting and brilliant acting"
  },
  {
    "rating": "4.5/5",
    "review": "It's one of few movies which I enjooooyed every moment of it .. super fantasy"
  },
  {
    "rating": "5/5",
    "review": "Very well paced, hilarious and a suspenseful mystery that leaves you guessing till the end."
  },
  {
    "rating": "4.5/5",
    "review": "Mesmerizingly captivating and completely entertaining!! Can't wait to enjoy the 2nd."
  },
  {
    "rating": "5/5",
    "review": "Loved this movie.... Watched it twice back to back."
  },
  {
    "rating": "2.5/5",
    "review": "Killer points were the hastily shoved in love story at the end and the unsubtle attempt at a Prestige style twist."
  },
  {
    "rating": "5/5",
    "review": "very entertaining movie"
  },
  {
    "rating": "3.5/5",
    "review": "The movie was very promising while watching it. It was captivating and the storyline was so good!... until you get to the twist. the \"twist\" or the \"big surprise\" is so out of mind and doesnt make sense. its so shocking because there were no clues in the movie to lead up to the 'big shocker' The movie thus point was still good enough for entertainment at the very least."
  },
  {
    "rating": "4/5",
    "review": "Even if it's start as a plain movie it gets really cool at the second part of it, the twists are actually unexpected and the lack and change through the movie of heroes and villians make this a tasteful film."
  },
  {
    "rating": "4/5",
    "review": "how did we miss this this first time round? cracking!"
  },
  {
    "rating": "4.5/5",
    "review": "Brillant ! Reminds me of oceans eleven , with an unexpected final, probably the only magician movie I truly enjoyed. Jesse eisenberg delivers a strong performance out of his ordinary odd sociopath kind of role , this is one movie that I am really looking forward to the sequel ! It kept me entertained from start to finish !"
  },
  {
    "rating": "0.5/5",
    "review": "First of all, these aren't wizards, but prestidigitators. Now, these cheap tricks surprise, I think, only the unwary. It's a too commercial movie, nothing really deep or worthy. Good for the riffraff. Otherwise, it's extremely boring."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies I've ever seen a must see, and the movie is just awesome. A 10 out of 10 movie! So good I bought it on DVD."
  },
  {
    "rating": "4/5",
    "review": "A fun Magic-Themed, Robbery-Heist movie which makes you wanna watch more of the film if we can just ignore the climax park scene [Spoilers Duh..!]."
  },
  {
    "rating": "5/5",
    "review": "I thought it was pretty great"
  },
  {
    "rating": "3.5/5",
    "review": "Not bad. I was enjoying watching this movie very much ;)"
  },
  {
    "rating": "3/5",
    "review": "Summer entertainment. Illusions and tricks. Cheesy plot and no great acting. Yet fun to watch and enjoy the view."
  },
  {
    "rating": "5/5",
    "review": "a lot of the critics found the movie hard to follow and drilled the movie based on that and the script, i found it pretty easy to follow... dont know why this only has a 49%"
  },
  {
    "rating": "4/5",
    "review": "I wasn't sure what to expect, but I really enjoyed this one. Great twist in the plot!"
  },
  {
    "rating": "3/5",
    "review": "With an incredible crew this film is an entertaining journey of magical and misterious things"
  },
  {
    "rating": "2/5",
    "review": "Apresenta uma trama forçada até não poder mais, cheia de furos, e com nenhum personagem interessante."
  },
  {
    "rating": "5/5",
    "review": "That film is one of my favourite films (I only have four), I'm a Spanish speaker and that is my first critic in English, please don't judge me. First we have an excellent cast with Woody Harrelson, Jesse Eisenberg, Mark Ruffalo, Michael Caine, Morgan Freeman... Also we have an perfect and realistic plot. Finally, that film is a film that play with you all the time because you get an idea during the film and finally the film fuck that idea and put another more different. For me that film is the new \"The Sixth Sense\""
  },
  {
    "rating": "1.5/5",
    "review": "I can't believe people gave this movie a higher than mediocre rating and it really mystifies me that they made a sequel to this piece of dog doo. The direction is terrible, the acting is terrible, the entire plot is hinky and doesn't make a lot of sense, the dialog felt artificial, and every plot development was predictable except for the big reveal which felt like a last minute decision and could have applied to anyone in the story. Added to that, I was often bored to tears during the magic shows scenes which went on and on needlessly. The special effects were okay but since the invention of CGI, I don't particularly think the effects in the film were all that impressive. If you enjoy good film this is definitely not for you. But if you like simple films that you doesn't make you think, then you my love it."
  },
  {
    "rating": "5/5",
    "review": "Mind blowing in every way. It's fun and makes you think at the same time. A truly great family movie."
  },
  {
    "rating": "2/5",
    "review": "Makes you say \"bullshit\" audibly at least a dozen times....Ruffalo mails it in, Eisenberg plays Zuckerburg as a magician, Franco is kinda turdish. Woody is great, can't save a bad movie, though."
  },
  {
    "rating": "3/5",
    "review": "Now you see me is one of those dumb but enjoyable films. For FBI agents they really aren't very clever and although I like the idea of the twist, looking back at it, there are no implications to suggest it and it almost doesn't make sense. Eisenberg and Harreleson give great opposite performances and they have great chemistry but the other two of the group, Franco and Fisher don't offer much at all. As for Michael Caine and Morgen Freeman, it's a pay heck movie for them and it doesn't seem like they care much. It looks visually stunning and it is actually incredibly entertaining at times."
  },
  {
    "rating": "4/5",
    "review": "Messy but a fun time."
  },
  {
    "rating": "3/5",
    "review": "Much more showy and pretentious than it needs to be, and much less clever than it thinks it is, Now You See Me still manages to be fairly entertaining. The premise of four magicians pulling off several huge heists, much to the chagrin of the chasing detectives is a fairly nice idea, and would have really suited a campy 60's esque vibe. Instead we get mid noughties flashy effects and cgi, and precious little substance. For the first half of the film at least I found the 'four horsemen' to be fairly unlikeable, mostly strange casting choices, and all with huge ego's to bash against each other. But to be fair I still managed to glean a fair amount of enjoyment once things started to come together. I'd probably give the sequel a punt, but with the main event complete where could you go from here?"
  },
  {
    "rating": "4.5/5",
    "review": "I absolutely LOVE Now You See Me, it's a awesome movie with intriguing characters. It had such a surprising ending, and the tricks were so clever. I don't understand why some people dislike it, but, I'm only one person, and I only have my opinion. In conclusion, Now You See Me is an incredible movie with great actors and great characters and a great plot."
  },
  {
    "rating": "1.5/5",
    "review": "This film really pisses me off. It's all so 'grand' and 'mind-blowing', but creates a structure of cringe that runs from your head, (mostly in your head to really piss you off) then increases a pressure of annoyance throughout your body. Jesse Esiseoinsdgosbberg talks at the same pace as a turkey on crack. Ok, the special effects and lighting aren't too bad, however, they did remind me of Michael Bay films, which are... Overall it has left me praying that I'll never end up seeing you again."
  },
  {
    "rating": "2.5/5",
    "review": "This silly, a bit dumb magician flick is not thwarted with it's campyness, in fact, it benefits from it, what it does fall short to is a lack of a focused narrative, and an ending plot twist which does not come of as shocking, but rather stupid."
  },
  {
    "rating": "4/5",
    "review": "Everyone loves magic tricks. The wonder has been ingrained in us since our childhood. And movies about magic are usually just as enjoyable. This one is no exception. Four individual magicians--each with a different specialty--get summoned by some mysterious master magician to join together and perform \"tricks\" to steal from the rich and give to the poor. Meanwhile, a frustrated FBI agent, played by Mark Ruffalo, can't seem to figure out how it's all happening. He teams up with a female Interpol agent (Melanie Laurent) to put a stop to the madness. The dynamics among the magicians are fun and kept very light. The tricks they perform are, at times, very fascinating to the point that we wish we could go to Vegas to watch their show. We become invested in the lives of these people because the writers let us. But then something happens--our focus is forcibly changed. For the last 60-90 minutes we are pretty much solely focused on Ruffalo's character. We don't want to be, but we are. And as we travel deeper into the story, the befuddlement steadily increases. Luckily, the film makes itself fairly easy to focus on to somewhat help negate the convolution. It helps to rewatch this movie. But then again, seeing behind the curtain--which is the ending--may cause you to feel like you've been manipulated. Realizing the filmmakers trick you into seeing what they want you to. And depending on how much you like magic tricks, you may or may not be happy about it. But see, putting together a movie is different than live magic tricks. Filmmakers can make up their own rules, using cuts and edits to change your perspective--not slight-of-hand--making much of it feel contrived. Personally, I wouldn't say that it bothers me. It just feels too easy here. We do get a good bang four our buck with plenty of subplots. There is one about Morgan Freeman who plays a magic debunker smugly trying to crack these elaborate tricks. He has a rivalry with Michael Caine, who acts as a financier for the magicians' performances. Caine exits about an hour in, but Freeman has much left to accomplish. And amidst all the action, there is an obvious romance building between Ruffalo and Laurent. But all of the story-building amongst the characters only helps to thin them all out in the process. There is little depth. And the depth that's established feels forced. Mind you, none of this changes the fact that this film is wildly entertaining. How can you call it anything but? It's gripping from beginning to end, and the way it's set up, you will probably end up wanting more. Give it huge points for that. Beyond that, though, I can see why people feel slighted. Twizard Rating: 84"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie and had to rewatch it after I saw the sequel and I still love this movie. Its so well crafted. I really dont understand critics in Rotten Tomatoes..."
  },
  {
    "rating": "5/5",
    "review": "Great magic movie loved the car chase and everything"
  },
  {
    "rating": "3/5",
    "review": "Louis Leterrier es un director altamente irregular. Sus trabajos oscilan entre entretenimiento de calidad (\"Danny The Dog\", \"The Incredible Hulk\") a basura insoportable (\"The Transporter\", \"Clash Of The Titans\"). Afortunadamente, \"Now You See Me\" trata de apuntar a la primera categoría: es una cinta divertida de principio a fin y con un elenco de primera clase (Mark Ruffalo, Jesse Eisenberg, Woody Harrelson, Morgan Freeman) acerca de unos magos que pretenden hacer justicia social, vengándose de los ricos y explotadores. Para estos tiempos de crisis, la película, además de entretenida, es pertinente."
  },
  {
    "rating": "5/5",
    "review": "I thought it was an excellent, light hearted action-adventure/thriller. I would describe it as a modern Ocean's Eleven. Not even a little sure why the critics think it sucks."
  },
  {
    "rating": "2.5/5",
    "review": "It really loses its magic when we know movies are so very fake. If it was a live performance sure but its just too easy. Kind of boring, Catch Me If You Can meets Oceans 11 meets The Illusionist. Cardboard cutout characters. Kind of neat but I'm not sure what the tone was supposed to be. Ending was too long. I already forgot it."
  },
  {
    "rating": "3/5",
    "review": "Spoilers: The logical part of me didn't even want to see this because the whole appeal of magic comes from the live performance and the fact that they don't have CGI and editing to help them. But as it turns out the movie is more about watching the police try to find out how they did the trick rather than the trick itself being what we're supposed to be impressed by. I will say they used CGI three times in which it was incredibly jarring and I felt completely unnecessary. The twist was fine. It seems like it makes sense but it suffers for two reasons. The first is that Hollywood assumes that we instantly care about Morgan Freeman, so they don't bother putting any work into developing his character -- the same mistake made by the movie, Oblivion. And the second is that they use the Scooby Doo formula. Unlike in real life where you have 7 billion suspects, this movie only has 2 characters whom the perpetrator could be, and one of them is Mark Ruffalo who is always a good guy and who you saw as a detective in Shutter Island, so you just assume it couldn't be him. And then when it is him, that completely shifts who the protagonist is to Morgan Freeman, this character who no one really cares about. And it also means, much of the time when Mark Ruffalo's character is acting like a good cop, just trying to figure out the case and no one's watching, that he's only doing that for us, the audience, which feels a little stupid. But it's a fun movie I guess. Good car chase. I'll watch Woody Harrelson in anything. Don't go out of your way to watch it but it's not as bad as it looks."
  },
  {
    "rating": "3.5/5",
    "review": "Now You See Me is a great action heist movie, with a great performances of the cast, amazing magic trick, and also twisty plot, but it lacks its storyline, and the ending that leaves the questions to the Audiences."
  },
  {
    "rating": "5/5",
    "review": "I though it was Very clever movie the way all the pieces go together and to see that big reveal in the end! I loved it and is now my favorite movie"
  },
  {
    "rating": "2/5",
    "review": "well acted laughable nonsense that's absolutely implausible"
  },
  {
    "rating": "5/5",
    "review": "It was a good movie. :) I liked it."
  },
  {
    "rating": "3.5/5",
    "review": "A star stuffed movie, with non stop climax, this movie gives out lots of entertainment value, but lacks depth."
  },
  {
    "rating": "0.5/5",
    "review": "Nonsense. Wastes such an incredible cast."
  },
  {
    "rating": "2/5",
    "review": "I just didn't get this film. Are we meant to believe they are good stage magicians or are they actually using magic? I did like Ruffalo in this film but struggled with the smarminess of the others throughout."
  },
  {
    "rating": "5/5",
    "review": "Love these movies, only get better. I hope they make more!"
  },
  {
    "rating": "2.5/5",
    "review": "Cool style. Stupid story. It's like the writers knew the twist but really struggled to write around it and get there. It's the kind of movie that's okay, but you forget about it 5 minutes after the credits start to roll."
  },
  {
    "rating": "4/5",
    "review": "Really good, but it was easy to figure out the end of the story. That was probably the point but the clues stood out to easily. MAKE IT HARDER!!"
  },
  {
    "rating": "2.5/5",
    "review": "This is a very disappointing movie. It's a movie filled with great actors who try to play some badly written and underdeveloped characters. It works for Mark Ruffalo and Isla Fisher who manage to bring some life into their characters, but for everyone else, we are mainly entertained because they are actors that we know and love. There are some good things, for example the scenes where the Four Horsemen are performing their acts, which are scenes that I really like and I think that Louis Leterrier really directed those scenes very good. There are several action scenes that are really poorly done and there is also a twist in the movie that was so bad and had no setup at all during the entire movie. This is a movie that had potential to be a great movie, but it didn't really work out that way, unfortunately."
  },
  {
    "rating": "3/5",
    "review": "A little stumbly plot and a an almost distracting number of stars in the movie, but a decent pace and energetic film (magicians/acts) make it a watchable flick."
  },
  {
    "rating": "3/5",
    "review": "It was a lot better the first time I saw it. There was more surprise because I didn't know what was coming. The Four Horsemen are great! There characters are great, and all four of the actors give great performances! But they seemed to not be used enough, well, or maybe both. It kind of seemed like they took a backseat to everything else. But when their on screen, they have such great chemistry, and just energize the movie! The pacing is actually fine. There were a lot of scenes that could have been shortened or removed completely, which made it feel longer than it was. They made you think the movie was just about these magicians, and the FBI trying to prove their bad and catch them, which ended up being fine, but it made it a little hard to watch. In the end, I liked how the story wrapped up enough to say that it's worth watching, at least for free."
  },
  {
    "rating": "3.5/5",
    "review": "\"Now You See Me\" is a fun magician film, albeit not as clever as one would hope, with a great cast and some awesome magic tricks."
  },
  {
    "rating": "4/5",
    "review": "75% Now You See Me overcomes its scattered plot and confusing plot holes with awesome magic tricks and action."
  },
  {
    "rating": "3/5",
    "review": "Goofy nonsense, with tricks that are absurd in overcomplexity. But kinda fun, and there's magic, and that's enough. BUT, and this is a big but, I could NOT have handled this on the big screen. The camera motion was nauseating. Take Scorsese swooshing around, and mate it with Tony Scott cutting. Ick."
  },
  {
    "rating": "3/5",
    "review": "Now You See Me was a fun movie to watch, but I never really got into it until the final act. The characters are flat and boring, they aren't characters that I want to cheer for. On the other hand, I had a great time watching the movie and thought it was a pretty fun and exciting movie to watch."
  },
  {
    "rating": "4/5",
    "review": "I liked this film a lot - though I do love magic."
  },
  {
    "rating": "5/5",
    "review": "Great movie, great cast!"
  },
  {
    "rating": "4/5",
    "review": "Although it's missing a positive revolution with the answers you seek, there's still much to love about 'NYSM'. In a way, the mystery of these questions are all part of the larger magic act that I hope to see unfold in its sequel."
  },
  {
    "rating": "1/5",
    "review": "the best thing I can say about this flick is that it has all the necessary parts needed to make up a movie. the story is forgettable & the stage magic is a digital disappointment"
  },
  {
    "rating": "5/5",
    "review": "This was a great movie full of several plot twists. I loved it and highly recommend it."
  },
  {
    "rating": "4/5",
    "review": "flashy and sassy, like a more cheeky ocean's 11."
  },
  {
    "rating": "3/5",
    "review": "To me it felt like Now You See Me didn't really have a storyline like most movies. It didn't have a red thread or a beginning, middle or end like you're used to. It just felt like it kept going without it really having a goal, without it leading anywhere, but it managed to be entertaining nonetheless."
  },
  {
    "rating": "4/5",
    "review": "Idk guys, I just really liked the movie, okay?"
  },
  {
    "rating": "3/5",
    "review": "It had a good star cast to support an average script. More importantly, one needs to be tuned till the end, to see the twist. However, the reason I watched this movie was because someone told me Shahrukh Khan Starrer, \"Happy New Year\" was based on this Hollywood flick. It was an average movie, with a great star cast, and original locations."
  },
  {
    "rating": "3.5/5",
    "review": "Enjoyable but a bit predictable. Still interested in the sequel."
  },
  {
    "rating": "5/5",
    "review": "This movie is a fun summer action flick with a pinch of comedy. If you're expecting realism back off. The magic and the heists are cool and the story is strong if not a little bit short on story. The twist is pretty good and it has a satisfying ending to it. There is sequel baiting, but if you're watching it right now, you shouldn't be too upset about it since the sequel is coming June 4th and I know I'm seeing it."
  },
  {
    "rating": "1.5/5",
    "review": "An all-star flop. Only solidifying the theory that the more A-listers you have in a film the less of a plot you need. The first time I watched it, it was in fact very enjoyable nothing amazing but enjoyable. The next time I saw so many plot holes that it made me feel stupid \"How didn't I see that\" Admittedly when you have seen it once the film will be ruined because of the twist at the end but the twist is also disappointing."
  },
  {
    "rating": "4/5",
    "review": "Enjoyed the movie with a drop of a hat, It's cool just seeing a bunch of magic tricks go together in one full movie. Score: 9/10"
  },
  {
    "rating": "3/5",
    "review": "Yo dawg, I hear you like twists, so we put twists in yo twists...in some more twists...in this film about twists."
  },
  {
    "rating": "2.5/5",
    "review": "A heist film that takes a different approach tham usual heist films. The film revolves around the 4 Horsemen utilizing magic to pull off huge heists. I'll be honest, this film kind of bored me a bit. It has a great concept, but the story just isn't there. Its very complex and I feel it thinks it is smarter than it really is. The cast is top notch and they all did a great job for what they had to work with. It wasn't terrible, but my friends told me it was really good and I was really looking forward to it. It has a couple good plot twists and cool magic tricks, but in the end, I was let down by this"
  },
  {
    "rating": "5/5",
    "review": "LOVE THIS MOVIE!!! CAN NOT WAIT FOR #2!!!"
  },
  {
    "rating": "3/5",
    "review": "360 shots goes round and round, round and round"
  },
  {
    "rating": "0.5/5",
    "review": "Just not as good as people say it is. It is like a poor magic show but only a movie."
  },
  {
    "rating": "4/5",
    "review": "A quartet of magicians is brought together by a mysterious fifth party who manipulates them (they willingly submit to it; their reputations skyrocket as a result of their collective exploits) as they create ever more outlandish illusions, all of which seem to have a criminal aspect to them. FBI and Interpol become interested, which only increases the quartet's notoriety, which in turn attracts the attention of a cynical mythbuster (Morgan Freeman). All of the strong, intelligent personalities involved make for a complex narrative with multiple simultaneous plotlines. The visual effects are spectacular, matching the mindblowing concepts behind the staged illusions for creativity and entertainment value. Jesse Eisenberg (The Social Network) continues to corner the market in playing intense, standoffish geniuses, and is the standout performer in a very strong cast. The ending is unsatisfactory, but largely because what has come before is so powerful - it's hard to see where else the script could have gone but where it does. (Review first seen on pArticipate - www.brucedennill.co.za)"
  },
  {
    "rating": "3.5/5",
    "review": "Now You See Me is a movie where the directors want you to believe in a prophecy, as well as vfx magic tricks. It has potential, but that could have been used to further explain the prophecy's and so on, but it rather wants us to just believe in a prophecy and some vfx magic tricks. I hope that the sequel further explains the prophecy or else this will be another vfx filled magic movie series."
  },
  {
    "rating": "3.5/5",
    "review": "Good. I enjoyed it. Fun movie. Only oddity is that whole eye shabang retarded thing."
  },
  {
    "rating": "4/5",
    "review": "Highly enjoyable movie. If it was not for the ending!"
  },
  {
    "rating": "1.5/5",
    "review": "Very boring, with a plot that really doesn't make any sense by the end. Waste of a great cast."
  },
  {
    "rating": "4/5",
    "review": "très bon, j'ai hâte de voir le 2"
  },
  {
    "rating": "4/5",
    "review": "The idea of magicians as criminals was a good way to make a movie sound good, And for most of the film it is but mixed in with its clever ideas and set pieces cracks appear and it's the ending what does it, Yes it was a great twist but we expected something more imaginative just like the rest of the film and it really didn't fit in with the rest of the movie, All the cast were great and it is a clever movie but it tries to be too clever at times."
  },
  {
    "rating": "2.5/5",
    "review": "The visuals are astounding and the four horsemen are played fantastically well (for the slightly unsatisfactory amount of screen time they get), but all the characters need more depth than the constantly playful treatment they get, and the plot is too scattershot to support its big twist."
  },
  {
    "rating": "3/5",
    "review": "Amid mixed reviews, I actually quite enjoyed 'Now you see me'. First and perhaps foremost, the idea was unique and inventive. Never before had I watched a film based primarily around magic and illusion. Whilst some of the tricks were far fetched and unrealistic, those that were explained were clever and interesting. The cast complemented each other quite well, without delving too much into each of their backgrounds and personalities. Whilst it wouldn't win too much praise for an intense, engaging storyline, it sufficed in being an entertaining watch."
  },
  {
    "rating": "5/5",
    "review": "Even magic can trick the FBI! Awesome movie."
  },
  {
    "rating": "1/5",
    "review": "A convuluted mess of a heist movie that tries soooo hard to build a universe (Franchise). Needlesy complicated and with the most irrelevant love story"
  },
  {
    "rating": "5/5",
    "review": "This is my favorite movie Have fails of course, but I recommend ;D"
  },
  {
    "rating": "2.5/5",
    "review": "Could've been a great movie, but why force the irrelevant romance angle?!?"
  },
  {
    "rating": "2/5",
    "review": "Begint goed, maar verandert dan in een slechte en ongeloofwaardige actiefilm met een stomme finale."
  },
  {
    "rating": "2.5/5",
    "review": "WHAT I LIKED: It's fast paced, luxurious and well-scored cinema that offers bags of mystery and smiles. The characters are brought to life well with great acting too, but mainly it's pure, simple indulgence. WHAT I DIDN'T LIKE: Except simple it isn't, for the confusing plot and constant flitting about mean it looses impact. That's a particular problem where the tone is concerend; one minute it's tense, another it's dull and stagnant, and as a result it's all actually rather dissengaging overall. VERDICT: I imagine 'Now See Me' rather like a stereotypical bimbo... dazzling and exciting on the outside, but dull as dishwater on the inside. Shame it managed to fool so many great stars."
  },
  {
    "rating": "5/5",
    "review": "One of the best heist films, it has twists and turns at every corner."
  },
  {
    "rating": "1/5",
    "review": "a God awful waste of almost 2 hours"
  },
  {
    "rating": "4/5",
    "review": "Fantastic film! Originally written on June 29, 2013-- Ever wondered how a magician does some of his/her best tricks? Do you like a good heist picture where the bad guys make off the cash just to give it away to those less fortunate? This movie answers those questions, but in a way you won't see coming. Great way to spend a couple of hours at the movies. Highly recommend!"
  },
  {
    "rating": "4/5",
    "review": "Artsy-fartsy,ClichÃ (C).Cool action;lame story."
  },
  {
    "rating": "2/5",
    "review": "A five star film all the way to the last 2 minutes then you find out who the master mind is and then mentally review the film and realise what a crap ending it is. The master mind did a LOT of unnecessary things in the end."
  },
  {
    "rating": "2.5/5",
    "review": "Four magicians are brought together under mysterious circumstances and as a troupe, their tricks turn out to be more than just illusions but rather a cover for a heist. The scenes involving our group of magicians performing on-stage are admittedly rather enjoyable and there is even a card trick that you can play along with at home. Moreover, watching Michael Caine and Morgan Freeman on-screen together is always a treat. However, the fast cutting became nauseating after a while as were the copious number of circulating aerial shots and almost game-show style score. The characters were barely three-dimensional and the ending was nonsensical to jaw-dropping proportions. The further you thought about it, the more ridiculous it became. I also had issues with the ending of the magician-based The Prestige; however in comparison to Now You See Me, Christopher Nolan's film is an absolute masterpiece."
  },
  {
    "rating": "3/5",
    "review": "Now You See Me's plot is an interesting concept and fields a pretty strong cast list but unfortunately it lacks substance. It definitely feels like smoke and mirrors are being used here to make this magic caper grander than it actually it is. It's by no means awful but just rather average. I thought the ending was a bit lame aswell, sure there was a twist but it didn't really create the surprise it was probably aiming for. Plus it just created a plot hole for me to be honest, it didn't quite add up. SPOILER ALERT: So, how does a son of a dead magician end up being an FBI agent working on his own case? That is a little too farfetched for my liking... Despite all of this, I would be keen to see what they do with the sequel.."
  },
  {
    "rating": "4/5",
    "review": "Amazingly complexed and pretentiously entertaining, Now You See Me is pleasantly a surprising and in this case, a magical experience."
  },
  {
    "rating": "1.5/5",
    "review": "Watch The Prestige instead."
  },
  {
    "rating": "0.5/5",
    "review": "Possibly one of the worst movies I have ever seen. Director couldn't even get a chase seen right."
  },
  {
    "rating": "2/5",
    "review": "Sets bar high in its first trick, then falls down with a series of predictable events which drags the film along to a stupid conclusion."
  },
  {
    "rating": "3/5",
    "review": "Stupid, but enjoyable. But like, is magic real or not?"
  },
  {
    "rating": "1.5/5",
    "review": "I had such hopes for this, but it ended up just a bungled mess of cliches and over-obsession on trickery and twists that fell flat on its face."
  },
  {
    "rating": "4/5",
    "review": "This is a great movie that will keep your eyes glued to the TV screen."
  },
  {
    "rating": "3/5",
    "review": "A good couple hours of entertainment, you just have to go with it and not take it too seriously."
  },
  {
    "rating": "3/5",
    "review": "This movie for many was a hit or a miss. I thought the plot was extravagant and overdone. The ending was a bit too good to be true. I shall go no further however to say I am a fan of the movie. I praise both Eisenberg and Harrelson's performances. Well crafted until the end. Excited for the upcoming sequel 6.5/10"
  },
  {
    "rating": "5/5",
    "review": "It's not very often that a film comes along and manages to do something different, and does it well. Now You See Me is just such a film. The film revolves around four magicians called The Four Horsemen, which is a bit erroneous as only three of them are men, but Isla Fisher's character was crow-barred in by the studio as the original script didn't feature a female magician, and you can't have a film with four male leads and no female lead as that's sexist isn't it. Although, bizarrely you can have a film with four female leads and no male lead, (Sex & The City). Not sure how that works, but anyway I digress. Now, first off let me say magic is shit. Unless you're 8 years old, it's crap. We know there is no such thing as \"magic\" it's just a trick, but unless you explain the trick, we have no idea how it happened, and therefore have no interest. People like Penn & Teller however, who trick you and then (sometimes) tell you how they did are infinitely more interesting, because there is the \"wow\" factor of finding out. So The Four Horsemen (one sans penis) steal money using magic tricks. The FBI and Inetrpol are utterly clueless as to how they do this. Luckily the character of Thaddeus Bradley (Thaddeus? Really??, why didn't you just called him, \"dropped my scrabble tiles on the floor to come up with a name\" Bradley). Anyway I digress (again). Mr Bradley explains to the rather dim-witted FBI agent how he thinks they did it. This is fascinating, and you can't wait for the next trick, so you can hear just how clever they were at fooling everyone. The film skips along at a good pace, there is no sign of the \"boring hour in the middle\" that is common place in most films nowadays, there is enough action to keep things interesting but not too much it detracts from what is going on, it's different so you don't get the feeling you are watching the same thing you've seen done before numerous times, and it is clever enough to keep you guessing and interested. Recommended."
  },
  {
    "rating": "1.5/5",
    "review": "\"Now You Can See Me\" is just \"Ocean's Eleven\" with a bit of magic and wasting the talents of many good actors. A waste!"
  },
  {
    "rating": "4/5",
    "review": "A thoroughly enjoyable mad dash around the country, but with its land and confusing parts."
  },
  {
    "rating": "1.5/5",
    "review": "Quite disappointing. Poor script, not believable in any fashion and so much time was spent guiding you 'on how it was done' makes the viewing experience even worse. Some creative potential for a decent film was squandered."
  },
  {
    "rating": "3.5/5",
    "review": "\"Now You See Me\" supplies plenty of entertaining moments and shows glimpses of potential, but the lack of character depth, the sloppy script writing, and the underwhelming finale prevents this film from being something special. To start out, for those of you who need a sensible and logical film, this movie is not for you. \"Now You See Me\" has elements of magic, and it's also a heist, so although the movie can be a fun time, many viewers will leave this film dissatisfied. The plot will not always add up at times, and considering that the movie's premise is built on magic tricks, this movie shouldn't be considered for everyone. To start, this movie lacks really lacks character depth. Although each character gets their small moments to shine, we aren't given any real reason to care for them. None of the characters are given any background which makes it difficult to relate to any of them, and although the actors behind them are impressive, none of the characters are memorable. Speaking of which, there were plenty of solid performances here, even if they aren't given much to work with. Jesse Eisenberg played the same role that he does in most of his films, which was an awkward, quick-witted and humor filled guy. Dave Franco was also really likable in the film, and Woody Harrelson was able to provide some comedic and intelligent lines in the film. Isla Fisher was also a nice addition to the group, and Mark Ruffalo added a bit of fun to the movie. I liked how everyone added their own unique skill-set to the movie, and it made everyone at least distinguishable. Overall, everyone here did a great job, but the lack of character depth prevented anybody from being memorable. The visual effects in this movie are also acceptable, but nothing really sticks out. For the most part, everything looks as good as it should, and it didn't feel like a ton of CGI was used. There wasn't much need for visual effects, but when the script called for it, they held up decently. The real problem I had with this movie was that it was really messy. I get that magic isn't always plausible, but that shouldn't prevent a movie from making sense. There was a clear line between magic and plot holes, and for every impressive magic trick on screen, there were 3 more plot holes to follow. The movie felt really messy, and in the end, many things still didn't add up. The plot was really messy, and the finale made it even worse. The huge \"twist\" in the script definitely brought this film down a notch, and the movie never seemed to know what it wanted to be. Although the first two-thirds of the movie sufficed our needs, the finale was extremely disappointing. The movie felt like it was building towards something big for a long time, but by the time the credits rolled, it felt like the movie was incomplete. In fact, nothing really happened in the finale, and it was as underwhelming as could be. In the end, \"Now You See Me\" was a fun experience. There are plenty of moments that are able to make the experience feel unique, but there are also plenty of moments that will make you groan. The movie struggles with its characters and its screenplay, but the actors behind them are more than creditable. The sad part is that this movie doesn't have much of a replay value, and it's not something that I would recommend to everyone, but it's still an enjoyable time and is an above average film."
  },
  {
    "rating": "3.5/5",
    "review": "I very much enjoyed this film. It was original & entertaining with one hell of a twist at the end"
  },
  {
    "rating": "4/5",
    "review": "Imagine Ocean's Thirteen meets Harry Houdini. The plot definately has more holes than you can spot, but that is very much the trademark of this movie, and very much what made it such a success in general audiences. Now you see me may not please everyone, but it definately deserves more credit for being a highly entertaining movie."
  },
  {
    "rating": "2.5/5",
    "review": "Once you realize anything is possible, everything is boring."
  },
  {
    "rating": "5/5",
    "review": "It's a great cat and mouse movie!!! I love itð???ð???"
  },
  {
    "rating": "5/5",
    "review": "more then 1 year after, it fucks and even reminnd me of my former bear, it is good! a must see!"
  },
  {
    "rating": "3.5/5",
    "review": "Excellent entertainment best described as far fetched fun which will keep you guessing !"
  },
  {
    "rating": "3.5/5",
    "review": "'Now You See Me' is high on grandiose and gimmicks and while it lacks any sort of character development its entertaining enough to keep the audience interested in the proceedings."
  },
  {
    "rating": "3/5",
    "review": "Complaints abound about improbabilities and impossibilities in this movie, but are you supposed to wonder how things happened? No. Just like a magic show, it's better if you don't ask questions about this movie. Are the characters the best? No. Is the plot sometimes nonsensical? Yes. But who cares? It's a fun heist movie with entertaining magic tricks and action scenes. It's not meant to be a thought-provoking thriller, it's meant to be enjoyed for what it is: A heist movie about magicians."
  },
  {
    "rating": "3.5/5",
    "review": "Classic entertainment. I'd much rather watch this over a Bond movie. Eisenberg , Ruffalo, Harrelson that itself says it all."
  },
  {
    "rating": "5/5",
    "review": "Very good and smart."
  },
  {
    "rating": "3/5",
    "review": "Kind of fun and over the top magic-related flic. Much more logical than that other one with Hugh Jackman. Full of surprises. Some magic is cinematic in there but we can get along easily."
  },
  {
    "rating": "4.5/5",
    "review": "Really entertaining movie with a highly original story!"
  },
  {
    "rating": "5/5",
    "review": "What an amazing movie."
  },
  {
    "rating": "3/5",
    "review": "Cool idea but none of those Vegas tricks felt really like magic as opposed to just throwing money at the audience after stealing from others. Unclear what the eerie blue light is. A movie for goths and white skateboard dudes without brains."
  },
  {
    "rating": "0.5/5",
    "review": "Una increible cantidad de buenos actores desperdiciados de un modo difícil de ver. Esta debe de ser una de las ocasiones en las que el proyecto en papel pinta genial, pero un equipo encabezado por un director inútil lo manda todo a la mierda. Es de las peores películas de los últimos tiempos. Really. Las muy malas las esperas, pero esto es atroz, ridículo, aburrido y terrible en cualquier faceta analizable."
  },
  {
    "rating": "4/5",
    "review": "While this movie is overblown and completely overblown and over the top, it somehow manages to work, thanks to an excellent cast and a fun tone that never takes itself too seriously."
  },
  {
    "rating": "1/5",
    "review": "the screenplay is inconsistent, with a lot of problems. But that wasn't important, their porpouse was to astonish the people and what's better that some magic? yeah let's write a story based on some badass magicians who use some random tricks to win against power and steal money. And to make it possible let's use all the visual effects we can afford! Yes good job, you amazed me"
  },
  {
    "rating": "0.5/5",
    "review": "what he hell did I just watch. This film actually pissed me off because it is so lazy and so badly written that it doesn't even bother to make sense. What a waste of time and I actually feel bad for everyone involved. Does anyone even read the scripts to films any more, why didn't they attempt for it to make even a little bit of sense. Seriously nothing is explained, stupid shit is just happening and after an hour I just had to turn my brain off to finish the film. My brain hurts."
  },
  {
    "rating": "5/5",
    "review": "MICHAEL Caine and Morgan Freeman was the best actors in Now You See ME. Good Job LOUIS LETERRIER! thank you so much for making that movie. it was strong!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "loved this movie!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie! Lots of my favorite actors!"
  },
  {
    "rating": "4.5/5",
    "review": "I'd give it a 5/5, but actor Mark Ruffalo was a bit too sweaty for my sensibilities. What a moist thespian. Otherwise I had a good time."
  },
  {
    "rating": "4/5",
    "review": "Good capers are hard to come by and too many magician pictures want to pull the curtain back too far... not so with Now You See Me, where, as they say, the closer you look the less you'll see. It's a magic trick with the soul of Ocean's Eleven, and pretty much all the ensemble cast is up to the challenge (my exception would be an unrecognizable Isla Fisher, who seems oddly generic after a slew of memorable work). The less said the better but figuring out the tricks is just the distraction from how all these pieces fit. And hiding that maguffin is really an art."
  },
  {
    "rating": "2.5/5",
    "review": "Started well and spiraled steadily downwards into the mud."
  },
  {
    "rating": "4.5/5",
    "review": "Awesome movie! Very under rated but stylish, entertaining and clever- loved it."
  },
  {
    "rating": "4/5",
    "review": "Although the plot and script is skating on thin ice, Now You See Me still offers an abundance of sweet magic tricks, and a satisfying conclusion."
  },
  {
    "rating": "2.5/5",
    "review": "At one moment, Danny Atlas(Jesse Eisenberg), Merritt McKinney(Woody Harrelson), Henley Reeves(Isla Fisher) and Jack Wilder(Dave Franco) are all magicians performing under the radar. At another, they are all very much above the radar, headlining sold out shows in Las Vegas where they are bankrolled by Arthur Tressler(Michael Caine). It is also where they rob a bank in Paris. Or did they? That is what FBI Agent Dylan Rhodes(Mark Ruffalo) and Interpol Agent Alma Dray(Melanie Laurent) want to prove while Thaddeus Bradley(Morgan Freeman) just wants to show that there was absolutely no magic involved. \"Now You See Me\" is a mixed bag if ever there was one. Some parts are very predictable while other plot twists are truly surprising. There is an excellent cast that alas can do little with such paper thin characterizations. An exciting fight/chase sequence through the streets of New York City makes up for some of that. But then there is the disappointing ending and the movie's central reveal which is a cheat to say the very least."
  },
  {
    "rating": "3.5/5",
    "review": "fun ride but ....what? do I really have to bother seeing it again to try to understand it all? Looked cool but once it all was over, it really seemed to be to be too much...so much that it seemed a bit cheesy. Overdoing a heist film."
  },
  {
    "rating": "1/5",
    "review": "All the four horseman are horribly unlikeable so the fact they get away with it is totally unsatisfactory. Add into the mix the fact that the one good guy who was supposed to be taking them down is actually on their team, and there's just nothing to redeem this film. Especially when that guy is part of some evil eye cult. It also got lost on me why Morgan Freeman's character would have been so hated by Rhodes so the fact he ends up rotting in a dungeon leaves a bad taste - especially when it turns out he has actually been framed. I guess whoever made this was desperate for an unexpected twist at the end of their movie, and it was unexpected, I'll give them that...but unfortunately that twist ends up destroying any chance of bringing the story to a satisfactory end."
  },
  {
    "rating": "4/5",
    "review": "I thought this whole movie was awesome!"
  },
  {
    "rating": "3/5",
    "review": "Obviouly, a film like this needs a surprising and unexpected end. and, honestly, i didn't see it coming. nevertheless, i was underwhelmed by it. maybe this is due to the characters' motivations, which are at no point convincing, maybe it is due to the film's overall plot, which despite some fairly cool effects and a reasonable dose of action failed to grab my full attention."
  },
  {
    "rating": "3.5/5",
    "review": "Wildly implausible, with weak characterisation and some very dodgy dialogue, this is nevertheless a very enjoyable movie. It's fast, fun, stylish and suspenseful. Tapping into celebrity culture, conspiracy theories, and an idea that wealth redistribution could be a good idea, it's actually a smarter movie that it's gloss and fast editing might suggest."
  },
  {
    "rating": "3.5/5",
    "review": "Enjoyable because of the cast and worth a watch. The romance was a thinly veiled illusion at best. and the worst part of the movie."
  },
  {
    "rating": "2/5",
    "review": "Despite cool tricks & an alright performance from Morgan Freeman, this movie is confusing & worthy of eye rolling"
  },
  {
    "rating": "2.5/5",
    "review": "I can't say this movie isn't entertaining. It moves at a pretty breakneck pace, and with a lot of characters and quick changes in locations it's hard to keep up. And that is I think my main problem with the movie: there's just too much. Too many twists and turns and car chases and fights and elaborate magic tricks. So by the time you get to the final twist you're pretty worn out. It's not as big a mess as some people have said it is, but it definitely could have been a lot better."
  },
  {
    "rating": "3/5",
    "review": "Surprisingly satisfying given its ridiculous plot. The cast was great, the characters were fun and the effects were sufficient."
  },
  {
    "rating": "5/5",
    "review": "Saw the film in theaters when it came out / bought it on blu-ray. I'm going to go see now you see me 2 when that is released in theaters some time in 2015 or 2016 / awesome film if u like card tricks / slight of hand mixed in with a plot twist or 2"
  },
  {
    "rating": "5/5",
    "review": "I thought this was an amazing movie that kept you guessing right up until the end. I brought my 9 y/o son and he loved it too. What I liked best was that there was no violence, had great actors/actresses, and was very entertaining."
  },
  {
    "rating": "2/5",
    "review": "Hate me on this but this film is so dull that I can't watch furthermore. I mean it has all the goods of a story line but the acting sucks! The camera angles sucks big time with those what 1998 kinda films in terms of execution and this is a 2013 summer film so. Morgan Freeman, Micheal Caine and you include Mark Ruffalo. What can you ask more, these is an all-star cast that it could be a extravaganza of awesomeness and it turns out to be flat. If there's a sequel? Change the whole production team and get the Ocean's 11 production team. That's it. 2 out of 5."
  },
  {
    "rating": "0.5/5",
    "review": "Inconsistent tone, lousy characters, and disastrous story development combine to form a true trainwreck of a movie. I enjoyed The Last Airbender more than this. It's that bad."
  },
  {
    "rating": "4.5/5",
    "review": "amazing movie. I thought ocean eleven series is the most entertaining comedy caper. I also enjoyed movies with low rating like tower heist and entrapment but this is the best. because you just love everyone. best was ruffalo. movies are to entertain and inspire us. I loved it. yes somethings are better left unexplained. why I did not see this movie for so many years just believing the ratings. critics are so wrong about this one"
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining, enjoyable and with a great cast, Now You See Me its a good magic flick that shouldn't be took that seriously."
  },
  {
    "rating": "2.5/5",
    "review": "Oh wow was this a poorly made movie"
  },
  {
    "rating": "3.5/5",
    "review": "I expected the ending to be magnificent, but it was simply \"normal\". Overall, good movie"
  },
  {
    "rating": "3.5/5",
    "review": "While its final scene is ambiguous, it's one of the most original movies I've ever seen."
  },
  {
    "rating": "2.5/5",
    "review": "They could of done better but still a good movie not looking forward second one it's not gonna work with daniel Radcliffe"
  },
  {
    "rating": "1.5/5",
    "review": "Horrible characters, bizarre confusing plot, overall messy film."
  },
  {
    "rating": "4/5",
    "review": "Relentless and silly, but still pretty entertaining. The main problem is it isn't as clever as it would like to be."
  },
  {
    "rating": "4/5",
    "review": "Now you see me is a fun movie that i had a good time with, i own the blu ray and i actually don't mind it. Though it's plot is scattered and unfocused. Now you see me is a enjoyable film that had my interest for the whole movie."
  },
  {
    "rating": "3.5/5",
    "review": "The only thing i enjoyed about this movie was the twist at the end. Other than that it was a boring and bland movie. That wasnt very exciting. They made the FBI look so stupid which most movies and tv shows do, i dont why everyone does it bc the fbi is not stupid. Plus the acting wasnt what i expected it to be, when i saw the cast I was like oh wow this ought to be a good movie but nah. The only actor that stood out was Mark Ruffalo"
  },
  {
    "rating": "3/5",
    "review": "6.9 So many plot hole except it's real magical but still enjoyable."
  },
  {
    "rating": "3/5",
    "review": "Great characters with a nice twist make this an entertaining film B"
  },
  {
    "rating": "1/5",
    "review": "The problem with Now You See Me is that The Four Horsemen are so annoying. They're egotistical jerks always talking sassy with Mark Ruffalo. And we're supposed to root for them? I wanted them to get killed off."
  },
  {
    "rating": "3.5/5",
    "review": "J'ai bien aimé. Moins surprenant que \"Ocean's Eleven`\" mais un peu dans la même veine."
  },
  {
    "rating": "5/5",
    "review": "I love this movie :) I think the illusion are totally impossible but I don't want them to be :) Anyway I love this movie for the story -not the tricks :)"
  },
  {
    "rating": "4.5/5",
    "review": "I was seriously impress! The cast, the tricks, the story, the end, I loved it all!"
  },
  {
    "rating": "0.5/5",
    "review": "'now you see me' is substantially tenable force of prudent extrication. its endlessly fervent mendacities acclimate real entrancement and percipience, handsomely illustrating the seductive command of illusion. the film assumes a blatant line of narrative manoeovres, unfolding your grasp of the silver screen's capabilities. never hits a vacuous phase and intrinsically flummoxing."
  },
  {
    "rating": "4/5",
    "review": "Surprisingly very entertaining."
  },
  {
    "rating": "5/5",
    "review": "Psychologically engaging and thrilling throughout, entertaining from beginning to end."
  },
  {
    "rating": "5/5",
    "review": "the best movie of the 2013"
  },
  {
    "rating": "3/5",
    "review": "The idea is good, but the movie never ends completely convince me, also has great actors that in this film doesn't give very good performances, however, is advisable. 6/10"
  },
  {
    "rating": "5/5",
    "review": "Magic is in every twist and turn. Had me on the edge of my seat the whole time. Movie magic + magicians= pure gold."
  },
  {
    "rating": "3.5/5",
    "review": "This movie is deep. Google some of the hidden meanings behind it. Makes the movie way more entertaining. This has a The Prestige, The Usual Suspects, Primal Fear and 7 kind of vibe. Very fun."
  },
  {
    "rating": "2/5",
    "review": "It was going great, that is until it forced a needless twist."
  },
  {
    "rating": "4/5",
    "review": "Louis Letterier has upped his game, and while it might be more show than substance, oh what a show it is."
  },
  {
    "rating": "4/5",
    "review": "Really entertaining movie. With a really stupid ending :p but fun nonetheless!"
  },
  {
    "rating": "4/5",
    "review": "It was fun and had assembled a good cast. I enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "If not for a few plot holes this movie would be brilliant. Great cast and it had me guessing until the end."
  },
  {
    "rating": "3/5",
    "review": "Entertaining due largely to the great ensemble. Don't expect any logic or much for stimulating dialogue."
  },
  {
    "rating": "3/5",
    "review": "quite entertaining, nothing else"
  },
  {
    "rating": "3/5",
    "review": "entertaining, weird and unexplained ending."
  },
  {
    "rating": "3/5",
    "review": "A little flimsy, but at least the cast is appealing and Morgan freeman is always there to help us understand the insane acts."
  },
  {
    "rating": "4.5/5",
    "review": "Loed this movie and I can't wait until it comes out on DVD"
  },
  {
    "rating": "4/5",
    "review": "At times it makes no sense or is too unrealistic, but it is widely entertaining. A very exciting ride all the way through."
  },
  {
    "rating": "5/5",
    "review": "It was a great caper thriller film. I enjoyed this movie so much"
  },
  {
    "rating": "4/5",
    "review": "Rather like the TV show The Hustle. Big on entertainment value and clever people if a little light on substance. However it is a thoroughly enjoyable romp with an amazing cast. Sit back and enjoy."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was very entertaining. I did not see the ending coming. You will be on the edge of your seat."
  },
  {
    "rating": "3.5/5",
    "review": "Clever enough throughout with some great performances from its likable leads, though the finish lacks some punch. Full review later."
  },
  {
    "rating": "3.5/5",
    "review": "A fun, but a very loosely written film. Not enough time is given to develop the characters to genuinely care about what they are doing for the hour and a half that they are running around."
  },
  {
    "rating": "1.5/5",
    "review": "Ninety minutes of my life wasted watching this dreadful film. The arrogance of the 'Four Horseman' (Jesse Eisenberg in particular) is just as frustrating as Mark Ruffalo's character, regardless of the final 'twist'. The swagger of the magicians is not matched by their apparent abilities. A heist film that does not thrill, nor intrigue."
  },
  {
    "rating": "4/5",
    "review": "Not perfect, but filled with witty humor, tense thrills and plot twists to screw with your brain help to make this magic thriller a surprisingly entertaining film."
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining enough, especially when the gorgeous Mélanie Laurent is in it. Many plot holes, but the pace of the movie makes you not dwell on them too much until the movie's over."
  },
  {
    "rating": "2.5/5",
    "review": "Entretenimiento para pasar el rato , simple sin mayor inteligencia."
  },
  {
    "rating": "4/5",
    "review": "A brilliantly written movie in that it keeps you guessing why they are doing what they are doing and who is really behind it until the very end."
  },
  {
    "rating": "4/5",
    "review": "I was not expecting this to have such a low rating! I LOVED this movie. I loved Jesse and Dave the most but it was an allstar cast and the plot was so riveting! Such a fun movie. Can't wait until next year for the sequel. The ending is hokey, I'll give you that."
  },
  {
    "rating": "2.5/5",
    "review": "Now you see it? Now you don't! The bigger it tries to impress, the harder it fails. It's symptomatic of Hollywood's failure to understand properly the mechanics of scale within story-telling that leads to movies like this. The childish assumption that bigger is better has never been more foolishly demonstrated than here. This film is highly recommended for film students as an example of why bigger is not necessarily better, and in film, bigger is not even bigger, unless you give it a reason, and a believable reason at that, for why AND HOW each event, however spectacular, is happening. Plot twists must be pivotal points of surprise that make sense within the progression of characters or story, not just twists for the sake of twists. And the suspension of disbelief requires, at the VERY LEAST, a rough explanation and passing believability of how things are achieved in the film world. This film fails to tick so many boxes in regard to the above that I am left wondering what this film is actually trying to achieve, but am left in no doubt that it does not achieve it. And lacking a sense of pace and timing, the music simply belts out the same \"WOW\" theme all the way through, which completely dilutes and renders it meaningless. But that's okay, because the film itself is already meaningless.\\ The final feeling is one of having watched a completely incomprehensible 90 minute advert but you aren't quite sure what it was an advert for, just that it looked stylish and maintained the same mood and tempo through... (yawn) ...throughout."
  },
  {
    "rating": "4.5/5",
    "review": "I took a chance and I did a good job in doimg so. everything from the cast, storyline, action, twist (which I didn't see coming) was fab"
  },
  {
    "rating": "2.5/5",
    "review": "Another waste of time. Mediocre or near poor film."
  },
  {
    "rating": "4/5",
    "review": "Despite what the critics say, this film is just a fun film to escape to. The main characters are interesting although some characters such as Isla Fisher's character Hanley could have had more to do in the film. The ending is a little bit to be desired but the audience seems to swallow the silly plot twist quicker than their ability to believe many of the magic tricks in the film itself. I guess, if you suspend your belief then the film itself is an enjoyable ride. Take the film too seriously and you may find yourself turning it off halfway through."
  },
  {
    "rating": "0.5/5",
    "review": "Do not see this movie! If you don't care about character development then this is the movie for you because there is none of it throughout the entire film. If garbage had garbage then this film would be it."
  },
  {
    "rating": "2/5",
    "review": "Plot is honestly stupid, with a lot of holes and what the hell moments, but it is admittedly a dazzling film."
  },
  {
    "rating": "3/5",
    "review": "Entertaining-enough hokum. Fun, but nowhere near as clever as it thinks it is, it's a sugar-free Ocean's 11."
  },
  {
    "rating": "3.5/5",
    "review": "Not sure why the critics didn't like this one - I thought it was fun and kept you guessing. Sure it \"rel[ies] on sleight of hand from the director to distract audiences,\" but it *is* a magic trick. Duh."
  },
  {
    "rating": "4.5/5",
    "review": "This movie has a lot of twists and turns and is incredibly fun to try and keep up with. Every time I watch it I'm still in awe and enjoy every second of it. I think the cast is incredible, the plot thick and intriguing, and the 'magic' entertaining. I highly recommend it for those who enjoyed The Illusionist."
  },
  {
    "rating": "5/5",
    "review": "Great movie that will keep you surprised and shock every single time. A must watch!"
  },
  {
    "rating": "3/5",
    "review": "Entertaining up to the reveal."
  },
  {
    "rating": "2/5",
    "review": "Too hard to understand"
  },
  {
    "rating": "3/5",
    "review": "This is filmed with very much the spectacle you associate with the giant magical acts depicted and is a fairly fresh take on a what is essentially a blurred heist movie. There's a huge dependence on CGI to create a lot of the magic and those watching won't be fooled by it, which is the weakest part of the film."
  },
  {
    "rating": "3/5",
    "review": "Not a great movie, but oddly entertaining nonetheless."
  },
  {
    "rating": "5/5",
    "review": "Despite the bad reviews I really enjoyed Now You See Me. Actually thought it was Awesome!"
  },
  {
    "rating": "3/5",
    "review": "This is a fun show most of the way through. The acting is fine and the story is fun until the final act. The way it ends is so full of balony it really brings down the entire movie. Also, it makes no sence for that character considering his actions from the beggining of the movie. The movie is a fun ride and I like the actors but the ending stinks. Recommended if available for free, do not pay for this."
  },
  {
    "rating": "4/5",
    "review": "good movie i thought. make part 2"
  },
  {
    "rating": "3.5/5",
    "review": "12/27/14 This is very fast paced film. It never gives you the chance to get bored. Some of the criminal stunts seem really unrealistic, but I give them credit for coming up with some pretty plausible explanations for how they were possible. The end is a little disappointing-- It is just a little too \"convenient\". i guess they were trying to make the end a big surprise, but it just seems contrived. Still, I found the film very enjoyable to watch even with it's flaws."
  },
  {
    "rating": "2.5/5",
    "review": "Good!!! Wating to see if the second will be better"
  },
  {
    "rating": "4/5",
    "review": "the ending is shocking and I feel cheated at this movie ."
  },
  {
    "rating": "3/5",
    "review": "An enjoyable one-time watch."
  },
  {
    "rating": "3/5",
    "review": "An enjoyable heist caper, that could have been a lot better. The movie feels rushed, and the last half hour was over-complicated."
  },
  {
    "rating": "3/5",
    "review": "At the moment there are people in this world who fascinate me, people who climb through glass, walk on water, disappear in front of an entire room, place mobiles in drinking bottles, manipulate a situation so intensely they can suck in an entire audience or make one man believe the world has ended. So when a film about these people come to the big screen direct from Hollywood I can only imagine and hope for an amazing experience. That there is the problem. A thin story about revenge with some grand illusions and sleight of hand does not make the move I wanted to see. I went into ?#?NowYouSeeMe? eyes wide open, ready for wonder and amazement but also well aware the true magic behind a magician is the story they tell within their acts. Something was lost in that transition on the screen, don't get me wrong, the magic worked but there wasn't enough build up or story to help the actors along with what they were attempting to pull off . You see, when you see an actual magician in life you are there, you are aware there is no camera tricks, no cutaways, no bedazzling just pure misdirected amusement. Unlike in a film, where you have been brought up accepting all of Hollywood's big tricks and unfortunately your mind never accepts what is going on, because of such you never truly let the film in. Don't get me wrong this film was amazing in fact I loved it, I loved the illusions, loved the characters attitude, loved the good vs bad, cops vs robbers script. It wasn't until the film was over that slowly I began picking it apart. Having very empty plot lines never explained always annoys me, I know its something a lot of directors try to do to leave the film with a mysterious ending but for me it's an annoying and a lazy habit. A few twist and turns and abracadabra accept the facts that were never explained is what the viewer is expected to take on board. One fantastic thing about the film is the cast from it's heros to its villains ?#?JesseEisenberg? as J. Daniel Atlas (The Lovers), an illusionist and the ringleader of The Four Horsemen. ?#?MarkRuffalo? as Dylan Rhodes, an FBI agent called to investigate the bank theft. ?#?WoodyHarrelson? as Merritt McKinney (The Hermit), a mentalist. ?#?IslaFisher? as Henley Reeves (The High Priestess), an escapologist. ?#?DaveFranco? as Jack Wilder (Death), a sleight of hand illusionist.(also well worth seeing the film for, very spunky) ?#?MélanieLaurent? as Alma Dray, an Interpol agent who is partnered up with Dylan Rhodes to investigate the bank theft. ?#?MorganFreeman? as Thaddeus Bradley, an ex-magician who makes money by revealing the secrets behind other magicians' tricks. ?#?MichaelCaine? as Arthur Tressler, The Four Horsemen's sponsor. It's unfortunate for the cast they weren't given something better to play with. ?#?LouisLeterrier? the director (Transporter, Unleashed, Clash of the Titans)tries really hard to make this work and knowing some of his other big action films I have to ask myself why didn't this, what did he do so differently. I wanted more but maybe it was just what he was after. Do better next time #LouisLeterrier \"The closer you look the less you see\" So the story... Starts of with a quick 2 min introduction of each character basically showing us they are 4 small fish in what could be a very big pond, each is given a tarot card with instructions to meet at an address at 4:40pm on a specific day. They meet and great break into a room where they find a funny symbol on the floor and activate a holograph of blueprints. Cut ahead to 1 yr later where the same 4 small fish have actually become very big fish, with big sellout shows and their name now known everywhere as ?#?TheFourHorsemen?, their grand finale for this big show is to rob a bank using the audience to assist. What happens next can only be seen as magical as an audience member is transported thousands of km's away to a bank in Paris and what seems impossible is in fact possible and profitable A cat and mouse chase ensues for the next 2 hours with all levels of the worlds law chasing after them. The Four Horsemen promise 2 more big shows with the third being their BIG finale, so now the FBI and Interpol have only a few days to figure out how and why. Some big illusions, big visuals and the unknown definitely kept me entertained but no character development, some very big plot holes and scenes too big to even recognise exactly what is taking place left me disappointed. In saying all that, this is film that has been made to be enjoyed and while I was watching it I did totally enjoy it, I didn't really think about the plot holes, the why is he there scenes, the hard to accept ending. I just enjoyed my time, so if you decide to see this one go with an open mind and accept the fact not all films have to be explained but it is nice when they are. If anyone ever finds out what ?#?TheEye? actually is please let me know I so want to join! 3 out of 5 BanShee Screams X #NowYouSeeMe"
  },
  {
    "rating": "2.5/5",
    "review": "Not bad, solid throwaway entertainment."
  },
  {
    "rating": "3.5/5",
    "review": "The movie makes up in star power what it lacks in depth. Packed with humour and thrills, the film is both captivating and amusing."
  },
  {
    "rating": "3.5/5",
    "review": "Did not see that coming.....kept me guessing till the end..."
  },
  {
    "rating": "4/5",
    "review": "Funny, witty and well blended with its mystery inside. Theatrical is a good description of its events which comes naturally since we're talking about illusion and magic tricks here."
  },
  {
    "rating": "2.5/5",
    "review": "illusions and heists are not typically my genre but this movie is entertaning enough, in a overglitzy made-for-tv sort of way..."
  },
  {
    "rating": "2/5",
    "review": "At first, I knew it was just a movie about magic. However, it has action, thrill, and mystery. Actually, I don't like those genre so I couldn't concentrate well during the entire movie. 'Magic+Action'; it was good try but I think it was so complicated."
  },
  {
    "rating": "2.5/5",
    "review": "Entertaining but way too absurd. Its a fun slick movie, granted, but too far fetched when all is said and done."
  },
  {
    "rating": "1/5",
    "review": "Was alright started off wicked but gradually got more benny bullshit along the way. Wasn't sure if I was watching harry potter because there was so much in this film that left me confused. Wizard shit was going down. The ending was maybe the worse ending of all time. Didn't make any sense at all. So many plot holes. I think they might of rushed this film a little cuz it was kinda stoooopid. Characters were maybe the only good thing about this film . it was bad but watchable."
  },
  {
    "rating": "0.5/5",
    "review": "Unfathomably stupid, with a talented cast (and Mark Ruffalo) it is rare to see a movie get this much wrong. From a ridiculous amount of plot holes and a story that is driven by an equally ridiculous amount chance, Now You See Me squanders any sense of competent screenwriting. The ending was the Citizen Kane of bad endings, completely out of the blue with zero evidence, discredits all of the Detectives actions through out the film, and is uninteresting. But dammit I love Dave Franco"
  },
  {
    "rating": "3/5",
    "review": "The more flashy and showy it got, the less interesting it all became. Slight of hand magic is fine, but the special effects stick out like poorly concealed cards up sleeves. The characters are shallow and dull. The end of the plot is simply ridiculous. This film will vanish into thin air."
  },
  {
    "rating": "4.5/5",
    "review": "There are some holes in the story-line, but the action, actors and MAGiC is pretty good.All in all an entertaining film."
  },
  {
    "rating": "4/5",
    "review": "A fun heist movie full of action and magic designed to dazzle and entertain - i liked the \"robin hood\" concept of income distribution :)"
  },
  {
    "rating": "0.5/5",
    "review": "How did this film get made? I mean, how did a cast that good get involved in a film like this? I pity the screenwriters - there is no way they conjured up a story so full of holes and logical leaps and eye-rolling moments. (Early on, four strangers arriving at a dark house and EVERYBODY has a torch on them?) Wow - for all the wrong reasons."
  },
  {
    "rating": "3/5",
    "review": "Same long con movie that's been made a million times, but it was very well acted. Woody Harrelson and Jesse Eisenberg's interactions in particular were great."
  },
  {
    "rating": "4/5",
    "review": "Who ever said what this is new and from ground up."
  }
]