[
  {
    "rating": "0.5/5",
    "review": "horrible, lost precious time looking at this film, poor acting and poor story, don't start to watch this"
  },
  {
    "rating": "2/5",
    "review": "I wanted to like this because I love the book and it’s a great cast. I was ok until the ending. so disappointing and such a jarring shift in tone. It starts as a great noir story but turns into a joke."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved it. Must see!"
  },
  {
    "rating": "1.5/5",
    "review": "Boring, poorly acted, kendrick sucked, lively sucked, not sure why it got a sequel."
  },
  {
    "rating": "4.5/5",
    "review": "A truly interesting mystery with some well-timed and unexpected comedy. It was surprisingly enjoyable."
  },
  {
    "rating": "3.5/5",
    "review": "(CASTELLANO) Un pequeño favor es de esas películas que parecen una cosa, luego otra, y al final... ninguna de las dos. Pero eso no es necesariamente malo. De hecho, ahí está parte de su encanto. Paul Feig firma una comedia negra con toques de thriller que, aunque no sea perfecta, resulta muy entretenida y visualmente deliciosa. Desde el primer minuto, Anna Kendrick se gana tu simpatía. Está divertidísima, natural y llena de chispa. Y aunque Blake Lively puede caer mal fuera de la pantalla, lo cierto es que aquí borda su papel. La historia juega con los clichés de la mujer perfecta, los secretos inconfesables y los giros que buscan dejarte con la boca abierta. Algunos funcionan mejor que otros, pero en conjunto se mantiene el interés. Es cierto que en la parte final se estira un poco más de la cuenta, como si no supiera muy bien cómo rematar tanta locura, pero aún así el conjunto se sostiene gracias a su tono desenfadado y al carisma de sus protagonistas. También destaca la estética cuidada: vestuario, fotografía y música juegan a favor de esa mezcla de sofisticación y humor retorcido que hace que Un pequeño favor no sea una más del montón. No llega a ser un clásico del género, pero es una opción muy apetecible para pasar un buen rato. Con una copa de vino en la mano, entra todavía mejor. Y por cierto, me encanta la canción Laisse tomber les filles de France Gall. Aquí suena de maravilla. (ENGLISH) A Simple Favor is one of those films that seems like one thing, then becomes another, and ends up being... neither. But that’s not necessarily a bad thing. In fact, that’s part of its charm. Paul Feig delivers a dark comedy with a touch of thriller that, while not perfect, is quite entertaining and visually delightful. From the first minute, Anna Kendrick wins you over. She’s funny, natural, and full of spark. And even if Blake Lively might rub some people the wrong way off-screen, here she absolutely nails the role. The story plays with clichés about the perfect woman, hidden secrets, and twists designed to keep you guessing. Some land better than others, but overall, it holds your interest. It’s true the ending stretches things a bit, as if unsure how to tie up all the chaos, but it still holds together thanks to its playful tone and the charm of its leads. The film also shines in its visual presentation: costume design, cinematography, and music all enhance that mix of sophistication and twisted humor, making A Simple Favor stand out from the crowd. It may not be a genre classic, but it's definitely a stylish and enjoyable ride. And with a glass of wine in hand, it goes down even smoother. And by the way, I absolutely love the song Laisse tomber les filles by France Gall. It fits perfectly here."
  },
  {
    "rating": "1.5/5",
    "review": "Facile and unconvincing"
  },
  {
    "rating": "3.5/5",
    "review": "Pretty solid. The end looses a lot with the unrealistic sentencing at the end. How is she not getting at least 30 years for these stacking sentences?"
  },
  {
    "rating": "5/5",
    "review": "Pura diversão. Merece ser assistido sim. As atuações são ótimas"
  },
  {
    "rating": "3.5/5",
    "review": "See \"Another Simple Favor\" for a review of both films. And, really, see \"Another Simple Favor\" if you haven't yet."
  },
  {
    "rating": "2/5",
    "review": "The cast is great, but this film can’t decide what it wants to be. At times it feels like you’re watching Something About Mary, with intentionally goofy action and ridiculous special effects. At other times it feels like you’re watching Presumed Innocent, with tense music and a serious story line. It never chooses which direction it wants to go, and I found myself checking home much time was left repeatedly for the last 30 minutes."
  },
  {
    "rating": "3.5/5",
    "review": "I thought the sequel was better...was that because I watched it first?"
  },
  {
    "rating": "3.5/5",
    "review": "Good movie but a little confusing"
  },
  {
    "rating": "0.5/5",
    "review": "Disappointed by Blake Lively’s Performance I really wanted to enjoy this movie, especially with a strong cast that includes Anna Kendrick, who was great as always. Unfortunately, Blake Lively’s performance completely took me out of the story. Her acting felt flat and unconvincing, with exaggerated facial expressions that seemed forced rather than natural. It made her character feel predictable and, frankly, dull. The rest of the cast did a solid job, but Blake’s performance made it hard for me to stay engaged. It’s disappointing when one actor can throw off the tone of an otherwise promising film."
  },
  {
    "rating": "5/5",
    "review": "A great movie with amazing performances. Tim Treakle"
  },
  {
    "rating": "4/5",
    "review": "This is a great thriller. Slowly the story is taking into a journey of WTF happens here, and despite they using the worst resource in the literature, screenwriting or playwriting: “the twins” thing, it’s a good movie."
  },
  {
    "rating": "2.5/5",
    "review": "I just watched this movie for the first time and it was okay. I actually like Blake’s acting in this movie and thought it was well portrayed but I still think the movie as a whole was slow. I think some parts of the movie went on for to long and I really only started enjoying the movie once we knew Blake’s character was still alive and had a twin. I am gonna give the new movie a watch and see if it was worthy for a sequel."
  },
  {
    "rating": "3.5/5",
    "review": "i have to admit that this one was a great surprise for me, given the fact that i’ve passed on it for years, but now that i’ve finally watched it i can say that i was worth the watch and i really enjoyed, both the story and how it was told! a mystery at its finest, with two compelling, apparently opposite characters, that have more in common that not. i was intrigued from start to finish, i wanted to uncover emily and stephanie was THE love to hate character that just made this film work, in a way! it was beca (wannabe blair) vs serena van der woodsen in alternate universes and i will hate svdw always, so that pretty much sums it all up!"
  },
  {
    "rating": "5/5",
    "review": "This movie is what I like to call theatrical comfort food. An intriguing story, a few good twist, brilliant actors playing perfectly casted roles, easily one of my favorite go-to movies. Lively is who I want to be when I grow up and Kendrick makes any suburban housewife proud."
  },
  {
    "rating": "4/5",
    "review": "4.0 stars; To be fair, this movie should be rated on multiple levels. All the elements are there: it's a comedy, a mystery with many twists and turns, and a police investigation. What made it hard to give a final score was how seamlessly it changed through each of these genres during the film. The easiest thing to rate was the sterling performance by Anna Kendrick. I think she literally stole the show."
  },
  {
    "rating": "0.5/5",
    "review": "The movie doesn’t make sense. The husband really didn’t do anything wrong, there was quite a bit of sympathy for the hot psycho, and the main character turns into the biggest Karen anyone’s ever seen. She basically ruins two people’s lives who really didn’t deserve it. It was a good movie up until the last 45 minutes or so when they went way off the rails. Everyone hates Karen’s. And this broad is supposed to be the good guy?"
  },
  {
    "rating": "4/5",
    "review": "It wasn't the best movie I've ever seen and all the actors play roles they are typically type cast for. It was surprisingly funny though and honestly kind of enjoyable although super far fetched. At least it wasn't the same old recycled trash we've all been seeing lately."
  },
  {
    "rating": "5/5",
    "review": "Best movie ever made"
  },
  {
    "rating": "4/5",
    "review": "Got a real kick out of these two great actors playing two complicated women."
  },
  {
    "rating": "4.5/5",
    "review": "Loved the twists and turns and sense that I was never quite sure what was going on"
  },
  {
    "rating": "1/5",
    "review": "Wtf is this? This is a movie I had issues even following. It just doesn't make a ton of sense as far as it supposedly supposed to be entertaining. It's trying to be different and it is, just not in a good way. Idk. Their goal really confuses me"
  },
  {
    "rating": "3.5/5",
    "review": "Interesting, in many ways quite trite but lots of plot twists and the occasional laugh make it a pleasant enough watch. Bashir Salahuddin particularly enjoyable as the amenable but inquisitive Police Inspector."
  },
  {
    "rating": "0.5/5",
    "review": "This is genuinely so bad it made me angry and ruined my entire night."
  },
  {
    "rating": "4.5/5",
    "review": "Left me guessing the whole time. very thought provoking and it hooks you in. Twists and turns until the end. great performance from all"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was pretty shallow, not worth the time. I have no reason to watch the newest release, plus I have never been a fan of Blake's though I am a big fan of Anna! Sorry for the floo Anna."
  },
  {
    "rating": "4.5/5",
    "review": "Really good fun Friday night movie with lots if twists and turns and great performances."
  },
  {
    "rating": "3/5",
    "review": "Good fun, but didn't hold up as well to a second viewing."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible movie terrible writing lazy and annoying"
  },
  {
    "rating": "5/5",
    "review": "I love it. The performances in this movie are top-notch. Blake Lively is utterly captivating as Emily, portraying the character’s sharp wit and layers of complexity with ease. Anna Kendrick provides a perfect balance as the sweet, quirky Stephanie, whose naivety contrasts well with the darker elements of the plot. Their on-screen chemistry is electric, making their dynamic both amusing and suspenseful."
  },
  {
    "rating": "4/5",
    "review": "A Simple Favor - 8/10. I always glanced over watching this over the years, but finally, got time to watch it. And with all the news surrounding the sequel, and the supposed feud between the stars, it made me want to watch this more ironically. Think of this as a messier version of Gone Girl, but with some cheesy noir flavour. This happened to be Paul Feig’s first deviation from straight forward comedy, and he does a good job here. You can tell he had fun making this movie. And as for the stars, with the context that I have now, watching this I can tell where exactly they probably started hating each other. This surprisingly is probably Lively’s best role she’s done, and she’s kinda a shadow of a character here (she’s not in it as much as I thought). Anna Kendrick is great as ever, and though this might be bias of me to say as a fan of hers: she’s the heart of this movie in my opinion. What works for this movie is that it just seems to playfully work with the material it has at hand. Its not trying to be a serious and straightforward twisted look at its respective story, but rather, has a darkishly light touch through its twists. Though I feel it does falter when Blake’s character’s reveal is that she’s a twin, its still a fun watch and one that will burn through time with ease. Good movie and a fun one at that!"
  },
  {
    "rating": "0.5/5",
    "review": "Blake doesn’t know how to act but Anna did well. Movie still was awful though, skip it, not worth the time."
  },
  {
    "rating": "4.5/5",
    "review": "The chemistry between Kendrick, Lively and Golding was diabolically good. The cameo from Cardellini shows her range and precision with comedic timing. This movie is just flat out fun. The multifaceted characters weave intrigue, suspense, and thrills, with laugh out loud moments of humour. A special mention to Satine, and especially Ho, who brought so much charisma and realism to their roles. I'm so interested to find more of director Paul Feig's work after seeing this, and can't wait to see, \"Another Simple Favour\"."
  },
  {
    "rating": "0.5/5",
    "review": "This is bad. It's just a through and through bad film, which breaks my heart because Paul Feig directed Bridesmaids, which is a masterpiece. This film is so horribly predictable. When they revealed the \"twist\" the entire room groaned because it was just a cheap move. People parody films with this twist because it's been done a million times (and way better too, if I'm being honest). I cannot believe they are making another one. The acting is horrendous. I'm so confused why this was successful in any respect."
  },
  {
    "rating": "5/5",
    "review": "100% recommended, especially given that it's a true story. This movie is one of those raw, real, sexy tales in which friendship, family, sex and death get tossed into a blender and turned into a potent shake of blood, tears, and other bodily fluids. It's a story that could not have been told without being played out on a stage of modern social media. I hope the kids featured aren't too f'd up by this being the story of their childhoods. But damn, what a great movie!"
  },
  {
    "rating": "0.5/5",
    "review": "Started out strong in the beginning, but then... mehhh. Feels generic."
  },
  {
    "rating": "3/5",
    "review": "Decent but a bit mediocre."
  },
  {
    "rating": "5/5",
    "review": "I like to call myself a heavy critic when it comes to GOOD movies. This one really hit the spot. Amazing film and story line, filled with plot twists towards the second half."
  },
  {
    "rating": "2/5",
    "review": "Instantly forgettable therefore I cannot say more"
  },
  {
    "rating": "1.5/5",
    "review": "The aggressive, I'm in charge, Emily is unappealing. Stephanie always says what she thinks people want to hear. Both get more and more annoying. The script becomes worse as the movie progresses. I watched way too much of it and didn't want to waste anymore time on this rubbish."
  },
  {
    "rating": "3.5/5",
    "review": "It’s great for a chick flick."
  },
  {
    "rating": "4.5/5",
    "review": "Funny, mysterious, twists, and tricks. This movie has all the Simple Favors of a thriller and it does it correctly."
  },
  {
    "rating": "1/5",
    "review": "You know how when you add a twist into a plot, it’s like the most satisfying thing because it throws the viewer and makes the whole movie refreshing. It’s like salt or umami in a dish. Well this movie thinks that you can just keep adding salt by the tablespoon and eventually it’s just inedible. Why do moviemakers have no restraint anymore and are willing to throw their creation down the toilet like this. Its like a comedy sketch of too many plot twists but they are not trying to be funny."
  },
  {
    "rating": "1/5",
    "review": "I make Alisson's words my own: \"First half was entertaining and drew me in, second half lost all sophistication. By the end, I was sorely disappointed\""
  },
  {
    "rating": "2/5",
    "review": "First half was entertaining and drew me in, second half lost all sophistication. By the end, I was sorely disappointed."
  },
  {
    "rating": "5/5",
    "review": "Twisty turny evil fun with Blake"
  },
  {
    "rating": "2.5/5",
    "review": "Filme: Um Pequeno Favor Assistido: Ago/24 Elenco: @annakendrick47 @blakelively @henrygolding @lindacardellini Modelo: #suspense #crime Duração: 2h Ano: 2019 Minha opinião: Temos como protagonista Blake Lively (esposa do Deadpool) e Anna Kendrick. E temos Henry Golding fazendo papel de esposo de Emily (Blake). Um suspense onde temos Stephane (Kendrick) uma mãe que tem filho e que faz amizade com o filho da Emily. E criam uma amizade. Até o dia que Emily desaparece e é dada como morta. Com isso Stephane começa a ter um romance com Sean o viúvo da Emily. Até o momento que o filho da Emily diz que viu a mãe. Até que descobre que Emily estava armando o bote para receber o seguro de vida. E o desfecho descobre quem Emily estava viva e quem morreu foi sua irmã gêmea que Emily matou e tomou seu lugar. Até o final que tudo é descoberto. Temos uma interpretação boas, mas o filme não foi aquele estouro. Mesmo com o charme e sensualidade de Blake. Não foi como “Instinto Selvagem” com Sharon Stone e Michael Douglas. Roteiro e enredo são bons, mas este estilo de filme não é estilo Blockbusters. O nome ao filme aqui no Brasil é “Um Pequeno Favor” tem referência do pedido de Emily para com Stephane olhar seu filho, enquanto ela tem um trabalho a fazer. E acaba desaparecendo. Vale apena assistir? Sim um suspense leve. Nota: 5"
  },
  {
    "rating": "4/5",
    "review": "Great cast and story that you keep thinking will be predicatable ... but never is and keeps you guessing! Anna Kendrick especially strong, just as well as in almost every shot! Recommended."
  },
  {
    "rating": "3/5",
    "review": "This was not exactly what I was expecting going in. This kind of complex manipulation works for me either when it's much more dramatic or as a complete comedy, but here it kinda works even though it's in between. There's a lot in this movie that worked really well until it didn't. Everyone was great in it but there was not a single character I cared about in it, so it was a bit hard to watch it when the plot surrounding them also turns out to be a bit convoluted. But there's enough glamour and twists and turns to make it worthwhile at the same time. Overall, I'm still very confused about how exactly I feel about this movie. The film may have shown the worst person not winning at the end, but did it really?"
  },
  {
    "rating": "2.5/5",
    "review": "Entertaining with a great soundtrack."
  },
  {
    "rating": "5/5",
    "review": "We really thought it was Great.... It was something different... The way Miss Blogger turned it all back around on the Witch was interesting.... It reminds us of the show Dead to me... Totally different..."
  },
  {
    "rating": "0.5/5",
    "review": "Anna Kendrick personally was a bit annoying, but otherwise I found the plot twists to be shallow and un-foreshadowed. This made for a boring story which tried to be entertaining and comedic but never really was.(in my opinion)"
  },
  {
    "rating": "2.5/5",
    "review": "Blake was entertaining. The storyline was a bit different but it was not really cohesive. The vlogging, the friendship stages went so fast it seemed rushed to conclude... then took forever to conclude."
  },
  {
    "rating": "4/5",
    "review": "I really didnt know what to expect from this movie and it surprised me. Blake and Anna chemistry was amazing, hope to see more in the sequel."
  },
  {
    "rating": "5/5",
    "review": "Wow, what a movie-crazy plot twist...Stephanie learned from the best, Blake is lively wow so sexy and great like plotting...I have no words for this movie. I mindblown love how it was all put together"
  },
  {
    "rating": "0.5/5",
    "review": "Disgusting! Had to turn it off to avoid becoming dumber for watching this!"
  },
  {
    "rating": "2/5",
    "review": "Starts out ok, with energetic performances from Blake Lively and Anna Kendrick. But the convoluted story line, the jumps back and forth in time, and the weak ending make for a ho-hum film, despite the best effort of the actors. Probably was a great script to read, but when finally brought to the screen, despite the best efforts of the director and the entire production team, the result is emotionally paper-thin with lots of plot holes."
  },
  {
    "rating": "1.5/5",
    "review": "If you don't know how to end a movie then don't make the movie. Started alright but drove into a ditch of stupidity."
  },
  {
    "rating": "3.5/5",
    "review": "Decent. Worth watching but probably won't be a all time favorite."
  },
  {
    "rating": "4.5/5",
    "review": "I loved every minute of this film. The chemistry between Anna and Blake is near perfect. The movie moves quickly and ends too soon."
  },
  {
    "rating": "3/5",
    "review": "This would be a 4 if they cut the music out of the movie. Very unique, with good acting all around."
  },
  {
    "rating": "2/5",
    "review": "Horrible. Blake Lively is trying her best to use Ryan Reynolds type humor and it doesn’t land well. At all."
  },
  {
    "rating": "3.5/5",
    "review": "Deliciously frivolous"
  },
  {
    "rating": "5/5",
    "review": "Wildly entertaining thriller that keeps you guessing up until the very end. If you are a fan of thriller movies with twists and turns you will love this movie"
  },
  {
    "rating": "5/5",
    "review": "Loved it! Easy watching, great acting."
  },
  {
    "rating": "1/5",
    "review": "I don’t know how any of the actors took this seriously. This should’ve been on AMC or the hallmark channel. Do not watch."
  },
  {
    "rating": "1/5",
    "review": "Oh come on!!!! Having a 5 year old kid say “F*ck You”!! Seriously!! WHY?? I lost all respect for this movie and the writer after hearing the kid say that. Completely unnecessary and I was offended! Turned it off!!!"
  },
  {
    "rating": "5/5",
    "review": "I saw this movie when it was released and I still can’t get over how well it was done from the cast, the script, everything I was amazing I hope the second movie will be just as good."
  },
  {
    "rating": "0.5/5",
    "review": "The build up was so good to such a dumb ending. Felt like it could’ve been an amazing plot twist shocking ending but it was just a Disney channel ending. Blake lively did not play the part well. Very awkward. Very disappointing"
  },
  {
    "rating": "4/5",
    "review": "Good movie. Lots of twists & turns"
  },
  {
    "rating": "4/5",
    "review": "Watched 05/31/2024.."
  },
  {
    "rating": "4/5",
    "review": "Wonderful to find a mystery without a Cop, without grisly scenes -- Just people trying to figure out who did what? And NOTE: Prominent Repeated placement of AVIATION GIN.... owned by the Star and. her Husband!! Product Placement?"
  },
  {
    "rating": "4.5/5",
    "review": "What a pleasant surprise. Looking forward to the sequel."
  },
  {
    "rating": "2/5",
    "review": "This started off with a ton of potential but crumbled into a disjointed ending that tried far too hard to have a cool, feel-good finale. Also, it seems the target audience may have been chronically online social media folk, admittedly this is not me. For me the wannabe witty, “GOTCHA” moments through vlogging was too cringe to overlook."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed the twist and turns. A good escape from reality thanks to Anna Kendrick!"
  },
  {
    "rating": "4/5",
    "review": "Enough twists and turns that even when you think you figured it out, there's yet another surprise."
  },
  {
    "rating": "3/5",
    "review": "Fairly entertaining with twists throughout. I don't understand the back story which led Anna to be part of the story or why they would allow her to become a friend of the family if they were planning such a con."
  },
  {
    "rating": "1.5/5",
    "review": "Admittedly, I didn't get very far into this. The bad acting, the low overall quality, the cheap production... I just couldn't take it."
  },
  {
    "rating": "4/5",
    "review": "Pretty good. Keeps you guessing until the end. Good casting. Blake Lively does well at being a villain. Anna Kendrick does her normalize thing."
  },
  {
    "rating": "3/5",
    "review": "Not bad. Predictable plot but good acting throuout. Nice fashion."
  },
  {
    "rating": "3.5/5",
    "review": "Really well done and interesting throughout."
  },
  {
    "rating": "5/5",
    "review": "It is phenomenal to watch Kendrick and Lively. They are so different and each one of them performs her character flawless. Loved this movie!"
  },
  {
    "rating": "0.5/5",
    "review": "I loved Emily as a character. Stephanie was all over the place and a terrible best friend. I really wish they kept the same ending and a few other things that were in the book. I think the characters were not well developed on screen and the ending was basic."
  },
  {
    "rating": "4/5",
    "review": "This movie doesn't take itself too seriously & you shouldn't either. Just enjoy the frenetic, beautifully shot/produced fun."
  },
  {
    "rating": "5/5",
    "review": "Muy buena película de misterio; el ritmo, la trama y los personajes funcionan a la perfección. Tal vez si fuese la misma trama pero en un toque mas serio no resultaría, creo que el tono de comedia es clave para mejorarla completamente. Grata sorpresa, me encanto."
  },
  {
    "rating": "4/5",
    "review": "Interesting concept!"
  },
  {
    "rating": "5/5",
    "review": "this movie was really good anna Kendrick and Blake lively did really good jobs at acting"
  },
  {
    "rating": "4.5/5",
    "review": "This is a mystery movie first and foremost, but A Simple Favor has insane firepower thanks to Kendrick's and Lively's spellbinding performances. The twisted story makes perfect use of its enticing characters to keep you on the edge of your seat. It's perfectly performed, perfectly excuted, and left me extremely satisfied."
  },
  {
    "rating": "3.5/5",
    "review": "OK, this was a really interesting viewing experience for me. As it started, I was not impressed - it felt was over the top, almost cartoonish, both in plot and performance. But then the tide changed. I don't know if this is what the filmmakers had in mind, but I started viewing it as a satire of films like GONE GIRL, and I felt a groove, especially at the end when plot twist upon plot twist almost became laughable. And I realized this is kinda brave filmmaking, considering they're not necessarily winking at the audience. It reminded me of a Lifetime movie called A DEADLY ADOPTION with Will Ferrell and Kristen Wiig, which was played dead straight but was actually a remarkable satire of the kind of movie audiences confused it for being. It turned out to be a grand time and one of the nice surprises of 2018."
  },
  {
    "rating": "3.5/5",
    "review": "It's a nice mixture between thriller and comedic relief. Not the best movie I've watched for sure, but it was entertaining and during the movie I questioned myself more then one time where the plot would take me."
  },
  {
    "rating": "5/5",
    "review": "🍿🍿🍿🍿🍿🍅🍅🍅🍅🍅⭐️⭐️⭐️⭐️⭐️"
  },
  {
    "rating": "1/5",
    "review": "it doesn't make any sense.... all the character building is trauma dumping, all the plot points are flippant and disjointed. Not sure what's in the novel, but its as if they had a brainstorm in the writers room and said yes to everything. Two hours spent confused, irritated, and honestly sad. Anna did her best"
  },
  {
    "rating": "3/5",
    "review": "Dynamic and fun, and easily forgettable. At least it seems that the actors knew this wasn't to be taken too seriously (despite the deaths). Perfect for the \"meh...\" category. Slightly surprised it has a cult following and there may be a 2nd movie."
  },
  {
    "rating": "5/5",
    "review": "FAST-PACED, INTELLIGENT AND CLEVER. AN ENGAGING THRILLER WITH AMPLE TENSION AN PLOT TWISTS"
  },
  {
    "rating": "3.5/5",
    "review": "A fabulous headache of a film with sassiness and sneakiness in equal measures."
  },
  {
    "rating": "4/5",
    "review": "Way more entertaining than expected... both hilarious, and twisty enough to be compelling, with characters you actually are interested in. Just a good, modern b-movie."
  },
  {
    "rating": "4.5/5",
    "review": "What happens when we do a simple favor for someone? It might turn into something far more deadly and unexpected Director Paul Feig who’s primarily known for big comedies takes a different approach with a suspense story based on the book by Darcey Bell Anna Kendrick plays Stephanie and Blake Lively plays Emily; one is a single mother who excels in cooking vlogs while the other is a successful, rich, beautiful fashion photographer with a husband and a son Stephanie in secret is more closed off acting mousey while Emily is more upfront with a blunt attitude cutting to the chase although it borders on psychotic even a bit catty The two of them become friends and when Stephanie is asked to pick up her son from school Emily all of a sudden goes missing What happened to her; did she run away, was she kidnapped, or did someone kill her? Stephanie starts to dig up answers and finds out more than she can handle The film is amazingly shot, brilliantly acted, and shocking while also being funny Anna Kendrick and Blake Lively bounce so wonderfully off one another It’s kind of a shame though Linda Cardellini is only in 1 scene There’s twist after twist too as the plot gets progressively darker Sure it’s a bit long but suspenseful and it sprinkles dark humor for a mom noir thriller Secrets are like margarine; easy to spread bad for the heart, you start digging around secrets you won’t like what you find, you have to go after the powerful ones otherwise they overpower you, everybody has a dark side they’re just better at hiding it than others I was pleasantly surprised by this one especially from Feig Both lead actresses are fantastic with a sharp, witty script involving sex, lies, murder, betrayal, secrets, and loyalty A clever game of cat and mouse that’s quite colorful aided by a French chic quality"
  },
  {
    "rating": "4.5/5",
    "review": "This movie is so many things but most of all it's entertaining. I love the casts, they all are very charming and can pull off the character's personality to the most and I give an extra star for that. I also love costumes. Some part of the ending is a bit off to me but every else made up for it. Great movie, would highly recommend!!"
  },
  {
    "rating": "4/5",
    "review": "Nice, solid mystery thriller that gives Anna Kendrick a chance to show off her range and Blake Lively to basically just revel in her standard fare (which she does very well). It's also got a nice comedy aspect to it, but it can feel out of place at times against the more serious themes of the main plot. Overall, it manages to be very engaging and leaves with a satisfying ending."
  },
  {
    "rating": "2.5/5",
    "review": "It tries too hard. I enjoyed Anna Kendrick a lot. Always do. Blake Lively pulls off being the cool/hot mom. But the story overall is too silly. I just didn't believe it. Needed better directing."
  },
  {
    "rating": "4/5",
    "review": "You know I was confused a lot but interested. Suspense thriller it turned into. It all makes sense though in the end. Really enjoyed watching this."
  },
  {
    "rating": "2/5",
    "review": "How is it possible that every single character in this movie is an unlikable a-hole. The only redeeming part of this movie is when the main character was rapping in the car."
  },
  {
    "rating": "3.5/5",
    "review": "It also seems a little to similar to “Gone Girl” at times, but this film is still a lot of fun with solid performances!"
  },
  {
    "rating": "4/5",
    "review": "It is great fun, the cast are clearly enjoying themselves immensely and so did I."
  },
  {
    "rating": "4.5/5",
    "review": "Such a pleasant surprise. Had never heard of the movie, but it's great. Anna Kendrick pretty much lights up every frame she's in even if there were nothing else, but Blake's performance is a perfect counterpoint and the script and directing are incredibly smart and just plain fun. Rare to see such believable characters in such a twisted film. There should be more movies like this, and more actors like Anna Kendrick. Okay, maybe that second part is asking for too much - gotta keep it realistic."
  },
  {
    "rating": "3.5/5",
    "review": "Lots of twist & turns."
  },
  {
    "rating": "3.5/5",
    "review": "This is a decent movie, but it does at times seem to prioritise style over substance."
  },
  {
    "rating": "5/5",
    "review": "Loved it. Suck well acted and written. Watch it and enjoy."
  },
  {
    "rating": "4/5",
    "review": "Blake Lively and Anna Kendrick are the reason why this is a very entertaining movie. It's well written in as great twists and turns that you think are coming but then stop on a dime and become unpredictable. This movie is a breath of fresh air in the thriller genre."
  },
  {
    "rating": "0.5/5",
    "review": "This one started out with some promise. However, it ended with nothing more than convoluted nonsense! There is no way that these three actors actually believed in this script???"
  },
  {
    "rating": "3/5",
    "review": "Good all around movie. Good acting. Story was lacking even though it kept you guessing. Probably won’t watch it again but happy I did."
  },
  {
    "rating": "4.5/5",
    "review": "The thriller elements themselves won't change the wheel but the movie knows that giving you a fast-paced story that still let you room to breath and investigate with the characters without giving you too much time to easily predict where the story is going. The movie strength really is the use of uncommon elements for the genre, like comedy, sunny and colorful sceneries and one atypical main protagonist in the center of it all. It's a fun (and great) thriller without being a parody of the genre."
  },
  {
    "rating": "2.5/5",
    "review": "This is categorised as a comedy film but I'd first like to say that, to me, its more of a mystery drama. The main character is a bit of a light head type but I didn't, personally, find that aspect especially amusing, although the main plot about the strange disappearance of her new friend did intrigue me. There are a number of plot twists and it kept me guessing. I thought it was quite engrossing and Anna Kendrick gave a particularly good performance as said main character (Stephanie Smothers). So, overall I'd say this is not what it may first appear to be and its a good watch if you like a mystery drama type watch. Yes, I'd recommend this film to others."
  },
  {
    "rating": "4/5",
    "review": "Great movie! Very much enjoyed it! Good plot with lots of twists and turns."
  },
  {
    "rating": "3.5/5",
    "review": "I thought it was ok overall as the first half kind of dragged on until it to the plot in the final 30 mins which was interesting. I liked how it tied in 3 different siblings as that had potential for more plus her family, but still worth watching."
  },
  {
    "rating": "3.5/5",
    "review": "It's like an R rated Nancy Drew movie. A Simple Favor is twisty (allllllmost to a fault), low stakes, and a lot of fun. Once the mystery completely unravels it loses some of its luster but Anna Kendrick and Blake Lively do a great job carrying the movie through its weaker moments."
  },
  {
    "rating": "4.5/5",
    "review": "So fun! Loved it! Blake Lively looks amazing as always and especially in her gorgeous clothes! Suspenseful and hilarious."
  },
  {
    "rating": "3/5",
    "review": "18 minutes in the movie and I already hate stephanie. It does have some funny moments in it , but none of that takes away from the overbearing brother fucking energy . The ridiculous set up it's just not that great of a movie . I understand what they were trying to do but it didn't work at all."
  },
  {
    "rating": "3.5/5",
    "review": "It's the weirdest friendship drama ever with a touch of mystery adventure and thrill ride."
  },
  {
    "rating": "5/5",
    "review": "Best movie I've seen in my life. BLAKE LIVELY'S ACTING SKILLS? IMMACULATE. UNBELIEVABLE. This woman is so versatile. Such a mysterious movie. 100000% recommend."
  },
  {
    "rating": "3.5/5",
    "review": "Turned out to be better than I thought it was going to be."
  },
  {
    "rating": "3.5/5",
    "review": "Un thriller che flirta con la commedia, quasi totalmente al femminile con l'azzeccatissimo duo Blake Lively e Anna Kendrick; che oltre a creare due personaggi divertenti e piuttosto completi, sono aiutate notevolmente dalla buona qualità dei dialoghi scritti per loro. La trama è originale ed appassionante, immerge con facilità lo spettatore e lo rende ansioso di capire realmente come stanno le cose. Ottimi i costumi mentre il finale è probabilmente la parte più banale, con la registrazione e il colpo di scena con personaggio improbabile."
  },
  {
    "rating": "5/5",
    "review": "literally a golden comedy-thriller film that combines the best of both those genres and if people gave it a chance it would've been better than bridesmaids and red eye combined"
  },
  {
    "rating": "4.5/5",
    "review": "This movie has a great story. The reason why it's 4 and 1/2 is because there were some parts that made me roll my eyes, but other than that, this movie is one of the best performances by Anna Kendrick and Blake Lively. They play off of each other very well. This is a great mystery movie and has you guessing what's going too happen next all the way through. It's definetely one that's worth watching at least three-five times."
  },
  {
    "rating": "2/5",
    "review": "With Anna Kendrick and Blake Lively in the leading roles, I expected to like A Simple Favor. I didn't. The filmmakers didn't get the flavor of a thriller/comedy correct. It's not mixed right. And the characters kept making decisions that just didn't make sense. Plus, as the mystery started to unravel, so did the story. I liked the look of this movie, but its personality was a letdown."
  },
  {
    "rating": "5/5",
    "review": "A great black comedy."
  },
  {
    "rating": "4/5",
    "review": "Cool movie but a bit too long."
  },
  {
    "rating": "4/5",
    "review": "This is one of those movies that I just kind of sat down to watch with very low expectations but them found myself absolutely engrossed. Anna Kendrick plays Stephanie, the kind of bright, apple-pie American mom who has a perfect kitchen and a buttoned-up personality that she just can't let drop. She produces her own vlog about home making and cooking. She's nervy, ditzy, highly-strung and ever so slightly sickening. One day on the school run, she meets Emily (Blake Lively) who is everything she is not. Cool, trendy, sophisticated and a bit of a bad girl, Emily has a spark that Stephanie finds appealing and the two strike up a friendship. Then, one day Emily disappears. Determined to find her, Stephanie starts digging into her friend's past and uncovers a dark and twisted tale. This is a great mystery movie that is sometimes goofy and comedic and at others tense and thrilling. I loved the juxtaposition of the styles and tones which were skilfully managed by Paul Feig's clever direction."
  },
  {
    "rating": "4/5",
    "review": "I love a good twist or more! This one had me guessing."
  },
  {
    "rating": "2/5",
    "review": "I absolutely adore Anna Kendrick. And her performance is, as always, top notch. But the story here is just boring as hell."
  },
  {
    "rating": "2.5/5",
    "review": "A Simple Favour brings a well-cast duo of leads in Kendrick and Lively, but their work goes to waste in a flaccid, tonal juggling nightmare devoid of inspiration and inorganically adding pulp at every turn. The script and final project rely solely on the audience developing an attachment with Kendrick's Stephanie, but her cute tambour and micromanaging personality render her unbearable for a mystery and her confident transformation towards the end even more so. Some of the comedy hits, but the added jokes can only prop up the unfortunate misfires masquerading as cleverness. Stephanie's excessive vlog interludes to pack the soundscape with even more content become tiresome by the halfway point. The soundtrack also failed to successfully create any mood except one of checking the time left on the film. All in all, A Simple Favour is certainly a unique project, although it serves as a warning for those to whom this would be enough."
  },
  {
    "rating": "4.5/5",
    "review": "Loved this movie. Funny, interesting plot."
  },
  {
    "rating": "5/5",
    "review": "Summary: Stephanie, Target-loving vlogger, meets Emily, upscale entrepreneur. They have nothing in common besides the fact that their children are in the same class, but somehow they become ‘friends'. Takeaways: The talented actors intensify this twist of comedy and mystery. It's eerie, clever, and hilarious."
  },
  {
    "rating": "4/5",
    "review": "\"A Simple Favor\" is very peculiar and all over the place. A movie that doesn't always seem as if it knows what it's trying to be but is lifted by its two leads. I found it thoroughly entertaining. P.s. Linda Cardellini as a tattoo artist was cool."
  },
  {
    "rating": "3.5/5",
    "review": "bastante buena muy entretenida,diferente 7/10"
  },
  {
    "rating": "5/5",
    "review": "Oh man I loved it, one of the best movies I have seen in awhile. Definitely a MUST see. All the actors were spot on. Blake lively…Ryan is a lucky man."
  },
  {
    "rating": "3.5/5",
    "review": "Not much to say, and that's not a bad thing. A Simple Favor is a fun nonsensical ride that helps pass the time and ensures you will always be at least amused."
  },
  {
    "rating": "4/5",
    "review": "Solid performance all round with an engaging blend of comedy and thrills. While the film struggles to balance levity and tension at times, with some harsh turns between the two grating, the continuous twists will keep you involved and guessing up to the final minutes. A mystery that pushes the limits of believability yet manages to keep you interested, this thoroughly deserves a watch."
  },
  {
    "rating": "4/5",
    "review": "Seemingly inspired by \"Gone Girl\" with Paul Feig comedically parodied the diabolical brilliance in a dark, subtle manner adapting a source material pitting motherhood relation in the middle of a noir scenario stopping short while the twists continues to unfold, traditionally enabled by surprisingly mature performances from mostly Blake Lively and charismatic Anna Kendrick. (B+)"
  },
  {
    "rating": "4.5/5",
    "review": "Sharp, sexy, funny and suspenseful at all the right points - you can't help but dive in with the characters. Blake Lively is phenomenal."
  },
  {
    "rating": "4.5/5",
    "review": "Lots of fun, twists and turns, beautifully plotted, and amazingly acted, especially by Anna Kendrick, who by now has her shtick down so well that she's pretty much the cutest thing on the planet."
  },
  {
    "rating": "4/5",
    "review": "Totally legit. lt will draw you in and keep you guessing till the end. Really liked it."
  },
  {
    "rating": "5/5",
    "review": "Enigmatic and seductive, A Simple Favor is something innovative in thriller films, with a Gone Girl touch."
  },
  {
    "rating": "4.5/5",
    "review": "I found this quite entertaining. I was going back and forth as to if this would be worth watching and I'm glad I finally did."
  },
  {
    "rating": "3/5",
    "review": "Entertaining, if a bit absurd in the final entrapment sequence."
  },
  {
    "rating": "2.5/5",
    "review": "The ending is way too incomprehensible. Costume design, casting, and the suspense in the first half are quite good though."
  },
  {
    "rating": "4/5",
    "review": "Yeah pretty impressive. Treads and maintains a fine line between thriller and comedy, but keeps a good pace towards the end. It's also self aware without being ironic about everything, which would ruin it. I wasn't expecting a lot but it's well worth a watch."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie! So much fun to watch, as the magnetic frenemies out coned and out played each other. I got more than expected. I simply loved this movie."
  },
  {
    "rating": "1/5",
    "review": "Unwatchable, had to turn it off after the first 15 minutes. It's just a bunch of unrelatable, empty garbage with characters that are instantly annoying."
  },
  {
    "rating": "3.5/5",
    "review": "Had never heard of this movie before looking for what to stream on Amazon Prime. Nice find, nice performances from Anna Kendrick, Henry Golding and the fair Blake Lively whose wicked Emily was despicable no matter how attractive she was. It will keep you guessing, but have faith in Nancy Drew."
  },
  {
    "rating": "4/5",
    "review": "Strange, funny, twisted. A quirky story that keeps you guessing. Both female leads were a interesting pair."
  },
  {
    "rating": "1/5",
    "review": "This is an awful movie! So damn dumb"
  },
  {
    "rating": "3.5/5",
    "review": "This movie is simply meant to entertain. The twists and turns are truly the only elements of the plot which keeps the audience interested but there is an incredible flow throughout which tie the various different storylines together. Blake Lively and Anna Kendrick give an outstanding performance in a Simple Favour, however, Golding fails to show a range of emotions throughout the film making his character rather one-dimensional. Do not watch this movie on your own! Grab a friend to gasp with and discuss the unexpectedly expected turn of events A Simple Favour has to offer."
  },
  {
    "rating": "3/5",
    "review": "I enjoyed the watch -- and, as always, Blake Lively -- but didn't think it was write-home-about-worthy."
  },
  {
    "rating": "1.5/5",
    "review": "What is this movie?! I watched it because it seemed like a well rated movie on Rotton Tomatoes, but I was so disappointed. I couldn't make up my mind if this was a comedy or a mystery or some other type. Unfortunately, I wasted my money here. The plot is so predictable that by the time it developed, I had managed to guess what was going to happen. It was so obvious. You wouldn't need Sherlock Holmes or Poirot to solve this one. And the protagonist finds it so easy to uncover the clues that its laughable. If anyone wants to watch this, I have one word for you. Don't! A waste of time and money."
  },
  {
    "rating": "5/5",
    "review": "Nice suspense building up. Blake Lively is amazing, as usual, as are the other actors. I didn't see the ending coming, just like a lot of the twists and turns in the movie. Would definitely recommend."
  },
  {
    "rating": "3.5/5",
    "review": "A Simple Favor stars Anna Kendrick as a widow mother who befriends Blake Lively and they both have kids in the same elementary school. They become best friends and get to learn their deep darkest secrets. Henry Golding played Blake's husband who fell in love with Anna after Blake's mysterious death. This dark comedy has plenty of twists and turns directed by Paul Feig. You will enjoy the music, the clothes, the sarcastic tone and the fun twisted script. Definitely check this out."
  },
  {
    "rating": "3.5/5",
    "review": "\"Gone Girl\" rewritten as screwball comedy? Director Paul Feig starts \"A Simple Favor\" on the solid foundations of Anna Kendrick's comic skills, then paints more and more noir into the picture with the mysterious disappearance of Blake Lively's character. (Blake Lively plays the ultra cool girl. This is the only role allowed for tall, athletic California blondes.) But, as we delve into Blake's gothic backstory, the script keeps inserting laugh lines for Anna, and the ending doesn't even try to be serious. Worth seeing for the two leads and a hilarious collection of minor characters. Fans of Blake Lively can just sit quietly and drool. Fans of Anna Kendrick should watch the movie twice (I did) just to see how much extra expression and sight gags she crams into her role. Henry Golding is competent but over-shadowed. With the minor characters, Feig did a lot of inspired casting and directing, e.g. Linda Cardellini as the painter Diana Hyland, who makes her one scene spectacular."
  },
  {
    "rating": "3/5",
    "review": "Fun, cute story with cool characters and aesthetically-pleasing. Cheesy at times and the twists were nothing special but nonetheless a decent movie that kept my attention."
  },
  {
    "rating": "5/5",
    "review": "A Simple Favor is hands down one of the best movies I have watched in a long time. I would certainly rate it in my top ten all time favourite movies. A mix between drama meets mystery meets humour. I would absolutely recommend this movie to anyone, and most importantly, it stars Blake Lively and Anna Kendrick. You can't go wrong with this movie choice!"
  },
  {
    "rating": "5/5",
    "review": "Class movie, brilliant cast and excellent story."
  },
  {
    "rating": "4/5",
    "review": "I dont know what to write about this movie, it has some extra quality scenes in one hand, and those other moments in other, after all, i can say, it is one funny creative, crime comedy film."
  },
  {
    "rating": "4/5",
    "review": "Excellent, such a fun ride... and Henry gorgeous!"
  },
  {
    "rating": "3/5",
    "review": "A Simple Favor won't wow you, but does take you on an interesting ride we don't often see from comedic directors like Paul Feig. This Gone Girl meets high-end fashion story took about 20 minutes to get going, but once it did I found myself pleasantly surprised how it played out. Anna Kendrick and Blake Lively both play their roles respectfully well despite Kendrick's character making a complete personality change that we never truly see, by the end of the film. With all the lying and deceit A Simple Favor has to offer, you will be finding yourself second-guessing what is actually going on until everything is revealed at the end. I won't need to see it again but always appreciate a good mystery."
  },
  {
    "rating": "4/5",
    "review": "plot is a little bit far-fetched but goal of this movie is not to make believe, but to entertain."
  },
  {
    "rating": "3.5/5",
    "review": "I thought it was good it keeps you interested to what is going on."
  },
  {
    "rating": "0.5/5",
    "review": "really really REALLY BAD."
  },
  {
    "rating": "2.5/5",
    "review": "Go completely dark or go home. There should be no \"camp\" thrown in. Man, this had so much potential. \"Gone Girl\" got it right, plus Emily Ratajkowski!!! There is nothing in this movie that would make me want to watch it again."
  },
  {
    "rating": "1/5",
    "review": "This film is the very definition of grotesque."
  },
  {
    "rating": "3.5/5",
    "review": "even though it had mixed reviews I knew I eventually wanted to watch it becasue of Anna Kendrick. It definitely had \"tone\" issues...but it really clicked for me in the cemetery and then I surrendered to the genre. I also really liked the subtle back stories they dropped in to describe why Anna's character was capable of her actions. Anna is such a brilliant comedic actress!"
  },
  {
    "rating": "3/5",
    "review": "Twisted, witty and never taking itself too seriously. Blake lively’s biting wit and Ana’s transformation throughout the movie are my favorite part of this"
  },
  {
    "rating": "4.5/5",
    "review": "\"A Simple Favor\" is flawed, but like a flawed diamond -- a surprisingly entertaining hybrid of \"Julie and Julia\" with \"Gone Girl.\" Anna Kendrick (\"Up in the Air\") plays supermom-vlogger in the gladiator pit with Blake Lively (\"Gossip Girls\"), the femme fatale you love to hate, each with biting wit and a knife up their sleeve. But it's the writing that really kills here. Based on Darcey Bell's novel, it's a smart, stylish comedy-thriller full of juicy, three-dimensional roles and plot twists to burn."
  },
  {
    "rating": "1/5",
    "review": "Ridiculous and annoying"
  },
  {
    "rating": "4.5/5",
    "review": "What did I think of A Simple Favor? Check out my full review below: https://open.spotify.com/episode/1dOKuy7VBRG59gZjT3wOFG?si=R_yMgWbeRfCVzyo5yvqSWA"
  },
  {
    "rating": "5/5",
    "review": "**possible small spoilers - Loving Anna Kendrick and Blake Lively in this movie: two beautiful and extremely talented actresses! The outfits, the plot line, the personalities, and the soundtrack are all so amazing! Blake is such a great twisted character & Anna shows a sharp witted determined woman much deeper than first portrayed"
  },
  {
    "rating": "3.5/5",
    "review": "This is a bad version of Gone Girl. Blake Lively's acting is very bad."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! Loved everything about this movie--the casting, the plot, the humor, the suspense--it was all perfect. And the two leading ladies are both sexy as all get out!"
  },
  {
    "rating": "5/5",
    "review": "I found this movie fun, clever and original. I also thought it was high quality acting."
  },
  {
    "rating": "3/5",
    "review": "A deliciously entertaining comedic crime drama, led by the irrepressible Anna Kendrick, ably supported by Blake Lively. The rest of the cast don't get much of a look-in, but the two leads strike enough of the right tone to carry us through the increasingly convoluted plot which would spin out of control in the last 20 minutes but for the sheer goodwill the film has won for itself up to then."
  },
  {
    "rating": "3.5/5",
    "review": "Brotherfucker, there's a lot to like about this! It knows what it wants to be but still packs a surprise or two. Things to like: brevity - it's a fast paced script, ridiculously so, every hunch every clue leads to a breakthrough and that pushes the thing along (if only the real cops were soccer moms, they'd seemingly get a lot more solved, it's that easy); the soundtrack - who would have thought Serge Gainsbourg (nice use of Bonnie and Clyde) and DMX; the house - seriously; the 991 Targa - that's the one you want. Less good/ more silly - dude, recognize your, like, wife; surely there's a dog?; the post-scripts - ?. Blake Lively can drive to the basket, though, give her that."
  },
  {
    "rating": "4/5",
    "review": "\"A simple favor\" was very well-made! The plot was unique and had many twists and turns that kept me guessing. My only critique is that the plot's development is a tad bit slow, and the mystery doesn't unveil itself until 30 minutes into the movie. The final twist at the end—with Emily, Stephanie, and Sean quarreling—brought my rating up to 4 stars!"
  },
  {
    "rating": "0.5/5",
    "review": "One of the WORST films I have EVER seen. Was this garbage written by a 13 year old girl? Because it played like a teenager girl's fantasy. Anna Kendrick's acting choice here is insufferable, treating this like some kind of rehearsal so she could practice all her \"gimmicks\". I got scammed by the marketing (mystery) of this film."
  },
  {
    "rating": "2.5/5",
    "review": "I didn't get it. The characters didn't make sense, the plot was so hard to follow. I actually hated it."
  },
  {
    "rating": "3.5/5",
    "review": "While the plot is obvious and predictable, the execution and performance certainly make it worthwhile."
  },
  {
    "rating": "4/5",
    "review": "This was a surprisingly enjoyable movie. Nice campy film to pass a rainy Sunday. Anna Kendrick is always fabulous but his was my first time watching Blake Lively and she was terrific! I wish Hollywood would make more fun movies like this and less ones that lecture political ideology."
  },
  {
    "rating": "1.5/5",
    "review": "Absolutely shocking. Let's throw in the idea of a threesome, some inappropriate sex, mini skirts, some strange music that didn't fit the tone, a few drinks, Erm Just no"
  },
  {
    "rating": "3/5",
    "review": "Very Hollywood light hearted mystery. Anna Kendrick is well Anna Kendrick, fun performance. Decent story, runs a little longer than it should. Twists remind me of the Community's conspiracy episode."
  },
  {
    "rating": "4/5",
    "review": "I'm still not sure what to make of this one. This is a great example of superb and powerful acting, if subtle, without super powers or shootouts. It is definitely the small things that make this slice of life to woman empowerment fantasy work. It's almost a \"grown up\" \"coming of age\" story as Anna Kendrick's character finds herself. This movie reminds me of Michael Keaton in Birdman or Spiderman: Homecoming: Anna Kendrick and Blake Lively both show how far they can make the smallest moves go. Great movie, will definitely watch again."
  },
  {
    "rating": "5/5",
    "review": "Will be a favorite of mine & will go back to watching this time and again. A great genre and not the usual thrillers out there. Great call, Mr. Paul Feig! And thanks for casting Anna Kendrick and Blake Lively here -- they brought out the best acting in each other :)"
  },
  {
    "rating": "3/5",
    "review": "Yeah, it's alright but nothing to write home about. The film actually works for about three quarters of the time then falls apart. Kendricks character is beliveabke until the end she all of a sudden becomes Blake's oool, harsh character. How did that happen? And with most of these who-done-it movies, at the end they just keep piling on the twists and turns until they get ridiculous. The movie had potential, if the director only knew how to finish it properly."
  },
  {
    "rating": "5/5",
    "review": "Anna Kendrick, Blake Lively & Paul Feig together in this film noir is magic! I hope they have another project again soon!"
  },
  {
    "rating": "4/5",
    "review": "Lots of movies that try to walk the line between comedy and suspense feel like they have an identity crisis, but not this one. Each twist felt as unexpected as it was bizarre and hilarious."
  },
  {
    "rating": "4.5/5",
    "review": "A Simple Favour stars Anna Kendrick as Stephanie a nerdy, sweet, loving, stay at home who strikes up a new friendship with her sons friends mother, played by Blake Lively. Emily is a very successful working mother with an inappropriate manner and the polar opposite of Stephanies personality. None the less the vlogger and the PR rep become close friends, but once Emily goes missing Stephanie has a strange feeling about her disappearance and looks into her disappearance herself. This is my favourite Anna Kendrick film. She fits this role extremely well, her comedic ability paired with the thriller type story works amazingly. She has extremely good chemistry with Blake Lively who seems to have been born to play the role Emily. Both capture the attention of everyone with each scene they are in and when together they create a amazing duo. The movie is a little slow going as they develop these two characters, but once the investigation begins the film keeps you on the edge of your seat as secrets are revealed. Just when you think you've got these characters figured out they throw another curveball just to show you how unpredictable this film is. The film is very funny throughout but keeps the darker tone. As the story progresses you learn certain things that can make your skin crawl but then immediately after you'll laugh at a well timed joke. The film as I mentioned earlier is a little slow going in spots and when we get to the end there may have been a few to many twists which would've allowed the film to be better paced. Overall this comedy thriller will continuously surprise audiences as Anna Kendrick and Blake Lively show their acting ability in a extremely funny and unpredictable film. 9/10"
  },
  {
    "rating": "3/5",
    "review": "Conflicting acting styles between the two lead actresses mean watching this is likle watching two different movies. Anna Kendrick tries twitchingly hard to be funny while Blake Lively oozes sassy cool. I've never seen her in anything before now so this first experience has impressed. Kendrickmm serious moments here present a more accomplished actress. I've never seen Blake Lively in anything before but after seeing this I'm a fan. Maybe she's the missing link here. being funny and slick without slap-stick or visible effort. Still take these two over Cameron Diaz in s comedy of the chick flick kiwnd!"
  },
  {
    "rating": "3.5/5",
    "review": "An unexpected comedy thriller with some bizarre twists. It's entertaining and will keep you guessing. (First and only viewing - 5/30/2020)"
  },
  {
    "rating": "2/5",
    "review": "I love these two leads but the dialog was clunky and the dark humor didn't land. The actors are doing their best but the story is unpleasant and characters uninteresting."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie, the twists were oddly expected yet entertaining. It's not a serious thriller but extremely well thought out and an intriguing watch."
  },
  {
    "rating": "3/5",
    "review": "Quello che era iniziato come una semplice e simpatica commedia diventa ben presto un thriller molto più intricato del previsto. Se da un lato questo mi ha colpo veramente di sorpresa, dall'altro si esagera con la complessità di una trama inverosimile e fin troppo articolata. Buone tutte le figure protagoniste e coerente una regia solida e sicura, che non fa mancare anche un umorismo di fondo presente dall'inizio alla fine."
  },
  {
    "rating": "4/5",
    "review": "Um grande filme que me envolveu completamente no mistério."
  },
  {
    "rating": "3.5/5",
    "review": "Though A Simple Favor casts to much twists to a movie, an elite cast with out standing performances from Anna Kendrick and Blake Lively succeeded making this \"favor\" afloat"
  },
  {
    "rating": "2.5/5",
    "review": "it's an okay watch. Not quite a suspense thriller and not quite a dark comedy. Instead, this film lingers somewhere in the middle. And it never really satisfied my thirst for either"
  },
  {
    "rating": "4/5",
    "review": "A Simple Favor is flawed with its shifty tones and unclear actions but would be a near-perfect film without these flaws. The first twenty minutes are slow, awkward, and has one editing mistake that could be easily fixed (to avoid confusion), but after that, you don't want to stop watching it. Not only is it a deep, juicy mystery, it is also drama with terrific performances from Anna Kendrick and Blake Lively. Basically, everyone in this movie brings their A-game with the lines they had. I love it when a movie (the director really) can get the best performance out of everyone that is in this movie. Even if they are in it for only a few minutes. I love the production design and the symbolism in this movie. It is so well done that I noticed even the littlest details in these two things have meaning. The editing was also done well too. This movie is fun, mysterious, and full of twists and turns that keep you interesting even after the movie is over."
  },
  {
    "rating": "4/5",
    "review": "I love how Anna Kendrick plays the same dork in every movie she's in. That's got to be the real her. I'm in love!"
  },
  {
    "rating": "4/5",
    "review": "A fun Gone Girl-esque feature."
  },
  {
    "rating": "4/5",
    "review": "Refreshingly new topic that had its features. However, there seems to be ambiguity with the characters of Stephanie and Emily. Henry Golding caught my attention as a person who is different than his character in Crazy Rich Asians. Cool blend of the message of women's choices for their kids in society. It was a decent film to watch for the first time. Anna Kendrick and Blake Lively showed impressive contrast from this work."
  },
  {
    "rating": "0.5/5",
    "review": "2 hours of my life I'll never get back. I'm dumber for having watched it.🤮"
  },
  {
    "rating": "3.5/5",
    "review": "Feels like watching Gone Girl for another time."
  },
  {
    "rating": "4/5",
    "review": "Super funny with a lot of twists and turns along the way. I loved the performances especially from Anna Kendrick and Blake Lively. A definite recommendation for any mystery or whodunnit fans."
  },
  {
    "rating": "4/5",
    "review": "A great feel good movie"
  },
  {
    "rating": "2.5/5",
    "review": "C movie. Good story, bad adaptation. It was a bit empty. Blake was cool and her character was fun. I hate Stephanie character so much, she was so annoying. I wish Emily shot her lol. The ending scene was awkward and too any twists in a bad way. I blame the director."
  },
  {
    "rating": "5/5",
    "review": "Entertaining with a twist!"
  },
  {
    "rating": "5/5",
    "review": "Good movie, kept us on our toes and guessing !"
  },
  {
    "rating": "4/5",
    "review": "Suspend your need for logic and just enjoy the view!"
  },
  {
    "rating": "5/5",
    "review": "I would highly recommend this movie. This film is comparable to the movie \"Gone Girl\" but with more humor and mystery. There were good twists and turns along the way and it was faced paced and entertaining. I think that Blake Lively and Anna Kendrick both play very versatile actress roles. This movie is all about everyone being not exactly who they appear to be. This was a neatly produced and well-acted crime story. Anna Kendrick plays a great role as the goody two-shoes who turns detective and finds out some shocking information about her best friend. It has a couple of humor scenes that provided a nice balance. When selecting a movie, there are a few things that I look for. I like to make sure I know what actors play in it because I feel that is what influences me to watch it. I love a good drama with a lot of action in it as well – I feel as though this movie provided that perfectly. I personally think the ending could have been better because it was very predicting but it wasn't terrible."
  },
  {
    "rating": "5/5",
    "review": "Such a great movie just scary and edgy enough but also really funny."
  },
  {
    "rating": "4/5",
    "review": "My favorite movie in the genre of mommy noir."
  },
  {
    "rating": "4.5/5",
    "review": "Funny movie. Great cast"
  },
  {
    "rating": "3.5/5",
    "review": "'Gone Girl' kind of vibes with comedy mixed in to keep you entertained. Great movie."
  },
  {
    "rating": "3.5/5",
    "review": "Good concept. It could've been executed a little better, but overall it was a fun thriller to watch."
  },
  {
    "rating": "5/5",
    "review": "A refreshing different movie for once! It's witty enough to suck you in with it's true to life dark humour, artsy French music and a few dramatic artsy scenes. It's lightweight and entertaining without the heavy suspense and melodrama of a conventional thriller, yet it sets out to drop hints early to throw you off the scent of the ending. It's captivating and easy to watch, yet it makes you think. One thing I hate is that I normally work out the entire plot of a movie with the first few cliche scenes, which leaves me watching only to confirm my assumptions. I'm happy to say this experience was not like this and was a thoroughly enjoyable and captivating watch, which despite being a mystery thriller was a positive experience throughout."
  },
  {
    "rating": "1.5/5",
    "review": "I wanted to like it, but it was too big for its britches."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies I've seen in my life. Everything there is either cliche or just looks dated: from the music to the dialogue. This plot is the most basic thing any 4th grader can write within 10 minutes. The storyline in \"A Simple Favor\" is moved by coincidences and even magic at times. Dumb and cringeworthy humor just adds up to all the crap, produced by this garbage. Terrible acting at times. Some of the obnoxious special effects made me think I was watching some sort of Nick sitcom from the early 2000s. Trust me people, this movie is the \"Angelic To The Core\" of comedy movies, which serves as another reminder that the genre itself is dying out and becoming archaic. I hope that the trend for these low-budget monstrosities slowly deminishes and we finally see something good."
  },
  {
    "rating": "4/5",
    "review": "Dark and Funny with a nice pace and a killer cast"
  },
  {
    "rating": "2.5/5",
    "review": "With flashes of thriller and comedy, A Simple Favor can never quite decide which genre it fits into, and the creases formed when the tone jumps around are glaring. (2.5/5)"
  },
  {
    "rating": "4.5/5",
    "review": "Both fun and a mystery! What more can you ask for? Great cast! Some of the supporting characters obviously had their story lines cut, but, you can't have it all."
  },
  {
    "rating": "2/5",
    "review": "Blake Lively's performance was somewhat memorable but the movie lacked any real suspense. The only thing less believable than Anna Kendrick's transition from innocent angel to notorious badass was the director's assertion that we should care."
  },
  {
    "rating": "3/5",
    "review": "Clever. Ridiculous. But the 2 leads were great."
  },
  {
    "rating": "0.5/5",
    "review": "Dreadful made-for-tv attempt at a comedy thriller"
  },
  {
    "rating": "5/5",
    "review": "My absolute favourite movie. Well thought out plot with interesting and un-clique characters. The film builds extremely well with a gripping climax. The cast is sensational"
  },
  {
    "rating": "4.5/5",
    "review": "Blake Lively and Anna Kendrick team up in a suspenseful mystery and crime movie that keeps you on the edge of your seat until the end."
  },
  {
    "rating": "4.5/5",
    "review": "Great! Was very well made and entertaining. I did think there was to much sexual content in it for no reason but otherwise this was a great film"
  },
  {
    "rating": "3.5/5",
    "review": "This movie was so twisted. It was one of those movies that you had to finish in order to understand the whole storyline, and plot. It was not what I expected, but it was a great movie! Plus Blake Lively and Anna Kendrick are amazing leading ladies!!"
  },
  {
    "rating": "0.5/5",
    "review": "Oh no! no! no! no! oh no!"
  },
  {
    "rating": "5/5",
    "review": "Plot twist 1 is that plot twist 2?? Just fun and crazy creative. This was a great flick that beat expectations and was full of surprises!"
  },
  {
    "rating": "2/5",
    "review": "I watched it begrudgingly and my initial assumption was accurate. Nothing great but passed the time."
  },
  {
    "rating": "1/5",
    "review": "Absolutely ridiculously terrible"
  },
  {
    "rating": "2/5",
    "review": "This is a very self-assures mystery that, in an attempt to consistently outwit the audience, slowly becomes more and more unconvincing and unbelievable. The twists and turns in the last act become self-parodic."
  },
  {
    "rating": "0.5/5",
    "review": "Please, please, PLEASE save yourself 2 hours of your life. This piece of trash made me want to jump into freezing waters and never return. You literally sit there for two hours questioning how everything moved so fast, and there is no context as to simple transitions in their lives. If Kendrick and Lively's performance had to be compared to something, I would say a wet loaf of bread. Hard to even look at, and no one can stomach it."
  },
  {
    "rating": "4/5",
    "review": "When I first saw the trailer for this movie, it looked very intriguing, but I was also worried that it would be another trailer that tells the whole plot of the film. I decided to take the risk anyway because I did really like the concept of the movie. Based off the book written by Darcey Bell in 2017, 'A Simple Favor' is about a mommy blogger named Stephanie (Anna Kendrick) who searches for her mysterious best friend Emily (Blake Lively) after she goes missing. I have to admit that I really liked this movie, more so than I thought it would. Based on the trailers and the overall concept, I thought it'd be good, but I didn't expect to like it as much as I did. The script, written by Jessica Sharzer, is a very well-written and clever script. It tells the story it's supposed to well, and there are many twists that keep the story running smoothly. While the plot twists didn't leave my mouth hanging open like most do, I still think they were good enough, and they weren't really wasted. I was also surprised at how many moments were funny. This wasn't the type of movie I thought would have humor in it because it's a thriller and drama. I figured humor would hurt the film, but it didn't. My only problem with the story, and I know it's just a movie and it's Hollywood, but everything that happens in the movie could never happen in real life. It's almost too good to be true. The cast performances were pretty good. Blake Lively was the standout, and her chemistry with Anna Kendrick was great and believable. They have a twisted storyline, and their performances help show it. Kendrick's character goes from a mom who always signs up for events at her son's school to investigating a missing person's case, and you can see her character change throughout the film. Lively's character is so mysterious and twisted that you can't make heads or tails on what's really going on until the climax of the film. And it's brilliant. Henry Golding as Emily's husband Sean Townsend was pretty good, but he was also somewhat mysterious as well. Based on the trailers and some moments in the film, you think he has something to do with it, so you become invested in his character. The costume design was interesting. Blake Lively wanted a look for her character that was iconic, and she was inspired by the film's director Paul Feig's look, so she decided to dress up like him. And ironically, it worked very well. In fact, that made her character even more mysterious and helped you wonder who she really was. While I think the plot was smooth and the pacing was fine, I do think that some sequences were just too unrealistic, and the timeline is sort of confusing. Does it take place over a certain matter of days, months, etc.? It was too unclear. Overall, this was a very good film. It's maybe not the kind of movie you have to watch more than once, but it's very enjoyable and very clever."
  },
  {
    "rating": "1/5",
    "review": "Blake lively really steals the show here within this movie. Her character is the only one that's intriguing and worth the watch. Anna on the other hand, brings a weirdness that I just wanted to run away from. Her characters secret was the most disgusting thing within the whole movie. Overall, the plot was too predictable (I always knew what was going to happen), I didn't agree with the way the writers tried to manipulate the audience (basically I was rooting for the characters the movie wanted you to dislike), the ending was very unrealistic, and Anna's performance was so awkward and disturbing it changed my opinion about her possibly forever. If it wasn't for Blake lively awesome performance (sorry they ruined your character) I would have given this movie zero stars"
  },
  {
    "rating": "3.5/5",
    "review": "Mysterious and charming, this movie somehow fell under the radar but is worth the watch."
  },
  {
    "rating": "1.5/5",
    "review": "From a domestic abuse perspective, the only thing \"fresh\" was a woman (Blake Lively) doing the bad deeds instead of a man. Reverse gender roles and it'd be a tired but far more statistically sound Law & Order SVU plot. Dislike how it pitted SAHM against career moms. And punished the promiscuous woman. Was this produced by Weinstein?"
  },
  {
    "rating": "4/5",
    "review": "Actually turned out to be a decent movie. It has enough suspense to keep you guessing with enough humor and subtle comedy to keep you interested. Could it have been better? Yes. But I'm not going to sit here an knit pick. Anna Kendrick was great in this movie! Best acting I've seen from her this far. Blake Lively is well, Blake Lively nuff said. 😍"
  },
  {
    "rating": "0.5/5",
    "review": "This might have been the worst movie I have ever seen which is really sad due to the talented likable actors in it. I have never seen a movie completely change genres so jarringly and horrible like that. I found myself intrigued at the beginning just to end up watching a corny comedy at the end? I am so confused and upset as to what just happened to me"
  },
  {
    "rating": "0.5/5",
    "review": "What has happened to this world we live in?"
  },
  {
    "rating": "1.5/5",
    "review": "A fast-paced, realistically inconceivable mess of a movie that suffers from some serious identity issues. It skips from genre to genre for no apparent reason while taking the audience for a ride on a ridiculous story line. From thinking it's a rom-com to straight up horror, the entire film lacks intention, meaning, and is essentially just Gone Girl repurposed,"
  },
  {
    "rating": "3.5/5",
    "review": "It was certainly a gripping story and no complaints about the filming or acting. I do feel like there were some interesting questions not as answered as I would like but enjoyable."
  },
  {
    "rating": "5/5",
    "review": "It is Fresh. 🍅 It is Gone Girl but this takes itself less \"seriously\". There is mistery, there is fun and there are two actresses at theirs very best. Anna Kendrick should be the star of it but Blake Lively steals the show with (maybe) the best performance in her career. The ending disappointed me because the book's ending was WAY more satisfying but I guess we can't always have what we want. Highly recommend it!"
  },
  {
    "rating": "3.5/5",
    "review": "This film didn't quite know whether it wanted to be Gone Girl or Mean Girls, but it ultimately works out due in no small part to Blake Lively's killer performance."
  },
  {
    "rating": "5/5",
    "review": "this kind of film genre is rare and kudos to Paul Feig for making this happen! Anna Kendrick was amazing in this as usual but more so than her other projects. Nice to see her tackle more diverse roles. Blake was amazing too and she and Anna really played off of each other so well!"
  },
  {
    "rating": "5/5",
    "review": "This movie is absolutely hilarious and fun from start to finish. Even if you think you've figured out the mystery the twists and turn will still keep you guessing until the end."
  },
  {
    "rating": "4/5",
    "review": "Dark, fun and twisty with great performances by Blake Lively and Anna Kendrick."
  },
  {
    "rating": "2/5",
    "review": "The first half of the movie, I was mostly going with it. It had a Gone Girl vibe. But then it just got really nutty, and off the rails. They try to pile on twist after twist at the end (a lot of which was easy to see coming). There are plot points that are thrown out then never mentioned again. There were times when something would happen and I would go \"wait was that real?\" and it's never explained. Emily and Stephanie feel more like ideas than actual characters. It's definitely not boring but I'm shocked that this has such a good Rotten Tomatoes score."
  },
  {
    "rating": "4.5/5",
    "review": "Chilling, smart, with a pinch of comedy, A Simple Favor is insanely entertaining. Kendrick and Lively give scary good performances in this clever mystery thriller that had me completely on edge. Every time I thought I had this film figured out, it would deliver another surprise."
  },
  {
    "rating": "1/5",
    "review": "This movie was really bad. Like my husband and I were angry that we'd wasted the time it took to watch it. Kendrick's acting was terrible. The fact that they were \"best friends\" is a joke—they barely knew each other—and the husband/wife relationship wasn't believable. Blake Lively demeaned herself to be in this one."
  },
  {
    "rating": "5/5",
    "review": "A mind blowing crime/thriller filled with plot twists and unpredictable turns! I'd read the book an thought I was prepared, but I was NOT! A funny, fantastic, unique movie experience! Do yourself a simple favour and watch it!!"
  },
  {
    "rating": "0.5/5",
    "review": "Stephanie, an annoyingly keen mommy vlogger (ew) meets Emily and starts calling her her best friend after knowing her only 2 weeks, then gets involved in EVERY aspect of Emily's life after her disappearance, including ruining a perfectly good insurance scam, yet the audience is supposed to root for Stephanie? No. Just no."
  },
  {
    "rating": "2/5",
    "review": "Started off with an interesting premise and was decently shot but devolved into a cheesy wannabe Gone Girl that lasted about 25 minutes too long because Paul Fieg couldn’t make it a full film without injecting his typical not-so-funny humor into it. Had this film stayed serious and trimmed the fat, it could have been much much better."
  },
  {
    "rating": "3/5",
    "review": "Blake Lively getting hit by the car at the end, ruins the movie."
  },
  {
    "rating": "3.5/5",
    "review": "Fun and different kind of mystery. Well cast, Blake Lively is the beautiful, sexy chick. Pretty cast"
  },
  {
    "rating": "3.5/5",
    "review": "The strange combination of melodramatic mystery and modern comedy surprisingly sets up a fun film full of unpredictability."
  },
  {
    "rating": "5/5",
    "review": "I love the mystery and thriller theme of A Simple Favor. The plot was carefully planned for it come up with a very appealing story that will keep you glued to it until the mystery is solved. I was amazed on how the story was constructed and weaved with playful details for it to come up a great thriller story. Anna Kendrick and Blake Lively were so remarkable in their performances that they carried this movie a lot along with its solid story. A few comic antics and lines led by Kendrick in which she's known for helped the film to be more entertaining and fun while walking down in its mystery and thriller theme. This flick is highly recommended mainly for its story but you'll also love its casts and few comedies to light up a thriller/mystery film. Lesson learned from this movie - Never underestimate the seamingly weak and gullible person."
  },
  {
    "rating": "4/5",
    "review": "Modern film noir- a great new genre. We need more twisty, dark and funny outings like this , especially when they pit smart women against each other."
  },
  {
    "rating": "4/5",
    "review": "Thoroughly enjoyable throughout. Very well acted by both Kendrick and Lively and maintains a firm grip on the audience until the credits roll."
  },
  {
    "rating": "3.5/5",
    "review": "Twisty little mystery/thriller that’s just fun to watch. Good lead performances. Nicely directed by Paul Feig."
  },
  {
    "rating": "5/5",
    "review": "Fun, unpredictable, I don't think I've enjoyed a movie as much as this one in a long while."
  },
  {
    "rating": "4.5/5",
    "review": "I saw this movies a few days ago and I really enjoyed. It was very interesting and fun to watch. My favorite character was Emily and the story really makes you believe all the assumptions about her and even you, the audience, wants to be her friend. There were some scenes that I felt were unnecessary and didn't add to the plot, but that's my only problem with movie. Loved the outfits and the music. Overall, this is a great movie."
  },
  {
    "rating": "3.5/5",
    "review": "It wasn’t as bad as expected."
  },
  {
    "rating": "3/5",
    "review": "Felt like a gone girl rip off with bad acting and costuming."
  },
  {
    "rating": "2/5",
    "review": "What tone does this film have? Is it an OTT thriller? Is it a dark comedy? Is it melodrama? I'm not sure, and I don't think it is either. It's one of those twisty turny plots where everyone has their own scheme going on, and it ends up with the three lead characters in a confrontation of sorts, but I felt like they'd all behaved so badly across the film that I didn't really want any of them to win. Anna Kendrick is pretty good at being pretty adorable in films. The danger with having an actor who is good at a particular thing is that sometimes their role gets skewed towards that particular thing in a way that damages the overall film (see also: Will Smith being funny in Suicide Squad). It happens here, with Anna Kendrick's character being SO cutesy and SO normal that when she needs to be more confident later on in the film it's such a 180 that it jars and she ends up coming across as cocky and gloating. Blake Lively is pretty good but a bit much as someone who is desperate to not be photographed, spotted or gain any notoriety, and yet wears a tuxedo to the park. And Henry Golding is as conspicuously inconspicuous as he was in Crazy Rich Asians. There was some fun stuff in here, but it drowned in all the other movies that were taking place at the same time."
  },
  {
    "rating": "3/5",
    "review": "another gone girl movie, but some scenes is really funny."
  },
  {
    "rating": "2.5/5",
    "review": "Not bad but it was like a turducken. Not quite a complete suspense, not a comedy. Kinda like The Devil Wears Prada mated with Big Little Lies and had a threesome with a Lifetime movie."
  },
  {
    "rating": "4/5",
    "review": "AP: Good story, good acting and interesting mix of charm and thriller."
  },
  {
    "rating": "3/5",
    "review": "not bad; it had some good twists & turns as well as a few good funnies. i really love both Kendrick & Lively so i knew i was going to like this regardless."
  },
  {
    "rating": "4/5",
    "review": "Twisty noir thriller / dark comedy with great performances. Definitely reccomend!"
  },
  {
    "rating": "1.5/5",
    "review": "Uhm no. Simple favor is certainly well filmed, acted, and there is undeniably suspense here. I give it points for being a guilty pleasure. But OMG these people are horrible. Emily, aside from being thoroughly unlikable, has a - you guessed it - horrible backstory, and, when you kind of think, well she is Stephanie's friend so the twist will exonerate her - NO - she is even more horrible. Stephanie, appearing to be the goody-two-shoes of the film, is in reality some sort of super-whore that sleeps with anything that moves right after her trademark hand to mouth 'maybe I SHOULDN'T do this'. I felt like I was watching soft-core porn. I feel really bad for the kids. If they were real, they would be so messed up. The 'General Hospital' plotline and French songs playing in that snobby Frank Lloyd Wright-wanna-be house don't help, either."
  },
  {
    "rating": "5/5",
    "review": "Reminded me of gone girl. What a great twist! Definitely a must see"
  },
  {
    "rating": "4/5",
    "review": "It looks like some people were kinda confused at the tone in this movie, and how it mixed a few genres. I'd say if this movie has any weak points, it's that the plot gets a little convoluted in the end. There are more than a few plot twists and turns, and some are better than others. Really I liked that it was just a twisted comedy and Blake Lively was really believable as a shady alpha-female. Her and Anna Kendrick were hilarious in this, and the humor is the best thing about it. Despite a few kinda predictable plot twists, it kept me interested and entertained. I think it comes together pretty well, and it was one of my favorite movies of the year it came out."
  },
  {
    "rating": "3/5",
    "review": "At the end I just felt really disturbed. This movie is \"light-hearted\" but at the same time sickeningly twisted. The exact same plot could have easily been used in a horror movie by simple changing the music and lighting."
  },
  {
    "rating": "1/5",
    "review": "Wow. What a wildly horrible storyline with more than enough virtue signaling to make you physically sick. The actresses' performances were good, but not good enough to make up for the lazy written roles."
  },
  {
    "rating": "4/5",
    "review": "A good yarn, as my mother would say. Blake Lively is stunning and while Kendrick seems miscast, eventually I accepted it. Henry Golding doesn’t get as much to do, but he looks delicious while he does it. Twisty, witty, darkly funny and just plain fun."
  },
  {
    "rating": "4.5/5",
    "review": "Great twist! Wow! What a film! Anna Kendricks killed it"
  },
  {
    "rating": "5/5",
    "review": "This movie is honestly amazing! It simultaneously is a thriller and a comedy, and while the viewer can see certain things coming, the pace of the film, the directorial approach, and writing are all very refreshing! The acting is sublime, and the casting choices were perfect! 10/10"
  },
  {
    "rating": "4.5/5",
    "review": "Anna Kendrick came very close to being TOO \"Anna Kendrick\" here, but overall this movie was so much fun. First movie I've ever enjoyed Blake Lively in, but she did a great job and Henry Golding was excellent, also. Paul Feig has such a knack for making extremely watchable films. P.S. the potty-mouthed little boy was hilarious."
  },
  {
    "rating": "1/5",
    "review": "Stupid. If you’re going to be a ridiculous comedy, just be a ridiculous comedy. Don’t pretend to be a tense murder mystery thriller because then you’re neither thrilling or funny."
  },
  {
    "rating": "5/5",
    "review": "Definitely kept you on the edge of your seat!"
  },
  {
    "rating": "5/5",
    "review": "Brilliant! Absolutely brilliant! Highly suspenseful! Smartly done, never a dull moment in this film! Blake Lively's performance is just stellar!"
  },
  {
    "rating": "4/5",
    "review": "Caty comedy thriller-stay with it-it pays off in the end!"
  },
  {
    "rating": "3/5",
    "review": "a weirdo and a psycho. no one to root for. Blame was scary. She did a good job."
  },
  {
    "rating": "3/5",
    "review": "Fun, but the twists were nothing new and I cannot say that it was worth the time (the only reason I stuck around for the whole thing was the adorable outfits)"
  },
  {
    "rating": "5/5",
    "review": "I thought it was creative and compelling."
  },
  {
    "rating": "1.5/5",
    "review": "ugh. POS. Horrible acting, not funny, just gross. Also, the plot was pathetic. Transparent acting. You could see the actors acting. waste of time."
  },
  {
    "rating": "3/5",
    "review": "Thought the movie was okay. The ending was interesting but other than that I was disappointed with the acting in this movie and I love the actors that were featured in this film."
  },
  {
    "rating": "1/5",
    "review": "Anna Kendrick is absolutely terrible at acting and makes this film that had potential to be amazing a bit of a joke."
  },
  {
    "rating": "5/5",
    "review": "That was a seriously fun movie from the start. The twist was expected, but that didn’t make how everything happened any less interesting. Blake Lively is absolutely crazy and spectacular in the role of Emily and Anna Kendrick is as good as always. Highly recommend this film as an entertaining and wonderfully filmed, watch. Funny with the perfect mix of grittiness and mystery. Absolutely devastatingly dark in some places and lighthearted in others. Truly a testament to just how complex our lives can be, and a lesson to never judge a book by its cover. Because even the happiest and most energetic single mom can have a dark past, and the most well put-together, sexy, married women who seems to have it all, would be better off behind bars."
  },
  {
    "rating": "1.5/5",
    "review": "Wow, pure trash. Shoulda just went on redtube"
  },
  {
    "rating": "5/5",
    "review": "Love, love, love this movie! Blake Lively and Anna Kendrick are amazing!"
  },
  {
    "rating": "3.5/5",
    "review": "Once you get passed some very inappropriate scenes, that really add nothing to the plot, you should be able to enjoy this film. It is an unexpectedly funny movie, even though some of the humor doesn't work for a thriller. And yes it is a thriller. It levels twist upon twists and most of them you will not see coming. Or you are just a more sophisticated movie watcher than I."
  },
  {
    "rating": "3.5/5",
    "review": "too many plot twists, couldn't really follow the plot in the last half an hour ."
  },
  {
    "rating": "5/5",
    "review": "Beautiful mesh of comedy and thriller, loved the sick hilarious dark twists. Kendrick and Lively have great chemistry."
  },
  {
    "rating": "3.5/5",
    "review": "I really enjoyed this film good cast especially Anna Kendrick didn't think much to the guy who played the husband but other wise well acted and well executed. Reminded me of old style caper films enjoyable and funny"
  },
  {
    "rating": "0.5/5",
    "review": "Biggest waste of my time...what a tragic effort."
  },
  {
    "rating": "3/5",
    "review": "The script seems to lack depth and moves through many different clichés throughout. There is a forced feel to the dialogue which seems to remove some of the intensity from the film, reducing it to an unrealistic film which reads like a TV drama or soap opera. Furthermore, the characters seem to represent familiar tropes – the cliquey parents provide a form of comic relief, but their over-the-top nature makes it feel forced rather than natural. This leads me onto my next observation – the script of the film in many areas feels confused, being tonally mismatched in places. By this I mean that it is not obvious what the script is going for – if it is trying to be self-deprecating and ironic, or if it is trying to provide genuine suspense and drama. The seeming self-deprecation of the film makes the, at times, contrived dialogue feel less like instances of bad writing, and more as a form of comedy and potential criticism to genre tropes. Nevertheless, it is very unclear, and in my opinion takes a lot away from the script – because it seems to be in conflict with itself. Is it an all-out thriller/mystery film, or is it a dark comedy? It could be both, but it does not succeed in both. Only at the end of the film do we see a true instance of this acidic wit and dark humour, which in itself is effective. However, it almost feels too late, and perhaps more could be integrated into the script throughout. A positive of the script is that it does not drag and is very fast moving – it takes almost no time at all to move into some form of conflict, and continues to do so throughout the film. So, in this sense, its pacing is good, and it does well to keep audience interest. However, with the fast-moving structure of the script comes a few issues. The script seems to move far too quick from one scene to the next, not allowing enough time for the audience to fully comprehend the significance of some scenes. This pacing also allows for little character development – we only truly see an arc with the main character, getting to know her development well. It is undoubtedly an entertaining film, and at many points, the mystery of the storyline distracts from the lazy dialogue. The script is good in this sense – it has an interesting and compelling storyline, but that is undermined at times through the dialogue and character believability."
  },
  {
    "rating": "1/5",
    "review": "Ridiculous, directionless."
  },
  {
    "rating": "4/5",
    "review": "Vlogger Stephanie brings some excitement into her life when she befriends glamorous Emily on the playground of their children's school. they soon become inseparable until one day Stephanie is asked to look after Emily's child and mum disappears, never returning to collect her child. When she begins to investigate her friend's disappearance she soon discovers she didn't know her friend as well as she thought she did and uncovers lots of surprising and shocking secrets. When I saw the trailer for this I wasn't sure what type of film it was trying to be, it came across as a little odd but don't be put off, it is a superb, funny and twisted crime noir. Both leads are superb and unlike anything I have seen them in before. It's directed by Paul Feig who brought us Bridesmaids and The Heat but I would say this is on another level to those movies, the comedy here is a lot more subtle, somewhat darker and a bit more twisted. One I would recommend."
  },
  {
    "rating": "2/5",
    "review": "Legally inaccurate and Anna Kendrick really did not sell the character as the story progressed. Very unlikable and annoying protagonist. It was fun to mock."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved it, Lively plays the narcissistic but captivating Emily so well and Kendrick does a great job of the goody two shoes tenacious Stephanie. Ill paired as best friends but it works amazingly well. The kids are great too - love the comedy, intrigue and guessing right up to the end. Brilliant."
  },
  {
    "rating": "1/5",
    "review": "First, 'Ha' then 'Meh' to finally 'Um, what?...Yeah, right!' So after a few chuckles and an somewhat interesting (although mostly predictable) mystery, it stumbles right into the film's last, third act which quickly falls apart and morphs into an absolutely awful climax and conclusion. SKIP this stinker - it does NOT know what it wants to be (genre dysphoria?) and, consequently, blows the ending. And I mean it totally blows...chunks...of absurd stinky melodramatic cheese. It's as if the producers got their hands on a Lifetime (\"television for women\") script, and decided to regress its female characters, add tawdry jokes and dark humor, then insert a spatter of vulgarity while making sure to also camp it up...\"this one goes to 11\". --August 2019"
  },
  {
    "rating": "2/5",
    "review": "Terrible confused happy ending that spoils the film. Probably hollywood typically changing a book's ending because they think it won't sell with a dark conclusion (I'm guessing, I haven't read the book)."
  },
  {
    "rating": "4/5",
    "review": "The faux-sophistication and weakly contrived twists really don't prevent it being a lot of fun. It might not be a classic, but it's definitely a thriller."
  },
  {
    "rating": "3.5/5",
    "review": "I feel as if there was a lot of potential and parts of a brilliant short series here. it was packed into a film unfortunately. There was so many amazing plot points here and so many stories to explore but some were forgotten for a very meh ending, Overall i did love the film and Anna Kendrick and Blake Lively were AMAZING in this. does need to be a short series though as its a complex story that is stunted by being packed into a film. I would recommend though as it was a good watch. the ending is a bit meh though and i feel the story could have been fleshed out more. Like i said would really love to see this in short series form."
  },
  {
    "rating": "4/5",
    "review": "Excellent film and cast. Anna is perfect in the role and Blake is really good as well. Bit predictable but highly enjoyable film."
  },
  {
    "rating": "1.5/5",
    "review": "Predictable and un-original. I wasn't even paying full attention and still guessed the next move the whole way from start to finish. Like other reviews have said, a simplistic re-hash of gone girl, minus the suspense. On top of that the completely ridiculous outfits worn in the film break immersion, like some sort of fashion advertisement."
  },
  {
    "rating": "5/5",
    "review": "Great movie!! Full of suspense"
  },
  {
    "rating": "5/5",
    "review": "Woaah!! A plot twist that blew my mind (haha)! Would never have thought of Kendrik and Lively in a Momma comedy together but they did good!!"
  },
  {
    "rating": "3.5/5",
    "review": "Terrific, suspenseful, noir style film until the convoluted, contrived and disjointed third act. If you don't take the film too seriously, it is pretty enjoyable but dont expect an intelligent payoff in the final act."
  },
  {
    "rating": "3/5",
    "review": "Although the mystery is as artificial and ultimately obvious as any other lazily 'twisted' plot in which 'surprises' are stacked on top of one another as the writers go along, leaving no chance for the audience to do detective work, this film is very entertaining and is entirely carried by the playful and fun house-wife caricatures animated by the two talented lead actors."
  },
  {
    "rating": "1.5/5",
    "review": "Please DO NOT waste your time watching this knock off of Fincher's 'Gone Girl'. Movie is intriguing for the first hour and then it loses the plot and random, irrelevant events occur and by the end you will be laughing the movie's stupidity instead of with it!"
  },
  {
    "rating": "3.5/5",
    "review": "Honestly, it was refreshing to see Anna Kendrick play as a character who isn't totally melancholy and \"woe is me\" all the time. She's this upbeat, perky and fun mom who becomes unlikely friends with a very rich and mysterious woman, who then disappears suddenly. I wasn't expecting the ending! It was all just a mix of good fun, mystery novel, and shows that everyone has secrets no matter how innocent they may appear. Loved it!"
  },
  {
    "rating": "3/5",
    "review": "A film of two halves. Starts off as a decent, intriguing mystery. Ends up a little convoluted and (though it half-acknowledges this itself) far-fetched, which is a pity."
  },
  {
    "rating": "4.5/5",
    "review": "It was really good except when ‘Emily' got hit by the car, it looks like she's gping for a triple cartwheel at the Olympics... how are the graphics so bad"
  },
  {
    "rating": "4/5",
    "review": "Great cast and characters with an incredible plot that captures your attention at every turn!"
  },
  {
    "rating": "5/5",
    "review": "I like the comedic spin they added to the thriller style movie."
  },
  {
    "rating": "4.5/5",
    "review": "Nice outfits and girls look awesome!"
  },
  {
    "rating": "3.5/5",
    "review": "Kendrick plays the role well - and Lively makes the twists believable."
  },
  {
    "rating": "1.5/5",
    "review": "Starts out as one kind of story, ends as another. Nearly all is lost in the confusion."
  },
  {
    "rating": "2/5",
    "review": "A mildly interesting story line, that got progressively more boring as the film went on. Supposedly a comedy, but none of the main actors had the chops to pull it off properly."
  },
  {
    "rating": "0.5/5",
    "review": "The worse movie ever"
  },
  {
    "rating": "0.5/5",
    "review": "What a biiig waste of time and money. One of the worst i ever watched."
  },
  {
    "rating": "4.5/5",
    "review": "The chemistry between Anna Kendrick and Blake Lively are impressive and fun, with a history of mystery, suspense and intrigue. I did not expect this excellent film by Paul Feig."
  },
  {
    "rating": "2.5/5",
    "review": "Cute little twist and turn character piece."
  },
  {
    "rating": "4/5",
    "review": "I wanted Emily to get away with everything."
  },
  {
    "rating": "5/5",
    "review": "I'm a fan. The twists and turns AMAZING. Had all of the allure that you'd expect from Paul Feig."
  },
  {
    "rating": "5/5",
    "review": "This has become my favourite movie of all time!"
  },
  {
    "rating": "4/5",
    "review": "Anna and Blake shine in this movie. It is thrilling with twists and turns, but it lost a star for me because I didn't really like any of the main characters. I wouldn't watch it again, but it certainly wasn't a bad movie. A good choice if you are on a plane!"
  },
  {
    "rating": "3/5",
    "review": "It wasn’t the worst. Some lame plot devices to make it all tick but I didn’t mind it too much"
  },
  {
    "rating": "3.5/5",
    "review": "Fun movie with some good twists. Not perfect, but still a good watch."
  },
  {
    "rating": "2.5/5",
    "review": "Kendrick and Lively are the saviors for this movie. Without them, They take a mediocre script and transform it into humor and wit. Not even they could save it from the contrived, and frankly lazy, final scenes, though. The book won't be a Pulitzer Prize winner anytime soon, but at least it offered a decent ending."
  },
  {
    "rating": "3.5/5",
    "review": "This movie blends mystery and comedy with great success. Anna Kendrick is delightful in her role as an awkward single mother, who is desperate to please. The quirky script keeps the audience of this thriller guessing whilst enjoying some laughs along the way."
  },
  {
    "rating": "3/5",
    "review": "The first 40 mins felt like I was watching a romcom; after that the story took off, but never became really compelling as the movie struggles being neither.thriller nor a fun comedy."
  },
  {
    "rating": "3/5",
    "review": "God underholdning i en film, der ikke kan finde ud af, om den vil vÃ¦re en seriÃ¸s thriller med plot twists eller en morbid, sort komedie. Blake Lively er fortryllende, stoisk, giver mig lyst til at se Diabolique og drikke Vodka Martini's."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed this one quite a bit. A Simple Favor is a mystery, thriller that follows a single mom named Stephanie (Anna Kendrick) who while picking her son up from school meets Emily (Blake Lively) who is practically the opposite of Stephanie. Emily invites her over, so that their kids can have a play date. During this time Emily reveals that she works as a PR manager for a fashion company. Emily doesn't give one F about anyone it seems other than her son. She is foul mouthed, very powerful and finds that she likes Stephanie for her energy and stories. Soon enough the two become friends, but it seems that Emily is just having Stephanie watch her son. One day after Stephanie is watching the kids and Emily's husband Sean (Henry Golding) has to go to England for an emergency Stephanie realizes that it's getting late and Emily hasn't picked her son up. Two days pass and Sean comes home and the two decide to call the police. Soon enough a manhunt goes on to try and find Emily. During this time Stephanie starts looking into why Emily might have left and begins to dig up some very dark things about Emily's past. The movie has a pretty good pace. I enjoyed that it was quite funnier than I thought it was going to be. The mystery of it all is a fairly good twist, but I figured it out pretty quick. Kendrick is really good here as Stephanie and I especially enjoyed how dark her own past story is when it's revealed. I enjoyed this one and didn't think this would initially would be for me. I would recommend giving it a look."
  },
  {
    "rating": "3.5/5",
    "review": "A witty and fun mystery. The tone of the movie seems to jump around a lot from dark to ridiculous which jarred me awake from the fictive dream on occasion. However, even when the movie strained the limits of willing suspension of disbelief, it was still amusing enough that I didn't really care."
  },
  {
    "rating": "5/5",
    "review": "Hands down! The best thriller I've seen in a while!"
  },
  {
    "rating": "3/5",
    "review": "Anna Kendrick and Blake Lively star in the odd dark comedy(?) A Simple Favor. When her best friend goes missing Stephanie uses her cooking video blog to launch her own investigation (with the help of her followers) and soon learns that her friend wasn't who she thought she was and that she faked her own death. Both Kendrick and Lively give strong performance (especially Lively) and have great chemistry together. The script is kind of weak and takes a while to get to the plot, but once the murder mystery kicks in the film starts picking up momentum and doesn't let up. And it's a good mystery, fully of suspense and intrigue. Plus there's some quirky black humor that's rather amusing. It has a few rough spots, but overall A Simple Favor is an entertaining and fun crime thriller."
  },
  {
    "rating": "5/5",
    "review": "Wow this movie absolutely blew me away I went into knowing nothing and was blown away. Anna Kendrick and Blake Lively absolutely killed it and overall it has a good cast. Definitely has some awesome twist and turns."
  },
  {
    "rating": "4.5/5",
    "review": "This is one of my favorite films of the year. Something about the black comedy meets mystery/drama nature of this film works on every level. Kendrick, Lively, and Golding provide enthusiastic and intriguing performances. Kendrick portrayal of naivete and unabashed loyalty, and her character's transition in the third act are fantastic. Lively does a great job charming the audience with her sharp and abrasive performance. The combination of the elements really draws the audience in, and the remainder of the film does a great job toying with the audience's expectations without trying to get unnecessarily convoluted. I would definitely recommend checking it out."
  },
  {
    "rating": "4.5/5",
    "review": "this is a good movie. with just two characters they get developed nicely throughout the film. it keeps you engaged because the plot is simple. it starts with one simple favor that turns into a story good actresses and is quite funny. i would recommend this movie for anyone who wants to watch a good tale"
  },
  {
    "rating": "3/5",
    "review": "Director Paul Feig doesn't seem to know what direction to take this film as it contains multiple plot holes, but overall, \"A Simple Favor\" is a fun, noir mystery with some dark comedy and two strong charismatic performances from Anna Kendrick and Blake Lively."
  },
  {
    "rating": "0.5/5",
    "review": "There has been many disappointing times in my life, but when my wife made me pick this garbage movie up from the redbox. Nothing else will top that. Much rather get water boarded."
  },
  {
    "rating": "4/5",
    "review": "I understand how others have opposed views on this film, but personally, I actually enjoyed it. It's humor definitely put a smile on my face. I would love to see this again."
  },
  {
    "rating": "1.5/5",
    "review": "This is a poorly written and poorly directed film. It contains many story elements that serve no purpose for driving the plot and don't come back into play later, the twist is not really a twist by today's standards, the protagonist has no actual story arch, and it changes genres towards the end into some kind of lighthearted comedy with one liners. The acting is good but too bad it is wasted."
  },
  {
    "rating": "3.5/5",
    "review": "I will call this a decent dark comedy. Overall acting in the movie was good."
  },
  {
    "rating": "3.5/5",
    "review": "A surprising attempt from Paul Feig of exploring deeper themes, which unfortunately sort of vanishes by the end with a rather \"simple\" conclusion, but overall the performances are great and the enjoyment is guaranteed."
  },
  {
    "rating": "3/5",
    "review": "Well made but seemed like it couldn't decide what kind of movie it wanted to be."
  },
  {
    "rating": "0.5/5",
    "review": "A god-awful waste of time from start to finish. Good soundtrack to begin that 1/3 of the way in goes off the rails. A script that is in dire need of a rewrite. And scenes that are in dire need of another take. Absurd, and ridiculous with the most cardboard performances. As if the actors were just trying to get through their lines as fast as possible and move on to worthier projects."
  },
  {
    "rating": "4/5",
    "review": "Paul Feig takes his turn at suspense thriller and delivers a fun suspenseful movie led wonderfully by Kendrick and Lively and Henry Golding also brings his A game to this stylish entertaining movie. 03-03-2018"
  },
  {
    "rating": "4/5",
    "review": "blake lively and anna kendrick have fantastic chemistry."
  },
  {
    "rating": "4/5",
    "review": "A Simple Favor 8.2/10 From nearly start to finish this was just a fun, twisty thriller. This was extremely entertaining and there was rarely a moment I was not dialed in 100% to the movie. The duo of Anna Kendrick and Blake Lively drives this movie and are great (. There are also a lot of humorous minor characters in this movie that provided some extra timely humor relief. There were some twists I saw ahead of time plus the movie makes some interesting story choices (in my personal opinion) but those are minor flaws. There is some explicit material but not too much (it is R rated). Most of the twists you don't see coming and enjoy. This movie had a cool, stylistic noir flair to it that adds a nice edge to the movie, and the soundtrack fits pretty well. All in all, I've been looking forward to this movie for a few months because of Anna Kendrick/Blake Lively and because the mystery looked to be set up really well. It met my high expectations, highly recommend!"
  },
  {
    "rating": "1/5",
    "review": "I am shocked such big names agreed to this garbage. This is a bad Lifetime movie. I lost respect for all the actors who agreed to this."
  },
  {
    "rating": "4.5/5",
    "review": "This movie has to be one of the craziest whodunit mysteries I have ever seen in my life. The story is totally bizarre and some of the characters change personalities almost mid-scene. With all of these issues however this movie is a damn good time and extremely entertaining mostly because of its unique writing and brilliantly committed performances from Anna Kendrick and Blake Lively. A Simple Favor is easily a film that will take a while to process...for pure absurdity gone narrative art. B+"
  },
  {
    "rating": "3/5",
    "review": "A Simple favor is a weaker version of Gone Girl. I don't think its twists and turns are clever, but Anna Kendrick and Blake Lively are charismatic and two intriguing characters that can keep you interested by this whole movie. It has a promise premise and it has a lot of funny moments."
  },
  {
    "rating": "4.5/5",
    "review": "Well written, excellent actuonh across the board. Clever funny and suspenseful."
  },
  {
    "rating": "4/5",
    "review": "It might be Paul Feig's most differing and daring film so far, but as oddly-evolving as it goes, stellar roles has Blake Lively and Anna Kendrick in what it could seem the actresses most interesting performances to date, inside a story that keeps toying with the viewer, turning from a weirdly-enough-fun dark comedy, to an interestingly-random thriller with enough turn of events, appealing cast and gags, all to craft a weird-but highly entertaining-hybrid."
  },
  {
    "rating": "3.5/5",
    "review": "Although predictable at times, its fun and the soundtrack is great"
  },
  {
    "rating": "5/5",
    "review": "Plot twist after plot twist! Both women are so good in it!"
  },
  {
    "rating": "4/5",
    "review": "Crazy plot, keeps you guessing."
  },
  {
    "rating": "4.5/5",
    "review": "One of the best thrilling movies I had ever watch, Blake Lively and Anna Kendrick both do an amazing acting, their roles contrast a lot. This is the first thriller movie of the director Paul Feig and I think he did a great job. As the movie goes on you want it to finish so you can now whatï¿ 1/2 1/2 1/2 1/2 1/2 1/2 1/2(TM)s the truth, whatï¿ 1/2 1/2 1/2 1/2 1/2 1/2 1/2(TM)s is going to happen. You donÂ´t want to take your eyes out of the screen. It is not the tipicall movie where you know what is going to happen, every take takes a twist and it is very interesting to wath.I have to admit that the end was a little too much drama for me, but despite all the script is really good. I would recommend this movie to all my friends, I think every person that watch this movie would absolutely love it."
  },
  {
    "rating": "3/5",
    "review": "I was with this movie- until the climax. I enjoyed the premise, I enjoyed the Kendrick.. It just wasn't enough. Pos. It's a movie. Neg. Completely bottoms out and dumps its build up all over the floor. Like a vomiting cat. Verdict - Just not something I'm watching again.. Sorry Anna. Michael Bakensztos ^Hey, that's me!"
  },
  {
    "rating": "5/5",
    "review": "A suspense with a touch comic, dynamic and engaging in the right measure, with predictable end but compensated by the unfolding of the plot."
  },
  {
    "rating": "4/5",
    "review": "I give if four star because it was a reslly good movie. But the ending made you think it was based of of a true sotey. Which actually was pretty upsetting. Bit overall it was a really good movie to watch. I really enjoyed the movie itself."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was horrifying and disturbing. Definitely will not watch again."
  },
  {
    "rating": "3.5/5",
    "review": "Much more intriguing than I thought it would be"
  },
  {
    "rating": "4/5",
    "review": "2019-2-7 Not bad. Everyone in this movie is not exactly who they appear to be. Every time when I was guessing the next move of the story, it turned. The ending has gone a bit too crazy though. Like the music makes the movie a little more sexier."
  },
  {
    "rating": "4/5",
    "review": "Stunning performances from the mother duo make this brilliant thriller a sense of mystery that you must see till the end and you'll be glad you did. A Simple Favour is a dark comedy that triumphs on the character study of the three main characters, with each character having their own unique personalities and stories to tell."
  },
  {
    "rating": "3/5",
    "review": "Kendrick and Lively together, that’s 2 of 3 star review."
  },
  {
    "rating": "4/5",
    "review": "Dark but cute movie with great one-liners."
  },
  {
    "rating": "3.5/5",
    "review": "Following a string of uninspired schtick, Paul Feig's A Simple Favor manages to muster up a compelling, twisty-turny mystery-thriller built on cynical misanthropy more worthy of a Basic Instinct sequel than the one actually delivered back in 2006. Without abandoning his candy-colored humor, Paul Feig orchestrates an unraveling, combative mix of Blake Lively's duplicity and Anna Kendrick's niceties that smacks of a naive, upbeat Paul Verhoeven."
  },
  {
    "rating": "5/5",
    "review": "Wow this movie absolutely blew me away I went into knowing nothing and was blown away. Anna Kendrick and Blake Lively absolutely killed it and overall it has a good cast. Definitely has some awesome twist and turns."
  },
  {
    "rating": "3.5/5",
    "review": "A twisty labyrinth of actions that keeps you engaged and entertained. Anna kendrick and Blake Lively are phenomenal in their roles of best friends."
  },
  {
    "rating": "3.5/5",
    "review": "Campy with fun style. A great sick day watch for me. The mystery is gripping in a way that's not overdone or forced like many movies of this genre. The 1960s French music and gorgeous dresses certainly don't hurt the fun."
  },
  {
    "rating": "5/5",
    "review": "Pleasantly surprised by how good this film was!! Think of a cross between Gone Girl and Game Night, and you'd be in the right ballpark with A Simple Favor. Anna Kendrick steals the show -- by just being herself (which is like a cross between Jason Bateman and the character of Elaine on Seinfeld). Blake Lively is great -- her character gets to say so many of the lines people think but don't say regarding parenting, society, etc. A very enjoyable and entertaining film!"
  },
  {
    "rating": "3/5",
    "review": "A Simple favor is a weaker version of Gone Girl. I don't think its twists and turns are clever, but Anna Kendrick and Blake Lively are charismatic and two intriguing characters that can keep you interested by this whole movie. It has a promise premise and it has a lot of funny moments."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was so bad I wouldnï¿ 1/2 1/2(TM)t recommend it to anyone."
  },
  {
    "rating": "3.5/5",
    "review": "Interesting to see Feig directing a film out of his element. The Ghostbusters reboot was a slight misdirection for the filmmaker, but he returns with a film that showcases a wide range of genres. It's nice to see a film with a clever 50s noir style plot return to the big screen. Sadly the film did not take the box office by storm, but it is far from a bad film and should garner more interest now that it is away from the mainstream market. The film is very twisty and it's this story movement that keeps this unfolding at an interesting pace. You have no real idea how this will conclude, but you just know it won't end well for someone. The film can't live up to the hype and drops the ball slightly in its conclusion, I had expected something darker, but they go for a very safe ending. Great return to complicated plot lines and I hope more high end filmmakers return to small budget filmmaking like Feig. Fun and clever film that should fine a good home. 29/01/2019."
  },
  {
    "rating": "0.5/5",
    "review": "That was one of the worse movies I have ever witnessed. Complete fallacy to the novel and terrible direction. Have no idea why this has good reviews at all."
  },
  {
    "rating": "0.5/5",
    "review": "I didn't like the story line, it was very poorly put together and full of stuff other movies have done better. The acting was also very forced."
  },
  {
    "rating": "4/5",
    "review": "Good fun film with a warped point of view of suburban housewife life style - how far will someone with no real friends take a favor to the only friend who asks. Very entertaining."
  },
  {
    "rating": "4.5/5",
    "review": "This is what all thrillers should be like!"
  },
  {
    "rating": "2/5",
    "review": "Cliched. I held out for a better twist, but it didn't happen. a drink-while-you-watch movie."
  },
  {
    "rating": "5/5",
    "review": "A movie who's next move you can't see coming. Most movies are too predictable. This one is refreshing."
  },
  {
    "rating": "5/5",
    "review": "Great twist although ending could of been better"
  },
  {
    "rating": "5/5",
    "review": "Oh my God I just watched this movie and wow! I can't say really that much without giving things away but my mind is still spinning from all of the twists and turns and holy s*** moments! I only saw one trailer for this movie a while ago and had forgotten about it until I stumbled upon it on my dish rentals and decided hey I like both Anna Kendrick and Blake lively so what the hell I'll give it a shot and wow I am so glad that I did. This movie literally had me on the edge of my bed through the whole thing. It was suspenseful and also hilarious. Just watch it for yourself and you will see how great it is. So freaking awesome!!"
  },
  {
    "rating": "5/5",
    "review": "I figured this movie would be your standard cheesy no think movie, but it was actually really good. It was interestingly thought out, had some solid characters. Without giving much away .... watch it."
  },
  {
    "rating": "3.5/5",
    "review": "It was good in the sense that it keeps you guessing. Blake Lively and Ana Kendrick are great actresses. The best friends relationship and husband seemed to take off too soon. The ending was a bit of a let down. Not much better than the bollywood dancing alternative ending, but the car was a bit much."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely one of the worst movies I have ever seen. I am astounded it received the positive rating it did. Simply awful, awful, awful!"
  },
  {
    "rating": "3/5",
    "review": "I really don't know what vibe A Simple Favor was going for, but I know I kinda liked it."
  },
  {
    "rating": "4/5",
    "review": "A good movie that kept u guessing right to the end. Characters were presented in a stereotypical way but actually had multiple levels that u didn't expect which added significantly to the story. Overall, an entertaining flick."
  },
  {
    "rating": "3.5/5",
    "review": "This movie is bizarre. I don't know quite what to make of it. It could go down as one of the more clever, funny, and interesting movies I see this year, or it could go down as one of the worst movies I see this year. And I'm not entirely sure which statement is more accurate."
  },
  {
    "rating": "5/5",
    "review": "Hilarious ï¿ 1/2 1/2~,"
  },
  {
    "rating": "3.5/5",
    "review": "From comedy to a thriller with a twist in the end. Overall, average thriller movie."
  },
  {
    "rating": "4.5/5",
    "review": "EXCELLENT casting choices"
  },
  {
    "rating": "5/5",
    "review": "A cold winter rollercoster. With just the right amount of nervous giggles."
  },
  {
    "rating": "4/5",
    "review": "That was a fun flick! So many twists and turns, bit of \"Gone Girl\" meets \"Mean Girl\". Loved it."
  },
  {
    "rating": "4.5/5",
    "review": "FUN!!! I really enjoyed this crazy movie!!"
  },
  {
    "rating": "1.5/5",
    "review": "Unbelievably stupid. Like a high school girl wrote this movie as a class project to win a popularity contest"
  },
  {
    "rating": "4.5/5",
    "review": "Pretty good movie, a fun mystery suspense. It kept a good pace had some great plot twists. Good cast, good story line. A little surprising how good it was."
  },
  {
    "rating": "2.5/5",
    "review": "A fun movie with strong performances from the cast. However, I'm not quite sure the movie knows which genre it wanted to be. Started off good with a similar set-up as movies like \"Gone Girl\", but ended as a comedy. https://theporterpost.wixsite.com/theporterpost"
  },
  {
    "rating": "4/5",
    "review": "Anna Kendrick can carry a movie and Blake Lively isn’t too shabby either. Be prepared for Blake’s mouth. She is crass and blunt but makes it funny. Some cool French music is in many scenes. Totally worth your 2 hours"
  },
  {
    "rating": "3.5/5",
    "review": "This movie starts out interesting and keeps you guessing throughout but ends with a thud due to a weak and flimsy ending."
  },
  {
    "rating": "4/5",
    "review": "I truly believe this stylish genre-bender could have been a massive, sleeper hit had the marketing and title been a better service to the originality of the film. Anna Kendrick and Blake Lively have magnetic chemistry and their performances along with Feig capably stretching himself as a director all come together to create a wholly unique spin on films like Gone Girl and The Girl on the Train. While I have no problems with the film's mix of tones, it does occasionally dip into campy a few times which feels too far out of place. A critical scene at the film's conclusion took me out of the fantastic build up to it. That said, I'm completely on board for more pairings of these two lead actresses and would not be surprised - or disappointed - if these specific characters return down the line."
  },
  {
    "rating": "0.5/5",
    "review": "OMG, can I give minus 50 to correct the tomato meter? What a horrible two dimensional wannabe comedy. DO NOT WATCH!!!"
  },
  {
    "rating": "4.5/5",
    "review": "3.5 pentru film, 1/2 pentru Kendrick fan movie material si 1/2 pentru Lively si costumele ei"
  },
  {
    "rating": "4.5/5",
    "review": "Totallybkeptnmencaotivated! Had no idea who to believe. All the acting was awesome. Gag reel was cute and the deleted flash mig was cute. To bad it was deleted from the movie"
  },
  {
    "rating": "4/5",
    "review": "This movie, much like the zucchini chocolate chip cookie recipe I got from it, is delectable."
  },
  {
    "rating": "5/5",
    "review": "It was a great fun - unexpected movie -"
  },
  {
    "rating": "3/5",
    "review": "Plot twist was interesting but the script was wooden. Kendrick and Lively pulled their weight to make this flick watchable."
  },
  {
    "rating": "4/5",
    "review": "Twisted, smart, fun, and strangely dark. A fanstastic movie for true thinkers."
  },
  {
    "rating": "0.5/5",
    "review": "This is complete garbage! Who paid these critics to say otherwise?"
  },
  {
    "rating": "3.5/5",
    "review": "Think of it like a comedy of Gone Girl, with those mystery twists as well as good comedic performances from Blake Lively and Anna Kendrick. Our local export Hendry Golding does alright too."
  },
  {
    "rating": "4/5",
    "review": "Dark, twisted and fun! Kendrick & Lively were great together in this movie. [8/10]"
  },
  {
    "rating": "0.5/5",
    "review": "Sick movie, a waste of time."
  },
  {
    "rating": "4/5",
    "review": "Much better than expected, masterful acting by Kendrick and Lively, made old Henry look like he has some work to do. Fun film."
  },
  {
    "rating": "1/5",
    "review": "This was bad. So so so so bad. Over-acted. Over forced with Anna Kendrick stupid sarcastic 15 year old girls humor (twilight is over Anna). Blakes character was cringe worthy...and not believable at all. How did it get such high rating on rotten tomatoes is beyond me! Ughhh so bad."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I've ever seen in my life."
  },
  {
    "rating": "4/5",
    "review": "This movie surprised me as my expectations - as they generally are - were low. Good movie."
  },
  {
    "rating": "2/5",
    "review": "\"A Simple Favor\" delivers a great performance from Blake Lively and is truly a thought provoking film... but primarily, for the wrong reasons. It lacks direction and feels like a failed attempt at combining multiple genres. Anna Kendrick delivers a quirky performance that is somewhat enjoyable but it is marred by a level of disingenuousness that is, at times, very hard to watch. The plot contains many laughable and overtly contrived twists... none of which are delivered effectively and seem to make next to no sense, whatsoever."
  },
  {
    "rating": "3.5/5",
    "review": "I likes this movie. I love Anna Kendrick and it was good to see Blake Lively go against type as a bad girl. I just thought the end was over done. It got a bit confusing and some of it could have been cut down. Overall , I enjoyed it"
  },
  {
    "rating": "5/5",
    "review": "Liked all the twists and turns!"
  },
  {
    "rating": "0.5/5",
    "review": "Possibly the worst movie I’ve ever seen"
  },
  {
    "rating": "1/5",
    "review": "A Gone Girl wanna-be with confusing pacing, weird change in tones and a convoluted, yet shallow plot."
  },
  {
    "rating": "5/5",
    "review": "The best mistery movie I ever seen. I like these actress so much. I enjoyed it using boxxy software."
  },
  {
    "rating": "2/5",
    "review": "Some fun ideas and performances but weighed down mightily by poor direction and genre identity crisis."
  },
  {
    "rating": "3/5",
    "review": "Just an okay movie. Nothing about it including the story line or acting was amazing. Good for background noise while doing something else."
  },
  {
    "rating": "5/5",
    "review": "It was a good movie."
  },
  {
    "rating": "3.5/5",
    "review": "Um Pequeno Favor (2018) #MovieReview 3,5 â­?ï¸? MÃ£e viÃºva e hiperativa faz amizade com outra rica (e falida) com filho na mesma escola. ApÃ³s pedido para pegar o filho desta, desaparece sem deixar pista, levando a mÃ£e hiper a procurÃ¡-la. Prende a atenÃ§Ã£o."
  },
  {
    "rating": "2.5/5",
    "review": "An absolute mess. A Simple Favor struggles very badly to find its tone/genre and stick with it, making the movie very discombobulated. Not funny enough to be a comedy, never suspenseful enough to be a drama or thriller, etc. Trying to seem so unique and original, A Simple Favor cannot find its way into becoming a decent movie. The script is up and down throughout the whole movie, and the intriguing cast fails to bolster the film at all."
  },
  {
    "rating": "3/5",
    "review": "Lively and Kendrick are a dynamic duo but all the twists and turns of this comedic thriller go off the rails in the third act"
  },
  {
    "rating": "3.5/5",
    "review": "This movie have a lot of twists and turns but overall it wasn’t a bad movie. I can say I’d watch it a second or third time"
  },
  {
    "rating": "4.5/5",
    "review": "Refreshing! Blake Lively should be in every movie. Underused and underrated. I have adored her since her pitch perfect role in The Town. Anna Kendrick redeems herself after the Pitch Perfect fiascos by reprising her persona from Camp: sweet little nothing with the heart of a murderous vixen. Great gags referencing moms, vlogs, and fashion. A sharp, funny, clever movie that elevates the genre above everything out there."
  },
  {
    "rating": "3/5",
    "review": "I was expecting a little more from this movie, but overall we spent a good time watching it."
  },
  {
    "rating": "5/5",
    "review": "A twisted, Hitchcockian thriller with a brilliant cast as well as career defining work from Kendrick and Lively. Inspired, witty, coy and intelligent - this is also one of Fieg’s best films, and a surprising genre shift. Here’s hoping this isn’t the last foray into the genre for everyone involved."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I have ever seen. Literally."
  },
  {
    "rating": "3.5/5",
    "review": "Unpredictable until the last of the twists and the last of the amalgamated film genres, from the black comedy to the thriller and the noir. Much more delightful than the heavily intellectualistic Fincher of \"Gone Girl\" (2014). (Mauro Lanari)"
  },
  {
    "rating": "3.5/5",
    "review": "I quite enjoyed this twisty little comedy. Yes, it has predictable moments, but the actors keep it feeling fresh. It’s almost a parody of those ridiculous 80’s thrillers."
  },
  {
    "rating": "4.5/5",
    "review": "Really great to be honest. Blake Lively and Anna Kendrick bring great performances and maintain contrasting characters which keep the film interesting. Lots of twists and turns that keep the plot lovely though sometimes the twisty nature can become a bit much. Amazing fun to watch and the end gives some sort of satisfaction."
  },
  {
    "rating": "0.5/5",
    "review": "Anna Kendrick's performance was disingenuous, unconvincing and generally lackluster. With a plot more aligned with a children's play this was one of the largest travesties of modern screenplay I've seen in my many years on this planet. All I can say is thank you Paul Feig for bringing me 1 hour and 59 minutes closer to my grave as that is exactly where I want to be after watching this."
  },
  {
    "rating": "4/5",
    "review": "Really enjoyable. I can't think of another film like this that's equal parts drama, crime thriller and comedy. Anna Kendrick was really good in this. It was better than I expected!"
  },
  {
    "rating": "1.5/5",
    "review": "probably the fans like it and timatometer also because of all love and sex scene but the story not that Good and the twist is just normal"
  },
  {
    "rating": "4.5/5",
    "review": "Sad that they killed Blake's character and sad they weren't endgame, but that's just cuz I'm gay lmao"
  },
  {
    "rating": "0.5/5",
    "review": "Complete garbage. I'd probably rather watch paint dry then watch this again"
  },
  {
    "rating": "1/5",
    "review": "I cant believe how horrible this movie was..I couldn't even finish it. I read the book which was totally different. This movie should not have had the same name as the book. This was an absolute wasted of time. This could have been such a great movie . Soooooooo disappointing!!!"
  },
  {
    "rating": "5/5",
    "review": "Anna & Blake deserve Oscars"
  },
  {
    "rating": "4.5/5",
    "review": "Quirky, macabre and downright shocking at times, A Simple Favor is an enticing watch."
  },
  {
    "rating": "2.5/5",
    "review": "Not sure whether this was serious or comedy or tongue in cheek or realistic or not. Overall confused by this movie but a pass. Anyone else think that Stephanie (Kendrick) is the true evil person in the movie? e.g. her marriage, her kid, her best friends marriage all around her selfish desires."
  },
  {
    "rating": "4.5/5",
    "review": "I absolutely loved it. Funny and suspenseful throughout. Paul Feig showed what great direction can be. I hope he does more like this."
  },
  {
    "rating": "0.5/5",
    "review": "Started off as a interesting thriller then unravels at the end to a slapstick punch in the balls comedy."
  },
  {
    "rating": "4/5",
    "review": "SO ENTERTAINING from beginning to end. Blake Lively is amazing. The film is fun and kept me engaged the whole time, constantly trying to figure out who dunnit?!"
  },
  {
    "rating": "0.5/5",
    "review": "Not worth seeing, worst movie I've seen in quite awhile, can't make up its mind if it's a mystery or dumb comedy, comes off pathetic ????????"
  },
  {
    "rating": "5/5",
    "review": "This movie is awesome! Mysterious, suspenseful, fierce and twisted, A Simple Favor is everything you could want in a contemporary mystery movie and more! Under the direction of the amazing Paul Feig, Anna Kendrick, Blake Lively and Henry Golding give Oscar-worthy performances and really help bring this story to life! A Simple Favor is truly one of the best movies of 2018 and one of the best mystery movies of all time! Give it watch and you'll easily see why!"
  },
  {
    "rating": "5/5",
    "review": "many twists and turns, very surprising"
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining but nothing special."
  },
  {
    "rating": "4/5",
    "review": "Was super excited to see this movie and it didn't disappoint. Blake Lively stuns once again with her incredible acting. This movie KEPT YOU ON YOUR TOES! Everytime I thought I had figured it out, another twist in the plot occurred. You can not predict anything that is about to happen, and it is exiting to watch everything play out. The added comedy helped to lighten such a dark plot, but I will admit at times felt awkward. Overall would totally recommend watching this, but be prepared to actually scream at the TV."
  },
  {
    "rating": "3.5/5",
    "review": "It's stylish, engaging and mysterious; with a well combination of comedy and suspense to keep you guessing (correctly) throughout."
  },
  {
    "rating": "1/5",
    "review": "This had all the potential of a legitimate thriller with some twists. The last 10 minutes of the film completely ruined the entire build up. Went from intriguing to unwatchable in a matter of minutes."
  },
  {
    "rating": "4.5/5",
    "review": "A simple favor from me to you, go watch A Simple Favor. This movie pushes Sorry to Bother You and Upgrade as my favorite movie of 2018. There were so many aspects of this movie that shouldn't have worked, but somehow did. The twists and turns were unexpected for the most part, and led to a thrilling adventure. Often when I have no clue what is happening in a movie, I become disinterested, but I was on the edge of my seat drawn into the screen throughout. There was one moment in the movie to where my whole row shouted \"No! No!\" which only showcases how deeply captivated everyone was by the film. Anna Kendrick and Blake Lively were amazing; they had good chemistry and interesting, unraveling characters. It's one of the few films I wouldn't mind watching multiple time while it's in theaters."
  },
  {
    "rating": "3.5/5",
    "review": "The film at times becomes lost in itself due to the constant introduction of new characters. However, the twists and turns towards the end of the movie essentially save it."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely terrible Poorly written script and really bad story line"
  },
  {
    "rating": "3.5/5",
    "review": "\"A Simple Plan\" is a chick-flick that successfully crosses into \"Gone Girl\" territory."
  },
  {
    "rating": "1/5",
    "review": "85%?? No F way. Rubbish"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. Charming yet funny and a really good watch. Highly recommend if you’re looking for something different!"
  },
  {
    "rating": "4/5",
    "review": "It had some decent twists and a fairly well written plot line. A Simple Favor is ripe to be a solid \"guilty pleasure\" film for all. Decent balance between comedy, mystery, and thriller."
  },
  {
    "rating": "2/5",
    "review": "Terrible acting. Movie was terrible and over dramatic. They were trying too hard to make this movie deep"
  },
  {
    "rating": "4/5",
    "review": "12/26/2018 A simple favor for a friend turned out to be an elaborate plot, thanks to some skeletons in the closet that were unearthed and a huge sum that needs to be collected. Anne Kendrick was fit for this role as the seemingly naive woman utilised as a fall girl / accomplice."
  },
  {
    "rating": "4/5",
    "review": "This is not what I was expecting, it was such a pleasant surprise. Anna and Blake play off each other like a ping pong match. This movie had wit, charm and twists, what more could I ask for. Grab your close friend(s) and buy it on prime. Don’t forget the martini"
  },
  {
    "rating": "3.5/5",
    "review": "Anna Kendrick and Blake Lively, although total opposites in personalities in the film, play off each well in this dark adult modern noir that is filled with twists and turns. The filmmakers, at times, don't pay attention to detail and let the movie meander, but overall I found it to be quite entertaining. Look for some cameos by some screen notables including Jean Smart and Linda Cardellini."
  },
  {
    "rating": "3/5",
    "review": "The movie runs initially on an unexpectedly fast pace which doesn't allow much of character build up. Although the drastically dynamic characters never fail to cope with their new faces, the movie is full of cliches and by the movie concludes on an exhausting numbers of double crosses. All I see here is a pathetic attempt to remake 'Gone girl'"
  },
  {
    "rating": "2.5/5",
    "review": "Strengths: Anna Kendrick (Stephanie Smothers) continues to be a delight in everything she works in. She has become a solid choice to lead almost any comedy. I also appreciated the small role by Linda Cardellini (Diana Hyland), who proved she can nearly steal the show in just one scene. The first half or so of this movie is quite engaging. Weâ(TM)re introduced to the characters and the mystery, which is one that grabs you. You want to know just what the hell is going on, almost similar to the successful Gone Girl, but on a smaller and less serious scale. Weaknesses: Blake Lively (Emily Nelson) has gotten praise for her work here but I just donâ(TM)t see it. It often felt like she was trying too hard to be strange. It could partially be how the role was written, but I just never bought into her character. In fact, when she ultimately returns to the story a little over halfway through, the movie takes a nosedive. That should rev things up, but instead, the story goes off the rails. They try throwing way too much at the wall to give us twists and turns, yet it feels hollow and none of it really ever lands. Itâ(TM)s like it becomes a completely different movie that fails to capitalize on a mostly strong start. Overall: With a likable cast members and a great premise, I had high hopes for this. Instead, it gets bogged down by trying way too hard in certain aspects and the twists just never have a true impact."
  },
  {
    "rating": "3/5",
    "review": "Predictable ending, Kendrick is good for the role, first half is good then it speeds up to reveal the plot thus affording you inadequate time to realise its flaws."
  },
  {
    "rating": "3.5/5",
    "review": "Twisted movie, keeps you watching intense whole movie, recommended. And another twist, but its not twist that its bad movie, its just twisted"
  },
  {
    "rating": "2/5",
    "review": "just bad character writing. It starts with some interest but then really ends horribly. too many pointless character plots that start at the end. This movie has a hard time ending."
  },
  {
    "rating": "3/5",
    "review": "Great performances done in as plot gets so absurd we no longer care about the characters. Blake Lively's work is the best and not served by the ridiculous ending."
  },
  {
    "rating": "2/5",
    "review": "I felt as though this movie didn't really stick to one genre, it kept flip-flopping between thriller, comedy, romance...I just couldn't really get into this movie without seeing how ridiculous it all seemed. I also felt as though the timeline of events was really jarring and confusing, I wasn't really sure how much time had passed when major events happened. This movie just wasn't my cup of tea."
  },
  {
    "rating": "0.5/5",
    "review": "Read the book and was amazed by the plot - this movie changed everything that was important and over sexualized the whole plot. If I was the author I would be outraged. Don't waste your time."
  },
  {
    "rating": "4.5/5",
    "review": "I love the dark humor and twists. Blake is amazing as Emily."
  },
  {
    "rating": "4/5",
    "review": "It all starts with a simple favour but slowly progress to this sort of Gone girl film ... remember gone girl ?"
  },
  {
    "rating": "4/5",
    "review": "It's a really good movie with a good enjoyable story with some twists you don't see coming"
  },
  {
    "rating": "5/5",
    "review": "Different than expected. Weird finish, but added to the surprise...good movie."
  },
  {
    "rating": "0.5/5",
    "review": "1/8 star. This was by far one of the dumbest, worst, movies of all time. I cannot express how awful it actually was. I am reminded after reading the reviews of this movie which were shockingly positive for the most part how sad our society is and poor judgements that explain how Donald Trump was elected as President. Thank you human race for your participation, you have failed us once again."
  },
  {
    "rating": "4.5/5",
    "review": "I was contemt just to perve on Blake Lively and admire what I know would be delicious fashion but I was pleasantly surprised with a decent plot, and a couple of unexpected twists. Lively did not disappoint."
  },
  {
    "rating": "0.5/5",
    "review": "This campy ï¿ 1/2thrillerï¿ 1/2Â? was one of the dumbest movies I have ever seen. Thatï¿ 1/2(TM)s two hours of my life and $5.99 I will never get back."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute garbage. Stupid. 45 minutes too long."
  },
  {
    "rating": "1/5",
    "review": "I’m sorry but I thought the movie was a waste of time."
  },
  {
    "rating": "2.5/5",
    "review": "the beginning was good, and then the ending just got super illogical and crazy.... disappointed overall."
  },
  {
    "rating": "4/5",
    "review": "A Simple Favor (4 out of 5 stars). A Simple Favor is a twisted, stylistic, and a fun mystery thriller film. It surpassed my expectations with its mystery plot, twist and turns with the story, and Anna Kendrick and Blake Lively performance was outstanding. The trailer did not show much besides Stephanie (Anna Kendrick) a single widowed mother who runs a vlog of cooking recipes. Who befriends with another mother Emily (Blake Lively) a busy director for a fashion company. There sons attend the same school. Stephanie high positive personality is trying to figure out Emily. She hates pictures being taken of her, she was amazed by the love affection her and her husband Sean (Henry Golding) share which makes them seem like the perfect couple. Until one day, Emily went missing. Were they all assume she went on a long business trip. When her work denies the trip. Stephanie becomes suspicious of her disappearance which she can not trust anyone. And trying to learn who Emily really is? Or figuring out Emily's past. The plot was surprisingly good. It is best to see without reading or hearing much more about the story without going into spoiler territory. There are twists and turns with the plot. It does have a campy fun direction from Paul Feig. Plus Anna Kendrick's down to earth and being super nice personality was a lot of fun to see. Then, Blake Lively's performance which was the opposite of her with a stuck up, rich personality. Seeing them both perform together was a lot of fun. Henry Golding was also good as well playing Lively's husband. A struggling writer with financial trouble. Overall, A Simple Favor is a good mystery thriller film. Anna Kendrick and Blake Lively were good with their characters. The plot had a twisted concept which does have a dark turn in tone and a fun campy direction. And Paul Feig managed to make those two different tones work well."
  },
  {
    "rating": "5/5",
    "review": "Amazing. Wow. What the heck? Wow."
  }
]