[
  {
    "rating": "5/5",
    "review": "This was such a fun movie! It was everything I wanted and more. It was cool to see Paul Rudd play a bad dad; I hated him and that’s a compliment on his acting. The lore and darkness of the Unicorns was super interesting and draws you in and Jenna Ortega’s kind hearted stubborn teen character perfectly grounds the movie."
  },
  {
    "rating": "5/5",
    "review": "Now that is a fun, unpredictable movie! No, it won't win awards... but if you just want a funny on the edge of your seat popcorn flick, it's perfect"
  },
  {
    "rating": "5/5",
    "review": "LOVE LOVE LOVE. the aspects that went towards the movie and connection given to the audience of Jenna and the unicorns was such a powerful move. The movie had dry humour in it making it bland at some points but never over powered it making it good leaving spaces for funny lines in the script. the acting was spectacular."
  },
  {
    "rating": "5/5",
    "review": "I very much enjoyed this film. The script is fabulous and execution was well done. Is it predictable? Yes but I enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "It was pretty interesting"
  },
  {
    "rating": "1.5/5",
    "review": "If you have a teenager who usually prefers hanging out with friends over watching a movie with Mom and Dad—but they suggest Death of a Unicorn for family movie night—say yes. No hesitation. The time together is worth far more than the movie itself. That said, if it’s just you deciding between watching Death of a Unicorn or finally pairing all the orphan socks by the dryer… go find the socks. At least that has a satisfying ending."
  },
  {
    "rating": "2.5/5",
    "review": "Painfully predictable for such a unique premise. Has some fun moments, but overall, I was disappointed in this one."
  },
  {
    "rating": "5/5",
    "review": "OPNIOS VARIAVEIS SOBRE O FILME MAIS E MUITO BOM ate tem uma narrativa boa e o unicornio e assustador"
  },
  {
    "rating": "2.5/5",
    "review": "Surprising how little fun is to be found in this horror comedy. Paul Rudd has never been less interesting. Will Poulter however, is having a great year. Not relinquishing themselves to PG-13 and going R-rated was a big help."
  },
  {
    "rating": "3.5/5",
    "review": "I really don't know what I just watched. If I figure that out, I will get back to everyone."
  },
  {
    "rating": "0.5/5",
    "review": "Really, really poor movie. Great trailer, really captivating and the opening scenes of the movie feel like it is setup for a great showing. Within minutes it turns for the worse. Not funny enough to be classed as a comedy, not scary enough to be classed as a horror. No consistency when it comes to the speed/ferocity of the unicorns, which quite frankly for a movie released in 2025 has the special effects of a film from the 1980's. Character tropes are forced, with little to no arch at all. A genuine let down."
  },
  {
    "rating": "3.5/5",
    "review": "I love how viewers liked it but these critics talk about how it's horrible and a b movie. Yet there biggest films they produced never even made it to a c movie!!"
  },
  {
    "rating": "4/5",
    "review": "A Haunting Blend of Fantasy and Truth This film offers a clever and striking fusion of fantasy and realism, using its surreal narrative as a mirror to reflect the unsettling truths of our modern world. Beneath the surface of its mythical elements lies a poignant critique of a deeply flawed healthcare system—one that thrives on exploitation, favouring profit over people. It's a story that exposes how wealth, while seductive, can become a curse in disguise—slowly suffocating the soul it was meant to liberate. Thought-provoking and eerie, it lingers long after the credits roll."
  },
  {
    "rating": "3.5/5",
    "review": "The story wasn't all that great, but it was kinda fun if you turned your brain off and watched it like it *wasn't* trying to take itself too seriously. Paul Rudd is always a plus as well."
  },
  {
    "rating": "5/5",
    "review": "Very interesting movie."
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing cast! Animations were fantastic, Absolutely must see!"
  },
  {
    "rating": "0.5/5",
    "review": "So you know the stuff you throw away, basically everyday, egg shells, coffee grounds, more plastic than you care to admit... well we can all agree that we call that \"trash\". This movie is LESS than that."
  },
  {
    "rating": "5/5",
    "review": "Really good movie! Jenna never disappoints."
  },
  {
    "rating": "4.5/5",
    "review": "This was AWESOME!! I actually came in skeptical but each scene was made to count and once it got going, the stakes and conflict just kept going up and up. Great stuff by all involved. Lots of fun"
  },
  {
    "rating": "5/5",
    "review": "This was a pretty good movie."
  },
  {
    "rating": "2.5/5",
    "review": "Fun idea and great cast, but no surprises once the parallel to the medieval unicorn legends is shown. You'd also expect the unicorns to be properly animated throughout the movie, it's the central element of the movie after all!"
  },
  {
    "rating": "3.5/5",
    "review": "browsing through some of the other reviews I agree, it is an absurd, silly, wild film.. But that is what makes it funny and good, not bad. it won't win any Oscars but yea an enjoyable enough couple of hours"
  },
  {
    "rating": "5/5",
    "review": "Worth watching the whole film…not just 30 mins. Dont be like daniel, watch the lot- youll love it!"
  },
  {
    "rating": "1/5",
    "review": "I really wanted to like this some much but struggled with a subpar story that I’m not clear how it was ever approved for filming"
  },
  {
    "rating": "3/5",
    "review": "Decent flick. Had funny moments, gory moments, but my only minor issue is the two crossed too much in the climax, it felt like a roller coaster jumping from serious to comedy from scene to scene. Otherwise, it was a fun movie."
  },
  {
    "rating": "3/5",
    "review": "Death of a Unicorn delivers a bold mix of black comedy and satirical horror, exposing the brutal greed of capitalism in a wild, bloody ride. The story is simple yet direct, filled with absurd humor and surprisingly tender moments between the leads. While the wealthy villains feel cartoonish and the film only scratches the surface of its deeper themes, it remains an energetic, heartfelt, and visually vibrant experience. Alex Scharfman shows promise in his directorial debut, using saturated colors, dynamic camera work, and playful editing to keep the tone lively, though pacing stumbles midway. Performances shine, especially from Paul Rudd’s charmingly naïve father and Jenna Ortega’s sharp, sarcastic daughter. Despite its flaws, Death of a Unicorn offers a rebellious and fun cinematic escape — perfect for fans of quirky, blood-soaked dark comedies."
  },
  {
    "rating": "2.5/5",
    "review": "Despite the stellar cast and unique storyline, it’s boring and way too drawn out. Rare miss by A24"
  },
  {
    "rating": "3/5",
    "review": "Meh, it passed the time, cheesy with bad cgi. Kinda funny"
  },
  {
    "rating": "2.5/5",
    "review": "This one ran out of steam by the halfway mark. It has a few funny, interesting, and disturbing perspectives on human nature, but it beat you over the head with these ideas."
  },
  {
    "rating": "5/5",
    "review": "I went into this movie knowing absolutely nothing I was originally planning on taking my toddler to see it before realizing it was rated R, but when I went I really enjoyed it, I was intrigued throughout the entire film, all the characters worked well together I highly recommend this to others!"
  },
  {
    "rating": "3.5/5",
    "review": "This movie kinda reminded me of Cocaine Bear, but I enjoyed it a lot more. I truly dislike CGI animals, but I didn't mind it in Death of a Unicorn. Definitely worth a watch. I wish I had some powdered horn!"
  },
  {
    "rating": "5/5",
    "review": "I loved it. Ortega nailed the gen z vibe, for one. Secondly , it's rare a movie surprises me but my mouth was agape for most of this movie. Some very funny lines and an actually original plot. Will Poulter was perfect. Well done."
  },
  {
    "rating": "0.5/5",
    "review": "Should be good with a cast like it has but it's just not. The acting is bad There's no chemistry between actors They aren't believable as a family The unicorns look as fake as a pretend unicorn The character who's the son is completely pointless. It is just an all round bad film"
  },
  {
    "rating": "1/5",
    "review": "silly. poor dialogue. miscast. I left a half hour into the movie. it was a waste of my time."
  },
  {
    "rating": "3/5",
    "review": "A gory unicorn revenge story with a satirical edge and a soft heart? Sounds wild. And it kind of is. Paul Rudd and Jenna Ortega keep things watchable, but the tone is all over the place. There’s fun to be had, but not quite enough magic in the execution."
  },
  {
    "rating": "3/5",
    "review": "Of course the title and premise hooked me in. I did finish the movie. Another creature feature, this one starring Paul Rudd."
  },
  {
    "rating": "5/5",
    "review": "Death of a Unicorn is a wild, funny slasher comedy that doesn’t take itself too seriously. Paul Rudd and Jenna Ortega are great together—he’s the chill dad, she’s the goth daughter, and they hit a unicorn that turns out to be weirdly magical. What follows is Big Pharma madness, angry unicorn parents, and a whole lot of glittery gore. It’s messy, chaotic, and totally entertaining. Not perfect, but definitely a fun ride."
  },
  {
    "rating": "1/5",
    "review": "Terrible bad, stupid"
  },
  {
    "rating": "0.5/5",
    "review": "anyone who said this was a good movie straight up lied, absolute waste of 2 hours of life. horrible.."
  },
  {
    "rating": "1.5/5",
    "review": "Jenna Ortega is just a terrible actor. Ruined the whole movie, although the story line was kind of 'blah' to begin with."
  },
  {
    "rating": "5/5",
    "review": "I think this it's a good movie, especially when you just want to get your mind off things. Idk all this other critics.. y'all just thinking deeply."
  },
  {
    "rating": "4/5",
    "review": "I really liked the movie....but imo there were definitely some dumb development issues made in a flick that could have been a total standout. First, the theatre kids still have Hollywood in a stranglehold... they clearly want the \"fair maiden\" definition to be pulled from the \"we weren't invited to prom\" school of beauty lol. No biggie but tbh pure of heart doesn't always mean traditionally \"pretty\", so fair point. Second, I found nothing endearing about Paul Rudd's shallow yet supposedly \"doing his best\" character. Third - the term \"fascist\" used so utterly far out of context I feel like the writers of this movie came from a Seattle protest group. Lastly, the horror CGI moments looked like they grabbed a bunch of ex-Syfy movie developers because they could save on production costs. I still gave four stars though, because I thoroughly enjoyed the unicorns and unique storyline."
  },
  {
    "rating": "5/5",
    "review": "This story was insane and really enjoyable I wasn't sure what to expect but I think this is gold Will Shepherd definitely stole the show on this one I was laughing all throughout because of him I know Paul right was there but this guy has got something special The unicorns really good how about the story was nicely and done."
  },
  {
    "rating": "5/5",
    "review": "I like the movie 🍿 because I love Jenna Ortega"
  },
  {
    "rating": "3.5/5",
    "review": "Ngl it wasn't what i expected but it was a great movie. You just need to understand what's going on"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Great cast! Totally new not repackaged BS! I loved it!"
  },
  {
    "rating": "3.5/5",
    "review": "A bit of a predictable finished and basic special effects (particularly these days) but there you go."
  },
  {
    "rating": "3.5/5",
    "review": "The show was good Idea, script very bad in my opinion. Nobody's father can be that stupid."
  },
  {
    "rating": "0.5/5",
    "review": "Completely ridiculous in every way"
  },
  {
    "rating": "1.5/5",
    "review": "Found this movie surprisingly boring for its bizarre premise."
  },
  {
    "rating": "4.5/5",
    "review": "I surprising actually liked this movie. The storyline is very well done, the acting was well done, and it was so creative. Jenna Ortega was definitely my favorite part of the movie."
  },
  {
    "rating": "3.5/5",
    "review": "The mythology of this is truly creative so if you like unicorns and you had a childhood full of imagining potential storylines with them you are going to love this movie... I love the actors but I could do with less of the father-daughter recovering from mom dying tired dynamics since it's so predictable... The son of the rich people is absolutely hilarious and there are some truly inspired exchanges... The first 2/3 of this movie I would have rated a lot higher as the last act but I convinced two of my closest friends to watch it telling them it was a twisted side plot of princess Bride (I had no idea what it really was but I just threw that in there)... And we watched and appreciated the first two thirds constantly saying wow this is much better than I thought it was going to be and oh that's actually really funny... This movie deserves at least 78% it's well worth the watch because it's a completely fresh take on unicorns and the mythology of what it might mean in the modern world to see one."
  },
  {
    "rating": "5/5",
    "review": "I really liked how it was filmed, the script, and the actors. Ortega stood out more than everyone else. I like the actors who starred, the script, and I am very surprised by the degradation in the ratings of film production today. The film is a genre film and was filmed very well."
  },
  {
    "rating": "3.5/5",
    "review": "I enjoyed it, the last 30 minutes it got a bit carried away for me though. But it was surprisingly also very funny."
  },
  {
    "rating": "2.5/5",
    "review": "You'd think a movie about a real-life unicorn bonding with a rebelious teenager would have more originality to the story and characters. Sadly, it does not. It tries to go for horror/comedy, but I think it would've been better focusing on the drama."
  },
  {
    "rating": "3.5/5",
    "review": "It was...fun? Drags at times and Paul Rudd doesn't Rudd like usual. Themes are not subtle AT ALL. Some weird celestial god like imagery out of nowhere. but, there are killer unicorns so its a \"watch it once\" for me"
  },
  {
    "rating": "3/5",
    "review": "Interesting plot and has it's fun moments but the movie tries to hit you with a emotional ending that doesn't work as I never cared for the characters."
  },
  {
    "rating": "2.5/5",
    "review": "Yet another forgettable movie. A couple of fun deaths but overall nothing I would ever watch again for any reason."
  },
  {
    "rating": "4.5/5",
    "review": "I had a lot of fun watching this movie. It's a fun horror fantasy popcorn flick to watch with friends. Great performances and still wondering how Paul Rudd doesn't age."
  },
  {
    "rating": "0.5/5",
    "review": "All the characters are written to be insufferable. Especially Paul Rudd. I can't beleive these nepotistic writers had a strike to be paid more. Hollywood is dead. Over a decade and all they can still put out is trash. Maybe a handful of good movies since 2014. This is not one of them. It's pathetic."
  },
  {
    "rating": "3.5/5",
    "review": "It is overall a fine watch. The premise is quite simple and the plotpoint predictable. But watch it for the death."
  },
  {
    "rating": "5/5",
    "review": "Very Very great amazing fun movie a must see.. Loved every min of it.Very diff"
  },
  {
    "rating": "1.5/5",
    "review": "This film had the feeling of it being slapped together at the last minute. Nothing about it screamed of attention to detail. It was a mess from the beginning right up till the end."
  },
  {
    "rating": "3/5",
    "review": "'Death of a Unicorn' is an entertaining enough \"eat the rich\" horror satire that works better as bloody creature feature."
  },
  {
    "rating": "1.5/5",
    "review": "Really boring. Slow pacing, bland. There's really nothing that stands out in any way. One of those movies that I wished would hurry up and get to the ending. Like finishing a sandwich you made but then decided you didn't really feel like a sandwich."
  },
  {
    "rating": "0.5/5",
    "review": "Movie genre: boorrrriiiinnngggg"
  },
  {
    "rating": "3/5",
    "review": "A strange mix that has its moments of interest, but its outcome is highly dependent on the emotions it may generate in you and how willing you are to accept a less-than-powerful satire, with certain special effects that take you a bit out of your depth. It's an independent film from the A24 label, but it also has a grand ambition that goes beyond its own visual capabilities, leaving us with the feeling that it could have been much more than what we received, without being a disaster at all, but rather a decent film without much of a plot."
  },
  {
    "rating": "5/5",
    "review": "What some critics are talking about, the movie is fun. That's no need for more."
  },
  {
    "rating": "5/5",
    "review": "Absolutely LOVED death of a unicorn. Paul Rudd is a top favorite actor of mine. Couldn’t have picked a better cast. Story line was phenomenal. Loved how they left the end open and I hope to see a sequel. Bought it as soon as it came out on prime. Always been a big fan of independent films.A24 delivered an amazing film."
  },
  {
    "rating": "3.5/5",
    "review": "Payback is a beast. Death of a Unicorn is a 2025 American horror comedy film written and directed by Alex Scharfman in his directorial debut 🦄 It’s good 🙂Worth a watch. I’d recommend it if you like this genre 👍🏼 A father and daughter accidentally hit and kill a unicorn while en route to a weekend retreat, where his billionaire boss seeks to exploit the creature’s miraculous curative properties."
  },
  {
    "rating": "5/5",
    "review": "Love this movie with Jenna Ortega🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖"
  },
  {
    "rating": "2.5/5",
    "review": "They really used the Aliens iconic tracking device sound effect. lol this was obvious horror satire but really really not that good."
  },
  {
    "rating": "3.5/5",
    "review": "Far from perfect movie but I actually really enjoyed it. Ridiculous concept (in a good way), good acting and great casting. I like the themes and the characters. It was fun to watch. CGI was.. meh. CGI being it's biggest flaw but I was able to look past it because it was fun. Cocaine Bear level of enjoyment."
  },
  {
    "rating": "5/5",
    "review": "Finally a amazing Movie !!! 10 of 10 +...."
  },
  {
    "rating": "2/5",
    "review": "Wanted to enjoy it. Too corny. Tea Leoni is the only convincing character in this flimsy satire."
  },
  {
    "rating": "4/5",
    "review": "Death of a Unicorn sets out to answer a question no one’s really thought to ask: What would happen if unicorns existed—and were also kinda evil? The answer: Chaos. Before I go any further...Spoiler warning: This written review contains spoilers. If you're spoiler-averse, check out the two-minute spoiler-free version on my TikTok (@uninvited.reviewe) and Instagram (@uninvited_reviewer). My unsolicited opinion: Screen it (if you can handle a lot of gore) Let’s run through the good, the bad, and the horrifying. We start on a plane with Elliot (Paul Rudd), a recently widowed father, and his college-aged daughter Ridley (Jenna Ortega), heading off on a vague work trip. We don’t get much backstory other than the fact that the mother/wife recently died, and the father-daughter relationship is... strained. It’s the classic “dad tries too hard to win his daughter’s love when all she wants is to be heard” trope we’ve seen a million times. Honestly, it’s kind of wild that this cliché plays in the background of this movie. Personally, I think keeping the mom alive might have created a more compelling contrast between functional and dysfunctional family dynamics. On the way to a work meeting, Elliot hits a unicorn with his car. You did read that right, and if it surprised you, might I point you back in the direction of the title of the movie? Don't worry though, just when you think things are about to get too predictable, Paul Rudd comes out of nowhere and goes at the not-quite-dead-yet unicorn with a tire iron until, well, you learn that unicorn blood is purple. Fun! They toss the body into the trunk of their rental car and head off to their destination, planning to bury it later. Leaving me to wonder if purple blood would be harder to get out of upholstery than red blood. And if they thought to get rental insurance..... Anyway. Their destination: a mega-mansion owned by the ultra-rich Leopold family, who made their fortune in pharmaceuticals (shocking, I know). We meet Melinda (Téa Leoni), her husband Odell (Richard E. Grant), and their son Shepard (Will Poulter), who greets the guests with the line:\"Come here for a cut of the good stuff.\" (Delivered in such a sincerely deadpan way that I laughed out loud.) The Leopold family is perfectly cast—especially Leoni and Poulter. I want a whole prequel just about them; there are so many hints at an unsettling past that’s just as disturbing as the present events. Odell is dying of cancer, and Elliot is there in hopes of becoming the family’s estate lawyer—a very lucrative gig. But once everyone’s at the mansion, the real chaos kicks in. Unicorn blood, it turns out, has healing properties. And once the Leopolds discover this, their home turns into a mad-scientist lab overnight. The catch? The unicorn isn’t actually dead. It keeps coming back. One standout scene has the entire cast circling the newly re-dead unicorn, refusing to acknowledge what they’re seeing. Téa Leoni delivers a killer line:\"It's definitely some kind of horse-like mammalia.\" Another laugh-out-loud moment. The baffled reactions across the board make this scene one of the movie’s best. But this is a horror-comedy, so things must get serious eventually—and boy, do they. In under two hours (108 minutes), the movie wrings out every bit of its premise. When crushed unicorn horn cures Odell’s cancer—and can’t be reproduced in a lab—Odell gleefully announces:\"Supply is scarce, so demand will be high.\" Thus begins a bidding war among the 1%. Leading Melinda to declare, \"I haven’t had this much fun since we launched FenFen in ’94!\"—a line so darkly hilarious I laughed and immediately felt guilty. That scene is a perfect storm of horror, satire, and discomfort. The film swings big, but its sharpest moments lie in the smaller details— the reactions, and the dead panned one liners that land like punches. In one such moment, the core theme becomes clear: Who are the real monsters here? Unfortunately, from this point on, Paul Rudd's Elliot seems to drift aimlessly, and cluelessly, through the story. Once Ridley is positioned as the voice of reason, the film doesn’t quite know what to do with him. Ridley, meanwhile, forges a mysterious bond with the not-quite-dead unicorn. She slips away to investigate—and uncovers a larger threat. But in true horror fashion, no one listens. Enter: two very angry adult unicorns out for blood.The gore is immediate and intense. A wave of gruesome attacks wipes out half the supporting cast in some—memorable ways. The Leopold family responds by... sitting down to dinner.The kicker? Their loyal-ish servant Griff (played to perfection by Anthony Carrigan) brings Odell a unicorn steak. Odell digs in while delivering a monologue that is so full of rich white male privilege Richard E. Grant deserves some kind award for being so self-aware. Because there is no chance he could have delivered such a cutting, unknowingly vitriolic, and morally wrong monologue without having the knowledge of exactly what he was saying as an actor. After a botched hunting party, Odell gets gored in the neck. Chaos erupts. The lights go out. The unicorns invade. Griff flees. In perhaps the most absurd twist, we learn Shepard has been snorting crushed unicorn horn, which supposedly makes him smarter...? The movie doesn’t linger long enough to clarify. More death follows, including the gruesome disemboweling of Melinda—right in front of Shepard. Elliot locks Ridley in a room for “her safety,” underestimating the power of a woman who’s been ignored and proven right. Rookie mistake. The finale wraps up in a somewhat predictable way, but not before we get one great monologue from Jenna Ortega. The police arrive and arrest both Elliot and Ridley. (That’s not quite the end, but I won’t spoil everything—this review is long enough.) Final Verdict Death of a Unicorn isn’t perfect. Its big premise occasionally trips over itself. But it’s a horrifyingly funny takedown of Big Pharma, the ultra-wealthy, and the nature of villainy. The writing is mostly whip-smart and sharp. Its best moments are subtle—so don't scroll while you stream. The acting is solid throughout, especially from the Leopolds and supporting cast. Paul Rudd feels underused while Jenna Ortega deserved more room to lead. If you're a fan of Ready or Not, The Hunt, or Happy Death Day, this one’s for you. unwantedmoviereviews.com"
  },
  {
    "rating": "3.5/5",
    "review": "a dark comedy that morphs into a satire of Jurassic Park. This is funny and well acted, especially from Ortega, Poulter and Grant. The gore is spread thick in so be warned. I think the weakest link is Rudd who plays out of character which he's been associated with for so long, it's hard to ignore."
  },
  {
    "rating": "4/5",
    "review": "Will pouter STOLE the show with this one. The rest of the cast really worked well together too but if Will was talking.. you’re laughing. Symbolism was great and enjoyed how they worked in the mindset of modern day pharmaceutical owners. With so many few companies comedies released over the past year and a half.. this was fun to watch with a crowd."
  },
  {
    "rating": "3/5",
    "review": "Strange but original and entertaining throughout."
  },
  {
    "rating": "2.5/5",
    "review": "**Review – *Death of a Unicorn* (2.5 stars)** I went into *Death of a Unicorn* with high hopes—mainly because Paul Rudd and Will Poulter are in it, and those two can usually charm the socks off me. And while they do their thing here (Poulter especially, always good for a laugh), the film itself just doesn’t quite hit the mark. It’s got a stacked cast, no doubt, but it starts to feel like window dressing when the story’s this predictable. The unicorn? Surprisingly realistic in some scenes, but occasionally screamed CGI. Budget issues? Rushed post? Who knows—but it’s *about time* we got a proper unicorn flick, even if this one limps more than gallops. The satirical jabs at Big Pharma land here and there, and Anthony Carrigan is a treat as always. But horror? Eh. A few decent kills and jump scares, but it never fully commits to the genre. There’s a better movie buried in here somewhere. Now, on to Jenna Ortega. I’m officially tired. She’s talented, sure, but seeing her *again* as a moody teen? I'm over it. *Death of a Unicorn* has moments of magic, but they’re fleeting. Entertaining in bursts, forgettable in full. At least Rudd still looks like he drinks from a fountain of youth."
  },
  {
    "rating": "4.5/5",
    "review": "Quite a stupid movie but i liked it, i love unicorns, i love this kind of atmosphere and jenna was so cute as Ridley"
  },
  {
    "rating": "5/5",
    "review": "Loved every single bit of it!! Great cast, great script definitely funny in some ways, wasn't expecting everything that happened in this movie. Definitely watching it again!!"
  },
  {
    "rating": "1/5",
    "review": "Rubbish, not funny, not scary, very annoying unicorn / horse sound design."
  },
  {
    "rating": "5/5",
    "review": "The film's narrative revolves around themes of grief, love, and the quest for meaning, making it both relatable and thought-provoking. Not to mention human nature at its core to make a profit off of loss. The storytelling is masterfully crafted, with a script that balances moments of levity and heartache. The characters are well developed, each contributing to the overarching theme of finding hope amidst loss. Visually, the film is a feast for the eyes. The cinematography is stunning, with vibrant colors and breathtaking landscapes that enhance the magical atmosphere of the story. The scenes featuring the mythical unicorn are particularly enchanting, filled with ethereal lighting that captures the essence of wonder. These moments serve as a powerful metaphor for hope and renewal, in my opinion. The supporting cast delivers exceptional performances, bringing depth and authenticity to their roles. Their interactions are filled with humor, providing a perfect counterbalance to the film's more poignant moments. The relationships among the characters are intricately woven, showcasing the importance of connection and community during challenging times. Great casting! \"The Death of a Unicorn\" is a beautifully crafted film that resonates deeply with me. I love a good developed story, so this was spot on for me. This film is a must-see for anyone looking for a magical and moving cinematic experience that lingers in the heart long after the credits roll."
  },
  {
    "rating": "1.5/5",
    "review": "In order for this movie to work, the unicorn has to be the slightest bit believable. This appears to have had issues with budget concerning CGI and where those dollars were spent within the movie. It seems that the emphasis was put on the \"other dimension\" and not the star of the movie... the unicorn(sorry Jenna/Paul). Besides that enormous hole in the immersion of the film, I found every single character besides Griff, to be unbearably annoying/abrasive/difficult to want to continue watching. In the end, everything is predictable and cheesy. Nearly 2 hours wasted, with no memorable detail besides how ordinary the end result is."
  },
  {
    "rating": "1/5",
    "review": "I am so damned sick and tired of wasting my time and my money on movies shot in such poor lighting that you can barely make out which character is which. The evening and night scenes, with the characters outside AND inside had incredibly poor lighting. As for a review, what review? My review can only be based on the daytime scenes outdoors with full natural light."
  },
  {
    "rating": "0.5/5",
    "review": "watching this feelz more like slowly drowning in raw sewage , it stinks from start to finish and the pain increase the more u go . ortega looks older than rudd somehow . tea is getting better with age and floats above the stink the rest of the cast are secreting"
  },
  {
    "rating": "4/5",
    "review": "I loved it. Paul Rudd, Tea Leoni, Will Poulter and Jenna Ortega (especially) were great. Very entertaining horror/comedy."
  },
  {
    "rating": "5/5",
    "review": "Great movie loved every bit of it"
  },
  {
    "rating": "5/5",
    "review": "A biggest film of the fantasy With much refereces The Jurassic park. A inteligent Movie !"
  },
  {
    "rating": "5/5",
    "review": "was given The Last Unicorn vibes at first, but then it went in a bit of a different direction that was executed very well"
  },
  {
    "rating": "3/5",
    "review": "I love unicorns and all movies with them. That's all"
  },
  {
    "rating": "3.5/5",
    "review": "Solid \"B Movie\" with good acting, fun characters, good special effects, and the depth of a hot tub. Just eat your popcorn and have a good time."
  },
  {
    "rating": "5/5",
    "review": "Very good… love the whole layout about it and it’s a great horror comedy"
  },
  {
    "rating": "3/5",
    "review": "This was a fun, but largely forgettable film. I am unsure what Paul Rudd or Jenna Ortega found in the script to sign on as it was just basically a big budget B-level comedy horror movie. A mystical being turns out to be magical with their blood/horn being able to cure all…but wait they are out for revenge when you harvest them. This could have and many times have been almost anything. In this one they just happen to be unicorns and so pretty interesting looking ones at that. Perfectly watchable, but nothing I’ll remember long."
  },
  {
    "rating": "4/5",
    "review": "Slightly biased because I adore all of the actors in this film and it has UNICORNS. But this film is funny and dark with UNICORNS."
  },
  {
    "rating": "4/5",
    "review": "Definitely a good watch!"
  },
  {
    "rating": "4/5",
    "review": "I know it's kind of a dumb/corny movie, but it was fun. Sometimes that's all you can ask. If you want serious drama, look elsewhere. If you just want to turn your brain off and enjoy a dumb movie and laugh, this is worth going to see. I think Jenna O is always good in things she's in. ...she should have played Snow White. ...come one, Wednesday as Snow White kind of makes sense. lol"
  },
  {
    "rating": "2/5",
    "review": "As others have said what a loss with a cast of several comedic actors they just didn’t have the lines. Also was the cgi meant to be comical? It was."
  },
  {
    "rating": "5/5",
    "review": "Wonderful movie! I highly recommend seeing it if you like splatter, with a little bit of camp! 😀"
  },
  {
    "rating": "1/5",
    "review": "This was surely the least entertaining film I've seen for very long time - and this is a film that contains unicorns eating people! Yet somehow it takes itself seriously, while at other times playing for the broadest pantomime non-laughs. Richard E Grant should be ashamed of himself - his is probably the broadest and lamest of a lot of very obvious acting performances. All the scares and plot 'twists' are telegraphed - so there are no surprises and little tension. The CGI has a special place in all this - cranky, sped up and unconvincing, it nevertheless still looks like money was wasted on it - I could just imagine some CGI unit chucking this together in their downtime to pay the bills for proper work. There is some tedious 'plot' about a dead mother which fails to land; some suedo-religious stuff and some my little pony cutsie moments. If this is all making it sound fun - it's not. The best moment was probably when a scene went from night-time to daytime with no explanation - so at least you felt they were saving some money on this pile. A bit more incompetence and it could have started to at least be interestingly awful. There is a leaden 'rich people are bad' message - all played with the most obvious and dull caricatures. The Ortega character has a gamin sulky look and some acne - so we know she is going to the spiritual savior. Even her acne disappears in the most laughable plot twist. If this had had a skerrick of tension or one line of funny dialogue I would have given it a star and a half. Alas no - don't waste your money."
  },
  {
    "rating": "3.5/5",
    "review": "The 'rich people are evil' trope falls a bit flat in this \"fantasy-horror Knives Out,\" but the performances of Rudd & Ortega save it. I wish the wealthy folks had more depth - or that the film was more heightened. The realistic film setting with the cartoonishly selfish rich folks didn't blend well for me. The unicorns are genuinely intimidating and the premise is interesting. One thing to note: for some reason, all of the male deaths are quick and to the point, while the female deaths seem to go on for longer and are much more gruesome. It was definitely noticeable."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed the movie very much ! Im a huge fan of Paul Rudd, so he does no wrong. The movie was silly at times but I enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "I love Jenna Ortega 🖤🖤🖤💜💛💛💛💜💜💛💜💛💛💛💜💛💜💛💛💜💜💜💜💛💜💜💜💜💜💜💜💜💛💛 a"
  },
  {
    "rating": "5/5",
    "review": "It was really really good"
  },
  {
    "rating": "5/5",
    "review": "enough of a24 making absurdist movies that make me cry and laugh til my chest hurts"
  },
  {
    "rating": "5/5",
    "review": "The best unicorn movie since The Last Unicorn!"
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining. Not to be taken seriously by any means, but was a fun if somewhat gory at times watch."
  },
  {
    "rating": "4/5",
    "review": "Better than what I expected to be honest."
  },
  {
    "rating": "4/5",
    "review": "Although the ending was campy and the final scene seemed unneeded, I thought the overall film worked as a comedy horror. I thought the premise of the film was unique and inventive. To imagine Unicorns as a possible vicious creature was a great idea. There were some nice jump scares, and the film had a very good pace. It kept me entertained throughout. I was actually rooting for the Unicorns."
  },
  {
    "rating": "4/5",
    "review": "It was everything I wanted a killer unicorn movie to be and more."
  },
  {
    "rating": "3.5/5",
    "review": "It’s a silly movie, with an attempt of a message about “eat the rich,” but moreover it’s a movie worth watching if you just want to pass the time"
  },
  {
    "rating": "5/5",
    "review": "it was awesome recommend definitely"
  },
  {
    "rating": "4/5",
    "review": "Glad I saw this, as finding screens showing thie movie is quite hard. Falls into the category of Comedy/Horror in the way that Gremlins did. I can understand it struggling to find an audience, not scary enough for the horror fans, too scary for the comedy fans, with the Father/Daughter relationship not really selling it to the Date Movie crowd. Paul Rudd and Jenna Ortega are as likeable as you would expect, and worth the price of the ticket on their own. Its strength, and its weakness is how it shamelessly homages Alien/Aliens/Jurassic Park/Jaws. Great if you like that kind of thing!"
  },
  {
    "rating": "5/5",
    "review": "LOVED it! so unique and hilarious"
  },
  {
    "rating": "2.5/5",
    "review": "Kind of cheesy, Jenna Ortega's acting is okay."
  },
  {
    "rating": "4.5/5",
    "review": "Weird, wild, and totally original. Death of a Unicorn delivers dark laughs, killer performances from Jenna Ortega and Paul Rudd, and a story you won’t forget. Loved it!"
  },
  {
    "rating": "4/5",
    "review": "A gory, good time, \"Death of a Unicorn\" doesn't take itself too seriously, and as a result, is able to bring us along for a fantastical, sometimes silly, but ultimately good time. Nestled in the untouched Canadian wilderness, a family of CGI unicorns wreak havoc on a a bunch of stuck of rich people looking to exploit nature for their own monetary gains. The only real downside to the movie was having to muster up the suspension of disbelief required to overlook the very clearly computer generated unicorns. Maybe it was intentional as a means to make everything just a bit sillier? Regardless, \"Death of a Unicorn\" is worth the watch."
  },
  {
    "rating": "5/5",
    "review": "Loved every second of this movie! Jenna Ortega and Paul Rudd killed it!"
  },
  {
    "rating": "3.5/5",
    "review": "Death of a Unicorn is a very uneven, sometimes entertaining film that has many strands but doesn't manage to pull them all together. It's part satire and part horror fantasy, but neither done to the full extent. Elliot and his teenage daughter Ridley are driving to the wildlife estate of his boss, Odell Leopold. Elliot is his lawyer and he is going there so Odell can finalise some documents as he is dying from cancer. As they approach, their car hits a unicorn. Yes, that is right, a unicorn. The film only gets crazier from there. They stuff the unicorn into the boot thinking he is dead. But soon they realise he isn't and that the unicorn has some unique healing powers. This manages to get the Leopold family to try and make the unicorn their own so that they can cash in on its amazing powers. This sloppy film tries to be a satire but it doesn't quite work. It is generally a lot of fun though, even if a little silly and gory at times. A talented cast does fine work, with Will Poulter hilarious as Odell's vain son. A film of promise but a bit of a letdown."
  },
  {
    "rating": "5/5",
    "review": "My teen’s & husband loved the movie! They had a great time. They told me it would be too scary for me though lol."
  },
  {
    "rating": "3.5/5",
    "review": "I think the plot was really original. The overall movie I feel is watchable and a fun watch. The pacing was a bit fast I feel in the beginning and near the end but I did enjoy the ending. The cast was amazing and I think that helped it a lot as well. I’d watch it again when it comes to streaming. Overall it’s a good watch with an original plot and great cast."
  },
  {
    "rating": "4/5",
    "review": "When you think about unicorns, as one does, they’re these white, possibly fluffy, majestic creatures that give us a feeling that everything will be okay. The new A24 movie DEATH OF A UNICORN takes that and twists it into a fun, over-the-top but clever satire. Elliot (Paul Rudd) is a widowed father of Ridley (Jenna Ortega). They drive down to Elliot’s boss’ house Odell, who is dying and needs a proxy to run his company after he’s gone. Other characters include Odell’s wife Belinda (Téa Leoni), their spoiled son Shephard (Will Poulter), and their butler Griff (Anthony Carrigan). On the drive up, Elliot and Ridley hit what looks like a small horse with a girthsome protrusion coming out of its head. Disturbed, they put it in the trunk and carry on. When the others find out, well, they “horse around and find out”. I really enjoyed most of this movie. The amazing cast ensemble knows what kind of movie this is, and has fun with it, especially Poulter and Carrigan. I guess you can think of this as a more humorous JURASSIC PARK. Greedy narcissistic people playing around with something they don’t understand, you know the deal. It gets more violent as the movie goes on. I enjoyed the great but unlikeable characters, each having their moments to shine. The moments of CGI weren’t the greatest, but on a budget of only $15 million, I can’t blame them. My only problem with this movie is how they end up showing us a few different paths the story could go, but it doesn’t really go down any of them. They’re all good ideas, but it would’ve been better if it stuck to one and delved deeper. Other than that, the humor is funny and the violence is violent. Whether DEATH OF A UNICORN works for you or not, original movies are always a welcome and refreshing sight."
  },
  {
    "rating": "5/5",
    "review": "Absolutely hilarious. If U want to have a laugh, stellar cast and a soft horror then defo check it out. If U hate horror and avoid it (I do too usually) then just know that it's also rlly funny and enjoyable."
  },
  {
    "rating": "5/5",
    "review": "Very well done and a bit extrinsic. It was a fun movie."
  },
  {
    "rating": "2/5",
    "review": "The conflicts, twists, and turns were cliche. The moments of \"comic relief\" were not clever or original and they did not land. Overall I was bored and disappointed."
  },
  {
    "rating": "5/5",
    "review": "I loved this refreshing film. Great underlying concept, hilarious dark comedy but also a heartwarming horror! What a combo!"
  },
  {
    "rating": "5/5",
    "review": "A oddball entertainment spectacle of a movie!!"
  },
  {
    "rating": "4/5",
    "review": "Jurassic Park with unicorns"
  },
  {
    "rating": "3.5/5",
    "review": "It was just okay, nothing extraordinary. I can see why they yanked this movie from the theaters so fast."
  },
  {
    "rating": "4/5",
    "review": "There’s some chunky stuff in here; acceptance of loss and mortality perhaps being the most complex. No spoilers, but watching some major characters die (or do they?), we’re essentially challenged to reflect on our own ideas of the inevitable. And the unicorn is a perfect symbol of innocence to jut up against our habit of human greed. Trust humankind to stumble onto something truly magical and immediately try to harness it and GAIN from it. Read our full review at good.film: https://good.film/guide/meet-the-movie-thats-like-the-white-lotus-on-acid"
  },
  {
    "rating": "2.5/5",
    "review": "Ridiculous & stupid with bad pacing, editing, & VFX. A solid attempt to bring mythology & capitalism together in a unique & satirical way yet it ends up being an inconsistent slop. Poulter’s humor is a redeeming quality."
  },
  {
    "rating": "5/5",
    "review": "The movie was epic. Such great acting all around."
  },
  {
    "rating": "3/5",
    "review": "paul rudd is always going to deliver the likeable dad role (despite this script giving him few opportunities). death of a unicorn is a reasonable film for the most part, delivers what it set out to deliver, and doesn't have much serious depth. as a24 goes, this one is more worth seeing than some others, but i don't know if the cast warrants this production being in theaters. wait a month, it's nothing mindblowing."
  },
  {
    "rating": "4/5",
    "review": "interesting story, graphical and good ending"
  },
  {
    "rating": "5/5",
    "review": "Best Horror movie ever!! 😁My favorite character is the movie is Ridley who is played by Jenna Ortega. I also love that there was kind of a happy ending! 😊"
  },
  {
    "rating": "5/5",
    "review": "It's an absolutely beautiful bad movie. There's too many people that want to talk about it's cons, but it's pro is that it knew it's audience really well. It's incredibly funny and graphic in the right moments. If youre expecting a plot you're watching the wrong movie. This is purely a movie where there's a bunch of comedic actors and they die to a unicorn. Nothing complex."
  },
  {
    "rating": "5/5",
    "review": "I loved it so much it brought me back to my childhood with a little twist of evil and gore of unicorns meant for adults"
  },
  {
    "rating": "5/5",
    "review": "Death of a unicorn is a brilliant movie"
  },
  {
    "rating": "3/5",
    "review": "Dark Comedy Fantasy Thriller with an unbelievable family of three Unicorns with the ability to resurrect themselves and revive dead persons. Silly but funny."
  },
  {
    "rating": "3/5",
    "review": "Had its moments. Some of the bits landed with a chuckle, but most were just meh. Lots of source material cobbled from other, better done, films of the past but, fun from a shot for shot recreation perspective. Ultimately, though, some of the more comedy capable cast members were left with lame deadpan lines that landed with a thud. Merely an okay watch."
  },
  {
    "rating": "5/5",
    "review": "Awesome. This was so much fun. I took my family and we all had a great time. I haven’t enjoyed a horror movie as much as this since the original Evil Dead. For you modern folks : that’s better than “Nope!”. The unicorns are absolutely satisfying."
  },
  {
    "rating": "4.5/5",
    "review": "Definitely the kind of movie I would like to see multiple times in theaters, because its just so fun and awesome and ridiculous (in a good way). Its a movie you go into thinking, Unicorns killing people? This is probably going to be so stupid, and then it ends up being so fantastic that you just have to take all of your friends so you can have an excuse to see it again. Im currently working on taking all my buddies one at a time so I can keep watching it. Definitely dont miss out on this one."
  },
  {
    "rating": "0.5/5",
    "review": "What a horrible mistake for every actor in this movie. Gratuitous, bloody, senseless with a happy Disney- like ending. It will probably win awards. Also not funny. Just stay home."
  },
  {
    "rating": "3.5/5",
    "review": "I knew this was going to be over the top, from what the trailer showed, but I really enjoyed the lore behind it. Now the character, were ridiculously hysterical. Richard E Grant's character made me want to hate him, for sure. Loved the unicorn, gave me \"Cabin in the Woods\" kinda vibe...where they finally made a unicorn movie lol. Overall, it was fun movie to watch."
  },
  {
    "rating": "2/5",
    "review": "A strange movie indeed. It is supposed to a horror/comedy, but it is not very funny and it is not much of a horror movie. The characters are almost all unlikable, but is played well enough by the cast. The dialogue, storyline and some aspects (and scenes) of the movie are just really weak. Go watch only if you are REALLY open-minded and not expecting too much."
  },
  {
    "rating": "5/5",
    "review": "The food was delicious and the movie was awesome."
  },
  {
    "rating": "5/5",
    "review": "It was an amazing movie but predictable that’s the only thing I didn’t like but all the gore and blood it was my favorite part"
  },
  {
    "rating": "2.5/5",
    "review": "The only way I can easily describe how I feel about this movie is like this... Death of a unicorn could easily be one of those movies you put on the TV on Christmas day just so there's background noise and you don't care if no one actually pays attention. Why do I say this? Well.... honestly I sat during this whole movie just thinking to myself \"Is this a university film project?\" That's not to say that I necessarily thought this film was shot bad or that the VFX were terrible (even though there were definite continuity issues). But I just didn't feel like there was anything at stake for the characters at all, now, I do have to be honest I did miss the first few minutes of the film, so there may be some context I'm missing here. But ultimately the loss of the mother/wife character was repeated so many times I started to feel like this movie was actually a secret Alzheimer's test constantly checking if my short term memory was still functioning. Also, after seeing the film I'm honestly surprised it has a 78% Popcornmeter and this is one of the few times I'd actually agree with the critics in regard to this movie."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. It was a nice mix of horror and humor."
  },
  {
    "rating": "4/5",
    "review": "Definitely do not go in to this thinking you should take it seriously. It's a great time with some elements that remind me of some great shlocky 80s-90s. Practical and animated effects were great. Well rounded ending. I was definitely happy purchasing a ticket for this one."
  },
  {
    "rating": "1/5",
    "review": "The level of dumb cannot by offset by any of the good parts of the movie, of whcih there is little. Down to the CGI car spin out that fails to match the right shade of paint of its real world counter part"
  },
  {
    "rating": "1/5",
    "review": "Making Unicorns into blood-thirsty demons, and the senseless murder of Unicorns was disgusting!"
  },
  {
    "rating": "5/5",
    "review": "I liked the movie because of the mix of comedy, fright, and shade."
  },
  {
    "rating": "5/5",
    "review": "Not for kids. It's a horror movie! Even in the few moments of slower action, I was on the edge of my seat waiting for the next scene to make me jump. Death of AN Unicorn did not disappoint!"
  },
  {
    "rating": "3.5/5",
    "review": "Very original storyline with excellent acting from Will Poulter and Jenna Ortega. Relied way too much on jump scares which unfortunately got very old very fast and made the latter half of the movie far less enjoyable."
  },
  {
    "rating": "1/5",
    "review": "This movie was absolutely awful. I felt like you needed to stoned or on drugs to enjoy this movie. Although it tries to be a dark comedy, the attempts at satire fall flat. The result is a tonally confused, gracelessly shot and edited misfire that squanders its premise. Movie will most likely be streaming in a couple of months. Save your money and your time!"
  },
  {
    "rating": "5/5",
    "review": "The cast was great! It was a lovely tale of why one shouldn't mess with things that the know nothing about. It was very fun and entertaining! Having a fresh take on Unicorns, it really sends you on a journey of yourself and that we should definitely eat the rich. )"
  },
  {
    "rating": "5/5",
    "review": "Death of a Unicorn is a good time. The dark humor and violence mixed with fantasy and horror works well together. I feel like there was a subplot between Paul and Jenna grieving the death of his wife that was cut. performances of the supporting cast, especially Richard E. Grant and Will Pouliter were over the top and played extremely well. it does feel like it jumps around a bit but in all this movie is a good time."
  },
  {
    "rating": "4/5",
    "review": "Such a great movie with my 2 favourite things unicorns and horror"
  },
  {
    "rating": "5/5",
    "review": "Best movie of the year so far"
  },
  {
    "rating": "5/5",
    "review": "Awesome fun movie. Novel and had some good jokes. I'll watch again for sure."
  },
  {
    "rating": "1/5",
    "review": "There was nothing about this movie I liked"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. It is not a movie for everyone but if you like comedy/horror one offs this is for you. It will be part of my Blu-ray/ digital collection as soon as it's released!"
  },
  {
    "rating": "2.5/5",
    "review": "'Death of a Unicorn' is potential-laden, though unfortunately I just never really got my teeth into this one. The whole set-up is severely underwhelming, the whole plot with the rich family just didn't do it for me. It does pick up at the conclusion, which is where I see the potential. A movie solely about the Kintners and the unicorns could've been ace, especially if it lent into the fantasy side of it; almost if it was (iffy association incoming) 'How to Train Your Dragon'-esque, just with all the gore and death that this 2025 releaes does hold. The final scene, as oddly over the top as it is, shows the promise. Paul Rudd and Jenna Ortega are decent in their respective roles, not that I have any core moments to take from either of them here though. The Leopolds, as much as I wish they weren't in the film, are portrayed well enough by those on the screen, Will Poulter is minorly amusing to be fair. I'm sure it'll work for a good many, but I can't say it did so for me."
  },
  {
    "rating": "3.5/5",
    "review": "Death of a Unicorn: Almost Scanners Bloody Yeah, so they pretty much give away the whole story in the official trailer... I dont know... Paul Rudd plays a bit of a dick of a dad who compromises whatever values he might have at every turn and isnt able to listen at all to his daughter. Jenna Ortega plays another shut off art student teen... Rudd says something about not talking since she went away to school, so Im not sure if thats college or an expensive prep high school... I know Ortega has done other stuff besides Wednesday and Beetlejuice Beetlejuice (like Scream & Scream VI), and is in another horror/psychedelic whos trailer played before Death of a Unicorn, but I wonder what other roles she will feature in when shes done with the smart goth girl thing. She pretty much carries this one and is the emotional heart and soul of the story, which is worth the watch. The rest of the movie is wondering how the others are going to get killed by the demon unicorn that theyve pissed off. It isnt Scanners head exploding graphic (for you old timers), but its pretty close. Some of the victims dont quite deserve their gruesome fate, but most got a fitting bloody ending. Im curious how you feel about the ending and whether it was earned or what might have been a better ending."
  },
  {
    "rating": "3/5",
    "review": "Went in with low expectations and would say I was pleasantly surprised."
  },
  {
    "rating": "4/5",
    "review": "Fun Movie! I’m always watching for the music and there was some cool traditional fantasy going on here. The French horn melody can be a bit jarring at first but I think you need to be in a headspace of “Oh This’ll be a Fun Movie About Unicorns”. Eyebrow guy is funny too."
  },
  {
    "rating": "3.5/5",
    "review": "It was a fun movie - certainly worth the time and $$."
  },
  {
    "rating": "2/5",
    "review": "I mean, if you’re a teenager you might find some amusement in this movie, but for the most part I would not recommend wasting your money or going out of your way to watch this movie, don’t get me wrong the actors are great, the plot is just very odd"
  },
  {
    "rating": "5/5",
    "review": "This was a good movie, very entertaining. It went in a direction I wasn't expecting and that made it even more entertaining. Too bad the reviews kept some people away but at least try it, you'll be happy with the entertainment value. Yes, there is gore."
  },
  {
    "rating": "5/5",
    "review": "I love Jenna Ortega,s acting"
  },
  {
    "rating": "3.5/5",
    "review": "Imagine Jurassic Park with unicorns: that is Death of a Unicorn! It’ll work for some and come off as extremely campy for others, but I had such a fun time with it! It really is a satirical Jurassic Park if A24 got weird with it. Instead of dinosaurs, there’s a magical unicorn, a lot of greed, and pure chaos. It takes the “eat the rich” theme to wild, fantastical extremes in Alex Scharfman’s hilarious feature directorial debut. The film is totally camp, and the entire cast plays into the ridiculousness of the story. Sharp in humour, class commentary, and unicorn horn kills, this movie shouldn’t work — but it somehow does. It tackles a familiar concept but injects a fair amount of originality throughout. This cast is an absolute blast to watch interact on-screen, but it is Will Poulter and Anthony Carrigan who steal the show, thanks to Poulter’s insanely funny line reads and Carrigan’s brilliant non-verbal reactions. Jenna Ortega and Paul Rudd commit to the absurdity, carrying this fun, self-aware, well-crafted B-movie. It’s a mix of horror, comedy, and sci-fi satire that mostly hits the mark. It does lose steam as it can’t quite figure out how to bring it all together, but there is plenty of fun to be had. Also, the idea of unicorns turning evil is pretty awesome! It’s an over-the-top, ridiculous B-movie horror-comedy that ended up being a bloody good time and got a few genuine laughs out of me! Sure, it doesn’t have the most original plot structure and ends up being fairly predictable with some lacklustre visual effects, but it's an A24 killer unicorn movie that is pretty funny… what more could you want?!"
  },
  {
    "rating": "5/5",
    "review": "Gosh that I loved Jenna in this movie. She was so on point and amazing acting! Love you Jenna"
  },
  {
    "rating": "0.5/5",
    "review": "It was so bad. Like SO bad. Honestly shocked that this movie even made it to the big screen. There are a billion holes in the plot, the acting was not great, and there was a ton of cgi. Money and time was definitely wasted on this."
  },
  {
    "rating": "5/5",
    "review": "Amazing. The genre blend of horror/comedy on this was a perfect mix I didn’t realize I was missing in other movies. The characters were hilarious and weirdly relatable. Loved every bit of it. I give the comedy, satire, & tomfoolery an A+"
  },
  {
    "rating": "3/5",
    "review": "A mix of Harry and the Hendersons and Jurassic Park. While I hate to say it, I feel like Paul Rudd's usual smart ass personality would've played better than his distracted father persona. The nose knocker was comedically distracting as well."
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved this movie! I wouldn’t label it as a comedy but more so a drama/thriller. Jenna Ortega and Paul Rudd are amazing in this. I loved the story, the action packed scenes, and the ending is so satisfying. If you’re an animal lover, without spoiling, it’s a bit rough to watch in the beginning but I promise you it ties everything up really well, so stick with it! It’s an amazing movie and I give it an 11/10!"
  },
  {
    "rating": "3/5",
    "review": "definitely different but could be traumatizing to lil kids with the unicorns."
  },
  {
    "rating": "3.5/5",
    "review": "There are things that work in this movie which is mostly the cast and then there are things that don't work which is mostly the story. I thought the ending had some weird choices. If you want to watch a satire, give it try."
  },
  {
    "rating": "4.5/5",
    "review": "Quite a good movie the cast was quite good"
  },
  {
    "rating": "3.5/5",
    "review": "Original story and an ok watch. It’s not classic but it’s definitely watchable and enjoyable if you are into sci-fi/fantasy/horror/comedy"
  },
  {
    "rating": "5/5",
    "review": "This was a great movie. I would see it again in theaters and will buy it when it comes out."
  },
  {
    "rating": "3/5",
    "review": "Promising so much, it’s a thin film with not quite enough of anything about it do merit a positive review. A waste of talent for the most part, it was entertaining enough but not quite B movie enough for a slasher and not written well enough for satire"
  },
  {
    "rating": "4/5",
    "review": "Classic horror, it’s a reminder of a good horror film with suspense followed by brutal deaths. It has a fast pace getting the characters introduced then smash’s straight into the plot without pointless filler, the only negative is paul rudds character comes off stale with a attitude and personality constantly changes to best fit the story without reason for growth or change."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was entertaining and moved along at a pretty quick pace. I love dark comedy movies. Tea Leoni and Will Poulter were the standout performers. Paul Rudd was never really believable as a greedy money gruber, I felt like he never really committed to the part. Jenna Ortega seemed completely mis-cast as the sweet, virginal - maiden character. I like her as an actress but, it was a hard-sell for me. All that being said, it was funny and scary all at the same time. I would definitely recommend going to see it for a fun two hour escape,"
  },
  {
    "rating": "5/5",
    "review": "First, Love the actors. Second, action packed with some cringing scenes and a good story line. Really enjoy this movie."
  },
  {
    "rating": "5/5",
    "review": "It's fun AF! The designs of the unicorns were creepy and cool, Ridley and Elliott were extremely relateable and realistic characters, the kills were awesome. All around great movie."
  },
  {
    "rating": "4/5",
    "review": "Honestly don't listen to the Naysayers in the reviews! While its no Masterpiece, its a fun and campy Dark Comedy! Only Qualm I have with this movie is the ending. just felt a bit a corny and not very A24 esque. All this to say me and my friends were laughing, squirming and screaming in this delightful romp of a Monster Slasher!"
  },
  {
    "rating": "1.5/5",
    "review": "Most disappointing A24 outing I've seen thus far. Would that the unicorns had just eviscerated all of these flat, one-note characters outright en masse to spare the audience the grief of sitting through this half-baked ordeal."
  },
  {
    "rating": "4/5",
    "review": "Went in with little to no expectations & I enjoyed it! The ending was a little corny but fun movie! It’ll make you see unicorns differently!"
  },
  {
    "rating": "4/5",
    "review": "Overall a fun movie. Great cast."
  },
  {
    "rating": "5/5",
    "review": "10/10 and funny af. Justice was served."
  },
  {
    "rating": "5/5",
    "review": "Honestly the trailer for this movie made it look so boring, but it was very entertaining and something new with good acting, funny moments, and some much deserved death by unicorn moments."
  },
  {
    "rating": "4/5",
    "review": "Fun movie! Lots of good laughs and great gore! Do not bring your young children to this one!"
  },
  {
    "rating": "5/5",
    "review": "Movie was funny and amazing I enjoyed the unicorns and the mountain scenery"
  },
  {
    "rating": "4.5/5",
    "review": "Cult classic! I tensed up. I laughed, and I cried. Would watch again!!"
  },
  {
    "rating": "4/5",
    "review": "Decent ride and entertaining albeit predictable. Its all here: story, acting and action. Worth a watch you will be entertained. All actors and characters did a good job"
  },
  {
    "rating": "5/5",
    "review": "Very funny, very touching, and just graphic enough. Very cool unicorns!"
  },
  {
    "rating": "5/5",
    "review": "It starts with a bang, literally, and doesn't let up from there. The justifications the wealthy characters come up with to kill or capture a unicorn are spot on for todays politics. Ny wife and I went in with low expectations but were thrilled to see how the true horror/comedy/irony played out."
  },
  {
    "rating": "3.5/5",
    "review": "Great acting actually, and moments of funny dialogue to keep it continual and fun."
  },
  {
    "rating": "5/5",
    "review": "Really fun movie. Critics are taking it far too seriously. Go unicorns!"
  },
  {
    "rating": "4.5/5",
    "review": "I watched this movie without any presumption of the plot and loved it. It had a nice balance of comedy and horror. I thought all the characters were believable and the dialog top notch."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie, definitely worth the watch, I love the unique and different take , it gets your mind thinking if unicorns were real is this something that it would be like , it was a curious adventure"
  },
  {
    "rating": "5/5",
    "review": "It was actually pretty good and funny"
  },
  {
    "rating": "5/5",
    "review": "Don’t listen to all the hate about this one. It’s an AWESOME movie! Listen to Mother Nature and don’t mess with her if you’re not prepared for the karma she’ll serve."
  },
  {
    "rating": "5/5",
    "review": "Wonderful suprise. Went in with no expectations bit loved it. It’s a great commentary on current powers in the world. You can tell who each evil person represents if you pay attention to the real evils."
  },
  {
    "rating": "1.5/5",
    "review": "Imagine if Blumhouse made a My Little Pony movie. It could not be more awful, silly and pointless than this is. Be glad you read this, now you don't have to actually sit through it."
  },
  {
    "rating": "4.5/5",
    "review": "Really entertaining. Silly and serious all at the same time. Enjoyable."
  },
  {
    "rating": "3.5/5",
    "review": "Fun movie — comedy, horror, fantasy, and drama all rolled into one. Most of the cast played over-the-top stereotypes, with one exception — Jenna Ortega was great and made the movie work. Odd, different, never boring, lots-of-action, tongue-in-cheek acting, fun movie."
  },
  {
    "rating": "2/5",
    "review": "I’m disappointed in Jenna Ortega. We get it, you like to play a rebellious teenager in horror movies. Try something little more challenging next time."
  },
  {
    "rating": "2/5",
    "review": "Cool and original concept, but the movie was slow and not too much evil unicorn action."
  },
  {
    "rating": "5/5",
    "review": "Movie was funny and different as far as the story goes. It was entertaining."
  },
  {
    "rating": "3/5",
    "review": "Entertaining and good performance from Jenna Ortega, but the plot felt a bit shallow with a predictable ending"
  },
  {
    "rating": "5/5",
    "review": "I don't normally go to horror movies, not a fan. Went on a whim and was happy I did. Go see this!"
  },
  {
    "rating": "5/5",
    "review": "A fun, campy horror movie for anyone who loves the genre. Recommend for any Shudder fans who like comedy/horror"
  },
  {
    "rating": "4.5/5",
    "review": "Death of a Unicorn is a hilarious horror movie The unicorns are made perfectly."
  },
  {
    "rating": "1/5",
    "review": "Definitely a streaming movie. Just wait."
  },
  {
    "rating": "5/5",
    "review": "Solid Movie. Nothing bad to say."
  },
  {
    "rating": "5/5",
    "review": "it was a really great movie, and I only hope that more people watch it."
  },
  {
    "rating": "4.5/5",
    "review": "Hilarious - great references to creature horror genres. If you don't like it...you don't get it"
  },
  {
    "rating": "5/5",
    "review": "Really fun movie ,one that you enjoy all the way through"
  },
  {
    "rating": "3.5/5",
    "review": "a mostly fun watch, with a few highlights that make the movie shine as bright as a unicorns horn and a few major lowlights that make me wish i was one of the unicorns victims. Positives Will Poulter carries this movie heavily, easily the funniest character on screen, he really shines here. The tension in certain moments in really good, just enough suspense. Jenny Ortega puts in a solid performance, had me rooting for her throughout the film. Paul Rudd puts in an good performance as the intentional frustrating parent caricature. They're both quite likeable characters and worthy of rooting for on their own but together i did not feel much chemistry in the father daughter relationship they were going for. The ending death plot twist had zero tension, was very predictable and cliché and made me feel absolutely nothing. The whole trend of fake character death is one of Hollywood's greatest mistakes. Still definitely worth a watch and regardless of my complaints, this film is still a worthy addition to A24's catalogue move to mainstreaming."
  },
  {
    "rating": "5/5",
    "review": "I was a bit nervous, thought the graphics of the beasts might be too off, but I haven’t thoroughly enjoyed a film like this in a long time. From the witty dialogue, to the talented actors (even the butler Griff! Hope to see him in more things,) to the outstanding gore factor. This sci fi campy horror film has something for everyone (except if you don’t like gore- they had fun with that!)"
  },
  {
    "rating": "4/5",
    "review": "No surprises here. Fun ride if you love watching Paul Rudd fight against ridiculous circumstances. The gore was well done. The effects made the unicorns feel real."
  },
  {
    "rating": "3/5",
    "review": "Loved the gore in this movie and a lot of jumps cares. There were so many predictable moments in the movie and you knew where they were coming"
  },
  {
    "rating": "5/5",
    "review": "Highly enjoyable and wonderfully cast. We enjoyed the twists and turns of this movie and ended up properly terrified of unicorns. It’s an odd movie and we came away wondering how anyone ever thought that plot was a good idea…but somehow it worked and we loved it. Will Poulter stole the movie. His character was so douchie and horrible but he had all the best lines and wonderful comedic timing."
  },
  {
    "rating": "5/5",
    "review": "I like the movie. It wasn't slow pace, and it was a bit comedic at times with Will Poulter character. The plot was also quite unique, which is why I liked it as it wasn't something repeated from Hollywood. overall, great movie. I totally recommend it."
  },
  {
    "rating": "4.5/5",
    "review": "My child gave it a 10/10, there was a bit of wording that I don't agree with so I give it a 8/10, average is 9/10 for both of us. Definitely a fun watch and worth the go, especially since it was a new movie, not a rehash which is so much needed in this time and age. No idea how to mark this as verified. We saw this today so, uh.. I verify that it was watched."
  },
  {
    "rating": "4/5",
    "review": "Paul Rudd and Emily Ortega were great in this movie. The plot line was unique and different. The CGI unicorns were not great. Would definitely recommend this one."
  },
  {
    "rating": "2.5/5",
    "review": "Movie was fine but the theater was atrocious. Broken seats and the people next to us kept talking"
  },
  {
    "rating": "5/5",
    "review": "Movie was really good from start to finish! Cant wait to see again."
  },
  {
    "rating": "4.5/5",
    "review": "Way better and surprisingly less ridiculous than expected. Actually fun and cute."
  },
  {
    "rating": "5/5",
    "review": "What Hollywood needs, enough with the rehashing. It's exactly what it is, a Unicorn and gore. Excellent movie"
  },
  {
    "rating": "5/5",
    "review": "Better than expected! Very funny just a little gore"
  },
  {
    "rating": "5/5",
    "review": "A truly unique type of movie. Although it had a little bit of Jurassic Park in it, I really enjoyed it. These unicorns have supernatural powers, and when this rich family decides to try to capitalize on The death of one of the unicorns, they ultimately get revenge.i was never quite sure what would happen next and in the end, the good overwhelmed the evil. Definitely very entertaining."
  },
  {
    "rating": "5/5",
    "review": "Refreshingly good! I love, weird an obsecure movies such as this one."
  },
  {
    "rating": "5/5",
    "review": "Cool take on unicorns! had lots of funny moments and Good suspense and a little Gore. Definitely was entertained the whole time!"
  },
  {
    "rating": "3.5/5",
    "review": "I had a lot of fun with this one. Such a great cast and not just the main folks all the side characters were played by reliably hilarious people like Jessica Hynes and Anthony Carrigan. And I think they really made the most of the concept. The film really captured the beauty, wonder, and horror of Unicorns. I really liked the design of the unicorns as well. The CGI in parts wasn’t 100% but it never bothered me, I can’t really say they looked Fake because what I’ve never seen a real Unicorn. This is another film that will be classified as horror and again I disagree with that, and Nicole agrees. Yeah it’s kind of a monster movie with death and gore but it’s a dark comedy above anything. I just think slapping the Horror descriptor on so many movies muddies what the movies are at their core and also means some people will automatically turned of by the term Horror or others will be disappointed that it didn’t live up to what they think a proper Horror should be. Nicole enjoyed this one a lot as well. As I’ve said before she just loves seeing a talented cast doing what they do best. She particularly enjoyed Tea Leoni’s performance."
  },
  {
    "rating": "5/5",
    "review": "Absolutely Loved This!!!!"
  },
  {
    "rating": "5/5",
    "review": "Really good tempo and plot."
  },
  {
    "rating": "4/5",
    "review": "Death Of A Unicorn turned out much better than I expected. It doesn't take long to get into the heart of the story. Some of the characters could have had a little more quality to their roles but the movie didn't suffer because of it. The Unicorns portrayal which was much better than thought. so that really helped the movie out. the ending could have been tweaked just a little bit better, but for the most part it was worth the time to see it in the theater. I gave it an 8 1/2 so enjoy the movie with your soda and popcorn."
  },
  {
    "rating": "3/5",
    "review": "The cast of this film make up for the story. Pretty much everyone in the have it their over the top all in roles you’d expect them to be in. Sadly the story is just a little dull and doesn’t really push boundaries and becomes a little boring."
  },
  {
    "rating": "4.5/5",
    "review": "Critics are wrong on this one, but then again it's pretty hard to judge a film called \"Death of a Unicorn\" by any standard metrics. It's full stop the funniest movie I've seen in years. Just go see it."
  },
  {
    "rating": "2.5/5",
    "review": "Interesting and original idea , it wasn’t a bad movie but I could’ve waited for it to come out on streaming platforms"
  },
  {
    "rating": "5/5",
    "review": "Very dramatic with great digital effects. Lovely story line. Retaliation at its finest!!"
  },
  {
    "rating": "4/5",
    "review": "What a twist. Fiction but thrilling and fear tainted…"
  },
  {
    "rating": "5/5",
    "review": "It was a wonderful movie all around: great actors, great acting, and a great story."
  },
  {
    "rating": "4/5",
    "review": "Death of a Unicorn is a wild, genre-blending ride that takes you places you absolutely weren’t expecting—but you’ll be glad you went. Imagine Jurassic Park, E.T., Taken, and Aliens all thrown into a blender and cranked to high speed—that’s the energy this film delivers from start to finish. Jenna Ortega continues to prove she’s one of the most magnetic young actors working today. She brings sharp wit, vulnerability, and a grounded presence that anchors the madness around her. Will Poulter is a perfect complement—equal parts awkward charm and unflinching intensity. Their dynamic gives the film its emotional pulse amid all the chaos. The plot is absurd in the best way, the visuals are stunningly weird, and the tone swings from heartfelt to hilarious to horrifying without missing a beat. It’s not perfect—some of the pacing stumbles and the genre mash-up might not be for everyone—but it’s bold, original, and never boring. If you’re in the mood for something totally off the rails but anchored by two killer performances, Death of a Unicorn is a must-watch."
  },
  {
    "rating": "4.5/5",
    "review": "I think it’ll be a cult classic. The spirit of the movie is intact and as far as horror comedies go, this one’s pretty great. Solid creature feature."
  },
  {
    "rating": "5/5",
    "review": "Very different from normal unicorn movies. I like it."
  },
  {
    "rating": "5/5",
    "review": "Really good story, had funny parts and loved the actors"
  },
  {
    "rating": "4/5",
    "review": "It was interesting. Im really good. Had potential to go much more places though. Kind of stuck on one painting/drawing for a backdrop that never really was explained."
  },
  {
    "rating": "3.5/5",
    "review": "Flawed but highly enjoyable"
  },
  {
    "rating": "2/5",
    "review": "The first half could of been better."
  },
  {
    "rating": "0.5/5",
    "review": "Slow movie and ended up leaving halfway through."
  },
  {
    "rating": "4/5",
    "review": "Even with its, dare I say, horned in themes, it’s still one of the most creative movies released this year, maybe this decade."
  },
  {
    "rating": "1/5",
    "review": "Very slow and pointless. Disappointed to say the least."
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved it. Ortega pulled off the her character flawlessly, Rudd made you hate his character then love him, Carrigan was wonderful as Griff, and the other actors and actresses seemed like they were just there for the paycheck."
  },
  {
    "rating": "3/5",
    "review": "Idk how to feel about this film"
  },
  {
    "rating": "4/5",
    "review": "This is a fresh and funny movie that's not getting the love it deserves. Makes me a fan of Ortega even though I'm not lol. See it in the theatre and you won't be disappointed!"
  },
  {
    "rating": "3/5",
    "review": "Strange, but did keep me interested till the end."
  },
  {
    "rating": "5/5",
    "review": "A24 is on a roll love it, the horror, the gore, and the meaning 😗🤌🏼"
  },
  {
    "rating": "4/5",
    "review": "If you're a fan of horror comedies, you'll thoroughly enjoy the campy gore of the movie. The story isn't particularly original (minus all the unicorn-related deaths, obviously), but the entire cast delivers an excellent performance and you get exactly what you're expecting."
  },
  {
    "rating": "4/5",
    "review": "I liked the movie. I always enjoy an A24 film for its original stories as opposed to the typical films coming out that are rehashed films of movies that don't need remakes."
  },
  {
    "rating": "4/5",
    "review": "Different than what I expected but I enjoyed it"
  },
  {
    "rating": "3.5/5",
    "review": "i liked griff he was cool. good movie"
  },
  {
    "rating": "5/5",
    "review": "Loved this movie! Dont listen to the critics. Great originality and a great blend of funny and horror."
  },
  {
    "rating": "5/5",
    "review": "Such a fun ride and concept. Worth it."
  },
  {
    "rating": "5/5",
    "review": "Absolutely LOVED this movie - truly can't understand the mediocre reviews. Unless unicorns disembowling horrible people makes you want to throw up your pretty little lunch, you should be fine."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was interesting although I felt the characters reactions to things were not realistic (even if unicorns existed)."
  },
  {
    "rating": "2/5",
    "review": "just didn't connect with it"
  },
  {
    "rating": "4/5",
    "review": "Definitely laughed out loud multiple times! Some awesome plot twists. Was it the best movie ever, no.. however the cast was great, original storyline, love the camp, love the gore, and ultimately recommend! For sure worth watching!"
  },
  {
    "rating": "4/5",
    "review": "First and foremost, people should realize that just because this movie has the word \"Unicorn\" in the title, IT DOES NOT MEAN BRING YOUR 8 YEAR OLD DAUGHTER (That kid is 100% going to have night terrors). We seent it happen today! This is an A24 studio comedy/horror that fully lives up to their other productions. It's a fun adult oriented movie, with laughs, gore, and another great performance by Jenna Ortega and a solid showing for Paul Rudd (although Ortega steals the show). This is a solid story of greed and pride, displaying what we actually sacrifice when we prioritize providing financial peace for our children through our career, instead of physically being there for them. It's a fantasy horror with heart, and makes you laughingly cheer for the unicorns when they seek their bloody revenge. 7.3/10"
  },
  {
    "rating": "2.5/5",
    "review": "Despite an enthusiastic cast and a premise primed for success, Death of a Unicorn proves surprisingly slight both comedically and narratively."
  },
  {
    "rating": "4/5",
    "review": "Original storyline and great acting. Very entertaining."
  },
  {
    "rating": "3/5",
    "review": "I’m giving it 3 stars because the unicorn angle was unique. Otherwise, I’d give it 2. They should have focused more on the unicorn lore rather than the ultra rich whackos trope, which is SO overdone right now. They turned an original idea with a lot of potential into a generic slasher, which was disappointing."
  },
  {
    "rating": "3.5/5",
    "review": "A bit over the top. Not really a fantasy but not realistic enough either."
  },
  {
    "rating": "5/5",
    "review": "Movie is very new and good, brings something different to the movie theaters. Very entertaining"
  },
  {
    "rating": "5/5",
    "review": "It was very entertaining. I enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "This is a decent movie. It’s not much of a horror movie at all, particularly because it doesn’t rely on jumpscares, gore, and sadism, which most horror movies do, and it also has good actors and a decent budget. The over-arching message is “the good guys always win”, the tired trope that features in many movies from the US. It would also have benefitted from a lack of the American mentality of “shoot at the problem”. A good movie that could have been better if it had a touch of restraint and less moralising."
  },
  {
    "rating": "0.5/5",
    "review": "Complete rubbish. Acting was appalling and the story line was just nonsense. Don't waste your money on this!"
  },
  {
    "rating": "3/5",
    "review": "Just finished the movie, had to admit it was very creative, and if ur a massive gore lover then this film had some proper gushing scenes, some parts were funny but mainly a horror film giving gripping suspense for the viewers, the move is worth watching especially if ur a jenna ortega fan."
  },
  {
    "rating": "4/5",
    "review": "Never have I ever laughed so much at a horror movie. There were just as many shrieks of horror as there were laughter. Good movie. NOT for little kids."
  },
  {
    "rating": "5/5",
    "review": "From the things I’ve seen recently it’s definitely the most entertaining! Absolutely loved it just my opinion of course"
  },
  {
    "rating": "4/5",
    "review": "Humorous horror comedy. Good mix of gore, (somewhat predictable) jump scares and laugh out loud moments"
  },
  {
    "rating": "4.5/5",
    "review": "If you’ve ever seen a creature feature with jump-scares, there’s not much here that will take you by surprise. That doesn’t make the story or visuals any less fun, though! There’s nostalgia in the familiarity, and that unicorns are the creatures in question adds a fun twist. There is some gore and adult language, but it never felt excessive to me personally. If you go into this film accepting it for what it is, a dark comedy creature feature fantasy where unicorns “eat the rich” (figuratively and literally-ish), it’s quite a lot of fun!"
  },
  {
    "rating": "4.5/5",
    "review": "the fantasy parts were great, lots of action and gore, super funny. the guy from( we're the millers) was hilarious.."
  },
  {
    "rating": "2/5",
    "review": "Rudd and Ortega are the same character in every movie. Anthony Carrigan was the best part of this movie."
  },
  {
    "rating": "3/5",
    "review": "The movie was okay. It wasn’t bad but, it was entertaining. The cast was brilliant and it was interesting. 👍😀❤️"
  },
  {
    "rating": "4/5",
    "review": "Actors played their character superbly. Cgi is not as good creature movement like Jurassic movies but the storyline got my interest. They put the Unicorn mystic on another level of fantasy. As a kid growing up, unicorns are lovely animal toys to pet and hug in bed at night. It changed my perspective after seeing this movie. Its definitely not suitable for kids but adults will enjoy it from start to end."
  },
  {
    "rating": "0.5/5",
    "review": "Too much Gore. Who is directing this, Jack the Ripper? Confusing acting. Is this SciFi, horror, comedy? I thought Unicorns were supposed to be gentle. Ripping people apart, even if they deserve it is not gentle. Spoiler alert, the unicorn is not dead."
  },
  {
    "rating": "4/5",
    "review": "A unique plot and great storytelling, something that is sorely lacking in Hollywood these days. Great performances by all the actors, too, with some of your favorites being supplemented with some fun new faces."
  },
  {
    "rating": "4/5",
    "review": "A true horror movie with comedy - it is worth a try. Alex Scharfman has made something truly creative involving a fantasy creature with history. And is it similar to something like \"I Know What You Did Last Summer?\" Without context, there is some great casting having Jenny Ortega, Paul Rudd, Will Pouter, Téa Leoni & Richard E Grant portraying the quirky & relatable characters. The soundtrack is also brilliant with its suspense & frights that can go well with characters feelings, the unicorns attacking & the odd jumpscares. Credit to Dan Romer. IF YOU ARE INTO UNICORNS & ARE HAPPY TO SIT THROUGH HORROR MOVIES, THIS IS A MOVIE FOR YOU."
  },
  {
    "rating": "5/5",
    "review": "The movie kept you on the edge of your seat and it stayed true to the unicorn lore."
  },
  {
    "rating": "3/5",
    "review": "Funny and enjoyable 90 min with good scares along the way. Great set of actors."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie. Was entertaining and the casting was great. Why you go to a theatre to take you into a different life for an hour an a half. Worth it."
  },
  {
    "rating": "3/5",
    "review": "A Sprinkle of Magic, But Ultimately Mundane. A24's Death of a Unicorn arrives with a quirky premise and the studio's signature promise of something a little off-kilter. The setup – a father and daughter accidentally hitting a unicorn, leading to corporate exploitation and mythical mayhem – certainly teases a good time. However, while the film offers moments of dark humor and an intriguing concept, it ultimately feels like a missed opportunity, a fantastical dish that's missing a key ingredient. The cast, featuring Paul Rudd and the captivating Jenna Ortega, do their best with the material. Will Poulter steals the movie as he typically does. There are glimpses of the sharp satire A24 is known for, particularly in its skewering of pharmaceutical greed and the absurd lengths the wealthy will go to for profit. Richard E. Grant, as the villainous CEO, chews the scenery with relish, embodying the avarice at the film's core. Yet, despite these promising elements, Death of a Unicorn struggles to fully coalesce. The humor can be uneven, landing with a thud as often as it elicits a chuckle. The horror elements, while present, feel somewhat muted, never quite reaching the level of tension or dread one might expect from the premise. The film seems unsure whether to lean fully into its comedic absurdity or its darker, more satirical undertones, resulting in a tonal imbalance that prevents it from truly excelling in either genre. Ultimately, Death of a Unicorn feels like one of those films that has a great elevator pitch but falters in its execution. It offers enough intriguing ideas and entertaining performances to hold your attention, but it doesn't quite deliver the satisfying or memorable experience you might hope for from an A24 production. While it's not a bad film, it doesn't fully capitalize on its potential. You'll likely have a decent enough time, but it's the kind of movie that will probably feel more rewarding to watch from the comfort of your couch when it eventually hits streaming platforms, saving you the price of a theatrical ticket for an experience that ultimately feels a little underwhelming."
  },
  {
    "rating": "4/5",
    "review": "Death of a Unicorn – Sparkles, Scream-Snorts, and Straight-Up Chaos Well. That was unhinged. Death of a Unicorn is like if Jurassic Park and Lisa Frank had a deeply confusing love child after drinking expired kombucha. And I say that with affection. I enjoyed this movie more than I probably should have. It was wild, weird, and somehow made unicorn blood seem like the most logical cure-all for my back pain, seasonal allergies, and general life fatigue. Let’s just get this out of the way: yes, the unicorns growled and I swear one of them had the exact same snort-roar as the T. rex from Jurassic Park. There were shots, lighting, and musical swells that made me look around the theater like, “Wait—is anyone else hearing this? Are we in Isla Nublar or Narnia?” The only thing missing was Jeff Goldblum in a leather vest whispering, “Life finds a way… through glitter.” Paul Rudd was solid, but let’s be honest—we all wanted peak Paul. Full quirky, snarky, sarcastic Paul. Instead, we got Paul on a decaf latte. Still charming, but I missed the signature sparkle. Give me that man riffing with a unicorn, please. The storyline itself? Surprisingly deep. Cheesy, sure—but also weirdly reflective in a “wait, am I crying over a mythical horse’s existential crisis?” kind of way. It somehow balanced heartfelt moments with scenes that felt like they were written during a sugar crash. The humor worked for me—definitely campy, but it leaned into the madness and owned it. The only real gripe? The baby unicorn. That poor thing looked like it wandered in from a low-budget fantasy game on Steam. The adult unicorns had this majestic, believable look—like they belonged in a slightly terrifying enchanted forest. The baby? Looked like someone duct-taped a horn to a goat plushie and hoped for the best. Still, I can’t say I was bored for even a second. It had blood. It had sparkle. It had moral dilemmas. It had… unicorns running in slow motion while roaring like prehistoric nightmares. Final thoughts? It was absolutely bonkers—and I was absolutely here for it. Would I watch it again? Probably. Would I drink unicorn blood for chronic fatigue? Don’t tempt me."
  },
  {
    "rating": "3/5",
    "review": "Unicorns and Slashers? Yes, Please. But This One Tried Too Hard and Delivered Too Little. I was genuinely excited for this movie—the idea of a mythical slasher-comedy featuring unicorns sounded like chaotic fun in the best way. It had all the right elements: a wildly original concept, a great cast, solid effects, and a tone that could’ve been something special. But sadly, it didn’t come together the way I hoped. The comedy didn’t land for me, and the pacing was way off—it felt about 40 minutes too long. I actually considered leaving, but my husband was determined to see it through. The gore was a lot. I’m an ’80s girl, so I’m not squeamish, but this went beyond creative kills into just plain over-the-top. I found myself covering my eyes more than I expected to for a movie that was supposed to be a comedy. As much as I love Paul Rudd, his “dumb dad” character felt out of place, and the family’s weird level of control over everything made the plot feel more confusing than clever. I wanted to love this movie. I really did. But for all its potential, it just tried too hard and ended up feeling like a missed opportunity."
  },
  {
    "rating": "4/5",
    "review": "Lot of laughs and crazy scenes!"
  },
  {
    "rating": "5/5",
    "review": "Super funny and very entertaining!"
  },
  {
    "rating": "5/5",
    "review": "Perfect mix between “horror” and fantasy."
  },
  {
    "rating": "3.5/5",
    "review": "\"Death of a Unicorn\" is more concerned with being fun and entertaining than other A24 films can feel. The movie has scary moments and a dark sense of humor, but I feel had me engaged the whole way through even with the many tones. I think the premise is simple enough and I think the story was executed in a solid way. I did feel the lore of unicorns felt a bit lacking and that aspect of it could have been more interesting. I also think the movie played it pretty safe and could have gone in even wackier directions if it wanted to. The ending of the movie also feels a bit abrupt for me and I don't think the movie has as much closure as I would have preferred. Nonetheless, I think the actors are really carrying this one a level above an okay movie and I also appreciated seeing something that felt original. Overall, it is a movie that has seemed to be divisive, but I personally liked it and appreciated many qualities about it, and still feel hopeful of what is to come from A24 in 2025."
  },
  {
    "rating": "5/5",
    "review": "Loved it so much! One of the most fun movies I’ve seen in theaters!"
  },
  {
    "rating": "5/5",
    "review": "Anyone who didn't like this movie clearly went into this expecting something else. If you didn't expect a silly, fantastical gore fest, then I don't think you came in with the right idea. It was really great fun, loved Jenny Ortega's part most but honestly everyone was giving 110%. I put this right up there with Violent Night, Cabin in the Woods, Tucker and Dale Vs Evil, etc. It's a Dark Comedy with Fantasy elements, amazing deaths, and a great Eff the Rich mentality. As for the people who think the Unicorn Lore is silly or too mushy? Again... What did you come to this movie expecting? It rang true to the elements of Unicorn mythos while also making a fantastical and interesting narrative that was still funny and entertaining to watch. Ignore the \"neigh\"-sayers and just go in expecting to have a fun but bloody time. (Sorry, I couldn't help myself and honestly, it's on brand for this film!)"
  },
  {
    "rating": "0.5/5",
    "review": "not enough unicorn explanation."
  },
  {
    "rating": "5/5",
    "review": "I LOVED IT!!! GREAT FILM!!! The storyline, the cast, the cinematography, the setting, it was all great! There was comedy, action, and horror. I enjoyed the film very much and would definitely recommend it!"
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! A24 doesn’t disappoint!"
  },
  {
    "rating": "4.5/5",
    "review": "This movie was enjoyable. Funny, gory, surprising. I really enjoyed it. The cast was good, reminded me a little of Violent Night. Minus half a star for the janky CGI unicorns...could have been better."
  },
  {
    "rating": "3.5/5",
    "review": "Not sure if I really liked it that much. Really stupid. I mean I knew that walking into the movie obviously but wow it was stupid. Great cast though. The CGI was kinda corny. Definitely had its funny moments. I feel like 3 1/2 stars is fair. Extremely predictable. Worth the watch? I guess if you’re into that kind of stuff. My sister liked it more than I did. Although I will say it was nice to watch a comedy in theaters it seems like comedies are becoming more rare these days. This was just so stupid and maybe just missed the mark for me personally."
  },
  {
    "rating": "5/5",
    "review": "Death of a Unicorn is a must-see. All the actors/actresses are superb in this film. Jenna Ortega acting hits a homerun out of the park. The comedy is sprinkle in at the right moments that complements the horror. The unicorn CGI is awesome. The placement of the horror aspect with the unicorns are perfect."
  },
  {
    "rating": "4/5",
    "review": "This was a cool, funny and quick movie. It never got drawn out and I never got bored/ tired. I wouldn’t mind to see a sequel."
  },
  {
    "rating": "3.5/5",
    "review": "worth a watch but much of the Humor fell flat for me. would have liked to have had Paul Rudd have a better part-- he doesn't do this one well enough and it hurts the movie-- other characters are too fake. good idea just a so so movie in the end-- wasted a lot of star power."
  },
  {
    "rating": "1/5",
    "review": "Another lifeless attempt to pass off comedy with social commentary as \"Death of a Unicorn\" desperately limps it's way through trying to be satirical. It's short on any real amusement with Paul Rudd appearing to lazily impov his way through scenes like he wants it to get out. In the end, the killer Unicorn gimmick comes across like a drunken idea that the movie relied heavily on to save any value."
  },
  {
    "rating": "3.5/5",
    "review": "Very funny! Was a great watch but probably the only time I’m gonna watch it. But do recommend everyone to go watch it."
  },
  {
    "rating": "4/5",
    "review": "Lake Placid 2025 Instant cult classic. True to A24 Major plot holes and from zero to earth orbit in 5 seconds. But still very enjoyable. A little excessive on gore/dismemberment. Be warned."
  },
  {
    "rating": "3/5",
    "review": "A mixed production which stays too close to convention and is good, funny and scary but also kind of not. The plot has all the types of scenes you would expect from a monster movie and brings up some valid points, but they get overshadowed by the unlikeable characters, odd pacing and the CGI creatures. The creatures look good enough and they are used to good effect, but it shows too much of them too early and the ending didn’t feel right."
  },
  {
    "rating": "5/5",
    "review": "If you like your horror comedies to be over the top and cheesy as hell, this is the movie for you. Personally, I loved every minute of it, one of my favorite movies so far of 2025."
  },
  {
    "rating": "1.5/5",
    "review": "One of the WORST motion picture endings of all time. This film is not satisfying extremely unfunny and overall a terrible viewing experience. I honestly can even wrap my head around why they keep typecasting Jenna Ortega as these teen-agers who are scared and young when she's litterly 22!. The dialogue really lands on you like a terrible gas, Boy In The Striped Pyjamas Level."
  },
  {
    "rating": "3.5/5",
    "review": "Easy way to kill time"
  },
  {
    "rating": "3.5/5",
    "review": "It's a fun horror comedy."
  },
  {
    "rating": "3.5/5",
    "review": "It was good. I don’t think there was a twist. But a fun movie with lots of laughs. Some wild scenes at the beginning with the little unicorn. That poor guy. Fun movie, worth a watch."
  },
  {
    "rating": "5/5",
    "review": "I thought it was excellent! The acting was great, and I loved how the story, horror, and comedy were true to the premise."
  },
  {
    "rating": "1/5",
    "review": "Boring nonsense - never discovered the satire!"
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed this movie. It is unlike any movie I have seen before. If you can suspend disbelief and go along for the ride, it is a good one."
  },
  {
    "rating": "5/5",
    "review": "Doing this because imma simp for Jenna not even watched the movie yet but yeah bite me"
  },
  {
    "rating": "0.5/5",
    "review": "Who funds these films? Just an awful, boring mess of useless slop. Horrible CGI throughout, the entire budget went to Ortega and Rudd (who looks 70 years old in this film when the scenes are naturally lit). The climax offers a couple of chuckles and one singularly brutal scene, but other than that this film looks terrible, has so many continuity errors, and just stinks."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was pretty good for an A24 movie...these are normally weird AF but this one was satisfying. recommend for at least a watch"
  },
  {
    "rating": "2.5/5",
    "review": "The plot is a bit bizarre. The story of the father and daughter is endearing. Not my favorite movie but worth the ticket."
  },
  {
    "rating": "2.5/5",
    "review": "I feel like a genuinely fun and enjoyable creature feature was here at one point, but it was drowned in bleach until there was nothing left but sanitized Hollywood slop. 5/10"
  },
  {
    "rating": "2.5/5",
    "review": "you knew it would happen. some parts dragged but it was a monster slasher. the people. pure hearts 3"
  },
  {
    "rating": "2.5/5",
    "review": "Silly in parts, but it offers a pointed—if shallow—jab at wealth and privilege that doesn’t quite cut to the core."
  },
  {
    "rating": "5/5",
    "review": "Very solid horror comedy. Sharp quips, good characters, beautiful deaths and Paul Rudd doing Paul Rudd things. No real gripes. Just a very unique, entertaining popcorn flick. Worth a watch!"
  },
  {
    "rating": "3/5",
    "review": "Despite featuring a barrage of annoying characters trying and failing to be funny, the movie overall provides a fairly entertaining romp."
  },
  {
    "rating": "1.5/5",
    "review": "It's got Paul Rudd, but it's not funny. It's got vampire unicorns, but they aren't scary. What .... is this movie trying to be? Ginger 'oh hey it's that guy' and bald guy from Berry were great though. No notes for them."
  },
  {
    "rating": "5/5",
    "review": "Nothing beats a movie about freakin unicorns!!"
  },
  {
    "rating": "5/5",
    "review": "Excellent dark comedy! A little gore, a little jump scare, and a light message! we loved it, and I am looking forward to seeing it again!"
  },
  {
    "rating": "2.5/5",
    "review": "The acting was really bad and the CGI was not much better but it was a cool concept for a movie and pretty funny at times."
  },
  {
    "rating": "5/5",
    "review": "This movie is great but whenever they have Jenna Ortega she makes the movie more wonderful her acting in this is amazing. Definitely a good movie of laughter and itll have you watching it again."
  },
  {
    "rating": "4.5/5",
    "review": "It was a perfect amount of weird. We really liked it."
  },
  {
    "rating": "3/5",
    "review": "A good movie to put on in the background"
  },
  {
    "rating": "2.5/5",
    "review": "Some good humor, not really scary but might be a little disturbing to small children. Fresh idea but lagged in the middle. CGI was pretty bad."
  },
  {
    "rating": "5/5",
    "review": "It knows exactly what it is and I love it for that. Super fun, especially if you've got a dark sense of humor. It's campy and on the nose at times, but not everything needs to be 4D chess, and it's very aware that it's not 4D chess. Besides, there are some things that aren't necessarily spelled out for you that enhance the film when you give it more than a second of thought. Also, the animals look and move like animals, so that's always a plus in my book."
  },
  {
    "rating": "4/5",
    "review": "Kinda funny lots of gore though"
  },
  {
    "rating": "3.5/5",
    "review": "Harmless fun regarding mystical beasties in the Canadian high mountains. Great cast, lots of little laughs and a few good jump scares along the way. The story is engaging, but characters become a bit cardboard when the lines are divided. Great performances because the entire cast bought into the premise, especially Will Poulter and Anthony Carrigan. Loses an additional half star because the CGI unicorns are so clearly CGI."
  },
  {
    "rating": "2/5",
    "review": "is it fun? if you're able to completely shut your brain of!!! yes, sure, it passes the time. is it for children? no, it has blood, violence and adult themes... so why are we being treated like children? why is the acting childish, unbelievable, wooden and characters unrelatable? the problem here, the movie is trying to present itself as a social commentary...it's not. if that what they're actually trying to do, it's sad. that said...get a drink, forget about any messaging (and acting) and let a couple of hours of your life pass."
  },
  {
    "rating": "5/5",
    "review": "I thoroughly enjoyed this movie. It was campy, a little corny, but incredibly fun. The characters were all individual and played off each-other in fun ways. It was visually interesting and fun to watch. Is it the most inventive high cinema? Maybe not-- those green screen scenes made me laugh aloud. but it sure was a good time. If you liked Jurassic Park or Knives Out, I would would say give this a try! Similar energy at a lower budget."
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed it. Interesting take on the creature feature. CGI was really well done for such a small budget. Will Poulter was hilarious. Jenna Ortega was great. Good cast all around. I recommend it."
  },
  {
    "rating": "5/5",
    "review": "What a fantastic fantasy horror trip. It was hilarious with a good mix of scares, gore and goofiness. Great casting. The actors all nailed their parts and had good chemistry. I found it very enjoyable, left smiling."
  },
  {
    "rating": "3.5/5",
    "review": "Some very fun ideas and a great cast, but overall still a generic monster movie format. Fun watch."
  },
  {
    "rating": "4/5",
    "review": "Cool cast, fun original comedy / horror / gory"
  },
  {
    "rating": "5/5",
    "review": "I enjoyed it…the Unicorns got justice and father & daughter are closer than ever"
  },
  {
    "rating": "4/5",
    "review": "More funny than anything. Story was definitely interesting. I took my daughter and she loved it."
  },
  {
    "rating": "5/5",
    "review": "I loved it ! It had everything in it ! A real emotional Roller Coaster and the actor are Top Tier! Especially Jenna Ortega."
  },
  {
    "rating": "4.5/5",
    "review": "Loved it! Loved the idea that unicorns can be scary monsters."
  },
  {
    "rating": "5/5",
    "review": "It was pretty good Will Porter has funny eyebrows"
  },
  {
    "rating": "1/5",
    "review": "I went to this movie with low expectations and it was worse than I thought. It felt to me like a career killer movie and I’m shocked that they were able to get the moderately big names they did."
  },
  {
    "rating": "5/5",
    "review": "It was just overall a really fun movie. that kills were awesome acting was great and who doesn't love a unicorn? Don't go in expecting an Oscar winning movie go unexpecting a unicorn who kills people. part fantasy part horror part drama"
  },
  {
    "rating": "4/5",
    "review": "I mean FINALLY a movie about Unicorns. The little girl in me is satiated. Saw it... loved it. My daughter loved it. Though it's clearly no Lord of the Rings. The comparisons to Jurrassic Park are more on point."
  },
  {
    "rating": "3/5",
    "review": "Entertaining but the jokes felt forced."
  },
  {
    "rating": "1/5",
    "review": "stupid movie paul rudd plays a dork that is pretty dumb on everything he does but somehow has a law licence, the unicorns come from some distant galaxy, they can fight like bears its too stupid."
  },
  {
    "rating": "1/5",
    "review": "A unicorny delight! Its a sweet, poignant story of an estranged father and daughter, morning, the unexplained death of their mother wife. Full of magic and whimsy, this movie is sure to cloak you in a sense of wonder and dreamy comfort. April Fools! The unicorns looked like donkeys with ice augers drilling out of their skulls, so none of the gore will spoil true unicorn magic. I think there were supposed to be hijinc interspersed with moments of terror. One thing is certain It was a movie."
  },
  {
    "rating": "3/5",
    "review": "Wasn't terrible."
  },
  {
    "rating": "4.5/5",
    "review": "I loved every second of this movie! I am of course a fan of both horror and unicorns, so when you combine the two, I'm there! It's so far off the beaten path from your \"normal\" horror movie, I mean honestly, of course it is, its a horror movie with unicorns in it; but the concept, plot & unique deaths are more than my words can describe. Throw in a bit of humour and there is nothing not to love about this movie! I can't wait to own it so I can watch it again & again. Enjoy it for yourself <3 DO NOT listen to the critics on this one (or any movie really, just form your own opinion otherwise nobody would ever go to a show again, unless it puts you to sleep), just enjoy the show since clearly they don't know how to have a good time or lighten up."
  },
  {
    "rating": "4.5/5",
    "review": "It was actually a good movie."
  },
  {
    "rating": "4/5",
    "review": "Entertaining and heartwarming"
  },
  {
    "rating": "5/5",
    "review": "This was such a fun ride! Funny, scary, campy. Everything I love in a horror movie."
  },
  {
    "rating": "3/5",
    "review": "This was pretty fun.  Expectations for me were low but I think it was funny and enjoyable.  Not much weight to anything really, the commentary was obvious but kind of flacid, so it didnt hit home for me but still was an interesting way to present the conversation.  Id say it was a solid theater watching experience"
  },
  {
    "rating": "5/5",
    "review": "Funny, unique, refreshing to see something different. Hoping for a sequel."
  },
  {
    "rating": "3/5",
    "review": "NON-SPOILER RATING. It was okay, nothing special. Didn't exactly work for me, but you might have a different view of it. There was a great opportunity here to explore the fantasy and mythology of unicorns, but did a minimum of it because of the Horror/Comedy genre it was being positioned in. I thought Paul Rudd was miscast, with Michael Pena coming to mind as someone I would have liked to see in that role."
  },
  {
    "rating": "0.5/5",
    "review": "Bad CGI. Boring Script. Not very scary. Not very funny."
  },
  {
    "rating": "5/5",
    "review": "The movie was pretty good. I really entirely recommended."
  },
  {
    "rating": "4/5",
    "review": "Not bad. Some funny parts. Revenge is sweet"
  },
  {
    "rating": "2/5",
    "review": "Starts off a bit interesting with a car hitting the unicorn, but then over time it gets just plain bloring.. For an hour and 44 min. it felt like a 2 and a half hour flick.. I think they could have chopped off a good 20 min of conversation that was just boring.."
  },
  {
    "rating": "4/5",
    "review": "Much better than I expected although I should have known as it’s an A24 Film & they almost always kill it! Great cast, beautiful scenery and locations, fun dialogue & characters and shockingly gory & horroresque. The FX were also great. Made sense when I watched the credits and saw that Ari Aster Exec. Produced this film. (and of course it features one of his main trademark scenes…)"
  },
  {
    "rating": "5/5",
    "review": "I actually enjoyed this film and don't see how other people didn't enjoy this movie but to each their own The comedy was great an well put"
  },
  {
    "rating": "4/5",
    "review": "Honestly, this movie—and the reviews surrounding it—really highlight how out of touch modern film criticism has become. It feels like so many critics today are just bitter film school grads tossing around buzzwords they picked up in screenwriting 101. There’s a complete disconnect between what’s genuinely entertaining and what they think makes a “good” movie. This was a fun film. Pure camp. Tongue-in-cheek and totally self-aware, with genuine laugh-out-loud moments throughout. I saw it in a theater with maybe 30 people, and the room was constantly cracking up. It’s absurd, it’s silly, it knows exactly what it is—and it leans in hard. The performances were great across the board. Anthony Carrigan is a standout (as always), and Téa Leoni was a surprising comedic highlight. The whole cast had sharp, clever delivery that kept things moving and fresh. Sure, it’s not perfect. It stumbles a bit in the third act and probably runs 10 minutes too long (a problem plaguing way too many movies lately). But honestly? I didn’t care. I had a great time. And enjoyed it the entire time. You will too. Go see this. Support this kind of film. Give a big middle finger to critics who clearly don’t know how to evaluate comedy anymore—and definitely not how to champion movies that are actually fun."
  },
  {
    "rating": "2/5",
    "review": "Will Poulter steals the show"
  },
  {
    "rating": "0.5/5",
    "review": "Not very entertaining."
  },
  {
    "rating": "5/5",
    "review": "This was the laugh I really needed this week"
  },
  {
    "rating": "4/5",
    "review": "A fun and entertaining movie."
  },
  {
    "rating": "4/5",
    "review": "Holy shitttt. Pretty funny, pretty messed up. Can’t believe they made unicorns scary freaking dudes. Slicing and dicing. Pixie dust in blood. Magic drugs. Jurassic park velociraptor park style!!! Sometimes weird scenes kinda take u out but brilliant nonetheless."
  },
  {
    "rating": "4/5",
    "review": "It was entertaining for a horror comedy"
  },
  {
    "rating": "5/5",
    "review": "Absolutely insane and I loved every minute of it!!"
  },
  {
    "rating": "3.5/5",
    "review": "Good movie seeing unicorns kill people is different and I was rooting for the unicorns good cast worth watching not a great movie but entertaining"
  },
  {
    "rating": "4/5",
    "review": "Very fun movie! May seem a bit unhinged at times but overall this movie is very entertaining. The star studded cast does not disappoint, with Will Poulter being a great bright spot! Highly recommend!"
  },
  {
    "rating": "2/5",
    "review": "Watched cuz imma fan of Ortega but dude this storyline sucked so bad"
  },
  {
    "rating": "5/5",
    "review": "Brilliant! Lots of fun to watch! This is one of those movies where you can see how removed from normal the \"professional\" movie critics are. The ratings from the bulk of the \"top critics\" on RT is pretty bad but from normal people the movie is scoring pretty high and for good reason: it's a great movie to watch! This is another one of those films you really need to see in the theater because the scale of the screen and quality of the picture and sound is so vastly superior than any big screen tv, not to mention that the size of the actual picture has a far greater impact on the viewer precisely because it is so very large. It cannot be replicated at home. Having said that, Jenna Ortega is awesome as always and Paul Rudd does his Dad thing very well. Richard Grant does an outstanding job playing the narcissistic billionaire on his last legs and then suddenly reborn as a result of the unicorn and Tea Leoni plays the billionaire's socialite wife to perfection. All the other actors including the supporting staff comprised mainly of servants at the billionaire's remote \"lodge\" did an excellent job too. I see a number of sourpusses complaining about the CGI and I think that's nonsense. These are unicorns after all, so if you expect to be convinced that they are real I feel sorry for ya. I suppose the unicorns could have been rendered somehow more accurately but to obsess about that point it to miss the point. This is a real fairy tale come to life on the screen. People forget that most children's fables and fairy tales are intentionally scary and often do not end well and therein lies the lesson for the young hearts and minds to learn. That's what happens in this picture. It's a lighthearted horror flick that does it's job very well in a magnificent setting and with a magnificent set. The \"creatures\" are as believable as anything can or should be in a movie about unicorns and frankly, I thought they were done pretty damn well TBH. My one quibble would be with the sounds they make. They roar in the same way a T Rex would in the Jurassic Park movies. Since there's nothing to go on it works well enough but I would have thought one of the sound geniuses in Hollywood might have come up with some sort of ferocious whinnying or something more horse like. But that's unimportant. What counts is that the story, the script, the cinematography and the cast were all top notch and the movie itself is entertaining, a bit funny and has some horror too. If you go see it and you aren't being Debbie Downer you're going to like this movie regardless of the professional critics' take which is snobby and completely out of touch with the idea of just having a good time. Go see it and enjoy! When it does go to streaming which I hope is not for a while so more people will see it as it should be seen, it will be a huge hit. No question about that."
  },
  {
    "rating": "4/5",
    "review": "The critics (as usual) were way off on this one. It had the right blend of comedy and horror. I really enjoy movies like this that don't take themselves too seriously, and at the same time they deliver some great one-liners and make the horror movie more fun. Paul Rudd was not at his best, but Ortega delivers once again!"
  },
  {
    "rating": "4/5",
    "review": "A24 just doesn't miss. I may be considered a fan boy, but I think they just make genuinely unique, quirky, oddball type flicks that will grab anyone's attention. The comedy in this film hit in such an awkward way that it kind of made if even more funny. The acting was perfect, exactly what you wanted it to be. Plus we get murderous unicorns that manage to kill people in the most wonderfully gruesome ways. This film had something for everyone."
  },
  {
    "rating": "4/5",
    "review": "A really fun movie! If youre a fan of Dark Comedy Horror and a little fantasy thrown in there youll love this movie, Paul Rudd was adorable as always and Jenna Ortega was great, the entire cast was hilarious!"
  },
  {
    "rating": "3/5",
    "review": "It was a fun movie to watch, doesnt take itself too serious. The unicorn death scenes were great."
  },
  {
    "rating": "4/5",
    "review": "Original and fresh twist to the creature feature. Some slow parts but overall a fun, wild and bizarre ride!"
  },
  {
    "rating": "4/5",
    "review": "Gridy. Those unicorn were made so damn beautiful"
  },
  {
    "rating": "4/5",
    "review": "A fun horror-comedy about unicorns and business. And there are some funny scenes but it didn't stick the landing and the vfx of the unicorns are to heavy and not really realistic but there are several easter eggs."
  },
  {
    "rating": "2.5/5",
    "review": "Mildly entertaining. CGI was weak as well as the storyline. I’m kind of surprised these fairly famous actors chose this movie after reading the script. So many stolen elements from Jurassic Park made it mildly entertaining."
  },
  {
    "rating": "4.5/5",
    "review": "It was funny and scary"
  },
  {
    "rating": "5/5",
    "review": "The acting was amazing, the horror was phenomenal, and it was a great closed story that really went full tilt. Stunning visuals and soundtrack too!"
  },
  {
    "rating": "4.5/5",
    "review": "Very good, symbolic and fun. Acting was super duper"
  },
  {
    "rating": "4/5",
    "review": "Death of a Unicorn is a fun, comedic and innovative creature-feature that pairs two icons in Paul Rudd and Jenna Ortega. It balances \"campy\" with the right amount of gore and knows how to build the terror when it wants to."
  },
  {
    "rating": "5/5",
    "review": "A24's originality strikes again. My boyfriend and I watched Death of a Unicorn, a horror comedy with a hint of whimsy. 10/10, we enjoyed every minute. 🦄"
  },
  {
    "rating": "4/5",
    "review": "I walked into this movie just looking to enjoy something different and unique versus the garbage Hollywood's been dishing out lately. Growing up as a little girl loving unicorns, this was right up my alley and I love how they included the folklore"
  },
  {
    "rating": "3/5",
    "review": "A unique flick lacking in storytelling."
  },
  {
    "rating": "2/5",
    "review": "Unique in it’s story but not funny enough to be considered a comedy nor scary enough to be considered a horror."
  },
  {
    "rating": "2/5",
    "review": "Terrible cgi unicorn made it corny"
  },
  {
    "rating": "3.5/5",
    "review": "My only complaint is the special effects. The unicorns give off MODOK cgi, but the joke landed with me"
  },
  {
    "rating": "3.5/5",
    "review": "Laughably bad CGI couldn't ruin this interesting, original and surprisingly sweet tale. Jenna Ortega and Paul Rudd were great together, and I loved seeing Tea Leoni again. It held my attention throughout."
  },
  {
    "rating": "1.5/5",
    "review": "Went in with no expectations and left disappointed. Such a shame to see a wonderful script and acting performance so horribly bungled in post production. I will remember this director's name for all the wrong reasons."
  },
  {
    "rating": "4/5",
    "review": "It was a comedy horror movie. Some funny parts, some bloody and gorey parts. Some emotional parts. I liked it. However I probably wont see it again in theaters."
  },
  {
    "rating": "4.5/5",
    "review": "Was a really good fantasy movie. Enjoyed it. Paul Rudd and Jenna Ortega are really good in it, as was entire cast."
  },
  {
    "rating": "5/5",
    "review": "I like it all. The only sad things where they keep hurting the Unicorns."
  },
  {
    "rating": "2/5",
    "review": "Watched it over a week ago and already forgot it."
  },
  {
    "rating": "4/5",
    "review": "Loved seeing Paul Rudd and Jenna Ortega play father and daughter on screen. This was a unique premise of a story that worked very well. I love the aspect of the unicorns killing people with their horns."
  },
  {
    "rating": "5/5",
    "review": "liked it because it had good comedy and OMG what so many surprises."
  },
  {
    "rating": "1/5",
    "review": "With such A-list actors, the movie was poorly directed and acted, as the relationships were very unbelievable and boring. The creature effects were muppet-like and unpolished, and the storyline was disjointed and not believable. It was like they took inspiration from ‘Jurassic Patk’, ‘Knives Out’, ‘We Bought a Zoo’ and ‘Harry Potter’, while attempting to throw in some politics, Big Pharm and conservation views, and blend it all together into a disaster. So much potential wasted on a shlocky storyline and acting."
  },
  {
    "rating": "3.5/5",
    "review": "You know what you're gonna get when you sit down to watch it. Dumb fun about unicorns on a murderous rampage. Now as someone who appreciates the ancient lore about unicorns being carnivorous beings who deal out justice by slaying those deemed impure; beyond worth it. The corrupt pharm company is a nice touch, on the nose but blends well with the previously stated lore. All and all, fun!"
  },
  {
    "rating": "5/5",
    "review": "I was surprised by how good the movie was."
  },
  {
    "rating": "3/5",
    "review": "I liked the unique story line and idea's . The show was kind of in between a comedy and serious gore show. Not for children due to a few gruesome scenes. I say it was comedic because most people didn't seem overly shocked by the discoveries of the Unicorn and it's powers."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie !! It is a fantastic creature flick."
  },
  {
    "rating": "2.5/5",
    "review": "What would happen if you accidentally killed a unicorn and discovered it had magical healing powers? There’s a message here, but it doesn’t land as effectively as it should. The film tries to criticize big pharma and the financial interests of medical corporations, but that theme gets lost among a father/daughter story, horror elements, and various other distractions. The script ends up feeling pretty muddled. Why are these magical unicorns even alive? And why is Jenna Ortega involved? Why is unicorn meat being eaten? (There’s a lot to unpack.) And all of this unfolds over the span of just one weekend. Just one weekend, and so much happens in such a short time. Jenna Ortega and Will Poulter both gave strong performances. Poulter was particularly funny and had some memorable moments. Paul Rudd, on the other hand, was a bit typecast as the goofy dad and lawyer who can’t seem to get anything right—he was just okay. However, Téa Leoni really stood out. She did an amazing job, and it's been a while since we've seen her on screen. Her portrayal of the entitled yet \"caring\" rich philanthropist mom was spot on. I’ve met people like the characters in this family, and they all did an excellent job bringing them to life in this movie."
  },
  {
    "rating": "4/5",
    "review": "Kinda predictable story but definitely a fun movie. Rudd and Ortega make a great onscreen pair and Poulter steals every scene he’s in. Definitely worth watching in theaters!"
  },
  {
    "rating": "3.5/5",
    "review": "Death of A Unicorn is more than just a fantasy - its theme shows man's involvement with greed, and the so-called \"fountain of youth,\" while making us understand the true meaning of humanity's need for compassion and holding on to the hope of existence. Although a bit corny, and also stereotypical in characterizations, I did feel a warm glow (like the unicorn's horn) when I viewed this film. I had a hard day and this seemed to make me smile. Another era of an ET type of film, it is a smile.."
  },
  {
    "rating": "4/5",
    "review": "Wild and trippy as heck. If you want to enjoy going out of your mind in a fun way, I’d watch this."
  },
  {
    "rating": "2/5",
    "review": "Good acting by the whole cast, but the film is just not good. The story is all over the place and lacks a clear direction, is it a comedy horror or a semi serious comment on modern society and privilege. It’s probably worth a watch just for the great performances of Jenna Ortega and Paul Rudd."
  },
  {
    "rating": "3.5/5",
    "review": "I love the actors/actresses and I think the script for this movie was more natural and good writing. I liked the ending the most and how it met a deeper meaning but I do wish it started with that more so to feel at a deeper level for the daughter and father by the end. I thought it was done well tho and worth watching. ((: it was decently made. Not every movie has to be amazing and perfect y’all. I think people hating on this movie either just can’t do multiple genres or they just want to hate lol All movies are different."
  },
  {
    "rating": "4.5/5",
    "review": "This may not have been an oscar or an academy award contender, but it sure will get you through a nice chill outing. The cast was simply great and they did deliver their share. It has its cheesy predictable plot and dialogue but nonetheless it makes you want to see what will happen. For this fantasy film, just sit back, clear your mind and enjoy whats playing on screen."
  },
  {
    "rating": "4.5/5",
    "review": "Death of a Unicorn offers a fun, fresh, and almost nostalgic vibe, reminiscent of stumbling upon a cheesy creature feature on the Syfy Channel in the early 2000s. While the film has its fair share of flaws, the joyride it provides makes it easy to overlook them. Let’s start with the cast. None of the actors deliver performances that will have you scrambling for award nominations. By now, we know what to expect from a Jenna Ortega-led film, and here she fits that mold. Paul Rudd, who is always a delight, seems to have dialed it back a bit, offering a more subdued performance than usual. Still, the true standout moments come from Will Poulter and Anthony Carrigan, whose lines are some of the most quotable in the film. That said, while the acting isn’t remarkable, it’s not inherently bad either. The cast is likable enough to carry the film’s charm, even if they don’t fully elevate the material. The film’s biggest issue, however, is pacing. Despite a solid runtime of 1 hour and 44 minutes, Death of a Unicorn feels like a much longer experience. Yet, surprisingly, I never found myself bored. The slow pacing is counterbalanced by the movie’s quirks: the atrocious CGI unicorns, the occasionally underwhelming performances from capable actors, and the overall oddball tone. Ultimately, what really makes Death of a Unicorn one of my favorite movies of the year so far is its fantastic writing. The script brings a surprising depth to its world, making the flaws easy to forgive and turning what could’ve been a forgettable creature feature into something oddly endearing."
  },
  {
    "rating": "4.5/5",
    "review": "Death of a Unicorn offers a fun, fresh, and almost nostalgic vibe, reminiscent of stumbling upon a cheesy creature feature on the Syfy Channel in the early 2000s. While the film has its fair share of flaws, the joyride it provides makes it easy to overlook them. Let's start with the cast. None of the actors deliver performances that will have you scrambling for award nominations. By now, we know what to expect from a Jenna Ortega-led film, and here she fits that mold. Paul Rudd, who is always a delight, seems to have dialed it back a bit, offering a more subdued performance than usual. Still, the true standout moments come from Will Poulter and Anthony Carrigan, whose lines are some of the most quotable in the film. That said, while the acting isn't remarkable, it's not inherently bad either. The cast is likable enough to carry the film's charm, even if they don't fully elevate the material. The film's biggest issue, however, is pacing. Despite a solid runtime of 1 hour and 44 minutes, Death of a Unicorn feels like a much longer experience. Yet, surprisingly, I never found myself bored. The slow pacing is counterbalanced by the movie's quirks: the atrocious CGI unicorns, the occasionally underwhelming performances from capable actors, and the overall oddball tone. Ultimately, what really makes Death of a Unicorn one of my favorite movies of the year so far is its fantastic writing. The script brings a surprising depth to its world, making the flaws easy to forgive and turning what could've been a forgettable creature feature into something oddly endearing."
  },
  {
    "rating": "0.5/5",
    "review": "I had waited for weeks looking forward to seeing this movie and all I can say it was a horrible, horrible disappointment and a gross movie"
  },
  {
    "rating": "4.5/5",
    "review": "Fun little comedy/horror that takes the unicorn and gives it some medieval oomph"
  },
  {
    "rating": "4.5/5",
    "review": "It was gorier than I expected. In the trailer it was presented as a \"fantasy\" movie, which it is, but it's also a comedy and horror movie to an extent. Paul Rudd delivers his usual comedy while also being a good dad to Jenna Ortega's character. Overall I enjoyed it. I delivers a couple of jump scares because like I said, it has a little horror and suspense added to it. I liked it. It's presented in what appears to be vintage film quality, not the HD that I saw last weekend in Snow White, but it's good."
  },
  {
    "rating": "4/5",
    "review": "Very different and “original” story line. Go see it!"
  },
  {
    "rating": "4/5",
    "review": "There’s this thing that happens when you’re a teacher, or a mentor, or just someone who really gives a care about potential. You watch someone you know is brilliant deliver something that’s good—really good, even—but not their best. And you’re left in this liminal place, where admiration knots with disappointment. That’s where Death of a Unicorn left me. This is A24’s latest offering, and like most of their catalog, it begins with promise. No, not promise—magic. The opening hits hard: the pacing is kinetic, conversations feel sharp and alive, and the stakes don’t rise so much as escalate in this orchestrated dance of absurdism and sincerity. It’s like someone spliced the DNA of Swiss Army Man with a dash of Paddington gone pagan, and somehow it worked. But then. The spell weakens. Somewhere past the midpoint, it begins to cave in on itself. What once felt daringly surreal turns familiar. The absurd loses its teeth, and suddenly you see the strings—the mechanics of plot, the too-obvious MacGuffin (the unicorn horn, of course), wrapped in mystery just long enough for you to think, Please don’t do the thing I think you’re gonna do. And then they do. Exactly that. The switcheroo. The inevitable handoff. A trope dressed in glitter and hoofprints. What frustrates me the most isn’t the failure—it’s the unrealized potential. There are ideas here—rich, weird, textured ideas—that never get their due. Like the character who huffs unicorn powder and his eyes glow like he's unlocked some arcane cheat code. That could’ve been something! Give me some body horror, give me unicorn-mutation, give me healing-factor-Wolverine-type vibes. Let him sprout a horn. But no—it’s teased, and then it just... isn’t. And that’s the pattern. Even the climax flirts with something strange and possibly cosmic. Spoiler: there's this shimmering, sci-fi dark matter moment—a ripple in reality that hints at consequences or transcendence. But it stays exactly that: a ripple. Not a wave. Not a flood. Not even a splash. It’s like watching someone stroke the surface of something unknowable... and then walk away. No payoff. No consequence. Just cinematic almost-there. You almost climax, but not quite. It’s this weird tension: it both overreaches and underdelivers. Instead of doubling down on its chaos, it backs into a corner and plays safe. And once that happens, the absurd doesn’t feel absurd anymore—it feels calculated. Tame. Which brings me to the ending. Let’s be honest: it’s Disney. Not classic Disney, but like, post-modern, irony-poisoned Disney. The unicorn family is reunited. Cue the swelling music. Cue the sentimental glaze. It’s “gore princess” energy, or better yet, “Disney horse girl but make it necro.” And honestly? If they were gonna lean that way, they should’ve galloped into it. Go full silhouette-against-the-sunset. Paul Rudd riding a unicorn with his daughter, straight-faced, into a glowing pink horizon. So dumb it loops back to genius. That ending would’ve committed. It would’ve earned the cliche by owning it. Instead, what we got felt... safe. Bland. Like they built an entire twisted mythos and then abandoned it at the altar of digestibility. And that’s why, despite how much I enjoyed the ride—and I did—I can’t help but feel that twinge of disappointment. This is a transitional movie. If there was a Unicorn film for a past generation, this is the one for the weird, ironic, late-millennial and Gen Z cohort. It’s for the horse girls who became sad women, for the kids who loved Lisa Frank and grew up into therapists and cynics. My niece is ten. She’d adore this film. And I mean that sincerely. This would be her Unicorn movie—the one she rewatches, quotes, turns into a sticker on her water bottle. And maybe one day, she’ll see it again as an adult and laugh at how it made her feel, while still kind of feeling it. So I land here: This movie earns a 90/100—not because it’s perfect, but because it had the capacity to be. And sometimes you give that grade not as a reward, but as a challenge. It’s still an A. But it’s not the A. And that's the paradox: I liked it. I really liked it. But it could’ve been mythic."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed it more than I thought I would. I knew from the preview that it would be part comedy and part horror and it delivered. I was wondering what would come out of the film and it was a twisted tail that had all a little bit of everything from and incredible cast. I would recommend it to anyone."
  },
  {
    "rating": "4/5",
    "review": "I went in with low expectations and the movie cracked me up. It’s not to be taken seriously."
  },
  {
    "rating": "3.5/5",
    "review": "Well acted for the content that was there, felt like there was some sections that were probably cut out of it probably because it runs a little longer than expected, but outside of that, the comedy is dark and funny, but gets brought back down to earth when you realize that they killed a freaking unicorn.😵‍💫"
  },
  {
    "rating": "4/5",
    "review": "This movie is just a great time. It’s not trying to be anything groundbreaking, but it doesn’t need to be—it’s fun and genuinely entertaining. The humor works, the action keeps things moving, and it doesn’t drag. With a higher budget, it could’ve been better, but as it stands, it’s still an easy watch that delivers plenty of enjoyment."
  },
  {
    "rating": "5/5",
    "review": "It was great! please support A24 films. 🙏 It was basically Jurassic park but with wild unicorns instead of genetically engineered dinosaurs. If you liked Nosferatu or vampires in general but wanted 100% fewer creepy sex stuff then 10/10 go watch this! it's just unicorn lore instead of vampire lore. It's great, it's fantasy, it's eldritch, it's survival, it's dark comedy gore."
  },
  {
    "rating": "2.5/5",
    "review": "Very cheesy predictable movie."
  },
  {
    "rating": "5/5",
    "review": "I love that it’s something new and I think the whole story was great"
  },
  {
    "rating": "1.5/5",
    "review": "This movie lacked luster, and the storyline wasn't strong. The movie started well, but the middle of the end was boring. Definitely, a little gore helped, but I needed a stronger plot"
  },
  {
    "rating": "5/5",
    "review": "I ended up liking this movie it was funny and the actors as well"
  },
  {
    "rating": "3.5/5",
    "review": "Definitely original and funny."
  },
  {
    "rating": "3.5/5",
    "review": "Death of a Unicorn fully embraces its bizarre premise with a wild, surreal, and at times comical detour from traditional cinema fare that’s never boring and heightened by its cast and bombastic absurdity!"
  },
  {
    "rating": "3.5/5",
    "review": "Was it convoluted? Yes. Was it a wee bit ridiculous? Yes. Was it messy? Yes. Was it funny? Yes. Was it a wee bit heart stirring? Yes. Was it a fun horror? Yes. I found myself, several times, thinking, \"What are you doing?\" \"Come on!\" and \"You've got to be kidding me!\" And barely keeping it under my breath. Yes, we know (if you have some historical and scientific knowledge) that what was historically called a \"unicorn\" is what we call a rhinoceros, but I can go with the fantasy factor of this movie. They do miss the mark in the concept of pressing toward heaven, almost failing to have a gospel reference to anything in the film, but not appropriating it correctly anyway. Nevertheless, some visuals are absolutely beautiful, the scenery was breathtaking, the effects were mostly good, even if many were spoiled by the trailers. Overall, though, it was a decent movie. If predictable, it was still satisfying. Oh, yes, it is far better than the Snow White movie. Definitely see it. Might even be less terrifying in some respects."
  },
  {
    "rating": "4/5",
    "review": "The bond that Ridley and Elliot Kiltner would eventually share throughout the film was deeply moving."
  },
  {
    "rating": "4.5/5",
    "review": "It was good but not great. Needed more character development and maybe a little more to the story."
  },
  {
    "rating": "2/5",
    "review": "Great chemistry between Ortega and Rudd save this otherwise comically twisted cast of characters who are picked off one by one by the sensitive and powerful equines."
  },
  {
    "rating": "3.5/5",
    "review": "The acting overall was solid but Will Poulter's character was definitely the best. The story was mostly formulaic but still engaging with a good amount of dark humor that actually hit the mark. The special effects were good. There was a surprising amount of graphic gore but it didn't feel out of place."
  },
  {
    "rating": "0.5/5",
    "review": "Can’t believe I’m saying this, but I would rather watch opus than this sad, talentless disaster of a movie. There is not even a single character in this movie. I thought I was excited for Tia Leone since it’s been about 10 years, but she can just go back to whatever she was doing. Jesus, is A24 always been this insufferable? Like did you guys know that rich people can suck? <—-entire message of movie. One day I will be so drunk coming home and putting on streaming that I will see this and actively throw something at my TV and break it, and that will still be better than actually watching this again. I would pay triple the money to unsee this in fact. If this is this guy‘s first movie, he should just end his career now. Truly a pathetic mess of a movie."
  },
  {
    "rating": "4/5",
    "review": "Let your imagination go and have some fun with Death of a Unicorn. Great cast, well paced and imaginative."
  },
  {
    "rating": "2/5",
    "review": "Chicken Little dad has competition for worst dad in movies"
  },
  {
    "rating": "4.5/5",
    "review": "Moments of comedy interspersed with drama made this a mostly riveting, new, and unique movie that hasn't been seen before. In other words it was nice to see something that wasn't a reboot. It has some slow spots but the dramatic scenes make up for them. It is a bit campy and we found ourselves cheering and laughing when dislikeable character met their karma. We did not care for parts of the ending which felt like a cliffhanger and while we are totally willing to accept this is a fantasy about mythical creatures and there are bound to be things unexplained, I disliked the end scene with the big ball of energy and that is all I can say without giving anything else away."
  },
  {
    "rating": "4/5",
    "review": "If you didn’t enjoy this, you’re allergic to fun. Gory, over the top, campy fun while still having a heart. Jenna Ortega is perfectly on the mark, and Tea Leoni was wonderfully fake and funny. I laughed out loud so many times!"
  },
  {
    "rating": "4.5/5",
    "review": "Really fun, hilarious story"
  },
  {
    "rating": "5/5",
    "review": "Thought at first it would be cheesy, but I am a huge fan of A24 movies, I loved it so much. Hilarious, lots of gore and best of all yet...UNICORNS! Loved the whole thing especially the ending. Can't wait to buy it!"
  },
  {
    "rating": "5/5",
    "review": "It was a really good movie! I love that the unicorns changed color based on how they were feeling!"
  },
  {
    "rating": "3/5",
    "review": "Not a masterpiece, but solidly entertaining."
  },
  {
    "rating": "4/5",
    "review": "I gave it a solid 8.25/10. Love the concept. Had some really funny moments aswell. Pretty impressed with what they made this movie into. I'd definitely watch it again !"
  },
  {
    "rating": "4.5/5",
    "review": "What started off with some kind of awkward pacing and stammered banter quickly develops into a movie that begins carrying itself and building a constant momentum until the last scene. Never thought they'd write a character where I actually disliked Rudd for most of the movie but his redemption and motive eventually showed up. Ortega was great, the themes of modern capitalist oligarchs and pharmaceutical industry were very poignant and on the nose while still being mildly tongue in cheek if you weren't paying close attention. The sfx, the acting and the plot were all something that made this really come together nicely for me."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie, funny , suspenseful and full of action 🎬 👍👍"
  },
  {
    "rating": "5/5",
    "review": "Loved it! Great actors!"
  },
  {
    "rating": "2/5",
    "review": "A mythical letdown."
  },
  {
    "rating": "4/5",
    "review": "Pure entertainment, comical yet vicious...do yourself a favor and check it out."
  },
  {
    "rating": "4/5",
    "review": "A bit silly, but definitely entertaining, funny, gory and even a bit scary. Amazing cast. Fun movie to watch."
  },
  {
    "rating": "3.5/5",
    "review": "Less than I hoped for more than it might have been. The trailer did not betray in any way. Typical , yeah I enjoyed it as it had an off beat note but nothing new. The son of the rich folks was perfectly cast as well as the daughter of the sanctimonious college kid. Script was decent but better editing would have tightened it up. Was it worth seeing this weekend? Yep! Beat the hell out of family snow white which obviously was written and filmed a while ago during D's let us show the world how we \"should\" be lecture period."
  },
  {
    "rating": "4/5",
    "review": "Excellent story line and special effects. The antagonists are despicable characters."
  },
  {
    "rating": "4/5",
    "review": "Great horror comedy! Jenna Ortega is wonderful, and even though this story might seen familiar, the Unicorns make it all worth it!"
  },
  {
    "rating": "5/5",
    "review": "What a fantastic movie! Jenna Ortega and Paul Rudd, along with the rest of the cast, really bring to life what it looks like to take innocence and deep connection for granted. In our society that is consumed by greed, where do we draw the line? This movie does a wonderful job addressing that question in a framework of the fantastic and beautiful fierceness of unicorns and people."
  },
  {
    "rating": "4/5",
    "review": "This move had a great storyline, actors, and I thought it was great! It was more gory than I thought it would be. Love Jenna Ortega and Paul Rudd together!!! (This movie also made me look at The Last Unicorn 1982 in a new light)."
  },
  {
    "rating": "4/5",
    "review": "Hilariously absurd and ridiculous. Its about running over a freaking unicorn! Everyone did a good job with the material, played their characters well, and it was a good escape from the mundane."
  },
  {
    "rating": "5/5",
    "review": "Great plot. Some of the characters that made you mad, but I loved it kept me entertained the entire movie."
  },
  {
    "rating": "3.5/5",
    "review": "Fun, good twist on the Unicorn genre, doesn't take itself too seriously"
  },
  {
    "rating": "4/5",
    "review": "Jenna Ortega and Griff :):):):)"
  },
  {
    "rating": "5/5",
    "review": "Thought it might be awkward but it was good actually. Loved the thriller, suspense and action scenes. Definitely worth watching!"
  },
  {
    "rating": "5/5",
    "review": "loved the cast. amazing movie."
  },
  {
    "rating": "4.5/5",
    "review": "Cast has everything to do with the movie. You get the right people to perform the movie because a real deal. Great movie story line is far out there but really great movie."
  },
  {
    "rating": "5/5",
    "review": "Campy fun and a great escape that helps to connect reality (corporate greed) and fantasy (unicorns) …cast is terrific."
  },
  {
    "rating": "3.5/5",
    "review": "It dragged a little bit in the beginning and it was extremely graphic and gorey. Overall a decent storyline though."
  },
  {
    "rating": "0.5/5",
    "review": "Sooo bad. Fake stupid and predictable."
  },
  {
    "rating": "3.5/5",
    "review": "This is a pretty fun time. Solid acting and story. Some of the cinematography is gorgeous. CGI is low budget but was expected. Fun kills, fun aliens motion tracker sound Easter egg. worth a matinee"
  },
  {
    "rating": "5/5",
    "review": "Great acting, very suspenseful. Was in the edge of my seat the entire time!"
  },
  {
    "rating": "3.5/5",
    "review": "Didn't expect it to be so gory but I liked it, some of the comedy fell flat but overall not bad."
  },
  {
    "rating": "3.5/5",
    "review": "incredibly suspenseful and relieving. Thank you."
  },
  {
    "rating": "5/5",
    "review": "One of the best contemporary fantasy films ever made. Very timely comentary on pharmaceutical companies. The acting was incredible and the suspense can only be compared with seeing Jurassic Park 1 for the first time. One of the most entertaining movies in a long time."
  },
  {
    "rating": "5/5",
    "review": "Loved it. Funny with some action and interesting take on fantasy elements. Surprisingly gore filled which I liked lol. My favorite movie so far this year."
  },
  {
    "rating": "5/5",
    "review": "(TLDR at bottom) I am huge on horror movies, especially comedy horrors. I have been incredibly ill all weekend, I felt like death, but I went into that theatre (after showering, sanitizing, and taking medicine, along with social distancing of course) and the whole time, I was still in pain. But it was worth it. WAY WORTH IT. I am very critical of the movies I watch, I hate it when they throw together movies and advertise it with rich actors who easily get cash from movie-go-ers, but it was incredible. All of them tied the movie together perfectly and fit into there roles. The scares were good, it had the nice horror anxiety, and all of it was eased by perfectly timed humour. We need more movies like this one. Absolutely spectacular. (TLDR: IT'S AMAZING, I WENT THROUGH HELL TO SEE THIS MOVIE AND IT WAS WORTH IT!!!!)"
  },
  {
    "rating": "4/5",
    "review": "It was a fun horror comedy, and I was entertained throughout. Don't go in with expectations of this being some Oscar winning screenplay, just enjoy the quirkiness. I just wish they had a bigger budget for CGI, or went with more practical effects instead"
  },
  {
    "rating": "5/5",
    "review": "Paul Rudd and Jenna Ortega deliver a riveting performance as father and daughter in a compelling tale of loyalty that dynamically transcends humanity. The visuals are captivating and the innovative writing transports us into a world where unicorns exist and seamlessly integrate into modern day society. It was incredibly entertaining to see the juxtaposition of unicorn and family bonds and provided some good chuckles and a solid storyline that flowed and left me hoping for a sequel."
  },
  {
    "rating": "4.5/5",
    "review": "Although it was slow in the beginning it was really good. It was funny and gory not scary though (but thats just my opinion). And if I had to explain the movie in the least amount of words possible id say \"its like you just put Jurassic Park and Alien and changed a few things\" but over all its a good even 9/10."
  },
  {
    "rating": "5/5",
    "review": "story was really good. I was emotionally invested in the story, and it was captivating. I recommend this movie big time. Both main characters portrayed to the tee...."
  },
  {
    "rating": "5/5",
    "review": "complete shocker and edge of your seat movie"
  },
  {
    "rating": "4/5",
    "review": "Not quite what I expected. It was BETTER! Very funny. Not an Oscar movie but definitely entertaining. It is even funnier the second time. Well done. See it. You won’t be disappointed"
  },
  {
    "rating": "5/5",
    "review": "Made me jump out of my seat a few times"
  },
  {
    "rating": "2/5",
    "review": "I expected SO much more from this film than was delivered (in my opinion) by this quality cast. The two top-billed are also executive producers. I've not read the book on which this movie is based so i don't know how true it stayed to that story line, but that was some extremely odd dialogue in a screen play what drifted quite a bit throughout. When you start pulling for more people to die you know that this is not the best choice of entertainment on a given day. I do not recommend this one to others."
  },
  {
    "rating": "4/5",
    "review": "Loved the lore behind the story, it gave Jurrasic Park meets fantasy vibes."
  },
  {
    "rating": "5/5",
    "review": "No idea why this movie is getting so much hate it’s Funny, Heartwarming, Scary all in together. Death Of A Unicorn is a fantastic A24 film that’s just getting hate for no reason the cast is amazing the CGI is a lil there and there but it was still a fantastic joyride I do agree It is Jurassic Park on acid."
  },
  {
    "rating": "2/5",
    "review": "Paul Rudd, Jenna Ortega, Tea Leoni, and Will Poulter Based on the book by Peter Dickinson When we think of unicorns we think majestic, kind, and all around pleasant This puts a whole new spin on the ultimate fantasy of us ignoring our mortality Ortega and Rudd play daughter and father, Ridley and Elliot The mother is deceased and the only hope they have is a new business venture with Leopold that will set them for life Leopold Labs is headed by Mr. Leopold himself since he’s facing an incurable disease Ridley and her dad accidentally run over a mythical creature…a unicorn of all things Arriving at the Leopold estate all of them are shocked to discover it; so they take it in for study and find out it has healing properties It’s blood can cure any ailment even cancer itself At first it’s a scientific/medical breakthrough but Ridley does her own research to find out that unicorns are not all they’re cracked up to be in ancient mythology as well as history It’s not just their lore the movie explores but also their emotional valence They’re actually more savage in nature and will make humanity pay the ultimate price abusing their biological properties Ridley also shares a connection with the deceased unicorn and the parents of this creature go on a killing rampage The movie is just alright, it should’ve been better though There are comments on upper class consciousness, socialism, capitalism, choosing immortality regardless of consequences, not sharing breakthroughs with the rest of the world, choosing monetary rewards over the bigger picture, symbolism for corruption, addiction, science deniers, looking at grief and loss, the pharmaceutical industry, and using mythical creatures as metaphors to deal with our transgressions Ok so maybe the satire is a bit heavy handed, most of the characters aren’t likable to completely sell it, the pacing is a big mawkish, it also feels like the filmmakers play things way too safe with a premise this crazy, and I wanted more outrageous ness when it came to the grisly kills I also didn’t laugh as much as I wanted too as I only got some minor chuckles Plus some of the effects needed some more time to look seamless A better screenplay would’ve helped make this standout but as disposable entertainment by A24 Studios there’s far worse"
  },
  {
    "rating": "3.5/5",
    "review": "Rudd and Ortega were great and Will Poulter was phenomenal. The movie just didn't come together for me. CGI was still better than Snow White."
  }
]