{
  "movie_name": "Heretic",
  "reviews": [
    {
      "rating": "3.5/5",
      "review": "It keeps you on edge for a movie that is shot in one location the entire time. It does get a little corny towards the end when the girl is able to come alive for a split second...a spin on belief. I wish the final seconds leading up to the end of the movie were a little different. It's worth a watch. The overall point of the movie was conveyed well."
    },
    {
      "rating": "5/5",
      "review": "Hugh Grant is brilliant in this role! I enjoyed how it was shot all in one location all while keeping the audience engaged!"
    },
    {
      "rating": "2.5/5",
      "review": "well acted movie especially Hugh Grand did a great job. I'm non-religious so couldn't get the core."
    },
    {
      "rating": "5/5",
      "review": "Really good movie gives a lot of points of view."
    },
    {
      "rating": "5/5",
      "review": "Very good scary movie!"
    },
    {
      "rating": "3/5",
      "review": "Not bad - it does hold you on edge for the most part, it does start great and it is quite believable in first half. I can recommend to watch it once Unfortunately not great either - whole premise of young missionaries taken by an old \"heretic\" gets thrown out in second half. Film doesnt go any further than just \"look, religions copy each other\" and quickly turns into just a regular horror within a maniac house. I cant recommend it to anyone who expects a discussion about meaning of life and religion. \"It just makes us feel good\" - happy end"
    },
    {
      "rating": "4/5",
      "review": "Heretic definitely has its many flaws, but that never stopped me from enjoying it. I really liked this film, a lot more than I thought I would. Hugh Grant does a very good job playing this role that much of the film's quality depends on, and the two girls also did very nice jobs (especially Thatcher.) It's nicely shot to build suspense in the way this type of movie should, and the plot points are very well written. And though I did like how the monologues were shot, I didn't actually like many of the intellectual discussions. Because none of those clever points he made were actually that clever, it was mostly just common knowledge, I could've probably written this film. But other than that, this is a really well-made, thrilling, and very enjoyable horror film that succeeds at being a very entertaining and well-made watch."
    },
    {
      "rating": "3/5",
      "review": "This movie just didn't succeed in frightening me as much as it should have. I found it somewhat predictable from the moment the girls walked into the creepy house, maybe because Hugh Grant was trying too hard to be diabolical and genially malevolent. The concept was certainly scary enough, but I found myself watching with amused interest rather than gripping the edge of my seat."
    },
    {
      "rating": "2.5/5",
      "review": "I was really expecting a lot out of this, but it was a lot of wind up for not much payoff. Everyone did great in their roles, it was just constantly looking for a purpose/climax that never came. If it was anyone but Hugh Grant in the lead role, it very likely would have bombed."
    },
    {
      "rating": "1/5",
      "review": "I was genuinely excited to watch The Heretic. The buzz was strong—multiple glowing reviews praised Hugh Grant’s performance, and as a fan of the horror genre, I was intrigued. With a star like Grant, I expected solid production values and none of the hallmarks of cheap horror: no jarring soundtrack, no wooden acting, no incoherent plot. Even the title was promising. The Heretic—was it going to be about demons? Witches? I went in expecting originality, strong characterisation, and a good time. Instead, what I got felt like a bad Tinder date—with a guy who’d just binged a religion podcast and couldn’t wait to share every half-baked thought it inspired. As for plot twists, scares, or any shred of originality—forget it. You’ll guess the ending within the first five minutes, and the film never strays from that prediction. It’s also frustratingly self-important. Don’t waste your time."
    },
    {
      "rating": "3.5/5",
      "review": "Hugh and Sophie are great. Very unsettling especially in the first half. The behavior of a character at the second half is not consistent with the rest of the movie. Basically, I wish the second half of the movie was rewritten. I still appreciate this film for it's uniqueness and for being genuinely disturbing."
    },
    {
      "rating": "5/5",
      "review": "A philosophical-theological MASTERPIECE, wrapped in a violent thriller/horror genre film. But hey what religion on Earth isn't horrificially violent?"
    },
    {
      "rating": "2/5",
      "review": "While watching this movie, I was excited about what was going to happen next, but it didn’t live up to my expectations. The answer Mr. Reed suggests in the last scene is that everyone already knew, and there was nothing new. The movie raises questions about a real religion with sharp words, and it's no exaggeration to say that it seems to deny overall religions and faith. I think people in other countries might be more sensitive about religions. I’m wondering if the movie might cause any issues. However, for me, what Mr. Reed suggests is to the point. I don’t understand how controversial and taboo the movie is, or if the subject it explores is deep or just shallow, because I don’t have enough knowledge and experience about religions and foreign cultures. The movie has been advertised in my country as being like the “Saw” series. Pitiful couples."
    },
    {
      "rating": "4/5",
      "review": "A refreshingly good movie with great writing and depth. It will leave you questioning the nature of reality, if you choose to do so"
    },
    {
      "rating": "2/5",
      "review": "A great start but the film becomes far to finicky and ridiculously over complicated by the end. Great performance by Hugh Grant - definitely worth a watch, just a shame about the third act."
    },
    {
      "rating": "5/5",
      "review": "Love anything with Hugh Grant. Nice and creepy! Thought provoking regarding organized religion. Always remember, we don't need churches to have a relationship with God. A must see!"
    },
    {
      "rating": "3.5/5",
      "review": "I thought Hugh Grant was fabulous. Very creepy. Felt the ending came up short a little but I will watch again at some point."
    },
    {
      "rating": "3/5",
      "review": "The movie starts of with a steady climb towards uncovering a mystery with a very strong performance by Hugh Grant, delves into theological debates and history keeping you hooked especially if you are a nerd for such subjects but the movie disappointingly takes a quick U-turn into classic slasher survival film turning your interest down."
    },
    {
      "rating": "4/5",
      "review": "Fell apart a bit at the end, but still loved it."
    },
    {
      "rating": "3.5/5",
      "review": "Good writing a great cat and mouse religious theories to wrap around your head"
    },
    {
      "rating": "5/5",
      "review": "I might be a bit biased since i just watched the movie but it catched me from the first second and i think religion is a very interesting theme even though im atheist overall i think its one of the greatest movies ive ever watched definitly a must watch"
    },
    {
      "rating": "0.5/5",
      "review": "Boring movie that should never exist, it was painful to sit through, not scary , super predictable, half of the story is complete nonsense. Anyone who praises this movie is out of their mind. Pass"
    },
    {
      "rating": "2.5/5",
      "review": "Nice setup, wonderful suspense and worth it alone for Grant’s creepy performance, but ultimately it didn’t stick the landing at the end. I’d still recommend it, as it’s well made and ultimately pretty entertaining."
    },
    {
      "rating": "4/5",
      "review": "Fantastic Claustrophobic movie with religious belief at its core."
    },
    {
      "rating": "4.5/5",
      "review": "Great acting. Cool story. Specially how Hugh Grant character pokes holes on Christianity. Hugh Grant as a baddie it’s pretty cool and he totally nails it 🍿🍿🍿🍿🍿/5 on Max"
    },
    {
      "rating": "3.5/5",
      "review": "A great setup that sucks you in. The story gets overly weird, which wasn't really necessary. The problem is how it ends. I don't like it when movies just fade to black, presumably to manipulate audience members into online discussions and debates about what they think happened next. I don't play that game. If I'm going to spend the time to sit through your movie, at least provide a conclusion to your story. The scariest part for me is that I had no idea Topher Grace was in this movie until I saw the credits!"
    },
    {
      "rating": "4.5/5",
      "review": "Actors were excellent. Hugh Grant definitely showed his acting ability. The female actors absolutely nailed the submissive and trusting part - reminded me of growing up as a missionary kid - giving into beliefs that forsake, yet save, in the end."
    },
    {
      "rating": "1.5/5",
      "review": "Pseudo -intellectual and fake."
    },
    {
      "rating": "2.5/5",
      "review": "I honestly expected it to be better. It was intriguing enough to watch all the way through but was rather bland and somewhat stereotypical. I wouldn't say it was terrible, it just never felt like it had that WOW factor."
    },
    {
      "rating": "1/5",
      "review": "How in the hell did this film get such good reviews? It was boring, long, and nonsense. Some people may like the looonnngggg drawn out religious thoughts, but imo skip this garbage."
    },
    {
      "rating": "5/5",
      "review": "so suspenseful. Hugh Grant is amazing and i think anything Sophie Thatcher touches turns to gold"
    },
    {
      "rating": "1/5",
      "review": "First: why is the label “COMEDY” not attached to what eventually turns into hopeless drivel? I always hated the Hugh Grant rom-coms I was dragged to when dating many years ago, so it was a pleasant surprise to actually see him in a role in which he is designed to be hated, and he does a wonderful job of it. As many people have observed we get off to a good start, with Grant posing intellectual challenges to two raw CLDS missionary recruits. I especially enjoyed the presentations of the world’s largest religions as parallels to the history of a famous board game. (Confession: I am an atheist.) Too good to be true: it suddenly veers away from originality to cliché after cliché after cliché, each one more predictable and each leaving another hole in what passes for a plot. I can’t imagine for what audience this was made: the first half is way too talky and nicely smarmy for horror/gore fans; the second half quickly alienates anyone who enjoys films which linger in their minds. (Confession: I saw \"The Brutalist\" four times in the cinema.)"
    },
    {
      "rating": "3.5/5",
      "review": "I think the way the concept of control was conveyed in the movie was awesome. I thought it was a cool mind game aswell with the main guy going a great job. I think the story line lacked and it was slow in some areas. Decent otherwise."
    },
    {
      "rating": "4/5",
      "review": "Oddly enough, Heretic will require patience and concentration on your part, and if you give it that, your experience will become even more fascinating and surprisingly lovable."
    },
    {
      "rating": "5/5",
      "review": "Que buena película!"
    },
    {
      "rating": "5/5",
      "review": "This is an absolute recommendation to see if somewhat curious about religion. No disappointment here."
    },
    {
      "rating": "0.5/5",
      "review": "Main female lead was unbearable to watch move at a snail's pace. I do not recommend watching this movie unless you want to raise you're blood pressure. Especially that scene where should could have just ended the guy while her friend was distracting. Also the butterfly at the end don't make no sense. Also, how did the other female lead get her arm cut up with no blood coming out and survive her injuries for like 30 minutes? Is this all a dumbahh hallucination? Definitely do not recommend to watch."
    },
    {
      "rating": "3.5/5",
      "review": "The movie is incredibly well made—the pacing, the music, the overall flow—it all comes together beautifully. From the perspective of someone who served a mission, it feels remarkably accurate. The anxiety portrayed on screen is tangible; you can truly feel what the characters are experiencing. The religious arguments are thoughtfully crafted—enough to shake the confidence of a casual believer. The film challenges the idea of a transactional God, where prayers are expected to be answered a certain way and miracles are granted on demand. However, it falls short in portraying a deeper truth: that pure faith transcends those simplistic expectations. A testimony born of the Spirit cannot be fully grasped or unraveled through logic alone. It isn’t just a human feeling—it is divine. Incomprehensible to anyone trying to understand it by any means other than faith. Because of that, it cannot be reduced to an intellectual exercise or a philosophical argument"
    },
    {
      "rating": "5/5",
      "review": "Herege é um terror que vai além dos sustos baratos e aposta no suspense psicológico. Com ideias intrigantes e uma tensão constante, o filme consegue te manter desconfortável sem apelar para clichês. Os sustos são pontuais, sem exagero, e a ambientação cria um clima opressor. A Irmã Paxton (Chloe East) é a personagem que se destaca, sobrevivendo com inteligência e força, sem precisar de gritos ou cenas forçadas. 👻 Veredito Final: Um terror que te faz pensar mais do que gritar, com uma abordagem inteligente e sombria."
    },
    {
      "rating": "5/5",
      "review": "Scary, Suspenseful and a great ride. The acting is spectacular. I was able to put my shoulders down when it was over."
    },
    {
      "rating": "4/5",
      "review": "Smart and poignant, the product of A24's tight grasp on the meta-horror sub genre. Incredibly casted and deftly executed, a real gem of the silver screen. Even if you're not a usual fan of the horror/thriller genre, this one might float your boat... 8.6/10."
    },
    {
      "rating": "5/5",
      "review": "It felt like piecing together a puzzle!"
    },
    {
      "rating": "3.5/5",
      "review": "I watched Heretic without having high expectations, but I also didn’t think it would be a complete flop—and it wasn’t. What stood out most to me was how unpredictable the story was. The film set up scenes in a way that made you think you knew what would happen next, only to take the plot in a different direction. By avoiding clichés, it kept me engaged and curious about what was coming. I give a lot of credit to suspenseful movies that don’t follow a predictable formula, and in that sense, this film delivered. That said, it wasn’t a standout movie overall and started to lose some of its strength toward the end. Still, it was a solid and enjoyable watch."
    },
    {
      "rating": "1.5/5",
      "review": "Happy I didn't spend money to watch it in a theatre. My first instinct was that it would just be another weird horror movie. I was half right. Enjoyed the first half but the minute they went downstairs it was over for me. As weird as I expected it to be then."
    },
    {
      "rating": "2/5",
      "review": "Nice try. It started out with great possibilities and then fizzled faster than a shaken can of coke. Beginning is an interesting, intellectual exercise and religious history lesson. Then it became a hot mess of low budget gore and nonsensical mysticism. What was with the miniature labyrinth house? Both doors led to the same small basement? All of the women in cages looked exactly the same? This is why most films suck. Someone got green lit based on a story that had no where to go but down(into the basement). When you start saying 'Oh, please' to yourself mid-film, it's 'Game over, man'. I want my 90 minutes back."
    },
    {
      "rating": "4/5",
      "review": "An amazingly terrifying performance from High Grant. The film wasn't bad either. An interesting, yet horrifying debate, on the philosophies behind many religions."
    },
    {
      "rating": "3/5",
      "review": "I wouldn’t call this movie horror, thriller definitely fits it better. If you’re looking for a good horror movie to watch in the evening with your friends than this is not for you. I wouldn’t necessarily call it scary but definitely unsettling and it keeps you on your toes. 95% of the movie is dialogue which I found quite boring after some time. I’m not a fan of movies with deep meanings and open endings so this wasn’t really for me. But it definitely makes you think about religion and life in general. Definitely an interesting movie, I don’t regret watching it but I feel like 91% is way too much. I wish I chose a different horror movie to waste the evening on but oh well."
    },
    {
      "rating": "4/5",
      "review": "This is an intriguing and challenging film, not for the fainthearted or those who prefer comfort and convention, although the ultimate cinematic demise of the villain is predicable. Those who don't watch movies to think deeply about issues or just want a mindless sensory thriller won't like it. However this is not the film one watches to be comfortable. The film raises questions about many things people don't or can't be bothered to think about, the truth, epistemology *the nature of belief and why we beleive what we do), how strongly we believe, testing belief with practice, and power and control in belief, to name a few. This film is not just another thriller, but a philospoca; debate which will appeal to those with the courage to think deeply about life or are prepared to question their own reality/ It will leave a bitter aftertaste which will have you pondering your own belief system, and ths journey will be unnerving . The key here is in the well constructed dialogue and the sterling and chilling performance from Hugh Grant who keeps you guessing, plus very able and emtoive performances from Sophie Thatcher and Chloe East. The only shame is that this film degrades in the final seens into your more generic horror film with the usual violence and the oblifatory chase/escape scene a consession to convention and conformity, but by then the epistemological challenge has been posed."
    },
    {
      "rating": "4/5",
      "review": "This is a very well thought out suspense thriller. An obvious underlying statement about religion, but that really isnt the point. Hugh Grant is sinister as the villain and Thatcher and East haveore depth than the traditional damsels in distress of most movies of this genre. Excellent suspense without the annoying plethora of jump scares. (Although there are a few) Anyway, worth the watch"
    },
    {
      "rating": "4/5",
      "review": "Devilishly well-written if you can tolerate a few ill-fitting pop culture references. Has truly unexpected turns and twists and Hugh Grant brings it all together in a cabin feverish \"10 Cloverfield Lane\" sort of way. Recommend it for the psychological thriller lover in your life....or even death"
    },
    {
      "rating": "2/5",
      "review": "interesting concept but bad execution and overall boring"
    },
    {
      "rating": "1/5",
      "review": "I'm begining to think that I disagree with critics and movie-goers so often, that it probbaly isn't helpful to read reviews. I don't understand all the great reviews. I kept \"waiting\" for something to happen, and waiting, and waiting.....When something finally happens (as in a reason for the movie) it was \"too little too late\". Ending didn't make sense, and a HUGE disappointment after listening to arguments (yawn) that didn't amount to anything. The acting was all good, but since the script was worthless, what does it matter. The ending is laughable, but not in a good way. Sad use of talented actors."
    },
    {
      "rating": "3.5/5",
      "review": "Very interesting, is it worth watching. Definitely a psychological and brutal thriller. The ending will have you wondering about her final outcome, miracle or heaven. But the fate of the tormentor is not in doubt and I found that satisfying!"
    },
    {
      "rating": "1.5/5",
      "review": "Fantastic movie and ideas up until the last 20 minutes but then apparently the script was stolen by an absolute idiot who loves it when horror film characters stereotypically do really stupid illogical uncharacteristic actions just to get to a scene the director wants at the end. I.e. no reason for the girl to go back down near the trapdoor. Also someone coming back 30min later from getting their sloat slit is dumb. What a waste"
    },
    {
      "rating": "4/5",
      "review": "Refreshing....that's what I have to say about this movie. I'm tired of plots I can guess within the first 10 min of the movie.....this was pretty good, but it had some moments that it asked too much of the suspension of disbelief."
    },
    {
      "rating": "1/5",
      "review": "Genuinely garbage. spent 1 and half hours just yapping about religions for him to unleash a magic trick w his kidnappees. GENUINELY makes 0 sense how the woman who got her throat slit managed to survive for 30 or more minutes straight, stand up whack him with a stick and just die. we dont see the police cleaning anything up. Waste of my money and time. Do not watch."
    },
    {
      "rating": "4.5/5",
      "review": "I never thought that I would like this movie as much as I did. It has a very good plot and the actors are amazing. Seeing Hugh Grant in probably his least \"Male-Love Interest\" role to date. These kinds of films usually leave me very untouched and unscared, but this one really made my pulse quicken and I really was rooting for the unexpected \"final girl\"."
    },
    {
      "rating": "5/5",
      "review": "A thought provoking and highly entertaining horror movie. Loved the twists and turns. Very well executed and Hugh Grant was superb."
    },
    {
      "rating": "4.5/5",
      "review": "MIT MONOPOLY DIE RELIGION ERKLÄREN Der tiefe Glaube an Gott bewegt die beiden Damen Barnes und Paxton an diesem Tag zu Mr. Reed. Was als gut gemeinter austausch der Ideen über Religion beginnt, wandelt sich für die beiden Damen schnell in einen Albtraum. Denn der nette Mr. Reed wirkt zwar interessiert, doch sein Ziel ist das die beiden die einzig wahre Religion begreifen. Heretic geht ca. 110 Minuten und ist ab 16 Jahren freigegeben. Wir haben hier einen Horror-Thriller mit Hugh Grant in der Hauptrolle und mein lieber Scholli begeistert mich dieser Mann. Am liebsten hätte ich ihm noch länger zugehört wie er mit den beiden über die Religionen philosophiert und Metaphern bringt die mit Spielen, Musik oder Fast-Food zu tun haben. Die beiden Damen sind aber nicht weniger interessant, zu Beginn noch schamlos von kleinen Zicken attackiert müssen sie ihren Glauben auf die Probe stellen um wieder aus dem Haus zu entkommen. Dabei gefiel mir Sophie Thatcher als Schwester Barnes besonders, denn ihre charakterliche Entwicklung ist echt göttlich. Die Spannung im Streifen ist jederzeit spürbar und man fühlt wie die Schlinge immer weiter zugezogen wird. Der Sound und die dezente Musik im Hintergrund ist hervorragend. Die Motivation der Charaktere ist jederzeit spürbar. Gerade bei Hugh Grant spürt man die Leidenschaft mit der er jede Zeile mit Leben fühlt, dabei kontern die beiden Damen aber auch traumhaft und man kann an diesem Duell der Worte echt Spaß haben. Einzig im Finale störte mich ein häufiges genutztes Horror Klischee. Am Ende bleibt ein Werk das mich nahezu komplett überzeugt da es hier gut geschriebene Dialoge, drei tolle Hauptfiguren und eine Story gibt die wunderbare Wendungen sowie Ideen liefert die einen in den Bann ziehen. Von mir bekommt der Film 9/10 Punkten. Wie geringschätzig kann Gott sein, wenn er dir nur hilft wenn du betest?"
    },
    {
      "rating": "3/5",
      "review": "Enjoyed this. I was afraid that this was going to turn out to be disrespectful to religion and religious people, but it turned out to be quite respectful to people of faith. I have already watched it twice, and I wouldn't mind watching it again."
    },
    {
      "rating": "5/5",
      "review": "Brilliant! A must see!"
    },
    {
      "rating": "4.5/5",
      "review": "A tightly coiled slow burn closed door thriller with pitch perfect performances (especially Grant, in the stand-out role of his career) & surprisingly intelligent, thought-provoking dialogue. Skillfully maintained palpable tension, interesting ideas, & our 3 leads propel the film into the hall of memorable horror. Filmmakers Beck & Woods continue to prove they know the genre, & I can't wait to see what they come up with next. B+"
    },
    {
      "rating": "2/5",
      "review": "Absolutely terrible. Very bland, the plot needed salt . This movie was so disappointing and one of the few times that ratings were deceiving . Would never watch again and hopefully I forget I ever wasted time watching it . The two stars I gave it was for the originality."
    },
    {
      "rating": "0.5/5",
      "review": "I wasted my time.I was about to die from boredom.I think other comments are made by botters."
    },
    {
      "rating": "4/5",
      "review": "Intriguing beginning but expected more at the end."
    },
    {
      "rating": "5/5",
      "review": "A cerebral edge-of-your-seat confection - this and Long Legs filled the bill for my horror requirements ... thanks"
    },
    {
      "rating": "4/5",
      "review": "Very creepy! Enjoyed the suspense, lots of tension, and Hugh Grant was excellent casting as the obsessed home-owner."
    },
    {
      "rating": "5/5",
      "review": "This film isn't scary, but it offers an exhilarating experience with thrilling and unsettling moments. The cast delivers phenomenal performances, and Beck and Woods present a unique story that challenges viewers to consider different perspectives on religion. It's one of the best films I've seen in a long time."
    },
    {
      "rating": "4.5/5",
      "review": "This film is hard evidence on how a great script can go a long way albeit the constraints of limited production budget. And how the best open endings could haunt you worse than a specter. Everything and everyone's brilliant in this!"
    },
    {
      "rating": "5/5",
      "review": "Hugh Grant is absolutely amazing. Great movie!!"
    },
    {
      "rating": "4/5",
      "review": "Two mormon missionaries, one naive (Chloe East) and one savvy (Sophie Thatcher), are deceived into entering the house of a disturbed scholar of religion (Hugh Grant). Grant seems to love his role and plays his role as if it's a delicacy. East and Thatcher balance the film with their roles as well. It's a film you must enjoy for it's conversation of religions and the questions it raises. A stellar psychological horror that sadly doesn't give a satisfying answer to the villain's main inquiry."
    },
    {
      "rating": "5/5",
      "review": "Wow one of the best movies I've seen in A long time great watch highly recommend 👌"
    },
    {
      "rating": "5/5",
      "review": "What a mind-f*ck! Love it! 🤯"
    },
    {
      "rating": "2.5/5",
      "review": "Meh, the acting was pretty good but not really much of a horror flick, more psychological horror if you will. And the idea (spoiler alert) that Mr. Reed had planned everything out to get Paxton where she got to... so ridiculous."
    },
    {
      "rating": "2/5",
      "review": "It was creepy, but not scarey. I didn't get it either. Too much about religion,yuck."
    },
    {
      "rating": "4/5",
      "review": "Heretic is one of the latest films from A24 film studious and it’s an interesting one to say the least. Not everyone is going to enjoy it but it’s bound to have the viewer ask some questions after watching it. The movie is about 2 Mormon missionaries who visit someone’s house to go over information about their religion. The only problem is the owner of the house that they visit has other alternative motives for them. The owner of the house is played by Hugh Grant who really gives a wonderful creepy performance here. The movie is more of a psychological thriller rather then a straight horror film, even though there are moments of horror. The film keeps the viewer questioning things and on the edge of their seats throughout. My only problem is the movie doesn’t quite fully wrap up everything at the end and rather leaves the viewer with using their imagination of why everything transpired like it did. Heretic is stil worth a watch and possibly repeat viewings. Heretic gets a high 4 stars out of 5 from me."
    },
    {
      "rating": "5/5",
      "review": "Really thought provoking with multiple different interpretations and great performances from the cast. I thought it would be some sort of religious horror movie like the Conjuring, but this is totally different and did not disappoint."
    },
    {
      "rating": "5/5",
      "review": "It is very good, made you think and understand the characters' faiths and views on religion. Great performances and keep your attention the entire movie."
    },
    {
      "rating": "5/5",
      "review": "As someone who has struggled with finding my own faith over the years, this film was very thought-provoking. The whole idea behind it is mind-bending and I honestly wish I could watch the entire thing again, not knowing what would happen."
    },
    {
      "rating": "4/5",
      "review": "Heretic is the kind of film that hits everyone differently. For some it might spark questions about faith or religion. For others, it might deepen their beliefs- or even affirm their skepticism. That's what I love most about it: it doesn't preach, it provokes. The ending leaves you turning it over in your mind, wondering what it all really meant. The cast was excellent, and it was such a refreshing surprise to see Hugh Grant in a role like this. It's a bold thought-provoking film- and I genuinely enjoyed the ride."
    },
    {
      "rating": "2.5/5",
      "review": "An attempt to be intellectual ends in a knotted ball of yarn."
    },
    {
      "rating": "4.5/5",
      "review": "Hugh Grant is absolutely magnetic here. A very interesting movie that made me think and made me smarter on religion."
    },
    {
      "rating": "1/5",
      "review": "Boring. Didn’t understand the point of the movie"
    },
    {
      "rating": "4/5",
      "review": "A thought provoking thriller that is light on scares, but heavy on atmosphere. The performances were career making. You'll be talking about this one for days."
    },
    {
      "rating": "5/5",
      "review": "Great twists! The movie is just full of them!"
    },
    {
      "rating": "0.5/5",
      "review": "Another two hours of my life wasted. Borefest."
    },
    {
      "rating": "4/5",
      "review": "I thought it was going to be a standard horror movie with surreal aspects and a fairly predictable story, but I was wrong. Heretic exceeded my expectations by far, with logistic and thoughtful twists, great acting and a fantastic ending leaving viewers with questions (in a good way!)"
    },
    {
      "rating": "5/5",
      "review": "🎭 Hugh Grant’s Creepy Pivot: Welcome to Heretic’s Twisted World Hugh Grant in a horror film? 😱 The rom-com heartthrob takes a devilish detour in Heretic, and holy hell, does he deliver. This isn’t just a horror movie—it’s a wild, creepy ride that rips apart religion’s flimsy facade and leaves you questioning everything. FULL REVIEW HERE: https://wesleythomashorrorauthor.weebly.com/horror-blog/movie-review-heretic-hugh-grant-tears-religion-to-shreds-in-a-creepy-masterpiece"
    },
    {
      "rating": "2/5",
      "review": "I enjoyed the questioning of religion, but it was so slow and really not very scary."
    },
    {
      "rating": "4/5",
      "review": "Clever premise set in the horror genre"
    },
    {
      "rating": "3/5",
      "review": "Although Hugh Grant does give a great performance I was expecting more. It’s just him yapping and doing rhymes and riddles pretty much lol. Could’ve been something more but worth the watch"
    },
    {
      "rating": "1.5/5",
      "review": "Below average for me. Decent acting, but some of the scary scenes seemed comical to me. This movie had potential but declined as the story went on."
    },
    {
      "rating": "0.5/5",
      "review": "if i could give lower i would"
    },
    {
      "rating": "3.5/5",
      "review": "Heretic raises a lot of questions not necessarily about individual religions, but rather how we as people think about and view it as a whole by means of control. Many people consider seeing the quickest way to get someone to believe something, but have we ever considered feeling a way of believing? If something makes us feel what is considered to be 'the correct way' then does that make it true? Or even if we are told something is true does that make believing it any easier? Belief and trust run hand in hand. A lot of these questions arose while watching Heretic. We as human beings with limited knowledge about all of this are always trying to find which answers are the correct ones and discover that one true religion to which the idea of different iterations is brought into the conversation and the fact that, according to the movie, all religions are trying to get across the same message just in a multitude of different ways. Religion is compared to the game Monopoly to further the discussion of iterations but I also feel the comparison is made in order to show that each religion is ultimately just like one big game of monopoly. The phrase mentioned by Mr. Reed \"the more we know, the less we know\" calls upon the idea that if we end up searching too deeply then that only leads to more questions, some of which are not always answerable, so sometimes it is better to leave well enough alone."
    },
    {
      "rating": "3.5/5",
      "review": "Clever and thought provoking picture of belief and religion that makes u wonder……REALLY….is all that true and of so how can we believe ?? Hugh Grant gives a truly creepy performance and the 2 young girls are quite good as well, never gets dull and if it hints it’s slowing down it starts back up again with another hint or riddle to solve or question to ponder. Well made and original, even if the god theory has been done before, this feels fresh and new and I enjoyed the movie for what it was. Doesn’t force u either way to swing ur belief one way or another but like the Guinea pigs of the game, u come to ur own conclusion."
    },
    {
      "rating": "1/5",
      "review": "Absolute garbage. Please do not waste your time zero plot horrible story."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was a waste of my time. I had high hopes, bcuz I heard great things, but they were slowly dashed. I wish I'd never watched it. The ending, like the whole movie, made no sense. No need to give spoilers, if you have time to waste you should watch for yourself."
    },
    {
      "rating": "4/5",
      "review": "I loved all the scenes using analogies to explain religion and using the philosophical musings in very tense horror scenes. Ir's complete nonsense but good fun. And of course it features Hugh Grant doing impressions of Thom Yorke and Jar Jar Binks in about five minutes, and where else are you gonna see that?"
    },
    {
      "rating": "2.5/5",
      "review": "Surprisingly effective psychological thriller - at least for two thirds of the movie. The last part is contrived and relies way too much on shock value. Still, a mesmerizing Hugh Grant!"
    },
    {
      "rating": "4.5/5",
      "review": "Acting was amazing. Storyline was solid."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie overall with a good built-up story. Every second leaves you a bit more intrigued. Acting was phenomenal and the setting was more and more interesting as the movie went on. Definitely a good watch."
    },
    {
      "rating": "2/5",
      "review": "It would probably make more sense for you to play Monopoly with your family than to bother watching this movie. It thinks it's saying something about religion, but it's really not. The best part of the movie is hearing Hugh Grant's voice which I've always liked on screen. That being said, there's nothing really to like about Hugh Grant's part"
    },
    {
      "rating": "3/5",
      "review": "The acting, directing, writing and score were all first rate (Chloe East has got herself a new fan!) but I simply don't enjoy watching two sweet young women being kidnapped and terrorized for an entire movie. I'm sorry, I'm biased - it's just not my cup of tea."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Lots of twists and really freaky"
    },
    {
      "rating": "4.5/5",
      "review": "Heretic is a fiercely original film, and a non-stop white-knuckle experience. It somehow manages to combine a serial killer thriller, a mystery, and a philosophical and religious debate into one unified whole. Two young Mormon women knock on the wrong door to proselytize. Unlike cliche horror victims, these characters begin to quickly suspect something is awry and make reasonable attempts to make an exit until the host’s intentions become unmistakable. Hugh Grant is masterful as the villain, making the most of the polite British host with gradually emerging sinister undertones boiling below the surface. There is plenty of gore and violence, but always serving the story and never with a descent into torture porn. The master plan of the evil host does seem a bit vague and muddled in the end, but this doesn’t distract from the power of the conclusion, which also manages to escape cliche."
    },
    {
      "rating": "3.5/5",
      "review": "This was pretty up my alley! Sure, it won't be for everyone, but it was for me. The plot gets weak near the end, and it does suffer a deus ex machina problem. However, The acting is superb and the tension is palpable. Hugh really kills it in this, and so do Sophie and Chloe. Never knew I needed Hugh Grant singing Radiohead so much."
    },
    {
      "rating": "4/5",
      "review": "An original concept and story that proves that there can be an evil antagonist in a horror film that's not a slasher. True Psychological horror that even messes with your mind and faith."
    },
    {
      "rating": "4/5",
      "review": "Bien planteada, la forma en que lleva el debate de la religión involucra perfectamente al espectador y sus propias creencias, eso hace que funcione en mas niveles de los que debería. A la vez también me resulto un toque pretenciosa y siento que se va desinflando al final. Excelentes actuaciones, especialmente Hugh Grant la rompe. Vale la pena, engancha bastante y se disfruta aunque no asuste mucho, la categorizaría mas como suspenso que terror."
    },
    {
      "rating": "5/5",
      "review": "Enjoyed it immensely. The story was very smart, creepy and the script was very well written !! Hugh Grant what is outstanding!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "The actors in this movie are all great, and it’s a good premise too. But it’s completely implausible, and in the end leans much too heavily on horror tropes. But it’s still worth watching, especially for Thatcher, who is, as usual, fantastic."
    },
    {
      "rating": "0.5/5",
      "review": "Great performance from Hugh Grant, great concept, and pretty good for the first first 80% or so. Maybe 90%. Sometimes it gets a little heavy-handed, but it stays entertaining even in the most didactic sections. However, the final scene throws in the most tired, played out, hacky cliched horror movie trope ever. If you think you know what I mean, you're right. And even worse? They do it twice. Completely wasted grants performance, completely wasted the concept and the buildup. The payoff is complete garbage."
    },
    {
      "rating": "4/5",
      "review": "The scene about Monopoly is worth the price of admission. While it's not a new concept, it was a great summation of what this movie is about. I also enjoyed watching something that didn't make you want to say, \"just run stupid!\" They were quick to plug that hole quickly which made you want to see how exactly they'd get out of the situation if at all."
    },
    {
      "rating": "3.5/5",
      "review": "This is a good topic to discuss, the atmosphere and scenery are quite interesting, of course, some moments were delayed. Overall, the film is not bad."
    },
    {
      "rating": "3.5/5",
      "review": "First half was great. Second half, not my genre."
    },
    {
      "rating": "1/5",
      "review": "Oh dear. So bad but I watched it & now I wonder why."
    },
    {
      "rating": "1.5/5",
      "review": "What a crappy ending!! completely ruined the story line"
    },
    {
      "rating": "5/5",
      "review": "A24 has done it again, produced an amazing movie with twists and turns I definitely didn't see coming \"*The rest of the review has spoilers. Do not read past this point if you haven't watched yet** The trailer seems to give it away, but it barely touches the surface. Hugh Grant plays an amazing bad guy in this movie and stunning performances by Chloe East and Sophia Thatcher as the protagonists I am left on my toes as everything is not what it seems at every chance, and you think one girl is definitely the final girl, and it ends up another. A great take on modern religion and how easy it is to control people with a lie."
    },
    {
      "rating": "4/5",
      "review": "Hugh Grant was surprisingly good as a villain. It was a well paced thriller with solid acting. Definitely worth watching, my biggest complaint was the ending was kind of disappointing, but don't let that stop you, go watch it!"
    },
    {
      "rating": "5/5",
      "review": "Best horror movie in years."
    },
    {
      "rating": "4/5",
      "review": "Heretic was a good movie. I really enjoy movies with different twist , topics and concepts. I enjoy the religion battle aspect. I do believe this movie would not be enjoyable to someone to doesn’t like to “internalize “ or learn for other religion or other beliefs. I think this movie lets you choose what your reality is to the ending."
    },
    {
      "rating": "4.5/5",
      "review": "When I saw this trailer, I thought I knew what would happen to move the story along. But I was wrong. This movie had a lot of depth and they didn’t take the easy way when writing the story here. Really good work."
    },
    {
      "rating": "1/5",
      "review": "Can we start getting more realistic in movies? Running back up the stairs and blocking off one door and then re entering the basement with no awareness of your surroundings and letting your guard down entirely after what you had just gone through is a joke. Anyone in a survival situation as such would be on high alert and ready to act after the being aggressive towards there attacker. Good idea for a movie but so un realistic i would never watch again."
    },
    {
      "rating": "1/5",
      "review": "Gross misrepresentation of the Mormon church and missionaries. Of course, these Hollywood elites know the church will never sue them because they deserve to be sued for the misrepresentation. I like Hugh Grant as an actor and that was great, but this being propped on misrepresenting a whole religion is revolting."
    },
    {
      "rating": "4.5/5",
      "review": "Great premise and lots of fun"
    },
    {
      "rating": "5/5",
      "review": "So original! Hugh is incredible! Love it! Very smart and shocking! X"
    },
    {
      "rating": "4/5",
      "review": "Honestly wasn’t expecting this movie to be good, and wow!!! Great directing and the acting was amazing. Grant played his character quite well and a shocking twist at the end, lots of suspenseful scenes and makes you think was it true or not."
    },
    {
      "rating": "4.5/5",
      "review": "Insane movie, hooks you right from the start and great acting all around. You think you know where it's going and it keeps you guessing, most original movie I've seen in a while."
    },
    {
      "rating": "4.5/5",
      "review": "Probably one of the best movies I have watched in a while. Hugh Grant does a phenomenal job building the suspense and it is a truly great thriller/horror."
    },
    {
      "rating": "4/5",
      "review": "This movie was a wild ride. It took me a while to recover from it."
    },
    {
      "rating": "4/5",
      "review": "Heretic masterfully builds a sense of claustrophobia as it progresses and I’m fairly certain this was intentional. The film’s growing discomfort is palpable, making the viewer feel increasingly trapped alongside the characters. The casting is spectacular, with outstanding performances across the board. What’s truly impressive is how the cinematography and storytelling manage to evoke such intense fear and anxiety within such confined spaces, using only a small cast and a limited number of rooms. It’s a testament to how atmosphere and tension can be crafted with minimal elements yet maximum psychological impact. And the blueberry pie? Let’s just say my relationship with that dessert is forever changed. Don’t trust the process…"
    },
    {
      "rating": "0.5/5",
      "review": "I am so bummed that I got marketing tricked into watching this horrible movie with almost no redeeming qualities. Waste of Hugh Grant, who did the best he could with horrible, *horrible* writing."
    },
    {
      "rating": "5/5",
      "review": "I have loved every single moment of this film Hugh Grant was magnificent, as Turner too The doubts, boardgames, mystery, genius it's all together. Unfortunately the cinema in my town (Pisa) removed the film really fast, so I had to go to Livorno (TheSpace) in order to see it"
    },
    {
      "rating": "5/5",
      "review": "I watched it today, and very interesting movie, it really makes you think a lot and I actually learned quite a few things or facts in this movie, like I didn't know that monopoly game was pretty much a copy of an old game.... the ending of this movie lets you have your own interpretation, you have to pay attention to every single detail, like the butterflies in the movie for example.. 5 starts added on my watch list on Max, great actors"
    },
    {
      "rating": "5/5",
      "review": "Wow! This is not at all the movie I thought it would be. The twists and turns are insane. You definitely will not see anything coming no matter how creative your imagination might be. It really made me reflect not only on the meaning of religion and spirituality but also how indomitable the human spirit truly is. VERY highly recommended especially if you like all things enigmatic, esoteric and/or mysterious"
    },
    {
      "rating": "5/5",
      "review": "One of Hugh Grant's best performances. His trademark charming style enveloped in a sinister motif provides one of the most satisfying viewing experiences I've had in years. Those who have said it was boring must have the attention span of a gnat, haven't really watched the movie, or their heads are too far up their posteriors because the content doesn't fit their beliefs. Everyone should watch this movie and learn a few things."
    },
    {
      "rating": "5/5",
      "review": "This is Hugh Grant at his finest. The ideas, beliefs, and conversations between him and two Mormon girls is some of the best writing I ever watched. It’s a movie many might not like but it does expose many truths that is hard to argue against. Definitely a rewatch movie."
    },
    {
      "rating": "4.5/5",
      "review": "Riveting and overdue-I was pleasantly surprised (as much as shocked) that Hollywood still had the ball$ to put something like this out- pointedly, peoples assumptions about their faith are actively challenged. Hugh Grant is in top form and his character, Mr. Reed, showcases a superior argument throughout, though it's clear his passion for an answer has lead him astray. So while you've empathy for the women in the movie, you also find yourself often agreeing with Mr. Reed (Grant) and his hypotheses, while knowing no good ending could possibly come from this."
    },
    {
      "rating": "2.5/5",
      "review": "One of these high concept horror movies which engages in some philosophical banter about religion alongside its gruesome thrills."
    },
    {
      "rating": "4.5/5",
      "review": "Very suspenseful. Very dark but a \"Must see\"!"
    },
    {
      "rating": "3/5",
      "review": "I was eager to watch this film because the trailers had me in a chokehold. Hugh Grant had me terrified. The beginning had me intrigued. The middle was lack luster but the horror was flat. The ending seemed a bit different from what I expected."
    },
    {
      "rating": "3/5",
      "review": "im just going to paste one of the reviews a person wrote because it represents how I felt about it \"I am going to echo what some others have said. The first half of this movie is brilliant. It lost me about halfway through, though. I wish so much that the writers would have chosen a different path. Heretic could have been one of the most genius movies ever written if their villain would have been a different sort and had different motivations. While hard to choose a number for this movie, I think I'm feeling 6 1/2. Great acting. Great cinematography. And, like I said, brilliant script in the first half. A thought-provoking film until it isn't. Also, the ending is more ambiguous than I would like it to be. If the whole movie were like the first half, this would be a solid 9. But alas.\""
    },
    {
      "rating": "2.5/5",
      "review": "HERETIC opens with a lot of promise, but by the middle, you’re just praying for a miracle to make it end."
    },
    {
      "rating": "4/5",
      "review": "Heretic is a theological, psychological thriller with plenty of horrifying moments. Hugh Grant is totally diabolical in a role that plays against his usual type. The film’s direction is sure-handed with a few well-styled shots. The script will keep you guessing until the very end, even if the final conclusion isn’t wholly satisfying. For me, the film makes one crucial misstep in its storytelling, and to say more would spoil the ending. So make sure you check this one out and decide for yourself."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie. It is quite thought provoking."
    },
    {
      "rating": "5/5",
      "review": "This movie captured my interest fully from start to finish. The acting was among the best I've seen from an entire cast. Definitely makes you think, too. Excellent script and they accomplished a lot, while using only one location for most of the movie."
    },
    {
      "rating": "3.5/5",
      "review": "A creepy religious psychological horror film in which two young, female Mormon missionaries call on Hugh Grant to try to convert him and end up manipulated by him into a tortuous, deadly game. The first half is almost entirely cerebral - but no less chilling for it - as they three play out a discussion about matters of faith and rationalism. As the reality of the situation unfolds, it becomes more conventionally horrific - but though there are shocks and there is gore, the emphasis here is on dialogue and psychological manipulation throughout. Hugh Grant is terrific, having a great time in a thoroughly nasty role; it's his work on much of the weight of this film is carried. There's also something refreshing about a horror film in which a rationalistic atheist is the villain trying to exploit and torture the people of religious faith. It's not perfect, but it's a very enjoyable, well-directed and written horror thriller in which the usual polarities are neatly flipped."
    },
    {
      "rating": "5/5",
      "review": "Movie was So good I felt sorry for the missionaries who showed up to convert me the other day."
    },
    {
      "rating": "1/5",
      "review": "Imagine an insufferable self-righteous reddit atheist kidnapped you and just wouldn't shut up."
    },
    {
      "rating": "3.5/5",
      "review": "On Edge, clever nail biter potential to be one of the best horror films of the Year for sure! But then comes the Monopoly game that ruined the entire moment of next level scare your audience already? That movie was good at best it never recovered blah,blah blah"
    },
    {
      "rating": "4.5/5",
      "review": "Great movie, exposes how fake religion is"
    },
    {
      "rating": "4/5",
      "review": "I liked it up until the basement stuff started. Wish it had been based on something more believable."
    },
    {
      "rating": "3/5",
      "review": "It started strong but went left pretty quuck. Hugh Jackman was very entertaining but the story fell short."
    },
    {
      "rating": "4/5",
      "review": "Gripping from start to finish. The supernatural teases and the brilliant script writing really do keep you guessing and enamored, without getting muddled down. Sophie Thatcher's charism does a great deal to keep the energy up with brilliant twists and turns from High Grant. Definitely an A+ suspenseful thriller!"
    },
    {
      "rating": "3.5/5",
      "review": "Good film but the plot gets a little tedious at times. The third act left me a little disappointed with how frenzied the ending was."
    },
    {
      "rating": "2/5",
      "review": "First 2/3 of the movie were interesting and suspenseful. Then the movie jumped the shark and completely dropped the ball. The last 1/3 turned a good movie into a bad one."
    },
    {
      "rating": "5/5",
      "review": "Just watched this last night. This movie was incredible and Hugh Grant was great in this, one of my favorites of all his performances. I saw it called in a couple of different places a Thriller/Mystery and a Thriller/Horror. I think it was all of those. Very smart movie, the dialogue was amazing. I think maybe the people that gave it bad reviews just couldn't keep up with the smartness of the dialogue. Hugh Grant was so excellent at sounding like a proper gentleman that these girls would trust, even if things were a little bit off. I thought the timing and suspense was great also, the suspense just built up over time and leaves you wondering what the heck is going on. I loved the young actresses performances also, absolutely believable. I would love to see Hugh Grant in more movies like this. This is a must watch."
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this one. Superb acting. The themes and ideas the film explores are really cool. Music is used to great effect here. The end credits really punctuate the story."
    },
    {
      "rating": "5/5",
      "review": "Heretic is a gripping and thought-provoking film that had me hooked from start to finish. The story is original and intense, blending suspense and emotion in a way that feels both fresh and impactful. The performances are top-notch, especially from the lead, who brings a powerful presence to the screen. The pacing keeps you on edge without overstaying its welcome, and the visuals are stunning, adding depth to the already strong narrative. It’s a film that leaves you thinking long after the credits roll. Highly recommend for anyone looking for a captivating and memorable experience!"
    },
    {
      "rating": "4/5",
      "review": "It was entertaining suspense. I enjoyed Hughes Grant character Mr. Reed rant about the intergeneration of religion's, the board the game monopoly, music then it goes off cliff with miracle of necromancy, simulation theory. It's entertaining I watched it twice."
    },
    {
      "rating": "5/5",
      "review": "Hugh Grant's performance was absolutely incredible. I was wonderfully surprised in the storyline and thought provoking ending. The director and the entire casting team did a marvelous job in this philosophical thriller. I highly recommend this soon-to-be classic. 9.75/10!"
    },
    {
      "rating": "1.5/5",
      "review": "Hugh Grants acting is the only saving grace of the entire movie. All around just boring movie and very predictable. It supposed to be a horror movie but it's not scary."
    },
    {
      "rating": "4.5/5",
      "review": "Enjoyed this one immensely. For once a palpable fear comes across two female leads (not the endless drivel of badass characters). Two wholesome but beautiful and fragile Mormon missionaries enter the house of an avuncular professor type gentleman (and Hugh Grant fits this to the tee). The conversation felt genuine and hit me hard. I once was like those two missionaries, full of idealism, and now older and jaded I found myself identifying with the antagonist's arguments...except the film takes you for a spin and did not let go. I agree with another reviewer that the payoff is questionable, but the conversations and the lead up are definitely worth the price of admission."
    },
    {
      "rating": "4/5",
      "review": "A religious thriller with a lot of facts and lies being put into question to really make you think He’s right or wrong."
    },
    {
      "rating": "4/5",
      "review": "A thrilling and compelling experience but the ending fell kind of flat"
    },
    {
      "rating": "1.5/5",
      "review": "Grant is the best thing in this unoriginal movie. He does his part to insure the creepy bad guy of the horror movie is scary, unpredictable, and disliked because he is, indeed, quite creepy. The acting overall is quite good with Grant leading the way, but why is Topher Grace even in this movie? A part so small it's basically unnecessary. Like the commercial where the kids run into the garage of chainsaws where the bad guy is, this movie is a huge cliche. All of it is wrapped in religiosity questions to give it a solid cult like feel which has also been done a thousand times. If this feels original to anyone then they are younger than 30 and have never seen movies like The Exorcist or The Omen and the many, many sequels, prequels, and knockoffs that followed. Don't believe the hype on this one."
    },
    {
      "rating": "4/5",
      "review": "The claustrophobic setting and resonant religious themes are lit up by great performances across the cast, and Hugh Grants dark star turn does not disappoint."
    },
    {
      "rating": "1/5",
      "review": "Like why make a movie"
    },
    {
      "rating": "4.5/5",
      "review": "Hugh Grant is, what can I say, fabulous. His musings on religion and comparisons to rock and roll are humorous and quite correct. For me, the first hour was humorous with humor building to tension. When the movie turns to horror, I didn't find it scary but I did find it induced a bit of fear."
    },
    {
      "rating": "3.5/5",
      "review": "Hugh Grant was good in this. It's hard to imagine him in any movie other than a rom-com with Julia Roberts or something like that, but he was right for this one. I like the story, it was good. It's not really a typical horror movie, but has a few parts that are scary. Fans of real horror will fine this too wordy for them."
    },
    {
      "rating": "5/5",
      "review": "Plot twist over plot. Suspenseful till the very end. One of the best movies that I've watched."
    },
    {
      "rating": "1/5",
      "review": "People saying they liked this are either lying or mentally ill. 91% on Rotten Tomatoes??? They gotta be grading on a curve because Heretic was absolutely unwatchable. This wasn’t scary, this wasn’t thrilling—this was a scam. It's more enticing to watch paint dry or cats eat on tiktok."
    },
    {
      "rating": "4/5",
      "review": "At first I was a bit apprehensive about watching this movie. There are so many bad movies with a great rating and so many good movies with a bad rating. This movie is worth every time that you’ve refused to see because of the bad reviews. Give it 30 minutes and you won’t leave empty handed. There is that *one* scene that you will never forget. Don’t say I didn’t warn you!"
    },
    {
      "rating": "3.5/5",
      "review": "Worth a watch! Religious puzzle is the best I can describe it. It kept me entertained"
    },
    {
      "rating": "3.5/5",
      "review": "Heretic is an excellent movie, scary and even philosophical at times, but I had one major problem with this production. So many of the most vital scenes are filmed with hardly any light; it's a very \"dark\" production and this ruined my enjoyment."
    },
    {
      "rating": "5/5",
      "review": "Heretic is a gripping, thought-provoking thriller that keeps you on edge from start to finish. Hugh Grant delivers a chilling performance, completely transforming into a character that is both charismatic and terrifying. The film masterfully blends psychological tension with horror, making every moment feel unpredictable. Sophie Thatcher and Chloe East also shine, adding depth to the story with their powerful performances. The way the movie explores faith, manipulation, and survival is truly compelling. Highly recommend for anyone who loves intelligent, suspenseful horror!"
    },
    {
      "rating": "4/5",
      "review": "Excellent movie with terrific performances. Hugh Grant especially makes it worth a watch. The first two thirds of the film totally had me hooked. Excellent writing, fun verbal sparring, cool atmosphere and some big fun questions for the audience. I thought I was in the presence of something great. But unfortunately, the final act kind of stumbles. First, I think the film inevitably collapses under the weight of all the big questions it was trying to hold up. The film seems to call for a much grander and elegant conclusion. Second, it devolves into more heavily traveled horror clichés. Still great, but a rather uneven finish kept it from being transcendent."
    },
    {
      "rating": "4.5/5",
      "review": "Better than most of the movies nominated for best picture Oscar. Suspenseful and thought provoking. Hugh Grant should have been nominated for best actor. Kept my interest."
    },
    {
      "rating": "4/5",
      "review": "When I saw the preview I knew i wanted to watch this movie! I thought it was very interesting and I honestly hate long talk movies but the dialogue in this film was actually great! The acting between the two girls and Hugh Grant as a villain was just absolutely amazing. The ending of the film also made it like a MIC DROP!"
    },
    {
      "rating": "3/5",
      "review": "The first part of the movie was actually really good, but at the halfway point it starts to fall apart. Why does Mr. Reed have a ton of old women in his cellar? What’s the point? It could have been something good about religious psychosis or control… and Mr. Reed’s “deranged ramblings” make sense..? Anyways, if you enjoyed Captain America: Brave New World, then you might like the spaghetti plot-lines and the corny scenes at the end."
    },
    {
      "rating": "3.5/5",
      "review": "Great storytelling. Movie keeps you engaged right up until the end. Wonderful performances throughout, especially Grant. It would have been better without some of the religious elements, but still an enjoyable film."
    },
    {
      "rating": "4/5",
      "review": "An original concept and story that proves that there can be an evil antagonist in a horror film that’s not a slasher. True psychological horror that even messes with your mind."
    },
    {
      "rating": "4/5",
      "review": "I believe it was very thought provoking. I found some of the dialog very profound. It challenges the belief structure of religion as a whole. What conservatives think about this movie is yet to be seen. This would serve as a great movie for analysis for college-level students."
    },
    {
      "rating": "4.5/5",
      "review": "The acting alone is reason enough to watch this movie. It's a thriller with substance and intelligence."
    },
    {
      "rating": "4/5",
      "review": "This film did have some thought provoking religious dialog. I've watched shows on the Mormon religion and continue to be baffled by a number of their religious beliefs. I've encountered Mormon missionaries near where I live and while they are friendly, they do have the tendency to be pushy and unrelenting even in passing. They continue to go door to door in their practices and while this film held no truth in its content, it would be enough to elicit alarm at those continued practices being carried out in this day and age. Hugh Grant played the lead role well. He was very friendly, disarming and an unassuming evil character until the direction of the story begins to shift, as do his character's traits."
    },
    {
      "rating": "5/5",
      "review": "Great movie from start to finish"
    },
    {
      "rating": "3/5",
      "review": "\"Heretic\" is a film that was supposed to be a tense horror, but ended up going in a slightly different direction than I expected. Instead of a classic thriller, we get a more atmospheric, slowly-built story that focuses on the psychology of the characters. Although I missed a bigger dose of horror, the film has its own unique atmosphere and some really intriguing moments."
    },
    {
      "rating": "1/5",
      "review": "This movie got off to a promising start but soon went downhill to nowhere. The only thing that saved it in any manner is that the actors are good. Can not say the same for the movie line and plot. I was disappointed that it turned out to be kind of a snoozer. I’m just glad I didn’t waste the price of a movie ticket since I was able to watch it free at home."
    },
    {
      "rating": "5/5",
      "review": "Stellar!! Great movie!"
    },
    {
      "rating": "4/5",
      "review": "A chilling horror flick that keeps you on the edge if your seat."
    },
    {
      "rating": "5/5",
      "review": "My first 5 star of 2025. This movie had me enthralled from beginning to end. Loved the allegory and the ambiguous ending."
    },
    {
      "rating": "3.5/5",
      "review": "Hugh Grant was very good in this film--the female characters, not so much. Probably a little too long and convoluted to support the somewhat disappointing and silly end/plot. The movie itself was like a cross between My Dinner with Andre and Silence of the Lambs. Having said that, it was different and it is worth a watch but the lead up fails to deliver the knockout punch that would justify the long slog to get there."
    },
    {
      "rating": "4/5",
      "review": "Gostei bastante! Gosto de filmes de suspense, o filme deixa tantas mensagens importantes em meio a um ambiente angustiante. Há apenas uma cena que eu não gostei que ficou mais pro final do filme! Mas no geral o filme é muito bem executado e bem pensado! Parabéns à produção e direção do filme!"
    },
    {
      "rating": "3/5",
      "review": "Ok watch not very fast paced"
    },
    {
      "rating": "4/5",
      "review": "Hugh Grant was amazing as well as the 2 young female actors. I didn't care that the move was filmed in a small house with so few actors! Unique storyline! Bravo Hugh Grant and cast!"
    },
    {
      "rating": "3.5/5",
      "review": "I really liked Hugh Grant in this film . obviously the big point of this film is to show religion is all about control and I felt the story has its highs and some mid lows at times ."
    },
    {
      "rating": "1.5/5",
      "review": "This movie was not interesting or scary or even a thriller my wife and I both fell asleep in fact I think our dog did as well. Glad we waited for it to be free to watch"
    },
    {
      "rating": "4/5",
      "review": "Great performances, a small cast, and a story set almost entirely in one house—yet the film keeps you on edge in every scene."
    },
    {
      "rating": "4/5",
      "review": "This movie was good horror-flick low budget film. I was definitely worth it. This was shocking horror religious conflict."
    },
    {
      "rating": "4/5",
      "review": "Heretic is Unlike Anything You Will See. It is somewhere between a philosophical exploration and deeply disturbing horror film. The plot involves two Sisters of the Mormon Church whose journey to proselytize and spread their faith lead them to a highly educated and eager man, played by Hugh Grant. Hugh Grant never ceases to shock me at the broad and diverse nature of his acting abilities. He can play a range from funny to dramatic to deeply disturbing. This film is about as disturbing as it gets. He is compelling every second he is on screen, The young women who star are terrific. Topher Grace is an odd choice for a small role that could have been played by anyone. This one will haunt you."
    },
    {
      "rating": "4/5",
      "review": "I don't normally watch thrillers. So take my recommendation with that grain of salt. Much of the content of this script is straight out of early college discussions with my then roommate. Really interesting to debate and ponder, though there was no \"simulation hypothesis\" in the 80's, that I know of. There are some good thriller-y twists, turns and revelations. Nothing earth shattering. No big payoff in the end that perhaps is built towards. Or is there? ;)"
    },
    {
      "rating": "5/5",
      "review": "Love this movie any movie that shows how ridiculous religion is especially the Mormon religion is is a great movie to me. Missionaries are really as cringe as they depict in this movie. Hugh Grant was amazing in this!"
    },
    {
      "rating": "3/5",
      "review": "Gripping, unsettling, and committed hard to the bit of having this uncomfortable discussion that no one ever wants to have. Not sure the payoff is worth it in the end, but the dialogue and the suspenseful journey to get there is worth experiencing."
    },
    {
      "rating": "4/5",
      "review": "Fantastic set-up with thrilling, chilling dialogue. Thought the last act was a relative let-down; but ain't that always the way..."
    },
    {
      "rating": "3.5/5",
      "review": "Not the horror masterpiece it could've been but still a stellar showcase for the lead trio, Heretic is an intriguing & thrilling watch."
    },
    {
      "rating": "3.5/5",
      "review": "#Heretic if My Dinner With André if André Gregory were a serial killer and Wallace Shawn were two proselytizing teen Mormon girls. Hugh Grant is an utter delight, the teens largely up to the task, and the dialogue is often great, with some solid opening salvos regarding faith and disbelief. At the same time, I was disappointed that Grant’s Mr. Reed never responds to Sister Barnes’ initial intellectual rebuttal other than revealing his crazy. Narcissistic psychosis makes for a great underpinning, but the genre tropes often overwhelmed potential subtleties that might’ve proved interesting. Granted these things must always peak with survival/death, but the way the final scene tries to have it both ways feels more like an abdication that a statement regarding the themes it purports to explore. Likewise, the details of the final scene are muddied by poor editing, making it tough to understand certain decisions when it comes to the manner of fleeing. Overall, though, good stuff."
    },
    {
      "rating": "3.5/5",
      "review": "It’s nice to go into a movie without really knowing what to expect and I wasn’t expecting this. Grant is great in the role but the script is hamstrung by its need to be a bit overly clever. The two female leads are also strong, although I think the wrong one is (spoiler) sacrificed given the way the rest of the movie play out. Topher Grace is totally wasted in a nothing role, not sure why he is even in this tbh. Overall a decent movie that is about 20 mins too long, filled with excellent performances and let down ultimately by a script that is trying to be far cleverer than it needs to be."
    },
    {
      "rating": "4.5/5",
      "review": "It moves a little too fast, especially in the back half, but everyone does stellar work"
    },
    {
      "rating": "5/5",
      "review": "I found this movie very thoughtful because the reality is that we often carry real emotions and feelings, and some people take advantage of that. They just become a middleman between people and God. But the question is, do gods really exist or not? This is something that cannot be said for sure."
    },
    {
      "rating": "2/5",
      "review": "......................"
    },
    {
      "rating": "4.5/5",
      "review": "I would definitely recommend it to everyone. Hugh Grant is amazing in this movie, his acting is fantastic. He's really scary. I liked a lot his caracther, and i liked a lot the themes of the film and how they were represented. But I have to admit that at the end of the movie I was quite confused ahahah."
    },
    {
      "rating": "5/5",
      "review": "Movie was thrilling in every sense and I never had an idea of what was going to happen next. Overall great movie."
    },
    {
      "rating": "4/5",
      "review": "Very well done. The acting of Hugh Grant was phenomenal and the other actresses were really great too. The camera work was very well done and the story was very good. Highly recommended."
    },
    {
      "rating": "5/5",
      "review": "A good horror movie with a Hugh Grant. Very smart and technical character with the side of horror and insanity. Very well played out, with intriguing opinions towards faith and religion which helps the hostages adventure out. Also interesting facts about board games."
    },
    {
      "rating": "4/5",
      "review": "A movie about two Mormon women that knock on the wrong door. Its a rather long story wise but it ends well. Nice to see Hugh Grant again,"
    },
    {
      "rating": "5/5",
      "review": "Jujur saja aku sangat takut ketika menonton dari rumah produksi a24. Filmnya selalu menguji nyali. Tolong untuk filmnya aku hanya bisa menutup mata tapi beneran bagus buat menantang adrenalin #lol"
    },
    {
      "rating": "3.5/5",
      "review": "This was definitely heading for a 100 rating or definitely the 90s and spoiler alert….. They ruined it at the end. They should’ve just left it but they had to……well I don’t wanna ruin it for anyone…… right there til the end."
    },
    {
      "rating": "4/5",
      "review": "Better than I thought. Very good."
    },
    {
      "rating": "4/5",
      "review": "Faith maybe the most debated subject in our societies. Only alarmingly insane fanatics would experiment the literature and dramatizations. The never ending struggle between mechanical logic and spiritual belief is portrayed sharply from the very first minute. The visuals were imaginative, powerful and thorough. Superb cinematography to conjure the intended reaction from viewers. Characters were quickly and firmly founded with witty word plays. Flawless work by the cast. Acting was realistic and precise. Excellent audio effects that goes well with backdrop of every scene. Great music too. Heretic was a religious horror with a simple enough stranger danger theme with a powerful imagination that will leave it's impression in many of the audience's minds."
    },
    {
      "rating": "1/5",
      "review": "Notice how all of the reviewers keep mentioning Hugh Grant's acting, yet none of them mention the terrible plot, ridiculous storyline, and completely unrealistic ending? The final 30 minutes felt like they were just ad-libbed on the spot. Lesson learned: if you write a horrible script and some producer gives you money, make sure you get a REALLY good actor to distract everybody."
    },
    {
      "rating": "4/5",
      "review": "Absolutely terrific. Calculated, clever, thought provocing, tense. And Hugh Grant is everything and should win all the awards."
    },
    {
      "rating": "5/5",
      "review": "Hugh Grant is excellent as a well versed theologist who holds more secrets than the material he studies so avidly. Thatcher will do big things."
    },
    {
      "rating": "1.5/5",
      "review": "This movie pretends to be something original. After promising beginning, exciting, with strong tension what we get? Boring, overcomplicated, flattened discussions with predictable plot twist and disappointing, obvious conclusion. It's not enough to say it was bad movie. It's drains your energy. Watching it was exhausting. As a con, I can praise girls' acting. They were really great in their roles. Promising young actresses. Hugh Grant is Hugh Grant. He's acting is always the same."
    },
    {
      "rating": "5/5",
      "review": "kerenn sekali mesti nonton"
    },
    {
      "rating": "5/5",
      "review": "Mantap kali film nya guys"
    },
    {
      "rating": "3/5",
      "review": "Netter Film, aber irgendwie fehlt mir was. Der Film holt mich nicht ab. Kann aber auch nicht sagen was mir fehlt."
    },
    {
      "rating": "4/5",
      "review": "Heretic is just as it promises to be — a mind game with no end in sight. Like the movie’s leading characters, Sister Barnes and Sister Paxton, viewers can feel the terror and dread amping up for the whole first act. By the time the true premise of the movie is revealed, we feel the stakes first-hand, just like the characters. The film is a dark commentary on our many religions and the fear that drives us to practice them. Ultimately, Heretic is a battle for control — between the girls and Hugh Grant’s Mr. Reed, between the girls themselves, between the characters and their Gods, between the viewer and the characters. We, as viewers, grasp at straws for any semblance of understanding or control in the twisted maze of the film (just as we do in life). We understand only as much as the filmmakers want us to at any given moment. The movie forces us to confront our own mortality, makes us wonder what we might do in a similar situation. With an eerie performance from Hugh Grant and a soundtrack that feels both biblical and hell-ish (thank you, Sophie Thatcher’s version of Knocking On Heaven’s Door), Heretic sets itself up to be an all-time great, as far as horror/thrillers go."
    },
    {
      "rating": "5/5",
      "review": "A24 did it again. After Hereditary, this film is another masterpiece of the 21st Century."
    },
    {
      "rating": "3.5/5",
      "review": "good film that sets the tone early for a non-apologist approach to door-to-door religion sales...a \"peddle your dogma elsewhere\" horror film that highlights the need to put a stop to arcane and pedestrian proselytizing. The banter was thought provoking and real. The only fail was the ending, SPOILER ALERT, the horror would have been amplified if she had ended up in the same predicament as her predecessors."
    },
    {
      "rating": "4/5",
      "review": "To state the obvious straight away: Hugh Grant is by far the best thing about this movie. Which is not to say that everything else is weak. Personally, I find it very charming when I have no idea what's going on the whole time. There are weaknesses here and there though, such as logical flaws in the story or the painfully obvious use of Chekhov's gun. Nevertheless, a very positive experience, A24 (almost) never disappoints."
    },
    {
      "rating": "3/5",
      "review": "The first half seemed promising, but the ending left something to be desired. At first, I thought (and perhaps hoped?) that he truly was going to be committed to the religious & philosophical debate. I thought anything scary the girls experienced was going to be purely psychological or fake in some way, and they were never in any actual danger. Unfortunately, the ending fell for the typical horror cliché."
    },
    {
      "rating": "5/5",
      "review": "One of my new FAVORITE horror movies, matter of fact, one of my favorite movies overall! I wouldn’t recommend if you don’t like psychological horror because this dabbles into that a bit (a lot) and is pretty scary in my opinion. The acting is great, the script is great, is is overall an absolute must see!"
    },
    {
      "rating": "5/5",
      "review": "My favorite movie of 2024! Gripping and tense with so many surprises. Top notch acting, particularly from Hugh Grant. This is a movie that will roll around in your head for days afterward and can make for some fun philosophical conversations."
    },
    {
      "rating": "5/5",
      "review": "Hugh Grant and Sophie Thatcher."
    },
    {
      "rating": "3/5",
      "review": "It was good. They could’ve did more with the idea rather than being in 1 location 98% of the film. I still recommend this as a good watch!"
    },
    {
      "rating": "3.5/5",
      "review": "Huge Grant being creepy and sinister was an interesting against type performance. It's a slow movie at first but it builds up steam and becomes fully engaging a third of the way in."
    },
    {
      "rating": "0.5/5",
      "review": "Not worth the time. Nothing jee about religion. Yes, re fresh Ing to see Hugh Grant in año there kind of role, not a good story"
    },
    {
      "rating": "3.5/5",
      "review": "If Heretic did one thing right it's that it converted me into a believer that Hugh Grant is a formidable actor -- until now I always disliked him. The story takes a bit of a ridiculous turn towards the end but overall it's an enjoyable movie that delivered on the thrill for me."
    },
    {
      "rating": "4.5/5",
      "review": "Incredibly clever, well planned out and superb acting. I seriously rate the film. Very unexpected scenes and unfolding plot. Highly recommend for those interested in a more intellectual take on religion, questioning the truth and not your average horror."
    },
    {
      "rating": "4/5",
      "review": "Heretic is a well-crafted, original film that tackles thought-provoking themes through stellar performances, especially by an unlikely Hugh Grant, whose charmingly formidable villain is a diabolical adversary. Although it plays into horror tropes, the film is more of a psychological thriller as its primary tool for racing hearts is rising tensions and atmospherics. Nevertheless, it's plenty to keep viewers glued to the edge of their seats for its entire duration. The movie is also unique in its ability to be a philosophical debate on theology without offending any religion or belief. It shows that a good writer can tackle any topic tactfully and respectfully without risking the story's integrity."
    },
    {
      "rating": "5/5",
      "review": "Absolutely brilliant film, beautifully crafted. It links ideas of religion and plagiarism to themes of music and monopoly (surprisingly) and, it is well developed around these ideas. The film is brilliant the first time, but definitely needs more than one watch to understand the deeper messages interlaced within the film. Would definitely recommend for a very good phycological horror with very, very complicated deeper meanings and messages."
    },
    {
      "rating": "2/5",
      "review": "Listen I didn’t hate the movie but it’s boring as hell and weird. Watch something else."
    },
    {
      "rating": "3.5/5",
      "review": "Interesting view on topic of religion. Even though it felt like somebody religious wrote the script making the most religious character \"win\" the battle, the raised topic and the answer seem interesting."
    },
    {
      "rating": "3/5",
      "review": "Just like the religion the girls were proselytizing in the story, this movie is a whole lot of nothing. Not one of the worst spook films of 2024/2025 by far, considering the garbage out this year, but utterly forgettable. On the positive side, seeing annoying door to door Mormons get their overdue comeuppance was quite refreshing and delightful."
    },
    {
      "rating": "3.5/5",
      "review": "Amazing dialogue with near perfect delivery from the amazing characters and actors. Very depressing discussions but, eventually, becomes weakened because it’s not as thin as it seems. The last act is weak but it does by fast enough so that it doesn’t drag the movie."
    },
    {
      "rating": "3/5",
      "review": "''This might be the greates movie I've ever seen'' I said to myself in the middle of the movie but, i were dead wrong. The thrill and uncertainty of the story got me hungry for more for the first hour so. The ending however felt unfulfilling and somewhat rushed. It left me with a feeling of disappointment as they had something going only to ruin it."
    },
    {
      "rating": "4.5/5",
      "review": "Hugh Grant was phenomenal in this. He made the story and convincingly sold his character in it. And to the story. Man what an interesting story. I was on and off the edge of my seat from the first 10 minutes in. The story does a wonderful job (Along with Hugh Grant) of convincing you that everything being said could be true or could be a crazy fantasy, much like religion itself sometimes feels. Ever next progression made me more and more interested to see what would happen next. Ending was a tad expected, but still had its twists and turns as the final act finished up."
    },
    {
      "rating": "5/5",
      "review": "A masterpiece in story-telling during a modern-day era when we quickly consume media, all at surface level, and with no nuance. \"Heretic\" has constructed a masterful screenplay with a world that is worth more than one revisit. As we follow our unhinged antagonist, Mr. Reed, we're taken on a ride of doubt, mystery and ultimate sacrifice in the name of faith and belief, and what those truly mean at the end of the day, religious connotation aside."
    },
    {
      "rating": "3.5/5",
      "review": "It’s a good watch. Shows how religion is just a scam."
    },
    {
      "rating": "3.5/5",
      "review": "Fun head trip albeit a little slow."
    },
    {
      "rating": "2/5",
      "review": "SUCH a WASTE of good direction, topic, and acting by Hugh Grant (Who has never been of my liking), wasted by a terrible plot development."
    },
    {
      "rating": "0.5/5",
      "review": "When I started watching this movie, I thought it had potential. However, I soon discovered that it is one of the worst movies I have ever seen. If I hadn't been watching with my 22 year old son (who also hated the movie but was committed to finishing it because we paid for it) I would have turned it off. DO NOT WASTE YOUR TIME! This movie is the WORST!"
    },
    {
      "rating": "4/5",
      "review": "Thought this was a really good film and Hugh Grant was brilliant in it."
    },
    {
      "rating": "4/5",
      "review": "Extremely well acted and designed, fyi if you don't pay very close attention to all the shots and dialogue and the design of the house, you're going to have to watch it again."
    },
    {
      "rating": "4/5",
      "review": "Excellent movie, great story, had me guessing until the end,.Highly suggest you watch it. All great performances by the main characters."
    },
    {
      "rating": "5/5",
      "review": "It was a really great movie and as someone who majors in Religious Studies it honestly touched on a lot of subjects that are investigated in philosophies of religion. It kept me on my toes and at times I didn’t know what to believe, overall a good horror movie and a great watch."
    },
    {
      "rating": "4/5",
      "review": "Great story at the beginning. Loved the way Hugh Grant played his caracter. The ending however felt rushed."
    },
    {
      "rating": "4.5/5",
      "review": "Stylish and disturbing and very well-acted, its ludicrous plot is disguised by the counter-intuitive casting of Hugh Grant, effortlessly teasing his young Mormon missionaries (Sophie Thatcher and Chloë East, both terrific) as he lures them deeper into the spider's web of his warped psyche. A fantastic first half unfortunately slips into an implausible second, but it's never less than engrossing: beautifully photographed and designed and well-directed."
    },
    {
      "rating": "5/5",
      "review": "Definitely a good Movie. Definitely recommend you watch it."
    },
    {
      "rating": "5/5",
      "review": "Wow, great movie! I love the cat-mouse thinking."
    },
    {
      "rating": "3/5",
      "review": "Heretic was ok. I would have liked it more if the movie had stayed in the metaphysical instead of veering off into thriller. I was enjoying The Man from Earth style dialogue. It would have been a better movie if it had teased a thriller while really being a metaphysical discussion of faith and religion instead of the other way around. I don’t recall ever seeing Hugh Grant in a role like this before. It was nice to see him get a chance to pursue a different kind of character (unless I’ve missed something he’s done). I watched the movie because I recently saw Sophie Thatcher in Companion. She is a promising young actress and I’m looking forward to her next project. Heretic is watchable, meaning I did not turn it off in the first 15 minutes like I do most of what spews out of the modern “entertainment” industry."
    },
    {
      "rating": "5/5",
      "review": "great acting and interesting story- I enjoyed watching and trying to figure where things were going."
    },
    {
      "rating": "2/5",
      "review": "This v movie initially gave me the impression that it would be better than it was. Instead it made the main antagonist out to be little more than a sadistic maniac who, at the end of the movie, abandoned his principles for prayer. A24 had a chance to make movie with a statement of real import, but instead chose the cop out. Hugh Grant was wasted on this. Do better.."
    },
    {
      "rating": "5/5",
      "review": "Spectacular movie. Hugh Grant has really come into his own with his best work being done now. I've always enjoyed his films to be honest but right now he's just spectacular and this is just another example of how great he is. It's A24 so you kinda know what you're in for- a bit off beat, bit different and what a breath of fresh air, what a change from the CGI circus that we can't seem to get away from. It's dialogue heavy but the dialogue is just spectacular- intriguing, interesting, thought provoking. I think I came into it thinking it's going to be a horror movie but it's more a psychological chiller. The characters are great, Hugh Grant's is just naughtily delicious. I don't want to say more as I don't want to give any spoilers. Needless to say the direction is fantastic, music is ace, scenery is superb. The whole thing is an absolute triumph. Slow burning but engaging every step of the way. Fantastic."
    },
    {
      "rating": "0.5/5",
      "review": "Firecracker, without the fire or crack."
    },
    {
      "rating": "0.5/5",
      "review": "The theme of religion was nicely explained in the movie, however, the rest of it was horrible. The first third of the movie was \"thrilling\", after that it's boring."
    },
    {
      "rating": "3.5/5",
      "review": "A very difficult movie, which thanks to a good script and the experience of Hugh Grant flies high for more than one hour. Why very difficult? Well it involves just 3 characters, inside a couple of rooms. The not-return point, (when in a killing movie, the goods discover the real intention of the bad) is far to arrive, because the two Sisters, despite scared, are intrigued by the way the Heretic challenges their beliefs and allow us to enjoy the progress of the film. The final is always the big issue for every thriller and a good script it’s not sufficient to achieve the four stars."
    },
    {
      "rating": "0.5/5",
      "review": "(Spoiler Alert!!) Not worth the watch. This entire movie was written to spread a false message. All set up to present Jesus as a fake, nothing more than a copy of old religions. They even referenced specific sources from the highly debunked zeitgeist documentary. The movie ends with the main character saying prayer doesn't work, even siting supoossed research on prayer not working. So essentially, the movie is about proving Jesus as fake and prayer not working 10/10 would not recommend."
    },
    {
      "rating": "2/5",
      "review": "Hugh Grant's latest venture into darker territory starts with promise but ultimately descends into conventional horror tropes, squandering its thought-provoking premise about faith and control. The film opens strongly, with Grant delivering a masterfully nuanced performance as Mr. Reed, a seemingly cordial host who invites two young Mormon missionaries into his home. Grant's ability to balance charm with underlying menace makes the setup entirely believable – we understand why these young women would accept his invitation despite their likely training to be cautious. The film's early moments hint at an intellectual exploration of religious belief, control, and manipulation. However, these philosophical threads are frustratingly superficial. Reed's initial arguments about the nature of faith and the relationships between different religions barely scratch the surface of what could have been a fascinating theological debate. Instead of developing these themes, the film pivots sharply into familiar horror territory. As the story progresses, Reed's character transformation proves particularly disappointing. He begins as a calculating and intelligent antagonist whose motivations, while disturbing, seem to stem from a coherent – if twisted – worldview about religion and control. However, this promising characterization gradually dissolves as he devolves into a more conventional horror movie villain, his actions becoming increasingly erratic and his underlying philosophy lost in favor of shock value. The film's second half relies heavily on the kind of elaborate traps and psychological games that have become standard fare in post-\"Saw\" horror. While competently executed, these sequences feel derivative and fail to advance the movie's more interesting ideas about faith, manipulation, and the human need for belief. The revelation about Reed's ultimate conclusion – that the desire to control others is the root of all religions – comes too late and feels disconnected from the preceding events. The movie's attempts to maintain ambiguity about the supernatural through the fake prophet sequence and the final butterfly scene feel more like narrative sleight-of-hand than meaningful commentary on faith and skepticism. These elements, while potentially intriguing, never quite cohere into a satisfying whole. What we're left with is a film that starts with the ingredients for a compelling examination of religion and control but opts instead for a more conventional path. While Grant's performance in the early scenes shows what might have been, the movie ultimately fails to capitalize on its potential, settling for familiar horror beats instead of the more challenging exploration it initially promises."
    },
    {
      "rating": "4.5/5",
      "review": "Briliant 10 of 10 za sve one koje gledaju film u jedan dah-apsolutno preporucujem"
    },
    {
      "rating": "4.5/5",
      "review": "This movie was so good, the suspense left me at the edge of my seat. Hugh was incredible. The calm but ruthless demeanor fits him well. This was a unique film & the whole cast did an amazing job. It really opens your eyes about religion & having faith. It also had some horror scenes that were really good."
    },
    {
      "rating": "5/5",
      "review": "Heretic ist eine interessante Diskussion um Glauben im Horror Gewand. Hugh Grant zieht alle Register seines Schauspielkönnens und treibt die beiden Mormoninnen immer tiefer in sein Spiel mit doppelten Boden. Selten war zuhören so Spannend, denn man möchte jederzeit wissen, wie es weiter geht. Vor allem ist der Film sehr lehrreich. Stichwort: Monopoly oder der Song \"Creep\", Generell ist es nichts neues, aber es macht Spass zu sehen, wie dem Zuschauer das serviert wird was Kino ist: Vom normalen Tageslicht und entsprechenden Alltag, wird ein Anklopfen an einer Tür, Schritt für Schritt ein Besuch in der Hölle. Beste Zeit für Pinkelpause: Wenn den Mädels der Blaubeerkuchen serviert wird. 1:00:45 für 2:55 Minuten Sehenswert."
    },
    {
      "rating": "3.5/5",
      "review": "Solid film, well acted by everyone especially Grant and Thatcher. Hugh Grant transitions into creepy psycho very well and Thatcher has huge screen presence so will obviously be big for the next decade. Hopefully she doesn't end up in a Marvel movie anytime soon."
    },
    {
      "rating": "4/5",
      "review": "Hugh grant is so good performing...."
    },
    {
      "rating": "2.5/5",
      "review": "Meh! It's ok. The colour grading creates a creepy mood but it's not frightening in the same way nor as well written as the classic 'hereditary' was. The narrative about religion is nothing really new. Feels contrived and the way it's all explained at the end is like they presumed that the mainstream audience they are targeting is dumb and can't think for themselves just like the message it portrays about religious belief. Both of the girls acting was very mediocre."
    },
    {
      "rating": "4.5/5",
      "review": "Great casting and acting! Amazing script… I was captivated from the start and thought the dialogue was brilliant. Best horror/thriller I’ve seen in a while. I was slightly disappointed by the end but not massively. I definitely recommend giving it a watch."
    },
    {
      "rating": "4.5/5",
      "review": "God, I love how Hugh has diversified in the last decade! Even when he was deranged AF and I hated him, I still laughed out loud because I knew how much fun he was having nailing this character. It was psychological religious warfare. I love that it didn’t treat mormons as tropes and that it provided a little world religions education, too."
    },
    {
      "rating": "5/5",
      "review": "Five stars doesn't seem to be enough. Ex-mormon here: for those who thought the movie moved too slowly, I get that the classic horror movie has the need to excite more quickly. For THIS movie, though ... there had to be so many basic elements laid deftly so that the audience could understand both the mormon aspect coined with the very visceral \"cornered\" aspect of the sister missionaries ... had the action come too swiftly confusion would have ensued. This movie did a lot of admirable things. It frankly honored the religion. I no longer adhere to the Mormon faith, but I spent so many years in it that I can see the good and the bad. \"Heretic\" was amazing in that aspect. It reflected the age of the sister missionaries, and their innocence juxtaposed with their intelligence. Very hard to do. Hugh Grant. Oh. My. Gosh. The man is a genius when it comes to playing a comical bad character. Couldn't have been more perfect. But I keep coming back to the missionaries. They played their characterizations BEAUTIFULLY. Grace and intelligence. It would have been so easy to have made the sister missionaries into caricatures, but the writers resisted that urge. These two actors did an amazing job. I have \"served\" with women missionaries just like this -- because they are slightly older than the male missionaries, they are more mature and tend to be some of the most intellectual members of the religion. A classic movie. I am not a horror movie fan, so I didn't enjoy the gore. But the slimy aspects of the film were outshined by the highly skilled storyline that quite frankly honored some aspects of Mormonism. I have read that the directors not only used two ex-mormons as the stars, but also talked with friends with mormon backgrounds who provided the meatier parts of the dialogue. This definitely added to the heft of the subject matter."
    },
    {
      "rating": "5/5",
      "review": "Philosophical Thriller / Psychological Drama This movie isn’t for everyone, but for me, it’s exactly what I was looking for. It’s deeply philosophical yet manages to be a gripping thriller at the same time. It really captures how complex the human mind can be over time, and honestly, it feels timeless. Every scene is packed with emotion, and you can tell that every expression, every little detail was carefully thought out. The way the actors work together, the direction, the cinematography—it’s everything a great film should be. I caught onto every little detail, quickly piecing things together and interpreting what the director and producer were trying to convey. Even the props, the colors, the visual choices—everything plays a role in expressing the film’s ideas. I can’t even imagine the amount of effort and energy it must’ve taken to bring this to life. And on top of all that, the philosophical depth is next-level—some of the best I’ve seen in any film. If you’re into philosophy or deep thinking, this is a must-watch."
    },
    {
      "rating": "4/5",
      "review": "Crazy good performances and very intense scenes make this a surprise hit. Even though it wasn't as scary as I'd thought it be hugh definitely deserved those award nominations for best actor. Tim Treakle"
    },
    {
      "rating": "4.5/5",
      "review": "Blown away. I was expecting a smart cat and mouse game but this has far more depth and thoughtfulness than I was expecting. There are many layers to Hughe’s role and what he has set up in the house. The dialogue on religion is sharp leads to a really satisfying conclusion."
    },
    {
      "rating": "1/5",
      "review": "I was excited to watch this. It started out great. Then it became an endless, arduous infliction of annoyance - watching two women silently shivering with fear (exciting for some audience members, but not I) for 30 minutes during the longest session of professional mansplaining I've ever experienced. I didn't even make it to them choosing a door because the prior scene was so infuriating and mind-numbing. How dare you waste that small portion of my life."
    },
    {
      "rating": "5/5",
      "review": "This movie is by far one of the best movies I've seen. It challenges all thinking. I've watched it 3 times now to see what other theories people were talking about. I clearly seen it one way, and still do. Amazing."
    },
    {
      "rating": "0.5/5",
      "review": "Boring. It's literally listening to an atheist complaining about religions, something you can find in any social media. Nothing new, basically. A waste of time and money. A24 sucks in making horrors. Only Americans have those type of houses, with a maze beneath. Reminds me of Barbarian. It's always the evil basement!"
    },
    {
      "rating": "4/5",
      "review": "This a movie that strikes a nice balance between all characters, with Hugh Grant delivering a commanding performance showcasing his ability to deliver lines in a familiar yet new way. A psychological thriller with a great script and many elements of nuance that is also quite well shot, especially for a 95% single location movie."
    },
    {
      "rating": "4.5/5",
      "review": "I loved this movie, although it moved a little slowly. This movie has a interesting plot devolpment, a religon based movie with a twist at the end. The one downside is it moves pretty slow."
    },
    {
      "rating": "0.5/5",
      "review": "I used to love Hugh Grant, before he turned into Ugh Gran-pa."
    },
    {
      "rating": "4.5/5",
      "review": "A cerebral yet creepy and exciting movie.!"
    },
    {
      "rating": "4/5",
      "review": "Wasn't bad....basically suggesting that anything can become believable under the right circumstances"
    },
    {
      "rating": "3/5",
      "review": "I really was expecting a lot out of this movie, with such a high review score I was hoping for something more than I got. It started off strongly , with great premise.Hugh Grant as always was brilliant , but the rambling dialogue became boring after awhile and I found myself losing interest. I was also expecting a huge scare or a shocking twist that left me aghast! But none of that came. It wasn’t bad, but then it wasn’t that good. The 3 mains do a solid acting job though."
    },
    {
      "rating": "3/5",
      "review": "Of course it all kind of amounts to nothing in the end but the journey is often fun. Grant is the secret sauce here and I kind of like that his character appears to be a sentient reddit atheist thread."
    },
    {
      "rating": "4.5/5",
      "review": "I really liked the movie. Didnt have any expectations, but I was surprised in a positive way. The Monopoly part could've been shorter but clarified the villain's motives for everybody in the back. Recommend watching."
    },
    {
      "rating": "2.5/5",
      "review": "Hugh Grant's performance is probably the most talked about aspect of the film. He is good, but playing against type only falsely elevates his performance in this case. I also think that the machinations of his character's motives, really only serve as subterfuge for the scripts shortcomings. It's a script that is simultaneously stimulating, engaging, poignant, funny, and yet sadly underdeveloped and unsophisticated all at once. The girls are great though, and thier stories, (particularly Paxton's) are thoughtful, and well measured. All in all, it's a mixed bag this one. It doesn't exactly miss, but nor does it really hit either."
    },
    {
      "rating": "4.5/5",
      "review": "Not gonna lie, I liked conversations more than a horror part."
    },
    {
      "rating": "4/5",
      "review": "Great performance from Hugh Grant. I’d give it an 82%"
    },
    {
      "rating": "2.5/5",
      "review": "An interesting premise dragged down by an uninspired ending. At least Hugh Grant, Sophie Thatcher and Chloe East offer some good performances."
    },
    {
      "rating": "4.5/5",
      "review": "Maybe I’m Biased towards this type of movie being a philosopher and a bit of a theologian…. I was rating this a 9.6. The only way this could have nipped to a 10 is if Hugh Grant was the leader of a powerful cult, but now he is retired and SPOILERS ALEET*** those peeps captured in cages actually WANTED to be there and were doing his every whim, not actually against there will there which I think clearly they were. But … that’s said I think and you have to be a particular type of person to fully enjoy this movie and I’m a bit of an odd ball like Huge Grants character in the movie I just don’t kidnap young girls and put them in the basement lol 😂 But his beliefs and how he feels about religion is very in line with my beliefs and I’m sure many others. Cracker of a movie from start to finish and Hugh knocks it out of the park proving he still has it. It’s a long way away from Nottingham this movie and I love it that Hugh Grant is finally playing a very twisted psychopathic character - he does that so well. In line with Hopkins and knocks James Macovoy off the psycho pedestal. Showing who really is the psycho daddy! Lol 😂 9.6/10 absolutely cracking movie."
    },
    {
      "rating": "4.5/5",
      "review": "One of the best and most interesting Horror movies I have ever seen. Hugh Grant's acting is just excellent in this. The dialogue and religious aspects that the movie characters discuss in very clever and interesting. The setting and atmosphere of the movie is unsettling and claustrophobic, which only adds to the overall sense of creepiness and tension. The movie had me hooked from start to finish. Best Horror of 2024."
    },
    {
      "rating": "4/5",
      "review": "Spectacular performance by Grant and overall a great movie as long as you ignore the plot holes at the end."
    },
    {
      "rating": "3/5",
      "review": "La historia comienza bien y va avanzando bien lentamente. Pero no termina atrapandote. En cada momento sientes que pasará algo que te va a sorprender y nomas no pasa! Y el final contradice todo lo que ya estabas viendo. Eso si, la fotografía es buena."
    },
    {
      "rating": "4/5",
      "review": "A suspenseful and twisted story - with Hugh Grant as its primary focus whose true intentions were slyly kept hidden. The film questions many aspects of religion, and only leaves the audience guessing at what Hugh Grant’s character is really intending to do convey/do here."
    },
    {
      "rating": "3/5",
      "review": "Two hours of crafty dialogue and slowly built-up tension only for the coup de grâce to be... wait for it... \"the only real God is man's love of power.\" Ehh."
    },
    {
      "rating": "2.5/5",
      "review": "Interesting enough to watch once I suppose. Reveal is a bit of a letdown and the movie is so dark you pretty much have to kill every light in your house when you watch it. Wife gave up 2/3 in simply because of that. If movies shot in very dimly lit settings grate on you........this one will drive you batshit."
    },
    {
      "rating": "4.5/5",
      "review": "I loved this film soooooo much !!! Highly recommend to humans !"
    },
    {
      "rating": "4/5",
      "review": "Very well done and dark. Great tension - build up. Good acting - keeps you on your seat’s edge. Ending pretty good, but somewhat under developed"
    },
    {
      "rating": "5/5",
      "review": "I love it!!! You must see!!"
    },
    {
      "rating": "0.5/5",
      "review": "Acting was brilliant but overall the storyline was slow and dragged out. It wasn’t thoroughly detailed and the ending was quick and extremely BORING SAVE YOUR TIME"
    },
    {
      "rating": "5/5",
      "review": "Tense, psychological thriller that was unsettling in the best of worst ways. This was indeed true horror to me, as I don't believe in ghosts but in the brutal soul crushing manipulation that man can bring upon others."
    },
    {
      "rating": "5/5",
      "review": "Brilliant work by Hugh Grant. He keeps the tension very tight in the movie from beginning to end. Almost making it uncomfortable to watch. Psychological thriller meets horror."
    },
    {
      "rating": "3/5",
      "review": "Kinda hoping they found demonic entity at the end of the tunnel, rather than some power-relation theory."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Great theological questions."
    },
    {
      "rating": "5/5",
      "review": "Grant is simply brilliant!!"
    },
    {
      "rating": "0.5/5",
      "review": "Sorry, I never liked any movies from Mr. Grant, which are extremely slow in motion and often against the common sense"
    },
    {
      "rating": "0.5/5",
      "review": "This was absolutely the worst movie I've ever watched; no coincidence that it was recommended by one of the most annoying people I've met. Hugh Grant putting on a weird northern accent was a very confusing moment. Maybe that writers strike needed to end in bloodshed."
    },
    {
      "rating": "2/5",
      "review": "The acting is decent. It lacks scares and the set up in the house was hard to suspend disbelief in."
    },
    {
      "rating": "4/5",
      "review": "Very engaging, tense, surprise ending."
    },
    {
      "rating": "5/5",
      "review": "One of the best movies of all time, really makes you think hard"
    },
    {
      "rating": "5/5",
      "review": "Oh yes! Pulled it off Mr Grant. Evil critic taking on a church of a man-made religion which is itself ‘evil’. Clever deep meaningful script. Bet it goes over the heads of most who ‘believe’ in supernatural hocus pocus. Time for more challenging of these seemingly ‘off limits’ cults."
    },
    {
      "rating": "3.5/5",
      "review": "A strong start for a horror film to lean into dialogue had me as excited as Hereditary did, but once the horror kicked, I began checking out. Stop with the creepy and just give Grant more lines to steal the show. As the nineteen mainstream religious film this year (lol) it does enough to stand out though."
    },
    {
      "rating": "5/5",
      "review": "A really great movie with a lot of thrills. Keeps you engrossed the entire time."
    },
    {
      "rating": "4/5",
      "review": "More of a “thinker” than a true horror movie, but certainly has some grotesque elements. Brilliant acting, so much so, that I, as a viewer, was incredibly uncomfortable being in the same room as Hugh Grant. If you are conflicted in your religious [or lack thereof] beliefs, this may not be the movie for you. Raised many questions around theology, felt somewhat unbiased after watching the entirety of the movie?"
    },
    {
      "rating": "1/5",
      "review": "Long and boring movie to dicuss believe or non believe with religions! Most of the movie filmed in darkness."
    },
    {
      "rating": "2.5/5",
      "review": "Once again, this is not a horror movie that was marketed as one. Seems to be a little full of itself and the whole premise loses appeal halfway through."
    },
    {
      "rating": "3.5/5",
      "review": "Its duration is short, the discussion between the characters is very long, but the level of tension is terrifying, a well-organized game of cat and mouse, Hugh Grant shines in a performance never seen before in his career, and of course if , Heretic is a very confusing film due to the religious narrative that leaves us with more doubts than answers, but it is a very good proposal for the genre that will let the audience believe or not believe in what they are seeing."
    },
    {
      "rating": "5/5",
      "review": "Solid acting by all the characters, keeps your attention at all times. Recommended!"
    },
    {
      "rating": "5/5",
      "review": "This film is messed up... but in such an intriguing way, it really taps in to human psychology and was visually very interesting."
    },
    {
      "rating": "4/5",
      "review": "As a horror movie, Heretic falls short, but Hugh Grant’s monologue and religious discourse are absolutely captivating. His performance sparked an unexpected interest in theology for me. I recommend watching it not for the scares, but as a critique of religion and Freemasonry—an aspect that makes it truly fascinating."
    },
    {
      "rating": "4.5/5",
      "review": "An amazing screenplay which raises a lot of doubts and questions on our belief. The directors touch is incredible and the performances are some of the best from 2024"
    },
    {
      "rating": "4.5/5",
      "review": "The popular opinion is that Hugh Grant carried this movie. I would say that Hugh had the right role and the right costars to play off of. I went in blind and I had the better experience for it."
    },
    {
      "rating": "5/5",
      "review": "Thought provoking and brilliantly acted by Hugh Grant!"
    },
    {
      "rating": "4.5/5",
      "review": "Excellent film! I was on the edge of my set the whole time!"
    },
    {
      "rating": "3.5/5",
      "review": "When i heard this movie was incredibly good, and a masterpiece, i went into it expecting so much more than what i ended up getting. Don't get me wrong, it's still decent. Even if for half of the movie or more, it's just 3 people in a room, talking, the conversation is tense and interesting enough to keep you engaged. But then, the third act roles out... it looked like i was watching 2 different movies, and the writers had ran out of ideas; it just turned into the generic horror/thriller. Hugh Grant's performance was really, really good tho. It was very creepy and filled with all sorts of menacing tension, because he wasn't your typical agressive villain. The fact that he is so polite and articulate all the way through (his accent also helps here), it makes him that much more intimidating, because you know something about him is evil, but you never know how he will display that. All in all, i still enjoyed it. That third act was the opportunity for them to really make a statement, and sadly, they did try, but failed, in my opinion. I still recommend it. It is not a bad movie at all. It was well done enough. Maybe i should have not watched reviews for it, before watching it myself."
    },
    {
      "rating": "2.5/5",
      "review": "I thought it was okay. Good acting."
    },
    {
      "rating": "5/5",
      "review": "Incredible film. The acting, the writing and the slight details makes this film a 5/5. And it’s a beautiful and educational movie on a deeper level. Go see it without any prejudice!"
    },
    {
      "rating": "4/5",
      "review": "Hugh Grant's recent foray into villainy continues to delight—and terrify—in this spellbinding movie that masterfully combines suspense with religious commentary. The film’s premise hooks you from the start: a charismatic but deeply sinister antagonist weaves a web of intellectual curiosity and fear. Grant delivers an electrifying performance, oozing charm and malice in equal measure. The movie builds tension expertly, layering mystery and horror as it exposes the characters' vulnerabilities. Each twist keeps you guessing, while the chilling atmosphere lingers long after the credits roll. Yet, for all its brilliance, the final act falters under its own ambition. The sight of six young girls locked in cages raises more questions than answers, leaving viewers scratching their heads about how the villain was able to captivate so many women without the community being alarmed. How could he move bodies so fast? These are minor missteps in an otherwise captivating narrative that is as intellectually stimulating as it is frightening. If you're looking for a film that thrills and teaches (religion and board games!) in equal measure, this one is a must-watch. Just prepare for a few loose ends in an otherwise tightly-woven tale. Rating: 8/10 – A dark, daring journey into the abyss of human greed and faith, led by a villain you’ll love to hate."
    },
    {
      "rating": "5/5",
      "review": "I thought it was incredible!"
    },
    {
      "rating": "1/5",
      "review": "Genuinely annoying movie to watch. Scenes of girls interacting with Mr. Reed gunienly pissed me off. The fact that thorught the movie we see all three of them are very inteligent and perceptive they fail to communicate in that way when it comes to important moments in the first half of the movie. The ending leaves much dissapointment, missed on an oportunity for a realistic ending."
    },
    {
      "rating": "3.5/5",
      "review": "Heretic (2024) is a spine-chilling horror film that follows two Mormon missionaries as they encounter a man with unsettling secrets. Hugh Grant delivers a hauntingly sinister performance as the creepy antagonist, a stark departure from his usual roles. The film has sparked mixed reviews—some critics applaud Grant’s chilling portrayal and the eerie atmosphere, while others find its pacing uneven. With its blend of psychological horror and theological undertones, Heretic promises an unsettling experience. Ready to be scared? Stream it now on Apple TV. It's honestly worth a watch, I turned it on and it grabbed my attention right away sorta like the phone booth movie. Lead actor does a great job overall being weird and creepy! Gets a bit weird towards the back end by design, solid movie overall."
    },
    {
      "rating": "3.5/5",
      "review": "It started out, and was very interesting for a large part of the movie.....really, up to the part when the 2 girls are shown what's behind the door. From that point on, it went downhill, and became a disappointing let down. I REALLY wish this film had a better last third."
    },
    {
      "rating": "5/5",
      "review": "masterpiece of MINDFUCK This film is a total mind-bender! It challenges your expectations and keeps you guessing. The storytelling is precise, and the suspense is exceptional. It raises the bar for the mystery genre, delivering a new level of intrigue. I totally get why everyone calls it mind-blowing!"
    },
    {
      "rating": "5/5",
      "review": "I loved this film! Religious debates are something that really interest me, and everyone, espacially the very religious should always question their beliefs. I think this film could be very educational for some people. Which doesn´t mean its boring. Oh no! This is a very exciting film...and the villain really gives it his all. But I also liked the heroes despite our differences in outlook. They just seemed so human. Many have said, the first, more debate heavy part of the movie is the best, but I think the tension is high throughout. Definately check this one out. I would rank it with top Horror movies like Nosferatu, or the bit older Hereditary."
    },
    {
      "rating": "4/5",
      "review": "A great synopsis of what happens when crazy religious beliefs mixes with religiously brain-washed young adults."
    },
    {
      "rating": "5/5",
      "review": "Absolutely mind-blowing! Put me at the edge of my seat, a single setting made so much of a ride. Heretic, for me, has set the bar high."
    },
    {
      "rating": "4.5/5",
      "review": "Damn good movie! The start is really dialogue based and kinda slow. But the way they acted in this part is amazing. The movie contains only 3 persons, but all acted very good! Hugh grand super creapy and yet still funny. The second half of the movie is where the real horror starts, and this to is really well executed. Not jumpscare based but just a psychological horror that will make you think about what you could and couldn't believe. The ending is kinda open so the viewer can decide how they interpret it by the way you think. Overall a good creapy thought through movie, but to me the first half could have been a little bit faster."
    },
    {
      "rating": "3/5",
      "review": "All good until the writers clearly run out of ideas and chose the easiest, boring and banal way to finish the movie."
    },
    {
      "rating": "5/5",
      "review": "Absolutely one of the most thrilling movies I’ve watched in recent times. Indeed the one true religion is control"
    },
    {
      "rating": "3.5/5",
      "review": "Hugh is a trippy fanatic that traps two mormon girls in a game of religious chess. The whole thing is built on dialogue and detail, and builds well until the end."
    },
    {
      "rating": "4.5/5",
      "review": "From beginning to end, the drama keeps you wondering what the next outcome will be, which makes for a well-made and attractive film for lovers of this genre."
    },
    {
      "rating": "2/5",
      "review": "Not as thought provoking as it wants to be. Really only left debating 1 of 2 endings."
    },
    {
      "rating": "3/5",
      "review": "Makes you question about world religions and what you believe. Not recommended for all unless you are open minded."
    },
    {
      "rating": "3/5",
      "review": "It's kind of boring. The storyline moves too slow"
    },
    {
      "rating": "2.5/5",
      "review": "The movie was mediocre. But the plot and dialogues were good. I especially liked Hugh Grant's acting. I hated the ending, I wish they had ended it with a scene where they prayed together."
    },
    {
      "rating": "4.5/5",
      "review": "Superb film, acting was great and the story was engaging."
    },
    {
      "rating": "4.5/5",
      "review": "Compelling and well acted"
    },
    {
      "rating": "0.5/5",
      "review": "Absolute trash. Holy cow what a mess. Pseudo-intellectual bs per usual from Hollywood. God is good, and Jesus is King. Your movie questioning faith will do no good in this world. What a crude movie with an awful ending."
    },
    {
      "rating": "5/5",
      "review": "Best movie I've seen in years! Engaged from start to finish. Flawless acting performances throughout. Layers and layers of metaphors and symbolism. Just incredible."
    },
    {
      "rating": "2/5",
      "review": "I only watched this to see how Hugh Grant would fair outside of a rom-com. In that regard, it was a success. Unfortunately, the movie itself was awful."
    },
    {
      "rating": "3.5/5",
      "review": "Amazing thriller that has you guessing what the actual ending will be, if there will be a supernatural element after all or not. Directing and acting were all good too, hard to come by these days."
    },
    {
      "rating": "4/5",
      "review": "Great performance by Grant."
    },
    {
      "rating": "3.5/5",
      "review": "The premise of two young Mormon missionaries trying to convert a man to their religion. However, he flips the table and tries to shake their faith instead, which is intriguing stuff. The first act is great, with all the tension and Hugh Grant's phenomenally unsettling performance. He is a stand-out here and it is great to see him in a role that is completely different from his norm. The second act with the philosophical debate is genuinely very thought-provoking. Unfortunately, the movie doesn't stick the landing and the final act is kind of underwhelming. Nevertheless, I enjoyed this a lot, and I always love it when people do something different with the horror genre."
    },
    {
      "rating": "4/5",
      "review": "Solid acting on all accounts, definitely a suspenseful thriller than horror and not at all scary. This is a movie of the mind, and it's well made. You'll be missing out if you pass on it."
    },
    {
      "rating": "4.5/5",
      "review": "You can't strictly say that 'Heretic' is a horror movie. It's way too unconventional and extensive to be called so. It goes deeper than just flesh spilling out after you open some door. The main point of this movie is not to scare us, but to question if we really believe?. Religion is a core part of horror movies; it always has been, but it's typically employed to depict something wicked and ominous. Unlike those movies, I personally think that Heretic used religion in a sadistic but better manner. I know Hugh Grant from playing in romantic comedies or period dramas. I believe I saw nearly all of his films when I was ten years old, because my mom is a huge fan of him. Seeing Hugh in a horror movie was truly refreshing, and the thing that affected me the most is what a great job he did. He made the long monologues seem not so long and engaging. Most importantly, he creeped me out so bad. His facial expressions and manipulative behavior truly did the job, and he delivered an impeccable performance. Overall, the film was very captivating and enjoyable, so I really hope it gets some recognition at this year's Oscars."
    },
    {
      "rating": "4.5/5",
      "review": "Thought-provoking and helmed by a show-stealing performance from Hugh Grant, Heretic delivers a truly original, and at times legitimately frightening, horror tale."
    },
    {
      "rating": "5/5",
      "review": "Thought provoking with psychological horror elements that keep you on the edge. A fitting ending with a great message. Something in it for both believers and non-believers."
    },
    {
      "rating": "5/5",
      "review": "The movie seems a bit inconsistent and bumpy the first time you watch it, but also exciting. If you know the ending and what it's all about, then you should watch the movie again to understand the deeper level. To see what lurks behind all the distractions and magic tricks. Look closely, the movie tells us in the credits as the title is faded in again, indistinct and blurred. Pay attention to the miniature character that is placed outside the front door of the miniature house. What is the filmmaker trying to tell us? What is important about what we see? And what is just smoke and mirrors? The movie gets better the more you watch it and is sure to become a cult classic."
    },
    {
      "rating": "3.5/5",
      "review": "Thoroughly robust and satisfyingly astute without being too esoteric. Horror title fits quite loosely around this, but isn't absent altogether. Everyone is in their A game, despite some minor flaws in the flow of it. Feel the conclusion wasn't adequately summised though."
    },
    {
      "rating": "4/5",
      "review": "*australian accent* wow that was great But fr tho.. this movie had me thinking it was going one way then went the complete opposite in the best way. Incredible twist. New twist on an old theme"
    },
    {
      "rating": "4/5",
      "review": "Heretic is a dialogue driven psychological thriller (more than horror in my opinion) that delves into themes of faith and religion. Hugh Grant delivers an unsettling performance as the villain. It’s a compelling story that keeps you guessing with a thought provoking ending. It’s one of those films that you need to give your full attention if you decide to see it."
    },
    {
      "rating": "5/5",
      "review": "Refreshingly new and unique. A must see"
    },
    {
      "rating": "5/5",
      "review": "An extremely powerful and intense film. Violent, oppressive, tautly acted yet with moments of very dark humour. Hugh Grant is a revelation, some of the scenes are etched in the memory. It has characters you believe in, great music and clever twists and turns. Shivers down the spine, terror, revulsion and impending doom. Forget the Hollywood block busters, see this film instead."
    },
    {
      "rating": "4/5",
      "review": "Hello, Are you familiar with The Church of Jesus Christ of Latter-day Saints? A question that two Missionaries Sister Barnes (Sophie Thatcher) and Sister Paxton (Chloe East) cautiously ask Mr Reed (Hugh Grant) in this psychological thriller directed marvelously by Scott Beck and Bryan Woods. Mr Reed is just seeking answers when it comes to faith trying to decide what the one true religion is. This film has all of the elements for a terrifying experience. A creepy old house, a thunderstorm, and that feeling something isn't quite right. Hugh Grant lately has been dipping his toes in the world of being a villain and less being a love interest. All i can say is Bravo Mr Grant as his performance is incredible. Charming, yet frightening at a moments notice. But Sophie's and Chloe's performance rise to the occasion as well. For those that don't care for all the over the top slasher films but like being cuddling up on the couch with plenty of scares to get the old heart a racing then this is for you."
    },
    {
      "rating": "3.5/5",
      "review": "Heretic is a brilliant horror film. Hugh grant was awesome. Probably my only criticisms is the gore and the final escape. Besides that, it's really good. Deserves a 78%"
    },
    {
      "rating": "4.5/5",
      "review": "Fantastic rainy night, or snowy night flick. I will say that the first 40 minutes are perfect, and I was a little worried that the movie wouldn't carry that insanely electric momentum going, and it sort of didn't, but I still found the entire movie to be so god damn good ;) the conversations in this movie are a massive reason of why I love movies. Great performers with excellently written dialogue, directed beautifully, just going hard in the paint with words, intense conversation, conversation which makes you think, conversation which makes you understand different perspectives, conversation which gives you new ideas. That's what I loved the most about the movie, and it fades away slightly toward the end, but still keeps the intrigue going. Thank you!!"
    },
    {
      "rating": "3/5",
      "review": "I was really hooked on the first half of the movie, but then the second half was disappointing."
    },
    {
      "rating": "4/5",
      "review": "I love Hugh Grant and seeing him as a villain is amazing."
    },
    {
      "rating": "5/5",
      "review": "A masterfully crafted film that invites viewers to explore alternative perspectives, revealing profound insights hidden beneath its surface. If you grasp the underlying message, it opens up a world of understanding that challenges conventional viewpoints."
    },
    {
      "rating": "5/5",
      "review": "A great horror film that is one of the best."
    },
    {
      "rating": "4.5/5",
      "review": "Hugh Grant did excellently in this role. Slow start but suspension looms. Definitely worth a watch."
    },
    {
      "rating": "5/5",
      "review": "Sister B nailed it, and Sister P was magical 😉"
    },
    {
      "rating": "5/5",
      "review": "It was a great thriller. The movie has you on the edge of your seat. Grant is fantastic and his nice guy demeanor will have you guessing the entire movie. Great movie all around, including the ending. 100% recommend a watch."
    },
    {
      "rating": "1/5",
      "review": ". Acting by Hugh Grant of course is great But don't waste your money. The story goes from ridiculous to absurd."
    },
    {
      "rating": "3/5",
      "review": "Heretic has a ton of build up amongst the two sisters and hugh grant. I found the beginning of the film to be wonderful, but it dropped of majorly at the end. I thought this had a chance to blow minds and turn into a different film entirely, but seeing him be some psychopath trapping women wasn't the best route to go in my opinion. The religious undertones and secrets that were alluded to had serious depth and promise, but the film could've used another 30-45 minutes to dive deeper into the chamber or whatever tests were being done. This felt like the first 50% of the film was different than the last, and it really disappointed by the end. I enjoyed watching it but a24 would've done much better"
    },
    {
      "rating": "4.5/5",
      "review": "Near perfect and you could find some distinctive characters throughout the plot. Grant does the magic as usual and the rest as well."
    },
    {
      "rating": "5/5",
      "review": "I am a Christian, and I love this movie!!! I love Hugh!! He did an excellent job!! I want to see more of him in 2025!! This movie will make you think heavily about who is in control of your beliefs. After the movie, I still believed in Jesus, but I was surprised to learn the word iteration. I very much appreciated this movie, and YES, it was intense and definitely a Horror Film!!"
    },
    {
      "rating": "5/5",
      "review": "Heretic is one of those low budget horror movies that are great because of the low budget, it doesn't have a lot of gore or violence, but doesn't need it. Heretic is scary because you know it could happen to anyone, it could be happening next door or to someone you know right now. Watch it, if nothing else for Hugh Grant's Mr Reed"
    },
    {
      "rating": "5/5",
      "review": "I cried at the end of the movie this movie made me realize how beautiful is to belief in a religion no matter what other people say about religion at the end is something beautiful we do as humans."
    },
    {
      "rating": "4.5/5",
      "review": "Driven by its exquisite acting and strong dialogue, the movie uses all the talk about different approaches to (correct) religion as the foundation to your view on life, but never forgets to build up enough tension as a horror movie. The beautiful cinematography also uses every angle of the tight spaces it's working within."
    },
    {
      "rating": "4/5",
      "review": "Without Hugh Grant's performance, this may have been an average flick but it's good enough to carry the plot into something I found very interesting."
    },
    {
      "rating": "5/5",
      "review": "Mindblowing! Religion is one if my favourite topic it is always brings up interesting conversations, hence I really loved this movie. Hugh Grant was great in this movie, his monolouges were on fire."
    },
    {
      "rating": "4/5",
      "review": "Come for the performance of Hugh Grant, stay for his likening of Mormonism to Monopoly."
    },
    {
      "rating": "2.5/5",
      "review": "Hugh Grant is a good actor but he does not come off as a psycho murderer. The script was okay, but don't expect much. Basically the entire movie is inside a house. And they talk about how religions are created etc., not totally exciting material."
    },
    {
      "rating": "4.5/5",
      "review": "Visually stunning, with thought provoking themes and excellent performances from the 3 core actors, this movie does not disappoint. The ending of the movie is perhaps ill-thought out, and there is irony in ending a movie about religious “CONTROL” with a deus ex machina… but this did not take away from an excellent, thrilling, and intriguing movie experience."
    },
    {
      "rating": "3/5",
      "review": "Didn’t love this. This is not a psychological thriller. It is a frank horror film."
    },
    {
      "rating": "4.5/5",
      "review": "Might be my film of the year. Phenomenal work from Hugh Grant and a razor sharp script and premise. Love this movie."
    },
    {
      "rating": "4/5",
      "review": "Haunting performances by the whole cast make this a tension-filled spectacle. It's subtle and confusing at times, however it does lack the philosophical deepness it was hoping to achieve."
    },
    {
      "rating": "3.5/5",
      "review": "Hugh Grant equals English charm in the creepiest of ways."
    },
    {
      "rating": "3.5/5",
      "review": "Had potential to end up really good but didn't quite land that. Definitely not bad, but at the same time not really as much there as I had hoped."
    },
    {
      "rating": "0.5/5",
      "review": "It's a movie about three people arguing religion for 2 hours it's one of the most boring movies I've ever seen. It was not thought provoking at all it just told me a bunch of stuff i already knew about religion. The villan felt like an edgy teenage atheist wrote it. Btw im not a religious person and it managed to still piss me off because it just drags this movie could've easily been 1:20. Hugh grant and the cinematographer were the only good things about this. F*ck this movie."
    },
    {
      "rating": "4.5/5",
      "review": "Watch this movie, if for nothing else, then just for the superb acting."
    },
    {
      "rating": "4.5/5",
      "review": "If you're super religious, you probably will not like this. However, I thought it was really well done and does make you really think about how religion is and you're personal beliefs. Creepy and a fantastic performance for Hugh Grant in his first Horror outing. Well done."
    },
    {
      "rating": "1/5",
      "review": "I got quickly very much annoyed by its pretentions screenplay. Rolled my eyes all the way through the middle until I just couldn't stand it and clicked X."
    },
    {
      "rating": "4.5/5",
      "review": "Amazing soundtrack, solid plot, some “funny” moments but intense and incredible scenery, captivating dialogue with some huzz included"
    },
    {
      "rating": "4.5/5",
      "review": "Powerful movie. Well written, executed and beautifully performed by amazing actors"
    },
    {
      "rating": "3.5/5",
      "review": "something finally very different. A lot of fun to watch. Got its slow moments but has a great twist. A good late night flick."
    },
    {
      "rating": "3.5/5",
      "review": "Direção: Bom Atuação: Bom Roteiro: Ok Caracterização: Ok Soundtrack: Ok"
    },
    {
      "rating": "5/5",
      "review": "To be honest.. this was not a movie I had any intention of watching. It happened to be on tho. So huge grant being the actor that he is ! That says everything you need to know. Yes the story line is quite boring and technically some factual information was not well interpreted or placed correctly into the narrative. With that being said it was definitely an interesting yet thrilling movie that I am glad that I did watch."
    },
    {
      "rating": "3/5",
      "review": "Hugh Grant shines as the thoughtful villain raising uncomfortable questions about the nature of belief and religion. The tension ramps up well but it seems they wrote themselves into a bit of a corner and the ending fizzles a bit."
    },
    {
      "rating": "4/5",
      "review": "Hugh Grant was brilliant. Great film."
    },
    {
      "rating": "5/5",
      "review": "So nice to see Hugh Grant portraying more antagonistic roles. It is one of the best performances of his career! \"Heretic\" explores the nucleus of religious belief in a slick, charming, and thrilling way."
    },
    {
      "rating": "5/5",
      "review": "This has to be the best A24 movie released of 2024. Not quite like any horror movie I've seen. I enjoyed how cerebral it was a psychological thriller to say the least. It was intense, the women acting had an eerie vibe and to top it off the psychological religious aspect of it was quite interesting- really gets you to think. Grants acting was phenomenal he plays an evil yet calm and patient psychopath. When the movie first started I expected it to be a slow burn. You cant predict whats going to happen and that's the thrilling aspect of the movie I enjoyed. Very creative and well thought out. I really enjoyed this movie, if you haven't watched it yet check it out."
    },
    {
      "rating": "5/5",
      "review": "La película me impresionó por su enfoque unico sobre la duda y la fe, enseñando a cuestionar lo que realmente creemos y como enfrentamos nuestras propias creencias, y haciendome dudar durante la peli a cuestionar sobre lo que realmente significa creer y dudar, incluso cuando algo o las respuestas que podemos llegar a tener parecen no muy seguro o dificil de poder llegar a creer o poder aceptar. Luego también esta muy bien porque no es que te de una chapa de dios, es muchisimos temas de religiones,los planteamientos de ser religioso o ateista, en resumen una película que mucha gente puede decir que es una masa de datos rapidos, o se les pueden hacer incluso pesada, pero para mi perfecta con sus dos perspectivas: fé o duda"
    },
    {
      "rating": "5/5",
      "review": "Hugh Grant’s performance as the insidious “nice man” Mr. Reed, who in the early half of the film just barely obfuscates his true intentions under a thin veneer of charming host, is insanely good. For the first act he evokes retired, eccentric, reclusive college-professor vibes with an off-beat sense of humor and no social skills whilst simultaneously offering his guests blueberry pie, cokes, and “dad” lectures. Watching his character devolve further and further into pure unadulterated evil is fascinating and horrifying. He makes the character believable with his bland banality and checkered vests, which is what makes him so terrifying. Suspenseful and plot twists kept me enthralled. 10/10."
    },
    {
      "rating": "5/5",
      "review": "First movie I watch this year and I absolutely loved it! Great script, direction, cinematography and performances. Very interesting conversations about religion. Not for everyone, but I definitely recommend it."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Very good acting and a good story line which kept you guessing. It was nice to actually see a movie where i didn’t know what was going to happen next and that was completely different to all the other horror movies! Highly recommend!"
    },
    {
      "rating": "3.5/5",
      "review": "Although it gets boring at some point, it is still interesring."
    },
    {
      "rating": "5/5",
      "review": "I thought the acting and direction made this movie. I enjoyed the slow burn. I didn’t look at this with the seriousness of a well thought out philosophical take on religion. There are much better sources for that. I enjoyed this for what it was, cerebral horror/psychological thriller. The intensity and the quiet evilness of Grant along with very good acting by the two women really was eerie and kept me engaged. I love all kinds of horror and psychological thrillers. I went into this with the expectation that it was going to be a very slow burn, but with nothing else and I thoroughly enjoyed it."
    },
    {
      "rating": "1/5",
      "review": "Mr. Hugh Grant is the emperor of -over-acting which consists of frowning and making bizzare faces helped by his many lines and wrinkles. While barely bearable in his long-distant youth in his dotage he is perfecly unbearable. However, the Anglo-Saxon coterie in Hollywood is in awe of him. The film is tiresome and boring and actor's many close-ups do not help."
    },
    {
      "rating": "2.5/5",
      "review": "The acting of Grant was exceptional, but the plot just falls apart. It's too psychological and is tiring."
    },
    {
      "rating": "4.5/5",
      "review": "The ending is left up to interpretation. Not so much thriller but suspenseful. Very enjoyable w/ no jump scares."
    },
    {
      "rating": "5/5",
      "review": "This marks my first film review of 2025. As part of my New Year's resolution, I have committed to rating and reviewing films, given my frequent engagement with cinema. Initially, it is important to acknowledge that Hugh Grant has featured in a range of roles outside of romantic comedies prior to taking on one of the leading roles in this horror film. It was refreshing to witness his departure from his typical romantic comedy persona; in fact, I believe this performance may rank among his best. The two lead actresses also delivered commendable performances that significantly contributed to the film's impact. This film left a lasting impression on me, provoking deep thought that I prefer not to disclose in order to avoid spoiling the experience for potential viewers. As a dedicated fan of the horror genre, I can confidently assert that this film is among my top five horror films of 2024. Its intriguing narrative not only challenged my expectations but also exhibited a uniqueness that is often lacking in contemporary horror cinema—eschewing predictability and presenting a storyline that feels refreshingly original."
    },
    {
      "rating": "0.5/5",
      "review": "Interesting theme ruined by rotten storyline and idiotic antics that have no bearing . Waste of time"
    },
    {
      "rating": "5/5",
      "review": "Great performance from Hugh , intellectual review of religions and beliefs , reminds me of deep and heated conversations in Two Popes , a must watch !"
    },
    {
      "rating": "5/5",
      "review": "I cannot believe this isn’t at 100%. This movie is so good!!! A24 Hit the bull’s-eye with this one and I cannot say enough how much I love this movie! I hope everyone watches!! I absolutely loved Hugh Grants Performance"
    },
    {
      "rating": "5/5",
      "review": "An excelente psychological thriller around religion and it states very clearly that fanaticism can come from any source. Must-See!"
    },
    {
      "rating": "0.5/5",
      "review": "Nothing about the plot of Heretic is remotely brilliant. The idea that churches and religion were created as instruments of control isn’t a groundbreaking revelation—it’s been widely discussed for centuries. Yet, the film spends its runtime delivering these tired ideas as if they were profound secrets unearthed for the first time. The script desperately tries to appear intelligent, line after line, but instead proves the exact opposite. Its endless monologues feel like an exercise in self-indulgence rather than storytelling. And the glowing reviews? It’s hard not to see this as yet another example of A24’s strategy: pandering to critics with shallow philosophy and artsy aesthetics while pretending it’s groundbreaking. Critics acting like this film is tackling “new” ideas only reinforce how much fluff gets mistaken for genius. Let’s be real—there’s nothing bold or innovative about rehashing what’s been said for centuries."
    },
    {
      "rating": "4.5/5",
      "review": "A last minute contender for one of the best horror movies of the year. Hugh Grant is great and the writing is superb."
    },
    {
      "rating": "4/5",
      "review": "Super solid -- this movie does what most do not, and that is explain what is going on in entirety. I loved everything about this movie and it's complexity, but at times I just felt like the plot was rushed. Character development out of no where, perhaps for the sake of film time, but a really good movie nonetheless."
    },
    {
      "rating": "1/5",
      "review": "A rather boring movie. I was very disappointed. The philosophy was very thin and not very thought provoking."
    },
    {
      "rating": "3.5/5",
      "review": "On my first watch, I was much more forgiving...The second time around, my opinion of this film has changed. The first act of the movie is almost perfect; great suspense, pacing of the script, setting the table for what's to come. I always love a good philosophical discussion, and while the dialogue may have gotten a bit long-winded (don't we all?), it seemed like it was written by a university-level professor of theology. However, as the film progressed, it only got messier and more aimless. This seems to be a common pattern among horror movies, especially nowadays, but I was disappointed because this one had such a strong, original start. Still quite entertaining, and Hugh Grant definitely expanded his repertoire with this one, but it seemed like the writers lost the plot. Literally."
    },
    {
      "rating": "5/5",
      "review": "Superb, highly original horror film. The film is suspenseful throughout. It's exploration of theological and philosophical themes is not something you see very often in films of any genre. Hugh Grant is terrific."
    },
    {
      "rating": "2.5/5",
      "review": "A cerebral horror movie that is very good at building tension. Hugh Grants acting was some of the best I've seen in years. However, I'm ideologically opposed to the final message at the end of the movie. This could have been the beliefs of the director or producers...who really knows?"
    },
    {
      "rating": "3.5/5",
      "review": "Hugh Grant breaking out of his mould and playing a real villain, subtle, intense fascinating dialogue and theology based premise. Enjoyable."
    },
    {
      "rating": "5/5",
      "review": "I watched this movie with no background information, other than that it was a horror film, and I ended up crying. It's hard to find horror movies with strong storylines and well-developed characters, and this one is the kind that stays with you long after the credits roll."
    },
    {
      "rating": "5/5",
      "review": "In my opinion, the movie contains an important message and deals with many philosophical questions about religion. Nevertheless, the story lives from a subtle, suspenseful horror. The intelligent camera work and narrative tricks keep you on the edge of your seat and questioning what will happen next. Highly recommended and thought-provoking. We continued to philosophize for hours after watching it. Great work!"
    },
    {
      "rating": "4/5",
      "review": "Hugh grant gives the best performance of his career in this study into is there a god or not movie."
    },
    {
      "rating": "5/5",
      "review": "The exploration of religious doctrine and what It actually means in this movie is great. It forces you to look inside at what religion actually is. this movie is very creepy and the acting is fantastic."
    },
    {
      "rating": "4/5",
      "review": "Like DEVIL it shows what a cracking script, good direction and quality acting can do in a small space."
    },
    {
      "rating": "4.5/5",
      "review": "Enormous fun! A religious/philosophical discourse, weaved around a self-aware horror genre, replete with dark humour and Hugh Grant's perfect performance. The two girls were great too. The opening monologue is worth the price of admission alone."
    },
    {
      "rating": "4/5",
      "review": "This movie held my attention throughout. If you know nothing about different religions then you won't appreciate it. However, I think that Atheists and agnostics will. If you have a closed mind in a faith then you might be offended. The acting and script is very good, which is just as well because it is a low budget movie, but it just might become a cult movie."
    },
    {
      "rating": "4/5",
      "review": "Hugh Grants acting is what made this movie. The ending could have been better though."
    },
    {
      "rating": "5/5",
      "review": "This has to be one of the best movies watched in a while. Hugh Grant delivered a phenomenal performance against a backdrop of a macabre setting. The basic premise is two Mormon women trying to convert neighbors in which they're invited in to Grant's home to talk about religion. As things develop, what ensues take on a scary and ominous tone. Aside from the creepy home he lives in, it's chock full of secrets. Very seldom does a film leave me philosophizing. Whether you're an atheist or religious zealot, this film raises some interesting questions about religion and life without causing the viewer to be turned off, because it woven deeply into the creepiness and scariness of the film."
    },
    {
      "rating": "5/5",
      "review": "engaging and nice. Hugh grant is great in here. nice watch"
    },
    {
      "rating": "5/5",
      "review": "Not a typical horror movie. Heretic does have horror/psychothriller elements, however the more interesting part about this movie is its philosophical questioning of religious beliefs. What do we believe in and why is the main motive and inspires reflecting on those topics. Hugh Grant, known for romcoms, does show his comedic acting skills. This reduces the scariness of the movie."
    },
    {
      "rating": "4/5",
      "review": "Lacks the gruesomeness of a slasher movie and plays more religious themes of indecision. The religious tension is increased as Hugh Grant's character becomes more sinister. However there are many references to historic religious beliefs and the film plays on the 'how strong is your faith' ultimate question"
    },
    {
      "rating": "4.5/5",
      "review": "When you watch films like Heretic, its hard not to think about how many truly incredible and iconic villain performances we could have gotten from Hugh Grant if he’d spent more of his career going down this path. The film itself is a cat and mouse game of wills, a battle of opposing beliefs, dissecting the past and trying to find the truth, if it even exists, in stories passed down through the generations. What’s so great about the debate at is its centre is its far from one sided. Its not focused on religious bashing, nor on proselytising. Both sides are given the chance to put forward their case, and you start to realise that neither is strictly right about what they’re saying, as any truth we present is inevitably tinged by our own experiences and points of view. With very few locations and only a handful of actors, its a testament to the power of a great script and talented performers. The 2 Mormon missionaries are not presented as carbon copies of each other but as 2 completely different people who simply share the same core beliefs. It’s refreshing to see a horror film where events aren’t propelled through character stupidity. Here the protagonists make relatively smart decisions, but the villain just happens to be one step ahead of them whenever they do. It’s creepy, tense, atmospheric, and brings up enough question and quandaries that inspire conversation on both sides of the argument. And that, after all, is what truly great films do."
    },
    {
      "rating": "4/5",
      "review": "It is just another suspense and horror film, but it is based on an original idea and is very well made. The problem I have with this work is perhaps a bit more personal, since I am an Agnostic Atheist and see how the main character who appears to be a great wise religious critic becomes blurred and falls into his own entanglements, well, the great illusion The fact that this film becomes an intellectual exercise falls and ends in what I suppose must be a normal horror film, fear, murders and the like. However, it is a good film, although it is not too scary - at least not to a regular horror viewer - it does its job of maintaining some suspense and fear, and this with: - Idea 8/10 I haven't seen a movie with this same plot before. - Story 8/10 Well done, although I feel that in the end it is a little wasted. - Screenplay 8/10 Very good script, it has very interesting and thoughtful dialogues, although in the end I think they could have based the film more on these and not fallen so much into the nonsense of this genre, that is when the script decreases to give way to nonsense. - Characters 9/10 Basically there are 3 of them, almost with almost the same importance and they do it excellently well, you can see the difference in personalities between them without an unpleasant or forced rivalry arising to stand out, they play their role very well and manage to give them somewhat unexpected turns. - Effects 9/10 The setting is perfect, good quality without falling into exaggerations, beyond that the visual and auditory effects are what is necessary and no more. - Entertaining 8/10 You should enjoy the dialogues or perhaps be attracted by the religious theme, either of the 2 options will hook you, now if your thing is only blood, ghosts and arms for a while, it may not be the best option for you, although we have a little of everything, I think that the strong part of this work is its setting, staging, dialogues and idea. Age +R (Only for those over 13 with parental guidance)"
    },
    {
      "rating": "1/5",
      "review": "Painfully slow and lacking in excitement, it delivers neither the suspense of a thriller nor the chills of true horror."
    },
    {
      "rating": "4/5",
      "review": "Best acting ive seen Hugh Grant do in years. Brilliantly acted by all with some deep conversation starters on the subject matter that focused mainly on religion and its validity in the real world. The preview was a little deceptive as you were given the impression it was like a serial killer Saw film but no its not just fyi"
    },
    {
      "rating": "3/5",
      "review": "Not my cup of tea. Too much empty chatter about religion - maybe others will find it more interesting."
    },
    {
      "rating": "3.5/5",
      "review": "Not a fan of the ending but a fun ride until"
    },
    {
      "rating": "5/5",
      "review": "Wow, I didn't think that this movie was going to be this good. Hugh Grant's acting is just off the charts. His character he portrays is intelligent,interesting, and creepy. This film is definitely a thinking film. The religious dialog between Grant and the two Latter-day Saints was really thought provoking. The movie is solid from start to finish. Watch it, only if you believe what I am telling you. See what I did there. Watch the movie, you will know what I am talking about. This is the best religious horror released this year. This is a masterclass in how psychological horror should be done."
    },
    {
      "rating": "2.5/5",
      "review": "I went in with high hopes on this one but, after the first thirty minutes, I found this quite disappointing. Hugh Grant received some praise for his performance but, much as I normally love his acting, I think he misplayed the part. Oddly, he chooses to inject the role with a touch of comedy (eg the Jar Jar Binks impression) and that weirdly undercut some of the gravity of the situation. They never properly explained his motivation for this elaborate, complex, and cruel system that he's devised, let alone why he's catching and keeping a small army of emaciated, lookalike women in his basement, purely in the hope of, one day, being able to deploy two of those women in this strange plot. And while the trailer implied, by showing the wooden model of the house he devised, that the two missionaries would have to go through this elaborate set of tests and tricks throughout the home, we barely ever left that single, poorly lit chamber. And this is after the world's longest and most tedious monologue from Hugh Grant. Snoozy. If there is a God, I can guarantee they're not a fan of this one."
    },
    {
      "rating": "4/5",
      "review": "I expected it and watched it with pleasure. There aren't many interesting movies these days. On the downside: the script wasn't broad enough for me."
    },
    {
      "rating": "5/5",
      "review": "Terrific film from start to finish. A career best performance by Grant as a man who raises a lot of questions regarding faith, religion, and control. An engrossing film that I could not believe came from the Director of Boogeyman, which was one of the worst films I saw in 2023. The acting is powerful, the story is smart, and the ending knocked my socks off. Check this one out if you like horror that makes you think."
    },
    {
      "rating": "3.5/5",
      "review": "The film does a solid job building tension, albeit slowly and a bit too grade one theology driven. Grant is incredible. But the story does veer off the rails in making any sense in the last 15 minutes. Still a solid thriller."
    },
    {
      "rating": "4/5",
      "review": "Nice debate about religion"
    },
    {
      "rating": "5/5",
      "review": "Don’t watch if you’re super religious I love hard conversations that were brought up in this theme."
    },
    {
      "rating": "5/5",
      "review": "Best horror film of the year, Hugh Grant is absolutely hypnotic to watch playing a villain"
    },
    {
      "rating": "0.5/5",
      "review": "Unwatchable garbage. Every \"fact\" presented in this movie, about every religion in history, is a complete lie. It's like listening to a couple of 13 year olds who've just discovered theology. The writing is so generic it's sad. The movie feels like it was written by ChatGPT.... with a very bad prompt."
    },
    {
      "rating": "3.5/5",
      "review": "This movie starts really good but ends with not much to be remembered. Worth a watch"
    },
    {
      "rating": "4.5/5",
      "review": "Loved. Insanely smart, inventive and original."
    },
    {
      "rating": "4/5",
      "review": "Better then The Passion of the Christ by far. Some logic and science will always win"
    },
    {
      "rating": "2/5",
      "review": "Splendid performances all around BUT... the film is basically a first-level theology lecture SO boring you find yourself praying the professor just slits your throat instead and puts you out of your misery."
    },
    {
      "rating": "2/5",
      "review": "Dissapointed with this film, not enough happens, and drawn out dialogue."
    },
    {
      "rating": "4/5",
      "review": "Sharp, thought provoking, pleasant slow burn until it overheats a bit. The back and forth between well written and acted characters keep you engaged and leave you with some things to think about."
    },
    {
      "rating": "3.5/5",
      "review": "Although fun and engaging, the writers had a concept that should have riveted the floorboards of the house of cards built up in this thriller."
    },
    {
      "rating": "2/5",
      "review": "Had a good premise, but the \"punchline\" at the end just gave me the heeby-jeeby's and didn't land. I think the writer's could have better researched or presented the language Mormons use. Ultimately, I just don't really enjoy watching creepy captive situations."
    },
    {
      "rating": "4.5/5",
      "review": "A truly great horror movie; a deeply psychological and intellectual ride. Hugh Grant gives a great and disturbing performance. Not to overlook the two girls, who also gave great performances."
    },
    {
      "rating": "5/5",
      "review": "Unexpected gem. Far better than the highly acclaimed horror flicks of 2024! Highly recommended. Grant is fantastic, and two young actresses are not too far behind!"
    },
    {
      "rating": "3/5",
      "review": "It starts with an interesting premise - preaching to Mormons at the door - but it ultimately starts to feel like the script has one philosophical point to make, and hammers it home without subtlety. It starts promisingly with some tension, but felt a bit silly by the end, devolving into a bit of horror schlock."
    },
    {
      "rating": "0.5/5",
      "review": "The action bag was great but very low budget film. This was very slow moving and the extremely 45 minute conversation in the living room was monotone making it difficult to keep interested. I would not recommend."
    },
    {
      "rating": "5/5",
      "review": "For believers in God or Allah or any other god, an eye opener."
    },
    {
      "rating": "5/5",
      "review": "The atmospheric visuals and gripping storytelling make Heretic a must-watch for horror-thriller fans."
    },
    {
      "rating": "3/5",
      "review": "Lots of chatter til the end. So-so to me."
    },
    {
      "rating": "5/5",
      "review": "Loved it. Sucked me in from the first frame. Cinematography, writing, performances, and set design are all excellent. I might be reading into this too much, but I think the whole point of this movie is that what religion you are or not doesn’t matter. What really matters is humanity and energy while we are here. Let me explain. At the beginning of the film, Sister Paxton hints at the fact that although Mormon, she believes in reincarnation and wants to return as a butterfly who lands on the hands of her loved ones. Towards the end, she also admits to knowing (through the great prayer experiment) that prayer doesn’t work, but it’s beautiful that we do it for each other anyway. And ultimately when she escapes, she sees the butterfly on her finger as a symbol that during our brief time here, what we do makes a difference to others, even if we are here only a brief while, and to be returned or recycled. The question is: does this make her a “heretic?” She has “chosen Burger King” as her fast food chain knowing it could be “sketch,” but she’s a kind human being, and that is all ever matters in the end. The movie is a brilliant testament to humanity."
    },
    {
      "rating": "4/5",
      "review": "The best part of the film is Hugh Grant and his character. His dialogue speaking about his beliefs (or facts) is enough to warrant a 4/5 from me."
    },
    {
      "rating": "3.5/5",
      "review": "who is this movie even for"
    },
    {
      "rating": "1/5",
      "review": "more a terribly written comedy than a horror film"
    },
    {
      "rating": "4/5",
      "review": "Never been a fan of H.Grant but he was amazing in this movie. Everything in this movie was good. A good chilling-thriller for the night."
    },
    {
      "rating": "4.5/5",
      "review": "Hugh Grant delivers a surprising and captivating performance as Mr. Reed in this psychological thriller. His portrayal of a psychopath is both chilling and compelling—I never realized how well he could handle such a dark role until now. Grant fully embodies the character, making it easy to get pulled into the layers of Mr. Reed's complex personality. The film challenges viewers to wrestle with moral gray areas, thanks in large part to his character's persuasive arguments that almost make you empathize with him. Alongside Grant are two fantastic leading actresses who really stand out. I wasn’t familiar with their work before, but they made a strong impression here. Together with Grant, their performances create a tense and engaging story that keeps you hooked. The first two acts are brilliantly paced, gradually peeling back the layers of the plot and characters. However, the final act feels a little rushed and leaves some questions unanswered. For instance, it’s unclear whether the last sister was meant to become one of Mr. Reed’s prisoners or if their encounter was a coincidence. The ambiguous ending leaves much open to interpretation. In the climax, a dramatic confrontation leads to a stabbing, bloodshed, and a tense chase through the house. As the final sister escapes into the snow, a butterfly lands on her finger in a symbolic moment that’s up for debate—does it represent hope or something more ominous, like a transition to the afterlife? Overall, the film is packed with twists, suspense, and thought-provoking moments. It’s a thrilling ride with just the right mix of psychological tension and gore. If you’re a fan of gripping thrillers or love exploring complex characters, this one’s worth watching."
    },
    {
      "rating": "1/5",
      "review": "Incredible boring beside the good acting its a total sleeping pill. How this get 90% is mind boggling but typical RT."
    },
    {
      "rating": "3.5/5",
      "review": "Very interesting and nice performance by Hugh Grant. A great game being played."
    },
    {
      "rating": "5/5",
      "review": "Disbelief--------> Ψ"
    },
    {
      "rating": "3.5/5",
      "review": "I feel as if they missed an opportunity here. Instead of the crazy, big ending, This could have been far more interesting if the Hugh Grant character actually ended up to just be psychologically torturing these door knocking Mormons with basic logic, and destroying the religious fantasy foundation they built their lives on. It could have been the simple revenge tale we all wish we could enact when one of these jack ass randomly rings our door bell at 9 AM, on a Tuesday. Instead we got just another boiler plate serial killer rehash tale."
    },
    {
      "rating": "4/5",
      "review": "Thought provoking and good acting. Two thumbs up"
    },
    {
      "rating": "2/5",
      "review": "Felt like it was trying too hard"
    },
    {
      "rating": "4/5",
      "review": "Almost great. Hugh Grant at his best."
    },
    {
      "rating": "3/5",
      "review": "It was very well done acting wise. Hugh Grant was great. I was disappointed with the lack of pay off for the slow build up. The back half the movie really lacked creativity to match the first half."
    },
    {
      "rating": "5/5",
      "review": "Such a good thriller/Horror movie, starts off slightly slow but kicks it up a notch really quick. This movie is a must watch and definitely a great watch if you enjoy plot twists. Acting was top notch and what really gets you is everything coming back in full circle."
    },
    {
      "rating": "4/5",
      "review": "A very interesting movie. Some really scary moments. Kind of \"barbarian\" with some religious chatter. I dislike Mormons so I found the torture of the Mormon girls satisfying. But overall a good point was made about religion."
    },
    {
      "rating": "5/5",
      "review": "This is just an amazing movie. The entire story was great."
    },
    {
      "rating": "3/5",
      "review": "Only the first half was worth it, after that it lost its way."
    },
    {
      "rating": "0.5/5",
      "review": "Film is not a very accurate towards latter day saint people and to show any religious people as being hoodwinked or willing being involved. shows faith not as positive plan. Interesting premise but poorly executed storyline."
    },
    {
      "rating": "1/5",
      "review": "very religious-based, lost my interest. not for me"
    },
    {
      "rating": "1.5/5",
      "review": "From young naive religious girl to science enthusiast Sherlock Holmes. And science is on pop-science level at best. Credibility is just instantly lost. Half of movie is exciting and interesting, and the other half is plain stupid. That's the problem of many movies that try to explain too much."
    },
    {
      "rating": "4.5/5",
      "review": "Heretic is full of twist and turns - elegant yet horrific. Surprisingly good performances and thought provoking script."
    },
    {
      "rating": "1.5/5",
      "review": "Seems philosophical at first but actually the whole movie seems like a stoned atheist teenager mumbling . The actors played good though"
    },
    {
      "rating": "4/5",
      "review": "Heretic is an impressive thriller that challenges taught beliefs with striking intellectual depth. While I found its ambiguous ending—a narrative choice reminiscent of Saint Maud—a bit of a cop-out, the gripping \"control\" that defines the film up to its conclusion places it among the year's best."
    },
    {
      "rating": "4/5",
      "review": "Heretic isn't just a movie; it's a confrontation with your belief system. Unlike films that rely on twists or misdirection, Heretic builds its story on a foundation of carefully constructed facts and logic, delivering them in a way that feels both fresh and profound. Heretic isn't just a movie; it's a confrontation with your belief system. Unlike films that rely on twists or misdirection, Heretic builds its story on a foundation of carefully constructed facts and logic, delivering them in a solid framework.. Rather than steering the audience toward a predetermined conclusion, Heretic invites introspection, swirling around your thoughts and leaving you to chart your own path through its complex ideas. The director's innovative use of sensory details elevates the experience. As the camera moves, the audio seamlessly shifts to match the perspective, pulling viewers deeper into the story. This clever interplay of sound and visuals creates a suspenseful atmosphere that grips you from start to finish. As the frames alternate between symmetrical wide shots, evoking isolation, and intense close-ups that capture the raw emotions of its characters. These frames amplify the suffocating tension, making the atmosphere feel even more than hefty. This blend makes every nuanced struggle feel more intensly personal. The movie maintained a carefully thought-out environment, with attention to detail in what was placed where-from a table, or a switchboard to a Japanese water-collecting bamboo. Even when not directly in focus, these elements influenced the scenes through audio cues. For instance, music would pause at key moments, or the bamboo, after collecting and releasing water, would produce a wooden knock every few minutes. The integration of pop culture references within the religious themes added depth and engagement, from drawing parallels between Jar-Jar Binks in Star Wars and a god-like figure to using real-world examples of plagiarism and comparing religious texts to games like Monopoly, the film offered a unique lens for exploration. Hugh Grant creates an intense atmosphere in his scenes, portraying the fragile Mr. Reed, who is calm and reasonable in his actions. His subtlety holds a tight grip on the viewer, as the distance between reality and fiction is clear, yet his portrayal of the character's thought process makes the audience feel as though they are sitting in a suffocating atmosphere. The actors, together, successfully portray a struggle focused on belief systems rather than merely a fight for survival. The fusion of sound and visuals created a tight atmosphere unlike anything I've experienced before. The story itself is an exploration of faith, guilt, and redemption, packaged in a way that feels deeply personal yet universally resonant. Sum up - Walking out of the theater, I couldn't stop reflecting on the themes and emotions it evoked. Heretic isn't just a film, it's an experience that stays with you, reshaping how you view cinema and storytelling. I feel incredibly grateful to have witnessed this masterpiece on the big screen and can't wait for everyone to experience it as well!"
    },
    {
      "rating": "5/5",
      "review": "Excellent, the two girls played excellent disgusting religious villains, Hugh Grant plays the loveable atheist very well."
    },
    {
      "rating": "4/5",
      "review": "I like the roundabout way of explaining different religions, but the ending threw me off."
    }
  ]
}