{
  "movie_name": "Nosferatu",
  "reviews": [
    {
      "rating": "1/5",
      "review": "Terrible. Depressing, dumb dialogue and torture horror porn. Couldn't stand the two main characters, the vampire is just gross with some type of unfathomable attraction. I don't usually leave reviews but my husband made me watch this to not waste the $6 rental fee. It was crap. William Defoe looks about 5'1, the Bosch actress has no redeemable qualities ( part written) was just pathetic, seizures and whiney the whole movie. Dracula untold was 1000x better."
    },
    {
      "rating": "4.5/5",
      "review": "The acting, the cinematography, the lighting, the sound, the make up, costume design… on and on.. no details missed"
    },
    {
      "rating": "1/5",
      "review": "terrible movie bro 😭"
    },
    {
      "rating": "4.5/5",
      "review": "SHOULD NOT BE RATED M. i loved the movie, scares, characters and story, but it was a little too sexual for my taste"
    },
    {
      "rating": "0.5/5",
      "review": "This is one of those movies that everyone says is so amazing and they love, then I watch it and think its a pile of garbage at the end. Nothing fun, nothing interesting, nothing well done, nothing enjoyable about it. It felt like nobody was trying, even Skarsgaard whom I am a fan of."
    },
    {
      "rating": "0.5/5",
      "review": "do anything else with your time. over gore. set design and music were good. I could do without the gulping sounds. strange sex that lasted way too long. skip this movie"
    },
    {
      "rating": "3.5/5",
      "review": "Good flick, The mental aspects of this really grossed me out."
    },
    {
      "rating": "0.5/5",
      "review": "This is the worst thing Ive ever watched. No story, shitty characters, and just bad overall."
    },
    {
      "rating": "0.5/5",
      "review": "Worst ending ever!!!!!!! Don't waste your time with this crap!!"
    },
    {
      "rating": "4.5/5",
      "review": "the story was really nice, got me hooked to the screen"
    },
    {
      "rating": "5/5",
      "review": "This is my favorite movie i watched it at the theater it was a crazy experience the sound desing is insane et images are gorgeous i really loved some of the shots esspecialy in the forest the story is really good to and the actors played their part realy well"
    },
    {
      "rating": "4.5/5",
      "review": "Very cool adaptation"
    },
    {
      "rating": "1/5",
      "review": "Straight up vampire porn"
    },
    {
      "rating": "4/5",
      "review": "Dracula At His Finest"
    },
    {
      "rating": "1/5",
      "review": "A stretched out classic tale, translocated, conducted in stage form, and so overacted given the length of the movie, the cast must have needed months to recover and reorientate themselves. I salute the attempt to move from torno and slapstick horrors that have dominated in recent years, but this is not it. Classic horror is about dread. At times this film is ful [sic] of it. One last observation. Nosferatu speaks like a Klingon stroke victim."
    },
    {
      "rating": "5/5",
      "review": "What a well cast film. All actors who look like they would be in that time and place. BBC should fire their casting people and hire whoever worked on Nosferatu."
    },
    {
      "rating": "1/5",
      "review": "I was expecting so much better with the reviews it has received. It was far too long and really dragged. Lots of bad accents, so many raspy voices, and so many gross noises. Some cool visuals, but not much else."
    },
    {
      "rating": "5/5",
      "review": "Absolutely loved this adaptation."
    },
    {
      "rating": "3/5",
      "review": "I'd been so looking forward to this but came out somewhat underwhelmed: possibly the cinema I saw it in didn't do it justice in terms of picture quality which was a shame."
    },
    {
      "rating": "1.5/5",
      "review": "Nope. I didn't like it all. It had some good visuals but that was not enough to safe this lackluster attempt of a vampire movie."
    },
    {
      "rating": "0.5/5",
      "review": "Wow, just wow. I expected a great movie since I have enjoyed Eggars' movies in the past such as The Witch and The Lighthouse. This was awful from the over-acting to even the miscast great Willem Dafoe who is always great. This did create an atmosphere, however the story was bad, acting bad, and imo a complete waste of time. I do not like leaving a bad review but I had no choice here. Worst movie I have seen in years. Sorry for the negative post!"
    },
    {
      "rating": "1.5/5",
      "review": "This movie attempts to capture the essence of the past Nosferatu films but falls flat. I believe they should have filmed it in black and white to express what they were trying to portray. The dialogue is boring, the chemistry between characters is lackluster, and I could not form a connection with Ellen. By the final minutes I was just ready to go, I felt no sadness for Ellen's death. And the moaning, they should have cut all that out. I understand they wanted to make the audience uncomfortable but they had too much moaning. Maybe if the film is good it wouldn't have mattered."
    },
    {
      "rating": "4.5/5",
      "review": "Robert Eggers delivers a visually stunning and atmospheric retelling of the iconic vampire tale. Bill Skarsgård’s portrayal of Count Orlok is both terrifying and mesmerizing, bringing a fresh intensity to the character. The film’s meticulous attention to period detail and its moody, gothic aesthetic create an immersive experience that lingers long after the credits roll. While it pays homage to the original, this version stands firmly on its own, offering a chilling exploration of obsession and the supernatural."
    },
    {
      "rating": "3.5/5",
      "review": "Better than the 1978 remake. Worse than the original"
    },
    {
      "rating": "4.5/5",
      "review": "literally how i picture a dark goth vampire movie. perfect."
    },
    {
      "rating": "4.5/5",
      "review": "Loved just about everything about this film. Dark, gothic, creepy, intriguing and grotesque. Every actor and actress was on point. Fantastic cinematography and visuals. It kept my attention every step of the way, even if the overall story was predictable and well-known."
    },
    {
      "rating": "4.5/5",
      "review": "Creepy, atmospheric and very well acted. It gets an extra half a star for it's healthy dose of Willem Dafoe."
    },
    {
      "rating": "2/5",
      "review": "I am very much a fan of vampire movies, and have been since the 1960s when I was far too young to see them in cinemas. So I have seen many variations over the years. From the hype, I thought this was going to be something really special - it isn't. The effects and visuals are good but the story really doesn't cut it. It is slow, without anything particularly interesting happening, and at 2 hours it drags - and oh how it drags. The acting felt strained, and may be the result of characters being rushed to development and directing. Overall, not impressed. It's an OK watch if you have two hours to waste."
    },
    {
      "rating": "3/5",
      "review": "Never seeing the first film, made the hype of this release less than after watching it. Honestly, I fell asleep. I was excited since vampire movies are a sign of the times and a secret love of mine but alas I don’t know how it ends and rewatching it seems like a daunting task. The actors in the film though, are a few of my favorites so at least 3 stars!"
    },
    {
      "rating": "5/5",
      "review": "Creepy and beautiful at the same time! Incredible masterpiece!"
    },
    {
      "rating": "1.5/5",
      "review": "All a bit 'hammer house horror' dated I'm afraid. Full of cliches and bad accents, it feels like a 70s throwback with superior cinematography. Directors should take a leaf out of Ridley Scott's book with the dialects, if they are going to sound preposterous then let the actor speak in their more natural tone as in Gladiator. As for the story, it does actually feel like a watered down Dracula which of course it is. The first Nicholas Hoult movie I've not enjoyed in quite some time. Shame."
    },
    {
      "rating": "3/5",
      "review": "Beautifully made but it just feels empty. The movie doesn't have a soul just like it's antagonist. It focuses too much on certain aspects that I cannot spoil but the ones who've watched it and also didn't like it know exactly what I mean. First 35 minutes in i was thinking this is going to be a masterpiece but it fell off after that. Bram Stoker's Dracula for example is way superior than this one and is still my favorite vampire movie. The weakest movie out of Eggers 4 movie. I couldn't imagine that I wouldn't like it but here I am."
    },
    {
      "rating": "0.5/5",
      "review": "I wish I had never seen this. I love vampire movies, but this was just awful in every way I can think of. Why did I need to see a super repulsive vampire wannabe gyrate on top of someone whose chest he was feeding from? And no, it's not as good as it sounds. The acting was poor, and the script was terrible. It used bad visual storytelling where it needed dialogue, and exposition dialogue where it needed visual storytelling. You don't get invested in any of the characters. It's like bad theater in a movie format. Not sure why this was hyped so much."
    },
    {
      "rating": "3.5/5",
      "review": "Don’t go into the Nosferatu remake with high expectations—unless you’ve seen the 1922 original recently. Without that reference point, it’s easy to miss how deliberately Eggers mirrors the original, both in composition and in how he contrasts it through grotesque realism. If the silent classic is fresh in your mind, the remake becomes a cinematic dialogue—a love letter to horror’s evolution and the art of filmmaking. Watch the original first, then Eggers’ vision, and you’ll better appreciate just how far horror and film as a medium have come: in sound, color, visual effects, and the sheer depth of storytelling. Especially striking is what directors are now able to show audiences in the mid-2020s—imagery and intensity that would’ve been unimaginable a century ago."
    },
    {
      "rating": "1/5",
      "review": "Ok start Off with the Positives Great Picture and Sound NIce Sets and Cinematography. Casting this leaves your head scratching.... WTF. You casted Willem Dafoe and you didn't have him Play Nosferatu/Count? Dumb as hell. The Best Actor you had in this entire film you gave a bad part. Acting is not good. Some Roles were cast off Favoritism in the industry on who they know or who they are related too. The Talent Pool is Dull. Robert Eggers is known for historical accuracies in other films, but then you have all this random nonsense added to this picture. For what reason? it doesn't make the film more interesting you just burned more time off the viewers lives. How is the Count a Vampire but yet he has rotting skin? in he a Vampire or a Zombie? Either way it's a terrible depiction of both. This is a Very Bad Wanna Be Bram Stokers Dracula. I could knock on every single stupid thing about this movie, and I could type for hours. But I already Burned 2 Hours and 16 Minutes of my life on the Extended Cut."
    },
    {
      "rating": "3.5/5",
      "review": "Visually quite strong. The ending was handled in a perfunctory way, not doing the original version justice."
    },
    {
      "rating": "2.5/5",
      "review": "Some good ideas, Eggers knows how to do things. Maybe it should have been longer but they had to cut a lot or they missed the point in the writing process."
    },
    {
      "rating": "4/5",
      "review": "Felt like I was taken back in time when I watched the old classic horror films of many years passed with Boris Karloff, Vincent Price, and many more. I'd say it's a bit of a niche film due to that and might not be for people looking for a more \"scary\" time, but the acting and cinematography was superb."
    },
    {
      "rating": "1/5",
      "review": "The acting is so wooden I thought I was watching a remake of Pinocchio."
    },
    {
      "rating": "2/5",
      "review": "It hits a lot of the familiar notes from previous iterations. While failing to do anything remotely new or interesting. Totally felt flat and boring"
    },
    {
      "rating": "5/5",
      "review": "Absolutely loved this movie ! It gave me a little bit of everything ! I got some horro, some thriller, some psychological, etc ! And I loved the actors everyone did their part !"
    },
    {
      "rating": "4/5",
      "review": "I WILL LEAVE YOU 3 NIGHTS ☝️☝️☝️ 🗣‼️‼️‼️‼️⁉️‼️⁉️‼️⁉️‼️⁉️ also ellen was such a freak 👅. And some parts in the it had me like this 😦. Decent movie"
    },
    {
      "rating": "0.5/5",
      "review": "The original Nosferatu faced several legal problems for being (pretty much) identical to Dracula. This movie suffers from the same problem (I guess that was intended, but I can't see why, it's inferior to the original story in every way). Jonathan is here, so is Mina, Dracula, Renfield, Van Helsing, the whole gang, just with different names and a worse told story. This is the sillier, lamer, dumber Dracula’s sibling. If you’ve never, ever heard of Dracula there’s is a chance you’ll like it. Unless maybe, you'd like to watch a story about some Payayin warriors looking for the Tragon Balls, one is called Moku, the other Payayin is named Wegeta and there's a god of destruction there named Deerus. Yeah, you know, it doesn't feel like an inferior cheap knockoff at all."
    },
    {
      "rating": "4.5/5",
      "review": "Ok this was really really great . Someone on NPR described this as “goth baroque” and yes, love that description , because that is exactly what this is . It was a long movie and rightly so . Loved the casting for all actors . Was filmed with such care and delivered as quality . Will be watching again . Great performance from everyone"
    },
    {
      "rating": "4.5/5",
      "review": "Eggers is a master of his craft. This doesn't top some of his other work, but it's a truly remarkable movie."
    },
    {
      "rating": "3.5/5",
      "review": "Visually one of the most beautiful movies I’ve ever seen. Although I couldn’t stay super locked in on the storyline/plot the entire time it’s a movie that I’d likely watch again or recommend to friends."
    },
    {
      "rating": "3/5",
      "review": "I was really looking forward to seeing this...and was a bit disappointed. It was kind of flat to be honest. I prefered the Bram Stoker's Dracula of the past with KR and WR. There was just no build or pace in this one- a lot of films seem to be like this recently - I didn't feel drawn into the film or kept on the edge of my seat. The actors are all fine actors but the direction lacked depth in my humble opinion. The shape just wasn't right if that makes any sense. However...the costumes, the darkness, the scenery was marvellous. There just didn't seem to be any cohesive drive to make it a really good film. There was no excerpting an emotional response."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was freaky asl fr"
    },
    {
      "rating": "5/5",
      "review": "This film is a masterpiece by Robert Eggers, who has been able to show what film art means and means with his fourth film. This film has a dark atmosphere that is rarely seen or felt in the horror film genre. This is a film that also captures the 19th century era very well with images, language and dialogue. Above all, this is of course a film that has been seen interpreted differently from the main story several times in… more"
    },
    {
      "rating": "5/5",
      "review": "I LOVED IT, I WOULD WATCH IT OVER AND OVER AGAIN IF I COULD"
    },
    {
      "rating": "4/5",
      "review": "Its a thrilling movie with the characters epitomizing its plot and scenes definitely a must watch if your into vampires"
    },
    {
      "rating": "4.5/5",
      "review": "Visuals, acting, and flow is elite. Must have love for the craft to enjoy."
    },
    {
      "rating": "3.5/5",
      "review": "This was really good. The cinematography of a lot of the scenes was super impressive. It's just a visually stunning film. I did feel like the ending was a bit rushed, but all in all it was pretty good."
    },
    {
      "rating": "0.5/5",
      "review": "Snore fest don’t waste your time, plus I don’t have a thing againt nudity or sexual context but this was too much for what it should have been. William Defoe was the best thing this film had going for it."
    },
    {
      "rating": "4/5",
      "review": "Es una buena historia pero tuve que verla en 1.75x porque todo se me hizo super lento"
    },
    {
      "rating": "2.5/5",
      "review": "It's a glorified soft core porno with some dark undertones"
    },
    {
      "rating": "2/5",
      "review": "Disappointing. While much praise goes to Nicholas Hoult for his performance- the others, not that remarkable. I felt like this movie was all hype, no substance."
    },
    {
      "rating": "3.5/5",
      "review": "Really good with some very tense scenes but for some reason through it all I felt like it wad lacking something."
    },
    {
      "rating": "4/5",
      "review": "Robert Eggers' remake of F.W. Murnau’s 1922 classic Nosferatu: A Symphony of Horror which was loosely based on Bram Stoker’s Dracula is a deliriously macabre and insanely ravishing portrayal of obsession and occultism quite never before seen, paying tribute to its predecessor and redesigning horror."
    },
    {
      "rating": "5/5",
      "review": "Incredible acting. Lily-Rose did a phenomenal job in this movie."
    },
    {
      "rating": "3.5/5",
      "review": "First half of the movie was incredible 10/10. Fell off a little in the second half but good overall. The acting was great besides some scenes from ellen who was a little over the top in a few scenes. and cinematography was amazing."
    },
    {
      "rating": "2.5/5",
      "review": "Nice slow boil old school horror, but largely forgettable."
    },
    {
      "rating": "4.5/5",
      "review": "Nosferatu is a genuine scare that you can't prepare for. Just go in, have a good time, and make sure you don't go alone."
    },
    {
      "rating": "3/5",
      "review": "A bit dissapointing from Eggers, Depp was probably not the right cast for this role, as it probably needed some more nuance for something so high-art and noir. Emma Corrin, Willem Defoe and Nicholas Hoult really carried the film, and definitely fit into the period and Aaron Taylor-Johnson was maybe too 21st century looking to carry off his role, despite acting very well. Not to the fault of the actors, as it rarely is, this was all casting and script that didn't compliment together. Amazing story, just not quite there IMO!"
    },
    {
      "rating": "1/5",
      "review": "Yikes, this movie was so bad! It was extremely slow, I couldn’t stand it. I usually really like scary vampire movies - this was not one of them. In a word, Terrible."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie. Those who enjoy aesthetically dark themes might want to check this one out."
    },
    {
      "rating": "5/5",
      "review": "Creepy AF, but I wanted the bald headed rat fanged pale dude, not Count Dracula, yeah yeah I know it was based off him but he's a different entity in my Lore!!"
    },
    {
      "rating": "4/5",
      "review": "It was alittle hard to watch at times (the pace) but it was still a good entertaining movie"
    },
    {
      "rating": "1/5",
      "review": "The movie looks good, the acting is good, but it is such a bore, and the message behind the story is undeniably better left in another time period. It was hard to understand what was really going on."
    },
    {
      "rating": "4/5",
      "review": "Every aspect of Eggers' Nosferatu is technically excellent, but somewhat ironically, and yet almost appropriately, it lacks the humanity needed to connect the audience to its characters and illicit genuine emotional investment. The acting is excellent, the imagery is amazing, and the score and sound design collaborate to nearly transcendent levels at times. All these immersive elements draw us in to this world with each scene, and I personally find the film to be very re-watchable. Still, I never felt any proper connection to these people, or any real stake (pun intended) in their plight. Much has been made of Eggers' attention to detail, and emphasis on maximum accuracy based on his own extensive research, and while that is immediately evident for the full length of the film's runtime, the parts never add up to more than their sum as they have in his previous works. Flaws aside, it's a really great movie, especially if you enjoy atmospheric gothic horror, and particularly if you appreciate occult accuracy. This one slides easily in the top tier of vampire flicks, and gothic horror, but not quite into the upper echelons of the horror genre more broadly."
    },
    {
      "rating": "1/5",
      "review": "An epic disappointment to see this string of \"mood scenes\" played out with a dreadful screenplay and story trying to resolve the central dependancy relationship between Ellen Hutter and her friends family that supported her. Then shock horror the ending turns into a sort of body-horror relationship after dragging us through many dreary acting scenes along moody shorelines. Keep the moody shorelines and feel but all of the Willem Dafoe shambolic investigation themes, combined with that badly written family friend dependency piece was shockingly poor. I think for me, I would have prefered that family with Aaron Taylor-Johnson to hate on Ellen Hutter earlier, to add more tension. Like he had some sort \"buck up your ideas\" vibe going on to add more friction earlier, instead of the stagnation and sudden \"get away from my family\" moment he had near the end. One scene got my energy up, when Thomas Hutter was starting to explore Orloks castle. It had a little bit of tension instead and stopped feeling like a montage adventure for a bit and I think coming back to that explorative tension at different stages could have worked well, without it needing to be a full on action-flic. The director could clearly not do that adventure tension drama and I don't think it would have taken much to add that back in without it turning into every other action-vamp movie."
    },
    {
      "rating": "4/5",
      "review": "This movie is a masterpiece! I would say the movie is a little stretched towards the end but many aspects of the movie are great. The jumpscares along with the atmospheric scenes of the castle are just great!"
    },
    {
      "rating": "3/5",
      "review": "A bit full of itself and turns into an Exorcist clone about halfway through. Not bad though. Really nice visuals"
    },
    {
      "rating": "1/5",
      "review": "it was weird and like power sexual. only made it like 30-40 minutes in when the weird bird eating scene happened. disgusting and disturbing. save yourself and never watch this crap."
    },
    {
      "rating": "0.5/5",
      "review": "Meandering drivel. Couldn't finish watching. Bored me to tears."
    },
    {
      "rating": "1.5/5",
      "review": "Nosferatu in 2024? NO! These tropes are deadly dull, having been trodded through so many times before. There have been successful attempts to breathe new life into a vampire's corpse over the years, such as Dark Shadows or True Blood, but you have to totally reinvent and not just recapitulate. This project is total boredom from concept to final product, no matter how earnest the filmmakers seem to be. Dead is dead. If you want to be bored for 2 hours you could just watch the original Nosferatu, this version adds NOTHING NEW and only takes away from the iconic stature of the original film, for whatever that's worth. I don't have anything against the original, it was original in it's time, 100 years ago. And then recycled thousands of times after there's pretty much nothing to see there either anymore. This idea should have died in the pitch meeting. Who wants to see this garbage again. NO THANKS! Let's MOVE ON already! Next! Something interesting PLEASE!"
    },
    {
      "rating": "0.5/5",
      "review": "I’ve had more entertainment sat in A&E with a 6 hour wait time ahead of me, counting ceiling tiles. Compelled to leave a review, so that others don’t waste 2 hrs of their life. It’s neither scary nor entertaining, just dull and uncomfortable, it reminds me of a fever dream and no one likes those."
    },
    {
      "rating": "5/5",
      "review": "A horror absolute must see. You cannot unsee this movie. It’s one of those ones that sticks with you."
    },
    {
      "rating": "0.5/5",
      "review": "Barely watchable, at times it seemed like a comedy...however the cinematography was exemplary -"
    },
    {
      "rating": "1.5/5",
      "review": "I must have been missing something that others saw in this. Was really bad acting and a terrible script. I turned it off before the end as it was getting too ridiculous."
    },
    {
      "rating": "4.5/5",
      "review": "A lot better than I thought."
    },
    {
      "rating": "4.5/5",
      "review": "The cinematography in this picture was unmatched great story an how they captured the aesthetic of the 1800’s definitely creepy an dark an with a spine chilling ending"
    },
    {
      "rating": "4/5",
      "review": "A horror movie that focuses more on psychological and atmospheric creepiness than gore and jump scares. A very enjoyable reimagining of the almost-lost classic and a welcome deviation from the usual Dracula story. Excellent make-up effects on Count Olaf, and even better sound design that makes the bloodsucking sound so visceral and violent."
    },
    {
      "rating": "1/5",
      "review": "Why don’t they speak German in Germany? It’s 2024, how are subtitles still such a problem in mainstream films? You want it to be accurate then speak the correct language. Like Smile (2022) everything is framed in the middle like they are following a trend or making it easier to watch vertically on a phone. It’s making my eyes lazy, they just stare into the middle. The blocking is especially awkward and unnatural. It has a very unengaging start which quickly made me wish I was watching Nosferatu (1922). I didn’t like the casting. It is so slow, it takes 30 minutes to get interesting but then quickly stops being interesting abruptly. I can’t think of a more pretentious film in recent years. It looks beautiful though. I think it’s so inaccessible for general audiences including myself. It’s hard to tell what’s going on sometimes. This film dances between laughably pretentious overacted nonsense that I suspect won’t age well like Bram Stoker's Dracula (1992) and actually quite entertaining horror. It’s a shame there’s way more of the former than the latter. It’s so hard to engage as it’s so choreographed and devoid of personality. I regard this as beautiful candy and nothing more. This film reminds me of a hard videogame level that you are determined to finish but no matter how hard you try you can’t finish it and it never ends. I eventually finished it after like six attempts."
    },
    {
      "rating": "4/5",
      "review": "It was an interesting movie, not one I would pay to see twice. The cinematography was amazing though"
    },
    {
      "rating": "5/5",
      "review": "Now, my new favorite movie adaptation of Dracula."
    },
    {
      "rating": "2.5/5",
      "review": "A bit overhyped, could have had a lot of potential if it was a bit scarier. The atmosphere in this movie was well done, and the acting was great. But honestly, it was a bit boring."
    },
    {
      "rating": "3.5/5",
      "review": "More atmospheric than scary but a nice variation on the Dracula story"
    },
    {
      "rating": "1.5/5",
      "review": "Tras Nosferatu, Robert Eggers arriesga a quedar como el pony de un solo truco (The Witch. 2015). Su truco es doble si, claro, se incluye The Lighthouse (2019). También aplaudible. No he visto de The Northman. Solo me guío en este caso por las malas críticas que acumuló. Su Nosferatu sucks, debe reconocerse. El vampiro, Bill Skargard, es anodino. La peor representación del personaje que da nombre a la obra en las tres versiones cinematográficas existentes y la circunstancial Shadow of the Vampire (2000)."
    },
    {
      "rating": "5/5",
      "review": "I am not and never was a big fan of horror moovies. But this masterpiece is one of my top experiences. Finally a horror moovie that doen't rely only on jumpscares. The atmosphere, the costumes, the sound design all comes perfectly together in this dark mixture of an old folklore legend. Absolutely recommend it an amazing moovie."
    },
    {
      "rating": "0.5/5",
      "review": "It was so weird and cringe we turned it off."
    },
    {
      "rating": "5/5",
      "review": "Beautiful. Shooting style was gorgeous. An amazing meditation on sacrifice and love. The character design of Nosferatu was incredible. Definitely a great remake and always looking forward to the madness Bill Skarsgard channels in his roles like this."
    },
    {
      "rating": "1.5/5",
      "review": "\"We have Bran Stoker's Dracula at home\" the movie."
    },
    {
      "rating": "0.5/5",
      "review": "This is the worst Nosferatu , Dracula vampire film i have ever encountred . No real storyline no effects .No love .Just a soulness empty cheap made film . Unlike all dracula films that showed and provided a true story i rate this film 2 out of 100"
    },
    {
      "rating": "5/5",
      "review": "A wonderfully made film, bill had one of the best performances I’ve seen in years. And the cast in general did amazing. An aesthetically pleasing movie as well as it captures the many different emotions one mind can handle at a time. Don’t mistake this as just another horror film because there’s a lot to offer throughout the journey of this film."
    },
    {
      "rating": "5/5",
      "review": "My review is simply me standing up during the credits and clapping like a seal on meth. I could not love this movie more, and it gave me plenty of Bram Stoker vibes — the single biggest compliment I could ever, ever offer a vampire flick. Signed, Notorious Vamp Lover"
    },
    {
      "rating": "5/5",
      "review": "THE BEST HORROR MOVIE OF 2024!!! BEST HORROR MOVIE OF ALL TIME!!!! BEST VAMPIRE MOVIE OF ALL TIME!!!!"
    },
    {
      "rating": "5/5",
      "review": "The best Dracula-related film ever made. Proper Gothic treatment of the film. Eggers has created a masterpiece that will continue to inspire future generations."
    },
    {
      "rating": "4/5",
      "review": "A very creepy movie. The effects and atmosphere are incredible, but my only complaint is that the plot fails to explain certain questions. Why is she important? What makes her different from anyone else? Why is Nosferatu obsessed with her other than him being in “heat”?"
    },
    {
      "rating": "5/5",
      "review": "A modern classic! Litreally fille dme with dread from start to finnish and looked stunning!"
    },
    {
      "rating": "4.5/5",
      "review": "I was waiting for this movie ever since it was announced. I was seated since ever. When i actually was seated and watched this movie. I could not sleep for a while. This may seem like a bad thing but let me tell you how much i enjoyed this movie and i don’t care that i couldn’t sleep for a bit. The cinematography was more than amazing i don’t know how to explain it but it’s so good. The literal acting in this movie is so wonderful. The scary and creepy vibes i got from the movie and from count himself… i will give it half a star less. BUT never the less, i had a good time"
    },
    {
      "rating": "5/5",
      "review": "Really Good Movie….!"
    },
    {
      "rating": "2/5",
      "review": "Dull. The overacting felt like the actors were in a play rather than a film. Period pieces tend to go this way. The story really never took off. It’s just about some creepy dude with an obsession with a girl and then dies letting his guard down anticlimactically. Willem Dafoe spent the whole movie gearing up for a big fight and then .. nada. It’s like the filmmaker ran out of time and funds and had to call it quits. Big let down"
    },
    {
      "rating": "0.5/5",
      "review": "Absolute drivel. Acting? Plot. Directing. The language if the day-no.not believable. Accents terrible. Cannot recommend!! EVER!"
    },
    {
      "rating": "3.5/5",
      "review": "Beautiful cinematography"
    },
    {
      "rating": "3/5",
      "review": "Everything was great from the acting to the directing, except the monster. I was expecting to see an intimidating and scary vampire monster. Instead we got a skinny decomposing corpse with long fingers."
    },
    {
      "rating": "4.5/5",
      "review": "This film takes “dark movies” to a whole new level. Skarsgard’s acting is on par with Heath Ledger’s Joker. He terrifies you, yet you want to see more."
    },
    {
      "rating": "1/5",
      "review": "About as scary as my uncle Norman on Halloween. Silly acting by silly actors trying to act like they’re in a scary movie. Better to spend your time watching Scooby Doo. What a ridiculous movie."
    },
    {
      "rating": "4.5/5",
      "review": "Robert Eggers was clearly the perfect decision to direct and lead the remake of this work, he brought a new air to a figure that is almost considered a \"meme\" but that marked the history of horror cinema, all the tension created and the performances delivered by the cast helped create an agonizing atmosphere that keeps you hooked from beginning to end."
    },
    {
      "rating": "1.5/5",
      "review": "Man, Nosferatu was slow as heck. I was hyped for some spooky vampire action, but it felt like watching grass grow,except the grass has creepy claws and a goofy mustache. The silent film vibes and over-the-top acting just didn’t click for me; it was all atmosphere, no chills. Yeah, the shadow shots were neat for a hot second, but then it’s back to dragging its feet with moody stares. I get it’s a throwback to the 1922 classic, but I was yawning more than jumping. Total drag, give me a fast-paced fang-fest over this any day."
    },
    {
      "rating": "4/5",
      "review": "Worth a watch. If you know the story there aren’t a ton of surprises, but it is nice to see it get an update. I did question the casting at first, but it pulled together nicely."
    },
    {
      "rating": "5/5",
      "review": "Ominous, slow burning gritty, and unsettling. Everything I had hoped it could be and feeding scenes are not like anything I have seen in this genre of film. Expands Vampirian lore into an area you may not expect."
    },
    {
      "rating": "5/5",
      "review": "Dark Gothic Romance is back bb!"
    },
    {
      "rating": "4/5",
      "review": "It was an exciting, scary, rip-roaring horror ride and a great first trip to the cinema of 2025."
    },
    {
      "rating": "3/5",
      "review": "So....this was pretty melodramatic..I liked the gothic look of the film and it's cinematography but it just felt that I was watching a stage play with the actors overplaying their roles. As for The count, sorry Bill but all I could hear was Nandor (from What we do in the shadows) doing a Darth Vader impression...not good. It was also way too long or it just felt that way. I have to say that the original, which is over 100 years old is far superior."
    },
    {
      "rating": "2/5",
      "review": "Surprisingly disappointing given the mostly positive critical response. It's been the first time in memory I've been bored with a film. Since \"everyone\" knows the Dracula story, remakes would ideally flesh out the possibilities of atmosphere, character and dialogue in creative and deeper ways, making it possible to see this story for something akin to the first time. Nosferatu did the opposite. The vampire character danced with self-parody. His raspy inhalations reminded me immediately of Darth Vader, and I almost laughed. The vampire was largely devoid of personality interest - a monster whose character was revealed right from the start of the film and didn't change or reveal anything more throughout. Nosferatu didn't build suspense and really couldn't since the director decided that he would go full bore on noisy sound effects maximal dramatic tension from the very first scene. Nosferatu revealed a commonplace film-making fallacy: You don't create atmosphere and suspense by following a checklist, which is what this film appears to have done. You do it by careful artistry and attention to psychology and emotion. With any new film that disappoints, I try to not let it become an over-determining bellwether of the state of the film industry. But over the last 12 hours of reflection on Nosferatu, I'm slightly depressed that this film got made, got made the way it did, and had the positive reaction it did. Are we this starved for good movies that we'll put laurels on that which we really know doesn't deserve it? Kudos to the cinematographer, the music director and the actors, but Nosferatu just didn't come together at all. The sensibility of the gothic deserves a better effort than this."
    },
    {
      "rating": "5/5",
      "review": "A great remake that doesn't escape it's original roots. Count Orlok takes a more modern look as he is more of a dracula/romanian root. All major actors and actresses bring their \"A\" game."
    },
    {
      "rating": "2.5/5",
      "review": "It was ok, found myself bored and wanting it to end faster lol"
    },
    {
      "rating": "0.5/5",
      "review": "If you are having trouble sleeping, this is the cure. Pompous fake drama, bad acting, just pure boredom."
    },
    {
      "rating": "5/5",
      "review": "If you're already a fan of the director Robert Eggers, you'll love this film. His cinematography and ability to create a very specific mood is unmatched. It is a quite polarizing movie though, as it's not your run-of-the-mill jump-scare horror movie. It's more of a foreboding, unconformable experience rather than an outright scary one."
    },
    {
      "rating": "1/5",
      "review": "worst acting I've seen this decade"
    },
    {
      "rating": "2/5",
      "review": "The derailing on the sets is outstanding. Yet I'm reminded all through this film that it's a Dracula knockoff. There was so much positive hype before it was released, that it was phony advertising , apparently. This does not compare with Coppola's \"Bram Stoker's Dracula\", which I consider the all time best vampire film by far."
    },
    {
      "rating": "2.5/5",
      "review": "Shot really well....decent acting.....just wasn't all in"
    },
    {
      "rating": "5/5",
      "review": "Robert is a FANTASTIC director. The cast was amazing and the visuals were so pleasing to my eyes"
    },
    {
      "rating": "1.5/5",
      "review": "Melodramatic carpet-chewing acting"
    },
    {
      "rating": "3.5/5",
      "review": "I managed to stay awake throughout and it had my full attention but I was just kinda staring blankly at the cinematography and not really paying attention to the story,or hearing any of the dialogue or score, was there a score? If there is such a thing as too much atomosphere, this may be guilty of that. Also, Count Orlok was just too damn ugly for a suspension of disbelief. That said, I’ve seen the 1920's version and I’m not a fan of it, I just really don’t like how the story is constructed."
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved this movie. Great cinematography."
    },
    {
      "rating": "1/5",
      "review": "It bored me. I turned it off with about 30 minutes remaining; it wasn't interesting at all, so why bother?"
    },
    {
      "rating": "2.5/5",
      "review": "Stunning visually, but overall a bit boring and lacking in atmosphere with the exception of some scenes. The actors play the roles they were given well, but I felt that the characters lacked depth and served the story too much. The old English accents in Germany become a bit overdone rather quickly as well. Dafoe and Skarsgard were definitely the stars of the show."
    },
    {
      "rating": "5/5",
      "review": "Great! I saw Jung's Shadow theory in it"
    },
    {
      "rating": "2/5",
      "review": "Cinematography was great pacing was good but just not for me, a little to dark, just a bit to boring"
    },
    {
      "rating": "1/5",
      "review": "Boring, even the possession scenes are a bucket of who cares."
    },
    {
      "rating": "4/5",
      "review": "This movie is very well done. Great cinematography, visual amazing."
    },
    {
      "rating": "2.5/5",
      "review": "Excellent cinematography, makeup and costume design, but this Dracula simply wasn't as good as \"Bram Stoker's Dracula,\" and I couldn't help but compare the two in my head the entire time. For example: \"hmm - Willem Dafoe or Anthony Hopkins?\" The two films are VERY similar, other than the fact that the names have been changed and this one's set in Germany rather than England. The way Count Orlock speaks, I will say, was pretty creepy/cool."
    },
    {
      "rating": "4/5",
      "review": "Was looking forward to it was not disappointed what can you say about this director that hasn't been said already. The guy knows what he's doing and you can tell he loves his job."
    },
    {
      "rating": "1/5",
      "review": "So the movie looked good, I like the visual scenes and everything. But the story… so the only way to kill the vampire is to let him sleep with my wife as he feasts on her until the sun comes up to destroy him. Where’s Blade when you need him ?!! That part sucked for me therefore making the ending kind of lackluster. So basically the monster got what he wanted in the end. Thumbs down for me."
    },
    {
      "rating": "1.5/5",
      "review": "Its a highly irritating movie for a person like me who loves the original movie Nosferatu 1922."
    },
    {
      "rating": "1/5",
      "review": "Great cinematography, but that’s it. The movie sucks"
    },
    {
      "rating": "5/5",
      "review": "Uma das melhores adaptações góticas desta geração, a fotografia do filme é um pouco escura demais porém consegue ser perfeita! Me agradou totalmente. Espero que o diretor traga mais adaptações como o fantasma da ópera e Carmilla:)"
    },
    {
      "rating": "4.5/5",
      "review": "This film is pure gothic horror perfection. Robert Eggers has crafted a haunting, atmospheric experience that lingers long after it’s over. Bill Skarsgård transforms into Count Orlok with terrifying ease, delivering a performance that’s both monstrous and eerily human. The cinematography is stunning—dark, shadowy, and suffocating. Watching the tension build between Orlok and Thomas Hutter’s wife, Ellen, was deeply unsettling. Every shadow felt dangerous, every glance heavy with menace. The sense of dread was relentless, and by the end, I felt like I’d survived something truly horrific. If you’re a fan of slow-burn, atmospheric horror, this is an absolute must-see."
    },
    {
      "rating": "2.5/5",
      "review": "While the atmosphere was lovingly creepy, this remake of the Dracula legend is merely so-so."
    },
    {
      "rating": "5/5",
      "review": "This film is underrated. The gradual introduction of Count Orlok. The attention shifted between characters. It’s captivating. Darkness at its finest. A masterpiece."
    },
    {
      "rating": "3.5/5",
      "review": "10/10 visually with excellent atmosphere, but it is a bit too dragged out feeling (I did watch the \"extended edition\", so that could factor in). Count Orlock is stunning and ruthless, which stands out and makes you pay attention when he is on screen."
    },
    {
      "rating": "1.5/5",
      "review": "Don't waste your time. While I agree the cinematography and costumes are Oscar nomination worthy the dialogue and writing are so comically bad it ruins anything good about the movie."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is the worst thing I have ever watched. This traumatized me to the point I still have daily visions and nightmares on it. No normal breathing living person should ever watch it or want to watch it again. If you are thinking of watching it don't or you'll end up just like me. I hope whoever had the lovely idea to make this burns in hell. Goodnight"
    },
    {
      "rating": "4.5/5",
      "review": "The visuals and pace was great. The undertones of feminism, the struggle of succumbing to our inner demons, and the ultimate sacrifice for freedom."
    },
    {
      "rating": "1/5",
      "review": "\"Nosferatu\" (2025) exemplifies the pitfalls of derivative filmmaking, offering a lackluster retelling that pales in comparison to its predecessors. The film's reliance on clichéd jump scares and uninspired shadow imagery underscores a creative stagnation, failing to capture the profound horror of Bram Stoker's original narrative. Rather than delivering a fresh perspective, this remake recycles familiar tropes without adding meaningful depth or innovation. Viewers seeking a compelling vampire tale would be better served revisiting earlier adaptations that honor the source material's complexity and terror."
    },
    {
      "rating": "3/5",
      "review": "Looks great! Characters over-wrought in high-brow dramatics , yet somehow empty. Eggers lacks an ability to create sympathetic characters. Drab- ula!"
    },
    {
      "rating": "3/5",
      "review": "Now I’m a big bill skarsgard fan so I was all for this movie however a was disappointed. Probably my own fault as I imagined a vampire movie would be a lot differant but this was not that kind of movie. The acting was amazing yes definately however I just found myself rather bored and thinking wtf is that is? At the ending. I probably wouldn’t watch again but I will remain a skarsgard fan!"
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely boring movie. I've seen the classic Nosferatu and didn't care for it much either but I had hopes for this one. It being 2024 you would think they would've come up with better visual effects but no they didn't. I like the dark ambience and I enjoyed Willem Defoe's acting, I enjoyed Skarsgard's voice but that's about it. This movie was so dull it almost put me to sleep. I personally don't think they tried with this movie. That's ok I prefer Bram Stokers Dracula with Gary Oldman over this disaster."
    },
    {
      "rating": "2/5",
      "review": "I laughed a few too many times for what is supposed to be a serious horror movie. I would call it over done, as in distastefully charred and blackened, even at times to be unwatchable. I found the vampire to be anything but alluring, nothing but a stinky old grandpa. Yes, Lily Rose has proven herself to be a real actress, likely even a great one. But this chaotic vehicle, this stretch of cinematic desperation, try as she might, she could not save it. There are some good things about this movie — but all of them are outweighed by the bad. if you liked the Exorcist, this is right up your alley. But I’m sure I never laughed during the Exorcist."
    },
    {
      "rating": "5/5",
      "review": "Scary and well made. \"heavily influenced\" by dracula, Only true fans can pirate the bones from some one else's work and cover them with the flesh of their own creation. This is what we have here."
    },
    {
      "rating": "1/5",
      "review": "Has no value past being a horror movie - so skip it unless you're a horror buff. I found it boring and pointless."
    },
    {
      "rating": "3.5/5",
      "review": "Very scenic and wickedly stunning. I did enjoy Francis Ford's Bram Stokers Dracula more. But this is definitely worth the watch."
    },
    {
      "rating": "1/5",
      "review": "They spent 45 cents on sets for the whole movie. Every scene was shot to hide the rest of the set. There was no script. The actors were just told to make some something up for every scene. The direction was \" Try not to have too many facial expressions\". The costumes looked like they might have been pretty good if you could see them through the greyed out low contrast. Nicholas Hoult has been in two vampire movies and Renfield was the better of the two. Lord Orick looked like Gru with a fake mustache."
    },
    {
      "rating": "1/5",
      "review": "Great lighting etc I just felt this was dull and a little boring"
    },
    {
      "rating": "4.5/5",
      "review": "The new Nosferatu was fantastic—beautifully dark atmosphere and amazing performances all around. It stayed true to the spirit of the classic while adding some fresh twists that kept things interesting. A couple of scenes felt slightly long, but overall, it's one of the best horror films I've seen lately. I'd definitely rate it 4.5 out of 5!"
    },
    {
      "rating": "4/5",
      "review": "While I thought it was a fantastic Remake of the Original silent film of the same name. I only had two problems with this one. I loved the Design of Count Orlock however the mustache really bugged me. However after hearing others positive opinions about the mustache how it brings a human side to him I’ve come to accept just not enjoy it. The other thing is the overwhelming amount of moaning in this movie. I’m just caught off guard from it I just thought it was a bit much and freaky. 4/5 Stars"
    },
    {
      "rating": "3.5/5",
      "review": "Atmospheric version of Bram Stoker's Dracula. The acting was excellent, although the story dragged a bit at times."
    },
    {
      "rating": "4.5/5",
      "review": "After bans and a decades after it's initial release Nosferatu manages to get a hold of a brand new generation. The love triangle takes a vicious turn to end differently than that of Stocker's version, with more enduring audience maybe this was the right era for the Nosferatu's tale to be told. The commentary on society of past is remarkable. With the vintage touch in acting, visuals and dialogues, the movie blends in perfectly with it's premise. Nosferatu is a majestically dark, visually metaphorical and a literally entertaining story that's much close to Romeo and Juliet than count Dracula's horror story."
    },
    {
      "rating": "4/5",
      "review": "I loved the photography of this film, Eggers' taste for classic and realistic aesthetics is definitely sublime."
    },
    {
      "rating": "4.5/5",
      "review": "made me drenched, loved it, give Robbert Eggers more money and more movies and more time and more everything. Man doesn't miss."
    },
    {
      "rating": "5/5",
      "review": "A ghastly, gothic, horror film that was long-due to shake the stratosphere. Nosferatu goes back to the roots of horror, in brings back with it, the terror of the fear of the unknown and purely evil in a way not every horror film can. Nosferatu is a re-imagination of a classic, and while the story may be as old as time and numbed down to nothing; Eggers has a way to stunningly deliver peak modern-day filmmaking. Eggers uses sharp sound design, intricate shots, and a menacing dread to embody such a dark and evil film. His vision for how to re-tell the story also emphasizes the end result, giving a more sinister film with even more substance to it. Eggers not only has awakened Nosferatu, but he has also awakened a welcome return of dark, classical horror."
    },
    {
      "rating": "5/5",
      "review": "What a visually stunning film"
    },
    {
      "rating": "4/5",
      "review": "Very good. Beautiful cinematography"
    },
    {
      "rating": "4.5/5",
      "review": "Finally, some in cinema are getting it. A horror film told the way it was designed to be told, just like Deadpool was designed to be told. Follow the instructions and let the actors bring their craft."
    },
    {
      "rating": "1/5",
      "review": "Not very creative retelling. VERY slow moving. Nosferatu himself is interesting at first, but the labored breathing and attempts to act like a slow motion Predator don't hold up for long. The Renfield character is the most interesting. Maybe some day someone will come up with a good remake of this, but not today."
    },
    {
      "rating": "0.5/5",
      "review": "A terribly dull karaoke version of the original. Borderline parody."
    },
    {
      "rating": "4/5",
      "review": "I like the movie and the how it was filmed.... I also like the detail and how the history was mixed with the lore and mythology.... but I'm also a film nerd. Most of the audience will not get that and that's sad"
    },
    {
      "rating": "1/5",
      "review": "Muy sexualizada y aburrida"
    },
    {
      "rating": "5/5",
      "review": "What did I just watch? A damn good film. I never watched the 1922 or other renditions, so I didn't have any expectations. It's dark, beautiful and horrific. I loved it."
    },
    {
      "rating": "3.5/5",
      "review": "Never watched the original but you can tell this tries to reimagine such a dated horror style in todays day, nonetheless I liked this a lot, not like what you see today, gothically great but I was hoping for a little more at the end"
    },
    {
      "rating": "2/5",
      "review": "Not what I was expecting. Good first half, then kind of fell of for me"
    },
    {
      "rating": "4.5/5",
      "review": "Spektakuler film.in the word"
    },
    {
      "rating": "3/5",
      "review": "Visually, this was absolutely stunning, and I loved the homage to classic cinematography. Lily-Rose Depp’s performance was engrossing. Sadly, Count Orlock’s depiction was not compelling. His manner of speaking and gasping breath was so overdone, it was really campy, but not in a good way. Every scene he was in, I was anxious for him to be off the screen. I really like Bill Skarsgård in other roles, just not this one. Also, I wish the script had followed the original Nosferatu more closely. This was a mash-up of Nosferatu and Bram Stoker’s Dracula, and by mixing them together, for me it missed the mark on both. I really felt bored towards the end, and I was relieved when it was over. Honestly, it’s worth watching for the camera work and for Lily-Rose Depp’s performance, but I don’t plan to ever watch it again. The original Nosferatu and Coppola’s version of Dracula are films I’ve watched multiple times, and will surely watch several more times in the coming years."
    },
    {
      "rating": "3/5",
      "review": "Slow and repetitive film. Far too long. Terrible script. Wooden, amateurish overacting all round. Nice period costumes though. If you like claustrophobic camera work interspersed with a lot of jump scares this is for you. Otherwise, avoid. Like the plague! ;)"
    },
    {
      "rating": "5/5",
      "review": "What a visually stunning film."
    },
    {
      "rating": "4/5",
      "review": "A gothic vampire story. Nothing new, just retelling a rehashed story. I really wanted this to be a horror movie , but its just your standard run of the mill vampire movie. Nothing new. Actors were good."
    },
    {
      "rating": "3.5/5",
      "review": "This movie was very interesting in the beginning but it honestly kinda dragged a bit. The storyline is super freakin awesome tho and the concept is badass but I felt like it would’ve been better without all of the draggy talking parts and they could’ve definitely got without a few scenes. I liked it but the dragging really made me bored and made me lose interest."
    },
    {
      "rating": "1.5/5",
      "review": "I’ve already seen Bram Stoker’s Dracula; nice try."
    },
    {
      "rating": "5/5",
      "review": "A brilliant reimagining of F.W. Murnau's original classic. I takes the vampire genre and drags it down into the monstrous depths of plague and grotesque violence more fitting for a parasitic demon loosed onto the world."
    },
    {
      "rating": "3.5/5",
      "review": "Different and well made. Great movie."
    },
    {
      "rating": "4/5",
      "review": "Kind of slow but solid"
    },
    {
      "rating": "5/5",
      "review": "Nice movie to explore hostorical"
    },
    {
      "rating": "3/5",
      "review": "Beautiful. Grotesque. Another perfect Skarsgård performance. Long-winded. Drawn out."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is disgusting! Not to mention the pacing is poor. Don't watch it!"
    },
    {
      "rating": "2.5/5",
      "review": "This movie had such great potential with its gorgeous visuals! The gloomy, unsettling tone was perfect for a vampire period piece, but the pacing dragged and left space to break all of the immersion. Too much screen time was spent on drawn-out slow-motion shots and tension-building scenes that never quite delivered a satisfying payoff. While the world-building set the stage for something great, the villain lacked the intensity needed to make the stakes feel real. Ultimately, while the film is worth watching for its visuals, it struggles to maintain momentum and falls well short of being a memorable experience."
    },
    {
      "rating": "3/5",
      "review": "A little overdone and trying too hard to be different but it seemed forced. First hour tooooo long. Could have been 30 minutes shorter easily. Dafoe character fell short. Too many overused tropes. Not close to Coppola."
    },
    {
      "rating": "1.5/5",
      "review": "HORRIBLY overacted. I couldn’t wait for this to end. AWFUL."
    },
    {
      "rating": "5/5",
      "review": "The work is perfect, everything from the cinematography, the actors' acting and the music all produce a beautiful and unforgettable harmony. A tense atmosphere is successfully presented in this film."
    },
    {
      "rating": "5/5",
      "review": "An excellent remake of the 1922 classic. The performances, cinematography,costume and set design was amazing. Tim Treakle"
    },
    {
      "rating": "2/5",
      "review": "A tour-de-force of visual flair undone by a choppy pace, pretentious platitudes, and uneven acting that makes for quite an anathema; Eggers’s version shows promise, yet ultimately falls flat under the weight of the cinematic adaptations that inspired it."
    },
    {
      "rating": "3.5/5",
      "review": "Was left a little disappointed by this movie. I love the director and all his other films so figured this would be an instant classic, but it left a lot to be desired. Wasn't scary at all and basically copied the exact same storyline as Bram Stoker's Dacula from the 90s."
    },
    {
      "rating": "4.5/5",
      "review": "Really enjoyed this!! Great cast and great cinematography!!! Very gruesome as well!!"
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed Nosferatu. I loved the backstory and all of the gothic elements. I will say the only disappointment was the look of Nosferatu himself, the mustache was a poor choice. He looked too much like Rob Zombie. I really look forward to Egger’s werewolf film."
    },
    {
      "rating": "3/5",
      "review": "A beautiful movie with great cinematography, but way too bloated."
    },
    {
      "rating": "4/5",
      "review": "Definitely a Visually stunning movie"
    },
    {
      "rating": "0.5/5",
      "review": "What an awful remake. Have tried watching it 3 times and failed to make it through. Stick to bram stocker’s."
    },
    {
      "rating": "3/5",
      "review": "Ok , but the same story"
    },
    {
      "rating": "3/5",
      "review": "The movie is beautiful, the acting is good. I just felt cheated bacause the trailer made it seem like a horror movie but it is basically a love story."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible movie, plot sucked, acting was boring, made 2hours and 15 minutes feel like and eternity."
    },
    {
      "rating": "1.5/5",
      "review": "Eggers must have incriminating photos of Hollywood’s finest. This lacked rhyme or reason from one scene to the next. Same problem as The Northman."
    },
    {
      "rating": "3/5",
      "review": "Greatw atmosphere but too far over-the-top acting. Beautiful scenery but no need to chew it!"
    },
    {
      "rating": "5/5",
      "review": "Incredible cinematography. Orlek was incredible. Great eve for people who don’t traditionally like horror films, like myself. Will definitely watch every year."
    },
    {
      "rating": "3.5/5",
      "review": "Pretty dark. Too confusing at times. The storyline, and ending above all is pretty good. However, just passed the time."
    },
    {
      "rating": "2/5",
      "review": "The over acting, old time English even though it is supposed to be in Germany and putting a mustache on the vampire just made this movie almost unwatchable."
    },
    {
      "rating": "1/5",
      "review": "Fail. This was really lame. I thought I'd love it because I usually love stuff like this, and I've liked Eggers' other films a lot. This was punishingly boring. Lousy writing. I didn't care one bit about any of the characters the whole way through. One star for cool sets and costumes. I also enjoyed watching Eggers' portrayal of mid 19th century Eastern European folk culture. That's about it."
    },
    {
      "rating": "3.5/5",
      "review": "Love the visuals and camera work. Love the new design and how Orlock feasts. But I don't understand why the whole movie is about Orlock having sex."
    },
    {
      "rating": "5/5",
      "review": "A visually compelling film that highlights a classic story."
    },
    {
      "rating": "1/5",
      "review": "Meh. Really doesn't have a lot going for it. Sounds like a lot of movies this past year, more caricaturing than characterizing. No exception here."
    },
    {
      "rating": "3.5/5",
      "review": "Visually stunning but in a darkly lit but realistic way. Very cold lighting, mainly blue grey moonlit, but with the odd bit of yellow glow from candles/fire etc.. A great period piece, such as Eggers other films. More watchable than his other films but not quite as atmospheric as The Lighthouse, but easier to follow. My only main gripe, is it is (Like the original) Dracula, but with the names changed, which for me felt jarring. The original Nosferatu was originally called Dracula, but they didn't have the rights and Stokers estate threatened to sue, so the characters names were changed throughout that movie afterwards. But this reboot looked and felt different, but the story and characters are the same as in Dracula but names changed. I was hoping they would have made the story more unique so that Count Orlock etc seemed like a different story and different vamp to Dracula. Maybe even refer to Dracula as Orlocks original master or something. Still a great movie and worthy remake with great acting, though Gary Oldmans Dracula is still king of Vampires."
    },
    {
      "rating": "4.5/5",
      "review": "This film is a stunning reimagining of its early, expressionist counterpart, which was itself a notable building block within the film industry as a whole. It is a difficult legacy to live up to, but Robert Eggers manages to pull it off. While maintaining a richly dark and unsettling atmosphere, the cinematography provides a whole new, beautiful direction. Nosferatu not only remains faithful to its predecessor but also elaborates upon its characters, shifting themes and agency to weave dimension in a complex modern reimagining. It is the offspring of gothic film of old and the intricate complexity of present cinema."
    },
    {
      "rating": "3/5",
      "review": "I liked the movie in general, maybe a little slow at some points but it shows the story clearly, the actors and actresses are very good, even on some roles that are a little exaggerated, but it fits the story perfectly. The makeup is amazing, especially on Nosferatu, I didn't realize he was Bill Skarsgaard until the end, his eyes are so recognizable and still, the performance and the makeup: Outstanding."
    },
    {
      "rating": "0.5/5",
      "review": "This was awful, the whole movie start to finish was awful."
    },
    {
      "rating": "5/5",
      "review": "Absolutely loved it! Amazing!"
    },
    {
      "rating": "1/5",
      "review": "Nosferatu is everything I hoped it wouldn't be, pretentious and boring."
    },
    {
      "rating": "4/5",
      "review": "I have often told my wife that vampires should be evil and scary, not handsome and sparkly. Well, The Count is ABSOLUTELY Evil and Horrifying. That alone makes this a REALLY good vampire movie. You will not find anything really new here, but keep in mind that it is a remake of an extremely old silent film. It was fresh at the time, and they absolutely captured the terror of the original."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was super boring, slow, and the story was weak. How this has good reviews is hard to believe. Please don’t waste your time on this movie as I did hoping it to get better, it didn’t."
    },
    {
      "rating": "2/5",
      "review": "After seeing this, I just can say that Coppola is a genius."
    },
    {
      "rating": "3.5/5",
      "review": "If this Movie doesn't sweep the Oscars then the Academy is no longer relevant."
    },
    {
      "rating": "3.5/5",
      "review": "This was a good movie but honestly I prefer the original 1922 version of Nosferatu. I felt like the original had a better atmosphere. Also, the vampire itself wasn't very creepy. I expect a vampire to be very thin and gaunt with no facial hair. The original Nosferatu nailed the vampire. Overall this is a good movie with very good acting, I just happen to prefer the original version, but it's definitely worth seeing both."
    },
    {
      "rating": "5/5",
      "review": "Beautifully dark and haunting gothic cinematography and visuals, great plot, amazing actors."
    },
    {
      "rating": "4/5",
      "review": "Dark, Gritty, Dare I say sexy but honestly a bit boring but does keep you interested enough to keep watching"
    },
    {
      "rating": "3.5/5",
      "review": "Creepy good movie. Best of 2024."
    },
    {
      "rating": "1.5/5",
      "review": "Overwrought. xxxxxxx"
    },
    {
      "rating": "1/5",
      "review": "Unbelievably stupid. Felt like I was watching a 60’s B budget horror movie. Truly awful. Skip it."
    },
    {
      "rating": "0.5/5",
      "review": "It wasn't scary, captivating, or even mildly interesting. It was way too long, so many useless scenes, horrible dialogue, the antagonist was a poor excuse for a vampire. And generally just needlessly gross. Its a gross movie that makes you want to take 5 showers after youre done seeing it."
    },
    {
      "rating": "2.5/5",
      "review": "It's a pretty, well-shot movie, but self consciously so. It leaned into the melodrama, even though Eggers was trying hard not to slip into the campiness you find in Coppola's Dracula. Still, Coppola's 1992 film is way sexier, fun, and original. I haven't seen the Northman, but I think Eggers is better when he has a much smaller cast--as he did in the Witch and the Lighthouse, so he can flesh out characters and let the mood build. Here, he seems distracted by the sets and costumes and the need to make every shot look like a Gothic screensaver. I didn't love some of the casting decisions. Unfortunately, this is well covered ground, and Eggers didn't add much to the vampire myth. A good looking movie, and it has it's moments, but it never really catches fire. I came away disappointed."
    },
    {
      "rating": "4/5",
      "review": "“Nosferatu” cannot be called Robert Eggers’ masterpiece, but it is undoubtedly one of the best gothic horror films in recent years. Once again, the director dusts off forgotten genres, myths, and legends, but this is, without a doubt, his first film about love."
    },
    {
      "rating": "1/5",
      "review": "it was lame........."
    },
    {
      "rating": "3.5/5",
      "review": "Very visually appealing. They set the mood and atmosphere right, and that was great. Tried to keep my expectations low, and I did, so the movie was watchable and enjoyable, but nothing superb. I just feel like so many films lack the depth that they are going for. They don't accomplish what they could."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Very creepy and creative!"
    },
    {
      "rating": "1/5",
      "review": "Horrible film and is a recycled plot and premise with an extremely annoying lead actress."
    },
    {
      "rating": "2/5",
      "review": "Meh... way too long needless scenes should have been cut."
    },
    {
      "rating": "4/5",
      "review": "I don't like the appearance of Count Dracula . performance and cinematics were good but not good as Bram Stroker Dracula.but it's a dracula we should check it out once."
    },
    {
      "rating": "2/5",
      "review": "Fabulous atmosphere. Trite dialog. Totally unscary Count Orlok. I quit at the 40 minute mark and may come back to this review if I can ever bring myself to finish this boring dud."
    },
    {
      "rating": "3/5",
      "review": "It was pretty good but we've seen it before, unfortunately The worst part of the movie is Orlok himself. Pretty straight forward empty shell villain, no charisma or character at all. His appearance is also a major step down from the Original. The cinematography was pretty great and the whole atmosphere of the movie was perfect. Honestly I'll probably never watxh this again, why would you when there's 3 other versions of the story on film that have better characters."
    },
    {
      "rating": "5/5",
      "review": "Best horror movie in our history of film."
    },
    {
      "rating": "1/5",
      "review": "Pathetic attempt to remake Bram Stokers 1992 Dracula . Just terrible. That’s why to tv so quickly. Don’t bother"
    },
    {
      "rating": "2.5/5",
      "review": "This movie adds nothing to the genre. Redundant and unimaginative. Every scene triggered deja vu. There were times when I really had to ask myself if I'd already seen this film."
    },
    {
      "rating": "3.5/5",
      "review": "I find it really difficult to rate this movie. It had some really great moments; the cinematography and the acting were absolutely awesome. But I felt as though the story and characters where not as good as I was expecting. The ending also leaves a lot to be desired. It was a solid watch, but it's not something I anticipate watching again."
    },
    {
      "rating": "5/5",
      "review": "This was freaking great. I rarely watch gothic horror, so this was something to get used to, but was not at all bored throughout. Glad to watch a movie that made vampires scary again."
    },
    {
      "rating": "4/5",
      "review": "One of the best vampire movies."
    },
    {
      "rating": "2/5",
      "review": "Count Orloks design is horrible and not even remotely scary. Plot is boring. Very disappointed."
    },
    {
      "rating": "3/5",
      "review": "good themes, decent story and cast, cheesy dialogue"
    },
    {
      "rating": "1.5/5",
      "review": "This movie is brutally long and the ending is very unsatisfying. count orlock is not scary and the heroes are not clever or cool. really a pointless retelling of this story."
    },
    {
      "rating": "2.5/5",
      "review": "Nosferatu is another remake that offers very little difference from the original and previous films. The tone, music, cinematography, special effects are used to its fullest to bring a more horror aspect of pure evil to the legendary vampire but if you seen the other versions then prepare for the same when it comes to the story."
    },
    {
      "rating": "4/5",
      "review": "One of the best movies of the year, it' definitely worth winning the cinematography Oscar, some of the frames were out of the world, it surprised for the scale of the film, given the film takes place in a dark setting, the theme correctly fits in with the unsettling feeling you get watching the film."
    },
    {
      "rating": "4/5",
      "review": "Great costume design and make a great comeback from a legendary story from 1922"
    },
    {
      "rating": "1/5",
      "review": "Went to see this on my birthday, such a waste of time & money. They definitely paid tiktok horror creators to say this was a great movie, multiple said this would be \"the scariest movie of the year\" such bs. This is not a horror movie. I could've gone to see Mufasa, Sonic 3, Wicked, or Moana 2, instead I got this crap. I knew 10 minutes in it was gonna be crap, I should have walked out & got my money back. I unfollowed those creators too btw. I hope they lost all credibility with their followers for saying how amazing this was. I don't even write reviews but made an account just to trash this movie. That's how badly it sucked"
    },
    {
      "rating": "2/5",
      "review": "Very slow and, in my opinion, overacted by everyone except Willem Defoe. I’ve always loved Dracula movies but this one is a yawner. Trying to get through it to see if there is any redemption in the ending. Can’t understand Skarsgard at all, Gary Oldman was so much better."
    },
    {
      "rating": "1/5",
      "review": "This movie was boring and not as good as the original. I didn't even finish watching it. The breathing made it difficult to watch. For some reason it seemed like they fell asleep in mid writing this. Not worth the time to watch. The spell bounding was to devilish had to turn it off."
    },
    {
      "rating": "0.5/5",
      "review": "In a word…. UNDERWHELMING. This movie offered nothing new as far as “Dracula” movies goes. At times it’s so slow and boring it’s almost unwatchable."
    },
    {
      "rating": "5/5",
      "review": "Esto es cine y no las pendejadas de Eugenio Derbez. Obra Maestra"
    },
    {
      "rating": "0.5/5",
      "review": "What a poorly lit film, OMG. MIGHT BE GREAT IF YOU COULD SEE ANY OF THE FRIGGIN NIGHT SCENES. Rubbish."
    },
    {
      "rating": "5/5",
      "review": "Excellent acting and story that was very dark and dreay with lots of rats. The casting was perfect and Bill Skarsgard was really good and very scary as count Orlok the vampire. I really enjoyed this movie."
    },
    {
      "rating": "4.5/5",
      "review": "Bram Stoker's Dracula has a more broad and interesting story, but Nosferatu chooses to use it's runtime to build a tense and subtle film. Every scene is beautiful and dark, with purposeful camera placement. Highly recommended for fans of Eggar's style, and especially for fans of cinema."
    },
    {
      "rating": "5/5",
      "review": "É uma nova roupagem para a história de nosferatos sendo que com mais tecnologia mais aparelhamentos de nossa geração perfeito."
    },
    {
      "rating": "2/5",
      "review": "Okay, so this wasn’t exactly my thing, strictly enjoyment-wise. It's a bit of a slow burn, and for someone like me who's not super familiar with the lore of Dracula or the original Nosferatu, I was pretty lost for the first half. It’s quite atmospheric and full of brilliant cinematography, set design, costumes, and makeup -- definitely Oscar-worthy in those departments. But I was struggling for the first act to find something to sink my teeth into... Enter Willem Dafoe. His character shows up in the second act and, honestly, he brings an energetic shift to the screen and some much-needed exposition, which helped me get my bearings. There are some metaphors or themes lurking under the surface here, if you want to read into that kind of thing. I like Robert Eggers' stuff, and I think this movie is objectively better than my rating suggests, but as far as personal enjoyment goes, this one didn't hit for me. I wouldn’t rush to recommend it, but I can appreciate the craft."
    },
    {
      "rating": "5/5",
      "review": "An absolute masterpiece. The films pace is most impressive. The creative shots and gothic details keep the audience in a constant state of anticipation, amplifying the tension without ever needing to resort to overused jump scares. It’s a testament to how horror can be achieved, with a beauty and elegance that felt like a trance."
    },
    {
      "rating": "3/5",
      "review": "Great cinematography but the story drags at times and a few unnecessarily engrossing scenes took me out of the otherwise amazing atmosphere."
    },
    {
      "rating": "5/5",
      "review": "A new take on the silent film classic! This is the first masterpiece vampire film for Generation Alpha."
    },
    {
      "rating": "3.5/5",
      "review": "Some scenes were forced and were slowing a pace but overall an ok story"
    },
    {
      "rating": "0.5/5",
      "review": "What a snooze fest 😴 of a movie"
    },
    {
      "rating": "3.5/5",
      "review": "Well written and true to the Gothic story. Acting is a little hit and miss at times. Overall worth watching!!!"
    },
    {
      "rating": "5/5",
      "review": "One of the best horror films I've seen in a long time. Not a traditional horror film, but the build up was intense. The cinematography was off its head. Beautiful scenes."
    },
    {
      "rating": "4/5",
      "review": "Suitably atmospheric given the exposure filter was set to low, but like other Eggers work, missing character development (I cared nothing for any characters except its Renfield). Coppola's Dracula had more depth but some over-the-top acting and Keanu's bed-shitting performance, yet Oldman's Dracula had more humanity than Skarsgard. Nosferatu captured The diseased aspect of the Count that I foundfrightening in Stoker. 4/5 fangs on the fangometer."
    },
    {
      "rating": "4.5/5",
      "review": "If you like horror movies, you’ll love this film, great acting very well done. Was entertaining from beginning to end and it was oddly creepy yet believable. Worth your time."
    },
    {
      "rating": "3/5",
      "review": "Hard to watch. The Gary Oldman movie was so good I’m not sure what this adds to the Dracula universe."
    },
    {
      "rating": "2/5",
      "review": "I couldn't finish it. It's well acted, great directing and sound, but literally EVERYTHING has been done many times before, so as a fan of the other incarnations of Dracula and Nosferatu there was nothing new to keep my attention. I couldn't help thinking how much it wants to rip off Dracula, I was so bored I stopped watching about halfway."
    },
    {
      "rating": "2/5",
      "review": "An ok telling of the same old story."
    },
    {
      "rating": "1/5",
      "review": "It’s visually great. The story should be great as well but the acting in it was too over the top and ruined it for me."
    },
    {
      "rating": "4/5",
      "review": "Although the 'mystery' of the film is fairly played out, 'Nosferatu' is a modern masterclass in creating an unsettling atmosphere from a director that knows how to utilise low lighting in an effective way."
    },
    {
      "rating": "3/5",
      "review": "Some good acting but very different to the 1922 version as can be expected. I wish Orlok didn’t have a mustache. Some moments were interesting but some of the time I was bored. I think it could’ve been shorter."
    },
    {
      "rating": "0.5/5",
      "review": "I am glad I did not pay to see this movie. It is visually stunning and the actors are solid. However, the script is trash. I saw the silent movie version of Nosferatu and it was eerily atmospheric! I read Bram Stoker’s Dracula and enjoy seeing various takes on it. This one though is absolutely terrible to me!"
    },
    {
      "rating": "2.5/5",
      "review": "Typical Robert Eggers movie, I think I'm all done with him. I just don't care for his movies. He had a great cast to work with, perfect time period, great villain and still couldn't deliver anything enjoyable. Glad I waited until it was free, don't waste any money on it, but it might be worth checking out if you can stream it for free."
    },
    {
      "rating": "3.5/5",
      "review": "The ending was a tad unexpected, but the movie doesn't really break any new ground in a familiar tale. However, the film is very well done and the cast's acting is good enough to overcome some clunky dialogue here and there."
    },
    {
      "rating": "3/5",
      "review": "Massive horror fan. Love me some gothic intrigue. Great performances but it didn't quite hit a home run. Something was missing. Not sure exactly. Just didn't click. Some silly and predictable interactions towards the end. Watchable, but not a classic."
    },
    {
      "rating": "5/5",
      "review": "Loved this movie more than I expected. Lily-Rose was amazing, as were Bill and Nicholas. I went home after watching it and spent hours reading all about the actors, the director, and anything else I could find online. I am obsessed with Nosferatu and can't wait to watch it again via streaming. The people I went with loved it also. I also watched the original 1922 Nosferatu a few days later."
    },
    {
      "rating": "0.5/5",
      "review": "After watching this movie, I was glad I didn't pay money to see it. What a waste of talent. I watched it to the hoping it would get better. Branstroker s Dracula was more entertaining. How it received a high score on the tomato meter is beyond me."
    },
    {
      "rating": "0.5/5",
      "review": "Disappointing film. The trailer was more compelling than the actual movie. Direct rip-off of Francis Ford Coppola's masterpiece Bram Stoker's Dracula. While the superior acting of Gary Oldman, Anthony Hopkins, Winona Ryder and Keanu Reeves, the cinematography, and the musical score of Ford Coppola's film captivate you from start to finish, Nosferatu fails miserably to make you identify or feel empathy for the characters. The movie was more grotesque and repulsive, then compelling or frightening. As a horror movie fan, I was really looking forward to this film and came away disappointed with how poor this film was compared to the original Coppola masterpiece."
    },
    {
      "rating": "5/5",
      "review": "I actually thought this vampire movie was quite excellently done. Yes, I read a slew of reviews where fans of the original were thoroughly offended. The thing is it had the same title, however the stories were quite unique unto each version. I thought this version was beautifully and expertly acted, shot and directed. It looked like the producers spared no expense. It was a typical vampire story line but I think the acting and the cinematography were a step up and it was like reading a good old book about the subject..in fiction of course. I think it should win several awards. Robert Eggers did a great job directing this story, Willam Defoe, Nicholas Hoult, and Emma Corrin also were impressive. Bravo."
    },
    {
      "rating": "1/5",
      "review": "This is a live review. We don’t know why Orlock has a connection to Lily, there is no background for Orlock. So slow. Trying to hang with the storyline is “trying”. Lily Depp’s acting is good in relation to a ridiculous storyline. She did her best but even that can’t help this movie. OMG. The scene between Lily and Orlock. Who wrote this tripe? “Tell me, what is this insufferable darkness?” Nosferatu. We fast forwarded every few seconds and watched a minute or so until the last 15-20 minutes. It was painful. My husband (who has seen all of Eggars movies) said he would rather watch The Lighthouse (which I saw a preview of and thought it was an SNL skit making fun of a pretentious movie….)"
    },
    {
      "rating": "3/5",
      "review": "Could barely understand the spirit. And it wasn’t too clear what was happening until late in the film."
    },
    {
      "rating": "1/5",
      "review": "I had been looking forward to this and was disappointed and annoyed by it. It felt so unoriginal. I didn't care about any of the characters. Some of the plot details were irrelevant or nonsensical. Most of all I thought the thematic interpretation of the story was just really inane and cliche. We once had what was a really alluring dracula character in some of the older films, and now he just represents complete evil. Boring. No point in him being a vampire; like it had pretty much literally nothing to do with the story other than that now sucking blood is also kind of a sexual act, and the whole story of the woman seemed to hinge on her basically having a necrophilia fetish. The incessant sexualization of her character and the story came across as so basic and blah to me. The scenes of her being posessed and having seizures or visions or whatever were also annoying to me and came across as gratuitously sexual. And it was so long, but any of the long scenes that might have had a chance at being hypnotic or compelling were interrupted by annoying jump scares of evil looking thing, which kind of also just gave it all away. Like the only question the movie really asked was \"Is she gonna sleep with him?\" and then it's like, Great, what an alluring compelling sex scene that was (not)."
    },
    {
      "rating": "4/5",
      "review": "In essence, Robert Eggers' \"Nosferatu\" is a masterful blend of homage and innovation, breathing new life into a timeless tale. Its compelling performances, atmospheric direction, and visual artistry make it a standout in modern horror cinema, offering a chilling and unforgettable experience."
    },
    {
      "rating": "2/5",
      "review": "A total disappointment. The Herzog version is so much better than this - the Murnau version too while we're about it. Orlok is so literally presented as evil with that over the top idiotic monster voice and an assload of AI. The Kinski Orlok was evil but pathetic and so much more dimensional than this version who had nothing creepy about him. He's just so over-obviously \"the bad guy\". As for the Defoe character - ridiculous and silly, such a waste of a great actor. The scenes with the delirious girl reminded me too obviously of the Exorcist. A load of screaming banging blood exploding growling crapola plus wooden acting and too many unnecessary AI scenes (even just Thomas walking in the street in the first scenes). It's not what I expected from what should have been a good remake. All sound and fury...signifying, well, us walking out before the end of this tripe..."
    },
    {
      "rating": "0.5/5",
      "review": "Just horrible. Takes creative liberties for a film that is supposedly based on Bram Stoker’s Dracula."
    },
    {
      "rating": "0.5/5",
      "review": "I didn't expect much as I knew this has always been a work of plagiarism that pales next to the original but this remake makes that even more painfully obvious instead of trying to bring anything new or creative to the table. It is so very long, drab, boring and predictable. It also feels like it's constantly trying too hard and every aspect is over the top to the point of cringe. Do yourself a favor and watch Bram Stoker's Dracula instead."
    },
    {
      "rating": "1/5",
      "review": "My husband and I were both twitching in our seat by the end praying for it to end. So disappointed. Loved the cast but found the movie just blah."
    },
    {
      "rating": "1/5",
      "review": "Watched this film just the other day, was really looking forward to it. Unfortunately I hated it! 😔 Sorry. It was slow to start, and very very boring! It was so dark that I couldn't see what was going on half the time. I have to say that the original silent movie was more atmospheric and frightening! I feel quite sorry for the actors who starred in this new version! It was bland and dreary! I really hope that all who starred in it, their careers aren't in tatters as they are all fantastic actors in their own right."
    },
    {
      "rating": "5/5",
      "review": "Scary, gross, and deeply thoughtful. Robert Eggers is the best at taking his audience and honestly showing them a different time. Nosferatu is an airtight film. A brutal story from a brutal period."
    },
    {
      "rating": "3/5",
      "review": "Beautifully filmed just not my cup of tea"
    },
    {
      "rating": "1.5/5",
      "review": "First of all, why the hell is the main baddie, count Olak shown with a mostache? Has the director even seen the much better and less ridiculous version of the movie that did not need to be remade… it’s like every other vampire movie made… adds nothing but fluff. Why bother? A lot of the scenes were either boring or hilarious.. but not In a good way. Hollywood running low of good ideas. If you want to watch a good movie, then watch the original. Yeah it’s back and white and no sound but whatever. It’s a billion times better than piece of crap."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie. Great cinematography, acting and directing. A vampire movie how it should be. Too many vampire movies like Dracula have become a romantic/horror, which has never made sense to me. They are undead creatures who feed on the living yet too many stories are driven by their love for the main female character, when you think of what a vampire is you don’t think eternal love as their drive, their passion, but rather addiction, lust, sex, control and despair. Nosferatu gives you a vampire movie of exactly that. It’s not really the horror aspects that makes this movie stand out but rather the drama. Even if you’re not a fan of horror, but love well made movies than this a must see and a must own."
    },
    {
      "rating": "5/5",
      "review": "This is a masterful film from Robert Eggers. The lightning is masterfully used in this film -- most lighting originating from fire or the moon, which casts beautiful, yet terrifying shadows. Certain shots evoke a sense of horror unseen in film - an example would be the horse-drawn carriage in the film's first act. The cast is perfect. The film revisits Eggers's familiar choral screeches that send shivers down the viewers spine. On par with The Lighthouse and The Witch, this film has horrific elements without relying on jump-scares or sound-scares."
    },
    {
      "rating": "1.5/5",
      "review": "Emilia Perez has a twin brother! So boring!"
    },
    {
      "rating": "1/5",
      "review": "Nice looking,good acting but one of the most boring movies i have ever seen."
    },
    {
      "rating": "2/5",
      "review": "Ok... Why does count orlock have a porn stash??! This movie was slow and boring. I love a good vampire flick but this one is kinda ridiculous. There were very few scary moments and I really didn't care about any of the actors. The only background story starts with a chic having a seizure but it never goes into any depth about how she became his (Orlocks) soul mate or whatever. I'm going to watch again and if I see something I missed, I'll come back and change my review"
    },
    {
      "rating": "3/5",
      "review": "Not nearly as scary as it should have been but was still a solid interpretation of the original film."
    },
    {
      "rating": "4/5",
      "review": "Enjoyed the movie would score it 7/10 or grade C+"
    },
    {
      "rating": "4/5",
      "review": "Never saw the original. This was a very familiar story but well acted and darkly unsettling at times. The manner in which the vampire shows off his powers is uniquely interesting in this movie. A surprisingly fresh take on vampire movies from a movie that started them all. Ending was not my favorite but interesting."
    },
    {
      "rating": "5/5",
      "review": "One of the shining lights of 2024… amazing in all filmmaking aspects. I personally don’t love how it ended. However the pure power of this film can not be denied."
    },
    {
      "rating": "4.5/5",
      "review": "Creepy and dark. Excellent cinematography and acting."
    },
    {
      "rating": "2/5",
      "review": "beautiful cinematography overall. pretty decent acting , just incredibly slow paced and very boring."
    },
    {
      "rating": "4/5",
      "review": "Nosferatu was a well directed and overall good movie. Me and my dad enjoyed it, that's all that matters."
    },
    {
      "rating": "2.5/5",
      "review": "Till William Defoe arrives, the movie goes in a so messy way. There aren't connections or soft transicitions between the scenes. Yet, after we see William Dafoe movie gets better. Cinematography could be better, I mean you have a great era to picture with its color, outfits and old towns, you could have done better. Finally, it's not a good movie, but if you like the era and the old folk tales, you can watch when you have nothing to watch."
    },
    {
      "rating": "4/5",
      "review": "Only have 4/5 stars bcs I hate when kids are harmed in movies. Otherwise it was creepy and an awesome remake! Nosferatu was scary and had the iconic nightmare inducing long fingers and nails."
    },
    {
      "rating": "4.5/5",
      "review": "Not perfect, but a welcome breath of fresh air to the vampire movies subgenre. Renewed the image of the nosferatu vampire, the monstrous vampire, on the cultural mindset of this generation, and I can't wait to see what this will inspire in art. Robert Eggers is still on his win streak."
    },
    {
      "rating": "4/5",
      "review": "I still think Herzog’s is the best but I really dug this one. Only real gripe: subtitles are needed to understand most of what Orlok is saying. The voice and accent (which I did like for the most part) kind of muddies the dialogue. The mustache didn’t bother me either (because for some reason that was a big issue for people?). …Gonna be thinking about that ending for a while…"
    },
    {
      "rating": "3/5",
      "review": "Not exactly a bad movie just expected more from Eggers. Pretty much a straight forward Dracula story with nothing new added"
    },
    {
      "rating": "4/5",
      "review": "Great movie and well directed. A chilling experience!"
    },
    {
      "rating": "4.5/5",
      "review": "I couldn't stop watching. I was simply blown away by the excellent execution of the gothic horror genre. Great performances of all the cast but especially Lily. Also, I loved that Eggers chose to do analogue filming as it definitely heightened the aesthetic he was going for in the film. Especially in wide angle shots which depicted the desolated and dark roads. I would watch this again at some point."
    },
    {
      "rating": "4/5",
      "review": "The movie is good, it manages to scare and bring the gothic style with a modern approach."
    },
    {
      "rating": "5/5",
      "review": "A nightmare printed on 24mm celluloid, Nosferatu dives headfirst into old school vampire folklore with amazing performances and terrifying scares."
    },
    {
      "rating": "2.5/5",
      "review": "The negative reviews were spot on. More gothic than creepy. Predictable and boring although the cinematography and acting was well done."
    },
    {
      "rating": "2.5/5",
      "review": "The acting was not that impressive, the story felt sometimes boring."
    },
    {
      "rating": "5/5",
      "review": "Disgusting and at the same time wonderful, beautiful photos and original scenography."
    },
    {
      "rating": "3/5",
      "review": "Cinematically beautiful, good cast, good acting. But I echo other’s sentiments, slow and boring. This perhaps is going to be appreciated more in academic circles, but for the regular movie watcher, not very entertaining and falls flat."
    },
    {
      "rating": "4/5",
      "review": "The artistic elements are incredible, meticulously crafted—Robert Eggers never disappoints in that regard. The story does feel repetitive at times, but it’s still well worth watching."
    },
    {
      "rating": "1.5/5",
      "review": "This was awful. Didn’t realize Nosferatu was just a legit ripoff of the Dracula novel - I thought it was an original vampire story. Nope. But this movie tried to hard to create an “atmosphere” - dark and erotic I guess - but just came off boring and cringe. Stream it but doubt you’d want to finish it."
    },
    {
      "rating": "4/5",
      "review": "Creepy guy from castle is in love with a lady who Is married. Married guy does not want love triangle with creepy guy in castle. Creepy guy likes dark rooms and is very mysterious."
    },
    {
      "rating": "3/5",
      "review": "The acting was really good but the movie is okay.I was really expecting more from the hype of Nosferatu."
    },
    {
      "rating": "4/5",
      "review": "Great job and story line. Solid acting from everyone on set. Very nice use of sound and cinematography Go see it and enjoy! 👍🏼👍🏼👍🏼👍🏼👍🏼"
    },
    {
      "rating": "1/5",
      "review": "Never wrote a review before, had to make one just to review this 'movie' do not watch, so extremely boring and slow, and builds up the whole movie just to have such a disappointing ending. Whole movie is a snoozefest... Rather get haunted by Nosferatu than watch this thing again."
    },
    {
      "rating": "1/5",
      "review": "The trailer made me want to watch this film however this movie was not what was expected. It was slow paced. As I watched I had questions I thought would get answered but of course they didn’t and the ending was almost grotesque and hit a strong Necrophiliac vibe. Not for me."
    },
    {
      "rating": "3.5/5",
      "review": "Beautifully crafted and artistic, great cast and well acted. But something is missing. Can’t put my finger on it. Just know I probably wouldn't want to watch it again."
    },
    {
      "rating": "3.5/5",
      "review": "Certain parts were a little hard to follow, but the acting was INCREDIBLE on all sides ☠️🖤🤍⚰️"
    },
    {
      "rating": "0.5/5",
      "review": "I thought the movie was extremely boring and hard to follow. I went to see it because of the amount of good reviews it had but I was left extremely disappointed and wanting more. I stayed to the end despite the person I was with asking to leave early"
    },
    {
      "rating": "0.5/5",
      "review": "So incredibly boring. 3 hours for no reason. Didn’t get scared 1 time. Boring asf and not scary."
    },
    {
      "rating": "4/5",
      "review": "good effects, story, plot, excellent cast but the ending was not very good, if it had been the same as the 1922 film it would have been excellent."
    },
    {
      "rating": "5/5",
      "review": "I almost didn’t go to the cinema for this one because I’d heard mixed reviews but glad I went and made up my own mind. It was dream-like and heavy with atmosphere, lots of clunky wooden flooring and doors (as it should be!) and a cast that for once wasn’t unbalanced with a big name (no offence) and all the better for it. It has been a while since I’ve seen an audience flinch at times. Closer in style to the original (seen it on a theatre screen) and preferred it to the Kinski version. If anything I’d’ve liked a longer film so that we could have seen more of the plague scenes."
    },
    {
      "rating": "3/5",
      "review": "Great film for students studying film. As a regular movie goer though, it was very slow and falsely advertised to be the scariest movie of the year. Typical visual over substance type of film."
    },
    {
      "rating": "3.5/5",
      "review": "The sound of this movie is what really makes it eery. Watch it somewhere with a very good sound system. Despite being excessively pacy at the start, and every character passing out every five minutes, it can create such a unique and outstanding environment that it makes you really dive into the story. The production of this movie is incredible and unbelievably realistic, the art direction does an amazing job with only a few colors to work with."
    },
    {
      "rating": "1.5/5",
      "review": "All style, with little substance. One of those remakes so devoid of anything original that it tarnishes indirectly the films that came before it, including the original film, Werner Herzog's retelling of the story, and Shadow of the Vampire."
    },
    {
      "rating": "4.5/5",
      "review": "It was a great time on Christmas Day! Gothic horror done right. Two of my favorite genres blended together and amazing performance all around. And a very unexpected performance from Lily Rose that blew me away as someone who had no knowledge on prior work. I don’t buy many movies on 4k but this is one of those that I added to my collection. I will say however the movie did drag on just a tad bit too long in some areas which knocks it down some points but overall loved it and a Christmas movie for me every year now 🤣"
    },
    {
      "rating": "3/5",
      "review": "It's a movie full of great performances, effects and atmosphere but it just isn't my kind of movie personally. It isn't as straight forward as a lot of vampire flicks, but I think many movie fans will enjoy this. Easily the best part is Willem Dafoe's character, he was actually very likeable and interesting. I kinda wish we get a sequel just for more of him, that is a joke, but he is an incredibly well written character, so I'd say go see it just for him."
    },
    {
      "rating": "5/5",
      "review": "Just go and watch it !!!! Brilliantly done"
    },
    {
      "rating": "3/5",
      "review": "Meh. Felt like a pretty unnecessary remake. Ultimately the final product comes off feeling quite flat and uninspired, outside of a few very brief sequences. Wholly inferior to Coppola's Bram Stoker's Dracula."
    },
    {
      "rating": "5/5",
      "review": "Zu wenig Marmeladenbrote. Padington war besser."
    },
    {
      "rating": "0.5/5",
      "review": "In one scene the character Anna says Anna says \"What is this insufferable darkness?\" I think she was referring to the film-makers. Nosteratu 1922 had better lighting. I dont understand why directors cannot depict night time, or a dark scene yet make it watchable. Much of this this is either completely dark screen, or dark enough it is hard to make our the scene. Bram Stroker Dracula, Dracula Untold the best."
    },
    {
      "rating": "0.5/5",
      "review": "The movie was stupid and a waste of time. There wasn't much of vampire anything."
    },
    {
      "rating": "2/5",
      "review": "Borderline grotesque."
    },
    {
      "rating": "1.5/5",
      "review": "I was really excited for Nosferatu, but honestly, it left me cold. The atmosphere is undeniably gorgeous, and the cast is stacked, but the pacing drags, and the scares just never land. It feels more like a moody art piece than a truly terrifying horror film. I kept waiting for something to really grip me, but it never happened. Two stars for the visuals, but I won’t be revisiting this one."
    },
    {
      "rating": "1.5/5",
      "review": "This is a bad movie... Sorry; the raving reviews are b.s. I'm an easy critic too; just terrible. Nosferatu's is breathing like a lung cancer patient on a bullhorn, the ENTIRE movie. It's distracting and takes away from every scene he's in. The first half is almost unwatchable; terrible directing. But if you can get through 70%, the last 30% of the movie is watchable (still bad all around)."
    },
    {
      "rating": "0.5/5",
      "review": "Utter rubbish - I am being polite"
    },
    {
      "rating": "4/5",
      "review": "I enjoyed this reboot. It follows the original 1922 very well."
    },
    {
      "rating": "5/5",
      "review": "I bought the movie as soon as it became available and watched it 3 times immediately over and over. I love everything about this film. Its in a league of its own. I love the Thing, American werewolf in London and Fright Night. Nosferatu stacks up and will hold its own over the tests of time."
    },
    {
      "rating": "5/5",
      "review": "Everything was perf, the actors, the prosthetics, the costumes, the directing—Count Orlok is daddy af"
    },
    {
      "rating": "2/5",
      "review": "I wanted to like this more than i ended up liking. Many scenes were so cringe, with such bad acting. Like an amateur theater play, portraying what some of these scenes should look like. Then there are the cuts: they feel so abrupt, in scenes that should have been given time to breathe. While other scenes, drag on for too long and look silly. Speaking of looking silly: Nosferatu's looks are not scary at all; they are almost comedic. And the way he speaks is just annoying and boring, making the pace even slower. In the end, i was left very disappointed. And don't even get me started with the ending... are we supposed to believe Nosferatu fell for that? I know it's a movie and you have to suspend disbelief, but it's ridiculous how a guy who carefully planned everything forgot the most important thing... I understand why, but it is still ridiculous. I only enjoyed the cinematography, and the first few minutes of the movie. They were actually intriguing. And you could feel Nosferatu's presence, bringing this creepy tension to the plot. Sadly, that got lost along the way and the scenes became repetitive. Overrated movie, for sure..."
    },
    {
      "rating": "2.5/5",
      "review": "Has many things working for it, and many working against it. Beautiful to look at, but longer than it needs to be, and very little character development considering how long it gets. When it ended I thought to myself \"it was a good movie but I wouldn't watch it again\". I did saw it again, but I didn't get past the second half before turning it off. I wish Eggers would spend less time in trying to make everything 'period perfect' and more time fleshing a compelling story. It's unfortunate his best continue to be The VVitch."
    },
    {
      "rating": "4/5",
      "review": "A masterfully created movie, with almost everything done really well. The production design is beyond great, and there are plenty of shots that are just beautiful. The story and characters are all interesting too, and expand well on the original. And this is the first genuinely scary horror movie I’ve seen in years, perfectly building tension and dread until (multiple different times) it reaches a breaking point. The tone is definitely a bit too serious for the campy story being told, but the movie more than makes up for it. The Orlok design isn’t great though. It’s intimidating, but lacks the creepiness of the original. And the mustache sucks."
    },
    {
      "rating": "1/5",
      "review": "The most disappointing movie I can recall. A bad version of Dracula."
    },
    {
      "rating": "2/5",
      "review": "No offense given but it was kinda overhyped. First of all great actors (exept Lily), great style and stunning visuals. I really feel this film does the gothic style justice and the overall idea of the plot is good, but it's executed poorly. Some scenes drag on for way too long and others are just way to short. The acting is good but the characters are bad if that makes sense. Many scenes are just unnecessary or drag on for way to long. Many actions made by the characters don't make sence and just leaves you confused. I feel like this movie sacrifices plot enjoyability for style and dramatic expressions and exposition. Or a better way to put it \"It insists upon itself\""
    },
    {
      "rating": "3/5",
      "review": "Whole lot of nostalgic whimsy, quite a bit of which is possibly unintentionally funny; there are some laughable lines and scenes, but in the end it entertains and does not bore."
    },
    {
      "rating": "2.5/5",
      "review": "You lost me at chicken legs."
    },
    {
      "rating": "2/5",
      "review": "People still eat at McDonald’s which is why the score is high… this is a below average film. Pace is terrible … tension completely destroyed Watch the original 2/5 at best"
    },
    {
      "rating": "1.5/5",
      "review": "The worst Vampire movie I've ever watched. Character development is nonexistent. The dialogues are banal and bland. The whole story is a sequence of disjointed scenes. Zero immersion. And the figure of Nosferatu is laughable, like transplanted from a John Carpenter movie. Even Defoe's acting isn't enough to save this movie from a future of falling into oblivion. 1,5 stars for the camera man, though. There are so many more worthwhile movies: go watch Murnau's original Nosferatu, the Polanski's lovely The Fearless Vampire Killers, or Coppola's Bram Stoker's Dracula."
    },
    {
      "rating": "1/5",
      "review": "Recycling makes for a boring movie especially when other iterations did it better. On top of this the long, dark, dragged out scenes and overwrought scripting and melodrama heap more layers of boredom and disinterest creating an overall sense of restless tiredness in the viewer."
    },
    {
      "rating": "5/5",
      "review": "An excellent vampire film! The ambiance is amazing, and it holds the story of the original Nosferatu/Dracula well. It really needs to be seen on the big screen as the cinematography is too grand for a small screen."
    },
    {
      "rating": "3.5/5",
      "review": "The most movie, movie, Ive watched in a while. It was good, acting was fine, gothic horror, The lead up to count Olaf was entertaining and enjoyable. Nothing really crazy. Very High budget horror does its thing."
    },
    {
      "rating": "1.5/5",
      "review": "Nope. It felt contrived. Trying too hard to be scary. Borrowed from The Exorcist. Nosferatu was more like some actor with a costume on. Whats up with that thick Luigi mustache?And that voice...WTF !"
    },
    {
      "rating": "4/5",
      "review": "Hauntingly beautiful period horror, grotesque and romantic at the same time - wonderful."
    },
    {
      "rating": "4/5",
      "review": "Spooky boy, try not to be on your phone, it takes away from the horror."
    },
    {
      "rating": "2.5/5",
      "review": "Going into this film after growing up watching the original Noseratu I must say I was slightly disappointed. The eerie factor is there with a few jump scares but I couldn’t help but think the Count looked more like Mario than a vampire…"
    },
    {
      "rating": "5/5",
      "review": "Nosferatu reminds me of Will \"JiggleBooty\" Fartmeister"
    },
    {
      "rating": "1.5/5",
      "review": "The passing was a bit too slow at the beginning. Once Nosferatu was introduced, his character design made him laughable. The movie didn't know if it wanted to be a monster movie or a demonic magical movie. Once the movie picked up, it became a bit interesting. I didn't care for the sexualization of the lead actress and Nosferatu didn't seem necessary. It read as comedic because of the aforementioned laughable character design of Nosferatu. Also, the audio was a bit off. The music and sound effects were full and loud but the dialogue sounded thin and disconnected. Overall the movie was somewhat entertaining but mostly disappointing."
    },
    {
      "rating": "3/5",
      "review": "Not a bad film at all, acting is good, effects are great, but if you’ve seen Bram Stoker’s Dracula, it’s almost the same retelling with a more sinister and macabre atmosphere, but it feels rushed. The Coppola film is slower, but more involved, and more superbly acted."
    },
    {
      "rating": "4/5",
      "review": "Visually stunning with some fine acting performances although a big slow at times. Which is forgivable in that Eggers was move interested in making a pure horror film than he was an action movie featuring a vampire. I also appreciated the fact it didn’t stray too much from the original 1922 Nosferatu. What I didn’t appreciate was the sexual content. It was unnecessary and pointless."
    },
    {
      "rating": "4/5",
      "review": "Tale as old as time, told a thousand ways... and it still works. Beautiful."
    },
    {
      "rating": "4/5",
      "review": "A correct adaptation that will not become a classic like its original, but which undoubtedly shows that Robert Eggers is one of the best directors today and that each of his projects leaves us with substance and things to comment on and be grateful for. A mind-blowing staging, powerful performances to leave us with a very good film that has its flaws, but which do not take away in any way from the merits of a film that enters among the best of 2024 without setbacks."
    },
    {
      "rating": "1.5/5",
      "review": "A Plastic, Rushed Horror. This movie rushes through moments that should have tension and drags through others that should move fast, making it feel uneven and lifeless. The lighting is great, and some visuals are striking, but everything else feels plastic—overly polished, artificial, and forced. Her performance is so overacted it becomes distracting, adding to the theatrical, self-indulgent style that’s become exhausting in modern films. Not every frame needs to be a painting, not every scene needs to feel like a stage play. Can we just watch a movie that flows? This one doesn’t. Instead of being eerie or immersive, it feels staged and hollow. There’s no real fear, no real tension—just a series of pretty but empty moments. Rating: 2/5"
    },
    {
      "rating": "0.5/5",
      "review": "I don't get all I watch is horror and killing and scary movies but this was just a eternal battle with myself to even try and finish this movie this movie was so stupid to me it's like I see a lot of people say they like this movie I don't understand what they like about it them people have got to be paid actors to get this movie boosted ain't no way in hell anybody like this movie that much to give anything more than one star if your reading this jst YouTube the killing scene and I just save you 2 hr of your life for anything worth it.. I DNT normally do this but this movie made me"
    },
    {
      "rating": "2/5",
      "review": "The movie was slow paced with certain scenes just being unnecessary. The cast was all around pretty good as except for lily rose whose performance was over dramatic and seemed to have the same energy as a high school play. Avoid this one, don't waste your time."
    },
    {
      "rating": "1/5",
      "review": "I can't understand how Nosferatu has received so many good reviews! This is the first movie for many, many, many years that I've nearly walked out on (and probably still wish I had!). The voice of the vampire alone drove me crazy, so irritating! As was the long mexicana mustache! The extended claw hand shadow scenes made me think of a 60's throwback. It was nearly comical. Nosferatu was unnecessarily long amd drawn out. That's a good two hours of my life I won't get back! I've never left a review until today, but Nosferatu was so bad I needed to vent."
    },
    {
      "rating": "3.5/5",
      "review": "Slow moving but very good creature."
    },
    {
      "rating": "2/5",
      "review": "The story arc was anticlimactic, with such a build up from the characters. The film itself is visually stunning. The cinematography is the hidden character in every scene. Absolutely fantastic work on the set design and ambience to side with delivering the tone of the story at the given moment of a scene. The acting truly delivered the beet each brought to the set. Bill Skaarsgard delivers an impressive performance, impressing upon the viewer a different and original perspective on the vampire lore - a walking bygone man representing pure decay inside and out! The costume and makeup was also spectacular! So why the two stars? The plot is not great and doesn’t even congeal into a semblance of story. No exposition to discuss the reason that Orlok is so weak he can’t travel, but has the psychological strength to torment a woman from another country all the while compelling another man, also a country away, to do Orlok’s bidding. This isn’t proportional with his diminished abilities elsewhere. Lastly, he has a village of people outside his castle, why didn’t he use them? Too many plot holes, unfulfilling character and story arcs, and Willem Dofoe shows up as the cop from Boondocks Saints, just a few hundred years in the past."
    },
    {
      "rating": "3/5",
      "review": "An excellent movie, but I knocked two stars off for the ‘stache."
    },
    {
      "rating": "5/5",
      "review": "I love this movie!!! The atmosphere is set perfectly, and acting is impeccable! This movie has everything a gothic horror lover could want! Excellent!!"
    },
    {
      "rating": "3/5",
      "review": "Finally a movie that doesn't make you want to leave the cinema immediately and demand your money back. Not a masterpiece, but definitely good entertainment."
    },
    {
      "rating": "4.5/5",
      "review": "Disturbing horror, very well done. You may have nightmares!"
    },
    {
      "rating": "1/5",
      "review": "Horrible movie, how it has good reviews. I thank God everyday for some reason we delayed going to watch it in the theater and we lost only $19 renting it when it became available for rent. DO NOT RECOMMEND IT"
    },
    {
      "rating": "2/5",
      "review": "Super slow, couldn't connect with the actors who have great performances but were overshadowed by overused and overdramatic camera and sound tricks. I could tell the story in 5 minutes but it took them over 2 hours."
    },
    {
      "rating": "1.5/5",
      "review": "The regisseurs need to transform Dracula or Nsferatu into a sexdriven deamon not only reduces the horrror aspect of the figure but also subverts the message of the original story. The visuals are stunning, allover the regisseur should search someone to write the scripts for him then there is much potential in the genre for him."
    },
    {
      "rating": "4/5",
      "review": "A new Robert Eggers film is always an exciting prospect, and Nosferatu lives up to expectations. There is so much sumptuous gothic detail to enjoy, and Bill Skarsgård's Count Orlok lives up to expectations as the obsessed monster who was once human and still has all the self-destructive weaknesses that came with it."
    },
    {
      "rating": "1/5",
      "review": "Plot was hard to follow, some parts of the movie are unexplainable and not in that good way that some movies leave you wondering how some things happened/Ended. You watch a movie like this to see how they get through it and conquer it but that doesn’t happen, very underwhelming, nosferatu literally says the plot of the movie and why let it drag on if you’re gonna tell us how the movie is going to end, great acting though but would never recommend, Don’t waste you’re time watching it please."
    },
    {
      "rating": "5/5",
      "review": "Nosferatu is an amazing horror film that actually wants to scare you"
    },
    {
      "rating": "1/5",
      "review": "Partially good, but fell asleep at the end. Missed the last 20 minutes because it got boring at a certain point."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie i've ever seen"
    },
    {
      "rating": "4/5",
      "review": "Mesmerising, consuming & atmospherically gorgeous. The gothic fable is brought to new life by excellent direction, superb cinematography & sublime costuming. While not intended to be shockingly scary or frightening, this updated Nosferatu is instead a \"less-is-more\", old-timey, paced rendezvous into a timeless story. Every creepy moment is well thought out & faithful to the original 1922 classic; a true triumph in the face of today's typical hyper-flash edited superficial crap."
    },
    {
      "rating": "2.5/5",
      "review": "Nosferatu me parece u n intento muy desperado de Robert eggers de volver con un éxito como lo fue el faro, me parece que está cinta intenta ser muchas cosas y nada a la vez. con unos primeros 40 minutos sonsos y monótonos que puedes aprovechar para ir al baño. En la que premisa es una pareja con problemas maritales, y siendo la primera escena una violacion mediante telepatía. que aportan poco a la trama principal y que terminan alejando la atención de lo que en realidad importa, siendo el foco principal Lily deep con una actuación muy decente pero jamás siendo superior a la versión de 1979 siendo lo más rescatable de dicha cinta mermando lo poco llamativa que es la paleta de colores de cada escena pero todo da un cambio de 180 grado cuando aparece en escena willem dafoe dando vida al profesor albin cada escena en la que parece vale la pena. En esta cinta muy pretenciosa llamada nosferatu."
    },
    {
      "rating": "5/5",
      "review": "Ótimo filme, ficou bem mesclado o classico com o moderno!!!"
    },
    {
      "rating": "5/5",
      "review": "Cara de longe um dos melhores filmes de terror que eu já assistir, eu assistir o de 92 e achei um \"remake\" digno cara, a dublagem ficou ótima a fotografia nem se fala então, a ambientação os diálogos, a história por mais que ela tenha alguns furos e seja um pouco fraca é boa, atuações são impecáveis cara, a maquiagem nossa cara perfeito, eu me encontrava muito ansioso para assistir ele e confesso que atendeu a todas as minhas expectativas, parabéns prometeram tudo e entregaram o que prometeu.🖤"
    },
    {
      "rating": "3/5",
      "review": "I enjoyed it, mostly for the cinematography and the atmosphere. The plot was pretty dumb. Many people will find the pacing to be too slow."
    },
    {
      "rating": "3.5/5",
      "review": "Muy buen filme para aquellos que buscan un toque de terror,tiene una ambientación excepcional con una muy buena calidad en la fotografía,eso sí,si eres una persona sin conocimiento previo de la película,llega a parecer algo tediosa. Pero las actuaciones son increíbles y la trama es un 10/10"
    },
    {
      "rating": "0.5/5",
      "review": "What is this? Yeah good acting, good direction, good photography. Cool visuals, make up, and costumes. However story is non sense. Beforehand i didnt watch the 92 movie barely know about Dracula. So for me without pre acquired knowledge this is a big No."
    },
    {
      "rating": "4/5",
      "review": "I thought it was decent, one of the best remakes yet. It would be 5 stars if they didn't ruin nosferatu's look by giving him a weird ass moustache? Why on earth did that do that? Doesn't look anything like the original character that everyone knows. It just looked like some weird pale russian dude."
    },
    {
      "rating": "4/5",
      "review": "A scary, spooky, and overall great retelling of a classic. If you like jump scare shlock in your horror look elsewhere."
    },
    {
      "rating": "4.5/5",
      "review": "Beautifully turned a simplistic horror plot into something great through acting and art direction. Dafoe steals the show."
    },
    {
      "rating": "5/5",
      "review": "One of the best vampires movies made."
    },
    {
      "rating": "3/5",
      "review": "Can't handle Leni's forehead and bullshit."
    },
    {
      "rating": "2/5",
      "review": "No real plot just dark magic plot armor and for the shock and awe."
    },
    {
      "rating": "3/5",
      "review": "Vampires but slow as molasses in spots."
    },
    {
      "rating": "5/5",
      "review": "I have never watched the originals, and I wasn't expecting a \"horror\" movie with jump scares or over the top gore. It was a good drama, and I was not disappointed. It had good acting, and it maintained my interest throughout. It is slow building, but never did I feel like it was without reason. I'm sure it's not everyone's cup of tea, but I enjoyed it."
    },
    {
      "rating": "3/5",
      "review": "Oh for Gods sake. The first half is Nosferatu. The second half is Dracula. People who love the original masterpiece and the Werner Herzog remake will be disappointed to see Ellen’s sacrifice, which is the heart and soul of the story, completely wiped out of the script in favor of the ubiquitous team of men and one woman running around searching for the vampire so they can kill him. There’s a subplot of Ellen having had a teenage affair with Orlock and her writhing around possessed by …him? Her desire for him? Is a combination of The Exorcist and The Crucible. I came to see Bill Skarsgaard as Orlock because he has the bone structure and expressiveness for the role. But they buried his face in prosthetics and made him growl all his lines. It’s infuriating. I give the movie 3 stars because the cinematography, colorization, sets, and costumes are phenomenal. But the tedious deviation from the classic story wasted everyone’s talent. This Nosferatu is a procedural in the second half. I’m so sorry."
    },
    {
      "rating": "4.5/5",
      "review": "I definitely enjoyed this movie definitely brought back a lot of memories of like the old self Frankenstein and stuff like that I like how they give a fresh look to the whole vampire look and how a new story could be told not the same old same old that you always see"
    },
    {
      "rating": "2/5",
      "review": "The acting was good, the plot was underwhelming"
    },
    {
      "rating": "0.5/5",
      "review": "Very slow paced and boring. This was the first movie my mom and I left early because the plot was so slow."
    },
    {
      "rating": "1/5",
      "review": "Beautiful photography, but I didn't understand—was it a parody or just an overuse of old clichés and over-the-top performances?"
    },
    {
      "rating": "5/5",
      "review": "you know mu buddy spongebob invited me to watch this"
    },
    {
      "rating": "3/5",
      "review": "Kinda didn’t make sense"
    },
    {
      "rating": "4/5",
      "review": "I actually spent my hard earned money on this movie and at the big screen. Was worth it, all the gothic vibes I was expecting and a fresh take on the Count. Very much a Eggers film, did not disappoint. My only complaint is that it could have been scarier, there was no true horror just creepy vibes."
    },
    {
      "rating": "4/5",
      "review": "A mesmerazing gothic film that takes the classic Dracula tale to another nevel. The film is brilliant on its acting, photography, and how Eggers directs suspenful moments. But, the best of this movie, is how manages to be both sensual and horrifiying at the same time."
    },
    {
      "rating": "5/5",
      "review": "Bram Stoker’s Dracula as a moving painting. A must see!"
    },
    {
      "rating": "2.5/5",
      "review": "There are many film reviewers on YouTube and I doubt anyone bothers to watch them all when deciding whether to go to the cinema and watch the latest movie. Me - I have two or three 'trusted' reviewers who, over the years, I've come to find their tastes in movies align with my own pretty faithfully. In short - I trust their opinions. And all three gave 'Nosferatu' glowing reviews. This, coupled with my general love of horror films, made me buy my popcorn and take my seat. Now, you'll have to forgive me for not know too much about how this vampire story came to be, but I believe that it was a deliberate attempt to 'retell' the story of 'Dracula' but the film-makers (in the original and to this day) weren't allowed to use the character names and settings etc. I really enjoyed 1992's 'Bram Stoker's Dracula' and, to put it bluntly, I just felt like I'd rather watch that. I never realised that 'Nosferatu' stuck so closely to the plot of 'Dracula.' Ultimately, what you have here is a beat for beat 'remake' (with a different ending). Therefore, nothing really took me by surprise as I knew where it was going 90% of the time. To be fair, it's filmed well and the sets and general atmosphere are nicely creepy. Plus the actor who plays... oh, whatever they call Dracula in this film, does a great job, so there are definitely plus points. I just found the whole concept of this film redundant as it felt like a poor copy/remake of the 1992 classic. I didn't hate it, but if I'd know this was all it was going to be I'd rather have just put on my DVD of 'Dracula' and saved myself the petrol."
    },
    {
      "rating": "0.5/5",
      "review": "Don’t waste your time to watching this. It’s not scary at all. It’s even funny like the vampire and love story between Thomas and Ellen. Don’t watch this movie."
    },
    {
      "rating": "3.5/5",
      "review": "its good... but not as great as we all thought iut would be"
    },
    {
      "rating": "1/5",
      "review": "Very slow paced and not scary at all"
    },
    {
      "rating": "3/5",
      "review": "Not what I was expecting, Not bad, but not great."
    },
    {
      "rating": "4/5",
      "review": "quite ok, pretty good music"
    },
    {
      "rating": "1/5",
      "review": "Visually ok but painfully boring waste of time I could not even finish it—wish I could get my 30 minutes back."
    },
    {
      "rating": "0.5/5",
      "review": "The movie is a degeneration of cinema... boring and banal..."
    },
    {
      "rating": "1/5",
      "review": "What dull film, I lasted 20minutes before I could bear it no longer. The worst telling of the Dracula story I have ever had the misfortune to see."
    },
    {
      "rating": "2.5/5",
      "review": "I like vampires and their typical sultry nature and thought the history would be appealing but I didn't like it as much as I thought"
    },
    {
      "rating": "3.5/5",
      "review": "Good vampire film, but slow starting. Follows Dracula noval."
    },
    {
      "rating": "5/5",
      "review": "Sinematografi yg keren, dipadu dengan alur cerita yg menarik dan akting jempolan dari para cast nya membuat atmosfer kengerian terjaga konsisten di sepanjang cerita"
    },
    {
      "rating": "4/5",
      "review": "The hate on this film feels SO forced. A very good film by a very good director, with very good cinematography, very good set designs, very good costumes, very good dialogue, very good acting (+voice acting by bill skarsgard because omg how can his voice even do that), very good horror, very good everything! Definitely recommend, don’t listen to the nosferatu haters, go watch this movie!! My rotten tomatoes score: 85/100 🍅"
    },
    {
      "rating": "5/5",
      "review": "One of the best horror if not the best horror movie I have ever seen."
    },
    {
      "rating": "1/5",
      "review": "Wow just so off beat in every kind of way. I am not sure who’s family crossed a witch but like the man himself, this tributes is cursed. No bueno."
    },
    {
      "rating": "0.5/5",
      "review": "Nah fam…this ain’t it lol"
    },
    {
      "rating": "2.5/5",
      "review": "It boasts impressive cinematography, sets and costumes, as well as decent if overdone makeup. But it wears out its welcome by the end and I was ready for it to be over."
    },
    {
      "rating": "5/5",
      "review": "What an amazing ride this movie is! The atmosphere is dark and dreary. All the actors put on a great performance. However, William DeFoe steals the show performance usual! It is quite suspenseful and thrilling at times. It does feel a little long in the tooth at times, but well worth it in the end!"
    },
    {
      "rating": "1.5/5",
      "review": "It seemed like the 1992 Dracula movie script was given to ChatGPT and was asked to change names and paraphrase it. It was an unimaginative and drawn-out movie overall with a bleak and unpalatable visual language. The finale spelled everything the protagonists struggled for was in vain."
    },
    {
      "rating": "4.5/5",
      "review": "Good atmosphere, good cast, interesting take on Dracula. I liked it."
    },
    {
      "rating": "2.5/5",
      "review": "It's ok but it's nothing special. Unfortunately it isn't very scary and it becomes a bit whispy later on and then has an ending that is supposed to be deep but it isn't. Some of the acting should be commended,(some is community rheatre esque), given the weakness of the script and some dialogue was nice to hear, just not consistent enough. It's Nosferatu. Less thematic. MAKE IT SCARY!"
    },
    {
      "rating": "2/5",
      "review": "Wow. ..one of the most antisipated and worst movies. Can't imagine the amount of $ wasted on this movie. Pls don't pay to see this"
    },
    {
      "rating": "4.5/5",
      "review": "Great horror movie. The actors, costumes, setting were all great. Everythin felt absolutely coherent. Highly recommended!"
    },
    {
      "rating": "4.5/5",
      "review": "I can recognize a good movie when I see one. Resuscitating a horror like this is witchcraft, and for that, it deserves to be honored. Eggers hasn’t made a mistake (yet), and I’m glad. Even though this isn’t my kind of movie, the last scene is worth the whole experience. Just like vampires, this story is not doomed to grow old."
    },
    {
      "rating": "5/5",
      "review": "A piece of good writing, great direction and fantastic cinematography..."
    },
    {
      "rating": "5/5",
      "review": "Kino für Auge und Ohren Die Soundkulisse um Graf Orlock herum ist überwältigend. Vor allem wenn er spricht. Vielleicht eines der wenigen Fälle, wo die deutsche Synchro sogar besser ist, als das Original. Eggers benutzt das Stilmittel \"Langeweile\" bewusst oder unbewusst, um Graf Orlock, wenn er dann Screentime hat, mit einer gewaltigen Wucht darzustellen. Da werden auch alle Register mit dem Sound gezogen. Nosferatu und das Konstrukt: Ehe In Eggers Verfilmung geht das Gründen einer Familie deutlich mit Finanzen einher. Irgendwie auch deutlich, was die Protagonisten dazu bewegt zusammen zu sein. Lust spielt eine untergeordnete Rolle. Nosferatu als Verkörperung der Lust, die nichts mit dem Zeugen von Kindern zu tun hat und der Bedrohung des Ehegelübtes. So ist die Darstellung von dem Thomas: langweilig, blass und gut und Nosferatu natürlich diabolisch interessant. Ein Kampf zwischen Liebe und Lust mit der zeitgemäßen Paraphilie Note. Im Gewand des Klassikers Dracula/Nosferatu erzählt Eggers seine Interpretation, die ungeschönt die Liebe entzaubert. Auch das Lust nicht unbedingt was mit Schönheit zu tun haben muss. Sprich: Ekelfest. Man könnte fast meinen es wäre gleichzeitig auch ein Remake von \"Possession\" mit Isabel Adjani. Schon wegen der Art und Weise wie Graf Orlock redet, ist der Gang ins Kino wert. Definitiv hat Eggers das Genre erweitert, wenn auch subtil, hinter vermeintlichen Bildern, die wie mit dem Vorschlaghammer anmuten. Wenn Bsp. Orlock Thomas saugt und es wie ein Akt der Koppulation wirkt. Es ist nicht wirklich Horror. Eher ein interessantes Märchen für Erwachsene, des Internetzeitalters mit großartigen Bildern. Sehens und Hörenswert"
    },
    {
      "rating": "2/5",
      "review": "It was an artisanal, well-thought horror movie which missed the mark. It wasn't scary or even original. It was grim and the acting was good but overall it was boring."
    },
    {
      "rating": "5/5",
      "review": "WOW... What a masterpiece of victorian, gothic, cinematic, awesomeness. Soared straight into my Top 3 favourite movies ever. I honestly couldn't ask for anything else. If you get it you really get it. 10/10 all day every day, and I genuinely feel privileged to be alive in a time where this exists."
    },
    {
      "rating": "5/5",
      "review": "The new Nosferatu reimagines the classic with a hauntingly fresh vision that both pays homage to the original and elevates it to new, chilling heights. The atmosphere is absolutely intoxicating, with stunning cinematography and a score that heightens every moment of tension. The eerie performance by Skarsgard, embodying Count Orlok, is both unsettling and captivating. It’s a film that manages to be both timeless and contemporary, capturing the essence of silent horror while bringing it into the modern age. Beautifully shot, impeccably acted, and genuinely unnerving — this Nosferatu is a masterpiece that will leave you thinking long after the credits roll."
    },
    {
      "rating": "3/5",
      "review": "While I can see why some people would appreciate this movie, I am unfortunately not one of them. Don't get me wrong—the movie is good, and so are the cinematography, costumes, and choice of background sounds. Mix in a bit of the eerie atmosphere, which this movie definitely does not lack, and you get a pretty good film. Unfortunately, I felt bored on some occasions, as it's quite a lengthy movie for what it's trying to convey. The movie has an antique look to it, but keep in mind that it's modern. You should give it a shot, though—if not for the story, then for the cinematography."
    },
    {
      "rating": "2/5",
      "review": "Robert Eggers fundamentally misunderstands the difference between Dracula and Nosferatu. A remake of a classic film is only justified if the remake adds something new or innovative to the original. Herzog understood this in “Nosferatu the Vampyre” - the most obvious augmentation of Munrau’s classic being sound and color. Roger Eggers labors under the misapprehension that it is somehow new or innovative to make Nosferatu sexy. To be fair, neither previous Nosferatu is sexy. However, that was a deliberate decision of both Munrau and Herzog. Nosferatu has not been made sexy yet because there is an entire other side of the Stoker vampire archetype that is already sexy - Dracula. Egger’s integration of sexual themes into Nosferatu is a re-insertion of American Dracula elements that were intentionally excised from Nosferatu by the German masters. The sexuality is neither new nor innovative. It follows that this remake is not justified."
    },
    {
      "rating": "0.5/5",
      "review": "Very cringe movie. I laughed the first time I saw nosferatu moustache. I has many disgusting scenes, but it's not scary at all. Also it has a ton of gratuitous vulgarity. The actors are good, but the writing and direction is really poor, which make the characters just silly or nonsense."
    },
    {
      "rating": "5/5",
      "review": "Robert Egger's \"Nosferatu\" (2024) is chilling, captivating and a cinematic masterpiece."
    },
    {
      "rating": "4.5/5",
      "review": "Stunning film overall. The cinematography, lighting, costumes, and visuals were captivating, and the performances kept me glued to the screen. Feels like an instant classic."
    },
    {
      "rating": "5/5",
      "review": "getting such a good gothic horror movie in 2024 was not in my bingo card but man, am i so happy for the revival of gothic film"
    },
    {
      "rating": "0.5/5",
      "review": "I dont understand how it had 8.5 stars out of 10.. movie put me to sleep, it had a few good parts, but overall it was hard to watch. Very boring."
    },
    {
      "rating": "0.5/5",
      "review": "I fell asleep. Its well made and acting was good, but this lacked something."
    },
    {
      "rating": "0.5/5",
      "review": "What an awful movie, we left after 40 minutes. I called Fandango to try and get my $65 in credits back but they couldn’t do it. It was just our choice of a bad movie."
    },
    {
      "rating": "4/5",
      "review": "Skarsgard is an absolute beast! Great movie."
    },
    {
      "rating": "0.5/5",
      "review": "Great story. Great villan. The depth in character and back story given to the main villan (Ellen), is unmatched in modern media."
    },
    {
      "rating": "2/5",
      "review": "Boring, with a predictable story line (I know it's a remake, but still), cardboard characters and cliche-ridden plot devices, almost to the point of parody. The film only gets an inkling of its potential deep into the third act; far too late for it to redeem itself."
    },
    {
      "rating": "2/5",
      "review": "Great cast, superb atmosphere, but unfortunately became tedious."
    },
    {
      "rating": "1.5/5",
      "review": "I was disappointed by this movie. I found it very drawn out . There was no feeling of fear or tension for me . Im not a fan of the actors I was expecting alot more. Disappointed over all."
    },
    {
      "rating": "3/5",
      "review": "Unless you want to see it on the big screen I'd wait and see it at home. The Voyage of the Demeter was better in my humble opinion."
    },
    {
      "rating": "1.5/5",
      "review": "Despite its polished cinematography and strong technical execution, this film ultimately falls flat, failing to bring anything fresh or engaging to the genre. While visually striking, it lacks substance, relying on an overused “good people vs. bad monster” formula that we’ve seen countless times before. There’s no depth, no subversion of expectations, and no real reason to invest in the story. The characters feel hollow, their actions dictated solely by the writer’s need to move the plot forward rather than by any internal motivations or desires. They don’t evolve, face meaningful struggles, or make compelling choices—they simply exist to serve the mechanics of the screenplay. Because of this, the film never feels organic or immersive, instead playing out like a by-the-numbers exercise in genre filmmaking. Ultimately, it’s a soulless experience. The impressive technical craftsmanship is wasted on a story devoid of tension, intrigue, or emotional weight. It’s as if the film expects the audience to be dazzled by its visuals alone, ignoring the fact that great storytelling requires more than just spectacle. The result is an utterly forgettable experience, a fanfare of technicality with the flavor of stale soda—flat, uninspired, and disappointing."
    },
    {
      "rating": "0.5/5",
      "review": "Slow paced as hell, boring, and not scary. A word: unnecessary."
    },
    {
      "rating": "3/5",
      "review": "I'll keep this brief; this movie was very okay. It was not scary, some of the characters choices were illogical and it didn't walk balanced line between being a work of art and \"too artsy\". Sadly, unlike most of Egger's movies, I feel this one will not stand the test of time, and will unfortunately be forgotten."
    },
    {
      "rating": "2/5",
      "review": "I wanted so badly to enjoy this one... Sadly, slow paced dialog and old-world feel sent me to sleep... Dud"
    },
    {
      "rating": "1.5/5",
      "review": "I couldn't sit through the first hour, it was so horribly boring. How many close-ups of peoples' faces twisted in confusion or horror can I sit through? I counted 18 till I was done with the whole thing."
    },
    {
      "rating": "1/5",
      "review": "I admit that I can't count myself as a fan of the genre, especially of vampire movies (with exception of non-serial Tony Scott's 1983 \"Hunger\"), but there really is no one to like this remake, except maybe the fans of bad acting, overlong shots and senseless scenarios, as well as the sympathizers of necrophilia, unnecessary pornographic scenes and vomiting of stomach contents at every godly opportunity. Even the original from 1922 is more watchable than this extremely pretentious version, with an unrealistically inflated rating on official movie sites. Since I'm already of the opinion that this misdeed doesn't even deserve any deeper analysis, I'll take the opportunity to remind the audience of a few much better works on this topic: 1. \"Nosferatu: A Symphony of Horror\" (1922) - F. W. Murnau 2. \"The Fearless Vampire Killers\" (1967) - Roman Polanski 3. \"Nosferatu the Vampyre\" (1979) - Werner Herzog 4. \"Hunger\" (1983) - Tony Scott 5. \"Bram Stoker's Dracula\" (1992) - F. F. Coppola"
    },
    {
      "rating": "5/5",
      "review": "Fotografia excelente, desing de som bom e construção de epoca impecavel só senti falta da trama ser menos cheia de protagonistas mas é uma obra de arte."
    },
    {
      "rating": "4.5/5",
      "review": "Beautifully shot and although a bit dark, literally, is aesthetically pleasing for a gothic horror movie. The suspense is intoxicating and the climax is worth it, coming from a person who never saw the original movie I really like this dark almost romantic take on it. A bit long but probably because any movie over an hour and 50 minutes at the movie theater feels like an eternity."
    },
    {
      "rating": "4/5",
      "review": "I haven't seen the original Nosferatu so I can't compare, but I love the aesthetics of this film and the acting, especially the actress for Ellen, is really impressive!"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible movie do not recommend it"
    },
    {
      "rating": "4/5",
      "review": "Good pic. Great sound. Great art direction and set design. Enjoyed it."
    },
    {
      "rating": "4.5/5",
      "review": "Top-notch acting, story and cinematography. A visual and thrilling delight."
    },
    {
      "rating": "2/5",
      "review": "I liked the gruesome scenes and the cinematography. I disliked the lack of overall story morality."
    },
    {
      "rating": "1/5",
      "review": "Needs an NTR tag. Not just any NTR, the ugly ba***** type."
    },
    {
      "rating": "3/5",
      "review": "It was pretty good although a performance or two was so over the top it really brought you out of it but that may be more due to the director than the actor. The biggest weakness is the ending seeing once things start falling into place and we get into the final act it just seems a bit lackluster. It's almost as if the director had a vision, was able to flesh it out in the 1st 2 acts but was reprimanded he had to \"wrap things up\" and did."
    },
    {
      "rating": "5/5",
      "review": "Beautiful cinematography from start to finish. Wilem Dafoe absolutely kills it in this movie. Not as scary as you would think, but unapologetically gory."
    },
    {
      "rating": "4/5",
      "review": "Very well made. Great performances. Dark and creepy and visually stunning. Count Orlok voice and movement in the shadows made it extra macabre."
    },
    {
      "rating": "2.5/5",
      "review": "Theater literally laughed at the ending scene"
    },
    {
      "rating": "0.5/5",
      "review": "A waste of actors, story, resources and time. Worst movie I have ever seen."
    },
    {
      "rating": "2/5",
      "review": "Cinematography and the brooding gothic style were good but the movie felt too disjointed with no character or plot development. Characters springing up left right and centre with no connection or real understanding of them. There’s only so many times you can see a dark shadow hand spreading across the screen before it becomes tiresome. The voice of Nosferatu was a little comical and hard to understand. The best scenes for me were the Romany village and that was only a very minor part of the story. Disappointing but maybe it just wasn’t for me."
    },
    {
      "rating": "0.5/5",
      "review": "Far cry from the original source material. I saw more references to the 70s version which wasn’t great either. Had a strong start with a great cast but the storyline and cinematography fell apart after a certain point. Did a some sick pimp or teen with a high libido write this?"
    },
    {
      "rating": "5/5",
      "review": "Perfect movie while crocheting!"
    },
    {
      "rating": "2.5/5",
      "review": "Lidl's answer to Dracula. Reasonable as a horror but missing on the sensuality. All the characters and most plot points are the same as Dracula but with name changes. If you want some minor gore and jump scares go for it."
    },
    {
      "rating": "5/5",
      "review": "Nosferatu is horror at its best, a seamless blend of real fear with supernatural monsters. It plants a seed of dread that grows and blooms in unexpected ways throughout the film. The story remains true to overarching elements from Dracula and Nosferatu but adds a dose of human nature. Nosferatu is what a monster should be- repulsive, vile, terrifying but somehow still worthy of love. This movie was beautiful and absolutely disgusting at the same time. Oh… and the cinematography is stunning. While I know others will disagree with me, this I my opinion. I absolutely loved this movie and it might be one of my favorite films of all time."
    },
    {
      "rating": "2/5",
      "review": "Extremely disgusting movie and a complete waste of time."
    },
    {
      "rating": "4/5",
      "review": "uma história de um vampiro que sente muito tesão, e faz qualquer coisa pela mulher dele"
    },
    {
      "rating": "3.5/5",
      "review": "The movie is slow and methodical pretty much the whole way through. The imagery and stills were breathtaking the artistry in the view was outstanding. I do feel that some scenes were a bit long-winded or could have been more engaging in a way. I know it's better for the viewer to infer what happening by the tone or even body language but at some points, a 5-minute conversation could be cut short."
    },
    {
      "rating": "5/5",
      "review": "We loved it, the story is basically Dracula no surprise. But the cinematography was awesome the use of the narrow screen aspect made things tall and claustrophobically narrow. The sound was terrific with Count Olafs voice coming from everywhere. Really enjoyed the acting. If you love gothic horror a must see. Glad we saw it in the theater."
    },
    {
      "rating": "3/5",
      "review": "Expected sensuality. Didnt like: the strong sexuality. Imagery was beautiful."
    },
    {
      "rating": "3/5",
      "review": "Robert Eggers make movies for a specific group of niche audience, it will be difficult for you to connect if u r not part of that group. I liked parts of both Northman & Lighthouse but i admire the ambition there however i don't find that in Nosferatu"
    },
    {
      "rating": "4.5/5",
      "review": "Nosferatu is a near masterpiece by Director Robert Eggers who wrote, produced, and directed the film. The film is wonderfully shot and practical effects are used throughout with minimal CGI shots. If you enjoy vampire films you are really going to enjoy this one. Now this might not be your typical bite them in the neck vampire film, no in fact it is so much more. This film is more of how evil the vampire can be when communicating with you from afar. I really loved how the film uses a dark tone/shadows a lot at the bogging and then toward the end things start to brighten up. My only complaint is that I was wanting a little bit more toward the end. That's not to say the ending was lacking or bad but it's just I wanted maybe 15-20 minutes extra on the run time. Nosferatu Is Robert Eggers best film to date and showcases all of his skills here. Nosferatu gets a high 4 1/2 stars out of 5 from me."
    },
    {
      "rating": "5/5",
      "review": "It is a masterpiece, it is pure cinema. Great visuals, excellent acting. The best of the year."
    },
    {
      "rating": "5/5",
      "review": "Visually stunning. Like you step into Caspar David Friedrich painting. Horrific and seductive. Definite piece of art."
    },
    {
      "rating": "1/5",
      "review": "Poor story telling, more about a woman acting crazy than anything else. Waste of time and money, just sad"
    },
    {
      "rating": "5/5",
      "review": "I'm surprised this is so polarizing. Almost didn't go see it -really glad I changed my mind! I actually started watching it on streaming then was like, \"I need to go see this in a theater.\" Every frame is like a Gothic painting. The story and dialog are very authentically Victorian-era horror. (It's Bram Stoker's Dracula with the names changed) Not for everyone, apparently."
    },
    {
      "rating": "3.5/5",
      "review": "Too long. Felt like it dragged out in the middle. But great start and great ending."
    },
    {
      "rating": "1/5",
      "review": "Beautiful costumes cannot overcome the fact that it was complete nonsense with poorly written dialogue overshadowed by incessant heavy breathing."
    },
    {
      "rating": "1/5",
      "review": "It was so boring. . No sense of dread. Was checking my watch to see when the snooze fest was over"
    },
    {
      "rating": "3.5/5",
      "review": "A great horror film if you’re in the mood for a slow burn. But a good horror film just in general, it’s a weird decent retelling of the 1920’s film. My negatives are that Lily Rose’s possession scenes are to goofy for a movie taking itself serious, I didn’t find it to be unsettling as I hoped, and my final negative being I wish Williem Defoe had more screen time, he’s my second favorite character in this movie and he steals the scenes that he’s in. Overall close to great but those things hold it back"
    },
    {
      "rating": "1/5",
      "review": "My fiancé hated it so we walked out"
    },
    {
      "rating": "3/5",
      "review": "Gorgeously shot, well acted, but leans too heavily into Dracula. If you're familiar with Bram Stoker's work you will see all the high points plainly. Unlike its namesake, which while being an unauthorized Dracula adaptation took liberties with the story, this version doesn't strive to differentiate itself. Overall a good movie, but not the masterpiece it's being lauded as."
    },
    {
      "rating": "3.5/5",
      "review": "Cinematography was fantastic."
    }
  ]
}