[
  {
    "rating": "5/5",
    "review": "So cool how they continued the movie, all actors were great."
  },
  {
    "rating": "1/5",
    "review": "Messy. Script was uninspired. Really enjoyed the original film 🎥 Couldn't make it to the 3rd act. Wanted to love it. 1 star at best"
  },
  {
    "rating": "1/5",
    "review": "boring and couldn't stand the movie talking so much about the weirdo dad"
  },
  {
    "rating": "4/5",
    "review": "it wasn't interesting as the first one."
  },
  {
    "rating": "1/5",
    "review": "Hard to watch, I turned it off at 30%. With all these veteran actors, it really came off as a B movie. I think they should have done a few more takes and maybe hired an editor to make Keaton look a little more energetic, Rider a less twitchy. There were too many cheesy references to the first Beetlejuice. Its been 37 years since the first Beetlejuice, how are the costumes and special effects worse? The plot is lame and predictable...I assume, I have no interest in watching the rest of it."
  },
  {
    "rating": "5/5",
    "review": "I was not disappointed in this movie. Tim Burton nailed it. Michael Keaton and Winona Ryder were brilliant in reprising their roles, and Willem Dafoe is a wonderful addition. This movie is well worth watching!"
  },
  {
    "rating": "1/5",
    "review": "This had to have been the worst movie I've seen in at least the last ten years"
  },
  {
    "rating": "5/5",
    "review": "Had me screaming YAAASSSS by the end of it. What a banger. That ending was literally perfect. Beetlejuice gets to share some of the hero spotlight this time around and it's so good."
  },
  {
    "rating": "1/5",
    "review": "Overly campy & the gags they resurrected from the original were stale. A great cast wasted because of a terrible script. Overacted & they seemed to just go through the motions. An insult to the brilliant original."
  },
  {
    "rating": "3/5",
    "review": "Not funny, charming or memorable like the original. I love the cast but not the movie."
  },
  {
    "rating": "2.5/5",
    "review": "Sakto lang. Andun pa din un nostalgic feeling after maghintay ng ilang dekada para sa kaabang abang na sequel. Nothing beats the OG pero nabigyan naman ng bagong sigla ang 80's beloved classic"
  },
  {
    "rating": "4/5",
    "review": "Go into it with a open mind, and don't compare it to the first beetlejuice and think of it as a stand alone, and you can't help but enjoy this movie."
  },
  {
    "rating": "4/5",
    "review": "It did come a little bit low of my expectations, but still a good movie."
  },
  {
    "rating": "4/5",
    "review": "This movie was stupid but good and funny"
  },
  {
    "rating": "4/5",
    "review": "Very fun and entertaining legacy sequel. Worth a watch unless your judging it critically, then it isn't so great."
  },
  {
    "rating": "3.5/5",
    "review": "Can’t be mad at the classics"
  },
  {
    "rating": "4/5",
    "review": "Beetlejuice beetlejuice feels even more funny , better , well written and satisfying(not for the weak hearted) than the original. This one gives everything the first one missed, it does not feel short, the characters of beetlejuice has more screen time and a purpose. The practical effects and the afterlife are also very well done , especially the stop motion. Likes this one better than the original. Also this movie keeps it real and also delivers a very good message (only for a short time)"
  },
  {
    "rating": "4.5/5",
    "review": "Why is it that the best sequels are the ones from movies you least expect to get one?"
  },
  {
    "rating": "1/5",
    "review": "It's..... something, I guess."
  },
  {
    "rating": "4.5/5",
    "review": "Insanly goated comedy and a alright plot"
  },
  {
    "rating": "2/5",
    "review": "Some sequels don't need to exist."
  },
  {
    "rating": "3/5",
    "review": "Old heroes but bad script. Please no 3d part"
  },
  {
    "rating": "3/5",
    "review": "Much worse than first film. Poor Lidia"
  },
  {
    "rating": "5/5",
    "review": "People who love Beetlejuice Beetlejuice are fans of Beetlejuice's character. I grew up watching the Beetlejuice animated series and watched the first movie close to 2 dozen times. I've cosplayed as a female Beetlejuice and I LOVED THIS MOVIE. Why? Because it perfectly portrayed the character without a single flaw. It's like seeing an old friend again and picking up exactly where you left off. People who disliked this movie only liked the first movie as a movie. This was made for the die hard Beetlejuice's fans, the ones who tried to summon Beetlejuice as kids (and were disappointed when they failed)... or was I the only one? Beetle 🪲 Juice🧃... Beetlejuice... BEETLEJUICE!!!"
  },
  {
    "rating": "5/5",
    "review": "Did the original justice!!"
  },
  {
    "rating": "1/5",
    "review": "Not worth going to see"
  },
  {
    "rating": "2.5/5",
    "review": "Should have left this property alone"
  },
  {
    "rating": "1.5/5",
    "review": "They ruined this for me oh"
  },
  {
    "rating": "4/5",
    "review": "Not bad for a 30 plus year sequel!!"
  },
  {
    "rating": "3/5",
    "review": "Has a lot of the elements that made the original great but there's just something missing and it feels like a rehash for the sake of it rather than their being a great idea for a follow on story. But good enough for some chewing gum for the eyes."
  },
  {
    "rating": "4/5",
    "review": "Enjoyed this sequel."
  },
  {
    "rating": "3/5",
    "review": "Worth the watch, but it could be better."
  },
  {
    "rating": "3.5/5",
    "review": "Good revisit to Beetlejuice. My main complaint is that it simply wasn't as funny. 7/10"
  },
  {
    "rating": "3/5",
    "review": "Nowhere near the classic the original was, in spite of Keaton's best efforts and some great practical effects. Too much focus on boring drama and useless subplots that go nowhere (what a terrible waste of Monica Bellucci and Willem Dafoe) makes the whole thing feel overstuffed and rushed even at its nearly 2-hour runtime. That said, it's a fun ride, and it's copied its predecessor well enough to deliver an experience hard to find these days."
  },
  {
    "rating": "0.5/5",
    "review": "Hate the asl. Distracting. Had to keep moving tape and cardboard."
  },
  {
    "rating": "4/5",
    "review": "Good Movie Michael Keaton rocks"
  },
  {
    "rating": "5/5",
    "review": "I loved this. Found myself giggling throughout the whole movie. Michael Keaton is great. Very good sequel IMO.. Most sequels suck a$$."
  },
  {
    "rating": "5/5",
    "review": "Truly the movie of all time. This was such a great experience, filled with juice worthy moments 🙈🙈. Great visuals, especially in the scene where battle juice says the juice is loose and proceeds to do exactly that, letting all the juice loose."
  },
  {
    "rating": "3.5/5",
    "review": "This was a fun sequel, and I love Jenna as a new addition. There really isn't much to say about it other than it brings back a lot of old school comedy which is nice to see given how rare it is today. I didn't find it remarkable, but it's a good movie to watch if you enjoy the original or Burton in general. Keaton will still have it when he is 100+ years old. Thank you."
  },
  {
    "rating": "0.5/5",
    "review": "How this movie got to 75% is beyond me I just watched it last night and it was horrible. The plot was all over the place the actors seemed checked out, there literally like 3 plots going on each one worse than the last and don’t get me started on the makeup and costumes - 100 this is a sequel that didn’t need to be made."
  },
  {
    "rating": "4/5",
    "review": "Ain't as good as the OG but still really hilarious."
  },
  {
    "rating": "4/5",
    "review": "good to see Michael Keaton Beetlejuiceing it up again! Monica Bellucci is a FOX!!!"
  },
  {
    "rating": "5/5",
    "review": "Love Jenna Ortega 💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝"
  },
  {
    "rating": "1/5",
    "review": "If you were alive in 1988 and saw the clever, quirky original then your opinion might differ from the 79% that liked it. Yes they make bad movies in and out all day long with abandon. But if you are making a sequel to a much beloved classic then you need to be held to a much higher standard. This movie doesn't come close to that standard. Can't believe any of the original stars agreed to come back for this disappointing effort. On a positive note, Winona Ryder doesn't seem to have aged at all in over 35 years, nor Catherine O'Hara for that matter."
  },
  {
    "rating": "5/5",
    "review": "Such a funny and enjoyable movie, it’s a movie that can stand by itself but I recommend watching the first movie as well. I loved the storyline and all the plot twists"
  },
  {
    "rating": "3.5/5",
    "review": "Stupid but kind of entertaining. My 50-year-old daughter liked it haven’t seen the first one. It was a good time going with her, but I wouldn’t have enjoyed it just going on my own."
  },
  {
    "rating": "3/5",
    "review": "I guess it's less rote / formulaic than much of what's out there, but it's hard to call it original when so much of it just appears like a greatest hits medley of the first one. Lydia and Delia have both become unrecognisably bland characters; all the edge is given to Lydia's daughter, but she mostly comes across as mean and unjustifiably cruel to her mom. Michael Keaton has lost a lot of the manic, chaotic energy that let him run away with the first film. Unfunny jokes are beaten into the ground (Soul Train, get it?). Feels like it's 100% targeted at kids in a way the first one just wasn't."
  },
  {
    "rating": "5/5",
    "review": "It's almost as good as the original! but still phenomenal! funny and whitty."
  },
  {
    "rating": "3/5",
    "review": "it was entertaining with a somewhat original story but too many call backs for complete originality."
  },
  {
    "rating": "1.5/5",
    "review": "Okay, it's got Michael Keaton, Winona Ryder and Catherine O'Hara. Tim Burton is trying to capture the fun of the original, but it falls flat. Storyline is weak. Yeah, it's got the visuals but nothing we haven't seen before. The soundtrack is weak, missing the Calypso rhythms that made the original memorable. Tim Burton is running out of ideas, been on a downhill slide for quite a few years. Definitely style over substance."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie great job. Will watch this movie over and over. Highly Recommend this movie"
  },
  {
    "rating": "5/5",
    "review": "Kick ass movie! Everyone did an outstanding job. Very intense."
  },
  {
    "rating": "4/5",
    "review": "It is mainly an excuse for lots of barking mad setpieces, but I'm not going to complain really since this is Burton showing to the audience every single idea he's got in his toybox."
  },
  {
    "rating": "1.5/5",
    "review": "It’s filtered and lacking a profound image, one that the original succeeded with. It’s a case of forcibly adjusting to the times and seeing only the cast have their fun instead."
  },
  {
    "rating": "5/5",
    "review": "My family and I were laughing like crazy. If you liked the original you'll like the second one"
  },
  {
    "rating": "4/5",
    "review": "Surprisingly good for a movie sequel that takes place 30 years after the original, the effects and world environment quickly pull you into the original world that the first movie created. The story and modern takes on certain aspects made me feel like it was slightly lazy in that aspect, but I still liked it."
  },
  {
    "rating": "4/5",
    "review": "Nostalgic! This sequel did not disappoint. I enjoyed the fact many of the original actors did such a phenomenal job. I must admit, I did miss Jeffrey Jones, but the movie was still a hit. This movie made me relive childhood for a moment!"
  },
  {
    "rating": "5/5",
    "review": "So happy Tim Burton kept his style like in the first one."
  },
  {
    "rating": "2/5",
    "review": "The story was all over the place."
  },
  {
    "rating": "3/5",
    "review": "Not as good as the original, bit cringy and the storyline was weak."
  },
  {
    "rating": "1.5/5",
    "review": "I was very excited for this one, as I loved the first film, we waited all these years for a sequel but it just didn't do anything, nothing unique nor different from the first one, the story and the plot was corny, the newest characters made no sense and their development was not executed, they just seemed out of place and didn't bring anything at all to the story, the visuals and some of the plot seemed to be re used from the first one but done horribly. Jenna Ortega was more annoying in this role then anything and her character just didn't shine at all. Overall this movie was a huge disappoint and did nothing new as we waited decades for nothing, it's basically the first movie but with some added new characters. Thanks Tim Burton but no thanks, the only real good thing about the film was Beetlejuice himself, every scene he was in he was amazing and Michael Keaton once again does amazing as Beetlejuice, he is wasted talent with a shitty story and movie. Sorry but true."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies Ive seen in years. Winona Ryder forgot how to act. The plot was boring and went on and on."
  },
  {
    "rating": "5/5",
    "review": "It was a funny and touching story."
  },
  {
    "rating": "4/5",
    "review": "Was good, I liked it… Took a long time for a 2nd one to be made and it was made good."
  },
  {
    "rating": "5/5",
    "review": "Anticipated that this would be a lazy, money making venture / remake (Gladiator 2). I was happy to be disproven."
  },
  {
    "rating": "1/5",
    "review": "It's like being in the mind set of a wake the entire movie. Be ready to be depressed the whole movie. If you've recently had someone pass away I suggest to not watch it unless yo uwant to ball your eyes out. I only watched it because I had access to a streaming service that offered it. I do not recommend buying it. It's bad. Over all it was bad, like really bad for a 2nd movie. Acting bad, weak story line, several plot holes, famous actors paying their way into a rebot for more fame or an easy pay check.... They stuck to many of the original themes of the first movie but it lacks the originality of it. I guess the main character(s) are Lydia and Bettlejuice not the original couple as we all thought. There are a lot of plot holes and gaps that make you wonder about the story line and raise more questions than they answer. They could of chosen a better way to kill of Lydia's father. it's obvious the family was never close and the effect was also passed down to Lydia's daughter. For entertainment I watch paranormal videos on the internet and let me just say some of these videos posted on youtube are a million times better than the bs they put together in this video. And that's the 10% that are ligety real. Any one can put toget her string, wires and flashing lights... Watch it for entertainment but I would not recommend buying it. I watched it once to assimilate the story line and it had so many loop holes for a 3rd and you know they're going to do one..."
  },
  {
    "rating": "1/5",
    "review": "Unfortunately, even Winona Ryder couldn't salvage this for me. I got an hour into this movie before realizing nothing had happened, I was incredibly bored, and this supposed \"comedy\" hadn't made me laugh once. I thought, maybe the problem is that I haven't seen the original yet. There were a lot of references going over my head. So, I turned on the original Beetlejuice. It was absolutely fantastic! Creative, charming, and really funny! I can see why it became a cult classic and is still beloved to this day. It also packs a lot of fast-paced plot into just 90 minutes—a lesson the sequel, unfortunately, didn't learn. Props to the actors for doing the best they could with what they were given. There were some interesting ideas in the script as well, but the execution just fell so flat. No charm or likeability in any of the characters. Maybe the movie improves after the one hour mark; I wouldn't know, and I don't care to find out."
  },
  {
    "rating": "5/5",
    "review": "we loved this movie, so funny and great sequel!!"
  },
  {
    "rating": "4/5",
    "review": "If “Beetlejuice” isn’t viewed in favorable repeat, then it’s best to watch the classic right before checking out the distant sequel. There’s exceptional fulfillment as Tim Burton returned to theatrical form with eccentric, expressionistic artistry, crazily driven by Michael Keaton’s iconic reprisal with humorous energy intact that still fuels the fun alongside the pleasant reunion, even when tonally blended with inferior pacing signifying lesser manifestation. (B+)"
  },
  {
    "rating": "2.5/5",
    "review": "It's ok. Visually great as you'd expect and acted well, but the pace, script and storytelling could have been so much better. The first movie remains the better of the two, so a disappointing sequel."
  },
  {
    "rating": "4/5",
    "review": "Good movie. Had its moment but original was better."
  },
  {
    "rating": "4.5/5",
    "review": "Beetlejuice two was literally the best movie but even though it was a little bit creepy in the end of the movie, it was still worth a watch. Definitely would want to see it again.😃"
  },
  {
    "rating": "5/5",
    "review": "Beetlejuice 2 was every bit good as the original"
  },
  {
    "rating": "4/5",
    "review": "I liked it & so did my wife."
  },
  {
    "rating": "3/5",
    "review": "Stand alone movie 4/5. For a Beetlejuice fan, 3/5. It's almost like Michael Keaton was cohorsed into another Beetlejuice. He wasn't the same. Not perverted enough for Beetlejuice's character."
  },
  {
    "rating": "0.5/5",
    "review": "Not good. It lacks any of the uniqueness, craziness, and genuine feel of the first one. It feels forced. And it’s incredibly boring. Love the original. Couldn’t get through the sequel. 👎"
  },
  {
    "rating": "0.5/5",
    "review": "Beetlejuice 2 is an absolute disaster, a complete betrayal of the charm and wit of the original. The much-anticipated sequel feels like a thrown-together mess, with a storyline that’s not only incoherent but completely uninspired. It lacks the quirky charm of the first film, replacing the humor with shallow attempts at nostalgia that fall flat. The plot is a jumbled mishmash of random ideas, none of which are executed well. Instead of building on the unique, surreal tone of the original Beetlejuice, this sequel goes for awkward, forced moments that barely make sense. The pacing is all over the place, leaving you wondering if they even had a clear vision from the start. What should’ve been an exciting continuation of a beloved universe is instead a tedious, forgettable slog. The new characters are unbearable. They’re nothing more than shallow caricatures, each one less interesting than the last. Lydia’s daughter, played by Jenna Ortega, is an attempt to inject some new life into the series, but her character lacks any depth or real connection to the world we once loved. The charm of the original cast is sorely missed, and it’s painfully obvious that they couldn’t quite find a replacement. Even Winona Ryder, who once embodied Lydia with such effortless cool, seems lost in this mess, as if she’s barely holding it together. The visual effects, while technically decent, feel overdone and uninspired, and the film’s attempt to recapture the macabre atmosphere of the first movie only results in a hollow, empty imitation. Ultimately, Beetlejuice 2 is a missed opportunity. It tries so hard to recapture the magic of the original, but it doesn’t succeed in any meaningful way. What we’re left with is a forgettable, frustratingly disappointing sequel that is best left avoided. It’s hard to believe this is the same franchise that once captivated audiences with its creativity and wit."
  },
  {
    "rating": "3.5/5",
    "review": "Hard to beat the first film which was perfection. This tried to achieve a similar look and feel. Overall not a bad film and was an enjoyable watch. Nostalgic."
  },
  {
    "rating": "4/5",
    "review": "So, I saw the first Beetlejuice recently. I'm in my 30s. I found the first movie to be pretty bad, no clear plot, no character development and a lacking of the character the movie was named after - Beetlejuice. However, this second movie, actually had Beetlejuice in it. The character development, though undeveloped, was there. I actually found it to be pretty funny, clever, and honestly, Beetlejuice is kind of the hero of this film. The film breaks the forth wall in making it clear that Lydia \"doesn't really know how her powers work\" which I found humbling after the first film. Overall, it was simple and enjoyable, funny/punny (Beetlejuice as a couples therapist spilling his guts). More importantly, this movie made up for the lack of plotline, character development, \"randomness\", and lack of clarity that was the first film. Great seeing Catherine O'Hara and Wiona Rider together again."
  },
  {
    "rating": "3/5",
    "review": "Kinda long, silly, over the top - has some of the feel from the original - but overall didn't hit the spot."
  },
  {
    "rating": "1.5/5",
    "review": "This movie was unfunny, had a clunky plot, and felt like they forgot to add iconic moments from the original, so they just slapped them in random places where they make no sense. The movie has like one million b plots, and the main threat gets basically no personality nor screen time. Tim burton is a strange man, and an even stranger director."
  },
  {
    "rating": "0.5/5",
    "review": "This was one of the worst sequels of all time in my opinion, the fact that so many people rated it so high is baffling to me. I have never written a review on a movie in my life but this movie was so bad I felt like I had to. I love the first movie and just like the matrix 4 I wish this movie should’ve never happened. If I wrote everything wrong with the movie It would be thicker than the Bible."
  },
  {
    "rating": "3.5/5",
    "review": "Beetlejuice Beetlejuice was really, really fun! Ryder, O’Hara, and Keaton were astonishingly good, like they hadn’t missed a single step since the prior film (which was released way back in ‘88). The return to practical and stop-motion effects enhanced the overall tone and vibe, and (newer cast entry) Willem Dafoe chewed scenery like the set was a mouthful of watermelon-flavored Hubba-Bubba. The downsides were the plot lines seemed a bit meandering, leaving the picture feeling like Burton had 3-4 ideas, and rather than focus on getting 1-2 narratives really solidified, he just threw everything in there, leaving some characters and plot points unresolved and/or under utilized (no spoilers, but I wanted-and the film could’ve used- about 850% more Monica Bellucci). That and well…we have to address the 61” tall elephant in the room. Jenna Ortega, as much as I dig her in interviews, isn’t a strong actor. Ortega’s performances over the past few years have ranged between mildly adequate to somewhat passable at best. In Beetlejuice Beetlejuice however, she was soundly outclassed in every second she was onscreen. Anytime she shared scenes with her other castmates, her lack of chops were awkwardly apparent. Not enough to ruin the scene- or the picture- but distractingly mediocre nonetheless. Overall though, this is one of the stronger legacy sequels out there. I was skeptical about a studio letting Burton revisit his 30 year old property, but was pleasantly surprised at how much I dug it. And if you liked the ‘88 Beetlejuice film (and grossly underrated cartoon series), you’ll dig it too…"
  },
  {
    "rating": "1.5/5",
    "review": "I eagerly anticipated the sequel to the movie Beetlejuice. It is one of my favorite movies. I loved the atmosphere the film creates, and the quirky characters. Every character makes sense, in their own weird way. The sequel left me wanting more. The character of Beetlejuice, for one thing, appears far too often in the sequel. He is a very important, but side, character in the original. He is a main character in this film, and that does not really work. His ex-is fun for about a minute, and the coworkers he has in sales are just silly. It makes no sense he’s got so many shrunken head dudes… The Maitlands are the heart of the film, with the Deetz family. They are just gone, and the Deetz family is, disappointing. Lydia is weak. I liked Delia’s character in this, but Lydia has grown soft and uninteresting in this movie. Her daughter is trying to carry the torch on the film, and only manages to do so some of the time. Overall the film was disappointing. I will watch the original again; I will not be re-watching this sequel."
  },
  {
    "rating": "4/5",
    "review": "Was a solid sequel but had multiple moving story lines that did not connect well in the end."
  },
  {
    "rating": "2/5",
    "review": "Too many plot holes, felt like it was rushed and not planned out. Did not have a similar ‘feel’ as the first one did, although it was nice to see characters return to their roles."
  },
  {
    "rating": "3.5/5",
    "review": "I don't think that he can take it 'Cause it took so long to bake it And he'll never have that recipe again A fun, whacky film. It has the style and look of a Tim Burton movie, but not the feeling. None of the characters feel particularly relatable, and there are a lot of them; too many, in fact, with only a few receiving any meaningful development. This leads to multiple plotlines that ultimately go nowhere. Monica Bellucci’s character, while visually stunning, serves more as a plot device to give Beetlejuice a sense of urgency rather than as a fully realized character. The structure is also problematic; we get only brief glimpses of what normal life looks like for our protagonists before the inciting incidents and act break. By the midpoint, the film becomes predictable, leading to an ending that fails to tie everything together in a satisfying way, relying instead on a deus ex machina resolution similar to the original film. Scene transitions often feel awkward, frequently involving characters who have no real relevance to the plot. On the positive side, the production design and cinematography are effectively artsy and expressionistic. The visual effects, while some might find them “goofy-looking,” are in line with the film’s world-building and tone, paying homage to the practical effects used in the first installment. The acting is solid, though not outstanding, but Michael Keaton’s effortless return to the role after more than 30 years is definitely a highlight. Ultimately, the film disappoints when compared to its predecessor. It would have benefited from being told strictly from the mother and daughter’s POV, cutting down the excess plotlines and significantly reducing the role of other characters—including Beetlejuice himself. Despite my criticisms, it’s still an entertaining watch, worth checking out for fans of Tim Burton and the original Beetlejuice—but beware."
  },
  {
    "rating": "4.5/5",
    "review": "Beetlejuice Beetlejuice is a shockingly good movie that delivers effects, story, comedy, and overall fun. What seemed to be just another nostalgia grab for Gen Xers and elder Millennials was instead a cascading romp through the diverse embodiments of the afterlife and Connecticut. There is some gnarly stuff here that I did not recall from the original (at least not this much), which really leans into the “horror” half of the horror-comedy subgenre. The Deetzs are back (at least 3 ½ of them) (Winona Ryder, Catherine O’Hara, Jenna Ortega, Mark Heenehan) and complement each other perfectly — O’Hara is so good in this role that you miss her when the plot follows one of its many other lines. There are a number of threads in this story that, instead of a burden, are intriguing and necessary, but three of which could have used more development — Delores LaFevre (Monica Bellucci), a soul-sucking witch and Beetleguese’s (Michael Keaton) ex-wife, Richard (Santiago Cabrera), Lydia’s (Ryder) late-husband and motivation for Astrid’s (Ortega) to the “other side,” and Jeremy (Arthur Conti), Astrid’s love-interest and best twist of the movie that is resolved way too quickly. This movie could’ve used another 20–30 minutes easy. I also loved Willem Dafoe as an actor who did his own stunts (not always effectively) and has turned to solving crime in the Afterlife. Even in shitty movies, Dafoe is the man. The look of the movie is iconic and feels like a comeback for Tim Burton. There’s just something about that opening music from Danny Elfman that makes me smile."
  },
  {
    "rating": "4/5",
    "review": "Funny movie. Okay to watch with kids."
  },
  {
    "rating": "1/5",
    "review": "It just wasn't good. They should have left it alone."
  },
  {
    "rating": "1.5/5",
    "review": "Too dark, depressing and scary to be enjoyable. I kept thinking, \"Is this hell?\" Because it sure didn't look like heaven. Lots of evil characters in this one. And though a couple get taken away at the end (spoiler alert), the ending was quick and pat. Several story lines convened at the end, but there were too many questions. The marriage license went up in flames because? Delia Dietz didn't check the asps before putting them on her neck and then accepts her fate like that? There is a portal for dead and living? Astrid could find exactly the page she needed for the sandworms in five seconds? There is no one to root for in this movie. Lydia's character is feckless and spineless. She agrees to marry her smarmy manager, lets her daughter speak badly to her, then agrees to marry Beetlejuice to prove her love to her daughter. Astrid is a total jerk until the end. Charles Dietz's dead body is horrendous. This movie is clever. But enjoyable? No."
  },
  {
    "rating": "1/5",
    "review": "I was Excited to see this movie because I am one of the biggest beetle juice fans. The original I have to say what a garbage movie.#2 is Michael Keaton's heart is not in it Somebody needed to hand him a bag of blow before they shot this movie. Katherine O'Hara is more like Moira rose than she is. The beetlejuice character. Still love her, though. At the end of the original beetlejuice movie Winona Ryder Was a ghost Floating on the stairs, singing a song. Because she wanted to go with Gina. Davis and Alec Baldwin. In the afterlife. So seeing her alive, acting as a medium was very disappointing. Which, by the way, Tim Burton going a different direction, was the bad direction. He definitely should've brought back Gina, Davis and Alec Baldwin. I don't even think I got halfway through the movie before I shut it off. Horrible, horrible, horrible. If you're gonna do a next movie to something that was made in the 80s, Do it the way it was made in the 80s. The same special effects Etc. Very disappointed. Negative one star."
  },
  {
    "rating": "3.5/5",
    "review": "Too many plot lines that don’t get fleshed out with the pacing moving too quickly. But it’s lot of fun with a perfect tone, campy humor, & a great look. The supporting cast completely steals the show with fitting acting."
  },
  {
    "rating": "4/5",
    "review": "A bit bloated with characters and plot lines, trying to cram in as many popular actos as possible. Still, a very enjoyable movie that goes beyond the original's spirit and style."
  },
  {
    "rating": "4.5/5",
    "review": "Very well done sequel to the first. I thought Jenna Ortega fits right in with the cast. I wish that Michael Keaton would have had more screen time but he didn't dissapoint with the time he had on screen. And also I think everyones favorite character was bob. They did a great job of ketching everyone up with what happend since the last film. I hope Tim Burton does a 3rd one."
  },
  {
    "rating": "2/5",
    "review": "It didn't capture my attention like the original. I won't be watching it repeatedly for years like the first, but still worth seeing once."
  },
  {
    "rating": "3.5/5",
    "review": "Not the classic but definitely enjoyable family movie"
  },
  {
    "rating": "2/5",
    "review": "I don’t get the hype. This movie didn’t even feel like a Tim Burton movie to me. It had too much going on and he waited too long to make a sequel. The storyline should’ve stayed focused on one story and where was the goth feel to it? I felt this was just thrown together. I remember when Burton actually put thought in his projects. He hasn’t really put out a good movie in a long time. Maybe he just doesn’t feel it anymore and is just used to the Disney light stuff. I don’t know what’s going on with him but this movie was a let down."
  },
  {
    "rating": "4/5",
    "review": "Bettlejuice 2 es buena pero la primer es mejor esta película no sirvió delores ni el padre mataron a mi querido bob(;() y me gustaría que wolf jackson tenga más escenas de acción por sus películas de Frank heardballer etc ( delia se parece a mi abuela ._. ) etc etc bueno me despido ¡BETTLEJUICE! ¡BETTLEJUICE! ¡BETTLEJUICE!"
  },
  {
    "rating": "5/5",
    "review": "Beetlejuice Beetlejuice still keeps the spirit of the first one but improved it with double the plot lines double the great acting double the nostalgia and double the fun!"
  },
  {
    "rating": "0.5/5",
    "review": "Not really much action"
  },
  {
    "rating": "3.5/5",
    "review": "Filme: Beetlejuice Assistido: 19-01-25 Elenco: @timburton @michaelkeatondouglas @winonaryderofficialn @jennaortega @monicabellucciofficiel @justintheroux @arthurstanleyconti @dannydevito9 @willemdafoesact @burngorman1 @catherineoharas Modelo: #trash #comedia #fantasia Duração: 1h 44m Ano: 2024 Minha opinião: Eu não assisti o 1º filme de 1988 que também tinha um elenco de 1ª Geena Davis, Alec Baldwin, Jeffrey Jones e 36 anos depois estão de volta Michael Keaton, Winona Ryder e Catherine O’Hara. Aqui temos também o diretor Tim Burton de volta. Com boas atuações de todos os atores. De terror não tem nada no filme. Tem até coreografia do Michael Jackson de Triller, pena que não usaram sua música. Temos Danny por alguns minutos e já morre, temos Dafoe fazendo um papel que se não existisse não mudaria em nada. Temos Monica aqui como sendo a ex-esposa de Beetle que agora revive e esta com cede de vingança por Beetle a fazer picadinho dela, e agora ela pode matar um fantasma, pois ela sulga sua essência. E a filha de Lydia acaba indo para o mundo fantasma enganado por um fantasma que quer sua vida em troca do dela. E para isso Lydia assina um contrato com Beetle para ir ao mundo dos fantasmas e salva-la e ai ta toda trama. O filme tenta tirar risada, mas não consegue. E mais para assistir o estilo trash e fantasia do filme. Roteiro e enredo não tem como comparar com o 1º porque não assisti. Um filme que teve um alto orçamento de 100 milhões de dólares e arrecadou 450 milhões de dólares. Vale apena assistir? Sim, mas sabendo que é bem trash o filme. Nota: 7"
  },
  {
    "rating": "5/5",
    "review": "It is as wacky as the first one. I appreciate the extent to which they held true to the style of the original."
  },
  {
    "rating": "2/5",
    "review": "Micheal Keaton did a great job playing Beetlejuice with as much vigor as he did 36 years ago. Unfortunately the rest of the cast did not. The story and dialog fell flat with too many sidestories."
  },
  {
    "rating": "3/5",
    "review": "Beetlejuice Beetlejuice is a decent welcome back both to some of the returning original cast and Tim Burton’s signature fun factor fans remember them for with a likeable Jenna Ortega daughter role of Lydia Deetz. However, the semi-unoriginal storytelling fails to elevate this Halloween cultural glory to new heights. Grading: B-"
  },
  {
    "rating": "4.5/5",
    "review": "Two words describe this one of a kind sequel: macabre macabre - in a good good way! You rarely find a sequel that scares you away as much as it shackles you on your seat. Beetlejuice Beetlejuice makes best best use of the humor, nostalgia and charme of the original without leaving too few space for its own dazzling story."
  },
  {
    "rating": "2.5/5",
    "review": "the original was way better. This was just ok."
  },
  {
    "rating": "5/5",
    "review": "Love the new movie! It had the perfect amount of nostalgia and loved the new story line. I wish Kathryn Newton from Lisa Frankenstein was in it. I’m hoping for a third Bettlejuice, Bettlejuice, Beetlejuice and hopping Geena Davis can be written in as a family member of Barbara or anyway they can in cooperate her. It was definitely missing her… & I also loved that Catherine O’Hara was in it. You can’t do Bettlejuice without her and Wynona."
  },
  {
    "rating": "5/5",
    "review": "Absolutely the entertainment hit of my year. I went in with an open mind and heart, having been a lover of Beetlejuice… and this movie doesn’t disappoint me! It touches on its history but also has its own unique story to unpack. Loved it!"
  },
  {
    "rating": "3/5",
    "review": "I'll be honest, this is more my taste that the first film. I didn't really care for that one, so nostalgia ruined absolutely nothing for me. In fact, I only saw the first one a few months ago. I couldn't watch it as a kid, because the imagery was too disturbing and unsettling for me back then. I feel no endearment to that film. This was one was pretty nice. Imagery is still spooky, but I can stomach it now."
  },
  {
    "rating": "2.5/5",
    "review": "Not bad, but not my favorite. Na vdd é bad sim"
  },
  {
    "rating": "3.5/5",
    "review": "I would give this film 3.5 stars because I enjoyed the originality of the plot, it did not merely seem like an extended first movie while also building on and advancing the characters introduced by the first movie. I think that adding in Jenna Ortega was a good choice and she added to the series nicely with an interesting character that helped build up a new plot and fill in gaps of Lydia's life until this point. However the film did feel a little all over the place at times with jumps to different antagonists which made it feel a bit crowded and flow more choppy. Overall I was happy to see the progression in Delia, Lydia, and Beetlejuice's characters and appreciated the film, it is definitely something I would recommend watching once for the experience and comedy but not something I would reach for to watch a second time."
  },
  {
    "rating": "4/5",
    "review": "BEETLEJUICE 2 is a suitably zany sequel, which wisely keeps with the style and spirit of the classic original by utilizing plenty of practical effects and wacky weirdness. We learn a little more about Beetlejuice's mysterious origins, and the structure of this hilariously bureaucratic underworld, but like the original, this film resolutely commits to story and antics over exposition. It's ghoulish without being overtly scary, and maintains a special brand of dark comedy all its own."
  },
  {
    "rating": "5/5",
    "review": "Being an absolute, lifetime, fan girl for Beetlejuice since the original, I have been waiting YEARS for this second movie. With that said, certain expectations, hopes, ideas, thoughts (the list goes on) have definitely formed (and re-formed) over the years in anticipation. So, going into this I tried my hardest not to let my hopes get too high, spiral too far out of hand, or allow myself to succumb to, too many preconceived notions or expectations upon movie number 2s emergence. Thus, when the eventual disappointment came (as I felt it inevitability would, especially with the endless ongoings and downfalls of late with/in/among Hollywood and the like), this disheartened fan would be well prepared for the walk of shame. The exiting of the theater in this presumed state of depression, would be at a point still capable of returning my empty shell of a being which remained to my home instead of ending it all there on the spot. Such preparation, hopefully, in part, may save some poor, unsuspecting soul the task of a messy clean up. However, upon viewing Beetlejuice Beetlejuice in its entirety, I must now repent of my wicked ways by admitting that while it isnt the first movie (understandably so), if one can pick up on the subtleties peppered throughout, understanding the history, sinister soul and dark brilliant mind of Tim Burton along with a running knowledge of his work and love of all things horror, this is an EXCELLENT movie which provides a deep glimpse into his life and art. Without some understanding of Mr Burton himself, however, one might find it cheesy and not be able to understand much of the cut-aways or references made in some of the backstory illustrated throughout. With that said, I would definitely recommend several viewings of this movie so as not to miss any of the aforementioned aspects."
  },
  {
    "rating": "1/5",
    "review": "This had four or five different storylines that could have been interesting if they had been given the time to develope, but unfortunately the best thing I can say about this movie is \"a lot of stuff happens\"."
  },
  {
    "rating": "3.5/5",
    "review": "A fun legacy sequel, way better than most movies' decades late return to a comedy franchise. Great to see the characters all back again, and it was an entertaining time returning to that wacky world of the afterlife. My only major criticism is that the ending felt a little too rushed, with a climax to a whole bunch of plot points being crammed together for a rather unsatisfying conclusion. Michael Keaton, and all the legacy cast, slid back into their roles perfectly. Some of the new characters were a bit hit-and-miss, but overall a good time."
  },
  {
    "rating": "2/5",
    "review": "So disappointing. Storyline is fragmented at best. I feel bad for the actors who did a great job, but this production is not worth the title or funds."
  },
  {
    "rating": "3/5",
    "review": "good film but don't get hopes to high"
  },
  {
    "rating": "2.5/5",
    "review": "Just more nostalgic scrap that adds nothing new. I gave it as high as I did for the acting. The story has way too many characters that ate useless and add nothing. The ending is somewhat confusing in the sense of what really happenef."
  },
  {
    "rating": "3.5/5",
    "review": "It's okay. Michael Keaton is box office as you'd expect. It's consistently wacky in keeping with the original, exactly as you'd expect. It's playful and faithful to the first film, yet lacks the magic that zapped the first into iconic status. It's decent, it's worth seeing, it's fun and it's creative. But is it objectively good? Not quite. The musical number lingers a little long and lacks the punch the original made you expect. The plot is signposted a little too easily and it perhaps relies a little too hard on Keaton to carry it. Are these things awful? Absolutely not. Could it have been better? Probably. Is it a decent addition to the Burton-verse? For sure."
  },
  {
    "rating": "3/5",
    "review": "was hoping for more. the weak screenplay and script is the killer...."
  },
  {
    "rating": "1/5",
    "review": "It did not take me long to figure out I made the biggest mistake I feel like I needed to be paid watching this movie."
  },
  {
    "rating": "2.5/5",
    "review": "Por fin la ví y puedo decir que me decepciona bastante, pensé que al menos iba a ser una mejor historia pero básicamente es lo mismo que en la primera, los efectos son bastante buenos y eso lo salva bastante, junto con Beetlejuice que hace la película un poco entretenida. Fuera de todo eso me parece muy mala y que no avanza para la cantidad de tiempo que tiene de diferencia a la primer entrega."
  },
  {
    "rating": "2/5",
    "review": "So, as a big fan of the first movie I had to separate them. Which is hard since there are quite a few call backs. But the more I remembered \"Oh yeah, the first movie was way better. And it seems like most people are here for a paycheck.\" That being said, Winona Ryder and Michael Keaton did a good job. Catherine O'Hara was just there, Jenna Ortega tried but something seemed off about her character. Almost like she was put in post production as a side quest. The plot with the ex wife was bland, sloppy, and made little to no help for the story. While it should've been the main focus, it was an after thought. The movie seemed to be better if steered in a good direction, but was almost a titanic failure."
  },
  {
    "rating": "3.5/5",
    "review": "I’ll watch anything Winona does."
  },
  {
    "rating": "1.5/5",
    "review": "Nothing special. I wouldn’t watch it again"
  },
  {
    "rating": "4/5",
    "review": "Movie was great. They revamped an old movie without trying to just completely recreate the old one and I loved that!"
  },
  {
    "rating": "1/5",
    "review": "Complete disappointment. Boring and such a waste. I was so looking forward to this part two, did not deliver. Why even make this crappy sequel?"
  },
  {
    "rating": "4.5/5",
    "review": "Fun, crazy film. An even better comeback from the original movie. All I don't like is the boy Astrid meets. Besides that, one of 2024's best films. Deserves a 87%"
  },
  {
    "rating": "1.5/5",
    "review": "A pointless, unfunny, and terribly written legacy sequel. Gough and Millars script features a severely episodic and undeveloped plot filled with paper-thin characters that dont earn the audiences interest or sympathy. On top of this, they confuse the clever, macabre humor of the original film with gross-out, off-putting jokes and resort to retconning in order to have scenes play out the way they want them to. Overall, the filmmakers do a massive disservice to a classic that they very clearly didnt understand."
  },
  {
    "rating": "4/5",
    "review": "Overall a solid movie. Very cool to see Michael Keaton, Winona Ryder, and Catherine O’Hara return. And Jenna Ortega was perfect for this role. Usually sequels aren’t so hot, but this was done well, with incredible cinematography. A fun movie to watch, and to keep the spirit of the original alive!"
  },
  {
    "rating": "2.5/5",
    "review": "A more decent second part than most movies. Low rating for avoiding making one Google search while writing the script. It would’ve revealed that it was Maria SKŁODOWSKA-Curie. A polish physicist."
  },
  {
    "rating": "5/5",
    "review": "I loved it. The cast was fantastic, and there are so many good unexpected laughs. A rare perfect sequel."
  },
  {
    "rating": "3/5",
    "review": "Very slow pacing, and all the parts I was excited for were all just packed into the last 20 minutes"
  },
  {
    "rating": "5/5",
    "review": "All the nostalgia you could want with a great splash of freshness. The story was beautifully written and the cast did an absolutely amazing job keeping me invested and connected to each character."
  },
  {
    "rating": "1.5/5",
    "review": "I understand why they couldn’t bring back *that* actor and I full heartedly support that. The fact that the movie then mentions the character way too often, cliche storylines and just everything that made the original feel like magic being stripped away just made this feel like it’s tarnishing the reputation of the original film."
  },
  {
    "rating": "1/5",
    "review": "This movie was a complete let down and waste to the actors coming back. It was a blatant money grab that felt like it could have been made straight to Netflix. The story was completely stupid, unoriginal, and was all over the place. This movie was almost as bad as the Ghostbusters 2016 Reboot."
  },
  {
    "rating": "3.5/5",
    "review": "Beetlejuice Beetlejuice is the sequel to the 1988 horror film Beetlejuice. Beetlejuice Beetlejuice is a decent film, but far as good as the first one. I don't have much to say to be honest. 5 out of 5 stars And 10 out of 10"
  },
  {
    "rating": "2/5",
    "review": "Booty juice, Booty Juice."
  },
  {
    "rating": "1.5/5",
    "review": "This movie was incredibly forced, fast writing fast plot, but incredibly slow scenes. Not even Willem Dafoe could save it. Truly, not funny. Super bummer."
  },
  {
    "rating": "3/5",
    "review": "First off, I love that Dehlia, Lydia and Michael Keaton reprised their roles for this film. And I love that the silly dance number in the chapel and loved that Jenna Ortega played Lydia's daughter. BUT I didn't really understand why that Jeremy guy killed his parents or why Lydia was going to marry Rory when her daughter clearly didn't like him. Like they would've been better off just trying to figure out their relationship with eachother. I hate that Charles had to die but hearing the Banana Boat song again was cool. Dehlias's bright red hair was wicked cool. I also didn't really know why Beetlejuice's ex wife was only hunting him to suck out his soul. Like that was literally her only point of being there. She was gorgeous minus the stitches on her body but it just reminded me that of Ginny Weasley and her only ultimate role in those films was to kiss Harry and have his kids. Other than that, I did enjoy it."
  },
  {
    "rating": "5/5",
    "review": "I don't care what anyone says. Beetlejuice Beetlejuice is the best movie of 2024 ever! Also, both movies Beetlejuice & Beetlejuice Beetlejuice are my favorites. As you can see, I rated the fist movie a 10/10 and the second one 88/10. Go check this one out!"
  },
  {
    "rating": "3/5",
    "review": "decent but nothing beats the first movie."
  },
  {
    "rating": "3/5",
    "review": "Not as chaotic, and therefore not as funny, as the first one which was released a shocking 36 years ago. Still the new effort has a lot of Tim Burton's signature on it and that alone is worth the watch."
  },
  {
    "rating": "2/5",
    "review": "This movie checked off all the boxes for fans of the original but there was nothing new, no surprises, no left turns. Watching it the first time, I felt like I had seen it already 100 times and was just there to eat popcorn. Keaton, O'Hara and Theroux were over the top fantastic as expected. The writing and directorial choices made for Ryder's character made no sense to me at all."
  },
  {
    "rating": "4/5",
    "review": "Well, it's definitely better than the original, which I found unwatchable in 2024. The sequel is quite a nice movie in itself. Especially liked Winona Ryder's nervous acting. Oh, but hated the dumb Tesla product placement."
  },
  {
    "rating": "2/5",
    "review": "I really liked most of the movie until the ending. It really felt like they started filming without having an ending written. The character of Delores was introduced and strung throughout the movie and then it turns out they have no relevance to the plot. I think the tone of the film was correct but the story just wasn't up to par with the first Beetlejuice."
  },
  {
    "rating": "2/5",
    "review": "Didn't hold up to the first one in my opinion, much sillier; definitely more for children than the first one was."
  },
  {
    "rating": "4.5/5",
    "review": "Beetlejuice (Michael Keaton) kehrt nach 36 Jahren zurück. Dieser ist immer noch in Lydia Deetz (Winona Ryder) verliebt und will sie heiraten, um aus der Totenwelt zu entkommen. Lydia Deetzs Vater ist gestorben und sie kehrt in die alte Stadt zurück, wo sie ihre Tochter Astrid (Jenna Ortega) wieder trifft. Durch verschiedenste Geschichten und Ereignissen, braucht Lydia Hilfe von Beetlejuice, doch kann sie ihm trauen. Die Fortsetzung der Horrorkomödie Beetlejuice, sorgt für viel Unterhaltung. Tim Burton führt wieder Regie und er kehrt hier zu seinen alten Wurzeln zurück. Die neueren Filme mögen, viele nicht, ich persönlich, konnte mit Alice im Wunderland und Big Eyes etwas anfangen. Die Schauspieler im Film haben den Spaß Ihres Lebens. Michael Keaton spielt wieder sensationell gut und unterhaltend. Die neuen Charaktere funktionieren, ebenfalls, besonders Willem Dafoe als Cop (ehemaliger Schauspieler) hat richtig viel Spaß. Seine Figur wird leider, etwas verschwendet und hätte mehr Screentime verdient. Viele Kritiker haben dem Film vorgeworfen, dass er zu viel erzählt und das Ende sich gerusht anfühlt. Kann ich zwar nachvollziehen, aber für mich hat das alles Sinn, ergeben und das Finale wurde gut aufgebaut. Den ersten Teil habe ich nur einmal gesehen mit Werbung. Laut meinen Erinnerungen, finde ich diesen hier, aber unterhaltsamer und besser. Ob dies noch der Fall ist, werde ich noch überprüfen. Die Musik im Film ist wieder passend, außer während der Beerdigung, dort wurde der Banana Song abgespielt, das war nicht nötig. Am Ende kann man sagen, das Beetlejuice Beetlejuice eine super Fortsetzung ist und ich würde mich über einen 3 Teil sehr freuen."
  },
  {
    "rating": "4.5/5",
    "review": "Watching BEETLEJUICE BEETLEJUCIE, the latest in a series of decades-in-the-making sequels to beloved 80’s movies, confirmed an unconscious suspicion I must have carried since the exhilarating ride that was last year’s “TOP GUN: Maverick”: A follow-up to a defining movie from one’s youth is the ideal vehicle for TIME TRAVEL. Consider the evidence: It’s EFFICIENT (access emotional memory archives, check!), SAFE (absent awkward hairdo photos, check plus!), and CONVENIENT (guaranteed drop-off at point of pick-up, ding ding ding!). 🕕 It sure helps the journey when said sequel is as FUN & SPIRITED (pun intended) as what must be Tim Burton’s most enjoyable LIVE ACTION film in 30 years… welcome to 2x1 puns Happy Hour! 🥸 🍸 I can’t decide if the reason for what could have been a WRECK deserves so much PRAISE is whether Burton has finally decided he has nothing to prove, OR the cast wells so well this feels like a Christopher Guest improv farce. The ORIGINAL CAST reprise their roles splendidly, Winona Ryder the slight exception. Her Lydia seems stuck in a “Stranger” version of Joyce Bear’s worry wart . The NEW CAST fall into a spectrum from outstanding (Jenna Ortega proving she’s twice the actress darling Winona ever was) to mediocre (sweet Monica Bellucci deserved that medieval slap from Beetlegeuse!). 👋🏼 Or maybe I LOVED BEETLEJUICE 2 simply because the film is a great sum of its parts: Sexagenarian weirdo genius creator + solid crazy cast + superb lifelong craft collaborators in couture, music, set design & special effects + silly script mixing the most RECYCLABLE slapstick concepts (After-life surreal desert, Kill-me-now-oh-wait-you-can’t-cause-I’m already DEAD waiting room) with FRESH slapstick concepts inspired by the original (“SOUL” TRAIN? LMFAO) = Let’s Get Whimsical! Please pass the Olivia Newton-John leotards.. I’m in the mood for silly 🤸‍♀️🤸‍♀️🤸‍♀️ It’s no spoiler calling for a moratorium on bathroom breaks lest you miss out on moments, such as the cameo of Richard Marx’s voice via a most unexpected “Right Here Waiting” serenade. 🪕 Or the catharsis in the hysterical “Take THAT you soul-sucking Influencers!” scene. Or EVERY minute of “Never Schittier” scene-stealer Catherine “The GREAT” O’Hara - Huzzah!! The hands down ABSOLUTE BEST MOMENT? That marionette show climactic dance sequence to “MacArthur Park”. SO good it’s UP THERE with the original “Day-O” dinner table sextet.. With this instant classic moment, MONSIEUR BURTON has perfected the art of taking a CHEESY song and cooking up a RACLETTE symphony. 🧀 🫕 In a movie that had me giggling like my 13-year old self again, that moment simply takes the cake. Pun Pun Pun. ‘Nuff Said. Ps #RIPBOB Kevin Redman Cris Herrera Jorge Herrera please watch, roll on the floor, and call me in the morning! 📞🙏🏽"
  },
  {
    "rating": "4/5",
    "review": "This was a competent and clever sequel that lives up to it's predecessor in almost every way. It helps having the majority of the original cast, as well as some welcomed new faces. It's also nice having Tim Burton back in the director's seat. He was able to keep the feel from the original and translate it just enough to keep the style without it feeling like a stale rehash. Nice job, Tim! My only negative for the film is it takes quite a while before we get to all the Beetlejuice stuff. Granted, there is a lot of story to cover between the original and now, but some of it could have been condensed into shorter segments. Overall, it's a true to the original sequel with all the zany and quirky natured things the original has. Even if it takes a bit to get started, once it does, you'll be hooked. If you were not a fan of the original, this one will not change your mind. However, if you were a fan and you crave more story, you can't go wrong with this albeit unnecessary, but welcomed, sequel."
  },
  {
    "rating": "3/5",
    "review": "Pretty average movie, just like the original. Just better CGI and VFX."
  },
  {
    "rating": "0.5/5",
    "review": "painful pointless and boring why can't there be any fun anymore?"
  },
  {
    "rating": "5/5",
    "review": "Feel good easy comedy, don’t compare the two and you’ll enjoy this for what it is, good music!"
  },
  {
    "rating": "3/5",
    "review": "I can’t lie: as a Tim Burton and Beetleguese enjoyer, I got a kick out of it. It wasn’t bad… but it wasn’t really good either. SPOILERS AHEAD. Positive: - easter eggs from the original - used real materials like clay and wood to make the creatures (I was scared they would digitize everything) - funny puns - fast paced Negative: - they *obliterated* Lydia’s character, she is not even the same person, and this new Lydia is highly unlikeable. Also, why does she have the same hairstyle and outfit as she did when she was a teenager? What is this, a cartoon? - celebrity cast with poor acting - cheesy - (this is my biggest complaint) the ghost couple living in the house from the first movie are now gone, with one line of dialogue about a vague “loophole” to explain their absence… 🤦 Why the good ratings? Simple. People like Tim Burton, and they like Beetleguese. Let’s face it, y’all wouldn’t tolerate this bs otherwise. I just wish that people had skipped badgering Wes Anderson over Asteroid City, and saved their energy to dunk Burton instead."
  },
  {
    "rating": "4.5/5",
    "review": "It was good to see Michael Keaton back as The Ghost with the most!"
  },
  {
    "rating": "3/5",
    "review": "The first half of the movie was okay, but the second half definitely jumped the shark. There was a decent plot twist in the middle. But then definitely tanked from there."
  },
  {
    "rating": "5/5",
    "review": "Dark visual aestetic, and sick humor. This film had the same feel of the original. A great follow up to a Tim Burton classic. The returning cast was great at jumping back into the roles, and made me feel like I was jumping right back into the same world with them all over again. The new cast did an awesome job at finding their characters rythem and how they fit in. The writting and story, where right on par with the brand of story telling that has made Tim Burton films so entertaining. He hasn't lost his touch one bit. If you are into his brand of Art and Entaimment, you will not be disappointed."
  },
  {
    "rating": "3/5",
    "review": "It’s definitely watchable not as good as the first but descent"
  },
  {
    "rating": "4/5",
    "review": "Um remake com diversos elementos da trama original, divertido para se assistir com toda a família. A trilha sonora é algo que merece ser pontuada como espetacular."
  },
  {
    "rating": "0.5/5",
    "review": "Bad writing, poor acting, tired story. Nostalgia couldn't save this one."
  },
  {
    "rating": "4/5",
    "review": "Movie started on slow side, but really hot it's stride in the second half. I dare say that the second half of this movie is better than the first movie."
  },
  {
    "rating": "5/5",
    "review": "Crazy weird. I’m not there yet!"
  },
  {
    "rating": "5/5",
    "review": "It was silly and fun, everything I wanted and more. We laughed out loud more than a few times. I know there will be detractors because it will be compared to the original, but it was a great film; it has it's own charm. Michael Keaton and Catherine O'Hara really, really shined."
  },
  {
    "rating": "1/5",
    "review": "This movie was so bad, that I actively questioned everything Tim Burton ever did because of it. Flat, unfunny with bad character development and bizarre plot choices (beetle’s wife?) this was the heart breaker I don’t see coming. It was terrible."
  },
  {
    "rating": "1.5/5",
    "review": "Hmm, this one frustrated with Rider's acting feeling flat and forced. On the whole the rest also did not keep me focused and I found my thoughts wandering. It doesn't live up to the original and I don't plan to ever watch it again. Props for trying though. Some good acting from others at times though. Saw on HBO."
  },
  {
    "rating": "3.5/5",
    "review": "Se desenvolve devagar, mas é divertido de assistir"
  },
  {
    "rating": "5/5",
    "review": "This was a really good movie. Even though the original movie came out 20 plus years ago this was really good."
  },
  {
    "rating": "5/5",
    "review": "great retro movie with not too much nostalgia good continuation of the story"
  },
  {
    "rating": "2/5",
    "review": "Hollywood stop remaking and/or creating sequels decades later of movie fan favorites. Originality is more attractive and this movie screamed of desperation!"
  },
  {
    "rating": "5/5",
    "review": "Just loved it , just cool ."
  },
  {
    "rating": "1.5/5",
    "review": "Found it be a very slow start then didn't really pick up much speed later."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed this movie. Not up to the same level as the first but it was an enjoyable sequel after all these years."
  },
  {
    "rating": "5/5",
    "review": "Awesome! So Nostalgic, entertaining, funny, the whole 9 yards!"
  },
  {
    "rating": "4/5",
    "review": "It’s not that bad for a sequel"
  },
  {
    "rating": "1/5",
    "review": "I should have stopped watching when the claymation popped up…"
  },
  {
    "rating": "4/5",
    "review": "A hilarious sequel. There are many flaws though. For example they were setting up the soul sucker to be a huge villian and she died immediatley in the first confrontation."
  },
  {
    "rating": "3.5/5",
    "review": "Overall, a fun film and excellent visual effects. Keaton is great as the mischievous title character. Jenna Ortega is also a great addition to the cast. It took a little while to get an interesting story but it really picked up with a surprisingly good twist involving one of the new characters. The ‘musical possession’ number in this one was more slick and fit into the film a lot better than the one in the first film too. Overall, a fairly worthy sequel."
  },
  {
    "rating": "4/5",
    "review": "The first one is one of my favourite movies, I enjoyed getting back into the world of Beetlejuice"
  },
  {
    "rating": "2.5/5",
    "review": "This movie disappointed me because I was going in with high hopes, unfortunately it was a downgrade from the original in terms of plot and improvements of the prior one. First of the all, there is nothing new in this film from the prior one saved some new characters and backgrounds. What I did not like at all was the slow build up and weak villain and lastly the poor editing as some scenes did not make sense at all. To sum this film up the trailer was better than the movie itself."
  },
  {
    "rating": "3.5/5",
    "review": "While I fall into the target audience for this, it just didn't land. It's more like a nostalgic trip riding on Winona's Stranger Things success. I'm giving it 3.5 (almost gave 4) stars because it is well done for what it is and did have a twist I didn't catch right away. It's worth a watch for those who love the original, and I found it entertaining. However, it probably deserves a three star for lacking originality and creativity. And it seems like they didn't know how to end the film. If you skip it, you aren't missing much. Love many of those involved, but I'm ready for something new, more thoughtful, and new artists to discover."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed this sequel."
  },
  {
    "rating": "2/5",
    "review": "I couldn’t really get into this one and was disappointed as looking forward to it. I loved the original which is one of Burton’s best films but this just felt like the director was trying to rehash old glory days. It’s a decent enough quality sequel but just didn’t have the magic of the original. Keaton was brilliant as always though as Beetlejuice and worth watching just for his performance."
  },
  {
    "rating": "5/5",
    "review": "There are a list of actors, brilliant, truly remarkable at the craft, who for one reason or another either never got enough sunlight or were shelved for some unfortunate reason. Robin Williams comes to mind. For a few members of this cast, that is sadly true. We’ve never seen enough Keaton, Defoe or Ryder. And in this production, conceived and delivered a pointe, its on show. I’m not leaving out the rest of the cast, there is equivalent praise for all of them too. A sequel that’s better than the original and a welcome return to Best in Burton. You do not want to miss this film."
  },
  {
    "rating": "3/5",
    "review": "Tim Burton may need some tweaks or improvements it wasn't bad but not good either"
  },
  {
    "rating": "2.5/5",
    "review": "For me the best part was Donna Summer singing McArthur park. But it is probably because im a huge donna fan... \\"
  },
  {
    "rating": "1.5/5",
    "review": "It was like watching a movie that was being made on the fly. Some albeit limited good scenes but vast majority seemed like misplaced filler"
  },
  {
    "rating": "4.5/5",
    "review": "I think it’s more of a remake than a sequel. But it comes with great practical effects and well picked actors, so gives you a great time watching like back in the old days."
  },
  {
    "rating": "1/5",
    "review": "This movie was not good."
  },
  {
    "rating": "2.5/5",
    "review": "Visually appealing. The effects team must be complimented. Well-acted with delightful reprisals and cameos. Overall riddled with disjointed storylines, too simple solutions, and a lack of payoff. Worth a watch, but not at a high cost and with little rewatch value. I don’t think it’s one I would even select as background noise while cleaning, but I might put it in the rotation if I had a movie marathon day dedicated to one of the actors involved."
  },
  {
    "rating": "3/5",
    "review": "Loved the first, very disappointed in this one. Also, I loved the young girl actress in the recent Munsters movie. She needed a bigger part."
  },
  {
    "rating": "4/5",
    "review": "Great movie if u like Burton and the old Beetlejuice...simple"
  },
  {
    "rating": "1.5/5",
    "review": "It wasn’t my cup of tea."
  },
  {
    "rating": "4/5",
    "review": "There will be spoilers here: The 2024 film year I was not looking forward to very much. No new films of any interest. Of the huge amount of sequels there were less than ten I wanted to see. Of those this film was the one at the top of my list. I was not disappointed a bit with this. It holds up well to the original. When you start the film with a surprise cameo from a well known actor/director who has worked with both Michael & Tim twice before that was a nice surprise. Now a lot of parts of the film were shown in commercials, trailers & promos that was not good. But even knowing about these parts of the story I was not disappointed. When you can put The Bee Gees “Tragedy” and the non Donna Summer version of “Mac Arthur Park” in the same film for comedic purposes you have a winner here. One thing I did not like was the mother Lydia and Astrid storyline at the beginning teenage daughter and Mom not getting along. That was a “seen it taped it” part for me. We have to give a hand to “Bob” the star of the film. 😊 So if you are a fan of the original film you will enjoy this follow up."
  },
  {
    "rating": "4/5",
    "review": "The B plots were lacking in substance and left something to be desired. However, Michael Keaton triumphantly brought his, arguably most iconic, character back to life with the usual sight gags and deadpan/slapstick humour that contributes to this being a worthy successor."
  },
  {
    "rating": "1.5/5",
    "review": "Should have just let sleeping dogs lie. Movie felt rushed to try and connect the dots while adding new characters. Being a sequel you would hope they focus a little more on the main character this time. All in all disapointing"
  },
  {
    "rating": "4.5/5",
    "review": "All I can say is the main song used in this movie is more iconic than day-o. Also it is random as hell lol"
  },
  {
    "rating": "3.5/5",
    "review": "This was a good sequel to the original. I enjoyed its homages. The actors, especially the Ghost with the Most himself, Michael Keaton, didn't miss a beat. The movie was outrageous in the best way. I enjoyed seeing the original cast and the new cast members as well. It's a fun ride with its wild humor. My only criticisms are that it might seem a bit chaotic because of its subplots, resulting in one new character who didn't seem as fleshed out (I won't say whom to avoid spoilers). Nonetheless, I would watch again in a Halloween or Beetlejuice marathon, and add to the Halloween watchlist. I rate this movie a 7/10."
  },
  {
    "rating": "4.5/5",
    "review": "Beetlejuice Beetlejuice Beetl… hilarious! Enjoyed this one more than the original. Storyline is fast paced, and all the twists and turns make this a fun watch!"
  },
  {
    "rating": "3.5/5",
    "review": "I liked it. Not the same as the original but I’m not mad at it. Shoutout bob one time, he was a real one. Take notes Gunna!!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie is a travesty. The fault lies with no one other than the writers and whoever green lit this. The acting cast did great with what they were given. This never should have been made. There is no real spark from the original in this, there is nothing that brings the creepy joy in this, and there is nothing that makes me want to watch this again. Very sad to say this but i have no idea why people are loving this. As a fan of the original, they should have left it as just that."
  },
  {
    "rating": "3.5/5",
    "review": "Such a disappointment! Keaton and O'Hara bring it but Burton's lost the magic. \"Day-O\" and the ensuing dance scene in the original was ICONIC! \"MacArthur Park\" and whatever the hell that choreographed slop show was supposed to be is MORONIC!"
  },
  {
    "rating": "2/5",
    "review": "Forced nostalgia, slipping performances, many re-hashed bits make this decades-in-the-offing sequel just not worth it. In the original, Beetlejuice's range of \"powers\" in various situations were novel and fun because the situations were unique and the \"solutions\" were very amusing responses to stimuli... In this sequel, it's clear that the writers never bothered to consider extending his \"powers\" to fit the new scenarios. His powers mostly consist of impersonations, popping up behind people, singing oldies, and making others lip sync to oldies. They had an imaginary world of the afterlife to play with and gave us a handful of regurgitated jokes (shrinking people down into the town model, scary face from behind, zipping Lydia's mouth shut, etc) and 25+ minutes of sing-alongs including a Choral \"Day-O\", which we have to assume became Charles Deetz's favorite song after the trauma inflicted on the family at that dinner 30 years ago? Strange. One of the \"main\" plotlines of Astrid's abduction lacks any drama or feeling... The revelation that she can also see the dead like her mother just sails by... The rescue and dispatching of her abductor is so brief it mutes any possible suspense of the peril she was in. Again, choices were made to spend a HUGE amount of time on an old country sing-along wedding scene rather than service the underlying story. Just baffling decisions on so many fronts. The other \"main\" plot line of Beetlejuice's scorned former love is again very rushed and sloppy. We get a 5-minute setup in French, providing some insight into his origin as a graverobber, his death at the hands of a cultist, but shockingly nothing on how he actually became this immensely powerful renegade ghoul. More questionable decisions. The courtship of Lydia, birth of Astrid, and death of Astrid's father are handled onscreen with a few lines of dialogue, but for some reason they needed to turn Jeffery Jones' Charles Deetz into a long drawn out claymation segment to justify a deus-ex machina in the afterlife that really did nothing at all. Was this just to insult the man for his legal issues? So baffling and a massive budget and time suck for very little payoff and story advancement. Very questionable decision making. I clearly have a lot of issues with the Direction, writing, and storytelling in this sequel-that-probably-shouldn't-have-been-made. There weren't enough fresh and/or fun elements to balance that bad out to make it worthwhile."
  },
  {
    "rating": "5/5",
    "review": "This movie is a must see. I watched it 3 times and loved it all 3 times didn’t get bored and didn’t expect it to be this good either. I watched the 1st movie the day before which was also really good especially for its time so I wasn’t expecting it to be as good or better than the first one but it definitely was"
  },
  {
    "rating": "2/5",
    "review": "I’ve been reading some reviews, and it seems like many people rated the movie highly because they felt it wasn’t bad compared to other sequels. Sure, sequels are tough—recapturing the charm of the original is no small feat. But Beetlejuice 2 doesn’t deserve a score similar to the first because, frankly, it’s just not as good. The foundation is there—a solid premise and some intriguing conflict, especially between Lydia, her mother, and her daughter. But the execution fell flat. The payoffs didn’t feel earned, and the story seemed to coast more on its quirky visuals than meaningful development. I appreciated Tim Burton’s restraint in limiting Beetlejuice’s screen time to avoid overexposure—a smart choice—but that restraint was undercut by the overemphasis on Burton’s other supernatural aesthetics. At times, it felt like the film was trying too hard to dazzle with its weirdness, leaving the characters and plotlines underdeveloped. The first Beetlejuice worked because it centered on its characters, with the weirdness enhancing the story rather than overpowering it. In this sequel, the balance tipped too far, and the promising elements—particularly the family dynamics—never fully took shape. It had its moments, but overall? Meh. I just couldn’t bring myself to care about any of the characters."
  },
  {
    "rating": "4/5",
    "review": "It was great having much of the old cast back together again. This is better than the original and Tim Burton stands strong."
  },
  {
    "rating": "1/5",
    "review": "This movie was so cringy and disappointing"
  },
  {
    "rating": "0.5/5",
    "review": "Omg. I feel bad for today’s youth if they believe this F movie clap trap is worth more than to be landfill in the sandworms litter box. what a terrible movie, I wouldn’t even copy it!"
  },
  {
    "rating": "4.5/5",
    "review": "Well done, not a reboot a sequel that interoperates the time between movies Overall it has the same feel of the original. There are many Easter eggs that juice it up some. The only real miss is not Having Bruce Campbell play Wolf Jackson instead of William Defoe"
  },
  {
    "rating": "5/5",
    "review": "a bit scary but AMAZING!!!"
  },
  {
    "rating": "5/5",
    "review": "Love this movie, Don't listen that the one star reviews those are just haters. They gave you the fill of the original, Michael Keaton was spot on as always I love those jokes that Beetlejuice always has. Definitely a real soul sucker"
  },
  {
    "rating": "4/5",
    "review": "Wild, offbeat, and brimming with dark humor, this movie delivers a fresh yet familiar blend of chaos and charm. The visuals are stunning, the soundtrack hits all the right notes, and the weirdness feels right at home. The villain feels oddly placed, and the investigation scenes seem a bit out of sync, but it’s all part of the ride. It doesn’t take itself too seriously, and neither should you. If you’re up for a quirky, spooky adventure that embraces its bizarre nature, this one’s worth the watch"
  },
  {
    "rating": "3.5/5",
    "review": "Good but seemed more like a musical than anything."
  },
  {
    "rating": "1.5/5",
    "review": "Too histrionic and obvious."
  },
  {
    "rating": "3/5",
    "review": "I love Tom Burton but I feel he lost sight of what the first one did to the audience... their were funny parts but really had too many stories going on and too many stupid antidotes to keep me fully intrigued, loved seeing a few of the originals back, they were great but still not the original..."
  },
  {
    "rating": "2/5",
    "review": "We were in anticipation of this? Meh"
  },
  {
    "rating": "1/5",
    "review": "Started off nostalgic but just got too stupid to continue watching."
  },
  {
    "rating": "1.5/5",
    "review": "Seemed slower paced, less coherent, and less fleshed-out compared to the first movie. Just a bunch of \"hey remember this thing from the first movie?\" over and over"
  },
  {
    "rating": "2.5/5",
    "review": "I feel like the biggest issue with the movie is the writing. Its campy and I love the acting/actors but the lines and the story is hit or miss. They tried introducing way too many aspects to this movie and it felt they couldn't find the time to breathe life in to any of them. I didn't mind Beetlejuice's backstory sequence and I found it very much something I feel could have been in the OG movie but the point of it was to talk about his ex and she, frankly, had no point in this movie. She has a very \"Bride of Chucky\" introduction in her first scene but after that you'd see her pop up once or twice trying to find him but offers no plot push or anything new to offer. Even at the end with her leaving (in leu of spoilers) had no effect on the main cast or the ending which could be credited to being wrapped up because of a loophole which again felt lazy and you can see it from a mile away. The daughters storyline was nice in the same way the bride's storyline was nice- had that been the only storyline. I like the daughter and LOVE the actress but her lines fall a lot of the time, once more to bad writing, and she seems far too gullible for her age. Lydia's future make sense for her character considering her past with her ex-husband and navigating seeing ghost but I truly wish they hadn't brushed over the husband and wife ghosts from the first movie so fast and I wish she had more knowledge from THEIR book or references to them semi-raising her but instead they were written out. While I love the ending for Lydia's parents, I do feel this movie was a complete flop for me and felt like a cash-grab and will become a movie that just plays in the background when I need noise. So sad."
  },
  {
    "rating": "0.5/5",
    "review": "The only Tim Burton movie that I haven't loved. Terrible!"
  },
  {
    "rating": "1.5/5",
    "review": "This movie feels like they cut a lot of it before it hit theaters. Beetlejuice’s ex wife did nothing, Beetlejuice didn’t do much either, The Maitlands were cut from the movie, the killer boy didn’t do much at all. Yeah this movie ain’t it. Definitely a far cry from the first movie. Another reason movies shouldn’t make sequels after this long."
  },
  {
    "rating": "1/5",
    "review": "Worse than the first one. The first half hour of the movie is completely pointless, the twist was obvious, and all the good plot points were rushed through without exploration while the movie dragged out boring ones. I would've left the theater if I wasn't there with children."
  },
  {
    "rating": "2/5",
    "review": "A confusing hot mess of too-many stories and lack of cohesion. I kept having to chant the MST3K mantra \"It's just a show, I should really just relax.\""
  },
  {
    "rating": "4.5/5",
    "review": "We loved it.. not as good as the first one"
  },
  {
    "rating": "0.5/5",
    "review": "Like driving road and never coming to the paved part for the millions brush spent on this they could have made it flow smoothly, the animated part just didn't fit the acting in the beginning was lackluster Michael Newton did his thing and was good in my opinion not well produced or put together"
  },
  {
    "rating": "3/5",
    "review": "Not great and not horrible kinda just was what it was"
  },
  {
    "rating": "3/5",
    "review": "Not that good. The best part of the movie is the scenery. The costumes and outfits. The production of sets. Other than that it's just hollow. Exactly what I expected though. These long time sequels rarely are that good."
  },
  {
    "rating": "2/5",
    "review": "Competly without a connected storyline! Slightly entertaining..."
  },
  {
    "rating": "1.5/5",
    "review": "The story on this one is just simply bad. It doesn't give Michael Keaton the chance to shine as the irreverent main character. The plot is boring and predictable. There was way too little Beetlejuice and the newer characters were so flat you didn't even really care about them."
  },
  {
    "rating": "5/5",
    "review": "One of the few 'late' sequels that works. Keaton gives the same energy he had in the first. After giving the original another watch before viewing this, I appreciate the joy that Tim Burton was able to give this script. Though the storyline is a bit construed at times, I thought it was a fantastic sequel"
  },
  {
    "rating": "5/5",
    "review": "Amazing better then the 1st movie as a Tim Burton fan i wasn't let down"
  },
  {
    "rating": "2/5",
    "review": "More style over substance, with a jam packed script and decent acting, it's entertaining enough but not very memorable."
  },
  {
    "rating": "4/5",
    "review": "Fun, nostalgic, gross and weird with a great soundtrack. What’s not to love? If you enjoyed the original, you should enjoy this. The original was weird and this one continues that trend nicely. Several story lines, but it’s not hard to follow, so I don’t know why that seems to be some people complain about. Lighten up and enjoy this quirky, comical, dark- humored horror… I sure did."
  },
  {
    "rating": "1/5",
    "review": "SPOILERS!!! Cannot be happier I did not pay to see this in theaters. Right out of the gate how the !$*! Did Lydia turn into this weak sneaky pill popping character dating this even weaker therapy speaking simp?! Plotline # 2 Beetlejuice' crazy ex makes an appearance sucking up danny devitos soul?? Apparently you can die twice? and we can already guess what she'll be mad about later. Plotline #3 Willem Dafoe is the underworld detective. Cool I guess. Plotline #4 Beetlejuice is still putzin around pining for Lydia still I guess?! Catherine O'Hara is doing what she does but at this point it just feels like excessive regurgitation. Then about 2/3 into the hour and 40 minutes film we get a 5th plotline involving Wednesday finding some attractive boy ghost and that's how she gets tricked into going into the underworld??? At this point there's 40 minutes left in the film where there attempt to wrap up all these different story lines and frankly the whole thing was all over the place with no room for any kind of character development. Just nonsense. I really struggle with actors of this caliber truly feeling like this was a good addition to their reel. Kinda felt like everyone wanted an easy Burton check. But that's just me."
  },
  {
    "rating": "1/5",
    "review": "Spoilers ahead, but can't imagine spoiling this stinker. Needed to pick a style and stick with it. One guy has been bitten in half by a shark with realistic exposed guts, blood still gurgling and pumping while another guy, who he'd been shot in the head, wore a prostatic that looked like a bright blue plastic Halloween mask for children. A memory is done in claymation, why? Lydia is shown to still see dead people in day to day life then they never utilize it or mention it again. A bunch of dead cross over into the living world, that falls flat and goes no where. William Defoe plays a character whose thin schtick is unfunny through the whole movie. Has a bit about Soul Train that would've been funny as a mention go on and on into a musical number. Then revisits it in the end they thought it was so funny. (It wasn't ) Their answer to the Day-O lip sync from the first movie flops when they use 'McArthur's Park', and goes on way, way too long. Winona Ryder embarrassingly still wears her teen goth look from the first movie. As if! Her daughter takes a bike ride through town while she broods that goes on and on. Maybe they needed a scene that showed the town they built for this movie for no reason? Michael Keaton seems tired. I've left out several other terrible choices they made so this review didn't become a book. Sorry, this review is all over the place. Just like the movie."
  },
  {
    "rating": "2.5/5",
    "review": "Tim Burton still produced some interesting visuals and funny moments, but the film never captured the originals charm. The movie gives off a modern “digital feel”, which is just disappointing when the first film already showcased all that had to be offered by the Beetlejuice franchise."
  },
  {
    "rating": "3/5",
    "review": "Meh. It tried hard to be as good as the first one, but Keaton and Ryder just don't have the spark any longer. Not terrible but not great, and completely pales in comparison to the first."
  },
  {
    "rating": "4/5",
    "review": "Good follow-up from the original. Best Tim Burton movie in quite some time."
  },
  {
    "rating": "0.5/5",
    "review": "Some fun parts. Worst movie I have seen in a while. Glad I didn't waste money at the theater"
  },
  {
    "rating": "1.5/5",
    "review": "I really enjoyed the original when it came out but found this sequel really lame. The original movie was inventive in many ways, this particular movie was a boring retread."
  },
  {
    "rating": "4.5/5",
    "review": "Tim Burton doing what he does best. Michael Keaton is an absolute legend, as always! It isn't as good as the first of course, but still a great movie!"
  },
  {
    "rating": "3.5/5",
    "review": "Thank you, Tim Burton, for another enchanting masterpiece! I've really missed seeing the brilliance of this director. Beetlejuice 2 brings back the dark and quirky universe that won over so many fans, this time with a fresh touch and a stellar cast. The sequel is just as entertaining as the original, further enriching the narrative. The visual effects are excellent and perfectly preserve the unique atmosphere that's Tim Burton's trademark. Winona Ryder still looks stunning and, as Lydia Deetz, continues to shine and steal the spotlight. Jenna Ortega, playing her daughter, also delivers an outstanding performance. She's an actress who feels like she stepped straight out of a Tim Burton film, embodying his style flawlessly. And, of course, Michael Keaton, reprising his role as Beetlejuice, is absolutely phenomenal, breathing life back into the iconic character. That said, the story does fall short in some areas, with certain acts moving too quickly, which hurts the development of some situations and makes it harder for the audience to connect with certain characters. Even so, the film's humor and charm more than make up for these flaws, making it a lighthearted and thoroughly enjoyable experience. Overall, Beetlejuice 2 is a sequel worthy of the original, with a solid cast, impressive effects, and all the magic only Tim Burton can create. It's a beautiful tribute to the legacy of the first film and a real treat for fans."
  },
  {
    "rating": "4/5",
    "review": "Excellent movie! I assumed that it would not be as good as the first one. But I was wrong! It's graphics are great, and the storyline is great too. It has a few surprises that I didn't expect too. That was a plus also. I highly recommend that you see this film."
  },
  {
    "rating": "2/5",
    "review": "What a boring movie! Seemed like the actors had just woken up"
  },
  {
    "rating": "2/5",
    "review": "Maybe the bar was too high from the original.Dtorylines too rushed at the end and went off the rails for me with the 5 minute soultrain sequence and what seemed like 20 minutes when it turned into a musical with a bad song selection.Disappointing."
  },
  {
    "rating": "4/5",
    "review": "Most well done random mess of a movie ever! The first half annoyed me with its easy-breezy delivery of lines and overly convenient setups. Way too effortless and seemed to be another post pandemic phone in. However, what initially put me off became a big part of its charm as the clever plot and subplots took over and that unchallenging, plain sailing, erratic arbitrariness become delightful whimsy. The thing Burton does best. It was the doubling down with the wedding cake scene that put it over the top and allowed me to succumb to the ridiculous but now somehow more substantial helter skelter. A definite and rare 180 for me. Turned out to be not just a fun but also solid movie!"
  },
  {
    "rating": "1.5/5",
    "review": "Movie seemed as If it was still in the brain storming stages. The plot took a long time to establish and the peek and ending was rushed I feel."
  },
  {
    "rating": "2/5",
    "review": "My wife and I Loved the Original movie. This new movie was mediocre at best, and terrible at worst. Yes they brought back lots of imagery and characters from the original film, but the plot and the acting was definitely straight to video kind of stuff. Very happy we didn't see this in the theater, I will have forgotten most of it within a few days, thankfully."
  },
  {
    "rating": "2/5",
    "review": "Felt really forced, bad story line, poorly defined characters, and with a really slow start I was amazed at how quickly it they wrapped up so many topics in the last 20 mins. Could have been two movies if they had focused on story writing Only saving grace was Michael Keaton reprising the role"
  },
  {
    "rating": "4/5",
    "review": "Very good but way too many storylines going on at one time. Some story lines seemed rushed at the end. Some storylines were not needed."
  },
  {
    "rating": "3/5",
    "review": "Maybe It's comedies that I don't like because when trying to watch this, I just wondered, why?"
  },
  {
    "rating": "3.5/5",
    "review": "A pretty good sequel to a cult classic movie. I loved how they were able to bring back a lot of the original actors and enjoyed the blend of new characters with A list actors behind them. The effects were just as campy as the first movie which made it entertaining. I will say the actual storyline wasn't as enthralling as the first. The big bad was barely ever seen and when she was on screen she wasn't doing much. Of course Beetlejuice himself was phenomenal but the comedy didn't land as much as the first one did. I enjoyed what we saw from the actors and believe their performances were phenomenal but the actual writing wasn't the strongest. I believe casting was amazing, bringing on Jenna Ortega to play Winona Rider's daughter was I think one of the smartest casting choices. I love to see all the unique characters in the underworld and trying to put together the pieces on how they died was really entertaining. The set design was amazing and like I said before the effects were just on the line between camp and bad, which was perfect for this type of movie. I think it is a good sequel but it doesn't stand out on its own."
  },
  {
    "rating": "3/5",
    "review": "I came into this already knowing that it would disappoint in some way, with the bar raised so high by the original. But what I will fault Mr. Burton for is... and I know this is a hot take... Sort of phoning it in. Sure, the original was a comedy, and there was a lot of goofiness to it, but it also relied on an intriguing plot that didn't really care to please, but moreso entertain. They remain somewhat loyal to the legacy characters' unique personas, but nostalgia is basically the only reason this did so well in theaters. Obviously, it's not a bad movie by itself, but perhaps it's just not that good of a sequel."
  },
  {
    "rating": "1/5",
    "review": "Horrible, compared to the first one. Dragged to sit through. Only worth while to watch because of Micheal Keaton."
  },
  {
    "rating": "4.5/5",
    "review": "I watched the Beetlejuice Beetlejuice movie to see Michael Keaton in his most funny role ever. The plot of Beetlejuice Beetlejuice is less developed than the original Beetlejuice movie, yet this did not make any difference in terms of the laughs. I found the sequel even funnier than the original Beetlejuice movie. Beetlejuice Beetlejuice is a celebration of silliness. I fell out of my seat laughing at a few of the scenes. Michael Keaton was fantastically hilarious. I like this sort of light hearted humor where you don't have to take anything seriously. This was the funniest comedy that I've seen in a long time."
  },
  {
    "rating": "4/5",
    "review": "The Juice is BACK!!! It was so great to be back in that world, seeing how the characters evolved. Was it as good as the first one, no, but it was Great fun. I hope there's a 3rd one."
  },
  {
    "rating": "4/5",
    "review": "I had no expectations going into this one. I wasn't against the idea of a sequel to the original, but Beetlejuice is one of my favorite movies of any decade and, honestly, I'd always assumed it was a brilliantly original one-and-done, a notion I was fine with. But here we are decades later and a sequel we have been given. To my surprise and great delight, I really enjoyed Beetlejuice Beetlejuice. It's a funny , highly entertaining sequel that is cluttered with too many story threads, but is elevated by a knockout performance from Michael Keaton as the ghost with the most and the best work Tim Burton has delivered behind the camera in years. The entire cast is terrific - Winona Ryder does great work as an older Lydia and Jenna Ortega is perfect as her daughter.. But special praise has to be given to Catherine O'Hara, who returns as Delia Deitz. O Hara is naturally funny anyway, but she's absolutely this movie's secret weapon .. Delia is still Delia, but this time the daffy artist from the original has gained some wisdom over the years and O'Hara does a tremendous job of not only making her funny again, but giving the audience a reason to actually care about her. The visuals are a winning mix of limited CGI work and almost wall to wall practical effects, so this feels like the same world. One sidebar I have to mention: All of the plot threads are eventually pulled together in a brilliant, genuinely funny sequence set to Richard Harris' version of MacArthur Park that may be the single best thing Tim Burton has ever done. This sequence is easily a high water mark in the career of both Burton and Keaton (who gloriously takes it up to eleven in this scene) and it's the coup de grace that elevates this sequel to being almost on the same level as the original. Almost. As I mentioned, there are too many plot threads and, honestly, some rewriting could have had this movie end in the same place while losing the storylines involving Justin Theroux and Willem Dafoe. They're both good in their roles, but they feel unnecessary to this movie. But those are minor quibbles. Beetlejuice Beetlejuice was smarter, funnier and more respectful to the original than I could have hoped. It's a terrific sequel and I highly recommend it. **** out of *****.."
  },
  {
    "rating": "1/5",
    "review": "It felt hurried and not dark enough for Tim Burton. The atmosphere of the film was wispy and not very funny at all. All in all I was very disappointed, I hope Tim is not losing his touch, it kind of feels like watching grandpa dance to hip-hop music because back in his day he could Charleston really well...."
  },
  {
    "rating": "0.5/5",
    "review": "terrible.. if you enjoyed the first don't watch... couldn't watch the whole thing, it was so bad - as in unwatchably bad..."
  },
  {
    "rating": "0.5/5",
    "review": "Easily the worst movie I have seen in a long time. Ended up turning it off 20 minutes in. Catherine O'hara's better have a great chiropractor after carrying this garbage of a film. It was just plain stupid, I'm assuming some parts were meant to be humorous, wow did they fail to miss their mark. I dont even think I'll turn it back on after writing this."
  },
  {
    "rating": "2/5",
    "review": "Too many characters that didn’t really build to the flow of the story. Everyone was just kind of thrown in this film in a mix mosh mess. Good enough to stay entertained, but could have been better thought out."
  },
  {
    "rating": "1.5/5",
    "review": "The Original Beatlejuice was awesome. Great characters and a good story. Its a movie I could watch many, many, times over. Any time I hear tally me banana I think of Beatlejuice. I cannot say the same for any of the songs in Beatlejuice Beatlejuice especially the lame ass song at the end in the church. The movie was all over the place with undeveloped characters and seemed thrown together. Ive watched it twice and the second time was more disappointing than the first. How this movie was considered a success is beyond me."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible! Very disappointed ☹️! Would not recommend."
  },
  {
    "rating": "3.5/5",
    "review": "Beetlejuice Beetlejuuice is an ambitious Tim Burtonesqe sequel from Tim Burton. It captured the essence of the first and is a good, stand alone, and follow up sequel. This broadens the audience for this one. Like the first film the first third to half is slow and then it explodes. Michael Keaton is great reprising his role as the zany undead, iconic character. Winona Ryder and Catherine O'Hara are very good as the centerpiece of the sequel, and what ties it to the first. Jenna Ortega, Burtons latest muse, does a good job of playing the tortured, innocent, yet sexy daughter of Ryder than is caught in the middle of it all. There are many great cameos nthjroughout. The look is clearly Burton, and it is great to have it in a modern film but true to Burton's legacy."
  },
  {
    "rating": "4/5",
    "review": "Just as good as the first....different but cool ✌🏾"
  },
  {
    "rating": "1.5/5",
    "review": "Not a single laugh in the whole movie. Just dull and nostalgia based. This movie also made me realize how Geena Davis was the best part of the original. It just didn't have that same charm without her."
  },
  {
    "rating": "4/5",
    "review": "Given the original movie, I think this was about as good a sequel as possible. Clearly a real interest in discovering what the characters have been up to in life (and death). Still plenty quirky, with lots of references to the original and new creative moments. I am not a sequel person; I almost never watch them. But this one was worth it."
  },
  {
    "rating": "5/5",
    "review": "12/4/24 Loved it. As good or better than the original"
  },
  {
    "rating": "4/5",
    "review": "A little all over the place and a lot of subplots that seemed to go nowhere but it was good to hang out with Catherine O'Hara and Winona Ryder together again!"
  },
  {
    "rating": "5/5",
    "review": "What a great follow up to the 1988 classic. I love the new characters mixed with the old. Michael Keaton is hilarious and this fullfilled my every desire. Tim Treakle"
  },
  {
    "rating": "4.5/5",
    "review": "Awesome sequel. Winona Ryders performance wasnt what I expected but loved the story and the Easter eggs. Tim Burton is a movie genius."
  },
  {
    "rating": "1.5/5",
    "review": "Beetlejuice 2 feels like a tired rehash of the original, and even Michael Keaton's performance struggles to bring it to life. While he slips back into the role with ease, his delivery often feels phoned-in, lacking the sharp energy and wild unpredictability that defined his original portrayal. Rather than elevating the material, Keaton seems to coast through scenes, relying on the character's established quirks instead of pushing for something fresh or memorable. Combined with a messy, unfocused script and uninspired humor, the film comes across as lazy overall, leaning too heavily on nostalgia without adding anything meaningful to the story or characters. It’s a missed opportunity to properly revisit such an iconic role and world."
  },
  {
    "rating": "4.5/5",
    "review": "I thought that this was an amazing sequel to the original did everything they should have for a sequel."
  },
  {
    "rating": "0.5/5",
    "review": "This was a horrible movie I’m such a huge fan of the original this movie shouldn’t have been made it made me mad that they ruined it so bad. Some originals should just be left alone and not recreated many years later. Awful movie!!"
  },
  {
    "rating": "4.5/5",
    "review": "Frankly, I enjoyed it more than the first one. The ending is a bit confusing, but overall great fun."
  },
  {
    "rating": "3.5/5",
    "review": "The story takes place years after the events of the first Beetlejuice Lydia has a daughter and still lives in the same house, they get the news her father has passed away and she tries to cope her father's death and her bond with her daughter. Beetlejuice returns but he has a set of problems of his own. The story itself does divide into different areas, you have Lydia's daughter trying deal with her mothers talking to the dead lifestyle and her father's death, you have Beetlejuice dealing with a past affair that didn't stay buried. The storyline needed more depth to the connection between Lydia her family and Beetlejuice. If fans have seen the cartoon series this feels like one of those episodes. The main villain is fairly a weak one and doesn't add a different interest. Michael Keaton nails his role reprising Beetlejuice giving us the same Ole deviant demon he was in the first film. We do get to revisit the after life as we saw in the first film but it's more of a foreground than an adventure. Practical effects is always a plus and it's sufficient in this sequel. It can be enjoyable to watch but it didn't quite match the level of the first film."
  },
  {
    "rating": "4.5/5",
    "review": "This gave my heart so much joy! We finally watched this via buying on Amazon Prime. Filmed in Vermont it held an even bigger piece of my heart because it allowed a little town to get big notoriety. This movie gave a SOLID nod back to the original from 1988. Everything about it felt like it was only a few years in-between filming, not 36 years! Michael Keaton, Winona Ryder, and Catherine O'Hara felt as if they just picked back up without skipping a beat. The into of Jenna Ortega was a GREAT add. Her role in Wednesday I felt made her perfect for the daughter of this movie."
  },
  {
    "rating": "4/5",
    "review": "everything was great except for the stupid soul train idea."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed this movie as a fan of the original. It kept a similar tone and sense of humor. It was fun seeing more of the afterlife world."
  },
  {
    "rating": "3/5",
    "review": "Not bad for this long awaited sequel. I wasn’t really sure what to expect from this. It was nice to see Catherine O’Hara once again, although I think sometimes we got more of her Moira character from $hitt’s Creek than Delia Deetz. Visual and graphics are classic Tim Burton, but the musical score was lacklustre at best, with the talents of Danny Elfman being shadowed by MacArthur’s Park??🤌🏼…which seemed to be the movie’s theme song??🤔 I mean, not a bad song. I still have Donna Summer’s version on 45, but the dancing scene inside the church just seemed like an afterthought, if even a bit rushed. The transition between the living and dead worlds was a bit too casual and lacking that spooky feel that the original 1988 version had. While this was well done and I did enjoy it, I’m afraid it just wasn’t as magical for me as the original."
  },
  {
    "rating": "5/5",
    "review": "It was pretty good movie, but not as great as the original. Didn’t realize how popular it is until i seen other spectators cosplaying as the characters to watch the movie too."
  },
  {
    "rating": "4/5",
    "review": "The sequel is a bit of a slow burn. It's fun but takes over half of the movie to really pick up. The way they played off the father/grandfather (Jeffery Jones) is an interesting choice for obvious reasons."
  },
  {
    "rating": "0.5/5",
    "review": "Very disappointing!!!"
  },
  {
    "rating": "4/5",
    "review": "everything you would expect from a sequel. very funny."
  },
  {
    "rating": "3.5/5",
    "review": "Great movie, fun to see!"
  },
  {
    "rating": "0.5/5",
    "review": "Very disappointing, I thought it was going to be good since Jenna Ortega was in it, terrible plot to, I was struggling to understand what was happening throughout the whole film."
  },
  {
    "rating": "1/5",
    "review": "So bad. Trying to hard and overacted by several.., turned it off halfway through"
  },
  {
    "rating": "1.5/5",
    "review": "Nothing like the original other than a few of the same actors. I would recommend waiting till it comes out on streaming channels."
  },
  {
    "rating": "4/5",
    "review": "So many times it has been a disappointment seeing a sequel or 2nd movie after such an iconic 1st movie. This movie did not disappoint! This movie incorporated a lot from the first movie which made it feel like coming home. It's a \"must watch\" movie if you loved the first one"
  },
  {
    "rating": "4/5",
    "review": "If you love the original you will love this. The actors and actresses all fell right back into their roles. Most of the new characters do a great job but the \"villain\" feels wasted."
  },
  {
    "rating": "1/5",
    "review": "I thought it was just ridiculous. The first was way better."
  },
  {
    "rating": "5/5",
    "review": "Great movie watched it more than once"
  },
  {
    "rating": "1.5/5",
    "review": "Some things are better left alone. Catherine O’Hara was the star of this and I don’t even want to say what they did to poor Lydia… they might as well have killed her off. Stick with the original."
  },
  {
    "rating": "3/5",
    "review": "Its ok...nowhere near better than original."
  },
  {
    "rating": "5/5",
    "review": "So glad this was as good as it was! In my opinion, it definitely lived up to the hype! Total home run/slam dunk!! 😄 My daughter and I really enjoyed this long-awaited follow-up!! 🪲🧃"
  },
  {
    "rating": "0.5/5",
    "review": "If I could give it zero I would, I was so disappointed by this film. I waited so patiently for so long, as has everyone, for a second movie. However, this movie was just total trash, so disappointing and overdone. I really expected and hoped for more as this being a Tim Burton film. It clearly was not, it was just idiocracy and I feel sorry I ever watched it. This film could never compare to the original, not ever. I’ve actually warned other Beetlejuice lovers to not watch the film or if they do, not to have high expectations. 👎🏼"
  },
  {
    "rating": "1/5",
    "review": "Man if I could give this movie zero stars I would give it a million. This was by far THE WORST MOVIE I HAVE EVER HAD THE DISPLEAZURE TO SIT THROUGH! I cannot believe we waited 30 YEARS for this piece of trash. I'm so disappointed. I want my money and my time back. Do yourselves a favor and don't waste your time. Blegh.🤢🤮🤮🤮🤮🤮"
  },
  {
    "rating": "5/5",
    "review": "So fun! Even better than the first!"
  },
  {
    "rating": "3/5",
    "review": "Could have gone with bigger names for Beetlejuice’s ghost wife and Lydia’s cringy boyfriend. Idk who they were but I think they held the film back a bit. The part about Lydia’s dead husband was weird, shouldn’t have been written into the film."
  },
  {
    "rating": "4/5",
    "review": "Obviously not as good as the original, but you can tell a lot of love went into making this film. It's a worthy successor. Just wish the plots and pacing were tightened up a bit, seems rather wishy washy as you go on."
  },
  {
    "rating": "1.5/5",
    "review": "What is this. It's made for kids, It doesn't seem to be a Tim Burton movie, nothing like the first Beetlejuice"
  },
  {
    "rating": "3/5",
    "review": "We liked it! Not as good as the first Beetlejuice, but it was enteraining."
  },
  {
    "rating": "5/5",
    "review": "https://youtube.com/shorts/MnCwZtotvJc?si=de2_Y1E-v7Ny2xUu"
  },
  {
    "rating": "1.5/5",
    "review": "I was so excited to see this. Man was I disappointed. The movie had little to do with Beetlejuice and was basically loaded with family drama. It was like watching a bad housewives episode that would not end."
  },
  {
    "rating": "2.5/5",
    "review": "It was cute but it did not capture the essence the first movie had."
  },
  {
    "rating": "5/5",
    "review": "They couldnt have done this movie any better. I loved it all. The complaints I'm seeing are there weasnt enough of Beetlejuice juice himself. He was more of a aide character. Ummm duh... he was in the first one too. It was fabulous lol"
  },
  {
    "rating": "0.5/5",
    "review": "Awful. 106 minutes of our lives we’ll never get back."
  },
  {
    "rating": "0.5/5",
    "review": "Terribly stupid, overdone, and a total waste of $9.99 . Don't waste your time or money Stopped watching after 15\"."
  },
  {
    "rating": "3/5",
    "review": "There’s nothing like the original Beetlejuice movie it’s a classic and did not need a part two. The cast was great the storyline meh"
  },
  {
    "rating": "2.5/5",
    "review": "Nostalgic, But Lacking the Original’s Magic As a lifelong fan of Tim Burton’s 1988 classic Beetlejuice, I was thrilled to see the return of the “ghost with the most.” However, while Beetlejuice 2 boasts a talented cast and Burton’s signature visual style, it ultimately feels more like a rehashed homage to the original than a worthy sequel. Michael Keaton is once again fantastic as the mischievous Beetlejuice, effortlessly slipping back into the role with his trademark chaos and charm. Winona Ryder also shines in her return as Lydia Deetz, now older but still deeply connected to the macabre. The newer additions to the cast, including Jenna Ortega, bring energy and charisma, but even their performances can’t overcome the film's overly familiar plot. Rather than building on the creativity and innovation of the original, Beetlejuice 2 plays it safe. It recycles many of the same jokes, scenarios, and themes without adding much that feels new or exciting. For viewers unfamiliar with the first movie, this might not be an issue—it’s quirky and fun enough to entertain. However, for fans of the 1988 classic, it’s hard not to feel disappointed by the lack of originality. What made Beetlejuice a cultural phenomenon was its boldness, unpredictability, and unique charm. While the sequel has moments of humor and nostalgia, it fails to capture the same spark that made the original timeless. In the end, Beetlejuice 2 is a decent watch for casual audiences but a missed opportunity for fans hoping for a fresh and inventive continuation of the story."
  },
  {
    "rating": "5/5",
    "review": "Just fine as an entertaining lark."
  },
  {
    "rating": "5/5",
    "review": "Great movie for my child"
  },
  {
    "rating": "3.5/5",
    "review": "Beetlejuice Beetlejuice is a nostalgic blast! It’s a blend of the original with the cartoons twist. Michael Keaton, Winona Ryder, and Cathrine O’Hara fall right back into the character I feel in love with."
  },
  {
    "rating": "5/5",
    "review": "I loved that they kept the same original characters."
  },
  {
    "rating": "4.5/5",
    "review": "Loved the movie. The characters from the 1st film did such a great job in this movie. They did such a great job in keeping the theme, costumes, effects, etc as that of the original. This movie did have more funnier scenes than the first movie. This has a soundtrack that was done quite well for the scenes. That was a nice added thing to this."
  },
  {
    "rating": "3/5",
    "review": "Not has good as the first one it still a good movie."
  },
  {
    "rating": "5/5",
    "review": "Awesome film Beetlejuice Beetlejuice is so funny awesome cast awesome film awesome second part to this film you must watch this film"
  },
  {
    "rating": "3/5",
    "review": "tried too hard- too many sub plots!!"
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely bum cheeks"
  },
  {
    "rating": "4/5",
    "review": "Really well done but there was a lot crammed into the movie."
  },
  {
    "rating": "0.5/5",
    "review": "Beetlejuice was one of the worst movies I've ever seen in a while i would not run that recommend this it's boring."
  },
  {
    "rating": "3.5/5",
    "review": "Not as good as the original but worth a watch."
  },
  {
    "rating": "3.5/5",
    "review": "mediocre comedy, the laughter didn't start, for me, till the end of movie"
  },
  {
    "rating": "4/5",
    "review": "Nostalgic movie in the making that took about 40 years to come into fruition! It was wonderful to see the cast, especially Michael Keaton reprising his role again. Take in to account Jenna Ortega’s character was a great edition that fit seamlessly with the other vibe of the cast."
  },
  {
    "rating": "4.5/5",
    "review": "it is definitely a sequel to the original and has all the charm, only critique is it was a little too weird at times and there were so many plot lines, but overall a great movie, 8/10"
  },
  {
    "rating": "4.5/5",
    "review": "Beetlejuice Beetlejuice is a pretty good sequel coming out many years after the original film. It had a lot going on but the film was basically trying to throw you off from who’s the actual villain in the film. Also loved the musical number 😂"
  },
  {
    "rating": "2/5",
    "review": "The story is disjointed, and the comedy is far and between. Jenna Ortega is great, Monica Belluci is wasted. it was just OK. if you are a fan, check it out just for nostalgia. Otherwise, I don't know if this worth a rewatch every Halloween."
  },
  {
    "rating": "1.5/5",
    "review": "Michael Keaton said in an interview that he waited so long to make a sequel because he didn't want to disappoint anyone. His portrayal of Beetlejuice was spot on, but underused. A meandering story that lacked the wicked magic of the original, with little screentime of Delia and missing every other significant player besides Lydia. I think I've seen Beetlejuice 100 times, but won't bother viewing Bettlejuice Beetlejuice again."
  },
  {
    "rating": "3.5/5",
    "review": "It was a good movie, but it was more ridiculous and a little poorer quality than the second movie, but I liked it in terms of the pacing, I liked it close to the first movie, but it was still good, it was a little lacking in quality, but it was good. If that's not your style, don't watch it because this movie is more about nonsense and horror-comedy."
  },
  {
    "rating": "2.5/5",
    "review": "Keaton pulled it off, but the script unfortunately didn't. The beginning started well, but then it was only average. The ending is boring, musical and nonsense. The main enemies were very interesting, but they were eliminated without any difficulty. Plus waaaay too much Catherine O'Hara. And after watching Wednesday, I expected more from Ortega. Pity."
  },
  {
    "rating": "3.5/5",
    "review": "Beetlejuice Beetlejuice was a very good movie however I don’t think this movie needed a sequel. I was fine with just the original. The original one is better than The sequel however, think this is a very good sequel to the movie. I like all the Easter eggs and the sequel and I love how they did not forget The original cast of characters from the First movie. I love how we got to see how far Lydia and Delia came from after the original."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed the film, and my parents did too. The original was one of my mom's favorites. She thought it had a similar feel to it."
  },
  {
    "rating": "5/5",
    "review": "Well worthy sequel and better than the original"
  },
  {
    "rating": "4.5/5",
    "review": "A very fun and entertaining sequel filled with laughs and a solid story. Michael Keaton brings the same qualities to Beetlejuice that everyone can enjoy - and with added knowledge about Beetlejuice's background just makes the audience love him even more. Catherine O'Hara was hilarious and great to see her again."
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining sequel by Tim Burton"
  },
  {
    "rating": "5/5",
    "review": "This was a great movie better than the first"
  },
  {
    "rating": "2.5/5",
    "review": "This has the same quirky charm as the original and hits the requisite sequel notes... but that's about it. Michael Keaton is suitably entertaining and delivers consistently on his character. The storylines are kind of all over the place and keep me from feeling emotionally invested in any of them. I don't regret watching this, but it's never going to be a classic. I'll just keep rewatching the original for my fix."
  },
  {
    "rating": "5/5",
    "review": "Vraiment bon! funny and entertaining"
  },
  {
    "rating": "5/5",
    "review": "I enjoyed the movie. Was glad to see some familiar actors/actresses from the first movie returning. No one else can play Beetlejuice like Michael Keaton! I highly recommend it."
  },
  {
    "rating": "5/5",
    "review": "Nicholson still funny, making all of us laugh and the other actors as well love it can’t wait till the next part. Enjoy your day with me and mine girlfriend."
  },
  {
    "rating": "3.5/5",
    "review": "A fun, effective sequel to a beloved original film. Keaton is still the “Ghost with the most.”"
  },
  {
    "rating": "2/5",
    "review": "This film delivered on fan service but not much else. The plot(s) were a fairly chaotic mess. I would have followed one or two of them happily but there were entirely too many and all of them were underdeveloped. There are some funny moments and entertaining set pieces, but I was never emotionally invested and it only briefly felt like the film had stakes, which were erased a little too conveniently. Good for Michael Keaton though, he's had a great career and deserves to cash in on his iconic roles."
  },
  {
    "rating": "4.5/5",
    "review": "it’s comforting to see Tim Burton resist the urge to “fix” what isn’t broken—Beetlejuice 2 brings back all the zany charm of the original, like a bizarre, ghostly time capsule. Michael Keaton’s Beetlejuice is still delightfully unhinged, Winona Ryder’s Lydia feels like she never left, and the film leans into its quirky chaos without missing a beat. it’s the perfect spooky treat: nostalgic, weird, and unapologetically Beetlejuice. say his name three times and enjoy the ride!"
  },
  {
    "rating": "5/5",
    "review": "I'm a HUGE fan of Beetlejuice 1 and I was worried that Beetlejuice Beetlejuice 2 would be bad. I think this film is very close to the first one. I like the idea of the new characters, from what I've seen from the reviews people don't like it. I love Tim Burton, his films are so different and unique. You see he's not doing this for a money pass. Well ok, 36 years for a sequel is obviously a very long time but at least personally it's worth it!"
  },
  {
    "rating": "1/5",
    "review": "The story was very lame. It definitely did not live up to the original."
  },
  {
    "rating": "4/5",
    "review": "It was good. Love the cast for this movie Catherine OHara always delivers!!!"
  },
  {
    "rating": "4.5/5",
    "review": "A funny and witty horror comedy, full of wild and good humor, but sometimes it was felt that some scenes in the film were not well connected or not related to the plot, like the end for example. But in general, a movie that is recommended to watch."
  },
  {
    "rating": "4.5/5",
    "review": "Love Micheal Keaton he is AMAZING. Movie was fun with some good laughs and a lot of innuendo to the original movie which was so fun to see."
  },
  {
    "rating": "3/5",
    "review": "I have no idea what I just watched. 6.5/10"
  },
  {
    "rating": "1/5",
    "review": "My word! Where to start? I saw the first iteration of this franchise and enjoyed it. Burton did a characteristically imaginative and zany job. BUT - not this time. I stayed for 40 minutes in the theatre before leaving. This iteration was repetitive, didn't have any story direction and seemed to just tread water. I was bored and left. Weak opening storyline, dull script and heavily reliant on visuals which were just not enough to keep the project afloat."
  },
  {
    "rating": "0.5/5",
    "review": "I absolutely hate when people try to make sequels to old classics i absolutely hated it Lydias charcter is nothing like her old self her daughter does not make sense what so ever there is too much going on and yet too simple with so much stuff going on idk the only good quality about it is the actors but tbh i didnt think they did the greatest job"
  },
  {
    "rating": "4/5",
    "review": "I liked Beetlejuice. So, I thought there was no way there could be more story to this. But they did it. Beetlejuice Beetlejuice is a little long. Some of the excuses are a bit over the top. But all in all, I like that they find a way to move the story to Deetz family. I especially like how the Delia character is developed."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved it they should do another"
  },
  {
    "rating": "3/5",
    "review": "Not great. Not bad. Just painfully average and the main villain…serves no purpose?"
  },
  {
    "rating": "4.5/5",
    "review": "\"Beetlejuice Beetlejuice\" is a near-perfect sequel. At times, it's somber. It's reflective. It's hilarious as hell. I wonder if Tim Burton would do a \"Edward Scissorhands\" sequel?"
  },
  {
    "rating": "2/5",
    "review": "Boring And Stupied The Characters Were Flirting And Awful"
  },
  {
    "rating": "3/5",
    "review": "It was pretty good. There was just enough humor, but not too over the top."
  },
  {
    "rating": "5/5",
    "review": "I was apprehensive at first because I loved the first one so much, but in the end, it did NOT disappoint!"
  },
  {
    "rating": "1/5",
    "review": "Didn't see the first one, so came into this open minded. Very disappointed- not funny, not entertaining. The special effects were bad too"
  },
  {
    "rating": "2/5",
    "review": "the writers mediocrely buried the Dietz family here"
  },
  {
    "rating": "4/5",
    "review": "This remake was better then the other ones so far"
  },
  {
    "rating": "3/5",
    "review": "I found it hard to sit through the first half of the movie, too slow for me. However, the last 30-45 minutes picked up and it kept my interest. Probably won’t watch again."
  },
  {
    "rating": "3.5/5",
    "review": "Now grown, Lydia Deetz (Wynona Ryder) is estranged from her daughter, Astrid (Jenna Ortega) and hosts a supernatural talk show. When she spies a familiar but unwelcome guest in the audience, hilarity begins. This isn't the Empire Strikes Back for Beetlejuice fans but still an enjoyable return to nostalgia. Keaton still excels as the over the top ghostly villain playing second fiddle only to the visual style of Tim Burton, who still supports practical effects. It suffers from an overstuffed plot and a twist you see a mile away. But, if you're a Beetlejuice fan, you likely won't care. So, weren't the Maitlands cursed to stay in the house forever?"
  },
  {
    "rating": "4/5",
    "review": "Worth seeing but not as good as the original. Too many story lines going on. Felt frantic, but not in a fun way."
  },
  {
    "rating": "4/5",
    "review": "I honestly waited for this film for too long, loved seeing the original cast, although Jenna Ortega was the same to me as other roles, seeing Michael Keaton again as BJ was amazing. Didn’t like the musical scene tho, way too long"
  },
  {
    "rating": "4/5",
    "review": "Really like the fact that it was mostly all original cast."
  },
  {
    "rating": "4/5",
    "review": "What I loved: that the original cast (most of it) was back and the Easter eggs for the fans of the original. What I didn’t: like almost every sequel, the story wasn’t the best. Still loved it."
  },
  {
    "rating": "4.5/5",
    "review": "Pure Tim Burton madness. It was so wonderful seeing him flex his crazy imagination again. I enjoyed it so much."
  },
  {
    "rating": "2.5/5",
    "review": "The movie plot was inconsistent."
  },
  {
    "rating": "2/5",
    "review": "Meh. I appreciated the practical effects, but that's about it. Doesn't capture the essence of the original and feels too glossy. Story had a lot going on, yet was super shallow. Had a chance to be great, but too many safe and stale choices. Stick to the original!"
  },
  {
    "rating": "5/5",
    "review": "I loved the movie. I loved that the original cast came back too. I also liked seeing all the cool little easter eggs throughout the movie that referenced the first movie. I hope it comes out on dvd soon"
  },
  {
    "rating": "4.5/5",
    "review": "As good as the original I reckon. The Wedding Scene gives McArthur Park the cinematic setting it deserves... Just pure joy!"
  },
  {
    "rating": "5/5",
    "review": "Great writing! Especially given that several of the key actors in the original are not in this one. The use of musical theme was done brilliantly. Dare I say that it was better than the original?"
  },
  {
    "rating": "4/5",
    "review": "It was a really fun time, I was scared for a sequel, because there have been some awful ones, but this stuck to the Beetlejuice nature. Claymation, jokes and our favorite a musical number. Really fun ride!"
  },
  {
    "rating": "4/5",
    "review": "I enjoyed the connection of the father, daughter and mother,"
  },
  {
    "rating": "2/5",
    "review": "Poor remake of a bad first movie. Didn’t care for it either time it was released. Don’t waste your time or money."
  },
  {
    "rating": "5/5",
    "review": "Death worming fantasy."
  },
  {
    "rating": "5/5",
    "review": "This movie was full of nostalgia and was amazingly written. I appreciated that they used the original cast and cleared up some questions from the first movie. I was truly impressed!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Good family fun, watched it with the kids and we all enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "I would rate the original a \"5\". And, though there was so much good stuff here, this was going into \"3\" territory. It was just trying to hard as opposed to being brilliant. Then, just the first notes of \"MacArthur Park\" took it nack up to a \"4\". Inspired!"
  },
  {
    "rating": "5/5",
    "review": "they did a great job with this. it was well written"
  },
  {
    "rating": "0.5/5",
    "review": "This movie sucks and looks like ahit and shitty actors"
  },
  {
    "rating": "5/5",
    "review": "Super fun and funny, Highly recommended"
  },
  {
    "rating": "5/5",
    "review": "Great movie for adults and kids to watch together! My 11 yr old and I really enjoyed it. I’m a huge fan of the first movie and now my daughter is a huge fan of the second!"
  },
  {
    "rating": "2/5",
    "review": "Simple and just borrowed from the original. Lots of weak filler material. Underlying plot seemed like it could have worked"
  },
  {
    "rating": "3.5/5",
    "review": "Several elements of the movie worked - and others were underdeveloped and didn't connect. Could have used more Corpse Bride, Jenna Ortega's love interest, and something different with Winona Ryder. Could have used less Soul Train."
  },
  {
    "rating": "4/5",
    "review": "Keaton’s return as Beetlejuice is undeniably energetic, with his manic energy elevating the film's more chaotic moments. His chemistry with Ryder's Lydia, now a grown goth queen, remains an endearing feature of the film. However, some of the new characters, like Monica Bellucci’s Delores, lack depth despite their visually striking introductions The film thrives when it embraces its dark, quirky charm, with Burton incorporating old-fashioned effects and puppetry that stand out against the modern CGI-driven spectacle. Though some of the film’s gory sequences (including a dismembered ghost) might border on absurdity, they contribute to the film’s delightfully twisted aesthetic. However, the script at times gets tangled in its new additions, with certain plot threads underdeveloped. Overall, Beetlejuice Beetlejuice is a fun, if messy, sequel that captures some of the original’s charm while adding a contemporary, albeit complicated, twist to the afterlife mischief. If you're a fan of Burton's distinctive style and Keaton's chaotic performance, it’s definitely worth the watch."
  },
  {
    "rating": "4.5/5",
    "review": "Loved this movie from the start, it was long awaited and hilarious hijinks happened around almost ever turn."
  },
  {
    "rating": "5/5",
    "review": "I thought this beetlejuice was better than the original. My friend and I laughed a lot throughout the movie."
  },
  {
    "rating": "5/5",
    "review": "We absolutely loved this movie!"
  },
  {
    "rating": "3/5",
    "review": "Cute for Halloween but wouldn’t watch again"
  },
  {
    "rating": "1/5",
    "review": "This film was a disappointment. The storyline was unappealing. Michael Keaton waited a considerable amount of time just to participate in this project. The absence of Geena Davis and Alec Baldwin (Barbra and Adam) significantly diminished the film’s impact. While it is understandable that the actors have aged, it would have been more believable if they had portrayed their characters as having aged alongside Lydia until her passing. Nevertheless, the film lacked the necessary maturity and execution to be successful. Felt as a kids movie as well."
  },
  {
    "rating": "4/5",
    "review": "A little slow, but we were remarkably surprised about the storyline. it was much better than we thought it would be. excellent job by all!"
  },
  {
    "rating": "4.5/5",
    "review": "If you liked the first Beattlejuice, you'll like this sequel. There are a number of returning actors/characters as well as new."
  },
  {
    "rating": "3/5",
    "review": "how they have the signature song tho"
  },
  {
    "rating": "0.5/5",
    "review": "Soulless, drab, and boring."
  },
  {
    "rating": "5/5",
    "review": "I’m obsessed with this movie …can watch over and over!"
  },
  {
    "rating": "5/5",
    "review": "Funniest movie ever with several different plots!"
  },
  {
    "rating": "3/5",
    "review": "It was just ok, I like the original better!"
  },
  {
    "rating": "4/5",
    "review": "A hot, overstuffed mess that made me laugh a lot."
  },
  {
    "rating": "5/5",
    "review": "Honestly loved it. At times, it may have felt a little rushed to get through the story, but I really enjoyed it."
  },
  {
    "rating": "2/5",
    "review": "It felt like a bad fever dream"
  },
  {
    "rating": "5/5",
    "review": "Big fan of the original movie and this was an enjoyable sequel with a few surprises."
  },
  {
    "rating": "4.5/5",
    "review": "Usually sequels aren’t the best but this one definitely was amazing! Only thing negative i can say is there were too many villains it was kinda all over the place. Over all great movie thoroughly enjoyed."
  },
  {
    "rating": "5/5",
    "review": "Love it would see it again and again"
  },
  {
    "rating": "4/5",
    "review": "After more than 30 yrs he is back & damn this was insane and fun which what I wanted it to be the juice is loose babe and he can't be tamed I just hope the 3rd one doesn't take 2 long it makes wonder if tim will make another batman that would be nice."
  },
  {
    "rating": "3/5",
    "review": "I haven’t seen the first film (yet) so I went to the theatre completely open to anything and without expections. I can tell you that I’ve had a great time, I enjoyed it and laughed more than I thought I would. It’s definitely a good memory."
  },
  {
    "rating": "3.5/5",
    "review": "oohhh Beetlejuice! A classic brought back to life with the original cast was such a great idea. The plots... characters...it all felt rushed. The new characters were not developed enough and there was so much opportunity to do so. With that said....there should be a 3rd."
  },
  {
    "rating": "4/5",
    "review": "Silly movie. Michael Keaton did a wonderful job. Some really funny parts!The plot is a bit hard to follow at first, but the cast is great, and so are the effects . People nostalgic for the first movie will love this one."
  },
  {
    "rating": "1.5/5",
    "review": "Michael Keaton just does not approach the character Beetlejuice with half the enthusiasm he did in the first movie and apparently it's just not well directed I can't understand it it could have been such a major hit"
  },
  {
    "rating": "3/5",
    "review": "Beetlejuice Beetlejuice justifies its creation by being a surprisingly well-crafted sequel that matches the original's visuals and humor. The cast returns to develop their characters and move their stories forward, and newcomer Jenna Ortega fits right in. Michael Keaton reprises his role as the titular Beetlejuice and pours the same level of crazy into his role. I only wish the filmmakers had come up with a better ending than the weird resolution in the church. It wrapped up the story weekly with the worm, followed by that offputting dream sequence."
  },
  {
    "rating": "5/5",
    "review": "It's Tim Burton! Must I say more?"
  },
  {
    "rating": "2.5/5",
    "review": "It was cute, but didn’t hold a candle to the original. The best parts were with Keaton who is still a fantastic Beetlejuice."
  },
  {
    "rating": "5/5",
    "review": "Not as good as the first movie, but a good sequel none the less. Looking forward to a hopefully 3rd movie."
  },
  {
    "rating": "5/5",
    "review": "I like the movie and was really hilarious."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie not great. The original was certainly better. I expected better but it was an enjoyable watch."
  },
  {
    "rating": "5/5",
    "review": "Good! Not as good as the original but still fun to watch."
  },
  {
    "rating": "2.5/5",
    "review": "Some b grade acting, horrible storyline flow and an infinite amount of scenes that could be cut in half. But it has old beetlejuice charm that provides relief and makes the film like an honest artwork by Tim Burton. Meh."
  },
  {
    "rating": "5/5",
    "review": "I LOVED IT AND JENNA ORTEGA. SHE IS SO SLAY"
  },
  {
    "rating": "2/5",
    "review": "I know the people are older but the guy who plays Beetlejuice just seemed off compared to how he played it in the first one. Maybe it was the excitement of his voice or how fast he spoke in the first one versus this one. Something was off to me at least."
  },
  {
    "rating": "4/5",
    "review": "Very fun film. I like all the actors, especially Danny Devito and Willem Dafoe. It was a bit short though."
  },
  {
    "rating": "1/5",
    "review": "Not impressed, super strange, no comparison to the original"
  },
  {
    "rating": "2/5",
    "review": "Horrible, the storyline and characters. The whole movie, from beginning to end, felt like a jigsaw puzzle that was cut poorly and had missing pieces."
  },
  {
    "rating": "4/5",
    "review": "It was visually amazing typical Tim Burton. The story took awhile to really get started but once it did it was very good."
  },
  {
    "rating": "1/5",
    "review": "The tone was completely off! Not reminiscent of the original movie at ALL. Dreadfully slow pace, no charm, dazzle, or zippiness of the first movie. So disappointed!"
  },
  {
    "rating": "5/5",
    "review": "just great funny humor"
  },
  {
    "rating": "0.5/5",
    "review": "It was alright all things considered. I’m giving it the lowest score due to the climate change BS force fed to the audience. Makes no sense for the characters at all and it’s just not believable. Takes you out of the immersion and reminds you a group of out of touch Hollywood weirdos made this. Bad writing plain and simple. Normal people living outside of Commie-Fornia don’t talk or act like that."
  },
  {
    "rating": "1.5/5",
    "review": "Too far fetched, special effects were good but the storyline could have been better."
  },
  {
    "rating": "4/5",
    "review": "I actually liked it! I generally don't like most movies made in the last twenty years, especially the Star Wars sequels, but I hoped for the best and this was pretty good. Keaton is still great. The cast is all good and it's well directed with a few great moments. I love Willem Dafoe in this."
  },
  {
    "rating": "5/5",
    "review": "Fun update and plot twists."
  },
  {
    "rating": "3.5/5",
    "review": "Not the pile of trash people want to make it out to be but also not ground breaking amazing like the other half will say. It was a good time watching, funny and more adult but it also was just not like that jaw dropping must see the overly hyped fans are about it. Worth seeing for the nostalgia side of things, good revamp of an old classic but nothing overly special."
  },
  {
    "rating": "5/5",
    "review": "The jokes were on point.100000/10 I would definitely recommend this to any family member of my classmates- Quamaine Jones- 7th Grade"
  },
  {
    "rating": "4/5",
    "review": "Fun sequel, enjoyed seeing the old cast back!"
  },
  {
    "rating": "5/5",
    "review": "This movie is better"
  },
  {
    "rating": "3/5",
    "review": "Beetlejuice Beetlejuice is among the better half of legacy sequels. It's entertaining, just like the original, though admittedly less compelling. The film is packed with too much stuff, and that’s its main problem. There are too many storylines and characters, and some plot points either seem forgotten or quickly brushed aside. For the most part, the film succeeds in delivering a fun and engaging experience. It genuinely captures the essence of a Beetlejuice sequel, with Michael Keaton at his best. In fact, the entire main cast is excellent, especially the returning actors from the original. Jenna Ortega is also pretty great as a new addition to the cast. However, some characters feel unnecessary — for instance, Beetlejuice's ex-wife, who didn't end up having much of a role and is at times forgotten. Also Willem Dafoe’s brilliant talent deserves more screen time! Still, the movie is fun. While it doesn’t break new ground, the film is bigger and flashier than its predecessor, and it tries a lot, succeeding in certain aspects. Overall, it works well and is visually stunning and atmospheric, even if the story falters at times. Ultimately, Burton's sequel is a film worth watching and a solid addition to the Beetlejuice legacy."
  },
  {
    "rating": "4/5",
    "review": "Keaton kills it once again as Beetlejuice as the 30+ year wait has ended!!"
  },
  {
    "rating": "0.5/5",
    "review": "Genuinely the worst movie I’ve ever seen. It’s borderline impressive that production convinced someone to sign a check to make this hot pile of trash! If I wasn’t with friends I would have walked out."
  },
  {
    "rating": "2/5",
    "review": "It was slow to start and never really caught my attention."
  },
  {
    "rating": "4.5/5",
    "review": "As a person that is not a fan of “scary” movies, this is a hilarious and well-made adaptation to the first movie. Justin Theroux for some reason is the funniest part. It was great seeing the new cast and Jenna Ortega does amazing, as expected. My only con (spoiler) is that the ending is the same as the last movie. Also I expected more to be done with Monica Bellucci’s character considering her powers, I thought maybe it’d go in a different direction. But her performance was great also. I’m happy with how the movie turned out."
  },
  {
    "rating": "5/5",
    "review": "An excellent movie with clever nods to the original! If you enjoyed the original Beetlejuice then chances are you’ll love this one too. It has an interesting story that stands on its own and makes for a fun watch in theaters. I would highly recommend it!"
  },
  {
    "rating": "5/5",
    "review": "Loved it! Went to see it with the family and it brought me back. Strong cast all round highly recommended for fun!"
  },
  {
    "rating": "2/5",
    "review": "Too many story lines, too much reliance on effects. Less compelling than first one. Dialogue lesser level than original. Bit disappointed to tell the truth."
  },
  {
    "rating": "0.5/5",
    "review": "This was objectively the worst movie I have ever had the misfortune of seeing. I could have smeared a diaper across the page and had something better come out."
  },
  {
    "rating": "3.5/5",
    "review": "Most of it was good but got a little silly at times towards the end, like writers ran out of material and Beettlejuice ex wife didnt play as big a role at the end as I thought she shouldve IMO"
  },
  {
    "rating": "5/5",
    "review": "Great story for this reboot! Returning actors and new actors made it what it should be!"
  },
  {
    "rating": "4/5",
    "review": "Once again, Tim Burton proves himself to be a visionary and an excellent storyteller. Despite the time that has passed since the first installment, this sequel is just as good and retains the essence of the 1980s version."
  },
  {
    "rating": "3/5",
    "review": "Apesar da falta de profundidade e desenvolvimento na trama, Beetlejuice Beetlejuice é uma mistura do esquisito e fastástico que funciona bem. O estilo visual marcante de Tim Burton faz do filme uma viagem nostálgica que traz de volta o caos e humor do primeiro filme."
  },
  {
    "rating": "3/5",
    "review": "bad seats, was in the middle of two families and there seats was double booked"
  },
  {
    "rating": "1/5",
    "review": "Style over substance. There was no one to care about. Such a disablement, usually I love his work. Well acted . Bad script."
  },
  {
    "rating": "0.5/5",
    "review": "Literally one of the stupidest movies I’ve ever seen in my life. A 100% disappointment."
  },
  {
    "rating": "1.5/5",
    "review": "A misfire on every level and in every possible way. A nonsensical and disjointed storyline that had almost nothing to do with the original. The performances by Michael Keaton and Catherine O’Hara were strong, but not strong enough to overcome terrible script and a serious case of ADHD directing. This movie had so much possibility, and Tim Burton just flushed it all down the drain."
  },
  {
    "rating": "5/5",
    "review": "As great as the first movie. Fun! Can't beat Tim Burton!"
  },
  {
    "rating": "5/5",
    "review": "It's a cracker. I went to watch it with my 12 year old who loved it too. I was a fan of the original, but haven't watched it for many years. This was great, loads of fun, a bit spooky, weird, with a few good twists and an amazing cast too. I'm really glad I finally went as I'd heard a few \"it's just ok\" from die hard fans of the original. It's better than ok, but is it better than the original? Who cares? There's no need to dwell in the past, just enjoy it for what it is. A bit mad!"
  },
  {
    "rating": "2.5/5",
    "review": "Люблю первый фильм, а вот продолжение не очень. Рад был видеть Монику Беллучи, но такое ощущение, что она тут только ради эффектной сборки своего тела. Далее она будет тупо бродить весь фильм – так слить персонажа, просто кошмар. Мне также не верится, что персонаж Вайноны Райдер мог стал плохой матерью и настолько бесхребетной – все таки в первой части она была самой адекватной и росла как персонаж над собой. В этом фильме она будто впала в кому на 30 лет. Вообще такое ощущение, что фильм сняли ради Ортеги и ее звездного часа."
  },
  {
    "rating": "3/5",
    "review": "It was just ok. the returning characters were fine but the story line was a little dumb and not nearly as good as the first. I thought the wedding song was a poor choice and not catchy or enjoyable and long. Other parts just weren't written well. They should have got a different writer. Not worth seeing in theaters, better to watch free when it streams."
  },
  {
    "rating": "5/5",
    "review": "An over the top homage to the original, this quirky thrill ride serves up all the cheese of the original, in HD."
  },
  {
    "rating": "1.5/5",
    "review": "i dont get why people glazing this movie,this movie is a joke but no one is laughing"
  },
  {
    "rating": "3/5",
    "review": "Campy and disjointed plot lines. Also st times was clever and truly funny. Other times, just not funny."
  },
  {
    "rating": "1/5",
    "review": "Another film with A list actors and a mediocre plot that is so predictable you would think that an AI bot wrote it."
  },
  {
    "rating": "1/5",
    "review": "I cannot recall the last time I have seen such a terrible movie and waste of money. This is complete garabage and it seems like they did not know what to come up with and just made up junk along the way as they were producing this horrible movie. DO NOT waste your money, pure trash."
  },
  {
    "rating": "0.5/5",
    "review": "I disliked everything. It was terrible and an absolute waste of money."
  },
  {
    "rating": "0.5/5",
    "review": "Consumerist garbage without any of the magic of the first one. Feels completely thrown together to sell Halloween costumes and other merchandise"
  },
  {
    "rating": "3/5",
    "review": "It felt like two to three storyline that weren't hashed out and never completed. There were laughs and good casting but that was about it."
  },
  {
    "rating": "2/5",
    "review": "I had high hopes for this movie after friends at work raved about it, The movie is well done in classic Tim Burton fashion which was a pleasant nostalgic feeling. The acting was great as to be expected from the big names like Winona Ryder, Michael Keaton, Jenna Ortega and Catherin O'Hara. But the movie just seemed rushed with too many plot points. It was just too much! And with so much going on in the movie, it lacked substance. William Dafoe's and Monica Bellucci's characters were not needed in the movie. The just cluttered the movie and wasted time. If they were taken out, then maybe the movie would have time to develop a plot. Overall, just disappointing."
  },
  {
    "rating": "2.5/5",
    "review": "Me being a fan of the first one I wasn’t a fan of this one the first movie was a classic this one fell short I was thinking maybe because I’m older now that’s why I probably couldn’t get in to it but then I thought to my self again no that’s not it because I still enjoy watching the first movie so yeah this is 2.5/5 for me and they hype the villain up to be deadly only to be a disappointment at the end"
  },
  {
    "rating": "5/5",
    "review": "Tim Burton doesn't waiver on aesthetic. Excellent cast."
  },
  {
    "rating": "5/5",
    "review": "Far exceeded my expectations! Great acting and well written!"
  },
  {
    "rating": "5/5",
    "review": "Stayed true to the original story line. Was a very fun & funny watch!"
  },
  {
    "rating": "5/5",
    "review": "It was the best all 4 of us enjoyed it and were hoping there's a 3rd one thank you"
  },
  {
    "rating": "0.5/5",
    "review": "I didn't like it at all. We walked out 1/2 way through the movie."
  },
  {
    "rating": "3/5",
    "review": "The first one was better."
  },
  {
    "rating": "5/5",
    "review": "Great sequel! Equally as good as the original."
  },
  {
    "rating": "2/5",
    "review": "I LOVE the original. This is not even close. It seems “phoned in” by Burton. Nothing really original. It has some moments but the entirety of it, isn’t cutting it."
  },
  {
    "rating": "4/5",
    "review": "As far as sequels for original movies made 30+ years ago, this did really well. The characters were well written, the storyline updates for original characters were respected, and the ghost still has the most! This sequel did a great job of making a coherent story with good character development. The biggest issue, however, would be the main villain. The villain added a threat, but was treated as a background character for the entire movie. Ignoring that, I'd definitely recommend this to be a part of your Halloween watch list. Take notes, Hocus Pocus 2."
  },
  {
    "rating": "3/5",
    "review": "A fun movie, using a similar formula to the first. I enjoyed Winona Ryder's character Lydia the most--she convincingly portrayed a mom frustrated by her inability to connect with her daughter. Michael Keaton is timeless it seems, but I would have liked a few surprise gags that seemed more prevalent in the first movie. Delores was a great antagonist whose storyline could have been stronger. Again, Beetlejuice Beetlejuice was an enjoyable film."
  },
  {
    "rating": "5/5",
    "review": "After waiting for so long on a sequel - this one did not disappoint. A great movie with twists I wasn’t expecting. Michael Keaton doesn’t skip a beat as Beetlejuice - his performance is top notch. Winona Ryder as Lydia Deetz was just as entertaining as she was back in the first film. Adding Jenna Ortega as Astrid was a perfect touch. Would see this movie over and over again."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is Burton back at his peak. The general atmosphere and weirdness of the plot are backed up amazingly by the actors. One of Burton's best movies yet."
  },
  {
    "rating": "0.5/5",
    "review": "Boring boring boring.... Literally 55 minutes into the film and nothing exciting happens... Plot (if there is such a thing in this film) is boring, by the end of the movie you realize that without Monica Belluci (Beetlejuice's ex wife) you still have the same film. Delia is overacted in this film, Lydia and Beetlejuice are just as solid as the first movie, as for Ortega I'm sorry I just don't get the fascination with this girl.. like watching an even more dull Christina Ricci. Nothing really finished with a bang, the song choice at the end was pathetic didn't punch no way near as Jump in the line and the banana boat song from the first movie. Dafoe's character just isn't needed his pursuit of Beetlejuice and his ex wife never pays off and just felt like a time filler. Lydias fiance is as entertaining as poking my eye with rusty nail so entertaining that I haven't even bothered to learn his name Some things are just left buried and Beetlejuice 1 is one of those things."
  },
  {
    "rating": "5/5",
    "review": "Original characters was great, plot was original, honestly one of the best sequels I've ever enjoyed"
  },
  {
    "rating": "5/5",
    "review": "Wow. Having seen the original in the theater so long ago, I didn't have high expectations. This is one of those times where the sequel was truly awesome! Every performance was fabulous. So entertaining! Loved the mix of old and new characters. A new favorite for me!"
  },
  {
    "rating": "3/5",
    "review": "It was good very entertaining"
  },
  {
    "rating": "5/5",
    "review": "Excellent remake. I just wish they would have made it 15 years ago."
  },
  {
    "rating": "4/5",
    "review": "Better than I thought it was going to be!"
  },
  {
    "rating": "2/5",
    "review": "Worth watching but only just. Don't expect the quality of the original but do expect some nostalgia. The film has had its day and is an absolute classic that should have been left that way but when there's money to be made then why not? Watch it if only out of courtesy. Don't think I'd watch any more of them if they make more."
  },
  {
    "rating": "5/5",
    "review": "Everything. the plot twist. first movie references"
  },
  {
    "rating": "2.5/5",
    "review": "a lot of plot lines lead no where, ending was beautiful, but drawn out. Acting was phenomenal, the fiance did a great job of making me hate him the entire movie."
  },
  {
    "rating": "2/5",
    "review": "I almost hate to post a review because I generally like Michael Keaton's acting, but I have to say, this just felt like Keaton was tired. It was like Beetlejuice on Xanax. Like watching fat people run marathons, it almost gives you anxiety just waiting for it to stop. If he didn't want to do it again he shoulda just said no."
  },
  {
    "rating": "5/5",
    "review": "It was truly entertaining"
  },
  {
    "rating": "2.5/5",
    "review": "It was a good sequel but the first one is always a classic."
  },
  {
    "rating": "3/5",
    "review": "Poor editing. First appearance of Beetlejuice should have been the therapy session. Back story should have come afterwards."
  },
  {
    "rating": "5/5",
    "review": "It's what I expected. Good little time waster."
  },
  {
    "rating": "5/5",
    "review": "Better than the first one."
  },
  {
    "rating": "4/5",
    "review": "This movie was exactly what I expected! It was funny and I enjoyed seeing both the old and new characters! I wasn't super impressed with Rory or Delores' characters, that part was kind of meh. I also wish Jeremy wasn't a bad guy. However, Astrid and Lydia were great together! it was such a fun movie and it made me laugh and feel nostalgic."
  },
  {
    "rating": "3.5/5",
    "review": "I liked how it paid homage to the first one, but it needed its own spin."
  },
  {
    "rating": "2.5/5",
    "review": "Not nearly in the same brilliance as the original Beetlejuice, this is too slick (the digital filming removes a lot of the uniqueness) and scatterbrained to work fully. Monica Bellucci's character is almost entirely superfluous although makes for a great sight gag. Her story just seems tacked on for no reason. Unlike the original, which had a main villain (Beetlejuice) to focus on, this one seems to try and turn Beetlejuice into a tortured hero. The cast is still fantastic (although Justin Theroux's character is almost entirely pointless), the music is great, the use of visual effects is great. But overall, it doesn't leave the same lasting impact that the original did. It feels like the screenplay was trying to do too much to give fan service."
  },
  {
    "rating": "4.5/5",
    "review": "Fun entertainment. Loved all the all star actors."
  },
  {
    "rating": "3.5/5",
    "review": "It was cute and the effects were good, but it wasn't really that engaging."
  },
  {
    "rating": "1/5",
    "review": "I love the original but the sequel didn't have the same charm. Michael Keaton is still great as BJ. The plot was dumb with lazy writing. Beetlejuice deserved a better story than this."
  },
  {
    "rating": "3.5/5",
    "review": "Nostalgic & funny. Super surprised"
  },
  {
    "rating": "3/5",
    "review": "As excited I was for this movie, I feel it does not wholly capture the originals charm. This however doesn't mean it was a \"bad\" movie. I simply have a few major problems with characters such as Beetlejuices Ex who was seemingly set up to be a major antagonist towards beetleJuice, but I was ultimately disappointed for her to simply end by being killed by a sand worm. A more major problem I had was with the B plot of Astrid and Jeremy. Once again, there was potential for a better antagonist. But the character of Jeremy felt very rushed and simply fell flat just like BeetleJuices Ex wife. Besides these 2 flaws, this movie was very enjoyable and certainly has that Tim Burton charm we all know and love. I simply hope it doesn't take another 30 years for a sequel."
  }
]