{
  "movie_name": "Conclave",
  "reviews": [
    {
      "rating": "4.5/5",
      "review": "An understanding (and fictional) look into the succession process of leadership in the Catholic Church, powerfully led by Ralph Fiennes. As far as the competitive suspense is portrayed, as my wife put it, it’s a Catholic “Mean Girls”!"
    },
    {
      "rating": "0.5/5",
      "review": "Beautifully shot film with excellent acting, but just why? Why the unnecessary “twist” that made no sense. Hollywood just can’t help themselves."
    },
    {
      "rating": "3.5/5",
      "review": "Good acting, nice cinematography and great set peices."
    },
    {
      "rating": "2/5",
      "review": "Staying awake during the movie was very difficult. And being Catholic this was also offensive."
    },
    {
      "rating": "5/5",
      "review": "Tense, thrilling and beautiful!"
    },
    {
      "rating": "0.5/5",
      "review": "The film distorts reality from beginning to end, with a negative and sordid view of the Catholic Church institution; which has problems but has played a fantastic role for over 2000 years. Don't waste your time"
    },
    {
      "rating": "4/5",
      "review": "A well thought out religious story. Since we don't know what the conclave looks like in real life, this movie gives up a visual understanding of how the Pope is chosen. Overall, 8.5/10. If there was a way, to use decimals in this website, I would."
    },
    {
      "rating": "4/5",
      "review": "Very interesting process and pretty similar to how the real conclave works. The problems add a nice twist to the story and how it affects the cardinals in the Sistine Chapel."
    },
    {
      "rating": "2/5",
      "review": "The characters are hard to follow especially since they are all in uniform. The plot really doesn't have that much going for it, unless you are a die-hard roman catholic, which I am not The big reveal at the end is far from shocking and while it is trying to poke a judgement stick at the standards of organized religion like the Catholic Church, it just doesn't do it for me."
    },
    {
      "rating": "5/5",
      "review": "Star studded and very well acted. Interesting historical content with a few surprise twists."
    },
    {
      "rating": "4.5/5",
      "review": "Conclave is a taut, elegantly crafted thriller that blends faith, politics, and suspense within the hallowed halls of the Vatican. Ralph Fiennes delivers a commanding performance in a film as thoughtful as it is gripping."
    },
    {
      "rating": "5/5",
      "review": "Loved every bit of it. Cinematography is breathetaking. Ralph Fiennes is a powerhouse of acting,Conclave is one of his best ever performance."
    },
    {
      "rating": "3.5/5",
      "review": "Enjoyed the general plot and the manoeuvring of different groups to be elected pope. However the twist at the end lost me as it introduced a separate plot which I believe if they wanted to bring in they should have explored more, especially the repercussions of it all. Not sure whether the book the film is based on does this better."
    },
    {
      "rating": "3.5/5",
      "review": "Slow start, but eventually holds your interest"
    },
    {
      "rating": "0.5/5",
      "review": "Within 10 minutes I walked out. The way ring was forcefully taken out of Pope's hand, the way he was placed on the strecher with a forceful thud, the way people were shown smoking and all the forceful nonsense stuff shown. Okay there must have been bad pope too and a lot of politics in church too but in the movie you are showing how to treat a dead man with utmost rudeness. Is this called a movie? Just like Paris ceremony this movie in my eyes is a mockery. Nowadays everything is made a mockery. I thought it would be a nice movie of modern times but UTTER DISGRACE AGAIN. I am gonna go back to watching old movies now."
    },
    {
      "rating": "5/5",
      "review": "Great casting and superb drama."
    },
    {
      "rating": "1/5",
      "review": "While the cinematography is good and it has some good acting, all is ultimately brought down by the movie's on-the-nose \"messaging\" and the abysmal and totally unnecessary surprise ending. If you want to see nice shots of the Vatican you are better off watching a documentary on the Vatican rather than this slop."
    },
    {
      "rating": "3.5/5",
      "review": "Not gonna lie, I had a good time but don't really know what to do with this experience. Some scenes really had me thinking (the rant of Tedesco about \"Them\" in particular), but I don't see great rewatchability value in the movie. Ralph was impeccable tho, as always"
    },
    {
      "rating": "5/5",
      "review": "A very brilliant movie which manages to keep you engrossed throughout every minute. The stellar performances makes it very difficult to wholly dislike even the worst characters (does the fact that they're all supposedly holy men help in this regard?) The movie drops many crumbs early on which makes it clear that *something* will happen with x and y, but each one is paid off in very rewarding ways that would be difficult to expect. Cardinal Lawrence, played by Ralph Fiennes, gives what at times seems like an exceedingly amazing performance--it feels like scenes were added just to flex his amazing skills, despite not necessarily adding much to the character or story. I watched this without subtitles, which, with all the language switching that happens with certain characters, makes it somewhat difficult to follow at times. But the acting and delivery and structure of the scenes makes it clear to the watcher at least vaguely what's happening, even if the dialogue is unintelligible. The twist at the end, despite technically being set up, does feel like it came somewhat out of no where, but is rewarded anyways by an excellent performance by [spoiler]. It's a quiet yet thrilling political drama set in a restricted setting, and each action feels just as consequential as the last."
    },
    {
      "rating": "3/5",
      "review": "Nice to know How they elect The Pope, but the ending was too naive."
    },
    {
      "rating": "5/5",
      "review": "A movie you have to pay great attention to. People leaving one star reviews have looked at it too shallowly, in my opinion. It’s a very interesting movie and beautifully shot. The ending may feel rushed but is perfectly symbolic and the message behind it is beautiful."
    },
    {
      "rating": "0.5/5",
      "review": "So the newly elected Pope is a liar? What a sham!"
    },
    {
      "rating": "3.5/5",
      "review": "it hit the mark of the storytelling but dull overall. Too many complications"
    },
    {
      "rating": "5/5",
      "review": "Having heard about Conclave since the announcement of the 2025 Oscar nominees, I must admit that I only got around to watching it after Pope Francis' death. And by the time the film was over, I could understand all the praise I had heard about it. The direction and photography are brilliant; the soundtrack is remarkable; and the cast is incredible, with Ralph Fiennes being a standout. Having watched it after Pope Francis' death and, therefore, before the conclave to elect the new Pope, this film touched me deeply. I simply loved the personalities of each cardinal, and the internal disputes between them: far from being gods, they are normal people, with dilemmas, fears and flaws. The settings are also another highlight, contributing entirely to the immersion in the story. A simple, yet brilliant film."
    },
    {
      "rating": "5/5",
      "review": "A pope that's as successful as the first American-born pope!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "2/5",
      "review": "It's really hard to totally hate this movie; the acting is excellent, there are lovely views of the Vatican (I assume), and the setup is interesting. But where is the suspense that others talk about? It's slow through most of it, and the plot twists are these improbable things (not the they are, mostly, improbable per se but to have them all come out like this at the last minute?), and then on to the even more improbable thing. My ability to suspend disbelief just does not go this far. (Also, there was NO other suitable candidate in all of those cardinals? Everyone is just going to vote for this newcomer?) Really a waste of a lot of fine actors."
    },
    {
      "rating": "0.5/5",
      "review": "So much potential, but the last 15 minutes are a complete waste. Disappointing."
    },
    {
      "rating": "3/5",
      "review": "This movie was good enough to watch some parts of the movie were confusing, It was confusing because there some twisting moments about the end of movie that they found a new pope and other cardinals did not accept it. The movie was not bad at all but the dialogue were deep."
    },
    {
      "rating": "4.5/5",
      "review": "(CASTELLANO) No me esperaba disfrutar tanto Conclave, y al final me ha parecido una de las películas más sólidas del año. Con un guion bien trenzado, un reparto en estado de gracia y una dirección elegante pero efectiva, la historia atrapa desde los primeros minutos y se va construyendo poco a poco, sin prisas, pero con firmeza. Que esté basada en una novela de Robert Harris, autor que sigo desde Patria, se nota: hay profundidad, tensión y giros bien dosificados. Ralph Fiennes está excelente. Su interpretación del camarlengo Thomas Lawrence tiene la medida justa entre contención y emoción. Se mueve entre el deber y la duda con una naturalidad que da peso a cada escena, y sostiene el relato con una sobriedad que no cae nunca en la exageración. Y a su alrededor, todo funciona. Desde el diseño de producción hasta la música, pasando por un grupo de actores secundarios perfectamente escogidos, la película desprende clase. Lo mejor es cómo el suspense no se sacrifica en favor de lo solemne. Berger consigue que la intriga avance como una partida de ajedrez en la que cada movimiento importa, sin perder de vista el contexto espiritual y político del Vaticano. El resultado es un thriller sofisticado y absorbente que, sin necesidad de aspavientos, te mantiene pegado a la pantalla. Un 9 bien merecido. (ENGLISH) I didn’t expect to enjoy Conclave this much, and in the end, it turned out to be one of the most solid films of the year. With a tightly woven script, a cast in top form, and a direction that’s elegant yet effective, the story pulls you in from the first minutes and builds slowly but confidently. The fact that it’s based on a novel by Robert Harris—an author I’ve followed since Fatherland—shows in the depth, tension, and well-timed twists. Ralph Fiennes is excellent. His portrayal of Cardinal Thomas Lawrence hits the perfect balance between restraint and emotion. He moves between duty and doubt with a naturalness that gives every scene weight, and he holds the film together with a calm presence that never slips into overacting. Around him, everything works: from the production design to the music, and a cast of perfectly chosen supporting actors, the film oozes quality. The best part is how it manages to deliver suspense without losing its solemn tone. Berger turns the intrigue into a chess match where every move matters, while never forgetting the spiritual and political context of the Vatican. The result is a sophisticated, absorbing thriller that keeps you hooked without needing to shout. A well-earned 9."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie, so interesting."
    },
    {
      "rating": "0.5/5",
      "review": "Hollywood strikes again. It cannot help itself except to spit into the face of a victim it knows will not hit back. The movie is beautiful, the acting is excellent but the so-called \"twist\" is everything that has destroyed Hollywood in the eyes of the general public and why movie after movie flops."
    },
    {
      "rating": "1/5",
      "review": "This could have been decent if not a good movie if not for the ridiculous ending. Talk about suspended reality. Politics creeps through to ruin at every opportunity."
    },
    {
      "rating": "2.5/5",
      "review": "If this is really how the real conclave is done then even the Catholic Church is doomed. Nowhere on earth is safe from corrupt politics."
    },
    {
      "rating": "4.5/5",
      "review": "Classy; Well acted. Did an authentic portrayal of what can happen in a conclave."
    },
    {
      "rating": "5/5",
      "review": "Engrossed from start to finish. It's scandalous with a dignified air. Genuinely a gem of a film. Loved the ending and never would have guessed it. Honestly such a classy film, excellent cast."
    },
    {
      "rating": "2/5",
      "review": "Too much drama. Full of unlikely scenarios. Just guessing about what we don't know,"
    },
    {
      "rating": "5/5",
      "review": "Excellent cast & BRILLANT ENDING"
    },
    {
      "rating": "4/5",
      "review": "I wouldn’t have expected a film about the conclave to be so thrilling. But this was well performed, well executed and ultimately gripping."
    },
    {
      "rating": "4/5",
      "review": "Great movie until the last few minutes. Then silly."
    },
    {
      "rating": "2/5",
      "review": "With all the sex scandals going on in the catholic church is it any wonder that the producers of this \"movie\" chose an LBGTQ ending?!? Pathetic! They ruined an otherwise decent film."
    },
    {
      "rating": "4/5",
      "review": "Interesting movie with a bit of a slow pace. Excellent acting and more fun to watch when a conclave is in the news."
    },
    {
      "rating": "5/5",
      "review": "In light of the Pope's passing, I mostly watched to see how the actual Conclave works, and I was surprised at how good the acting and cinematography was in it. Parts may have been slow, but I was glued in to see all the details. I thoroughly enjoyed it. Even the surprise ending!"
    },
    {
      "rating": "4.5/5",
      "review": "Atrapante. Si te gustan los detalles a su ritmo, esta película es la indicada."
    },
    {
      "rating": "5/5",
      "review": "Como esse brilhante filme perdeu para Anora no Oscar, até hoje é um mistério para mim. Apesar de que não levo o Oscar com a devida seriedade que a mídia leva, justamente por constantemente cometer erros drásticos como esse: Conclave perder para Anora. Em minha lista pessoal, Conclave é vencedor de melhor filme e ponto. Como descrever a qualidade impecável de um filme tão detalhado como esse? Ele integra a \"lista\" de filmes, que ao terminar, posso dizer que gastei meu tempo com maestria. Filme que prende a sua atenção do início ao fim. O enredo que mistura as liturgias católicas com política, pondo em cheque o caráter dos cardeais na decisão difícil de escolher aquele que seria o Papa, ou seja, o representante maior de Deus na terra. O filme se torna ainda mais interessante pelo fato de abordar um tema sigiloso, como o Conclave, já que só quem participa da eleição, sabe realmente o que acontece lá. Excelente escolha de tema. O final, encerra a história com chave de ouro. A escolha do nome do Papa eleito, e a história de vida dele, narrada em minutos, encerra com chave de ouro todo o enredo do filme. Ninguém poderia imaginar esse filme! Eu não imaginei esse filme! Que filme! Recomendo demais!"
    },
    {
      "rating": "2.5/5",
      "review": "So much of this was good but the last third was brutal"
    },
    {
      "rating": "0.5/5",
      "review": "Repugnant insult to the Roman Catholic Church; despite the cast and the acting! Insult to Catholicism with Morally Repugnant story and ending!"
    },
    {
      "rating": "3.5/5",
      "review": "A wonderful cast and an early, brooding sense of mystery and danger gives way - ultimately - to something approaching soap opera and the final outcome (of the vote, at least) is fairly obvious after the first half hour"
    },
    {
      "rating": "4.5/5",
      "review": "Great acting, fascinating look at the process. Dramatized politics, intrigue, and a very surprising ending."
    },
    {
      "rating": "2/5",
      "review": "It had brilliant acting, and I can see how the story was meant to come across, but it ended up being fairly boring, improbable, and honestly depressing. Watch if you're interested, but if you're looking for a fun or inspiring movie this is not it."
    },
    {
      "rating": "1.5/5",
      "review": "This could not be more boring. I can't figure out these ratings. The Perfect Storm adventure gets a 47% and this dud gets ratings about 80%?? WTF"
    },
    {
      "rating": "4.5/5",
      "review": "Overall, a really great movie. Only thing keeping me from giving it 5 stars, is the political message it tries to send at the end of the film."
    },
    {
      "rating": "3/5",
      "review": "Interesting, well acted, but slow and very over-rated by RT. Think, Da Vinci Code meets The Young and Restless! 🙄🤪"
    },
    {
      "rating": "3/5",
      "review": "建筑空间与视听语言的结合让本作不至于枯燥生涩，但细究其具体内容仍是欧洲社会种种务虚议题；场外暴乱看似构筑了一个真实可感的危机情境，实则是对1378年的拙劣模仿。最终“圣神吹拂”的结果则揭开了所谓“自由派”的保守主义面纱：宁肯在传统中假做姿态自我麻痹，也不愿打破枷锁自我解放。"
    },
    {
      "rating": "5/5",
      "review": "I've been having a really bad last 5 months, and that is worth mentioning because I've been having a really bad 20 years. But, today I watched Conclave. I didn't know what it was about but since a pope just passed well hell why not. I'm a cis white lower middle class male with oodles of privilege to spare compared to most people. That said Conclave somehow inspired me to think that maybe, 1,000 years from now, there might be a delightful future where humans can accept each other as humans. Which is pretty amazing seeing as how much Star Trek I've seen didn't inspire the same hopeful feels. Anyway, this is a movie recommendation."
    },
    {
      "rating": "5/5",
      "review": "The CHAD trad Goffredo Tedesco (Sergio Castellitto) defends THE CHURCH (and western civilization) against the VIRGIN lib Aldo Bellini (Stanley Tucci) in this heartwarming papal epic. BASED and spaghetti-pilled."
    },
    {
      "rating": "3/5",
      "review": "The acting is superb, the details of the process is interesting. I don't think the \"surprise\" was necessary or relevant."
    },
    {
      "rating": "2/5",
      "review": "A bit slow, but still good drama movie! Although the ending is terrible, making it feel like the movie wasn’t worth watching after all.."
    },
    {
      "rating": "4.5/5",
      "review": "Finely crafted film about the dynamics behind the Papal election. While too many modern issues are crammed in, despite this the film's moving message remains its lasting impression: do unto others, e.g., true spirituality lies in tolerance of our fellow man."
    },
    {
      "rating": "3.5/5",
      "review": "Ralph Finned was excellent good insight and thought provoking about organisational weaknesses of religious orders."
    },
    {
      "rating": "4.5/5",
      "review": "I didn't expect it to be this good. Went in because of how relevant the theme of the movie is to current times, and left impressed. The plot is interesting and keeps you hooked. The acting is really good, everyone getting on character like if they were themselves. The camera shots were absolutely beautiful. It shows some good life lessons. Why don't I give it 5 stars? The ending felt kind of forced to me, but you'll have to see it to judge it by yourself. So go get your tickets, trust."
    },
    {
      "rating": "4.5/5",
      "review": "Carried by Ralph Fiennes, Conclave is interesting political thriller with the Catholic Church as the perfect backdrop with its rich costumes and interiors that look a painting. The third act might be too rich for some, but the history of the Church is also very rich."
    },
    {
      "rating": "3/5",
      "review": "Carried the intrigue of a good mystery until the contrived climax."
    },
    {
      "rating": "3.5/5",
      "review": "Such a strong production and storyline with great acting from Fiennes, completely spoiled by a contrived and totally unbelievable ending. Crushing disappointment to end an otherwise really enjoyable film."
    },
    {
      "rating": "4.5/5",
      "review": "Conclave is about cardenals who are in the sistine capel in Rome, and choose the new Pope. The film was interesting and gripping  The film was interenting, because show how the cardinals choose a new pope and we learn about this. I recommend it because I learned a lot about the culture."
    },
    {
      "rating": "4/5",
      "review": "Con una trama bien construida, una fotografía bien trabajada y unas actuaciones dignas de admirar, cónclave nos muestra el entramado Mundo de la iglesia católica dejándonos satisfechos y dudosos al mismo tiempo"
    },
    {
      "rating": "4.5/5",
      "review": "Very well done . Great cast"
    },
    {
      "rating": "5/5",
      "review": "It’s a miracle that flawed old men electing a pope could be suspenseful with each round of balloting and right up until white smoke blew out the chimney."
    },
    {
      "rating": "4/5",
      "review": "I am a Roman Catholic, and although I knew a lot of what goes on in the selection of a pope, including politicking, I found this movie intriguing. I thought Ralph Fiennes was spectacular in the role, and as was Carlos Diehz. The ending was a real twist. I enjoyed the movie."
    },
    {
      "rating": "4.5/5",
      "review": "As I have recently returned to the Catholic Church, I found this movie interesting and very well done. The actors were all in top form and I also enjoyed the photography of Rome and Italy."
    },
    {
      "rating": "5/5",
      "review": "Why didn't it win the Oscar for Best Picture of the year?"
    },
    {
      "rating": "3/5",
      "review": "Like other reviews, I think this starts well and costume design and sets are great but let’s be honest … who watches films for that. The last 30 mins is bizarre. The writer obviously thought ‘let’s see how many modern hot potatoes I can get in this film’ it’s interesting seeing how they choose a pope etc but yeh .. it’s a slow film. I almost switched it off half way through. Like a lot of Oscar stuff… they either pay off the critics or the critics really don’t have a clue."
    },
    {
      "rating": "2.5/5",
      "review": "Good film and concept but the ending was lacklustre. There was a lot of build up for nothing exciting to happen."
    },
    {
      "rating": "0.5/5",
      "review": "Un filme qué lejos de contar una historia con sintonía parece más un cortometraje político de 1980"
    },
    {
      "rating": "1/5",
      "review": "The film is beautifully shot. So many frames are composed like a Renaissance painting, it’s exceptional visually. That is where the praise ends though- the plot meanders and never seems to know where it’s going, it pretends to build and heighten drama while never actually doing so, the plot devices are so heavy handed and feel somewhat forced, the acting (despite having such a star studded cast whom I have seen deliver great performances) is quite poor. the ending is nearly laughable- it feels forced to the point of seeming like an act of sabotage by whoever wrote it. I am not Catholic, nor even religious, but if I was I would feel slightly insulted by this farce."
    },
    {
      "rating": "4/5",
      "review": "Acting was the best part, otherwise kind of a not so crazy thriller/mystery. Some funny stuff and what seemed like a realistic take on the church vs one that over glorifies the traditions. Ending was interesting, not bad, not good, just kind of made me think."
    },
    {
      "rating": "2/5",
      "review": "I liked it until the end. This crazy gender confusion is infiltrating everything!"
    },
    {
      "rating": "3/5",
      "review": "Watched it for Ralph Fiennes, I would expect more movie itself was boring and the end was nonsense like I said would expect more."
    },
    {
      "rating": "0.5/5",
      "review": "The ending was trash came out of nowhere and was clear Hollywood bs."
    },
    {
      "rating": "2.5/5",
      "review": "The story line was kind of gripping. But in the end it was predictable and somewhat underwhelming. I wouldn’t want to see it again"
    },
    {
      "rating": "4/5",
      "review": "The turtle crawling out of the pond was heading for the out door and trying to leave the vatican, symbolic of how older people will view the new popes anatomy. And will leave the catholic church. The three young nuns at the end, just heard the gossip about the popes anatomy and were laughing, symbolic of how younger people will view the new popes appointment, laughing at the catholic church."
    },
    {
      "rating": "1.5/5",
      "review": "Great cast some good acting. John Lithgow was way over the top. The plot was too unbelievable. Have to suspend a lot of reality to follow this story. Moronic ending."
    },
    {
      "rating": "1/5",
      "review": "BOR-RINGGGGG. We left after 30mins. could not give anymore of our lives"
    },
    {
      "rating": "5/5",
      "review": "I loved this movie! Ralph Fiennes should've won the Oscar!"
    },
    {
      "rating": "5/5",
      "review": "Dark filters filtered the TV screen to show me watching as I oriented myself to figure out what was where. Next time, I'll keep the lights out. I don't like Ralph Fiennes, but he was lst rate in this film which keeps to the book."
    },
    {
      "rating": "1/5",
      "review": "If you believe the ending is remotely possible, I have some beach-front property in Iowa for sale."
    },
    {
      "rating": "5/5",
      "review": "Well told and more entertaining than thought. There have been several movies done in this genre and this was one of the best, IMO."
    },
    {
      "rating": "4.5/5",
      "review": "My goodness, have mercy on me! Because I just witnessed a masterclass yet BOLD and DARING political vatican thriller on the big screen. Hooked from the moment everything starts, till the end. On edge of my seat all the time, everything from the philosophy, the commentaries, the cinematography, the colors, the ensemble, the MUSIC, makes this movie worth of its awards it received."
    },
    {
      "rating": "0.5/5",
      "review": "What a huge crap. Horrible terrible film. Burn in hell."
    },
    {
      "rating": "5/5",
      "review": "Wonderful implementation, a film that evokes acting, history and above all absolute cinema."
    },
    {
      "rating": "0.5/5",
      "review": "Starts great. Good costumes, music and actors. Ends up being complete trash"
    },
    {
      "rating": "1/5",
      "review": "The movie was great until the turn no n the ending was such disgusting rewriting of anything that would happen in the conclave. Would give it a zero"
    },
    {
      "rating": "1.5/5",
      "review": "Wait for it on a streaming service...boring."
    },
    {
      "rating": "4.5/5",
      "review": "If it weren't for the ending I've have given this a straight 5 stars. As it was, the twist feels unnecessary and detracts from everything that's gone before."
    },
    {
      "rating": "2/5",
      "review": "What a disappointment. Clumsy Cluedo like elimination of the candidates, preposterous plot lines, documents hidden in headboards, secrets that no one could keep secret and a deus ex machina plot twist that’s just beyond stupid."
    },
    {
      "rating": "2/5",
      "review": "The only reason I kept watching was because I thought it would have a more thrilling ending. Just meh. Slow pacing, and I knew nothing about catholic priests so that was at least instructive, but I also know this isn’t representative of Catholicism. And the reveal at the end with 5 minutes left after an almost 2 hours of nothing was not worth it lol. What assumptions does the movie want us to make from the ending? Not the mic drop it thinks it is lol"
    },
    {
      "rating": "3.5/5",
      "review": "i mean it's alright. nothing crazy but well made"
    },
    {
      "rating": "1.5/5",
      "review": "This is such an exciting premise of a movie. One that if the story was better, I would enjoy greatly. However this was the most boring snooze fest of a movie. Great acting just couldn't hold up a terrible story."
    },
    {
      "rating": "3/5",
      "review": "I am only giving this movie 4 stars because it was well written, well acted, and the cinematography is amazing. I would have given it a higher rating, but I thought it would be less boring. It's an ok mystery and worth watching... it just didn't check the boxes of the movie I thought it would be."
    },
    {
      "rating": "4/5",
      "review": "Really interesting but the ending was a little bit of a disappointment ngl."
    },
    {
      "rating": "3/5",
      "review": "It was ok. It started off strong, but the bias against traditional Catholic doctrine came through from the writers. The villan was merely a conservative and every candidate was simply flawed, so the church elects a hermaphrodite and covers it up? I guess that is Hollywood's ideal Catholic Church."
    },
    {
      "rating": "5/5",
      "review": "Slow moving but very interesting. Fiennes and Tucci steal the show of course."
    },
    {
      "rating": "3/5",
      "review": "Interesting view of perceived politics in the college of cardinals. No doubt an attack by Hollywood at an easy target. But the ending...give me a break. Didn't know this was filmed in Fantasyland."
    },
    {
      "rating": "0.5/5",
      "review": "Trash Ending. Just that."
    },
    {
      "rating": "4/5",
      "review": "La Papa caliente... Edward, tengo un gran respeto y admiración por tu trabajo. Añade lo que espero de una gran película y es algo que disfruto en gran medida."
    },
    {
      "rating": "5/5",
      "review": "A thriller with fun twists. It almost seemed to change genre at time!"
    },
    {
      "rating": "3/5",
      "review": "Decent acting, (spoiler) ending was weird and, because it is so “topical” will make no sense in 5-10 years."
    },
    {
      "rating": "5/5",
      "review": "With an actual conclave coming up it was fascinating to see the process.The story has intrigue and scandal and most importantly, how Mr. Fiennes as the manager of the process deals with the revelations."
    },
    {
      "rating": "2/5",
      "review": "Good but the ending is terrible"
    },
    {
      "rating": "5/5",
      "review": "Best movie of 2024!"
    },
    {
      "rating": "3.5/5",
      "review": "Definitly a great movie. Really entertaining, with a good (but kinda obvious) ending. I found it overdramatic tho with exaggerated storylines."
    },
    {
      "rating": "1/5",
      "review": "Conclave è un film ben diretto ma la trama (anche se piena di suspence) diventa quasi un insulto alla Chiesa cattolica, soprattutto il finale."
    },
    {
      "rating": "4.5/5",
      "review": "Filled with strong performance, 'Conclave' gives us a strong view at the inner-workings and politics of electing a new pope."
    },
    {
      "rating": "2.5/5",
      "review": "Conclave had all the makings of a great film — a stellar cast, strong cinematography, and a fascinating premise — but unfortunately, it didn’t quite deliver a satisfying experience from start to finish. While the acting was superb (Ralph Fiennes and John Lithgow were easily the highlights, delivering layered, memorable performances), the film’s structure left a lot to be desired. Over the course of two hours, Conclave introduced more questions than it answered, creating plot holes that were never fully addressed. Important storylines seemed to fizzle out, and some conclusions felt more like abrupt stops than true endings. It’s clear there was a lot of potential here, and at times, the film showed flashes of brilliance. But ultimately, the lack of narrative payoff made it feel incomplete — like a beautifully set table with half the meal missing. Fans of Fiennes and Lithgow will still find something to appreciate, but Conclave falls short of being the thoughtful, gripping drama it could have been."
    },
    {
      "rating": "4/5",
      "review": "Good story, excellent acting. From what I have learned of the conclave process, this seems very on point. A really good drama and worth seeing"
    },
    {
      "rating": "4.5/5",
      "review": "Excellent film - Fiennes is fantastic as a cardinal who struggles with doubt, and Tucci, Lithgow, Msamati, Rossellini, and the rest of the cast are also terrific. It's fascinating to see the papal election process that happens behind closed doors, and the plot keeps you guessing as to who will emerge as pope, with an extra twist at the very end."
    },
    {
      "rating": "3.5/5",
      "review": "Excellent acting but a little slow moving for my taste and a little uneventful. Interesting to see the process though"
    },
    {
      "rating": "5/5",
      "review": "Totally enthralled with acting and plot. I must say it was quite the story!"
    },
    {
      "rating": "5/5",
      "review": "Absolutely thought provoking. Watched it twice and may watch it a third time. Excellent acting and story plot with a surprising ending. This is the type of movie I love with suspense and mystery that keeps you glued to the screen. Thinking of the Pope’s recent death and this movie gives more depth to reflection. Oscar material. It will be one of the greats."
    },
    {
      "rating": "4/5",
      "review": "Brilliantly brooding film with sensational performances from all but notably Fiennes and Tucci. The film moves along at steady pace keeping you engaged all the way. Beautiful"
    },
    {
      "rating": "4.5/5",
      "review": "Vi esta pelicula hace poco y debo decir que fue muy buena. me re sorprendio el final"
    },
    {
      "rating": "2.5/5",
      "review": "[SPOILDER ALERT...] Great acting, Interesting story... until the end. The ending and its climax felt absurd and artificially constructed, lacking authenticity and impact. The story would have been far more compelling with a dramatic twist—imagine Lawrence secretly orchestrating everything, pulling strings in the shadows only to ascend to the papacy himself. Or the sudden revelation that the Pope was murdered, shattering expectations and throwing the Vatican into chaos. Maybe Benitez, chosen as Pope, turns out to be an imposter, forcing Lawrence into an impossible moral dilemma—does he expose the deception or safeguard the Church from further scandal? Any of these would have deepened the intrigue, making the narrative richer and far more unpredictable, rather than relying on a biological revelation as the central twist."
    },
    {
      "rating": "0.5/5",
      "review": "The story took two hours of my life I can never get back. At least the acting was solid."
    },
    {
      "rating": "5/5",
      "review": "Even amongst the holiest of positions, no person is without sin. Conclave takes us into what goes behind closed doors as the cardinals elect a new pope. Kept me on the edge of my seat. Amazing cinematography and amazing acting. It should have won best picture at the Oscars. Highly recommend it."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie with a surprise."
    },
    {
      "rating": "5/5",
      "review": "Las actuaciones son muy buenas, un final inesperado habla mucho de lo que de verdad pasa en el Vaticano, es una película que te mantiene tu atención de principio a fin."
    },
    {
      "rating": "3.5/5",
      "review": "It's clear why this movie is getting rave reviews, and it's clear why it will receive awards. It's in a protected class of film and will receive extra credit for the subject matter. That aside, it was done well and was intriguing throughout. It was almost certainly not a realistic portrayal of a modern conclave, and it was definitely dramatized for effect, so in that respect it was clearly fiction. Nevertheless, i liked this film very much because they didn't overdo it and made it a gentle poke in the eyes of the Catholic church, instead of a slap in the face."
    },
    {
      "rating": "3.5/5",
      "review": "The acting in this movie is next level. Not the most exciting story ever told but the acting is next level"
    },
    {
      "rating": "4.5/5",
      "review": "This gripping political thriller provides a peak into the process of selecting the next pope behind closed doors. More importantly it portrays the crisis of faith, the flaws of humanity and the doubts of one's views becoming the most popular figure in the world. The acting impressively delivered the mixed cast of characters emphasising the film's themes. The cinematography and score was well crafted and the pacing was good enough not to over stay its welcome."
    },
    {
      "rating": "4.5/5",
      "review": "A cardinal sin this film wasn't named as Oscar's Best Picture."
    },
    {
      "rating": "4.5/5",
      "review": "Very good story. Very relevant information."
    },
    {
      "rating": "4/5",
      "review": "To be a two hour movie with a limited cast in a limited setting, it creates ample drama."
    },
    {
      "rating": "3.5/5",
      "review": "Ralph Fiennes never disappoints"
    },
    {
      "rating": "4/5",
      "review": "Un sube y baja de emociones."
    },
    {
      "rating": "0.5/5",
      "review": "Horrible!! Big waste of time."
    },
    {
      "rating": "4/5",
      "review": "I loved this film. Great actors amazing storyline. Then the ending. The ending is why I hve no need to watch this movie again. That was a huge let down. Not bc of how it ended ie the storyline but bc of how the ending was told, acted, directed. It shld have been acted better & told better. The film deserved more. It deserved a stomach churning reaction ending."
    },
    {
      "rating": "0.5/5",
      "review": "I wish I could give it zero stars. Just another blasphemous movie about my Catholic faith. I dare someone in Hollywood to make a movie mocking Muhammad on screen. The ending reveals that the newly elected Pope, Cardinal Benitez, is intersex."
    },
    {
      "rating": "0.5/5",
      "review": "Extremely disappointing ending"
    },
    {
      "rating": "3/5",
      "review": "Panalo. Napapanahon na pelikula. Deserving na manalo ng Oscars. Nakakahinayang lang na pinalitan un character ni Benitez ng Mexican na dapat e pinoy talaga sa libro. Swak din un twist sa dulo na talagang ma shoshock ka"
    },
    {
      "rating": "4/5",
      "review": "Brilliantly cast, gorgeously shot & eerily timely."
    },
    {
      "rating": "4/5",
      "review": "Definitely watchable Intriguing Very relevant at this time"
    },
    {
      "rating": "4.5/5",
      "review": "Incredible directing. Honestly, the story itself wouldn't be interesting without the directing, which just highlights how good the directing was. Great acting, too. Well written. Ancient tradition meets the modern world. Men shrouded in mystery and reverence are humanized by wordless glimpses."
    },
    {
      "rating": "4.5/5",
      "review": "Ralph Fiennes masterclass, gripping storyline and a few plot twists, loved this movie and will definitely watch it again."
    },
    {
      "rating": "0.5/5",
      "review": "An insult to Catholics and the Catholic Church. While Catholics have utmost concern for those born with sexual differences, the Church teachings around priesthood and the papacy are unchanging. One must be a biological male to be validly ordained. Would you present a similar storyline about Islam or Judaism? Why does society think it’s acceptable to present distortions of Catholic Church teachings? This film is fictitious at best and discriminatory at worst."
    },
    {
      "rating": "5/5",
      "review": "Wasn't what I was expecting, interesting outcome"
    },
    {
      "rating": "4.5/5",
      "review": "Extraordinário, maravilho esse filme, te prende do começo ao fim show"
    },
    {
      "rating": "4/5",
      "review": "Varias tomas de #conclave son una obra de arte de fotografia y dan ganas de imprimirlas y enmarcarlas, deberian sacar un libro de prints"
    },
    {
      "rating": "4/5",
      "review": "Very interesting movie, great plot. Great actors and OMG, the images and filmmaking look like paintings!! A bit disappointed by the 5 last minutes of the movie though."
    },
    {
      "rating": "5/5",
      "review": "A fine emotional film set within the mystery walls of the Vatican City. Ralf Fiennes plays one of his very best roles, together with Stanley Tucci, making it a must watch."
    },
    {
      "rating": "4/5",
      "review": "Conclave is a gripping, atmospheric drama that delves into high-stakes decision-making behind closed doors. With a slow-burn narrative, the film thrives on tense, dialogue-heavy moments rather than action. The performances are layered and nuanced, particularly the central character’s journey between duty and personal belief. The setting is a character in itself, with its cold, echoing spaces. Thought-provoking and intellectually engaging, Conclave is a must-watch for those who appreciate subtle, character-driven storytelling."
    },
    {
      "rating": "1/5",
      "review": "Perfectly fine movie then actually pointless political plot twist to end the movie."
    },
    {
      "rating": "3/5",
      "review": "Pope Joan meets The Crying Game."
    },
    {
      "rating": "4/5",
      "review": "Considering recent events I thought this would be an interesting watch and I definitely wasn't disappointed. Incredible acting across the board, this felt tense and gripping even with scenes of cardinals voting. It's tone is like a murder mystery with revelations coming to light that affect the plot. Sound design and music are also standout adding to the tension. Definitely worth a watch if you like a slow burn mystery with some twists and turns with great performances."
    },
    {
      "rating": "5/5",
      "review": "A thought provoking film with a credible and gripping plot and superb acting."
    },
    {
      "rating": "2.5/5",
      "review": "Not bad until the ridiculous ending!"
    },
    {
      "rating": "5/5",
      "review": "Incredible direction and cast"
    },
    {
      "rating": "4.5/5",
      "review": "I’m not a big movie buff and to be honest, I don’t enjoy watching most films. If we go to the cinema as a family it’s a good nap opportunity for me. However, this I liked. A subtle and tasteful film which views the world and its current state through the lens of Catholicism. The acting is brilliant, particularly Ralph Fiennes and Sergio Castellito. The filming and camera work is great too - the austerity of the cardinals’ lodgings and the buzzing hallway seems at odds with what we would expect for such lofty individuals. Rich in motifs too - the laboured breathing of Fienne’s reluctant character keeps coming back. Just when I thought every mainstream film was absolute shite, this restored my faith. In films, not god."
    },
    {
      "rating": "4/5",
      "review": "Excellent cast in a thriller about electing a new pope."
    },
    {
      "rating": "4/5",
      "review": "Difficult topic with Ralph Fiennes at his best!"
    },
    {
      "rating": "4.5/5",
      "review": "Exemplifies all that is honest, painful, and human about the power of religion."
    },
    {
      "rating": "4/5",
      "review": "Conclave is a historical fictional film about the ins-and-outs of running a conclave when a Pope dies. The film touches the surface of minor Politics involved in the decision for the next Holy Father, the dynamics of the conclave, all while following Cardinal Lawrence, his struggles with the Church, and his dedication to God. Heavy on drama, the story is slow-paced like a Conclave itself. The glimpses we get of the rites that happen during this period are cool for a particular audience, but the runtime might be a detractor for those who couldn’t care less. Though strong on its execution and great on the visuals, Conclave fails to shine a light onto the deeper aspects of a real conclave. The film shows little of the discussions and party rallies, and the major mystery is dismissed for much of the runway, swapped for a minor one that is easy to solve. When the major mystery comes back for the final revelation, the shocking it is supposed to entail is quickly wrapped up with an ending that leaves things too open. Conclave entertains those that have some sort of religious interest or belief, especially Catholics and close variants. Anyone that dismisses religion or really just can’t stand it, well, won’t stand this story either."
    },
    {
      "rating": "3.5/5",
      "review": "Siento una tristeza profunda personal, sobre querer que está fabulosa pelicula conecte conmigo a la fuerza, no lo logré. Senti envidia de la persona al lado mío que la disfruto sin igual; todo porque \"Conclave\" se me presentó como una \"Caja Fuerte Mental\", donde no pude descifrar las hermosas piezas que está película contenía. Tuve la suerte de invitar a mi madre a vivir está experiencia y compartir opiniones, ella fungió como una herramienta para contemplar su visión. \"Una batalla de ideales, creencias que luchan por encontrar su camino, representaciones ocultas de los ojos más superficiales\". \"Conclave\" es una pelicula tan poderosa, donde se necesita más que observación para traspasar la pantalla. Por eso la motivación de esta crítica."
    },
    {
      "rating": "5/5",
      "review": "Pretty wild film, definitely was worth watching in theaters"
    },
    {
      "rating": "5/5",
      "review": "Enjoyed it. Truly captivating. So many twists and turns. Very dark. A Catholic thriller."
    },
    {
      "rating": "3.5/5",
      "review": "Entertaining and very watchable. Ralph Fiennes pulls off a demanding role with consummate ease. More like a Who-done-it than a religious film. Recommended."
    },
    {
      "rating": "4/5",
      "review": "Upon the pope’s death, cardinal Lawrence (Ralph Fiennes) by virtue of position as dean, forms a conclave where cardinals are sequestered in the Vatican City, free from outside influence and submerged in secrecy to vote for a new pope. Ralph Fiennes succeeds in evoking a reluctant, worried but determined manager, a shepherd herding a flock of considerably, some of the most powerful men in the world. These men whisper and subtly malign their contemporaries’ chances of getting voted into the papacy. On top of this, cardinal Lawrence deals with a crisis of faith, initially resolved not to listen to matters about backgrounds that may describe a candidate as unworthy, but his own morality defies this rule – learning of past scandals and leading to revelations and disqualifications. On the other hand, this leads to him also becoming a suitable candidate by his peers, earning votes he claims he does not desire, earning both judgement and support. The film hints on the ongoing symptoms of institutions that abuse power and tolerates prejudice, championed by those who lead them. And some of this are embedded in laws that entail breaking to do what is right. The cardinals are framed not as caricatures of agendas but people of converging and contrasting beliefs. There are also no purely antagonistic forces but merely the clash of views leading to conflict. Far into the film, the audience is reminded of the power and influence this group of people hold as a bomb tears a hole into the church ceilings, fortunately failing to injure the cardinals. By the end, after a joust of words, the final voting sets a winner, with a twist reveal that tiptoes close to fiction yet not entirely impossible. Depending on audience belief, we are left to play out the remainder of the outcome, but are as relieved as cardinal Lawrence that the conclave is over."
    },
    {
      "rating": "4.5/5",
      "review": "Superb story combined with detailed characters and a healthy dose of suspense. Represented the Catholic church and various philosophical themes to a tee. Would most definitely recommend."
    },
    {
      "rating": "3.5/5",
      "review": "It's pretty alright… Ralph Fiennes is as good as ever, as a functionary with conflicted ambitions, and the supporting cast are solid as well. The plot is \"fine\", as is the script. The best thing about it, IMHO, is the alternation between brash Catholic music, and silence - it's a good tool to manage pace."
    },
    {
      "rating": "3.5/5",
      "review": "I enjoyed this movie a fair amount, up until near the end, where it went off the rails a bit in a silly fashion. some good solid engaging acting. And although totally fictional its still cool to imagine what goes on in that mysterious pope house, with all those cardinals fannying about. worth a watch"
    },
    {
      "rating": "5/5",
      "review": "Great movie and great thriller! It should have won best picture over Anora."
    },
    {
      "rating": "1.5/5",
      "review": "I'm in shock that so many people liked this movie. Even though the first 2/3 of the movie are fine, the ending is so ludicrous that it completely ruined it for me."
    },
    {
      "rating": "4.5/5",
      "review": "I'm knocking half a star of this for the add on twist ending. A semi Pope Joan surprise. The story was doing splendidly up until then. Superb story, cast and direction. That the movie ends like a rasping all but flaccid balloon speaks volumes about this singular avoidable failure. It's a 2D moment in an otherwise 3D film. I would also add the post bombing rant of Tedesco to the 2D catalogue....although I can understand its requirement to allow the election to end. Given the subject matter, forget calling it a 2D moment, it is the perfect Deus Ex Machina moment; maybe our Lord himself dipping a finger. Superb film otherwise."
    },
    {
      "rating": "0.5/5",
      "review": "Well-acted and the sets are beautiful. Otherwise boring and completely political. They aren't even being subtle. And the entire movie is a build-up to an eye-rolling \"gotcha\" that makes this literally a pointless movie."
    },
    {
      "rating": "5/5",
      "review": "A totally must see. The cast is truly fantastic, with a Ralph Fiennes that delivers an out of this world performance. The story caughts the watcher's attention since the first \"Conclave\" title scene and holds it until the very last \"Conclave\" that appears on screen with bright yellow letters. I watched this film with my parents, and we all agreed that it was phenomenal. One thing i must say though, which doesn't mean it's bad, but the character's names and the characters itself give to make an intricate game of \"Who is Who\". We had a bit of a difficult time corresponding each name with with its face. One of the best things, in my opinion, (apart from Ralph Fiennes and Stanley Tucci, who also did an amazing depiction of his character) may be the end. I would have never imagined such conclusion to the story. I truly wish it had received many more awards on the Oscars. Sit back and enjoy."
    },
    {
      "rating": "3/5",
      "review": "Conclave is essentially one of those \"gotcha\" films, that's 95% build-up, with a big finish. The quality acting, and A-list cast make this pretty easy to watch, but it's a shallow plot overall, which is why I only gave it 3 stars. It's essentially about an election, and the politics, personalities, and indiscretions that are exposed during the process. Whether or not you like the ending will depend on your political/religious convictions."
    },
    {
      "rating": "3/5",
      "review": "A very interesting idea but it was confusing. I was never sure which priest they were talking about."
    },
    {
      "rating": "0.5/5",
      "review": "Grate movie with grate cast, but the end plot just destroyed it. The whole movie is about the cardinals not beiing political, and then this end!!! Laught all the way back home."
    },
    {
      "rating": "4.5/5",
      "review": "There’s a kind of hush in Conclave—not silence, but the coiled, breath-held quiet of ancient ritual dressed in modern cutlery. It hums beneath cassocks and gritted teeth, beneath the Sistine ceiling that feels less like heaven and more like surveillance. This is a thriller measured in eye flickers and murmured allegiance, where every footstep echoes like a gavel against the ribs of God Himself. The film dares to strip theology of majesty and expose its scaffolding—fragile men with trembling hands attempting to steer the eternal. It is not about faith; it’s about the performance of belief, a kind of ecclesiastical LARP in the Vatican's bowels, where politics and power pirouette around a slowly dying candle. Fiennes walks like a man who’s been hollowed out by too many whispered truths. His performance isn’t acting, it’s a slow possession. You watch him dissolve into robes and ritual, until only guilt remains—dense and invisible as incense. His eyes do most of the speaking, which feels apt in a film where words are dangerous currency. But what I loved—what made this film throb with relevance—was how it made the divine feel mundane, and the mundane feel profound. A key in a drawer has the tension of a loaded gun. A hallway becomes a confession. And when secrets slip through cracks, they don’t fall—they metastasize. The final reveal is less twist and more transubstantiation. A quiet heresy buried in cloth and dust. And it asks—not whether men can speak for God—but whether they've just been speaking to themselves, in a cathedral-sized echo chamber."
    },
    {
      "rating": "3/5",
      "review": "Entertaining, but also controversial. Based on the fact that the Catholic Bishops warned against it speculative side that may cast doubt in believers' minds. Regardless, it still has a fair amount of intrigue and excellent acting to keep you wondering what will happen. My friend Danny recommended that I see it after the Oscars. Saw on Peacock."
    },
    {
      "rating": "5/5",
      "review": "Robbed at the Oscars, this is an intelligent and revealing dramatic look at the process of selecting the next pope. Ralph Fiennes plays a character that had me thinking back to Keyser Soze in Usual Suspects as Conclave has so many twists and turns you absolutely cannot predict what Fiennes character, Cardinal Lawrence, is going to do next. Must watch film."
    },
    {
      "rating": "4/5",
      "review": "Interesting script, great acting and cinematography."
    },
    {
      "rating": "1/5",
      "review": "US political drama of eternal fight between left, and right utilizing gender politics and transplanting it into religious 2+ hours of cheap quasi intelectual rubbish."
    },
    {
      "rating": "3.5/5",
      "review": "Great acting. Interesting subject matter. Just not something I'd feel the need to watch again."
    },
    {
      "rating": "5/5",
      "review": "...EXCELLENT...In Every Category...A WOW...Can Not Even Conceive Of A Hermophodite Pope...THOUGHT PROVOKING..."
    },
    {
      "rating": "5/5",
      "review": "Saw it on a plane. Loved it. The story, the acting, the cinematography, the underlying themes, the relevance to current events. Everything. Probably merited watching it on a big screen, but I'm glad to have gotten to see it."
    },
    {
      "rating": "2/5",
      "review": "The acting was superior. The end vote was given away too early and a very strange ending"
    },
    {
      "rating": "3.5/5",
      "review": "Good but not great. Overrated. Interesting, but mostly predictable. The final plot twist is as implausible as the sequence of events needed to get to that point, but everyone seemed typecast for their roles to make it happen. It was almost like a comic book movie, you knew who everyone was when you first saw them. I don't know how accurate it was about cardinal politics, but if it is, what a way to run a church."
    },
    {
      "rating": "5/5",
      "review": "It's easy to think that a feature film about the catholic church will rely on its horrible recent history to move the plot along, and you'll be glad to hear that it only does that a little bit. Of course, no movie about the church can sincerely ignore the matter of institutional abuse without losing credibility, however Conclave deals with these matters masterfully. Truthfully, this is a great story about thievery, deception, bribery, diplomacy, and blackmail, as warring factions of the church battle to take over as its leader, and, somewhat predictably, there comes a saviour to unite them all, and preach a message of peace and tolerance. Where have I heard that before? Totally worth a watch, and not as dreary or as gruesome as you might expect a movie about the catholic church to be."
    },
    {
      "rating": "2.5/5",
      "review": "The film started well, with suspense and intrigue. The ceremony when the dead pope is removed and his rooms sealed fascinating. It then increasingly became unbelievable and farfetched - the height of this absurdity was the terrorist attack. The right wing Cardinal's speech afterwards not plausible. Fiennes was good but what nationality was he? Surely they would not allow a cardinal they have never heard of into the conclave. The twist at the end was thought provoking. A potentially interesting story ending in the absurd."
    },
    {
      "rating": "4/5",
      "review": "The Catholic Church is supervised by self interested and corrupt individuals who endlessly plot and malicously collaborate. Wow! Who knew? This film is great viewing on a number of levels. As a poison pen letter to the Vatican it is supremely good. And there is some comedy because of that. The point of it is also sharply made and the criticism acidic. As a thriller it stands up very well on its own. The wardrobe work is excellent and the detailing on the robes is all impressively correct. The sets and location work are also both just so credible and really enforce the quality of this film. I have to say that I found the art direction caused the view to be a little too dark but I guess that added to the atmoshpere of the story. And a top class cast. Fiennes and Tucci are both supremely good. With such a cast, great producton values being so well shot, this film is a must."
    },
    {
      "rating": "5/5",
      "review": "The acting was phenomenal!"
    },
    {
      "rating": "1/5",
      "review": "Unpopular opinion, but I thought this was dire. Yes, great actors, beautifully shot, but I had no draw for the characters (except Fiennes) and the story was trite and painfully predictable - I’m usually pretty bad at guessing where a film is going but this plot set up was the most obvious I’ve ever seen. And the ‘twist’ was so trivial and undeveloped, it was meant to be a bombshell but they watered down the concept so much it ended up being utterly pointless. They could have skipped the seven rounds of drama free voting and jumped to the consequences of the final decision in the first 20 minutes and begun a meaningful story that actually confronted the themes it suggested to raise. I expected so much more from this movie, a huge disappointment for me."
    },
    {
      "rating": "2/5",
      "review": "Almost everything here is perfect, the score especially is superb, however it’s let down by a bit of silly ending which really undercuts the stakes and tension built up by the rest of the film"
    },
    {
      "rating": "4/5",
      "review": "Turning the machinations regarding choosing the new Pope into a suspenseful thriller, that manages to address the controversies and hypocrisies of the Catholic Church hierarchy without ever leaving the confines of the Vatican, made for a really engaging Friday night at the cinema"
    },
    {
      "rating": "4/5",
      "review": "Excellent performances…. Brilliant cinematography. Great storytelling!!!"
    },
    {
      "rating": "2/5",
      "review": "Good acting. The movie expresses what must be an incredibly stressful event with human emotions. It was also slow moving and introduced events that were not developed (explosion). The end was unexpected and opened many questions with a Hollywood agenda that I did not see coming. The very last scene was awkward."
    },
    {
      "rating": "5/5",
      "review": "One of the best movies of my lifetime. Perfectly translated onto the screen, tense and yet nonetheless moving. Unbelievably brilliant."
    },
    {
      "rating": "2/5",
      "review": "It was less epic than I thought it would be."
    },
    {
      "rating": "3.5/5",
      "review": "What could have been a very good movie is undone by an impossible-to-believe ending."
    },
    {
      "rating": "2.5/5",
      "review": "This is one of those films for me that feels like a private conversation where I was the third wheel. In addition to that, the synopsis kinda oversold this as it was what finally convinced me to give this a shot. A conclave and the politicking to choose the next pope with various demographics as catalysts isn’t exactly the ‘uncovering of deep secrets that could shake the Roman Catholic Church to it’s foundation’ that I was expecting. Not to mention, it takes nearly 80 minutes for it to get to the crux of the matter and that wasn’t enough to win back my undivided attention once it did. For people interested in a fictitous account of the process that does at least appear to make a sincere effort to be as respectful as possible, it may hit the right notes. It seemed accurate, seemed well made, seemed enlightening but... baits too much with divisive issues."
    },
    {
      "rating": "2.5/5",
      "review": "Not excelente, not bad, just ok."
    },
    {
      "rating": "3/5",
      "review": "Not bad, but the final \"twist\" seemed ridiculous (I saw it coming) and there simply to push an agenda."
    },
    {
      "rating": "3.5/5",
      "review": "Tried too hard to be inclusive."
    },
    {
      "rating": "5/5",
      "review": "Fabulosa, solo no estoy de acuerdo con el mexicano."
    },
    {
      "rating": "4.5/5",
      "review": "Las actuaciones te transmiten, la tensión, confusión, crisis de fe, la banda sonora acompaña estas emociones y a la par las actuaciones de todos muy buenas."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie. It totally made me think, and just when I thought I had it all figured out, I didn't!"
    },
    {
      "rating": "3/5",
      "review": "watched on a plane. might need to be a catholic to not find it completely ludicrous. I wish I had my back story on Ralph Fiennes character, as at time he came across to me as downright naive. But there are many very good actors, and great cinematography of the Vatican."
    },
    {
      "rating": "1/5",
      "review": "Although well acted the plot is ridiculous. We are to believe that the process is purely political but they ended up choosing a complete unknown"
    },
    {
      "rating": "4/5",
      "review": "Very well done movie, some beautiful cinematography."
    },
    {
      "rating": "4.5/5",
      "review": "Conclave was so much better than I expected it to be. Gripping and beautiful with the great actors pushing it into sublime territory."
    },
    {
      "rating": "1.5/5",
      "review": "We were very disappointed in this movie. I can't recommend it. We don't think any of the actors took their roles seriously. Not authentic or accurate in any way and a gotcha ending for everybody that is into *okeism."
    },
    {
      "rating": "4/5",
      "review": "Art. This movie is a definition of art. I love how I was so focused on watching this movie, something that I've lost in a few years. This movie is so captivating. The plot is taboo, the scoring is suitable, and the cinematography is top notch. I feel like I was in an art exhibition and seeing a lot of paintings. Every scene is so pretty. The plot is alright, the plot twist is kinda meh, unnecessary, the plot twist idea is alright but the execution feels wrong, it feels like it doesn't matter if it's there or not."
    },
    {
      "rating": "4/5",
      "review": "Intriguing story, great cast, some excellent shots, Loved the twisty turny story (though the outcome of the vote was what I expected), loved the balance of story moments between gregariously colour saturated scenes and bland sparse moments, and there were a number of shots that were quite stunning (eg the overhead of the umbrellas. Definitely worthy of the Oscar nom (and far more worthy than the than the one that bizarrely got the nod)"
    },
    {
      "rating": "5/5",
      "review": "Excellent cast. Excellent movie!!! Should have won the Oscars."
    },
    {
      "rating": "5/5",
      "review": "Not my type of movie genre, but I was pleasantly surprised how good it was. Open your mind and palate. It’s all about the details in dialogue and sounds(such as the writing on paper during each voting round.). The acting, story, and directing was great."
    },
    {
      "rating": "4/5",
      "review": "Magnificent imagery and cinematography. Well done. Storyine evolves with nice pace. But, I seriously doubt the Vatican has quite the cliche infighting and politics that is depicted. But Hollywood will do its best to tear down the institutions they don't support."
    },
    {
      "rating": "4/5",
      "review": "Loved it…Ralph Fiennes was brilliant…he carried the Movie from beginning to end (he was the Movie). He definitely should have been given the Best Male Actor Academy Award. He is such a versatile, understated, not in your face British Actor. He would have been so terribly disappointed. Hopefully next time he gets an Academy Award…he certainly deserves it. My opinion he is the best Screen Actor for quite some time, I have never seen him in a bad movie. I have seen the Brutalist it was so unnecessarily long & boring. ‘Conclave’ in my opinion was far superior & was the Best Movie & Best Actor for Academy Awards…(I’m not a Catholic) but…………I definitely didn’t like the ending, I didn’t read the Book! Is my Review Contradictory Yes & No !!!"
    },
    {
      "rating": "5/5",
      "review": "This film brought actual tears to my eyes. Masterful film making. From the cinematography to the sound design, this film reminded me of why I love movies and what a film could be. Bravo! Chariots of fire came to my mind, congratulations to everyone who was apart of this gem."
    },
    {
      "rating": "3/5",
      "review": "Not as good as it could have been, or as it was hyped to be, but still enjoyable. The acting was great, of course, but the plot was a bit shallow and predictable."
    },
    {
      "rating": "3/5",
      "review": "Le faltó un poco más al desarrollo de la historia"
    },
    {
      "rating": "5/5",
      "review": "Filme lindo! Fotografia encantadora, figurinos belíssimos e ótimas atuações. Não consigo achar algo de negativo nesse filme."
    },
    {
      "rating": "1/5",
      "review": "..............great dialogue that leads you to a story to be told! Only to end comedically."
    },
    {
      "rating": "2/5",
      "review": "Conclave aims to be a political thriller that likens the events of a papal election to that of modern political discourse. However, Conclave never goes beyond the artificial aspects of political intrigue. No character has depth, the dialogue is a trite parroting of generic ideological discourse, and the cinematography - while expertly done - serves no purpose to the narrative other than being lovely to look at. The premise of Conclave has vast potential; unfortunately, the film fails to capture its potential."
    },
    {
      "rating": "3.5/5",
      "review": "I enjoyed this behind-the-scenes look about the secret process of electing a new Pope, and how remarkably similar it is to electing any other public officer. I am not sure about the accuracies of the script but it was a well made movie."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie. The writing, acting, cinematography, everything is top notch. Ralph Fiennes delivers a rivoting performance and Isabella Rossellini is fantastic. This film gives an interesting insight into the Conclave process and although I believe that some of the things that have happened in the film most likely would not be allowed to happen in reality (especially the twist at the ending). I believe this film scores on all aspects. Definitely recommend!"
    },
    {
      "rating": "4/5",
      "review": "Considering it's about religion a story I normally would not consider it's a surprisingly good watch. With interesting plot twists I found myself glued to the screen."
    },
    {
      "rating": "1/5",
      "review": "Considering the subject matter and the fantastic cast, this movie had great potential. But it was incredibly dull and the plot twist at the end was simply unnecessary. Does gender identiy really need to be included in everything?"
    },
    {
      "rating": "4/5",
      "review": "A slow but very interesting film. A rather intelligent and precise critique of the church that makes us reflect on power and religion."
    },
    {
      "rating": "4/5",
      "review": "I didn't know what to expect apart from great acting from a stellar cast. The twists and turns in the plot stretched credibility but made for great drama. The pope they selected would be a refreshing change in the real world."
    },
    {
      "rating": "4.5/5",
      "review": "Edward Berger's film following the drama and intrigue of the secretive process of the Papal Conclave - the sequestered meeting in which a new pope is elected - is a masterclass in adaptation. Taking Robert Harris's novel as its source, what could have been claustrophobic becomes intimate and what could have been tortuous becomes suffused with low-key but no less gripping tension. Beautifully written and shot, it seems at first glance to be a long way from the director's previous film, his excellent take on All Quiet On The Western Front. But there are connections - both films are concerned with the machinery of their subject matter. War in the first instance, church politics. In both cases there is a different kind of tragedy showing starkly how human beings become part of that machinery - trying to do good, sucked up into the business of which they are a part, principles and humanity constantly up for debate as compromises are made, broken and remade. Both films focus on groups made up almost entirely of men - but certainly in Conclave, the role of women is cleverly noted - and when one woman intervenes it is economic and powerful. Brilliantly cast, there's some superbly subtle acting - especially in the way different performers employ there faces, reacting to what they see, hear or communicating wordlessly what they think and feel. The film's revelatory twist could have been tacky in other hands - but the film having built up an effective atmosphere of secrecy and claustrophobia, shutting out the outside the world, it works brilliantly. In my screening there were audible gasps and brief gaggle of excited chattering at the revelation. It's refreshing also that a piece of art can be clear about its criticisms of faith and the church specifically but still understand the importance of the role these things play in people's lives. Spirituality is understood, not patronised - which makes its critiques all the more powerful and its characters all the more humane. A superb, intelligent, gracious political thriller that will provoke as much thought as it grips and surprises."
    },
    {
      "rating": "5/5",
      "review": "After reading everything Robert harris has written (the Cicero series, Pompeii, Archangel, Enigma, etc.) my expectations were alreay pretty high for Conclave. It did NOT disappoint! As soon as I finished I thought it would make a great movie. Berger assembled a great cast with Fiennes, Tucci, Lithgow, ..., and gave me what I was hoping for/expecting. Wonderful!"
    },
    {
      "rating": "5/5",
      "review": "An example of prime storytelling. From the start to the finish I couldn't look away."
    },
    {
      "rating": "3/5",
      "review": "While a little slow, the phenomenal acting and cinematography made me excited for the ending, one which was teed up to be deeply conspiratorial and thrilling. Unfortunately the big ending was neither of those things, merely a revelation that, while tied to the deeper meaning of the plot, was impossible to foresee and relatively random in nature. I would classify the movie as a drama, not as either a thriller or a mystery. Disappointed only in that I thought they could have done more with the ending given the great setup. And yes I do realize the movie was based on the book, so these things were largely out of their control, but the feelings remain."
    },
    {
      "rating": "4/5",
      "review": "Me gustó el giro del final"
    },
    {
      "rating": "1/5",
      "review": "Whilst the production quality is good, the story drags on a lot for such little happening. The spoiler free summaries lead you to believe that there's a more in-depth corruption scandal than there is, when it's minor and simple corruption, not relating to criminal behaviour. There are some heretical concepts pushed as normal and accepted concepts, which are not biblically sound, and it seems quite clear to me that it was done to push certain ideological viewpoints, so if you're looking to watch the movie from any sort of accuracy or educational standpoint, then you won't find that here. The ending plot twist was so absurd and out of pocket that I couldn't even be annoyed at it, it actually made me physically laugh, despite the intended tone of the scene. The only reason I wouldn't give it lower is because the cinematography is actually decent. So if you don't care about slower pacing, accuracy of the portrayal of Christian beliefs, and don't go in expecting that there's an in-depth criminal corruption scandal, then you may find the movie to be a 6 instead of a 3."
    },
    {
      "rating": "4/5",
      "review": "This movie starts off really slow. I took me about 4 attempts to watch it all the way through. Lots of twists and turns and you need to be attentive to it. A changing plot that ended with an unexpected twist."
    },
    {
      "rating": "4/5",
      "review": "I feel conclave is a really good film about the true testament of faith. one who made a sexual mistake , another who thursts for power and is willing to buy and cheat to get named pope . another who is losing faith but in the end has been the right person to lead the conclave . great cast and was very good acting ."
    },
    {
      "rating": "5/5",
      "review": "The stature of this film is grand and immaculate in its story and presentation. The suspense is exceptional and all performances are top notch. Directing and writing are excellent. Cinematography is sublime and the production design is looks flawless. This is perhaps the best film of the year."
    },
    {
      "rating": "4/5",
      "review": "Beautifully filmed and thought out movie with a few shocking surprises."
    },
    {
      "rating": "4/5",
      "review": "No sane man would want the paPUSSY"
    },
    {
      "rating": "5/5",
      "review": "Ralph Fiennes for sure will take the oscar - amazing performance. A lot of twists and a lot of world issues makes \"Conclave\" one of the best movies of the year. Bellini: \"Is this what we're reduced to? To vote for the least worst option?\""
    },
    {
      "rating": "4/5",
      "review": "Great film from the director of All Quiet on the Western front. Suspenseful score and intriguing throughout."
    },
    {
      "rating": "5/5",
      "review": "I really like the historical movie"
    },
    {
      "rating": "4.5/5",
      "review": "Wow! It's give me a new sight about chatolic. Even it's make me thrilling this movie still stunning!"
    },
    {
      "rating": "5/5",
      "review": "this movies is about conclave process in Vatikan"
    },
    {
      "rating": "3/5",
      "review": "A really good movie destroyed by a terrible, facepalm of an ending that was predictable and silly. Such a shame for a genuinely serious and wonderful film, right up until the final minutes. \"Seriously? You have got to be kidding me. Of course they did; they couldn't resist.\" What a shame."
    },
    {
      "rating": "4.5/5",
      "review": "Me gustó la película es recomendable"
    },
    {
      "rating": "5/5",
      "review": "I think “Conclave” is beautifully intelligent. The audience can feel the tension inside the Sistine Chapel, the fear that other voters will elect the wrong cardinal to be the new Pope, the fear that they won’t follow the ideals and achievements of the former Pope. I have to say that the work of recreating the Sistine Chapel was incredible, the details… in short, a good film with good acting and good direction. This film certainly deserved to win several Oscars, especially Best Picture, but in the hearts of the audience, Conclave will be the moral winner. What a wonderful experience it was to watch this film. At the end, I confess that I was shocked by what was revealed to the audience, but in a good way because they managed to include a great plot twist. I finished the film with the wonderful feeling of “What a good film I just watched?” I highly recommend it to everyone. Watch it! You won’t regret it."
    },
    {
      "rating": "3.5/5",
      "review": "I can't believe they crafted such an exceptional story throughout its development only to end with such an implausible conclusion."
    },
    {
      "rating": "5/5",
      "review": "Being a Catholic and my uncle was a priest, I found this film one of the best movies I have watched this year. So many secrets even in the papalcy. The acting by the whole cast was excellent especially Ralph Feines and Stanley Tucci (my favorite)So suspenseful and fun to figure out who the bad guys are. Politics are everywhere, ugh."
    },
    {
      "rating": "5/5",
      "review": "Best film I’ve seen in quite sometime!? Right on that tenderest part of your heart & soul! Not at all what I expected but felt doubly blessed to hv seen such fine actors telling such a beautifuly human story… it was exquisite!! 🥰"
    },
    {
      "rating": "3/5",
      "review": "I get it, a papal election is delayed by intrigues, and appropriately, filmed mostly in the dark. C suffers from a common defect of films loaded with stars that are supposed to carry them; instead of building suspense, it sags all the way past a 2 hour shoot that not even a twist ending can save."
    },
    {
      "rating": "3/5",
      "review": "Strong buildup, but a bad ending. The conclusion undermines everything that came before it."
    },
    {
      "rating": "4.5/5",
      "review": "The way i was intrigued in this movie, while i thought it has a boring premise is wild. This movie kept my atention for the whole 2 hours. If this would've won over Anora, i wouldn't complain. The way this movie goes with all the gossip and intrigues, and coruption of a Conclave is crazy. I walked out thinking, damn, that review wasn't lying, that was the most diabolical vape hit i've ever seen. I did predict who will be pope, and probably that didn't come as a surprise for a lot of people. Overall i think this movie was fantastic, this movie was a thriller without guns or chessy one-liners (or bad CGI)."
    },
    {
      "rating": "5/5",
      "review": "Thought provoking and relevant to current time"
    },
    {
      "rating": "3.5/5",
      "review": "enjoyable popcorn movie for people with a brain. Eff all the other contenders this year... also, great timing with what looks like will certainly be an actual Conclave soon"
    },
    {
      "rating": "4.5/5",
      "review": "Conclave is a great story and well-deserving of its Oscar for Best Adapted Screenplay. Best of all is using the Allied Trio of Fiennes, Tucci and Lithgow as the main characters. All three have been scarily effective as horrible villains in their careers and settle into somewhat ironic roles as men of God."
    },
    {
      "rating": "4.5/5",
      "review": "Excellent film that was different than I expected. Actually suspenseful and intriguing. Not being a catholic it was fascinating to see how every little thing the clergy did had some specific procedure."
    },
    {
      "rating": "5/5",
      "review": "I love it, it’s amazing!!! The suspense from start to finish, the zoom, the symbolism, the weighty message that this movie brings is amazing! “We are all equal before God’s Law, We are not equal before Man’s Law” brings some reflections on Humanity, on good and evil, showing that evil is everywhere and so is good."
    },
    {
      "rating": "4/5",
      "review": "Good story though easy to base on corruption in the church and moralising the issues."
    },
    {
      "rating": "3.5/5",
      "review": "It's amazing how a movie about choosing the Pope can captivate someone like me, who considers themselves closer to atheism. By this, I don't mean that the film has a strong religious component, but rather that it's incredible how something that seems unimportant can be turned into a plot so engaging that you don’t want to miss a single detail. However, while captivating, it sometimes falls into predictability; from almost the very beginning, the final decision can be foreseen. I also feel that it tries to convey too many moral messages, which slightly diminishes the enjoyment of the movie."
    },
    {
      "rating": "5/5",
      "review": "Not only the action the drama from this movie worth it to watch"
    },
    {
      "rating": "4.5/5",
      "review": "Beautifully shot, well acted, interesting storyline. What else can ya want in a movie? Ending was a little stilted, but a great film nonetheless."
    },
    {
      "rating": "5/5",
      "review": "This story is very rich. It's show us what we want to. Know about it"
    },
    {
      "rating": "4.5/5",
      "review": "The movie has a way of providing little conviction as to any one individual's motives as its plot develops. The questions as a viewer are answered with compelling pace and satisfaction. Acting and setting(s) of the film are all top notch. The ending was a little incongruent was the direction of the story and I still can't say with conviction that I'm satisfied with it. It's a film that, regardless of whether you like its outcome, will stick with you as a top watch in 2025."
    },
    {
      "rating": "5/5",
      "review": "Solid film that keeps your interest throughout. For those of us not of the Catholic faith, the movie was not only entertainment, but educational as well."
    },
    {
      "rating": "4/5",
      "review": "Filme excelente, mas é importante pontuar que o filme funciona mais pela escolha do elenco do que pelo roteiro em si. Fotografia, trilha sonora, montagem e atuações perfeitas, Ralph Fiennes e Stanley Tucci trazem muita simpatia pros papéis e são quem realmente alavancam a obra. O filme pode ser um pouco lento no inicio mas nada que te faça desistir de assistir."
    },
    {
      "rating": "4/5",
      "review": "What would happen if you sequestered a bunch of the best actors in a room and told them not to come out until they gave Oscar-worthy performances? You’d get Conclave. This fictional story almost feels like a documentary. I found the process and protocols of electing a new pope to be absolutely fascinating, and the performances of Ralph Fiennes, Stanley Tucci, John Lithgow, and Isabella Rossellini make it so all the talking and pontificating maintain the viewers’ interest. Yes, the third act could come across as melodramatic, but Conclave is a religious courtroom drama I wouldn’t mind seeing again."
    },
    {
      "rating": "3.5/5",
      "review": "Sometimes I wonder if people rate these types of movies higher than they should because they are too afraid to admit they aren’t a sophisticated film\\movie watcher. It did win awards for costuming which was shocking because they basically all wear the same thing. The ending was a twist but I saw it coming. It’s not a movie I would ever watch again, but worth seeing."
    },
    {
      "rating": "4/5",
      "review": "The acting was stellar. I loved how the storyline didn't shy away from historical issues in the Catholic Church, and how it showed that in any organization you have very different personalities trying to come to consensus. And in the midst of the intricacies of human nature, there are those trying to adhere to the founding principles of an organization, while also adapting to the modern needs of those they serve."
    },
    {
      "rating": "1.5/5",
      "review": "The ending was like a satire of current times, the only problem is that it was not intended. Sadly, the Long-Building climax lost seriousness due to well-known in modern cinema often repetitive narratives."
    },
    {
      "rating": "5/5",
      "review": "incridible movie, i cant describe this. Its ethereal"
    },
    {
      "rating": "5/5",
      "review": "Absolutely riveting from start to finish. The acting and filming is superb. Excellent!"
    },
    {
      "rating": "5/5",
      "review": "This movie brings me to another situation of a-hard-thinking problem."
    },
    {
      "rating": "5/5",
      "review": "i highly recommend this movie"
    },
    {
      "rating": "5/5",
      "review": "Film is so good. 10/10"
    },
    {
      "rating": "5/5",
      "review": "I Very Enjoy Watching This Movie!!!"
    },
    {
      "rating": "3/5",
      "review": "This was an intellectually stimulating movie with a stellar cast, twists and turns, court intrigue, and dramatic elements. Until the end. The turn at the end was utterly abysmal and quite frankly, ridiculous. We're sick of it."
    },
    {
      "rating": "4.5/5",
      "review": "I just finished watching the Oscars and was disappointed (but not surprised) to realize that Hollywood loves soft-porn rather than religion. \"Conclave\" is a serious film with a real message about the relevance of religion and faith despite the foibles of many of its leaders. I will admit that at times I had some trouble keeping track of the various characters, but in the end the film leads to a conclusion that is both surprising and satisfying. The one other film about the Catholic Church that it is in some ways comparable to is \"Mass Appeal.\""
    },
    {
      "rating": "1/5",
      "review": "Oh my gosh- really?? Such a great, stunning cast- thriller into the depths of the “so called” Catholic realms and their Holy rules? THEN. At the end, it’s all about a Woman, that is Portraying herself as a man which is lying? Seriously, seriously The whole theater I was in, was like,gross, everybody, gasped , laughed, said oh my gosh really, WHAT, REALLY? So sick so sick. What a joke of a movie- that’s up for an Oscar- shows u The trajectory of where the world is going."
    },
    {
      "rating": "4.5/5",
      "review": "Incredible film - great plot, incredible ensemble, stunning cinematography."
    },
    {
      "rating": "5/5",
      "review": "Good."
    },
    {
      "rating": "5/5",
      "review": "A DAMN GOOD MOVIE. LOVE IT."
    },
    {
      "rating": "5/5",
      "review": "Amazing performances and story!"
    },
    {
      "rating": "5/5",
      "review": "A stellar movie. Easily one of the best of the year, even the decade. I highly recommend it for everyone regardless of religious beliefs, feelings about the Catholic Church, or political leanings. This is movie making at its finest!"
    },
    {
      "rating": "5/5",
      "review": "Tense and oddly prescient a peek into the highest ranks of the faith and how the princes of the church are more like you and me in the pews than saintly. Well performed with an excellent rhythm."
    },
    {
      "rating": "3.5/5",
      "review": "Ralph Fiennes Brilliant not a bad script but the film does have a few continuity errors and the step by step push to the obvious ending is unfulfilling and contrite. Should it have an Oscar? Ralph definitely yes but the rest no"
    },
    {
      "rating": "4/5",
      "review": "This film was a fantastic blend of brilliant acting, immersive cinematography, and a tense atmosphere. Ralph Fiennes and Stanley Tucci gave powerful performances, and I loved the mystery at the heart of the plot, it kept you on edge and draws you into the mysterious world of the Vatican. A must watch movie!"
    },
    {
      "rating": "1/5",
      "review": "Slow and boring. I know the aim was “thought provoking” but really it shows clergy are flawed. The acting was awesome but the plot and pacing were disappointing."
    },
    {
      "rating": "3/5",
      "review": "It’s a good watch, but you’ll know how it ends after half an hour."
    },
    {
      "rating": "5/5",
      "review": "This is good. Sister Agnes doesn't say much, but what she says, says a lot. The plot twist at the end, magnificent."
    },
    {
      "rating": "1/5",
      "review": "Absurd ending that ruined the entire movie. Waist of time due to Hollywood shoving their political agenda down our throats."
    },
    {
      "rating": "4/5",
      "review": "es buena, sin más ,hubieron actores muy mal desaprovechados. me intrigó la historia, muy buena la trama, como el suspenso me puso a pensar quien seria el siguiente en la linea , merecía un mejor final."
    },
    {
      "rating": "4.5/5",
      "review": "Waw amazing luv, i like it so much"
    },
    {
      "rating": "5/5",
      "review": "Bad and naughty cardinals will be put into the pear wiggler to choose the new pope. Visually stunning, superb casting, beautiful musical score."
    },
    {
      "rating": "4.5/5",
      "review": "I don't understand how a movie can feel both so monumental in terms of stakes and themes, yet so intimate and contained with regard to character and logistical scope. Someone needs to tell Edward Berger to chill, man, lol. This man is swiftly becoming one of the most impressive filmmakers working today and it's by no small margin. To pivot from the sobering, almost apocalyptic feelings brought about by \"All Quiet On The Western Front\" to the more cerebral and world-affirming stylings of \"Conclave\" is one thing -- but to make both feel as consequential and as thematically cathartic as the other (two completely different movies!) is just amazing talent at work. Impeccable acting here, too. Ralph Fiennes carries the weight of this on his whole frame and he deserves every award he's been nominated for, in my opinion. Though, everyone does such a damn good job in this, you could freakin' blink and surely miss a great performance from a background actor or something. A collection of objectively thought-provoking ethical case studies, strung together with brilliant storytelling, set against the backdrop of organized religion. . .AND it doesn't ultimately feel condescending to any particular group of people? One of the best films of this past year, hands down."
    },
    {
      "rating": "5/5",
      "review": "Great performances. Wonderful cinematography."
    },
    {
      "rating": "3/5",
      "review": "Very slow. It had good acting, but it put me to sleep."
    },
    {
      "rating": "4/5",
      "review": "A little slow at times but the performance never loses your interest. Great movie."
    },
    {
      "rating": "5/5",
      "review": "The acting was great, the story was interesting, and the ending was a surprise."
    },
    {
      "rating": "0.5/5",
      "review": "Very boring with the DUMBEST ending ever. Worse than Lost Don't waste your time, guaranteed you will be VERY disappointed."
    },
    {
      "rating": "4.5/5",
      "review": "An absolute master class in acting, fascinating relationship and dialogue driven - really enjoyed it"
    },
    {
      "rating": "4/5",
      "review": "I personally watched it because it seemed like a more intense Two Popes(great movie) but it turned out to be a suspenseful story of the politics behind picking a Pope. What I will add is that I wanted more character development or possibly more about the Pope that's padded and his relationship with others. An extra 20 minutes of character development or putting a bow on what the future of Benítez will face would add enough substance to make it a 5 star."
    },
    {
      "rating": "2/5",
      "review": "Possibly the most disengaged I’ve ever been watching a movie. No reason for me to care who becomes Pope, no characters, no stakes, just a boring slog. Putting tense music in the background isn’t enough for me to feel tense, you’ve got to earn that through writing. Absolutely baffling how it’s got such a positive reaction."
    },
    {
      "rating": "5/5",
      "review": "This film is really great! I love the storyline."
    },
    {
      "rating": "3.5/5",
      "review": "Was pretty good, but had a sudden, not so great ending"
    },
    {
      "rating": "5/5",
      "review": "amazing movie, you guys must watch it"
    },
    {
      "rating": "5/5",
      "review": "A good movie, with an uncomplicated storyline that is easy to understand."
    },
    {
      "rating": "5/5",
      "review": "\"Conclave\" is a highly regarded political thriller that offers a compelling and insightful look into the process of papal election. It is praised for its strong performances, tense atmosphere, and exploration of complex themes. translate bahasa indonesia"
    },
    {
      "rating": "4.5/5",
      "review": "Ini film sangat membantu kita dalam memikir Film ini sangat bagus"
    },
    {
      "rating": "5/5",
      "review": "Great movie, i like it"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Lots of twists and turns photography and music are fantastic. Fantastic. I expect a lot of awards out of this show."
    },
    {
      "rating": "5/5",
      "review": "Conclave is a gripping and suspenseful political thriller that masterfully unveils the hidden power struggles, secrets, and moral dilemmas behind one of the world's most sacred traditions"
    },
    {
      "rating": "5/5",
      "review": "Brilliant script and performances from everyone in the cast. I thought the ending was quite satisfying too."
    },
    {
      "rating": "3.5/5",
      "review": "I watched this film literally on the small screen, flying from Sydney to Los Angeles in February 2025, so the full cinema experience alluded me this time. I am, however, a fan of Ralph Fiennes, and in this sense didn’t see much that extended him beyond his usual great performances. Stanley Tucci sounded exactly like he did on his “Searching for Italy” series, Isabella Rossellini gets too few lines of dialogue and John Lithgow could have had better lines. I sensed the plot twist early, so kinda ruined the mystery for myself by expecting it. A good film that you will enjoy but not one you’ll remember a year from now."
    },
    {
      "rating": "4/5",
      "review": "Somewhat slow but the acting was great. Storyline was riveting and that surprise ending was worth the watch."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie. I loved every second. The intrigue, the politics, the strategy."
    },
    {
      "rating": "5/5",
      "review": "I loved the movie and found it exceptional on many levels. The storyline was contemporary, yet centuries old, and the internal politics were intreguing and suspenseful."
    },
    {
      "rating": "5/5",
      "review": "The most honest depiction of the Catholic Church I have seen in years, the bad and also the good. The acting is superb, all of them, you really get to believe these actors are the real thing. And the mis en scène just out of this world. When the old world, old fashioned acting meets new technology, seamlessly, you get Conclave."
    },
    {
      "rating": "4/5",
      "review": "This is what good writing looks like! No sex scenes. No violence. No cussing. No billion-dollar CGI effects. No singing. Sounds boring. Yet the story (and brilliant actors) keep you wondering what's going to happen next and how is it going to end. Hollywood needs more movies like this. (I subtracted 1 star because it's about 15 minutes too long. There are several scenes of just the back of Ralph's head, while he walks and walks and breathes deeply through his nose.)"
    },
    {
      "rating": "4/5",
      "review": "Gossip Girls with the Pope's"
    },
    {
      "rating": "5/5",
      "review": "I know little about the intricacies of the Catholic Church, but have always found the traditions and history interesting. I don't know accurate this film is, but it feels like it is, and the political intrigue -- do we go back to the past, or embrace a new, more open Church -- make for great drama. The cast is perfect, and the cinematography is perfect. There is a shot of the cardinals sitting in a darkened theater, lit so beautifully that I had to go back and re-watch the scene to listen to the dialogue, as I was captivated by the lighting. In 4K, this film is gorgeous. I'm glad this film received a BP nomination. \"Anora\" seems to be a lock with the oddsmakers but if this one sneaks through, I would not be surprised. (#461 in my \"watch all BP nominees\" bucket list)"
    },
    {
      "rating": "2/5",
      "review": "Not a bad story but the ending was awful and came from out of nowhere and to let the pope be that was awful."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie, lots of intrigue. Portrays the Catholic church as it truly is - a purely Satanic cabal. If you ever doubted the Pope was a servant of Lucifer then this movie reveals that to you. If you didn't hate the Catholic church before this then it will cement the truth in your mind."
    },
    {
      "rating": "4/5",
      "review": "Great performances from the actors, the story is shocking and original for me, I was not expecting it until the very end, I was laying, and I sat suddenly in surprise when the last part of the movie goes (I don't want to spoil the story). But it has also a slow rhythm, I get it is made for the viewer to know and understand why the characters are how they are, what is the line of decision, make you feel how long and exhaustive the conclave is... but certainly it is a little slow. Still, good idea, nice movie and perfect performances."
    },
    {
      "rating": "5/5",
      "review": "Cinematography 10/10 Acting 15/10 Story 20/10"
    },
    {
      "rating": "4/5",
      "review": "Certainly one of the stronger offerings from 2024. A twist so left field, even the oracles among us could not have foreseen. Fiennes is electric, but when is he not?"
    },
    {
      "rating": "5/5",
      "review": "Overall, this is a great movie"
    },
    {
      "rating": "5/5",
      "review": "Superb acting and writing. Flawlessly executed. Music was also beautiful."
    },
    {
      "rating": "4.5/5",
      "review": "I enjoyed the journey all the way to the great ending. Wonderful cast...well acted."
    },
    {
      "rating": "5/5",
      "review": "It is refreshing to see a protagonist who has no clear goals other than to execute his job and serve god, and yet is still bound by his humanity. I love that this film does not fall into the stereotypical tropes that a drama centered around a religious community usually does."
    },
    {
      "rating": "0.5/5",
      "review": "I THINK SO BORING, MISTER THIS FILM NOT RECCOMENDED"
    },
    {
      "rating": "5/5",
      "review": "This is beautifully done film, with great performances from its A list cast."
    },
    {
      "rating": "1/5",
      "review": "Watching paint dry would be more riveting than this movie. A group of elderly men in frocks writing names on little cards, it was something akin to old men filling out their betting slips in a bookmakers looking for that illusive winning nag. John Lithgow’s expressions reminded me of an earlier part he played in The Twilight Zone as he looked out the airplane window only to see a gremlin throw debris into the jet’s engine. And what a finale! The man they finally elected as pope wasn’t even a man, God forbid he was a… God only knows! Totally ironic for a church which doesn’t even allow women to be priests. As Patrick Swayze said to Whoopie Goldberg in Ghost, “What a crock of 💩”."
    },
    {
      "rating": "3.5/5",
      "review": "A very good film and the acting is great especially Fiennes & Rosellini. The directing and score are great. However the only let down is the pace of the film, it could've had more drama and intensity, especially with the unexpected twist."
    },
    {
      "rating": "4/5",
      "review": "Suspenseful, entertaining and insightful, with a surprising twist at the end."
    },
    {
      "rating": "4/5",
      "review": "Well acted and moved the story align well. Surprising twists at the end."
    },
    {
      "rating": "4.5/5",
      "review": "Me parece una pelicula muy buena, con un desarolllo de personajes muy bien logrados, la banda sonora de adentra a este drama y a parte los diferentes planos de la película le agregan profundidad. El final me encantó, super inesperado pero lo creo muy bien logrado."
    },
    {
      "rating": "4/5",
      "review": "A brave film exposing the inner sanctum and the workings of the Vactican. Tremendous cast doing a near perfect job."
    },
    {
      "rating": "5/5",
      "review": "Really surprised about how much I enjoyed this movie. Not a fan of 'Pope' or 'Catholic Church' movies, but the plot and cast really made this an exciting movie. Great twist in the ending. Couldn't have been any other outcome. Highly recommend!"
    },
    {
      "rating": "4/5",
      "review": "Interesting plot twist at the end. I leave movies happier when Im wrong about the conclusion. Im also down for a coherent mystery/suspence movie. Fiennes is terrific as alway. Rest of the cast did their thing too."
    },
    {
      "rating": "1/5",
      "review": "Could have been a good movie"
    },
    {
      "rating": "2/5",
      "review": "This movie hums along as a thriller in which each party maneuvers for his own benefit. Then, the ending makes such an awkward left turn that feels like it was written for a completely different movie. THEN the last scene makes it even more frustrating with a pointless ending. What am I missing?"
    },
    {
      "rating": "5/5",
      "review": "Great movie! I really recommend it! Great message"
    },
    {
      "rating": "4/5",
      "review": "Ending felt really rushed - and the twist was completely unnecessary - which was a pity as the rest of the film was wonderful"
    },
    {
      "rating": "1/5",
      "review": "Slow and boring. Amazing cast but the acting was only sub-par. Combine that with a plot that goes absolutely nowhere and all you have a is a shell of a movie with an ending that leaves you disappointed and cold."
    },
    {
      "rating": "4/5",
      "review": "Very sophisticatedly showing problems the world is dealing with represented into a catholic church in a most delicate moment - when new pope needs to be elected and all that a church stand for maybe needs to be either redefined or question again. Most interested is the moment where, as always in huge institutional systems, everting is also happening isolated and untouched from the real world."
    },
    {
      "rating": "4/5",
      "review": "Outstanding acting by all with an intriguing story that pulled me in and had such interesting developments."
    },
    {
      "rating": "5/5",
      "review": "Easily one of the best movies of the year, acting is superb and the plot twist at the end unexpected!"
    },
    {
      "rating": "1/5",
      "review": "Seriously, don't waste your time. I was waiting for some kind of crescendo, and what I got was a man who was born with ovaries."
    },
    {
      "rating": "2.5/5",
      "review": "Conclave could be best described as an average movie. While some dramatic elements left you wanting an answer, the answers came too quick and it seemed like the script wasn't really hashed out or given opportunity to explore. The cinematography and acting from most of the cast (Fiennes, Lithgow and Msamati being standouts) was the highlight of the film, though this clearly was not a role for Stanley Tucci."
    },
    {
      "rating": "1/5",
      "review": "Watching this movie was great, it was dynamic, different and interesting . That is until one gets to the boring, easy way out end. It’s a fraud that this movie has 93% and quite frankly the rotten meter is clearly broken. Hollywood is just done."
    },
    {
      "rating": "3.5/5",
      "review": "A great film all the way up until the cheap shock value ending, a great film but such a shame with the end. Would have been 4.5/5 star"
    },
    {
      "rating": "4.5/5",
      "review": "Excellent direction, acting and script (though the plot may sound a bit contrived, the actual history of the Vatican suggests it's spot on.) Never drags and though your sympathies may sway one way then another, you're always engaged."
    },
    {
      "rating": "3/5",
      "review": "Acting is superb but the movie drags along a little too slowly for me. I found the ending to be a sell out move for shock value."
    },
    {
      "rating": "5/5",
      "review": "Palace intrigue. Malfeasance for from the inside. Whether or not Conclave depicts what really happens when a new Pope is chosen is immaterial. The acting is superb and the narrative tension stays intact all the way to the end. And what a surprise. I never would have guessed the ending and I'm sure many Catholics would be appalled. The sentiment of the ending is meaningful that we are who we are fland that shouldn't be questioned even if you live between two worlds."
    },
    {
      "rating": "5/5",
      "review": "A fantastic film and Ralph Fiennes is outstanding as the lead, though it's an ensemble story. Despite being two hours long and on a subject I know little about, I found the story accessible and absorbing. It was as though a secret world had been opened up. And the cinematography is stunning, it really adds to the tension."
    },
    {
      "rating": "3/5",
      "review": "Visually spectacular. Superb acting."
    },
    {
      "rating": "4.5/5",
      "review": "Too often the church and the order is seen as these spiritual men placed on a pedestal (especially the pope). This film shows us that all members of the ordained are just like us - flaws and all. It humanizes the church, its members and the process of electing the next pope. And in the end it’s ironic that the one elected is the most human, or in the case of this film, the least human of all. (90%)"
    },
    {
      "rating": "4/5",
      "review": "Tutte le recensioni che ho sentito fino ad oggi sono critiche al finale. Tuttavia, il colpo di scena controverso in Conclave potrebbe essere visto come un ricondando un finale di O. Henry, uno che offre un colpo di scena ironico e inaspettato che ricontestualizza l'intera storia. Il colpo di scena rimodella la comprensione del pubblico degli eventi che lo portano, aggiungendo uno strato di ironia e complessita morale."
    },
    {
      "rating": "3.5/5",
      "review": "Deeply moving and wonderful acting, but specifically written to induce the notion of religious hypocrisy, showing how even the innocent come so close to being trampled under foot. Perhaps that is a dangerous and unnecessary aspect of story telling as impressionable people are all too often unable to distinguish fiction from facts, and struggle to delineate between isolated case specific incidence and broad stroke stereotypes. But otherwise a beautifully presented display of theatrical giants doing their very best stuff."
    },
    {
      "rating": "5/5",
      "review": "Excellent acting and writing. Gives a balance between realistic and unrealistic view of the workings of the church. Allows you to judge for yourself."
    },
    {
      "rating": "5/5",
      "review": "A big Ralph F fan Conclave did not disappoint."
    },
    {
      "rating": "4/5",
      "review": "Excellent performances leading up to a ho hum twist but noe the less very entertaining"
    },
    {
      "rating": "4/5",
      "review": "You have to bear with this. The plot is not particularly adventurous and almost predictable in places. It is the acting that makes it worth watching. Especially Ralph Fiennes."
    },
    {
      "rating": "4/5",
      "review": "I thought I was gonna be bored by the subject matter, but it was actually interesting and entertaining. Of course the acting was top-notch with this cast. This deserved the best picture nomination. Overall, a solid film."
    },
    {
      "rating": "4/5",
      "review": "This movie was incredible, then it throws you a curve back in the last minute that felt tacked on for mere shock value."
    },
    {
      "rating": "4/5",
      "review": "Wow! Quality acting, good storyline. I was surprised i enjoyed it so much as for the context of the movie."
    },
    {
      "rating": "3/5",
      "review": "A Good movie up to the final reveal which took the film from great to trying to shock and make a statement. Basically the ending ruins the film but it is greatly acted and it will keep you invested"
    },
    {
      "rating": "5/5",
      "review": "I watched 'Conclave' at home with my wife, and when the surprise twist dropped, we literally had to pause the movie and walk around to calm down. It was one of the most shocking twists I've ever seen, and I never would have expected it. I highly encourage everyone to watch it just for that aspect—the way they hid the surprise and then revealed it is truly mind-blowing. It makes you question your own morals in the most unexpected ways."
    },
    {
      "rating": "5/5",
      "review": "Suspenseful, unbeatable stellar cast, overarching themes through history! Overall a great movie!"
    },
    {
      "rating": "5/5",
      "review": "Loved it. Great cinematically. More so integrity of the story, especially in our social state of unrest."
    },
    {
      "rating": "5/5",
      "review": "Absolutely phenomenal movie! Great acting and deals with very pertinent issues in and outside of the church."
    },
    {
      "rating": "4.5/5",
      "review": "As a wise president once said no shrine no temple is exceptional from a polluted society. So in a static or a failure most precious certainties gets reduced to a dust of formality. And when a movie can explore many worldly topics and take you in a suspenseful journey while mesmerizing you with gorgeous cinematography what you witness is a classic. Fiennes's performance is flawless and the rest of the cast is wonderful too. From monumental arches and mighty hallways to the mossed outer walls visuals carry a depth. Great special effects and audio. Conclave shocks many foundations to give a new song to the souls such as the three birds that fly out to the morning before curtains close."
    },
    {
      "rating": "4/5",
      "review": "\"The Name of the Rose\" for the modern era, Papal politics and the Church's obsession with both sex and gender are brought to the fore in the boldest way possible. Ralph Fiene and John Lithgow were masterful foils, and the twist ending will keep you pondering for hours."
    },
    {
      "rating": "5/5",
      "review": "Great story with lots of suspense"
    },
    {
      "rating": "4.5/5",
      "review": "La que posiblemente sea la película de la temporada de premiaciones del 2025, se mete al corazón de una decisión que siempre ha sido una caja negra, la elección del Papa. Revelando los enigmas detrás de ello, al lado de toda la politiquería y golpes por debajo de la mesa que los miembros de la Curia Romana se dan para sesgar la elección acorde s sus intereses. Intrigante y ciertamente entretenida, aunque para mí el desenlace queda a deber."
    },
    {
      "rating": "1/5",
      "review": "Garbage! Great cast. Poorly written. Story is hard to follow and some events have no foundation. And the ending is 100% BS. 1st - a Cardinal that is 100% unknown to ANYONE in conclave is elected Pope. Then - as if that's not dumb enough, they add that he is a hermaphrodite. Stupid"
    },
    {
      "rating": "4/5",
      "review": "The setting is pretty succesful. Each aspect hangs together. The music, the angles, places and more fit one another to serve a whole. The characters are okay. However, the story lacks major incidents that most people look for in a movie. This might not be a minus because the movie depends more on thoughts rather than actions, meaning that there are actions that get both the audience, and most importantly, the characters to just think. Besides, this could be what would be expected from a movie covering a conclave of voting for the next pope."
    },
    {
      "rating": "1.5/5",
      "review": "Proof that 2024 Best Picture nominations just aren’t good."
    },
    {
      "rating": "5/5",
      "review": "I went into this movie a bit apprehensive (as a former member of this church). I found it thought provoking and a really great ending that made one think........and I kind of felt like it was an \"I got cha moment\" that kind of went after the thought process or lack of it regarding a certain way of doing things in the church. I don't want to give the movie away to those who are reading this and have not seen it yet. Enjoyed it immensely and thought the acting was fantastic!"
    },
    {
      "rating": "4/5",
      "review": "Amazing movie I really liked it"
    },
    {
      "rating": "5/5",
      "review": "A bunch of men walk in and of a room and vote. Thats pretty much it and yet it is one of the finest films I've ever seen. It is taut, mesmerising. Best ever performance by Ralph Fiennes."
    },
    {
      "rating": "4/5",
      "review": "Conclave brings to light the political game involved in choosing a new pope, which can be easily compared to presidential elections, for example. Watching the excellent actor Ralph Fiennes lead the election of the pope shows that it is not an easy choice and that it has great weight for all Catholic Church faithful around the world. However, it ends up coming up against the personal dilemmas of each candidate and shows how human beings put their own interests first. At first, it may seem like a criticism of the Catholic Church, but on the contrary, it wants to show that, despite the adversities, the church remains firm and its ideals intact. It is not a film with a surprising and action-packed story, but it keeps the audience's expectations high with each vote. Rooting for Ralph Fiennes' character becomes the easiest path, but the film gives us an ending that is above that."
    },
    {
      "rating": "4/5",
      "review": "Thoroughly written sharpened to timely, politically brewing extent, finely directed that heightens the papal drama to considerably respectful and deservingly correct heights, and impeccably performed by flawless embodiment, this is another triumph for Berger to showcase peaks and intellectual drive towards an astonishing reception. (A-)"
    },
    {
      "rating": "5/5",
      "review": "Definitely one of the best movies of the last year, since I don’t think Wicked is going to win best picture in the Oscars I hope that this one does."
    },
    {
      "rating": "4/5",
      "review": "Completely madness. The film manages to convey the chaotic and tension-filled atmosphere, with this determination over who will become pope, it is at the same time distressing and tempting. With each scene of ironies and fights, and of course, everyone doing their best to stab each other, it shows the atmosphere of dispute and ambition. And there is an almost palpable sense of the pressure and the power game that occurs during the conclave. The unfolding, the stories that are told, the signs that appear throughout the film and the anguish over every vote that happens and is not concluded, generate that anxiety and add depth to the film, attracting the audience even more to the narrative."
    },
    {
      "rating": "5/5",
      "review": "Kept me up for 2 hours past my bed time and it was worth watching. It opened the envelope of the politics that come with this kind of positions (Papacy)"
    },
    {
      "rating": "2/5",
      "review": "Stellar casting and strong performances can’t save this languid film, which sleepwalks to an ending unworthy of its few saving graces."
    },
    {
      "rating": "4.5/5",
      "review": "It’s a film that is pure art in every category: cinematography, music, editing, costume design, and performances. While it’s true that the ending feels a bit forced, it’s still worth appreciating this beautiful piece."
    },
    {
      "rating": "1.5/5",
      "review": "Awful. If like “The West Wing” took place in the Vatican with “ A Crying Game” ending. Offensive , and I’m not even a big gung ho catholic or anything."
    },
    {
      "rating": "5/5",
      "review": "A tour de force. A collection of actors worthy of the setting. The Vatican with its cold marble backdrop juxsiposed with the bright red robes of the Cardinals makes for a dramatic stage. Ralph Finnes drives the conclave to elect a Pope with stunning meticulous detail. And challenges to his work abound and surprises never cease. Stanley Tucci provides what Stanley Tucci normally provides in front of the camera. Fine acting with a tinge of sarcasm and humility. The directing is stupendous and the art direction and set design gives you a sense of slight claustrophobia. This only heightens the experience."
    },
    {
      "rating": "5/5",
      "review": "This is an incredible movie, with absolutely mind-blowing cinematography and dramatic score, this movie gives the best deep-dive into what goes on in a conclave. The twist at the end was completely unexpected, but yet was good food for though. All-in-all, five stars."
    },
    {
      "rating": "5/5",
      "review": "Conclave is a tightly wound thriller with a career high performance from Ralph Fiennes. The cast is stellar across the board, delivering believable and interesting performances. Taking a true-to-life look inside the election of a new Pope, Conclave isn’t afraid to be controversial and question the validity of the Church and its leaders altogether. It is one of the best and most important films of the year!"
    },
    {
      "rating": "4/5",
      "review": "Tucci, Fiennes, Lithgow, what's not to like. I'm a huge fan of catholic church intriguing plots and this one is very good. Few moments I thought where \"meh\",. Plot twist at the end is ok(ish) but all in all well worth a view, and it's beautifully shot, Fiennes and Tucci are as usual superb."
    },
    {
      "rating": "3/5",
      "review": "Grandes atuações, uma ótima ambientação e uma banda sonora apelativa não são suficientes para fazer deste filme uma obra prima. Personagens genéricas e sem profundidade, um roteiro previsível e um final totalmente anticlimático estragam um filme que poderia ser considerado um dos melhores do ano. O filme está tão preocupado em fazer um comentário político que, além de não conseguir transmitir a sua mensagem, deixa de lado outros elementos mais interessantes na trama. (avaliação: 6/10)"
    },
    {
      "rating": "4/5",
      "review": "In such a divided world we live in this movie is a must watch. Keeps your attention all the way."
    },
    {
      "rating": "1/5",
      "review": "Slow as molasses with just enough intrique to keep you watching til the final selection. Then...bam, they hit you with the implausible, politically-correct conclusion...the newly elected Pope is actually a woman! Well, of course he/she is. So disappointing."
    },
    {
      "rating": "5/5",
      "review": "This is one of the best adaptations of the books. It is a perfect thriller, compared to the current Disney or Marvel movies. The cast in the movie is simply legendary, the acting of the cast in the movie is perfect. The plot in the movie is solid and interesting throughout the movie. In my opinion, this movie should win an Oscar."
    },
    {
      "rating": "5/5",
      "review": "Liked the movie very much"
    },
    {
      "rating": "4.5/5",
      "review": "It was an intriguing movie and well worth seeing"
    }
  ]
}