{
  "movie_name": "Mickey 17",
  "reviews": [
    {
      "rating": "2.5/5",
      "review": "It's hard to describe this one. Alien but a comedy? I'd say my most meh of 2025"
    },
    {
      "rating": "5/5",
      "review": "Honestly I had so much fun watching this. The book it's based on is hardly Isaac Asimov. I honestly think it tidied up a few things and fleshed out a few characters. Mickey 17 is more sympathetic than Mickey 7, and the films depictions of female characters are again, way more fleshed out and interesting. It's chaotic and hilarious. Give it a go."
    },
    {
      "rating": "2/5",
      "review": "Robert Pattinson wasn't bad in this movie. At one point, he's playing alter egos which can be hard to pull off. His main character (Mickey 17) wasn't the ballsy type that we were expecting in the beginning (knowing that he chose the bravest job on the ship). He played a timid and gentle soul - which we're not use to seeing. His acting was believable. The humor wasn't there. If anything, you're laughing because most of the scenes and characters were bad. I couldn't finish the last 49 mins of the movie. I wish they chose a different cast for this movie. I think it would have elevated it a lot more."
    },
    {
      "rating": "4/5",
      "review": "I am not sure why this movie bombed as badly as it did. I watched it last night and it was thorougly enjoyable. It poses the existential questions about life, death and does it all have meaning if you can be \"reconstructed\" and have your most recent memories restored. Pattinson is great, but Mark Ruffalo provides most of the comic relief as a wannabe dictator. Go watch it. Cheers."
    },
    {
      "rating": "5/5",
      "review": "Felt original with a lot of interesting ideas. great cast. Great for sci-fi fans."
    },
    {
      "rating": "3/5",
      "review": "Bong Joon Ho is back to the big screen with what should feel like a love letter to his sci-fi fans, the movie, however feels like something a Bong Joon Ho's copycat will make. While 'MICKEY 17' wasn't a bad watch, it still had it's bumps, although, this movie was steady and quite engaging to an extent, it was not enough to make it an amazing cinematic experience. The movie started out well, but felt too dragged to be enjoyed. This movie, however, was pulled out of it's icy rubbles by Robert Pattinson's power-house dual performance proving once more that you cannot get enough of Pattinson. Naomi Ackie also made up for the length by giving us one of her best performance yet. The ensemble was great. Bong Joon Ho also directed this movie to a solid ground but it just wasn't enough to keep this movie on air. Bong Joon Ho's 'MICKEY 17' was a decent watch, but it didn't quite feel like the Bong Joon Ho movie we are used to which at the end caused this movie to give a mid cinematic experience!"
    },
    {
      "rating": "3.5/5",
      "review": "Love how different this movie is. The tone is a little all over the place, but it is very entertaining and I would highly recommend."
    },
    {
      "rating": "4/5",
      "review": "A fun sci-fi tale with a pleasantly positive ending. Mark Ruffalo and Robert Pattinson are incredible, with Pattinson doing such a good job that he was almost unrecognizable."
    },
    {
      "rating": "3.5/5",
      "review": "Wasn’t bad. Pleasantly surprised with how well done it was. Worse part of the movie is definitely Mark Ruffalo. He was the wrong casting choice for the role he had"
    },
    {
      "rating": "5/5",
      "review": "Another hard-hitting tough one from the great director, however very rewarding to the end."
    },
    {
      "rating": "3/5",
      "review": "Started off promising, quirky, satirical. Really showcases Robert Pattinsons acting range! Then it got a bit long... bit too weird. Overly convoluted and wanted it to end."
    },
    {
      "rating": "4.5/5",
      "review": "Wonderful! A Stella cast al on top form, an interesting and different story, and of course directed by a master!"
    },
    {
      "rating": "1.5/5",
      "review": "Starts promising, then falls further into boringness and becomes incredibly drawn out. Not at all great."
    },
    {
      "rating": "1/5",
      "review": "Complete garbage! This movie was the most boring, illogical mess I think I’ve ever seen. Nonsense"
    },
    {
      "rating": "1/5",
      "review": "Was trying to watch a movie not a ham fisted political commentary. This is why the left will continue to loose."
    },
    {
      "rating": "2.5/5",
      "review": "Robert Patterson did an amazing job. I read the book And I know not to judge movies by the book. I really like the book but this movie Did not do it for me. Like others have mentioned the second half drags. I knew it would be weird but they really left out a lot of the stuff that made the book interesting. Definitely disappointing for me."
    },
    {
      "rating": "3.5/5",
      "review": "Though slow to start and lacking a truly impactful climax, Mickey 17 may not represent Bong Joon-ho at his finest, but as a piece of conceptual sci-fi, it still manages to offer fresh and thought-provoking ideas to a genre in need of them."
    },
    {
      "rating": "5/5",
      "review": "This is such a different movie/concept “expendable”. Good cast. Robert Pattinson is so versatile."
    },
    {
      "rating": "1/5",
      "review": "The truth is this movie sucked!!!!! It should’ve went straight to TVs like they do with the Hallmark movies. I’ll just put it to you. This way. Sharknado is way more better than this."
    },
    {
      "rating": "2/5",
      "review": "This movie might have performed well with a PG-13 rating as none of what made it R-rated was necessary anyways. Also, it’s good but not great."
    },
    {
      "rating": "4/5",
      "review": "Vale la pena ver, y cuestionarse cosas que no solemos preguntarnos, pero que son una realidad actual."
    },
    {
      "rating": "1.5/5",
      "review": "slow and boring. Any message gets lost in the slowness."
    },
    {
      "rating": "2.5/5",
      "review": "I'm not sure what this was. Pattinson was good, but this movie was just bizarre and not really all that interesting. I'm not sure why this was even made into a movie or why some of these top actors would take this project on. Not great. Not worth paying for. Once this is free on one of the services, that would be the time to give it a look."
    },
    {
      "rating": "4/5",
      "review": "I liked the idea of the expendable clones but in the middle of the film it turned into a knock off of nausicca in the valley of the wind. The whole second half of this movie was just like that anime movies ending, almost exactly the same 👎 I’m just tired of watching remakes or derivative garbage."
    },
    {
      "rating": "4/5",
      "review": "A little longer than it needed to be but it was fun and R.P. was excellent as always."
    },
    {
      "rating": "4/5",
      "review": "Fun and different. slow toward the end."
    },
    {
      "rating": "4/5",
      "review": "Mickey 17 is an obscurely funny movie. I say that because even though I actually enjoyed watching this movie. Mickey 17 is very weird. I had very high hopes for this movie based on it being Robert Pattinson’s next big project. But especially after seeing a trailer in theaters, it looked like it had the potential to be a classic. But I mean you could say that about almost any movie nowadays, even though in most cases it never pans out in the end. Read Full Review @ ajwallacereview.com"
    },
    {
      "rating": "0.5/5",
      "review": "Was pretty excited for this movie but it was unwatchable, couldn't finish it. Got real boring real fast, some plot points didn't make sense, and the over-the-top Trump impersonation from Mark Ruffalo felt so shoehorned in and cringe. Good cinematography though I guess."
    },
    {
      "rating": "4.5/5",
      "review": "It had a Hitchhiker's Guide to the Galaxy satire vibe, but much darker. Quite original dystopia and I love dystopian, but I can definitely see why it wouldn't be everybody's cup of tea."
    },
    {
      "rating": "3.5/5",
      "review": "The character development is good, but the movie needs a sequel."
    },
    {
      "rating": "1.5/5",
      "review": "The whole movie is a waste of time. None of the characters are relatable. I didn't care about any of it. Save your time. Watch something else."
    },
    {
      "rating": "1.5/5",
      "review": "I saw this as a double feature with Minecraft, and somehow, Minecraft had less cringe than this movie."
    },
    {
      "rating": "4.5/5",
      "review": "Loved the dark humor, loved the originality, overall it was a very fun watch."
    },
    {
      "rating": "1.5/5",
      "review": "Horrible. This movie was the slowest way to nowhere ever. Mark Ruffalo was a waste of money and time. Such a horrible job. The whole thing is a 2 hr cringe fest that isnt funny or creative. Its completly ruined by trying so hard to be weird."
    },
    {
      "rating": "1.5/5",
      "review": "This is essentially a bottom tier SNL 'Let's make fun of Trump' sketch stretched out into a full length movie. I couldn't actually tell you how long it was because it was getting so tiresome I switched it off sometime in the 3rd act. It's a shame because the premise was interesting; the lead role was played perfectly. This isn't a case of left vs right, if there's a politician to be made fun of, I'm all for it. However this was executed with such low effort and writing craft I couldn't reward it with any more of my time. If I wanted a mediocre rehash of why all the cool kids hate Trump I'd just go to the in laws for dinner, at least they'd wash the dishes. I mean seriously, this movie goes to enormous lengths to make the Trump character *so* much like the real Donald. However they shy away from a 1:1 impression so you're left with this uncanny valley Trump, its really quite unnerving to watch. They should have just deepfaked it and maybe then it would be funny or even memorable. Probably not"
    },
    {
      "rating": "2/5",
      "review": "I usually love scifi, even bad scifi. This was only so-so. My reasons ... odd creative decisions. It felt like someone who hated scifi made this as a joke/political fantasy. There were some good points, but there were also lots of bad points. It could of really been a good movie, but it was not."
    },
    {
      "rating": "4.5/5",
      "review": "Fun scifi movie with good acting and script."
    },
    {
      "rating": "4/5",
      "review": "It was a good movie to watch on ailen invasion. Sci-fi. It was definitely a recommended to watch if ailen and creepers creatures and other ailen stuff. The content was nice and cgi is good! The cast were good."
    },
    {
      "rating": "4/5",
      "review": "I'm a huge fan of Bong Joon Ho. This movie was fun but I felt it was trying to hit too many themes, which left it not nailing any of them. The set pieces will make it a great movie to have on in the background while cleaning the house."
    },
    {
      "rating": "4.5/5",
      "review": "It's imperfect, but we should keep giving Bong Joon Ho money to make more"
    },
    {
      "rating": "4/5",
      "review": "Mickey 17 is a visually glorious and surprisingly romantic film that caught me totally off guard. It nails the sci-fi aesthetics and the look of the movie really helped sell the premise for me. Its not revolutionary or wildly innovative but the story is interesting and grounded in deeply human themes. Robert Pattinson gives an amazing performance (once you get past the slightly goofy character voice) and effortlessly carries the emotional and existential weight of the film with impressive charm. The first act is by far the strongest: compelling, mysterious, and tightly paced. It sets up a fascinating world and a main character that had me fully engaged. But it does seem to fumble around as the movie goes on... especially in the final act. While I really like Mark Ruffalo and I think he brings his all to this role, his character (along with a few others) lacks subtlety and depth in a way that I felt cheapened the story. Nevertheless, the journey is engaging and rewarding... especially any time Naomi Ackle and Anamaria Vartolomei are onscreen. Overall, it's a fun and engaging watch with a surprisingly romantic core. I'd easily recommend."
    },
    {
      "rating": "5/5",
      "review": "Eu amei o filme,nele eu \"vi\" algumas \"referências\" q eu queria MT ressaltar pois achei geniais,quando o Marshall levanta o dedo indicador parece muito a saudação nazista,refletindo a influência q uma pessoa pode ter sobre as outras sem ter responsabilidade o suficiente,ainda mais uma pessoa famosa q não tem nenhuma qualificação para exercer um papel tão importante,mesmo sem querer,além disso quando a nasha fala dos nativos parece(na minha visão) uma referência as invasões de terras invocadas,como quando os europeus chegaram à América"
    },
    {
      "rating": "3.5/5",
      "review": "I have not watched the movie yet but it looks like it has potential."
    },
    {
      "rating": "3.5/5",
      "review": "Great acting, interesting story just wish the final act was a bit more booming"
    },
    {
      "rating": "3.5/5",
      "review": "I had fun watching this film. It was a little bit weird, but creative and different enough to be enjoyable. In an era where originality is lacking in entertainment, this was a welcomed breath of fresh air. It touches on a few important ethical subjects, while also managing to be funny, in a dark humour type way. It's not without it's flaws tho. I think the first half of the movie is better than the last. It was more interesting and intriguing. It's not a major flaw tho. The movie still remains solid in the latter half. It's just that it seems like 2 movies were glued together. Bong Joon-Ho's \"Parasite\" also had that aspect of 2 different stories merging near the end, but it worked great there. Here it wasn't as effective. The other flaw, and the biggest one, was Mark Ruffalo's acting. He seemed to be doing a Trump impression (a pretty bad one, since he is such a bad actor), mixed with some other personality, which made the scenes he was in extremely annoying. Everytime he showed up, it made me want to press the forward button. That's how annoying it was. I heard people complain about this movie and saying they were expecting more coming from Bong Joon-Ho; specially after \"Parasite\". But i think that is not fair for him. \"Parasite\" is one of those rare movies, that only gets made every few years. It's not realistic, nor fair, to expect every movie a director/writer releases, to be as good a masterpiece like \"Parasite\". I cannot wait to watch his next work."
    },
    {
      "rating": "0.5/5",
      "review": "not a very good watch. childish. would maybe rip it and not pay for this"
    },
    {
      "rating": "4/5",
      "review": "Thoroughly enjoyable and very clever - excellent cinematography, too. Well worth watching."
    },
    {
      "rating": "3/5",
      "review": "An original story with good acting. Mark Ruffalo, Robert Pattinson, and Steven Yeun really carried the movie. Naomi Ackie and Toni Collete were just terrible and they ruined the movie for me. Everything else was fine."
    },
    {
      "rating": "0.5/5",
      "review": "Way too long/boring, infinitely juvenile, not funny, not cute, not anything. Some of the worst dialogue in history. There is no such thing as the worst movie ever made. However, there is a land where lots of movies are in an eternal tie with ALL the other worst movies ever made, where this movie resides. Parasite is great, but Bong Joon Ho proves, like Jordan Peele, he can make absolute stinkers as well."
    },
    {
      "rating": "2/5",
      "review": "I wanted to like this movie. I get this movie was intentionally over the top, but the obvious political messaging really broke the immersion. Ruffalo is such a talented actor and it seemed he was off his game when doing an impersonation of the president. It came off as forced and out of place in a setting when forced and out of place was the theme. I do not care what side of the political isle the message lines up with, I watch movies to get a fanciful break from reality. When I get movie makers political alignments shoved in my face I cannot stay with the fantasy of the movie. It is like Frodo pulling out a cell phone and ordering door dash."
    },
    {
      "rating": "4.5/5",
      "review": "If this doesn’t prove Robert Pattinson as a top tier actor then simply put you don’t understand talent. His days of Edward Cullen are long behind him and he nails every role he plays"
    },
    {
      "rating": "3/5",
      "review": "A quirky, interesting satire and social critique with enough to watch to the end but maybe could have delivered more with the team and budget. Ruffalo and Collette's roles are comically over the top as is much of the film."
    },
    {
      "rating": "4/5",
      "review": "Good story, the ending is ok but not very interesting"
    },
    {
      "rating": "3/5",
      "review": "I get what they're going for, but it was just... kinda boring."
    },
    {
      "rating": "4/5",
      "review": "Very good sarcastic movie. Robert slay as always"
    },
    {
      "rating": "4/5",
      "review": "Interesante, entretenida. Tiene el humor y la crítica socio política que caracteriza al director, pero con una propuesta muy distinta a lo que esperaba ver. Lamentablemente encuentro que falla en ciertos elementos que son olvidados o dejados de lado, junto con eso, un final demasiado blanco en vez de los tintes más grises que pudo tener. Aún así es una película divertida y atrapante. Me hizo querer adentrarme en el psi-fi"
    },
    {
      "rating": "3/5",
      "review": "Super creative. Worth seeing if you like experimental sci fi."
    },
    {
      "rating": "0.5/5",
      "review": "Waste of time. Every character was lame, and I could predict the movie in less than20 minuets. Very predictable and forgettable film. Mark Ruffalo should be ashamed of himself, and I can only hope that Robert Pattinson made good use of the paycheck he received from this movie."
    },
    {
      "rating": "5/5",
      "review": "Thought provoking film and amazing range and acting from Robert Pattinson! Loved every minute of his lovable characters. Mark Ruffalo also knocked it out of the park playing his over-the-top character perfectly."
    },
    {
      "rating": "4/5",
      "review": "survivor of the new era"
    },
    {
      "rating": "4/5",
      "review": "Actually really entertaining, interesting concept, well executed, great acting especially Pattison playing the multiple versions of himselves with different characteristics. Some really over the top characters (Ruffalo/Collette). Worth a watch for sc-fi fans."
    },
    {
      "rating": "4/5",
      "review": "This is worth a watch. Original story so I was hooked already. Just entertaining enough to keep me locked in till the end. Robert Pattinson is a phenomenal actor 👏"
    },
    {
      "rating": "0.5/5",
      "review": "Fairytale children's version Nausicaa. Very shitty movie"
    },
    {
      "rating": "3.5/5",
      "review": "I was rather impressed with Robert's acting. Liked the storyline but definitely could have been 30 mims shorter. Great acting all around. Worth a re-watch."
    },
    {
      "rating": "4/5",
      "review": "First time seeing Bong Joon Ho movie. Mickey 17 is a great movie to watch. First time hearing Robert Pattison natural voice with his accent. Throughout the movie his acting seem natural. He seem to dive into character easily and enjoy every scene. His chemistry with his other self really show the human bond can be created in short time. It is sad to see things have to be let go, but in the end the sacrifice was worth. Definitely a must watch if you are a fan of the director or Pattison!"
    },
    {
      "rating": "3.5/5",
      "review": "Mickey 17 feels more spiritually connected to Bong Joon Ho's genre-bending works like The Host and Snowpiercer than to his Oscar-winning Parasite. While undeniably flawed and occasionally heavy-handed with its political satire, the film offers something fresh and exciting in the sci-fi landscape. The real standout is Robert Pattinson's remarkable performance as Mickey and his various clones. Each iteration feels distinctly different - a testament to Pattinson's range and commitment. When another Mickey appears on screen, you genuinely feel like you're watching a different person, despite the shared face. This virtuoso performance elevates the material considerably. As with many of Bong's English-language films, some of his trademark dark comedy doesn't quite translate with the same razor-sharp edge we've come to expect from his Korean productions. The nuanced absurdism that made The Host so memorable feels somewhat diluted here, perhaps lost in translation or cultural context. Still, there's an undeniable originality to Mickey 17 that keeps you engaged. The film's exploration of expendability and corporate exploitation resonates, even when the execution falters. It's imperfect sci-fi that's more forgiving in its genre, buoyed by creative world-building and Pattinson's multi-faceted turn. For those willing to embrace its flaws, Mickey 17 offers an intriguing addition to Bong's diverse filmography."
    },
    {
      "rating": "0.5/5",
      "review": "Alas, this was flat out boring."
    },
    {
      "rating": "1.5/5",
      "review": "Any humanity and gravity that were present in the (super fun) book has been ground out by slapstick and wackiness that doesn't click and somehow manages to brashly steamroll the cool ideas into inconsequence. Some great acting in a steaming mess."
    },
    {
      "rating": "3.5/5",
      "review": "Very cool Dystopian Sci-fi. I loved the creativity. It lacks a bit, not a classic, but damn it was neat."
    },
    {
      "rating": "5/5",
      "review": "Thought provoking and quite fun ."
    },
    {
      "rating": "2.5/5",
      "review": "The acting is good and you can almost witness how hard they are trying to deliver as actors with a storyline that falls short. The cast sea of the story is great. Could have been better"
    },
    {
      "rating": "4/5",
      "review": "A unique film that leaves the viewer entertained. Playful and doesn't take itself to serious, this film defines what I love about cinema, creating a space in time to let your mind wander with the fun ideas. Creatively inspirational."
    },
    {
      "rating": "2/5",
      "review": "This was a pointless movie. The acting was good. It just seemed to take forever to get to the end."
    },
    {
      "rating": "4.5/5",
      "review": "Pattinson surprised me with his range and I almost didn't recognize him because the character had a very useful appearance. That being said It was consistently dark and goofy at the same time and very much watchable."
    },
    {
      "rating": "5/5",
      "review": "One of the best movie of 2025 so far bong joon jo and Ryan coogler are highlights this year for movies waiting for the valley now must watch."
    },
    {
      "rating": "3.5/5",
      "review": "I enjoy Robert Pattison performance but Rufffalo was awful, I wouldn't watch again."
    },
    {
      "rating": "0.5/5",
      "review": "Just a complete waste of time. No imagination. Watching the real Trump in action is much more entertaining."
    },
    {
      "rating": "4/5",
      "review": "A fun and enjoyable sci fi with a goofy villian."
    },
    {
      "rating": "2.5/5",
      "review": "Started off so original and stylish, descended into the extreme. The last half wreaked of writers/directors going more for shock n' awe than a cohesive plot and gripping story"
    },
    {
      "rating": "4/5",
      "review": "I feel like this movie would've been better as two movies, fleshing out Mickeys love and the power struggle at the end."
    },
    {
      "rating": "3.5/5",
      "review": "A fun sci-fi comedy with a familiar villain"
    },
    {
      "rating": "3/5",
      "review": "Loses its way half way through the film"
    },
    {
      "rating": "1/5",
      "review": "Everything wrong with hollywood."
    },
    {
      "rating": "3/5",
      "review": "This movie wavers between ridiculous and trying to make a statement. It fails at both, but it is still pretty okay."
    },
    {
      "rating": "5/5",
      "review": "This is a movie about narcissistic leaders who are full of bluster and self-importance, who resist scientific opinion, who act without concern for their natural environment or animal inhabitants, and who reduce the culture to the lowest possible denominator. It is a very difficult film to watch, as all critics admit, but not for the technical reasons they give, but because this film is an unexaggerated portrait of none other than ourselves."
    },
    {
      "rating": "1/5",
      "review": "It wasn't funny, simply mocking. There was no witty dialogue, interesting moments or even anything slightly original."
    },
    {
      "rating": "5/5",
      "review": "This movie was great. Absolutely comedy gold. Cool story bro. Haters gonna hate. Mark Ruffalo, Robert Pattinson, and Steven Yeun are incredible."
    },
    {
      "rating": "2.5/5",
      "review": "It was interesting at times but I had a hard time following because I wasn't paying much attention. Best thing about it was Mark Ruffalo but it was still too long and mostly boring."
    },
    {
      "rating": "1/5",
      "review": "Terrible, but in a fascinating way."
    },
    {
      "rating": "1.5/5",
      "review": "Pattinson carried this film. Ruffalo was beyond \"cartoonish\" villain and was painful to watch on screen. Plot went off the rails. Subplots either didn't get resolved or were half baked or just came out of nowhere. Ending was just bad. Also seemed to be weird political correlations to modern day USA with some of the acting and dialogue that felt super forced and on the nose. Quite bad."
    },
    {
      "rating": "0.5/5",
      "review": "such a waste of talent. movie is not good and i wish i didnt watch it all the way through"
    },
    {
      "rating": "0.5/5",
      "review": "not good, actors were ok but plot and storyline not good"
    },
    {
      "rating": "1/5",
      "review": "Why did I waste my time! I’ll never get that time back."
    },
    {
      "rating": "0.5/5",
      "review": "Pattinson now in every thing but anyways with a different actor I would give 2 Stars still not realy good"
    },
    {
      "rating": "1.5/5",
      "review": "Starts strong, ends boringly. This was a waste of time and money. Seriously, concept seems good- human cloning, expendable person used for scientific answers on disease, tradition, and more. But then goes horribly off the rails making fun of Trump and religion/cults. Sigh, pointless dribble by the end. Don't waste your time."
    },
    {
      "rating": "4/5",
      "review": "Interesting but wouldn't watch again"
    },
    {
      "rating": "4/5",
      "review": "Mark Ruffalo was channeling the spirit of Trump — a very, very annoying version of Trump, which took you out of the film. Steven Yeun was great, and so was Robert Pattinson. I feel like the film’s ending was left on the cutting room floor — maybe it was too dark for audience."
    },
    {
      "rating": "1.5/5",
      "review": "Started so strong, lost its steam. It’s nothing more than an idea. Nothing compelling at all to tie it all together. No interesting commentary about anything and it just drags on and on and on. What a miss from my favourite director"
    },
    {
      "rating": "1/5",
      "review": "Started off great and I thought I knew where this is going, dumb guy comes good but no, it becomes a physiological doo dah. The story of two same guys..the dilemma of a girl sharing identical blokes but with two personalities, it became uninteresting. The budget was spent on the beginning and a little bit at the end, the rest is a 1½hr play, and if you chopped that off it would make a great 30 minute short film. Therefore it is too long filled in with uninteresting claptrap, a bit like this review. So much potential yet poorly executed."
    },
    {
      "rating": "3/5",
      "review": "“When a director is given too much power” that is the lesson that Mickey 17 teaches us. Mickey 17 is one of the first big-budget movies to come out in 2025. Directed by Bong Joon Ho, the same person who directed the cinematic masterpieces such as Parasite, the movie came out with high hopes from both critics and audiences alike. Unfortunately, the movie was not able to come close to the hype it had garnered. Summary Mickey 17 follows the story of Mickey. A man who volunteers to become a test subject on a space mission to escape the people who are chasing him on earth. In the movie’s universe, humanity has discovered how to clone people and uses ‘expendables’ (people that have the sole purpose of dying for scientific inquiry) to conduct experiments on the human body. Once the person dies, they can be cloned again, loaded with their past memories and used for future experiments. This goes wrong when the 17th version of Mickey is presumed to be dead and his 18th version is cloned. The movie then follows Mickey 17th as he returns to the ship and finds his place taken by his clone, Mickey 18th. World Building The movie does a good job of worldbuilding. A common mistakes that sci-fi movies make is to rely on exposition (people talking about the world around them) for worldbuilding instead of actually showing the world and its rules. Mickey 17 balances these 2 aspects well. From the start, we hear Mickey 17 as a inner monologue and are shown the things he talks about. This helps the audience understand the world without making it feel complicated. The problem happens, when you are an hour into the movie and Mickey is still monologueing. Representing a detailed description of the world and its rules is not necessarily a bad thing, done well, it can help the audience’s immersion. But when it takes an hour to explain the world and nothing important happens in the story other than Mickey 18th being formed (Which the audience already know about from the trailers), the audience tend to loose their attention and that point, no amount of fancy visuals can bring their attention back. WHAT, WHEN, WHY Every good movie needs to establish its What — what the main character hopes to accomplish; its When — the time by which they must achieve it; and its Why — the reason it matters. Without establishing these, a movie ends up being disfocused and lost in its plot. If the audience do not have a clear goal that needs to be achieved then everything ends up feeling pointless. This is the biggest mistake that Mickey 17 makes. From start to end, not once does the movie establish a clear goal that the characters need to achieve and a time frame for them to achieve it. There are some implicit goals and this can work, if, there is only one implicit goal and it is not interfered with. A movie cannot have multiple, unclear, implicit goals that are competing with one another. First, Mickey 17th has the implicit goal of following Mickey 18th. Why must he follow him? Because it’s a clone and he should. But then they meet and the goal ends. Now what, now they want to kill the head of the ship. Why? Because the captain treats them like expendables, but then everyone on the ship treats them like that, so they should logically kill everyone. But then, they fail. Now, they must save humanity. Why are they the ones saving humanity? Because they are the main characters, but there is nothing special about them, they might be clones but they are still humans, that isn’t a special ability. Boo Joon Ho uses the entire movie to showcase this amazing and detailed world he has created, but he never gives the audience a clear goal that Mickey 17th needs to achieve in this world. Setups and Payoffs Every movie needs setups and payoffs. The movie setups the goals that need to be achieved and then works towards the final payoff. This concept isn’t just limited to goals, a movie can setup a certain metaphor or external element and then use it later (this becomes the payoff). Unfortunately, for Mickey 17, this setup and payoff element is not executed well. Every movie is made of 3 acts, it’s introduction, main part, conclusion. Mickey 17 loosely sets up metaphors and goals in it’s first act and then rushes to close them up in the third act. The second act adds nothing to the movie and then continues to conflict and ruin the one implicit goal the first act set up. If you ignore the second act of the movie, all of it’s confusion and contradiction then the movie ends up being quite focused. Because, at the end of the movie, the only goals that are achieved are those set up in the first act. The second act goals are just ignored and forgotten by the movie. Too many themes The movie tries to tackle a lot of themes. Where a good movie only needs to tackle one or at max 2 themes. Mickey 17 tries to take on 3 of them: Ethics and Morality, Church and State, Situations and the Poor. A movie like Mickey 17 could have easily stuck to the ethics of making new people with the same memories (Some complicated story building also shows that it is not even the exact same memories). The storybuilding is also used to tackle the poverty theme and how it forces people into unfavourable situations. But then the movie decided to add a third theme. How the church and religion influnce the decisions made by the state (the captain). This theme is then not tackled in any meaningful way. It is represented to show it exists and then nothing is done with it. So the third theme ends up complicating the message of the movie without showing any meaningful messages of its own. Conclusion In conclusion. The movie looks amazing, from it’s quality to the colour grading to the wardrobe choices. The acting in Mickey 17 is phenomenal. Robert Pattinson does an amazing job of bringing his character to life. But other than these, there are no pros to it. It is a disfocused mess with no meaning or goal to it. Even the character arc is a lousy and unjustified mess. If you love Robert Pattinson and his work then maybe give it a try, but for any reasons other than that, skip it."
    },
    {
      "rating": "4/5",
      "review": "First of all props to robert pattinson, he did amazing with his role on this film - he’s a very good actor. I really like how the film gives you life lessons throughout the movie, and how well balanced the genre’s are. A good amount of sci-fi and romance, To sum it up this film is worth watching."
    },
    {
      "rating": "4.5/5",
      "review": "I loved it! It’s weird and quirky, but also quite fun. A bit self-indulgent and over-the-top at times, but overall really refreshing. It felt like watching a live action anime, and Robert Pattinson was just incredible."
    },
    {
      "rating": "4/5",
      "review": "A dynamic adventure movie with hints of comedy and drama."
    },
    {
      "rating": "4.5/5",
      "review": "Much better IMHO than the overrated Parasite - better aligned with the spirit of Snowpiercer, a truly great movie IMHO"
    },
    {
      "rating": "0.5/5",
      "review": "I was curious to see after watching the trailer. Looked good. Waste of time. Not the actors fault."
    },
    {
      "rating": "2/5",
      "review": "This felt too rushed in my opinion, almost focused too much on the satire that it forgot to do something more useful with the main story which was pretty weak. The satire I supposed is supposed to carry this film. Had high hopes for this maybe next time Mr Bong"
    },
    {
      "rating": "3/5",
      "review": "A solid film through and through with an exceptional and eccentric performance from Robert Pattinson. I wish they had not essentially spoiled the entire film in the promotional trailers."
    },
    {
      "rating": "2.5/5",
      "review": "I really wanted to like this movie from all the reviews but ended up walking out of the theater halfway."
    },
    {
      "rating": "2.5/5",
      "review": "Expected better. It felt like it tried too hard. Every Mickey was the same until they needed him to be different, then suddenly they just made a Mickey different. Felt like a film by Napoleon Dynomite director."
    },
    {
      "rating": "1/5",
      "review": "Terrible did not like it"
    },
    {
      "rating": "1.5/5",
      "review": "Robert Pattinson's performance does a lot to save this movie, but the \"political message\" just doesn't land and it's clear it counted on a different political result. It's a gamble and it didn't pay off, movies used to mean something."
    },
    {
      "rating": "1/5",
      "review": "Without doubt the worst film I’ve ever seen - so bad I was determined to write a review. I have no idea what the ‘clever’ social commentary was about. The acting was awful, but I’m sure the script wasn’t helpful. Too long; not funny; not engaging and no storyline to speak of."
    },
    {
      "rating": "4.5/5",
      "review": "I loved this movie to about 95%: Great visuals, competent acting, engaging story and good message. I liked the mix of sci-fi, dystopian future and hopeful comment on humanity, without resorting to the usual cheap Hollywood action setpieces and inhuman killing sprees. The 5% I hated about the movie were Mark Ruffalo‘s and Toni Collette‘s badly overacted villains. Ruffalo tries to impersonate Trump, and fails badly. Their whole act just feels like a cheap shot at Trump, Republicans, and like an attempt to put christians in a bad light and get some laughs at their expense. It all fails badly and the movie would be perfect, if the villains had been as well written and acted as the rest of the characters. Instead we get some bad parodies by obviously hateful actors and/or writers. But overall a great movie."
    },
    {
      "rating": "4.5/5",
      "review": "Para esto fue creado el septimo arte"
    },
    {
      "rating": "5/5",
      "review": "From concept to execution, this movie is brilliant and Pattinson is everything here."
    },
    {
      "rating": "3/5",
      "review": "Quite left field and strange on the face of it but the over all story was good and the acting was great, Ruffallo steals the show, so it was a fairly enjoyable ride. Some of the sub plots were a bit too random to make sense and as an audience it felt like we were being asked to just go with until something else random happened to distract us."
    },
    {
      "rating": "2.5/5",
      "review": "Robert Parkinson's efforts aside, sadly this isn't very good. The on the nose social commentary combined with overacting masquerading as comedy is just cringeworthy and the whole thing smacks of wasted potential. Red hats? Honestly?"
    },
    {
      "rating": "3.5/5",
      "review": "It's a promising movie with a lot of good ideas and story ideas with possibilities on where to take them. Robert Pattinson does a stellar job fleshing out being a simple ying-yang/polar opposites duo performance. But, the holes or lack of significant character development or any emotional background to the character of Mickey without any further explanation as to what is happening, makes it all feel like a let down (especially that buzzkill, lackluster ending). The confliction only deepens more so since this is Bong Jong-Ho's follow-up from the masterpiece that is PARASITE. Otherall, not the worst for the year or as an Sci-Fi Comedy but will probably end up being Bong's worst like STOKER was for Chan Wook-Park."
    },
    {
      "rating": "1/5",
      "review": "Walked out of the cinema it was so bad. Is this the world we are turning into that this rubbish is supposed to entertain us. I only wish 1 day we could give less than 1 star because giving this 1 star is doing it a favour."
    },
    {
      "rating": "2/5",
      "review": "Started off interesting as many modern films but started to unravel fairly quickly. A weak plot, weak writing, and terrible charicature-type characters. Generally a cynical view of humanity and the future. Dystopian films should be a warning-off of our dangerous tendencies, but this one just seems borne of stupidity more than anything, and for that reason is mostly unbelievable. THe plot could have been squeezed into an hour. WHy it took 2.5 hours to develop this nothing burger, I do not know. Robert Pattison was barely watchable along with many of the other actors who with better direction and script I am sure could have been much better."
    },
    {
      "rating": "5/5",
      "review": "Loved a new take on a possible dystopian future. Great movie with a total package of acting, directing, humor and screenplay from a book. I just wish I could've caught it in the theater so I could support more of this type of cinema, rather than the super hero/sequel genre."
    },
    {
      "rating": "4/5",
      "review": "Fun and engaging. Even though it sometimes misses the mark, I’d recommend anyone to watch it."
    },
    {
      "rating": "5/5",
      "review": "A very different creative, entertaining movie experience."
    },
    {
      "rating": "4/5",
      "review": "While it often dazzles - the moments in between lack a spark to keep you 100% clocked in. It's an incredible movie that somehow packs so much in, that momentum is lost between the world building scenes. It's still worth watching for its incredible performances, moving story and stirring action scenes. Come for the mob movie in space - and leave happy."
    },
    {
      "rating": "4/5",
      "review": "Weirdly strange and strangely weird … but … had to keep watching it. While Robert Pattinson was great, Mark Ruffolo and Toni Collette stole the show."
    },
    {
      "rating": "5/5",
      "review": "I Recommend this film. It Was Not Filmed In Camcorder Mode! Just for this reason, still a good movie."
    },
    {
      "rating": "4.5/5",
      "review": "Mickey 17 é um thriller de ficção científica, com um leve toque cômico que promete ter trazido às telas novamente a magia do cineasta Bong Joon-ho (diretor do fantástico filme Parasita). Desde já, vou deixar claro que adorei o filme, e que deu pra notar nele a \"assinatura\" de Bong Joon-ho. O filme apresenta um futuro distópico bem elaborado, e imerge o espectador nele através de imagens alucinantes (sem grandes exageros) e boa ambientação. Também cria toda a \"mitologia\" (digamos assim), que não é muito complexa, nem mesmo muito realista, porém, não vejo como um problema, pois o filme não se leva à sério, adotando um tom cômico, tanto através das situações da trama e de certas \"piadas\", como também pelo personagem principal Mickey 17 (principalmente por ele), que é muito bem interpretado por Robert Pattinson. Esse personagem (Mickey 17) talvez pode não agradar muitas pessoas pelo seu jeito excessivamente caricato, infantilizado e etc., mas consegue roubar nossa simpatia, e é apoiado pelo tom do filme. O filme apresenta muitas críticas e subtextos e até mesmo alegorias que enriquecem mais a obra: crítica social, política, religiosa (infelizmente para quem é religioso) e até sobre colonização e fascismo. As demais atuações estão perfeitas, e quero destacar Mark Ruffalo, como o Sr. Marshall, ele é perfeito: engraçado, ridículo, vilanesco, quase que implacável e babaca também [kkkk]. Mas o mais impressionante é a habilidade única de Bong Joon-ho (diretor) de extrair o máximo das situações da trama, gerando tensão, alucinação e prendendo o espectador até o fim, sempre explorando as relações humanas da forma mais \"roubada\" (no bom sentido) possível. Por fim, não chega a repetir a qualidade de Parasita, porém não por demérito, mas sim por mérito de Parasita. É um filmaço, mas depende da sua identificação com a obra. Recomendo. Nota 8,6 e 4,5 estrelas aqui."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Definitely did not expect the movie to go where it did but it was the best movie I've seen in a while. I laughed a lot more than I thought I would. Definitely goes with the theme of what we're living in right now lol"
    },
    {
      "rating": "5/5",
      "review": "i wish this movie got more appreciation! unbelievably cool movie with unique sci-fi elements. even has a good love story"
    },
    {
      "rating": "4/5",
      "review": "A very interesting and fresh plot! There may be a few plot holes or confusing aspects but overall a great film worth your time."
    },
    {
      "rating": "2/5",
      "review": "wasted potential, they create a good setting for a good IP, but i dont know where the direction is, not funny, not thrilling, very falt story after 20 minutes end up as enviromental mother nature campaign.. really a wasted potential"
    },
    {
      "rating": "5/5",
      "review": "Bong Joon-ho's latest film Mickey 17 is seen as a visually interesting and conceptually science fiction film with strong performance of Robert Pattinson's portrayal of the multiple iterations was widely praised, critics acknowledged Bong's unique vision, distinctive style, and his ability to blend genres, as well as world-building and cinematography often commended. The sharp satirical of capitalism, colonialism, and contemporary politicals was noted yet found heavy-handed unlike Mark Ruffalo's character drawing parallels. But despite it's box-office disappointment, the movie proves to have found it's pacing, narrative, and thematic delivery to be less refined compared to Bong Joon-ho's previous successes."
    },
    {
      "rating": "1/5",
      "review": "So much love to make something so awful. The black comedy element is weak and unfunny, the moralistic theme undercooked. It would have been better had it been played as a straight up serious sci-fi or a full on spoof. Mark Ruffalo is normally a very reliable character actor but the cheese is dialled to 11 and is a real turn off, Robert Pattinson's fake childish articulation is also incredibly annoying. Genuinely cannot understand any of the positive reviews, the trailer also gives a very false impression. Avoid."
    },
    {
      "rating": "5/5",
      "review": "Saludos, yo soy Etienne, voy a hablar de mi película preferida «Mickey 17». El protagonista es Mickey y el número 17 se refiere a los otros 16 Mickeys que preceden Mickey 17. El realizador es Bong Joon Ho y es de Corea del Sud.La película es una película de ciencia ficción, también de acción y de comedia. La película se desarrolla en el futuro donde es posible hacer réplicas de humanos y Mickey es una réplica. Mickey murió 16 veces por la ciencia. Asha es la compañera del protagonista y los dos tienen una relación muy particular e íntima. El antagonista Kenneth Marshall es un dictador y el comandante de la naveta espacial donde se desarrolla la mayoría de la película. Kenneth y también su mujer son personajes muy infamosos que casi todos odian también yo. El comienzo de la película es muy interesante porque vemos cómo funciona la máquina que hace las réplicas y las experimentaciones científicas. Me encanta esta película porque los personajes son muy interesantes, quiero la ciencia ficción y provoca muchas emociones porque hay momentos tristes y chistes. Yo recomiendo este película porque es uniqua y muy interesante."
    },
    {
      "rating": "5/5",
      "review": "Incredible plot and writing , Dynamic performances from the cast . The underlying sub-text and self reflection of America was eye opening . Black mirror-esque Dystopia yet realistic near-future ."
    },
    {
      "rating": "1/5",
      "review": "Difficult to sit through with all the IRL political undertones. Can we just make movies and tell great stories?"
    },
    {
      "rating": "3.5/5",
      "review": "Good Movie. But at times seems boring."
    },
    {
      "rating": "1/5",
      "review": "A cynical, ugly and uninsightful take on humans. I understand that some people might find this a breath of fresh air If they have spent the last decade watching Marvel Movies with sacarine heroes being absurdly virtuous, but for myself, the philosophical statement about humanity is empty and nasty. The movie fundamentally seemingly wants to be a clever statement about avarice, but ultimately ends up just being a mirror to the Directors own uncharitable views of people characters aren't motivated by literally anything other than there own idiotic greed and spite. The suspension of disbelief never takes off, and you are, I suppose, merely meant to laugh as every single character tries to ruthlessly exploit each other. All in all, a high budget movie which presents hollow arbitrary meanness as something insightful. If I laughed more, I would have forgiven it as a psychopathic inversion of Star Trek. I didn't laugh. Oh look, everyone double crosses each other every 30 seconds. Yawn."
    },
    {
      "rating": "3.5/5",
      "review": "Sincere in its weirdness and strong in its satire, Mickey 17 offers viewers a new experience all around. From a unique and peculiar premise to Pattinson's crazy, over-the-top acting, Bong Joon Ho's sci-fi dark comedy is an entertaining watch that doesn't shy away from touching on a myriad of complex themes."
    },
    {
      "rating": "4.5/5",
      "review": "robert pattinson acting is another level"
    },
    {
      "rating": "3/5",
      "review": "Una película con una historia buena, pero demasiado lenta y aveces muy novelesco, llega a tener momentos muy aburridos, las actuaciones 10 de 10"
    },
    {
      "rating": "2/5",
      "review": "Man I was disappointed.i thought this movie was going to be a great sci-fi film but it sucked. although there was some good action and premise it just couldn't follow through. At first I thought ok maybe if I just give it time but nope it did not get better and by the end I was bored out of my mind. So ya I wouldn't watch again and over all its a 2.3/10."
    },
    {
      "rating": "5/5",
      "review": "Creative. Original. Didn’t waste my time, had some heart. Characters had just the right amount of development to action. I don’t like mark ruffalo, a bit too much satire there, but the rest is fun, it’s worth the watch."
    },
    {
      "rating": "5/5",
      "review": "Imho this will become a cult classic alongside movies like Brazil and Life of brian. It's somehow believable and way way way over the top. A lot of people probably dont realise it but Robert Pattinson is a brilliant actor and he's alongside other brilliant actors like Mark Ruffalo. And the rest of the cast are great. The director Bong Joon ho hopefully has a long future"
    },
    {
      "rating": "4/5",
      "review": "very good, not perfect"
    },
    {
      "rating": "5/5",
      "review": "Super impressed with this one! This movie made me feel many things, which many movies today don’t evoke. It was thrilling, comedic, futuristic, romantic, sent a message about the importance of life and was actually super sweet. Robert Patterson’s performance was amazing, I forgot many times throughout this film that he also played Edward. My love for him as an actor, and his craft definitely increased! It was also nice to see some new faces on screen. Safe to say I loved this movie! Would definitely watch again!"
    },
    {
      "rating": "2.5/5",
      "review": "Plot seemed recycled. Acting was slightly above par. CGI used for aliens were exceptional. However, overall nothing memorable."
    },
    {
      "rating": "1/5",
      "review": "Despite some outstanding performances the film is under whelming . The premis was intriguing but rather than delivering a satisfying meal was more like a rice cake covered in chocolate ."
    },
    {
      "rating": "5/5",
      "review": "Quirky, weird, and over the top. Like a melodrama stage play, everything went over-the-top. The acting to accomplish this unique film had to be top tier. Not only did the actors (and there were so many good ones!) step away from their usual stereotypical roles, but the sci-fi dark comedy went into a Wes Anderson-esque style of complicated misdirection and comedy. The whole plot was unexpected and surprising, with Robert Pattinson truly making this role his own. And I never could have predicted Mark Ruffalo being able to match so well with Toni Collette in portraying over-the-top craziness, but it worked. He made the character memorable and you hated him. By the end of the movie, you had heroes, and villains, and a new adorable alien to root for. I recommend watching it with friends, and enjoying the unexpected."
    },
    {
      "rating": "5/5",
      "review": "great movie, kinda funny the cgi was crazy to with the aliens"
    },
    {
      "rating": "1/5",
      "review": "Top 5 worst movies I’ve ever seen. Mark Ruffalo is so terrible it makes me sick"
    },
    {
      "rating": "5/5",
      "review": "Great movie! I think it was better than the book. Excellent production."
    },
    {
      "rating": "4.5/5",
      "review": "Loved the movie!! Now this is how you write a sci-fi movie. Everyone take notes."
    },
    {
      "rating": "5/5",
      "review": "I LOVE IT, I love EVERYTHING about it, when I say everything mean all."
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved this movie. I hadn't watched any trailers so went in blind and I enjoyed it so much! I found Robert just hilarious. My favorite role of his, hands down. I got emotional sometimes for him! He nailed that role IMO. Thoroughly enjoyed it!"
    },
    {
      "rating": "3/5",
      "review": "A quirky sci-fi comedy so overstuffed with social and political commentary that it forgets about entertaining it's audience. Shortly after wishing it was a different film altogether, I lost interest and thought about how much better Duncan Jones' \"Moon\" was."
    },
    {
      "rating": "3.5/5",
      "review": "Well that was different!"
    },
    {
      "rating": "3/5",
      "review": "I think if this had been made as a straight pg-13 movie, it would have been a lot more watchable and enjoyably. But too much strong profanity and adult themes, (ménage à trois?) for its target audience which i presume is high high and young adult."
    },
    {
      "rating": "4.5/5",
      "review": "A fun, intelligent, and extraordinary film, released at the perfect time. It portrays a society identical to ours—or at least the one we are becoming. Bong Joon-ho shifts science fiction from dystopian to utopian, crafting a story filled with deep themes: the importance of the individual in society and free will, the destruction of the environment by humankind, and political power in the hands of those who don’t deserve it. Incredible direction, brilliant performance by Pattinson, and a fantastic Mark Ruffalo. A must-watch film, even more impactful in IMAX format."
    },
    {
      "rating": "1/5",
      "review": "Worst movie I’ve seen in a long long long time. I have no idea how it’s rated so high. Lots of potential with the plot but it’s brutaaalll"
    },
    {
      "rating": "1/5",
      "review": "You lost me at - can't leave your political views & your hatred - out of a film. Very immature & unprofessional. I'm of course referring to the conservative types wearing red hats near the start of this garbage movie who were portrayed as utter morons. Regardless though I did try to soldier on with this childish effort, like 3 or 4 times until finally, about half way through I simply ran out of legs. Even if Bong could have stayed off the bong for 5 mins, I don't think I would have enjoyed it like I'd hoped anyway. It's kind of stupid. I'm giving it 3/10 but I'm deducting 1 point for wasting my time :0"
    },
    {
      "rating": "5/5",
      "review": "Underrated. Love how they didn't have an orgy with the clone."
    },
    {
      "rating": "0.5/5",
      "review": "While it is an interesting plot seed, like a bad tree and Mickey clones with no future, this one ends up taking us nowhere interesting or very entertaining. I actually walked out at the 45 minute mark & got a substitute ticket for something worth my time."
    },
    {
      "rating": "3/5",
      "review": "The first Bong Joon-Ho film that I'd consider a disappointment. Starts off dull with unlikable characters and a ditzy Robert Pattinson. Eventually, it turns into a moderately interesting fable with over-the-top performances from Ruffalo as a modern-day fascist. The film has its moments, and is a decent sci-fi comedy, but definitely not a worthy entry in the mighty caliber of Joon-Ho's films."
    },
    {
      "rating": "1/5",
      "review": "Terrible film . Rubbish plot, rubbish acting, a very long two hours. Can see why WB lost millions on this epic failure."
    },
    {
      "rating": "4/5",
      "review": "Very funny movie, acting was pretty good, Mark Ruffalo plays a very ridiculous role."
    },
    {
      "rating": "0.5/5",
      "review": "As a huge fan of sci-fi and Bong Joon Ho, i am extremely disappointed. Bad script. Hammy acting. Overlong. Boring. No wonder it got delayed so many times and eventually bombed at the box office. Waste of time, talent and money."
    },
    {
      "rating": "4/5",
      "review": "Le film est très sympa, malheureusement, il ne pousse pas certains concepts assez loin et une fin qui semble assez baclée. Malgré cela, le film est très agréable à regarder. Un excellent film de Bong Joon Ho dans la ligné de Snowpiercer et Parasite."
    },
    {
      "rating": "1.5/5",
      "review": "Rob Pattinson versatility on display. You will be amazed at his accent, and his play of his character in different scenarios. He makes it fun, even if his character is so spineless it hurts. There’s also plenty of modern day themes at play: resource scarcity, oligarchy, genetics and science, space, castes and class systems, militarism, etc. Initially a quirky fun ride, but becomes lame when the alien life is revealed. A bit long for my liking. Would not rush to theaters or see again. D-"
    },
    {
      "rating": "0.5/5",
      "review": "UNWATCHABLE because of Pattinson's idiotic voice choice."
    },
    {
      "rating": "3/5",
      "review": "Starts of good the end is just crap"
    },
    {
      "rating": "0.5/5",
      "review": "The movie is slow and boring. If you like Sci-Fi movies like Star Trek, Star Wars, Blade Runner, Terminator, don't waste your time with Mickey. Mark Rufallo at his worst."
    },
    {
      "rating": "5/5",
      "review": "Incredible original story/adaptation. Robert Pattinson can do ANYTHING. Just stellar from Naomi Ackie too."
    },
    {
      "rating": "4/5",
      "review": "Original, sometimes funny, sometimes bizarre. Seeing Pattinson switch between the two versions of Mickey shows what a fantastic actor he is!"
    },
    {
      "rating": "5/5",
      "review": "I just wanted to write “perfect”."
    },
    {
      "rating": "0.5/5",
      "review": "I Love Sci Fi movies; but I can't stomach the degrading of human dignity and disregarding the preciousness of human life. I'm 38 years old, and still. \"They'll just print another of you in the morning\" So there is no effort to save him. Just let him suffer and die multiple times. If you've got a heart for the sacredness of life, this is not your movie. I don't know how this is \"comedy\". Nothing funny about it."
    },
    {
      "rating": "1.5/5",
      "review": "This movie has proven to me that this director really doesn’t have anything significant to say. Beyond the obscure and morbid moments that really just feel like they are there for a wow factor, they don’t really try to expand upon the phycological concepts of death and its mental toll. Instead, it becomes this bland love triangle story with the same cartoony overdramatic logic of Parasite that presents itself as artful directing, but just turns out feeling like a mess in the end."
    },
    {
      "rating": "0.5/5",
      "review": "I honestly disliked the entire movie.. my husband and I went on a movie date and he regrettably chose this movie. We were eating and I lost my appetite due to the disgusting scene when Mickey went to the dinner and was eating what looked like a glob of blood I also felt terrible watching this movie as a Christian. There were some scenes of blasphemy. It definitely felt like they were mocking God. Please dont make the same mistake I did. Save your money!!"
    },
    {
      "rating": "4/5",
      "review": "Such an interesting plot line & super entertaining! I will be watching this again & again!"
    },
    {
      "rating": "5/5",
      "review": "Gonna rip my bong joon ho before I watch this"
    },
    {
      "rating": "5/5",
      "review": "I was not a huge fan of Patterson until now. He was amazing and this movie spot on fun. Loved the satire too."
    },
    {
      "rating": "5/5",
      "review": "There's something Verhoevenesque about Bong Joon Ho's version of expansionist human colonizers engaging in a bug hunt against innocent sapient insects, but where Starship Troopers leans so hard into its fashy Heinlein + Hugo Boss aesthetic that it's still argued whether it's homage or satire, Mickey 17 takes what should have been a very dark concept, that of a heavily hinted eugenicist theofascist (featuring Mark Ruffalo in yet another delightful heel turn after Poor Things) utilizing literal disposable slave labour to build his Space Reich on mass indigenous graves, and somehow it turns out to be… wholesome? Naomi Ackie's charismatic but slightly unhinged heroine is in large part why it works, especially paired with Anamaria Vartolomei as a romantic foil for the hapless Mickey's affections."
    },
    {
      "rating": "4.5/5",
      "review": "Creative, unique, heart-wrenching. Best Robert Pattinson performance I’ve seen."
    },
    {
      "rating": "4.5/5",
      "review": "I loved the movie it had a fun, adventurous, and dangerous atmosphere. Robert Pattinson was a great Mickey I feel like this role was made for him. The switching between 17 and 18 was impressive. Mark Ruffalo was great, this role seemed too easy for him to do lol. And Steven yeun was great too I just wish I saw more of him a little bit. It was like Danny Cho from beef went to space. Great watch."
    },
    {
      "rating": "1/5",
      "review": "The positive reviews are clearly fake. It is quite literally one of the most confused, idiotic, and worst movies I’ve ever seen. The translation is really bad. The jokes don’t land. It doesn’t make sense. It’s so wild studio execs funded this."
    },
    {
      "rating": "2/5",
      "review": "Ooof. Great book that deserved more. No wonder its release was delayed so many times. It is like a bad student film… insane over acting and cheap attempts at comedy. Belabored scenes. Lack of character arcs. Fundamental holes."
    },
    {
      "rating": "0.5/5",
      "review": "I wish i could get back my 2 hours and 14 mins back,"
    },
    {
      "rating": "5/5",
      "review": "thought it was great loved the premise of the movie and the story telling"
    },
    {
      "rating": "0.5/5",
      "review": "Cool premise but everything else about it sucks"
    },
    {
      "rating": "1/5",
      "review": "I’ve seen a couple of films in my life that were absolutely dire…..sadly this is one of them (the other one was The Unbearable Lightness of Being). Literally 2 hours-ish of my life that I will never get back. God knows how much was spent on it…..but I think the money would have been better spent on a huge donation to a hospital…..Dull & really didn’t make much sense. Some actors should be ashamed of themselves signing up for drivel like this."
    },
    {
      "rating": "0.5/5",
      "review": "mediocre. pointless. beyond stupid."
    },
    {
      "rating": "0.5/5",
      "review": "This is the movie that proves just how goofy/ugly looking Robert Pattinson is"
    },
    {
      "rating": "0.5/5",
      "review": "This should have been an episode of Stargate. They would have made a better job of it. Awful."
    },
    {
      "rating": "4.5/5",
      "review": "I hope I'm not the only one to notice the New Testament similarities"
    },
    {
      "rating": "3/5",
      "review": "If you like Pattinson go. Not really my thing. It was alright."
    },
    {
      "rating": "4/5",
      "review": "Robert did an amazing job as Mickey 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, and 18"
    },
    {
      "rating": "2.5/5",
      "review": "Don't understand a bit what it says and the entire project heads nowhere. Bong Joon Ho has distance from his glory of Parasite for what ?"
    },
    {
      "rating": "5/5",
      "review": "Best film I’ve seen in a long time, diving into politics, science fiction and aided by a stunning performance from Robert Pattinson."
    },
    {
      "rating": "1.5/5",
      "review": "Annoying and pointless satirical sci-fi that reminds one of better films and just leaves the viewer in exhaustion. The tone was all over the place and just ended up in muck. The characters were hardly developed and the make-up of the world wasn’t well defined, despite much time spent on exposition and backstory. Astonishing how much of a failure this was with so many creative elements and talent in front of and behind the camera. The cinematography, visuals, and production design were excellent, but what was it all for? Stay far away."
    },
    {
      "rating": "4/5",
      "review": "from a Sci-Fi point of view I enjoyed this movie from its satire dark comedy and just Robert Patterson my God, this is a great movie this is a fun time. I could tell you everything and basically three sentences and that won't spoil how fun and interesting this movie is. and to those who don't like it because of what it's parodying, hey, if the hat fits wear it."
    },
    {
      "rating": "5/5",
      "review": "Best movie I’ve seen in a long time!!"
    },
    {
      "rating": "3/5",
      "review": "It's neither here or there on the direction it wants to go. Is it an existential movie? Political? Ethical? Romance? They dont follow any purposefully, but still a decent watch."
    },
    {
      "rating": "4/5",
      "review": "This was pretty remarkable The performance was great the things that micky went through were insane the visuals wow some of the monsters super cool it was crazy how the mayor was acting there's some great moments in here I was very happy not disappointed at all The concept is really unbelievable."
    },
    {
      "rating": "0.5/5",
      "review": "I must be missing something here. Very slow pace, illogical, I had to FF big time to finish it."
    },
    {
      "rating": "3.5/5",
      "review": "A gloriously messy sci-fi fever dream. Bong Joon Ho swings big with clones, capitalism, and chaotic Pattinson x2. Not as tight as Parasite, but bold, weird, and unforgettable."
    },
    {
      "rating": "0.5/5",
      "review": "This movie has more real world political motivations behind it than anything else. Force feeding a narrative rarely leads to a good movie and this proves true here."
    },
    {
      "rating": "2/5",
      "review": "Mickey 17 was new and interesting, yet quite forgettable...no, scratch that, it was NOT forgettable, because it is now burned into my brain and I can't unsee how painful it was to actually view. The only reason I rate it two stars is because I watched it with my boyfriend and we both agreed it was awful. In all seriousness, the film went between picking up in a few places to absolutely dragging and feeling like it would never end. There were sex scenes that I felt were unnecessary and did nothing for the plot, and the villain was lame and annoying. (Especially his wife.) There were a few funny moments, but other than that, the only good part of this entire movie were the creepers and the part where Mickey screams when he sees his double. The only thing I appreciated is the fact that they gave Mickey 18 a different (almost alter-ego) personality from Mickey 17, because even though they were they were the same individual in body, they were different people entirely in mind which made them unique and represented that each expendable was indeed their own person in a way."
    },
    {
      "rating": "3.5/5",
      "review": "It was something new to watch."
    },
    {
      "rating": "5/5",
      "review": "Great film! Funny, good writing, and character development. A real sci-fi movie. Fine work. 10 years ago it would have made 300 million in box office"
    },
    {
      "rating": "5/5",
      "review": "This film blends existential dread with clever, biting dark humor and it does so brilliantly! The movie stands out for its creativity and effortlessly balancing moments of absurdity with genuine stakes. Another great movie from Bong Joon-ho! 👏 Robert Pattinson delivers a standout performance! His portrayal of Mickey is layered, tragic, and often laugh-out-loud funny, anchoring the film in a humanity that elevates the concept."
    },
    {
      "rating": "2/5",
      "review": "It's not great, you can tell the entire story and ending within the first 10 minutes of the movie. Everything, the human cloning part and where that goes, the alien species, its the most generic writing movie cliches ever. I love cheese movies usually but this is not done well. The directing is fine, but the characters and actors draw in no emotional connection and make zero sense for their role in the movie. I'm not sure even the writers knew what they wanted this movie to be to the point I'm not sure what I even watched, or the takeaway from it."
    },
    {
      "rating": "0.5/5",
      "review": "the first hour felt like 4 hours and it was the good part. The whole expendable thing seems unnecessary in the end and not the main core of the movie. Is just a mess of sub plots thrown in just because. it could have developed in better ways but Ho decided for the worst one possible. \"Avatar all over again\" vibes."
    },
    {
      "rating": "5/5",
      "review": "The plot is very odd but that's what makes it great. Never seems to take itself to seriously but also doesn't fall into the weird meta state that some sci fi movies do. Character development is excellent and the great acting pulls it all together. This could have gone south in a hurry but instead they created a gem of a movie."
    },
    {
      "rating": "1/5",
      "review": "Way too long and Mickey 17 was just weak. Spoiler if you don't quite know the story. A man signs up to go to another planet and allows himself to be killed over and over again to be brought back with his memories intact. So we end up with Mickey 17. 16 before all dead. The idea is much better then the execution. The acting for the two main villains is over the top and not in a fun way given this was advertised as sort of a comedy. Trust me its not nor is it interesting. This is an half hour too long a tad boring and stupid."
    },
    {
      "rating": "2.5/5",
      "review": "I was rooting for the movie the whole time but it never quite comes together (it dabbles in critiques of capitalism and colonialism but it never says anything new or interesting or even all that correct) even if there are minor elements I liked (Toni Collette's obsessions with sauces and those wooly space worms are cool)."
    },
    {
      "rating": "5/5",
      "review": "THE BABY PUPPY ALIENSSSSS AND THE FACT THAT INVINCIBLEs VOICE ACTOR WAS ONE OF THE MAIN CHARACTERS"
    },
    {
      "rating": "0.5/5",
      "review": "I wanted to like this due to all the good actors in it. However, this snooze fest was just not entertaining. Pretentious piffle at its finest."
    },
    {
      "rating": "4/5",
      "review": "It's a politically engaged film that doesn't entirely stray away from the plot itself, it only serves to further enhance the storytelling of this film. Robert Pattinson's range in his performance proves his capability to act and deliver a character that convinces you of all the Mickeys' individuality and existence. 8/10 movie"
    },
    {
      "rating": "4.5/5",
      "review": "My husband and I enjoyed seeing this in theaters. We loved Parasite and Snowpiercer. Robert Pattinson is so talented and his portrayal of Mickey should win some awards. The supporting case is equally good, love me some Steven Yuen and Toni Collette, and I am a new fan of Naomi Ackie. Really interesting concept and reminds me of other movies and shows dealing with cloning and copies of someone. This movie might not be for everyone but if you enjoy Bong Joon Ho and sci-fi, it is a must see."
    },
    {
      "rating": "4.5/5",
      "review": "Mikey 17 had a unique twist on the rebellion genre. The cloning plot line played nicely along with the over arching story line. It was nice to see 17 and 18 have two different view points, It almost like every person who sees the movie will relate differently depending which Mikey they personally relate to more. A movie that makes you ponder the dialogue that is spoken is always great in my mind."
    },
    {
      "rating": "4/5",
      "review": "Strange, different and a little bit cheesy but it's definitely worth a watch."
    },
    {
      "rating": "0.5/5",
      "review": "Trash movie. Boring. Not funny or interesting. Made it through an hour and twenty minutes and was disappointed to learn that there was still forty minutes left."
    },
    {
      "rating": "2/5",
      "review": "How on earth does Mark Raffalo keep getting acting gigs? some people should just retire"
    },
    {
      "rating": "1/5",
      "review": "I found this to be a very predictable, boring movie, full of too many stereotypes to be the edgy take on science fiction that it attempts to be. I wouldn’t waste my time."
    },
    {
      "rating": "5/5",
      "review": "Really good movie, great storyline .. second 10/10 in 2025 for me so far"
    },
    {
      "rating": "1/5",
      "review": "Heavy handed on the political commentary"
    },
    {
      "rating": "4/5",
      "review": "Good film, entertaining, satirical and funny. However, the more you watch, the more you get sad because although it is with joy that we see a large number of leads and possibilities for the plot to strengthen itself and address certain themes (populism, love triangle, human exploitation) with more force, nothing happens. It's a great shame. It's a satirical film that hasn't left the lukewarm water of the captivating 'Mickey' concept, easy to convey, and guaranteeing a wide audience, as well as the choice of the main actor. You have to see this film, if only for the series of poor Mickeys, employed worse than disposable because infinitely reusable, who behave like a sheep and who are adorable. We laugh, and we are horrified: very Irish. And the aliens, frankly, they are so fair and loyal that we almost want to be killed by them. Like: I love you too much, take my life!"
    },
    {
      "rating": "4/5",
      "review": "'Mickey 17' is an unique satirical sci-fi triumph that is throughout hilarious and filled with enough depth."
    },
    {
      "rating": "1/5",
      "review": "So Stupid.. waist of time, Cars at drive-in were leaving through this movie"
    },
    {
      "rating": "3.5/5",
      "review": "Mickey 17 has a very interesting and positive narrative, I think the director had a good proposal for the film however... I think that in some situations the central story gets a little confusing."
    },
    {
      "rating": "5/5",
      "review": "The acting and writing were great. It was nice to have seen a movie that created such intelligent material to talk about after movie with my friends. Will have to see again now to watch for other perspectives that were brought up to me."
    },
    {
      "rating": "4/5",
      "review": "Great movie. Rob killed as Mickey obviously."
    },
    {
      "rating": "3/5",
      "review": "Interesting premise and nice setup at the beginning plus the setting and characters make you want to see what develops (the weird humor definitely helps!). But midway through the movie it seems to run out of steam and becomes just plain silly and ho-hum. Maybe it's because it's just too long (2 hours 15 minutes) but at the end (no pun intended) it just wasn't satisfying, IMHO. Diehard sci-fi fans may disagree..."
    },
    {
      "rating": "1/5",
      "review": "A chewy piece of crap. Hard to believe this is the same mind behind Parasite or Snowpiecer."
    },
    {
      "rating": "5/5",
      "review": "I found this movie wonderfully refreshing. Pattison is really good in it. His voices are so unique and distinct. This movie is so dark, funny yet totally makes me think, “Yeah people would do that.” Art direction is also amazing."
    },
    {
      "rating": "3/5",
      "review": "Well the previews kind of gave away some spoilers, but I expected a little more from this movie. Patterson IMO is a very underrated actor. It felt like he was limited from performing at his maximum potential."
    },
    {
      "rating": "4/5",
      "review": "Sci fi dark comedy with plenty of humor. I loved the aliens!"
    },
    {
      "rating": "4/5",
      "review": "It's honestly slightly longer than it should, but! at the same time you kinda want it to have a sequel... It's a really interesting take on exploring space, the story is somewhat funny and the more it progress the more you develop a soft spot for Mickey and let not forget the crippers which are soooo cute... It's a great film to watch between Monday and Thursday not yet worthy of Friday but it has potential to be a good weekend comedic relief if you find it funny."
    },
    {
      "rating": "5/5",
      "review": "Phenomenal Movie. No complaints here."
    },
    {
      "rating": "0.5/5",
      "review": "I have no idea how this is getting positive reviews. It's absolutely terrible. Bad acting, exaggerated caricatures of characters and a ridiculously stupid story."
    },
    {
      "rating": "1.5/5",
      "review": "Not worth a minute. The play seems like it was written by a child. Would've been a good episode in a sitcom but not a 2 hour long movie."
    },
    {
      "rating": "0.5/5",
      "review": "Half a star, and that's only for Tim Key dressed as a pigeon. Otherwise, awful."
    },
    {
      "rating": "3.5/5",
      "review": "An impressive performance by Robert Pattison as he gets the opportunity to show various personalities and character traits in this film. Credit to Toni Collette and Mark Ruffalo who give great performances as the “villains” and I love that Mark Ruffalo’s Dictator follows Toni’s every word.  A well-written story and a great watch (one you will need to concentrate for though!) but I’m left thinking the ending was rushed. The Creepers were noteworthy and kudos to their designers."
    },
    {
      "rating": "1.5/5",
      "review": "Honestly really dragged out. It's not funny or serious just somewhere in between."
    },
    {
      "rating": "2/5",
      "review": "Es un trabajo que busca interpretar distintas temáticas, pero con una narrativa que parece sacada de una idea muy básica..."
    },
    {
      "rating": "3.5/5",
      "review": "Enjoyed it. As always, a commentary on the current human condition space development, biological research, morality, relationships, leadership egos and war."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie, very relevant to our current situation."
    },
    {
      "rating": "2/5",
      "review": "An ambitious and technically well-made film, but too long and not funny at all."
    },
    {
      "rating": "4/5",
      "review": "Confusing beginning but explosive finale."
    },
    {
      "rating": "5/5",
      "review": "I personally loved it. I am a sci fi and independent movie fan and this pulled both worlds together."
    },
    {
      "rating": "4.5/5",
      "review": "Great sci-fi fun. Plays like a Wes Anderson shags Fifth Element movie....cool as hell. Impressed with cast most notably J Pattison, Ruffalo and College."
    },
    {
      "rating": "3.5/5",
      "review": "Es una película entretenida"
    },
    {
      "rating": "3.5/5",
      "review": "A thought provoking, funny and absurdist look at the near future with interesting themes of death and rebirth or \"reprinting\". Feels like groundhogs day meets Aliens, but a bit less exciting. The story misses many opportunities and fails to fully flesh out the more poignant and exciting aspects of its main protagonist predicament of being able to artificially regenerate aboard an intergalactic colonizing mission. Maybe it should of been a series. Still fun and entertaining with amazing performances all around and a scrumptiously devious and annoying performance by Mark Ruffalo. Cool movie!"
    },
    {
      "rating": "3/5",
      "review": "Lost the plot a bit there, and makes you really confused about characters and their motivations. Had really cool ideas and you can tell the actors are talented but it gets a bit lost under the empty wandering that is the plot."
    },
    {
      "rating": "3.5/5",
      "review": "Mickey 17 was a fun scifi movie. The story is pretty good but you can feel a certain limitation in the budget at times. That said it does rely on certain CGI effects, but you basically stay on the ship or one planet, The acting is superb, but the senator role is wildly exaggerated. I also didn't like the odd voice choice (a nasal child like) they did for Mickey, but it 's bearable. The sounds are pretty good. I give it a 75%. Good movie worth at least one watch, but if you dislike Ruffalo or Pattisson, it might not be for you. They pretty much carry the movie."
    },
    {
      "rating": "4.5/5",
      "review": "Really fun sci fi adventure with a good political message. I appreciate the almost Star Wars aesthetic but with adult themes. It’s one that must be seen in theaters to fully appreciate. Plus I love Bing Joon Ho. He always mixes righteous politics with a wacky sense of humor."
    },
    {
      "rating": "2/5",
      "review": "The storyline was interesting but not well executed. Tried to be funny at times, but it just didn't work. The ending was a letdown and didn't quite make sense."
    },
    {
      "rating": "1.5/5",
      "review": "Really wanted to like this but thought it was terrible. The performances are so hammy and scream non comedic actors trying to be funny. There were a few enjoyable moments but this was down to the editing team which I will praise. The narration of Robert Pattison forcing a nerdy American accent gives it an inauthenticity that runs through the film. I've seen it being compared to Terry Gillian but its lacks the surrealism, artistry and emotional heart of his work. Finally the message of colonialism and corrupt politicians is so basic it make you start to think starship troopers is highbrow. I have no idea how this was a $200m film is you want to see the concept done right watch Moon"
    },
    {
      "rating": "0.5/5",
      "review": "This is hands down the worst movie I've ever seen. The plot goes absolutely nowhere, the characters are weak with steely little to no development, with an ending that could have come far sooner. Are movies just getting worse or what?"
    },
    {
      "rating": "5/5",
      "review": "I loved it it was such a funny yet dramatic film I felt bad for Mickey along the way I could feel his pain 5 stars no doubt I 100% say to watch this 10/10 loved it"
    },
    {
      "rating": "1.5/5",
      "review": "The first half of the movie was good but then it turned very silly. I wish I would have left before it was over."
    },
    {
      "rating": "5/5",
      "review": "It was an abosulute delight! Robert Pattinson portrayed 17 just right: a naive boy that should not have has much of an interesting character as it turned out to be. Even the portrayal of 18 was wonderful as just by mannerisms was easy to tell which one was which. The caricatures played by Marshal and his wife were ridiculous and yet closely resembling the current political leaders. Great job by those actors too. Do not come in expecting Parasite 2.0, It's a genuine Hollywood film, but it is a great one. The two hours went by quickly, definitely a must watch. Happy ending was the good surprise I wasn't expecting. Really good."
    },
    {
      "rating": "0.5/5",
      "review": "Disappointing, very disappointed."
    },
    {
      "rating": "3/5",
      "review": "interesting plot but went all over the place with too many different threads and paths."
    },
    {
      "rating": "3/5",
      "review": "Um filme bem simples, não vão com muita expectativa para o filme..."
    },
    {
      "rating": "1/5",
      "review": "Slow and terrible after 30 mins."
    },
    {
      "rating": "3.5/5",
      "review": "Sorry but Mickey’s accent, killed it for me. Otherwise the Hulk did an amazing job contorting his face and voice."
    },
    {
      "rating": "1/5",
      "review": "I appreciate how the director was trying to do something different. Ruffalo sidelines the movie by doing a cringe bit of a president during the whole movie. I get he is struggling, but why should one man's political opinion jeopardize all the other people who are working on this film? The movie then finds time to mock Christian faith, prayer, and worship. It loses itself in its own mockery. I had to turn the movie off half way through because it was so bad. I'm so grateful I did not actually spend a penny on seeing this movie, save yourself the time."
    },
    {
      "rating": "2.5/5",
      "review": "Not sure what to make of this movie. It's sci-fi like Starship Troopers but no action. But also like Hunger Games and Save the whales? Everyone knows the Korean director but there's only one Korean actor in the movie? It's not an action movie even though it's sci-fi but the CGI alien species is pretty good. Overall pretty boring, definitely wouldn't watch again. Maybe Korean directors should stick to Korean revenge dramas since they make some of the best. Sci-fi movies should be done by American directors since sci-fi is our bread and butter."
    },
    {
      "rating": "1.5/5",
      "review": "The Whole concept dad potential but the story was poor and nonexistent. The comedy was completely unnecessary and not good had times along with mark ruffalo's performance just was not funny. If the film could of been 90min easy and told a serious story but it is nothing more than a comedy with no plot."
    },
    {
      "rating": "1.5/5",
      "review": "Too long and not as funny as some claim. The world \"subtlety\" is used to suggest there is humour but hidden. I couldn't find it which means it isn't funny for some people or not there at all. Its plot is convoluted and unnecessarily. It's as if the writers wanted to give the idea that all those things that happen on screen actually have a purpose. And they don't, unless the director's intention is to trick the audience into some kind of consensual zombie state that this is a very clever film. For those who love the journey rather than the destination, and by that i mean who love the view of distorted passing scenery from a bus window, this might be for them."
    },
    {
      "rating": "3.5/5",
      "review": "Slightly disappointing. After watching the trailer for this movie and reading the plot, I was really excited for this movie, but after watching it, I felt a bit disappointed as I expected a much different and exciting storyline. The movie itself was not bad, it was pretty good. Robert Pattinson was incredible, the way he made Mickey 17 and Mickey 18 feel like completely different characters is just a testament to his incredible range and acting ability. Mark Ruffalo also did an amazing job as playing a snubby politician who only cares about himself and no one else, his character was extremely unlikable throughout the movie which was a good thing. I expected this movie to be about a guy, going on many adventures and dying and being reprinted each time, and for there to be this big bad. What we got instead was a \"civil war\" between Mickey 18 and Kenneth Marshall, and a few alien creatures who wanted peace. The acting and many scenes were done really well which made the movie enjoyable, just a little let down by the storyline. Overall this is a good movie but nothing too crazy."
    },
    {
      "rating": "0.5/5",
      "review": "Hard to follow, boring, all over the place. Felt like it was trying to be The Hunger Games, mixed with starship troopers. Worst movie I've seen in ages."
    },
    {
      "rating": "2.5/5",
      "review": "Started out entertaining and interesting but then just died off."
    },
    {
      "rating": "3.5/5",
      "review": "Mickey 17 is a fun twist on the clone concept. The film is funny, well-directed, and well-performed. It loses a little steam in the second half, but it's definitely a good time."
    },
    {
      "rating": "0.5/5",
      "review": "ruffalo again brings sewer smell to any movie he iz in . the story and the lame cgi of alien cowz - far from great , toni collette and naomi are a joy to watch while pattinson just makes sure in every frame to show how ugly is character is , but micky should be loveable even tho is a little ugly - that is the reason all the women in the movie want to boink him ."
    },
    {
      "rating": "5/5",
      "review": "Me gusto un montón está propuesta disruptiva con tintes aveces hasta absurdos, me divertí en el cine está vez! 10/10 para Robert, lo está haciendo increíble cada vez ✨"
    },
    {
      "rating": "3/5",
      "review": "I absolutely loved the first two-thirds of the movie. Pattinson's eccentric performance is hysterically dark and subtle, while still coming across as an incredibly likeable everyman. The final third of the movie leans hard into Ruffalo's uninspired impression of a certain politician and the plot devolves into boring adventure movie cliches that feel like they're from an entirely different film than the first 2/3. However, I enjoyed the first 2/3 of the film so much that I have to recommend it. It's a lesser Bong Joon Ho film, but it still has enough of the touch of an auteur to be worth your while."
    },
    {
      "rating": "5/5",
      "review": "Robert is fantastic."
    },
    {
      "rating": "3.5/5",
      "review": "While it may serve as proof that directors tend to lose their touch after they winning at the Oscar’s, it pulls a few punches that are worth watching at least once."
    },
    {
      "rating": "5/5",
      "review": "Highly creative, beautiful production design, amazing performances with a creative story. What more could you want?"
    },
    {
      "rating": "3.5/5",
      "review": "Mickey 17 is a bold, bizarre sci-fi ride from Bong Joon Ho that juggles cloning, colonization, and... an obsession with sauce? Robert Pattinson delivers a fantastic dual performance as two versions of the same man, and the visuals are top-tier. But despite the intriguing premise and strong acting, the film buckles under its own ambition—stuffed with half-baked subplots, cartoonish side characters, and tonal whiplash. One minute it’s existential dread, the next it’s pigeon suits and slapstick comedy. It’s a movie that dares to be different, but ends up feeling like five movies crammed into one. Verdict: Fascinating, flawed, and worth a watch—just don’t expect another Parasite."
    },
    {
      "rating": "5/5",
      "review": "AMAZING QUIRKY GREAT STORYLINE HUMOROUS"
    },
    {
      "rating": "4/5",
      "review": "For all its cheesiness I really enjoyed this movie."
    },
    {
      "rating": "1/5",
      "review": "Absolute trashhh movie. No plot and the story doesn’t lead anywhere"
    },
    {
      "rating": "2.5/5",
      "review": "sooooo many plot points that went nowhere. felt too drawn out overall."
    },
    {
      "rating": "3/5",
      "review": "Movie was funny at times and was GREAT , but the length of the movie and the main event being pushed and I felt like rushed at the end was unnecessary for it be that long for no reason."
    },
    {
      "rating": "1.5/5",
      "review": "The film featured many significant characters, but they didn’t feel impactful or well-developed."
    },
    {
      "rating": "1/5",
      "review": "Malísima. Malas actuaciones especialmente la de Marck Ruffalo"
    },
    {
      "rating": "1/5",
      "review": "So so bad. Written by someone who hates normal. I wasn't a huge Mark Ruffalo fan to begin with, though I did like him as the Hulk, but I may never go see another one of his movies again. his character is so grotesquely unlikable. The concensus amongst my friends who saw the movie last night, is that the movie was written to mock every aspect of the current political administration. It was so over the top. Don't waste your hard earned cash on this one. We wish we hadn't."
    },
    {
      "rating": "2.5/5",
      "review": "The execution of the film was outstanding, great CGI, world-building accompanied with superb acting. This was let down by a boring story with no attachments to any of the characters leaving it feeling like a waste of time. Overall - It’s alright."
    },
    {
      "rating": "0.5/5",
      "review": "This was the first movie i walked out of"
    },
    {
      "rating": "2/5",
      "review": "If you like your political commentary and satire as subtle as dental work done with power tools then maybe this is for you. Everyone knows villains will study pathology on an innocent without empathy, but they also know how public sentiment can kick them in the granticles so they tend to hide their evil villainy. I get the over-the-top satirical comedic attempt but do we really need two copies of a protagonist that push both edges of edgelord at the same time? This movie threw a whole cast of social antiheroes at us by grinding our noses in humanity's carpet bombs at every opportunity? Gah... give me a break."
    },
    {
      "rating": "5/5",
      "review": "WOW, just wow. Not an easy movie. ItItss a lot. But that's what we want from movies sometimes."
    },
    {
      "rating": "5/5",
      "review": "Beautiful satire and commentary. And Mark Ruffalo as the Trmp figure - exquisite"
    },
    {
      "rating": "1/5",
      "review": "Painfully stupid. If you take the low IQ character writing of something like the Hunger Games. Which is understandably written for teenagers. Then divide that IQ in half. You get the characters in this movie. NOT ONE SINGLE person acts like an adult. Instead pretty much every character, and worse of all, all the main characters. Act like the insane version of adults that a 14 might find believable."
    },
    {
      "rating": "3/5",
      "review": "Beautifully shot, Pattinson is fantastic, doesn’t quite all come together and tone is all over the place. Appreciate the big swings, just missed by a bit."
    },
    {
      "rating": "5/5",
      "review": "If you like Robert Pattinson, it’s a must see. He is really coming to his own in this physicality and mentally demanding role. Sci- fi satirical statement of society, you can watch Mickey make himself available “to discard” because he is poor, desperate, but has a special ability. The uber rich, ignorant couple take advantage of “subjects” in the name of science to try to inhabit a planet that already has its occupants. I am a sucker for the underdog!"
    },
    {
      "rating": "3.5/5",
      "review": "Good film, great root story line, well produced! Fun movie but too much political satire for me."
    },
    {
      "rating": "3/5",
      "review": "It was Ok like the actors were really good and the there was some good moments but there was a lot of plot holes that did not get explored"
    },
    {
      "rating": "1.5/5",
      "review": "I liked the social critique about colonization, the exploitation of people for purposes of ''science'' but I think the gratuitous mocking of the ''church'' or ''company'' as they call it in the movie is taking it a bit too far. Portraying all the bad guys as devoted members of the ''church'' and mocking prayer and religious singing... I didn't find that funny. And if you think this is an action movie, it's not exactly. As in for the rest, it is somewhat funny"
    },
    {
      "rating": "3/5",
      "review": "Major waste of time. Gets more and more ridiculous. But Pattisons is very sweet and endearing."
    },
    {
      "rating": "3/5",
      "review": "While overlong and narratively unfocused, Bong Joon Ho's Mickey 17 is still able to replicate continued laughs amid all the scientific, sociological satire."
    },
    {
      "rating": "5/5",
      "review": "This movie is very well understood by introverted people because it shows how much polite, introverted, and shy individuals have been wronged and had their rights taken away in society.❤️‍🩹 From a cinematography perspective, the film had excellent framing, and with Robert Pattinson’s outstanding acting, this movie deserves higher ratings, like an 8.5 out of 10 or even more. 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥"
    },
    {
      "rating": "5/5",
      "review": "Just go watch it and don’t even judge the movie enjoy it !!!"
    },
    {
      "rating": "4.5/5",
      "review": "I am a movie lover and until now wasn't really a fan of Robert Pattinson but he did an amazing job in this movie and playing the dual role was spectacular. It was funny, and yes the cheesy roles played by the married couple running the show, played by Toni Colette and Mark Ruffalo, who you love to hate was nice to see them in less serious roles. The little aliens are just so darn cute! While it's not an \"alien\" movie, they do factor in and add to the humour in this movie. I can't wait to watch it again."
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good original story, glad I saw it. May not be one I need to see again, but not bad."
    },
    {
      "rating": "2.5/5",
      "review": "Fun & sharply edited, but overly long doesn't know what it wants to be. Great premise, great start but meandering plot switches gear halfway thru from poignant social/labor commentary to benevolent aliens-vs-ignorant humans...a boring, played-out trope. Senseless subplots weigh down the narrative and pull from focus from where it should be, on Mickey."
    },
    {
      "rating": "0.5/5",
      "review": "As bad as Dune 2 but more turgid."
    },
    {
      "rating": "5/5",
      "review": "Did not fall asleep!"
    },
    {
      "rating": "4/5",
      "review": "I went to see it in the cinema after I managed to get family to go to it. I knew about it enough to convince them. I also try to see or read as little as possible about any movie. Making the correct trailer is a lost art. Most trailers give out too much information about the movie. I try to make my movie reviews as spoiler free as I can. I have to say movie hit a little too close to home, considering our current political environment. The movie is a good satire about where we could be in a few decades. It is a lot more like Arrival when I think about how aliens are portrayed. There is an actual story that makes sense. Actors are good, I cannot say if any of them were better than the others. All of them were very well picked. To my surprise, I discovered recently there is an actress of Romanian origin in it. Movie looks very well, it has very nice Star Wars like scenes and takes advantage of its imagery. It is well worth to be seen on a large screen. When it will hit streaming, I will watch it again, I am sure I missed a lot of Easter eggs. I actually consider this movie a direct descendant of another lost gem, Idiocracy. This is the Idiocracy of our times."
    },
    {
      "rating": "3.5/5",
      "review": "Mickey 17 is an entertaining film that, while promising more, doesn’t fully live up to its potential. The premise is interesting, but the plot turns out to be simpler than expected—at times even feeling somewhat silly. It seems like the film could have offered a more complex and thought-provoking narrative, but it stays on the surface. Robert Pattinson delivers an excellent performance, once again proving his versatility and commitment to unique roles. Mark Ruffalo also does a great job, as expected, though his character isn’t as impactful or layered as one might have hoped. Visually, the film stands out with well-executed special effects and immersive world-building. In that regard, it’s a spectacle worth watching on the big screen. In conclusion, Mickey 17 is an entertaining movie with strong performances and solid production values, but it ultimately feels like it could have been a more ambitious and profound experience."
    },
    {
      "rating": "5/5",
      "review": "This film held the same aesthetic as Snowpiercer another 5/5 experience. All elements of this world and version of reality were so well explored and crafted that only left me wanting more time with it. The humour hit every time from all characters and their quirks. I don't believe there was a thing that could make the film better, other than being longer."
    },
    {
      "rating": "1/5",
      "review": "Wow. What a stinker! Garbage – and yes, I get it. A feeble tale that might have scored some satirical points but only collapses into to a ham-handed attempt at camp after the knife dulls. An odiferous stew of bad scenes better left on the cutting room floor. Viewers are subjected to repetitious, redundant gags that weren't clever the first time and didn't improve with the recycling. If the aim was to deliver a deliberately awful film, mission accomplished. A shame considering how good was Parasite. Bong Joon Ho is an emperor without a stitch of clothing who disgraces himself with this mess."
    },
    {
      "rating": "4/5",
      "review": "There are so many reasons I loved this movie: Pattinson successfully plays against his leading man type; Ruffalo and Collette's bombastic performances are completely hilarious and over the top; the story speaks to our moment in political history; and the director made me care about the little Creeper critters. The film moves like lightening but still has a heart."
    },
    {
      "rating": "5/5",
      "review": "Great acting, fun movie, interesting concept — unique directing and style that may not be for everyone. Awesome, to me."
    },
    {
      "rating": "5/5",
      "review": "Micky 17 is a unique and entertaining film. In true Bong Joon Ho style, Micky 17 entices the viewer to consider deep philosophical and ethical questions about life and humanity, whilst critiquing power, through laughter and absurdity. Another win for the directer, well cast, great dialogue, fun and entertaining."
    },
    {
      "rating": "5/5",
      "review": "DARK, SAD, HILARIOUS! A great and honest representation of how humanity handles the future. A grand adventure in total"
    },
    {
      "rating": "4/5",
      "review": "I enjoyed the movie. There were stellar performances all around. Robert Pattinson was the reason I came to see it, and he did not disappoint. Mark Ruffalo and Toni Collette were a surprise for me, but they also did a decent job of being the absolute worst. The movie all around was worth the watch. The story was decent, but the themes of the film were screaming where a more reserved voice could have done the same. I would recommend and would even venture to watch again, despite some of the film's weaknesses."
    },
    {
      "rating": "4.5/5",
      "review": "Me gustó más de lo que esperaba"
    },
    {
      "rating": "3/5",
      "review": "A great idea and a great book and original story. But absolutely ruined by Ruffalo’s ridiculous characterization of Kenneth Marshall."
    },
    {
      "rating": "5/5",
      "review": "A refreshing sci-fi take on the perils and horrors of life when marred with incompetent leadership, the devaluation of human rights, and disregard for the consequences of \"letting the ends justify the means\"."
    },
    {
      "rating": "1/5",
      "review": "This movie lacked a plot and the acting was horrible. I feel like I wasted my time and money. Good effects."
    },
    {
      "rating": "0.5/5",
      "review": "This is why people stopped going to the movies: moronic, insufferable, incoherent, meandering, weak, and pretentious."
    },
    {
      "rating": "2/5",
      "review": "Walked out with 30 minutes to spare. This movie plot was all over the place and lost sight of the amazing philosophical ideas this movie was supposed to tackle. “Comedy” scenes were mildly chuckle worthy, most “meh.” Trump impersonation was a cheesy hack job and just poorly done, just boring with no real purpose behind it other than a boring overdone “Trump sucks” statement. Sexy, sultry scenes took up way too much screen time for very little value. Amazing visuals, and Robert Pattison acting KILLED IT, as in it was amazing. :)"
    },
    {
      "rating": "1/5",
      "review": "Two hours of my life I'll never get back. Worst movie I have ever seen in a theater."
    },
    {
      "rating": "2.5/5",
      "review": "Great premise. So-so story. Really weak dialogue."
    },
    {
      "rating": "1.5/5",
      "review": "Poor plot and a very slow start that doesn’t allow you to connect with the characters. Very surface level writing which is so unfortunate as this film had a really strong concept. If this film was 30-50 minutes shorter, maybe it would’ve maintained the audiences attention."
    },
    {
      "rating": "1.5/5",
      "review": "Bong's first bad film. Ya hate to see it."
    },
    {
      "rating": "0.5/5",
      "review": "The main plot is fragmented, the relationship between the characters is not high, and many places that can be elaborated are not explained. The appearance of the King Insect is just a villain; Expendable, the core of the movie, didn't give in-depth explanation. The whole movie is just worth watching through streaming movies and it is still crap = = ."
    },
    {
      "rating": "1/5",
      "review": "The movie is horrible, it's not a comedy, it has jokes for adults that a pure American adult will find funny, and it's uncomfortable if you go to the theater with children."
    },
    {
      "rating": "2/5",
      "review": "A bigger budget, more bloated, version of Moon (2009) which is just a better written film. Pattinson is a caricature in this. Ruffalo was borderline unwatchable. Bong Joon Ho is considered a genius, but this is certainly a mark on his career considering the script is woefully dumb. Also, its possible to just write and direct a good film without cramming heavy handed social commentary into everything you create. Or y'know... just be more subtle."
    },
    {
      "rating": "4/5",
      "review": "Bong Joon-ho strikes cinematic gold once again with his latest sci-fi satire, Mickey 17. As always, Bong’s deft touch is evident in his exploration of a dystopian world, where he delivers a chillingly relevant critique of a fascist government. The timing of this film’s release is especially poignant, resonating not only with the political climate of the United States but with the global instability that looms over us all. Mark Ruffalo’s performance is a standout, delivering a portrayal that is both chilling and captivating. It’s clear that he drew heavy inspiration from a certain real-life figure, infusing his character with an intensity that leaves little to the imagination about his motivations and the dark, twisted psyche that drives him. Robert Pattinson, meanwhile, delivers a stunning dual performance as the titular Mickey, skillfully breathing unique life into two distinct iterations of the same character. His nuanced portrayal showcases his ability to differentiate the two versions, making each one feel fresh and dynamic, a feat that adds layers to the film’s complex narrative. Like many of Bong Joon-ho’s films, Mickey 17 is a work that rewards multiple viewings. Its rich, thought-provoking story and underlying themes will unfold more with each watch, revealing new layers and deeper meanings. This is a film that stays with you, demanding both reflection and interpretation long after the credits roll."
    },
    {
      "rating": "4/5",
      "review": "Bong Joon-ho strikes cinematic gold once again with his latest sci-fi satire, Mickey 17. As always, Bong's deft touch is evident in his exploration of a dystopian world, where he delivers a chillingly relevant critique of a fascist government. The timing of this film's release is especially poignant, resonating not only with the political climate of the United States but with the global instability that looms over us all. Mark Ruffalo's performance is a standout, delivering a portrayal that is both chilling and captivating. It's clear that he drew heavy inspiration from a certain real-life figure, infusing his character with an intensity that leaves little to the imagination about his motivations and the dark, twisted psyche that drives him. Robert Pattinson, meanwhile, delivers a stunning dual performance as the titular Mickey, skillfully breathing unique life into two distinct iterations of the same character. His nuanced portrayal showcases his ability to differentiate the two versions, making each one feel fresh and dynamic, a feat that adds layers to the film's complex narrative. Like many of Bong Joon-ho's films, Mickey 17 is a work that rewards multiple viewings. Its rich, thought-provoking story and underlying themes will unfold more with each watch, revealing new layers and deeper meanings. This is a film that stays with you, demanding both reflection and interpretation long after the credits roll."
    },
    {
      "rating": "4/5",
      "review": "Even though it's 2 hours long, it kept me entertained and made me laugh 😂 Robert Pattinson nailed it 🤩👊 A fun watch 🧐✌️"
    },
    {
      "rating": "4/5",
      "review": "I thoroughly enjoyed this film. On the surface, it’s an excellent sci-fi, absurdist comedy/drama, with shades of Terry Gilliam, a drop of Wes Anderson, and a *smidgen* of Jean Pierre-Jeunet, and underneath is a beautiful (if confrontational) examination of capitalism, politics, religion, and the value of a single human life This is a movie for people who like a puzzle, who ponder philosophy, who appreciate layered storytelling, and not for someone who just wants to sit down and turn their brain off. If you are one such who seeks to *connect* with a film, someone who searches for a tale with *meaning*, then I cannot recommend this one highly enough"
    },
    {
      "rating": "1/5",
      "review": "Stupid humor. Dumb plot."
    },
    {
      "rating": "2.5/5",
      "review": "Mickey 17 isn’t really good or bad—it’s one of those movies that’s fun but not exactly memorable. The satire works well, poking fun at things we deal with in everyday life. It’s not a masterpiece, but it’s not a waste of time either. Worth watching as long as you don’t expect too much!"
    },
    {
      "rating": "2/5",
      "review": "I wish I could forget that I saw this."
    },
    {
      "rating": "1.5/5",
      "review": "The premise had so much potential, but this movie fails to explore it in any depth. Instead it wastes time with childish writing and hand-holding dialogue to make it clear that the writers thought very little of the audience. From the dumb antagonist basically kicking a puppy to make sure you get that he’s the bad guy - to the female protagonist explaining the plot in case you weren't following along, it ends up being less “Living With Yourself” and more like “Spy Kids”."
    },
    {
      "rating": "1.5/5",
      "review": "It has a cold, unredeeming darkness and hopelessness that lingered in theme and visually."
    },
    {
      "rating": "1/5",
      "review": "It tried to be too many things at once, and in the process is nothing of them particularly well. The story, apart from the main premise, is pretty dull. (It felt a bit recycled overall) The overall tone is a very unsettling mix of serious and comedic. It reminded me a bit of starship troopers (which I also didn't really like), but a bit more extreme on both ends. (Trying to take it self serious, while at the same time making zero attempt at hiding the ridiculousness - and weakly executed social commentary)"
    },
    {
      "rating": "0.5/5",
      "review": "My far the worst movie i had to pay to watch in my life.The actors protrayed a dumb version of themselves, Bad"
    },
    {
      "rating": "3.5/5",
      "review": "I was bored in the beginning and middle and the movie didn't captivate me. But the ending is well done."
    },
    {
      "rating": "3/5",
      "review": "It is an amazing ok movie. However, The antagonist is too much of a caricature."
    },
    {
      "rating": "3/5",
      "review": "Pattinson delivers his best performance yet, and the film is well-directed. However, what starts as a promising story ultimately falls into cliché."
    },
    {
      "rating": "4/5",
      "review": "The family had a lot of fun at this movie, it treads the line between absurdist social commentary and moving emotional impact while still being able to twirl around many different topics from exploitation, privilege, ethical technology and more. The effects were good, a balance between minimalist and well chosen big budget style for effect."
    },
    {
      "rating": "3.5/5",
      "review": "Enjoyed this one and liked the premise that is evidently based off of a book. I do think it could have been 20 minutes shorter and there is a clear lull in the middle that if trimmed would have made things better. I am not a huge sci-fi person so with the cloning already happening I think not making things on a new planet would have helped. But that is definitely just me. Overall a solid movie."
    },
    {
      "rating": "1/5",
      "review": "Terrible movie!! Ruffalo was at his worst"
    },
    {
      "rating": "1/5",
      "review": "seems like it was written by someone that doesn't know how humans converse with each other and it almost seems like someone's fanfiction"
    },
    {
      "rating": "4/5",
      "review": "A little weird but a good watch"
    },
    {
      "rating": "3/5",
      "review": "Good acting. Interesting storyline. Probably could have trimmed a half hour off and tightened it up"
    },
    {
      "rating": "2/5",
      "review": "I went in with really high expectations, Robert Pattison is working better and better, but this was not a great movie. Forced humor, Mark Ruffalo is so bad is painful to see Don't waste money on this, just stream it"
    },
    {
      "rating": "0.5/5",
      "review": "Boring, long, weak story line. Time you will never get back."
    },
    {
      "rating": "3.5/5",
      "review": "Fun and original movie, with good writing and acting."
    },
    {
      "rating": "5/5",
      "review": "Loved the bizarre dark humor and acting. I laughed way more than I expected and was entertained the whole time. The social commentary was complimented by some surprisingly sweet moments, thought provoking moral situations, and some satisfying vengeance. 10/10"
    },
    {
      "rating": "5/5",
      "review": "very unique and cool"
    },
    {
      "rating": "3/5",
      "review": "Drawn out ending, could’ve been an amazing hour and a half movie but it’s solid."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible Movie. Wish I could give it negative stars."
    },
    {
      "rating": "1/5",
      "review": "Most bizarre movie I think I’ve ever seen. 👎👎"
    },
    {
      "rating": "4/5",
      "review": "It was funnier than I expected. Great job on the special effects."
    },
    {
      "rating": "3/5",
      "review": "Entertaining and yet disturbing movie. Wish the characters other than Mikey were developed better."
    },
    {
      "rating": "3/5",
      "review": "Not what I expected, the movie was alright."
    },
    {
      "rating": "3/5",
      "review": "Movie was entertaining but it was longer than it needed to be. Toward the end you’re think dam it’s till going. Watch it home."
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely terrible, bad script, crummy acting and unnecessary strong political overtones throughout the film."
    },
    {
      "rating": "1.5/5",
      "review": "Only saving grace here is the great acting and special effects. Unfortunaly, the script and story here is like a bunch of crabs in a bucket bringing everything else down. One of the blandest and unfunniest satire i ever saw; plus the trailer tried to sell this movie as if it was purely a dark comedy focused on Mickey dying over and over again through the whole movie, which wouldve been a lot better, so this movie is not only bad but also a disappointment."
    },
    {
      "rating": "1/5",
      "review": "Not exactly sure why this is getting such high marks. Three of us saw the movie and none of us liked it. The film started out with great promise but then 45 minutes in it took a silly turn, with disjointed, pointless scenes and characters that had absolutely no reason to even be in there, and added nothing to the 140 minute story. I'm going to assume the positive reviews have to do with the not so subtle political commentary. Worthless, for the most part, which is a shame. A talented writer/director could have done great things with this concept, but it ended up sounding like a petulant 17 yo wrote and directed it."
    },
    {
      "rating": "0.5/5",
      "review": "Hated it. Entirely too long to tell such a convoluted story. Tried to be too many genres sci-fi, comedy, satire, horror at one point. It just felt so non-cohesive."
    },
    {
      "rating": "4.5/5",
      "review": "Overall, it's a pretty subtle film in its essence. Even though it doesn't seem that way at first."
    },
    {
      "rating": "0.5/5",
      "review": "How did this get made?!"
    },
    {
      "rating": "5/5",
      "review": "Good movie! Mad respect for Robert Pattinson & Mark Ruffalo & what’s that, Toni Collette! Amazing!!!!"
    },
    {
      "rating": "1.5/5",
      "review": "Not even a rental, definitely skip that one. Neither Robert or I liked it. 4 out of 10. Had a couple of interesting ideas but wasn’t structured well and wasn’t sure what type of movie it wanted to be both tonally and thematically. Had a random part tacked on and overall seemed like it would never end. I was wanting to tap out after 20ish minutes. Not the worst I’ve ever seen but I’d never watch it again. Robert Pattinson did well though. Mark Ruffalo was believable portraying a different character than what we’ve seen from him, but he must have thought he was in a different movie. He played his character like a cartoon."
    },
    {
      "rating": "4/5",
      "review": "Movie was pretty good I liked it a bunch if you're into sci-fi thriller then I highly recommend it."
    },
    {
      "rating": "1/5",
      "review": "Such a horrible piece of crap. I shouldve gone home but instead, I took a nice little nap."
    },
    {
      "rating": "2.5/5",
      "review": "Longer than it needed to be, and not super exciting. The storyline oddly mirrors what's going on in America right now in some ways."
    },
    {
      "rating": "1/5",
      "review": "Some clever moments but overall VERY predictable plot line."
    },
    {
      "rating": "0.5/5",
      "review": "Horrible. Can't even give it one star"
    },
    {
      "rating": "5/5",
      "review": "I love how its the perfect mix of social criticism, that is frankly very pointed, mixed with comedial elements and the omance subplot is just so beautiful to me. Like they are REAL lovers. Honestly a new favorite for me."
    },
    {
      "rating": "0.5/5",
      "review": "Interesting premise but poor execution. The movie was DUMB overall. Heavy handed and boneheaded portrayal by Mark Rufalo of his favorite political figure. Not worth the price of admission."
    },
    {
      "rating": "1/5",
      "review": "One of the most boring movies I’ve watched in a while. Drags on for too long. The don’t waste your time. Not worth the watch"
    },
    {
      "rating": "1.5/5",
      "review": "The movie had charm and was funny at times, but Ruffalo killed most of it. It wasn't tongue in cheek. It was Ruffalo and Ho doing everything they could to make a political statement. And the actual irony? Their target will never see the film nor care that it ever existed."
    },
    {
      "rating": "5/5",
      "review": "Best movie I have ever seen. Robert Patterson gave an amazing performance. The storyline was interesting and new and the CGI was really amazing compared to a lot of movies coming out recently and it’s just overall a beautiful film."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie I've seen in a long time.. Very Predictable even with the meandering plot. The only good part of the movie were the ending credits... This movie should have been straight released to DVD in the $5 bin at Walmart..."
    },
    {
      "rating": "5/5",
      "review": "This movie is incredible and wildly entertaining. Not only was it an amazing sci-fi story, but it really made me question my mortality and value my life, and it was really fun to watch. I definitely recommend it for sci-fi fans!"
    },
    {
      "rating": "1/5",
      "review": "When looking at reviews ask yourself if the person reviewing the movie watched it all because Mickey 17 starts out so well. Unfortunately about half an hour in it just stops being good. Too bad. Such a great idea poorly executed."
    },
    {
      "rating": "5/5",
      "review": "One of the best films I've seen in a theater in a long time. The cast is very energetic and Robert Pattinson showcases his range to the fullest. Masterpiece"
    },
    {
      "rating": "3/5",
      "review": "a few very funny moments, but overall a bit on the nose. still very well executed"
    },
    {
      "rating": "5/5",
      "review": "Very well done! Robert Pattinson is brilliant."
    },
    {
      "rating": "5/5",
      "review": "Crazy unique and weird in a good way"
    },
    {
      "rating": "4.5/5",
      "review": "Robert Pattinson is great as always."
    },
    {
      "rating": "1/5",
      "review": "First half is interesting, but then the movie nosedives into predictably and cheesiness. True example of how to wreck an interesting film."
    },
    {
      "rating": "3/5",
      "review": "It was cool but I think they could have done more with it. A bit underwhelming"
    },
    {
      "rating": "1.5/5",
      "review": "If you are looking for a fun, interesting and engaging story, watch another movie."
    },
    {
      "rating": "3/5",
      "review": "It was weird and there are parts of the plot I wish more time was spent on, but it was pretty enjoyable and different."
    },
    {
      "rating": "3/5",
      "review": "This movie could’ve been better. Could’ve toned down some of the strange stuff, thankfully there was a dash humor."
    },
    {
      "rating": "1.5/5",
      "review": "Absolutely stupid story and rediculous acting..sleep worthy."
    },
    {
      "rating": "5/5",
      "review": "Original idea, Fun, and Thought provoking. Ruffalos performance is purporsfully over the top and brings the movie together."
    },
    {
      "rating": "4.5/5",
      "review": "Such a fun idea of the not so distant future with an amazing performance from everyone involved!"
    },
    {
      "rating": "3/5",
      "review": "This movie should have been U and the unnecessary sex scenes need to be removed for it to have made commercial sense. Director Bong should have stuck to Capitalism and Sci Fi bit. Too many strains diluted the narrative."
    },
    {
      "rating": "3.5/5",
      "review": "Mickey 17 è un'enorme prova di abilità da parte del regista Bong John-ho che ci regala un'altro notevole film. Non è perfetto ma ci sono gli ingredienti fondamentali di un film: intrattenimento a volontà, battute simpatiche, scene d'azione e un bel senso della storia."
    },
    {
      "rating": "2/5",
      "review": "I didn’t like it. It was kind of long, kind of confusing and I just couldn’t believe the storyline. I know it’s a fiction movie. But you want to almost believe a storyline as if it’s possible it could be real life and I just don’t. It could’ve been much better."
    },
    {
      "rating": "0.5/5",
      "review": "This movie had so much potential. Unfortunately it was a thinly veiled political brow beating. We left half way through."
    },
    {
      "rating": "5/5",
      "review": "A brilliant and overt (yet subtle) satirical sci-fi. It presents itself as a straight-forward satire making some comments about obvious political figures, but then also asks the hard-hitting science fiction questions about cloning, and who we are when we look at ourselves. I loved it, it's brilliant. I think the only reason it's not rated higher is because the clean editing didn't scream \"this is a comedy\" or \"this is a drama\" and instead let you decide if you should laugh or be horrified. And you should be both! 10/10. Loved it. Robert Pattinson's portrayal of Mickey was everything."
    },
    {
      "rating": "3/5",
      "review": "Better than I thought going in. A romantic comedy with a heavy dose of stupidity"
    },
    {
      "rating": "5/5",
      "review": "While the book was better more focused or specific I enjoyed the movie tremendously. Pattinson did well in a quirky role/job that never ends. READ, people, then enjoy the movie!"
    },
    {
      "rating": "5/5",
      "review": "The movie was amazing and funny. It has great plot of how someone dies like 17x."
    },
    {
      "rating": "1/5",
      "review": "The film is whack - don't watch it, I'd recommend Water Ship Down if you want more of a comedy. - Lucas Too politically subtle for me. Robert, you should have turned the film down. -Anna"
    },
    {
      "rating": "0.5/5",
      "review": "Best part was when I got up from my seat and left after 30 minutes of the movie."
    },
    {
      "rating": "4/5",
      "review": "What a fascinating film. This is definitely not going to be everybody's cup of tea, but I am a huge fan of it."
    },
    {
      "rating": "1/5",
      "review": "Dumb storyline. Boring…I fell asleep"
    },
    {
      "rating": "3/5",
      "review": "This movie is just weird. Too mych psychology in a sci fi movie for my taste. Fells like a Wes Anderson film, but with little comedy. However actors can show their full potential there. Pattinson was able to show his full range, Ruffalo also didn't disappoint. Overall mid movie. 62/100"
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good film, some funny scenes, most of the time thanks to the outstanding acting from Pattinson with Mickey 17 and 18. It kinda gave me some vibes of don't look up : with the crazy rich couple wanting to colonize another planet. But it was way more better, it had many layers especially with the moving dynamics of power in the ship throughout the film."
    },
    {
      "rating": "5/5",
      "review": "I liked it. Forgot it was by the director of Parasite . Maybe a bit relative today? Good movie"
    },
    {
      "rating": "4.5/5",
      "review": "Mickey 17 is a bold and thought-provoking film that cleverly satirizes modern America. Its sharp irony might not appeal to everyone, but that’s exactly what makes it stand out. I appreciate the filmmakers for taking creative risks and not playing it safe—this isn’t a movie for the masses but for those willing to reflect on the world around them. After all, without critique, there’s no change."
    },
    {
      "rating": "4/5",
      "review": "The death concept was great, I feel it could have been more emotional if they made every death memorable. Also is no one gonna talk about how the last third of the movie is exactly the same as Ghibli’s Nausicaä??? Literally the exact same thing."
    },
    {
      "rating": "4.5/5",
      "review": "I think the cast is brought well together, loved the plot of this movie and its scenarios. But I was caught off guard by some scenes—great movie to watch."
    },
    {
      "rating": "3/5",
      "review": "The movie started off fun but then it never really took off."
    },
    {
      "rating": "1/5",
      "review": "I'm 75 and my wife and I left half way through the movie. There were only 2 other couples in the theater. That should have been a warning. It was so bad, I couldn't stand to watch another minute. It was slow moving and not entertaining at all. The premise might have been more successful with a different director, but I doubt it."
    },
    {
      "rating": "2.5/5",
      "review": "I don't think that this movie is bad, I just think it is slightly disappointing, a couple of things that were good was: 1. Robert Pattinson was good as Mickey, both 17 and 18 2. The plot and concept are super cool 3. The visual effects are very cool. 4. I personally enjoyed Steven Yeun as Timo. Some things that were not as good were: 1. It was to long, they could have told the same story just as well in a movie that was 30 mins shorter. 2. Adding to no. 1 the length didn't feel like it added anything, there were parts that were genuinely just boring. 3. Mark Ruffalo's performance as Kenneth Marshall and Toni Collete's performance as Yifa were way to over the top and cringy, sure that might have been what they were going for, but it was just impossible to watch for almost the entire run time. 4. It wasn't funny, as a movie marketed as a comedy, none of the jokes were good. There were times when you can tell that they tried desperately to be funny but just weren't. Overall, I unfortunately wouldn't recommend it, I may be missing some stuff for reasons including I never read Mickey 7. But, it's safe to say, I didn't enjoy this one."
    },
    {
      "rating": "1/5",
      "review": "What a horrible movie, it just keeps going on and on and on and on"
    },
    {
      "rating": "5/5",
      "review": "Loved the acting and plot so much."
    },
    {
      "rating": "3/5",
      "review": "Don’t blink, because you might miss it. Mickey 17 had so much potential, and I did enjoy the concept. However, when it comes to genres, you need to pick a lane and stick with it. Is it a dystopian sci-fi or a comedy? The film seems to change direction every five minutes. There’s a main plot, then forty different subplots. The scenes lack connection, making it difficult to follow what’s happening. Characters are introduced only to be ignored and pushed into the background. Robert Pattinson as Mickey was the film’s saving grace, he did well with what he had, and the humour does help distract from the fact that you have no idea what you’re watching. The best thing about the ending was the credits, because the film dragged on endlessly during the final 15 when all it needed was a quick wrap-up. Instead, we got a circling mess. If you do watch this film, I recommend avoiding the cinema, so at least you can scroll through your phone during the many filler scenes."
    },
    {
      "rating": "4/5",
      "review": "Entertaining movie. Quirky, strange piece of sci-fi fun."
    },
    {
      "rating": "4.5/5",
      "review": "Really good movie overall and the movie has a great theme that applies to the real world today that I think more people should be aware of. Movie is just a tad bit long, but honestly that’s nitpicky."
    },
    {
      "rating": "5/5",
      "review": "Just finished my second viewing and loved as much as the first. A fleshed out movie with depth, finely adjusted to fit a screen adaptation of the book Mickey7. Bong Joon Ho's masterful retelling contains a fantastic cast that are a merit to their profession. Plus Jung Jaeil's music for the film is a character in itself, I'm hooked! Bring on the physical release please~"
    },
    {
      "rating": "1.5/5",
      "review": "The previews were the best part of the move. Mark Ruffalo was disturbingly overacting his part."
    },
    {
      "rating": "3/5",
      "review": "good premise and cast, but the story is all over the place. The characters are not utilized well. The third act took a weird turn and ruined the flow of the movie."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is garbage love science fiction, but this is not good at all Two hours and twenty minutes wasted"
    },
    {
      "rating": "5/5",
      "review": "So good. So funny and endearing. Kept me on my toes and laughed through most of the film"
    },
    {
      "rating": "3/5",
      "review": "A bit obvious and dumbed down, maybe would of preferred a bit more smart and giving the audience the benefit of the doubt but a good sci-fi watch..."
    },
    {
      "rating": "5/5",
      "review": "Solid acting. Well written characters. Nice flow to the whole thing. Strong female characters. Dynamic characters. Nice balance overall."
    },
    {
      "rating": "0.5/5",
      "review": "Couldn’t get through the whole movie.. can’t understand how you could enjoy."
    },
    {
      "rating": "0.5/5",
      "review": "Incredibly boring, horrible adaptation, terrible acting (especially by Mark Ruffalo), and I would recommend you see anything else in the theater. I can’t stress how bad this is…..I actually dozed off during part of it."
    },
    {
      "rating": "0.5/5",
      "review": "I'm astonished and disaponited at people's reviews in here, a well known, renowned and reliable platform such as this. It might be Top 10 worst movies I've ever watched, and Top 2 I've seen in cinemas after Alvin and the Chimpunks 3. It tries to encompass every social critic on existence believing itself to be smart only to fail spectacularly in each and every aspect. Acting from Pattinson is simply OK and he's the best in this mess. I've suffered throw this movie and by the end I just surrenderd to the boredom. The last 15-20 minutes I just played Clash of Clans. Awful."
    },
    {
      "rating": "3/5",
      "review": "I was watching this in the theater yesterday and my mom fell asleep halfway through, lol. It wasn't that humorous, in my opinion, but people around me were chuckling during a fair few of scenes. Mickey 17 is not horrible, but some parts of the movie are visually painful to watch; the music, I would say, was pretty good and made me wonder who directed it. I wouldn't watch this again, but I guess at least I know what it is about and can talk about it with others. Overall, it's an O.K. film, but don't expect anything so sensational."
    },
    {
      "rating": "3.5/5",
      "review": "A good movie, that started off very well, but then got muddled towards the end. Tovert Pattinson was great and it was a cool world!"
    },
    {
      "rating": "4.5/5",
      "review": "I can't complain about Robert Pattinsons acting. Despite \"the lighthouse\" that may has been his greatest performance yet and it shows that he can pull off big roles really well! I really liked the weirdnes of the movie and felt really Entertained. I have to admit that one or two sequences were a bit too long and got a bit boring for a short period of time. But it didnt last long and didnt destroy my experience at all. If you like sci fi movies and want to see some decent Performances, id definitely recommend!"
    },
    {
      "rating": "5/5",
      "review": "I knew from the trailer alone that this was based on a book. It's was so....I was so invested. The humanity, the devotion, the references to a certain set of people today, and Robert Pattinson's love of off the wall films and his accents. The devotion of the love interest, Naomi Ackie. Mark Ruffalo's teeth. I love it all. This was great. I would actually buy this one on DVD."
    },
    {
      "rating": "3/5",
      "review": "Rara, un relato interesante pero donde los personajes lindan con lo cómico ridiculo que interpretan los personajes secundarios. La actuación de Robert Patisson es impecable y el es todo en la película, una película de guion flojo y poco interesante. Una lástima viniendo del director de Parasite, ganador de un Oscar."
    },
    {
      "rating": "4/5",
      "review": "Robert Pattinson was excellent. I can’t think of another actor that would’ve been as good. The movie was probably 15 minutes too long but I enjoyed it very much. Definitely a movie to see in the movie theaters I think."
    },
    {
      "rating": "4/5",
      "review": "Adapted from a book I've never read but will read now. Fun, humorous, action movie by director/writer Boon Jong Ho (Parasite, Snowpiercer). Rivert Pattinson is perfection as usual playing Mickey 17 Mickey is an unusual character while simultaneously being relatable. Steven Yeun plays Timo, best friend to Mickey who is more like a frenemy to Mickey who is the better friend between the 2. My favorite character is Nasha -- Mickey's significant other. She's an unforgettable character in this story and probably would only seen played by a male actor. Nasha is part of a group of unconventional female heroes. I loved very minute."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie, very profound, makes you think about issues and how med tech and ethical issues can affect society. If you don't want to think, it is pretty entertaining. I wonder how long it will be before they can actually print people new bodies , it's coming! lol"
    },
    {
      "rating": "2/5",
      "review": "Rob Pattinson gives an A performance in a C- movie. This is probably the most disappointed I’ve been at the cinema in a long long time."
    },
    {
      "rating": "1/5",
      "review": "Long and drawn out seemed more of a parody than anything"
    },
    {
      "rating": "2/5",
      "review": "The movie lacked any real direction. I guess it was trying to telll a story, just didnt come through with it for how weird it was. I didnt particularly enjoy the acting either."
    },
    {
      "rating": "2.5/5",
      "review": "Huge warning…. The trailer is completely different to the product you’re actually seeing. It comes across as this Si-Fi action classic but in reality it’s a political movie that is very hit and miss. The movies high and lows are quite drastic and Patterson can be great and in a moments notice painful to watch. The first part of the film was really interesting and had a great story but it took a nose dive making it almost unbearable. Multiple times I considered leaving but stuck it through as the ending seemed to be building to the ultimate action scene. Without spoiling the plot just take in to account the both positive and negative reviews and again this definitely isn’t the movie the trailer makes it to be."
    },
    {
      "rating": "3/5",
      "review": "A handful of story items are hypocritical or wants to have their cake and eat it, too. The film does look gorgeous and I still applaud the overarching story concept."
    },
    {
      "rating": "0.5/5",
      "review": "Omg this was so stupid"
    },
    {
      "rating": "4.5/5",
      "review": "I liked that guys lip ring"
    },
    {
      "rating": "1.5/5",
      "review": "Sure is a.. movie!.. But seriously, walked into this movie expecting something great based on reviews and ratings. Can only say it was pure false hope. The prologue was 30 minutes long but promising, after the 30 minute mark, It nose dived. Plot went from intriguing with potential to a confusing weird slow plot that actually seemed to go no where. There was NO warning at all that the movie is actually a parody of modern politics. Red hats is all im going to say without getting into it. Never have I ever walked out of a movie until tonight!"
    },
    {
      "rating": "0.5/5",
      "review": "Bad writing, waste of good cast"
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst movies I’ve ever seen. If I wasn’t with someone I would have left."
    },
    {
      "rating": "5/5",
      "review": "well worth seeing!!!!"
    },
    {
      "rating": "5/5",
      "review": "Funny af and really good!"
    },
    {
      "rating": "5/5",
      "review": "I liked it. Im not going into big detail because everyones tastes are different. I thought Robert Pattinson did an excellent job also."
    },
    {
      "rating": "1/5",
      "review": "Dull, made no sense, poor story waste of good talent left halfway through. ."
    },
    {
      "rating": "5/5",
      "review": "A lot a fun and good satire"
    },
    {
      "rating": "1/5",
      "review": "So I get the let’s be cute and use historical and cultural images to build a story but in this case the tyrannical leader with weird salutes and gas the aliens is too much. Confused and inconsistent plot line that can’t quite decide whether it’s satire or comedy. Pass."
    },
    {
      "rating": "4/5",
      "review": "Never seen a movie like this. Robert Pattinson is great!"
    },
    {
      "rating": "4/5",
      "review": "Pretty good film, but runs a little long. Great characters! The entire cast did an amazing job."
    },
    {
      "rating": "4.5/5",
      "review": "Nice cinematography, solid themes, and shout out mama creeper"
    },
    {
      "rating": "4/5",
      "review": "Ótima atuação de Robert e filme divertidissimo, porém os 2 \"vilões\" são tão caricatos que afastam um pouco do filme."
    },
    {
      "rating": "4.5/5",
      "review": "Weird, inventive, challenging, thought provoking ... is what I enjoy from my favorite movies. Loved this movie looking forward to rewatching it!"
    },
    {
      "rating": "1/5",
      "review": "Horrible movie! I can’t believe I wasted time and money to see this in the theater"
    },
    {
      "rating": "2/5",
      "review": "This movie sucks. I fell asleep in the theatre. I’ll give it a second star because I thought Pattinson did a good job acting."
    },
    {
      "rating": "1/5",
      "review": "was so bored after an hour that I walked out"
    },
    {
      "rating": "1/5",
      "review": "Saw Mickey 17 today. Worst POS I've seen in years! Just awful. I haven't walked out of a movie in decades, and I walked out of this one. Stay away!!"
    },
    {
      "rating": "3.5/5",
      "review": "We liked the show it was a little obscure but the futureistic theme and plot was good.along with a love interest."
    },
    {
      "rating": "3/5",
      "review": "I was not a fan of Pattinson, but now I am. He was very good. Some of the ideas of the plot were interesting, but the ones that weren't weighed it down. The pacing needs work, and Ruffalo's work was some of the worst I've ever seen. I would watch it again at home and fast-forward through his performance to improve the viewing."
    },
    {
      "rating": "3.5/5",
      "review": "It's not the best movie but it tells a decent story and its worth a watch."
    },
    {
      "rating": "5/5",
      "review": "This movie had me from start to finish. Rob is amazing👏 give him all the awards!!!"
    },
    {
      "rating": "5/5",
      "review": "Great movie, greate storytelling. Mark Ruffalo's part was very funny! If you like faced paced stupid action, this is the wrong movie for you!"
    },
    {
      "rating": "5/5",
      "review": "Great performance of Robert Pattinson. Depicting multiple personalities who are still the same. Amazing ride that makes you think and laugh at the darkest points."
    },
    {
      "rating": "5/5",
      "review": "Mickey 17 has many deep meaning elements from Science vs Religion to unchecked capitalism vs law and order. The \"sauce\" offen recognizable as blood is a definite symbol the blood of Christ. It is an attack on extremism more than of religion in general and makes some current valid points. Interesting and thoughtful, I recommend it!"
    },
    {
      "rating": "0.5/5",
      "review": "A disappointing movie that had so much promise. I was really looking forward to it based of the trailer, but it had a complete failure to deliver. Too much waffle at the start, a sagging middle section and by the time it made it towards the end, I didn't care how it ended, I just wanted it to end. Robert Pattinson tried to pull it together, but there was so little to work with that is just flopped."
    },
    {
      "rating": "3/5",
      "review": "I think I knew too much about he source material to actually enjoy this movie. It was more serious than I thought & it might grow on me over time."
    },
    {
      "rating": "3.5/5",
      "review": "It was definitely a fun movie but the explicit explanation of what was happening and what had led up to the start of the movie was just too much. Maybe the movie could've started earlier, showing us how mickey got on the spaceship, rather than having him narrate it. Or perhaps the audience could've put it together themselves through flashbacks. The part of the evil inventor who cloned himself numerous times, that was used to explain why multiples is a bad thing was not necessary either. Just have them bring up in conversation why it is a good or bad thing. Or perhaps have them discuss their own standpoint on it. Same with the fact that the clone machine and the whole concept of being an expendable will bring up ethical problems and paradoxes, like of course it will. Let the characters discuss their own opinions on the matter, trying to argue why it should or shouldn't exist rather than just say it. Like people are smart enough to figure out its a bad thing, don't hit people in the face with \"you should think this is a bad thing\". I gave the movie a three and a half because of the interesting concept and Robert Pattinson. It was definitely a fun movie but on a few aspects it could've been improved much."
    },
    {
      "rating": "1/5",
      "review": "Considered walking out of this one. I was so bored for 90% of the movie. Predictable, too long, and just not that entertaining."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie. Very funny, exciting and dramatic. To quote the gents who left the movie after me: \" That wasn't a movie. That was a film!\""
    },
    {
      "rating": "2/5",
      "review": "Wasnt my cup of tea."
    },
    {
      "rating": "3/5",
      "review": "Pattinson good. Ruffalo bad."
    },
    {
      "rating": "4.5/5",
      "review": "This was so weird and I loved it. The little guys are very fun I like them a lot. I don’t even know how to describe this movie I think you’d be better off just giving it a go. Sigurd really the mvp in this movie fr"
    },
    {
      "rating": "0.5/5",
      "review": "Dumbest movie we ever saw! We left about halfway through. It didn’t really have a plot, and blasphemed the Lord, among other stupid things."
    },
    {
      "rating": "4/5",
      "review": "Movies pacing was good but toward the end felt a bit dragged"
    },
    {
      "rating": "1.5/5",
      "review": "I enjoyed the part of Mickey (Robert Pattinson) and the cloning and the battle dealing with Life and death and if the whole movie would’ve been done with that in mind I would enjoyed it. Mark Ruffalo’s (Kenneth) and his onscreen partner, were two of the worst characters I have ever seen in a movie. They totally destroyed, which could’ve been a okay sci-fi movie."
    },
    {
      "rating": "2/5",
      "review": "Good performance by Patterson. Could’ve been a really deep intellectual sci-fi… Instead got caught up in modern day politics. TDS at its core."
    },
    {
      "rating": "4/5",
      "review": "This story did not go how I expected it to and I really enjoyed that. Go see this if a quirky, goofy sci fi sounds like fun to you."
    },
    {
      "rating": "4.5/5",
      "review": "Such a fun Sci-fi comedy with some nice political commentary as well. Robert Pattinson loves weird roles and this is definitely one of them. The story has some predictable moments that still manage to payoff nicely and with characters who maintain a satirical performance throughout the movie. I highly recommend seeing this as it's a nice change of pace from the typical movies we get all too often."
    },
    {
      "rating": "5/5",
      "review": "Honestly this was one of the best films I’ve seen this year! The mix of slight romance to sci-fi was incredible along with how some of the characters related to our elected officials"
    },
    {
      "rating": "3/5",
      "review": "The essence of science fiction: social commentary with a candy coating, a fun ride up to the mirror where difficult moral and ethical questions must be asked of one's self, then discussed in committee. Or in society. How much disk space does a soul require, and are the religious the ones who are fools for asking? Maybe not, since the gradually changing personalities of the reprinted person seem to degrade like photocopies of photocopies. Is it smart or right to try to look for other worlds to colonize before we have fixed our own? And should we let just anyone go? If space travel is open to everyone, who manages the risks and rewards? Robert Pattinson shades each version of Mickey exceptionally well, although he never seems intelligent enough to be choosing his steps. Naomi Ackie couldn't decide between good cop and bad cop and all the way up to Mark Ruffalo's top-of-the-(weirdo)-heap leader there was a lot of unsubtle mixing of government and religion that made the backdrop of moral questioning look like Idiocracy. Add some screaming at the end about indigenous \"people\" reacting to us as aliens mitigated by socially repressed scientists and a shadow government that suddenly pops up to take over when the villain falls and honestly this movie is a bizarre mess."
    },
    {
      "rating": "2.5/5",
      "review": "Pattinson was really good , plot moved slowly at times."
    },
    {
      "rating": "4/5",
      "review": "I enjoyed it despite how completely ridiculous it was. It reminded me of Wes Anderson flicks with how bizarre it often was. I'd say if you want a whacky sci-fi flick with a solid cast go see it."
    },
    {
      "rating": "0.5/5",
      "review": "Garbage. Total let down. Robert P did a good job. There was a big lull in the middle and ending was boring. There was all kinds of useless swearing. Uninteresting storyline. Ruffalo character portraying the antagonist as a white guy starved for power illustrating his TDS. Can’t believe we paid money to watch this. Don’t go save your money."
    },
    {
      "rating": "5/5",
      "review": "Funny, dark, excellently crafted and scathingly critical of charismatic yet horrible leaders. Fantastic movie."
    },
    {
      "rating": "4/5",
      "review": "Way, waaaay better than I expected. The trailer looked a bit weird but was so glad I decided to give it a try. Very creative social commentary on so much we are experiencing in this world today. So many great layers. And in typical Bong Joon Ho fashion, it's done in the most delightful, quirky way."
    },
    {
      "rating": "3/5",
      "review": "Started strong but slowed down and didn’t really deliver on the messages it was trying to comment on"
    },
    {
      "rating": "1/5",
      "review": "The movie lost all direction halfway through. It was very boring by the end."
    },
    {
      "rating": "3/5",
      "review": "Not a bad movie but it dragged in parts. Would have been A LOT better if it were 30 - 40 minutes shorter. And Mark Ruffalo and Toni Colette's roles were cheesier than an 80's pop song"
    },
    {
      "rating": "4/5",
      "review": "Surprising twists, offbeat humor"
    },
    {
      "rating": "1/5",
      "review": "Waste of time, hollywood is in decline. They should review and work more on their plots, script, and stories"
    }
  ]
}