[
  {
    "rating": "1/5",
    "review": "Quite honestly one of the worst movies I've ever forced myself to finish. Boring from beginning to end. I love Tarantino films... but this was awful. The fact that it won awards is mind boggling."
  },
  {
    "rating": "5/5",
    "review": "I completed my life when I saw this film. The best thing to ever happen in this existence. I typically make long reviews, but.. this movie is the epitome of existence."
  },
  {
    "rating": "3.5/5",
    "review": "Really cool and features some brutal scenes Badass stuntman"
  },
  {
    "rating": "3.5/5",
    "review": "A love letter to all that is Hollywood."
  },
  {
    "rating": "4/5",
    "review": "I just love the music and athmosphere of this film."
  },
  {
    "rating": "4/5",
    "review": "So that's it, that's a wrap! All Quentin Tarantino films done 1-9 (10). Ben it's been a journey that we have gone together, and it's been great reading your reviews and comparing mine to yours to see the difference between ratings and similarities! Brad Pitt is an absolute star and out shadows every cast member in this film, he deserved that Supporting Actor Award (Oscar) he's so charming and witty his role is just so well wrote and cool. It's slow but the lovely aesthetic makes the film amazing, I feel I on a rewatch I will enjoy this further because it's more of a calm loveletter of Quentin Tarantino's filmography, also the countless film references had be amazed for example the \"Antonio Margeretti\" (which is weird because I've been saying that and Dominic Dacoco all day) just makes it much more entertaining. The ending is so violent but also much more hilarious at the same time. My only disappointments are A- Margot Robbie having 3 mins (practically) on screen, B- it can feel slow at times and it's not your usual Tarantino. Unfortunately since \"The Movie Critic\" film from Quentin Tarantino was cancelled and (for understandable reasons) he wants to see his son go through the process (that he can remember) he's most likely going to take 5 more years at least. Also I definitely think he won't stop at 10, he's a smart guy and the \"10 film\" thing is keeping him headlines, I predict he'll say \"I want my son to act or blah\" to make a few more or 12."
  },
  {
    "rating": "4/5",
    "review": "Tarantino delivers another provocatively humorous and off-the-wall entry to his pantheon. The chemistry between Leonardo DiCaprio and Brad Pitt makes them the best duo in recent memory. Their interactions are spot-on. And the ending presents an alternate view of history that many might wish had transpired."
  },
  {
    "rating": "5/5",
    "review": "I really love it... everything was on point... hahahah"
  },
  {
    "rating": "3/5",
    "review": "When I watched this when it first came out I really enjoyed it, but after giving it a rewatch it seemed to drag on a bit at certain points. My boyfriend has attempted to watch this movie three times and never was able to get invested. Not an outright bad movie, just not the greatest."
  },
  {
    "rating": "5/5",
    "review": "Once Upon a Time... in Hollywood is an instant classic. It's not just a film, but a feeling, a vibe and watching it is an event. The characters are perfectly written. Cliff Booth was my absolute favourite from the start of the film, while I didn't like Rick Dalton at first, but by the end he grew on me. The story is extremely unpredictable. I was surprised to realise that, just like Inglorious Basterds, this is an alteration of a real life event, with both real-life and fictional characters. The dialogues are also perfect. Some of them are quotable classics that I had already come across several times before seeing this film. The cinematography is amazing and very character-driven. The editing is incredible. The movie is about 160 minutes long, but I never wanted it to end, it was never boring. The production design is gorgeous, they captured that time period extremely well. Everything felt authentic. The casting is more than perfect, the star power is incredible and there are so many talented young actors, who became stars after this film. Both Brad Pitt and Leonardo DiCaprio are fantastic, while I loved Margaret Qualley's performance as well. Once Upon a Time... in Hollywood is a perfect, character-driven film surrounded by a story that is inspired by real life events."
  },
  {
    "rating": "3/5",
    "review": "If someone were to ask me to lay out the plot of Once Upon A Time In Hollywood, I don't know if I'd be able to coherently do it. I would have to simply say that it's about an actor played by Leonardo DiCaprio living his life with a stunt double played by Brad Pitt, and he somehow ends up fighting Bruce Lee and tossing him into a car. Then there's a weird hippie ranch, and for some reason they attack Brad Pitt while he's high.... And then the movie basically ends there. The movie feels well-made, the scenes are crisp, the dialogue is engaging, there's some good scenes, but honestly I don't really know if the movie has a plot or a resolution or anything like that. Ironically, a movie titled \"Once Upon a Time...\" doesn't really seem to have a real story to it. I still recommend seeing it, because it's enjoyable, entertaining, and well-made, but I honestly don't know what it's about."
  },
  {
    "rating": "5/5",
    "review": "Masterful. A masterpiece in the truest meaning."
  },
  {
    "rating": "5/5",
    "review": "Ahh, Once Upon a Time in Hollywood…There’s not a single movie I want to live inside more. Tarantino’s re-imaging of 60s Los Angeles gives way to two iconic characters that will run in movie canon alongside Butch and Sundance."
  },
  {
    "rating": "1.5/5",
    "review": "OK, we get it ... Tarantino likes classic 60's Hollywood and rewriting history .... but get a Godamn move on. Would be good if it was an hour shorter."
  },
  {
    "rating": "1/5",
    "review": "The idea is good, and the camera work is great. But overall Once upon a time in Hollywood is totally boring."
  },
  {
    "rating": "5/5",
    "review": "Filmnya bagus, wajib nonton"
  },
  {
    "rating": "4/5",
    "review": "The classy dialogue and scenes of calculated madness make this film so unmistakably Tarantino. Not as sleek a storyline as others in his collection and the changes of pace don't work quite as effectively this time."
  },
  {
    "rating": "4/5",
    "review": "Leonardo delivers another perfect performance with range as the funny and vulnerable has-been classic Hollywood actor. Brad Pitt is just usual confident and swanky Brad Pitt. Tarantino’s pacing in this film is a little repetitive and drawn out at times, like repetitive scenes of Leo’s line delivery and meltdowns, but otherwise the pacing is relatively true to Tarantino’s classic energy and engaging story, a great director."
  },
  {
    "rating": "4.5/5",
    "review": "Classic my first Tarantino movie and favorite This a strongly recommended watch"
  },
  {
    "rating": "4/5",
    "review": "An entertaining watch with entertaining characters and an entertaining plot. You can expect the typical Tarantino, with this one veering on the side of comedy a bit more than most of his movies. A seemingly random, but actually interconnected chain of events portrayed by a star studded cast."
  },
  {
    "rating": "4/5",
    "review": "A simple plot that impresses. Acting that inspires. And as per usual, Tarantino’s level of action packed intensity."
  },
  {
    "rating": "3.5/5",
    "review": "I wouldn't asume it's Tarantino until the last chapter."
  },
  {
    "rating": "4.5/5",
    "review": "Masterpiece film! 100% rewatchable"
  },
  {
    "rating": "5/5",
    "review": "I've always have loved the atention to the details, specially in the dialogs of Tarantino movies, and this one doesn't stays behind... absolutely a must-see :)"
  },
  {
    "rating": "0.5/5",
    "review": "I really hated this movie . It’s uninteresting , pointless , full of itself. There is nothing clever about this movie. It’s just a meandering load of nonsense and the ending is so bad it’s unimaginable"
  },
  {
    "rating": "5/5",
    "review": "Flawless film with outstanding performances from Pitt and DiCaprio. This is my favorite Tarantino film so far."
  },
  {
    "rating": "2.5/5",
    "review": "I didn't care for it. It wasn't bad but I found it somewhat boring. I think the casting choices were boring. The irony being the biggest stars were put in the movie to match the title and the final product was lackluster. A rare miss by the great director."
  },
  {
    "rating": "1.5/5",
    "review": "The most overrated Tarantino movie. It’s a totally overlong snooze fest that attempts to be numerous but just isn’t."
  },
  {
    "rating": "5/5",
    "review": "Esse filme é uma p****** cinematográfica um dos melhores filmes de Tarantino se não for melhor"
  },
  {
    "rating": "3.5/5",
    "review": "Once Upon a Time... In Hollywood is a signature Tarantino film, packed with big names, stylish direction, and a deep love for old-school Hollywood. The plot? Well, it’s more of a wandering journey than a structured story. Things happen, characters interact, but there isn’t much tying it all together in a traditional sense. That’s expected from Tarantino, he’s more about moments than narratives. The slow-paced intro sets the tone, but it doesn’t really pick up in a way that makes you feel a sense of urgency. The directing is classic Tarantino, with his trademark long conversations, sudden bursts of energy, and, of course, his obsession with feet. The cinematography nails the late '60s aesthetic, from the lighting to the vintage sets, making Hollywood feel alive in every frame. Camera work is bold, sometimes chaotic, but never dull. Acting-wise, DiCaprio and Pitt carry the film effortlessly, delivering performances that feel natural and engaging. The sheer number of recognizable faces adds to the spectacle, making every scene feel like a who’s who of Hollywood. The script has its moments, sharp dialogue and some solid character work, but the comedy often feels forced rather than organic. The soundtrack, however, is one of the film’s strongest elements, blending iconic tracks that perfectly fit the era and mood. Overall, it’s an experience more than a story, and while the pacing drags at times, the world it builds is captivating enough to keep you watching. I wouldn’t call it a masterpiece, but it’s an enjoyable ride if you’re in the mood for something that values atmosphere and performances over a tightly woven plot."
  },
  {
    "rating": "0.5/5",
    "review": "For the list of stars and the $90 million budget, just not much there. Clooney's narration was more like following along in a 3rd grade reading class."
  },
  {
    "rating": "1.5/5",
    "review": "Wouldn’t reccomend if you don’t know it’s based off of the Manson Family Murders. The whole time I was kind of enjoying it but I was confused when anything real would happen. Like there wasn’t really a storyline. The last 20 minutes was top notch and brutal but I feel like an hour could’ve been cut out of this movie. The shots are also just SO long. Like stop wasting my time. I can see how critics would like it but as someone with limited interpretative media skills (I tend to take things literally) it wasn’t worth the watch. I was most looking forward to finishing the movie so I could look up what the heck it’s about. The whole Manson Family storyline is like 40 minutes of it. The word Manson wasn’t mentioned once, as far as I know. Acting, costumes, and set design were great though."
  },
  {
    "rating": "5/5",
    "review": "An incredibly interesting film, and a wonderfully weird parody biopic. Amazing sets, costumes, and soundtrack (much like all other Tarentino films) and a truly awesome level of cinematography. I’ve watched and rewatched it. The subversion was masterful."
  },
  {
    "rating": "5/5",
    "review": "Many argue about this film but it's more than a QT flick. It's a love letter to a golden era of cinema we'll never see again. A film made by someone who was a little kid taken to the movies every weekend, a kid who heard the movie ads on the radio, a kid who experienced the magic of a dark theater, previews and popcorn. One of if not QT's best so far."
  },
  {
    "rating": "1/5",
    "review": "What an absolutely boring, vapid, sensationslist film that has nothing artistic to offer nor anything even remotely interesting to suggest in its message."
  },
  {
    "rating": "5/5",
    "review": "Say whatever you want about Quentin Tarantino, but he knows how to find the best actors for a role and can turn any movie into something great."
  },
  {
    "rating": "5/5",
    "review": "Tarantino at his best!"
  },
  {
    "rating": "5/5",
    "review": "Out of the Tarantino movies I’ve watched I would have to say this or Django unchained are my favorites of his. This movie is one of the most entertaining movies I’ve watched ever and its use of real events to tell an alternate story is masterful and makes it that much more enjoyable."
  },
  {
    "rating": "4.5/5",
    "review": "While it may be light on plot, it's forgiven due to it's incredible acting, great cinematography, and immaculate vibes."
  },
  {
    "rating": "5/5",
    "review": "Truly unique and a great buddy film by a master of his craft"
  },
  {
    "rating": "5/5",
    "review": "Quentin's spin on Charles Mansion murders. Leo and Brad performances are second to none in this movie. This movie has alot of funny moments and one liners. Don't miss this movie. Loved this movie."
  },
  {
    "rating": "5/5",
    "review": "I love this movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Went in without knowing a thing about it. The hints kept coming, setting the time and place... Charlie showing up looking for Dennis Wilson made the shoe finally drop. The tension I felt watching Sharon go about her life wasn't reflected I'm the film though, reinforcing how random and sudden the attacks were. It was nice to see an alternative history of the events, led by Brad and Leo as beleiveable and imperfect assholes. Clapped at the end, but left with sadness at the real event. And a total and deserved lack of sympathy for the perpetrators. Well done to everyone involved, highly recommended. Will likely not have the same impact if you are unaware of the details of the Tate/LaBianca murders."
  },
  {
    "rating": "4.5/5",
    "review": "Possibly my favourite Tarantino movie of all time! Iconic scenes, great acting, a good plot and a very satisfying ending."
  },
  {
    "rating": "1/5",
    "review": "Found nothing funny about it. Fell asleep after giving it a good hour to impress. I like Pitt and Decaprio but this one stinks."
  },
  {
    "rating": "4.5/5",
    "review": "A great movie I thoroughly enjoyed and came back to rewatch. I’d absolutely recommend it if you are a film and pop-culture enthusiast, but that doesn’t mean that the casual viewer won’t appreciate this fine Tarantino movie if they give it a shot. At a surface level, this movie is seemingly a “boring” slice-of-life drama revolving around the famous actor Rick Dalton (Leonardo DiCaprio) and his stunt double Booth Cliff (Brad Pitt); however to those who have got a keen eye for detail there is a lot more to delve into. Here’s a few of the many things I love about this movie: the satirical representation of Hollywood and Western Movies, the plethora of historical and movie references, the cinematic and colorful depiction of Los Angeles during the late sixties and early seventies, DiCaprio and Pitt’s great performances, as well as the signature touches that scream “This is a Quentin Tarantino Movie,” such as the masterfully written dialogue, and of course (hate it or love it) the plethora of feet, which usually I would find disgusting, but since it is is Tarantino it is amusing to see one of his signature quirks. Overall a very solid film that has plenty of rewatch value, since I noticed so many more details the second time around, and I know I’ll find something I missed if I watch it a third time too and I still won’t get bored because there is so much going on despite the slower yet appropriate pace which contributes to a longer runtime. 8.5/10"
  },
  {
    "rating": "4/5",
    "review": "Honestly as a casual viewer with tarantinos films like Once upon a Time in Hollywood he ties the film really well, with the odd parts of comedy and is quite enjoyable definitely worth a watch."
  },
  {
    "rating": "1/5",
    "review": "This film had a great director , great actors , the Hollywood stamp of approval, great potential ... but it had one fatal flaw .... it was boring beyond belief. Scene after scene was crafted but led absolutely nowhere because there was no story line. It was like \" we'll figure it out once we get shooting\" like they did in Apocalypse Now but unfortunately here ... it just never happened. And then all the accolades by Hollywood insiders ? ? ? It's like Beyonce being named as the Best Artist of the Century ... by paid insiders ..."
  },
  {
    "rating": "3.5/5",
    "review": "A pretty fun and laid-back love letter to late 1960s Hollywood, where the end of the golden era of film is approaching while the experimental counterculture era is emerging on the horizon. Brad Pitt and Leonardo DiCaprio are both very funny and likeable in their lead roles. Margot Robbie plays a nice and subtle homage to Sharon Tate, only highlighting her happy everyday life and how things could be if that one fateful night never happened. Bruce Lee's bit is kind of a letdown though. The movie has a charming laid-back vibe when presenting all these people of Hollywood just living their everyday lives. A real slice of life from the upper crust. A good middle chunk of the movie kind of drags on and overstays it's welcome, but luckily it all pays off in the jarringly violent final confrontation that chooses to rewrite history with the Manson killers. It's not my favorite Tarantino film by a long shot, but its still very likeable and entertaining if you stay patient and smell the golden roses."
  },
  {
    "rating": "4/5",
    "review": "i love when rick crying as he start to explain a book that he felt relatable to him. literally me"
  },
  {
    "rating": "4/5",
    "review": "Classic Tarantino. Great script. Was wondering where the violence was until the end!"
  },
  {
    "rating": "3.5/5",
    "review": "Typically bizzare Quentin Tarantino film with a focus on American media in the late 1960s."
  },
  {
    "rating": "5/5",
    "review": "Quentin Tarantino's love letter to Hollywood and the 9th feature film of his illustrious career. I thoroughly enjoyed this film. The cast is amazing! The set design, the costume design, everything! Leonardo Dicaprio was brilliant in this picture. Brad Pitt won the Oscar for his efforts. It was awesome to see Al Pacino make an appearance in a Quentin Tarantino film. He gave a standout performance. Margot Robbie was magnificent as well. The camera work was exceptional, and the soundtrack legendary. I can't say enough about Once Upon a Time ... in Hollywood. I highly recommend this one. 96/100"
  },
  {
    "rating": "1/5",
    "review": "Boeing fell asleep watching it"
  },
  {
    "rating": "0.5/5",
    "review": "Didn't make it through. Incredibly boring."
  },
  {
    "rating": "1.5/5",
    "review": "I had high expectations because of the wonderful cast and Quentin Tarantino’s work, but it was very boring and the characters felt undeveloped."
  },
  {
    "rating": "5/5",
    "review": "Can’t believe this only has a 70 from viewers? My favorite Tarantino movie bar none, perfect music, incredible characters. A snapshot in time at the end of the studio era and one of the flat out funniest movies he ever made."
  },
  {
    "rating": "5/5",
    "review": "What can I say?!? A masterpiece!"
  },
  {
    "rating": "4.5/5",
    "review": "Filled with excellent performances and funny moments, Tarantino does it again and throws in a wild ending!"
  },
  {
    "rating": "5/5",
    "review": "Good Tarantino movie. It's just a shame that without historical knowledge it will be difficult to see it, thank you God that I read a lot about this period before watching this film."
  },
  {
    "rating": "0.5/5",
    "review": "Just such an incredibly dull movie. It’s like watching a conversation between two movie bores with short snippets of whatever they’re waffling about. Yet again the rule of RottenTomatoes applies…if the critics score it highly and the audience considerably lower it’s fundamentally a bad movie that only tedious movie buffs will enjoy for spurious reasons that don’t involve entertainment."
  },
  {
    "rating": "3/5",
    "review": "Alright, I don’t know how I feel about this film. One one hand I really like the way Tarantino wrote around actual events in and rumors from Hollywood. (I.e. the Bruce vs Stuntman rumor) and that’s what makes it special. There is just a hint of credibility to everything happening on screen and that increases enjoy ability."
  },
  {
    "rating": "2/5",
    "review": "Mostly masturbatory filler. Boring interspliced with some great acting."
  },
  {
    "rating": "3.5/5",
    "review": "I'm not a Tarantino fan, but this one wasn't bad. Kind of long, but there were a lot of interesting moments and details. Fun watching DiCaprio and Pitt interact. The usual slew of cameos."
  },
  {
    "rating": "4/5",
    "review": "This was my very first movie review on the Cyn's Corner channel, way back in August 2019. Yikes! Video review: https://youtu.be/wOX9NJFI4KA"
  },
  {
    "rating": "0.5/5",
    "review": "Unwatchably dull and self-indulgent. Overhyped"
  },
  {
    "rating": "1.5/5",
    "review": "Great casting, great acting and well filmed but so incredibly slow and boring with very little storyline. Would not recommend."
  },
  {
    "rating": "5/5",
    "review": "A beautifully made allegorical film. It's a love letter to the past, to less superficial times. In an era of franchises, quick sells, and reboots, Tarantino's brain child is a refreshing buzz which has hints of sorrow for the 70s and nostalgia for the 50s."
  },
  {
    "rating": "5/5",
    "review": "This is probably the best Tarantino movie since pulp fiction!! Leonardo Dicaprio and Brad Pitt were an amazing combination!! Lots of twists especially the perfect pitch Brad did at the girls face with a tin. He really pulled off the tripping scene!"
  },
  {
    "rating": "3/5",
    "review": "Frankly, it was quite a disappointment. It is, however, an example of what a truly great actor DeCaprio is, and Pitt isn’t."
  },
  {
    "rating": "4/5",
    "review": "United again, after their childhood stints on Growing Pains, Leo and Brad come together as two bit western actors in 1969 that have recently faced unemployment...And ironically wind up using their retired cowboy and rustling skills and their considerable sharpshooting talents to battle riff raff on the Hollywood sets; and also the Manson gang after their brutal Sharon Tate murder spree. A crazy hodgepodge of many different influences; this wacky piece of historical fiction is definitely one of Tarantino's best recent efforts... 👍 Thumbs up, recommended."
  },
  {
    "rating": "5/5",
    "review": "Tarantino is a genius"
  },
  {
    "rating": "0.5/5",
    "review": "I went on a date night and me and her were so bored we walked out. I've never walked out on a movie before. It's just so dull. Maybe interesting to those who know the area or story. Can not recommend."
  },
  {
    "rating": "0.5/5",
    "review": "Boring. 2 and a half hours of nothing, followed by 10 mins of crazy to finish off. Just kept waiting and waiting for something to happen, for a reason to keep watching, but it never comes. If you feel the need to turn off after 20mins then just do it."
  },
  {
    "rating": "5/5",
    "review": "A typical entertaining Tarantino-Movie, with long scenes and casual talk, superb acting, this movie features an unusual set of characters in the 1969 Hollywood scene. There is not any central theme in the movie, which makes it feel very unpredictable and gripping. Even the protagonists struggle to overcome his insecurity is not a completed character arch at the end of the movie. Overall, the movie tends to built anticipation - and then toy around with that anticipation. A fun watch for sure!"
  },
  {
    "rating": "3/5",
    "review": "This is a good film, that has an amazing ending. But it's an almost 3-hour movie that feels like the last half hour is the only important part, and that doesn't connect much to the rest of the plot."
  },
  {
    "rating": "5/5",
    "review": "Um desfecho diferente que todos nós gostaríamos que tivesse acontecido para mudar uma trágica história real que abalou Hollywood no final da década de sessenta. Quentin Tarantino foi brilhante ao dar uma nova chance simbólica a Sharon Tate (Margot Robbie). Nessa missão, o cinema cumpriu um papel excelente: fazer o público torcer e vibrar por um final feliz, ao menos na ficção."
  },
  {
    "rating": "4.5/5",
    "review": "This is not Tarantinos best work but it's definitely up there with some of his best. Leo and Brad are a dream team in this film. It's not full of action like Django or kill bill, but the story telling and dialogue is wonderful. Tarantino was in his bag when he wrote this."
  },
  {
    "rating": "5/5",
    "review": "es una buena pelicula"
  },
  {
    "rating": "4/5",
    "review": "It's not until it hits the final third that this movie really kicks into gear. Not as dynamic as other Tarantino movies, but still a captivating ride led by excellent performances from Pitt & DiCaprio."
  },
  {
    "rating": "0.5/5",
    "review": "The first 90% is boring and confusing. The last part is a gratuitous gore-fest"
  },
  {
    "rating": "3.5/5",
    "review": "Just watched this a second time and i enjoyed it more than the first one. This might not be a movie for everyone; some even might be disappointed, if they don't know much about the time period the movie is based on, as well as the industry, or even if they expect your typical Quentin Tarantino movie. But i think it's worth a watch, just for DiCaprio and Brad Pitt's charisma and talent. Without even trying, they are some of the funniest actors on earth. And their screen presence is some of the best as well."
  },
  {
    "rating": "4/5",
    "review": "Won’t be for everyone but I had a great time"
  },
  {
    "rating": "4.5/5",
    "review": "Probably one of the best Tarantino movies in years."
  },
  {
    "rating": "5/5",
    "review": "Perfect. nothing else to say. Just watch this masterpiece, you won't regret, it's a lovely gift to whoever deeply loves cinema. Brad Pitt acting is legendary here. Must watch."
  },
  {
    "rating": "1/5",
    "review": "Movie is good. But it is a big turn off when some real life people were depicted falsely. Bruce Lee and Roman Polanski (child r*pist)."
  },
  {
    "rating": "3/5",
    "review": "This movie isn't bad, but it is far from Tarantino's best work. The beginning of the movie gets a good foundation for what we're about to see, but later on the movie kind of loses it's point with which it started. One good story that's told here is Rick Dalton's Midlife Crisis which is described perfectly but other than that it really has no other stories. The stories of Sharon and Cliff feel like they were brainstormed just so Quentin could have 2 other big Hollywood stars in his movie. Overall not a bad movie by any means, but not one of the greats either."
  },
  {
    "rating": "5/5",
    "review": "I feel sad for the people that didn't enjoy the movie and gave it a bad review. Perfectly valid. Your opinion is yours and who am I to disagree. It's simply sad they couldn't figure out a way to enjoy a masterpiece. A movie that will eventually surpass Pulp Fiction and Reservoir Dogs in Tarantino's catalog. Perfectly written and directed. Stellar performances from every single character, no line characters to DiCaprio, amazing. Zero weaknesses.."
  },
  {
    "rating": "1.5/5",
    "review": "Great acting but horribly boring and drawn out."
  },
  {
    "rating": "4.5/5",
    "review": "When I first watched \"Once Upon a Time... In Hollywood\" I felt like the story wasn't really going anywhere. The individual scenes were well-written and exciting, but as the movie neared the end I wondered how they would connect to each other. Luckily, the last few minutes of the movie conclude the film in a satisfying way because it gives the earlier scenes a reason for existing. 8.5/10"
  },
  {
    "rating": "5/5",
    "review": "The young people behind the film have done a great job and it can be seen in this film. I liked it very much."
  },
  {
    "rating": "5/5",
    "review": "Speechless and priceless"
  },
  {
    "rating": "5/5",
    "review": "One of the masterpiece of Tarantino. You may get bored from some scenes but at the end it is worth it. Highly recommended"
  },
  {
    "rating": "2/5",
    "review": "Like all Tarantino films, it was visually stimulating. But most of the story was irrelevant to the plot as a whole."
  },
  {
    "rating": "5/5",
    "review": "Great movie one of the best!"
  },
  {
    "rating": "0.5/5",
    "review": "The most boring long bizarre film. Plenty of random scenes of leonardo dicaprio just crying for some unknown reason. Everyone in the cinema was so bored I kept seeing peoples watches flash where they were checking the time to see when it’s over. Honestly it’s a painful watch. Definitely one of the worst films I’ve ever seen."
  },
  {
    "rating": "1/5",
    "review": "Incredibly long, winding, boring, and lacks a plot. One of the worst movies I ever saw. Misleading to have such high ratings."
  },
  {
    "rating": "4.5/5",
    "review": "I watched this movie on a plane without knowing a thing about a plot. Imagine the roller coaster."
  },
  {
    "rating": "4/5",
    "review": "The movie opens with some genuinely disgusting and useless images. I suppose it is some lame attempt to shock us. All it did was make me turn it off. But a few weeks later I was bored and put it on again. I buzzed through the first ten minutes and was captured by Brad Pitt. SPOLER ALERT What Tarentino has done here is remarkable. The title sorts of gives it away, but not directly. This is not history, but a fairy tale... a \"What If\" tale. Marvel comics used to do \"What If?\" books. What if Uncle Ben had not died in front of Peter Parker? What if the Hulk had always retained the brain of Bruce Banner? That really what Tarentino has done. Even more than a \"What If\" it is an \"I wish.\" It is awesome and hilarious and we wish it was the true history. How wonderful it would have been had the Mansons walked into the wrong house. Five stars if not for the opening scenes."
  },
  {
    "rating": "5/5",
    "review": "All time favorite movie ever. Best everything. Best Quinton Tarantino movie ever. Absolute must see. Film at perfection."
  },
  {
    "rating": "4/5",
    "review": "even if the plot moves pretty slowly i still enjoyed the movie and characters. margot robbie as sharon tate was probably my favorite part even if, because of the ending, they could’ve probably kept the her out of the movie. looking back they had a completely stacked cast that all complement each other. the only negative i have about this movie is the time jump that happens at the beginning of the third act which feels a bit forced and somewhat disorienting."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is Tarantino culmination of everything he learned in one film!"
  },
  {
    "rating": "4/5",
    "review": "I was pleasantly surprised with this movie. The ending could have been a lot better, but up until that I enjoyed it."
  },
  {
    "rating": "1.5/5",
    "review": "It seems ironic that a film titled \"Once upon a time....\", the traditional beginning of a story, should be so lacking in, well, story. There are some enjoyable scenes and ideas, but overall the script is tedious, slow and doesn't hang together."
  },
  {
    "rating": "3/5",
    "review": "Tarantino is always worth watching, but each new film is more bloated than the last."
  },
  {
    "rating": "4.5/5",
    "review": "O filme tem uma pegada mais cômica, porém a história por traz do filme é muito interessante. Tarantino consegue adaptar a história muito bem para o roteiro, da gosto de ver esse filme."
  },
  {
    "rating": "3.5/5",
    "review": "The first hour of this film is slow, and strangely put together. After that, Tarantino hits his stride, with the long shots and dialogue driven narrative we’ve come to expect from him. The picture follows an actor whose star is falling (DiCaprio) and his long time stuntman and friend (Pitt) as they make their way through the Hollywood scene of the late 1960's and unwittingly encounter the Manson Family. Tarantino is the master of his craft, but this isn't his best work. DiCaprio continues to make up for making us suffer through Titanic."
  },
  {
    "rating": "5/5",
    "review": "Tarantino's best one yet!"
  },
  {
    "rating": "2/5",
    "review": "Had some good moments but mostly I was bored."
  },
  {
    "rating": "4/5",
    "review": "Mais uma obra grandiosa do mestre Tarantino."
  },
  {
    "rating": "3.5/5",
    "review": "Hollywood's an entertaining watch, even if the lack of a plot can feel gruelling at times. It's admittedly too long, and the very odd way they use (and DON'T use) Margot Robbie is jarring. Knowing how history plays out, you have an impending sense of doom that does keep you hooked throughout the 3 hours."
  },
  {
    "rating": "3.5/5",
    "review": "I really enjoyed this movie"
  },
  {
    "rating": "5/5",
    "review": "I love, love, loved this movie from being to end and not just because I've always been a fan of Quentin Tarantino! He is honestly to me one of the very best directors, and script writers working today, and is right up there with other great's like Ron Howard! Where they could be directing or producing anything and you know it's going to be really good or great!"
  },
  {
    "rating": "4/5",
    "review": "Very decent movie with great acting, but also with some weird camera angles, like what is up with all the feet?"
  },
  {
    "rating": "5/5",
    "review": "You have to know about the true sharon Tate story to get all the satisfaction from this movie. Read about the Tate murder then enjoy this movie."
  },
  {
    "rating": "5/5",
    "review": "Such a well made film that captures the time period to perfection. Leo and Brad are an amazing combination and play their roles perfectly. You follow our hero’s on their last adventure through 1969 Los Angeles and culminating with the fateful events at the Sharon Tate residence. What comes next is pure Tarantino at his finest. The whole film is without doubt a love letter from Tarantino to Hollywood, the people and the film industry of that time. Great music too! 10/10 5 ⭐️⭐️⭐️⭐️⭐️"
  },
  {
    "rating": "4/5",
    "review": "A little change in pace for a Tarantino movie, however the story was cool, taking place during a great era in Hollywood. Da Caprio and Pitt casting and on screen dynamic worked great."
  },
  {
    "rating": "5/5",
    "review": "Another masterpiece from QT genius mind. Brad Pit and Leo are awesome. Strangely enough some scenes are being directed at my home town in Greece which is called Chalkida ! It was a big suprise for me."
  },
  {
    "rating": "4/5",
    "review": "A really interestingly entertaining movie"
  },
  {
    "rating": "4.5/5",
    "review": "Top 3 or 4 Tarantino movie. Some might want a little more action but i’m not one of those people."
  },
  {
    "rating": "5/5",
    "review": "Yeah, Tarantino's ninth and still most recent movie! DiCaprio and Pitt are awesome, their performances are top notch, I could not ask anything more out of them. Their characters are great and we get to spend a lot of time with them. Margot Robbie's Sharon Tate is good, I was kinda disinterested in that, but it was all good stuff. Tarantino, as always, is on point. Some of these shots are works of art that rival Picasso. His craft has evolved so much since Reservoir Dogs, it's great. The ending. Oh the ending. I don't want to give any of it away, but damn! It's good. It's a very captivating 2 hours and 40 minutes. Do yourself a favor and check this one of the list."
  },
  {
    "rating": "4.5/5",
    "review": "Thrilling and gleefully chaotic, \"Once Upon a Time... In Hollywood\" is yet another marvelous hit from director Quentin Tarantino."
  },
  {
    "rating": "4.5/5",
    "review": "Tarantino has a penchant to be overly self-indulgent in many of his later offerings. This movie is a return to form, with great story, cast, and action pieces."
  },
  {
    "rating": "4.5/5",
    "review": "I actually enjoyed the movie very much. I'm 5 years behind everybody else in viewing it but I liked the story and particularly the ending. Brad Pitt was particularly good as was Leo DiCaprio. Both of their stories were very interesting making the movie more about their characters than Sharon Tate's...or at least that's what I got from the plot. Anyone that was alive when the Tate/LaBianca murders occurred remembers how horrific it was that 7 innocent souls were snuffed out in 1 hour of madness... I was a Sharon Tate fan even as a kid so her murder particularly affected me and all through my life I've thought about the \"What If's\" that could have taken place that could have kept her and the others safe from Manson's madness. She and the others would have simply went on with their lives and today she's be a Little Ole'Grandma now and would have had a fantastic acting career. This movie is emotionally satisfying because the victims of that sick bunch of useless people were spared the horrors of a tragic end. We all know it's not real life but I think Quentin Tarantino did a great job bringing this alternate version of reality to the public eye. Brad and Leo had great chemistry and Margot Robbie fit the part extremely well. All the actors played their part to bring together a great motion picture. Great job from everyone involved creating this wonderful movie."
  },
  {
    "rating": "5/5",
    "review": "Possibly my favourite movie of all time. I might be a bit biased, since I'm in love with old Hollywood, but it's undeniable that Tarantino is a master of his craft, and his latest film solidifies him as one of the greatest ever."
  },
  {
    "rating": "4.5/5",
    "review": "Once Upon a Time... In Hollywood is unusual Tarantino movie and some fans may be dissapointed with this work but to me this is one of my favourites and it is very enjoyable watch. Leo and Brad have great chemistry while story isnt boring to me at all despite long runtime . Humor and comedic scenes work also very good while its end climax give us classic Tarantino staff and in a very fun and over the top way. This is one fun ,engaging and investing movie."
  },
  {
    "rating": "4/5",
    "review": "Quentin Tarantino lovingly and endearingly proves again his absolute adoration of the silver screen whilst punctuating it with his famously engaging dialogue and edge."
  },
  {
    "rating": "5/5",
    "review": "\" I Try\"….Great Movie…."
  },
  {
    "rating": "1/5",
    "review": "Just Rotten. That's it."
  },
  {
    "rating": "5/5",
    "review": "Melhor filme do Quentin Tarantino"
  },
  {
    "rating": "3/5",
    "review": "Barely remember this movie"
  },
  {
    "rating": "4.5/5",
    "review": "Great colour costumes and feel, your really get that sense of Hollywood and cool breeze, got some great funny moments and characters that just demand your attention, they feel so real and relatable only downside is can't help but feel some scenes are a little drawn out and boring and the structure could have been different as it's not a story that goes anywhere more of a documentary of 2 days"
  },
  {
    "rating": "3.5/5",
    "review": "👍🏻74% Many conflicting feelings about this one… I really liked the first half, it had many homages to Hollywood and pretty engaging storylines. I did quickly lose interest in the second half as it all felt pointless and meaningless. The characters were still fun to watch but the storylines weren't as engaging, connected, and honestly as entertaining as the first half. The ending was crazy and great, but I do think that leading up to that, Tarantino falls into the issues I had with Pulp Fiction, the lack of direction and purpose. I don't know if I didn't get the message of the film, but I was a bit disappointed. It's still a pretty positive score because it's incredibly well made and often very entertaining. The film looks amazing. The production design, costumes, colors, and the camera movement come together to perfectly create the feeling of the late 1960s'. I also think Leo is brilliant here, balancing the great dialogue we've come to expect from Tarantino, with genuine emotion. Brad Pitt's Oscar win was warranted. He is hilarious and so immersed into the character to a point where I truly loved every time he was on screen, even when the scene itself doesn't move the plot much forward. The rest of the cast is also great, with stand-outs being Margot Robbie and Feyd-Rautha himself, Austin Butler. And also, just having Tarantino show his love for movies, with his extravagant style a bit more toned down, but still keeping it cool, is just a gift to movie fans today. I don't think this is one of Tarantino's best, but it's still a very worthy addition to his filmography."
  },
  {
    "rating": "5/5",
    "review": "Quentin's second best film after Jackie Brown. It's just perfect."
  },
  {
    "rating": "2.5/5",
    "review": "Compared to Tarantino's other films this was average at best. I appreciated the break from reality ending, and there are some amazing performances in this movie and visually its beautiful. However, there are just too many unneeded scenes that don't add to the film and slow the pace too much. I've heard Tarantino is considering retirement, I hope he doesn't go out on this one."
  },
  {
    "rating": "2/5",
    "review": "Directionless, uninspired, and pointless all throughout. It was the first and only time I actually almost fell asleep in the cinema. You could cut out 79% of all the scenes and dialogues in the film, and it would change nothing. Occasionally you get an interesting scene, to keep you from falling asleep, but you soon realize that the scene was pointless, as they never lead to anything. This could have been a 30 min short film, and it would have the exact same effect as the current, almost 3h time-waster. It's an amazing cast, led by an amazing director, and somehow this movie fails to keep the viewers' attention, and when it grabs it, it just throws it in the bin."
  },
  {
    "rating": "3.5/5",
    "review": "Once upon a time in hollywood is a movie is a movie which is about an actor rick dalton which work in tv shows and about his stunt double cliff . the director of this movie quentin tarantino which also the screenwriter of movie which also feel like it the action sequnces is good but not like other tarntino flims. And I suggest you don't watch this flim with your family there is some action sequnces which might be halaurious for kids and abusive language."
  },
  {
    "rating": "4/5",
    "review": "One of my favorite Tarantino films. Love the whole late 1960's vibe. Leonardo DiCaprio and Brad Pitt are so good together, and Tarantino's alternate history of the Manson Family and Sharon Tate incident is really entertaining."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was the most confusing back and forth bullshit i have ever watched. I wish I could get back the hours of my life watching this 👎 Signed Jen"
  },
  {
    "rating": "5/5",
    "review": "Here's a story that retells of the simpler days of Hollywood, along with a killer twist! Former action star Rick Dalton and his former stuntman/best friend Cliff Booth try to maintain a lifestyle in the changing world of film-making, unknowingly involving themselves with Sharon Tate, who is being threatened by the Manson family. Tarantino manages to capture the magic of nostalgia along with a healthy dose of realism in this unique twist of a story!"
  },
  {
    "rating": "4/5",
    "review": "I thought this was a great movie that's so different than any other Tarantino film. DeCaprio and Pitt were both exceptional. It's definitely worth the watch."
  },
  {
    "rating": "5/5",
    "review": "A gem from Quentin Tarantino. Once upon a time in Hollywood is a masterpiece set in old cinema. With great performances by Leonardo Dicaprio and Brad Pitt, humorous violence, great scenes, some incredible cameos by well-known actors from many films. A work for a large part of the public and another part of cinephiles. Highly recommended"
  },
  {
    "rating": "4/5",
    "review": "Great acting and sets."
  },
  {
    "rating": "5/5",
    "review": "espetacular movie! good dialogues, acting and story. The only action scene is in the end but it was awesome. I guess people were expectinf action throught all movie but it wasnt like that, even so one of the best from tarantino."
  },
  {
    "rating": "5/5",
    "review": "If you are a fan of Quentin Tarantino and the golden age of Hollywood movies, and movies in general, then this movie will certainly be for you. I think the negative reviews fail to realise what this movie really is. Just like Nolan's \"Oppenheimer\", a biopic of not only Dr Robert Oppenheimer himself, but science and the development of the atomic bomb, so too is Tarantino's \"Once upon a time in Hollywood\" a biopic of Hollywood cinema and movie making, the culture and the actors. I think if you watch this movie with that in mind, it changes your perspective upon viewing the movie. Honestly, give it a watch, Brad Pitt and DiCaprio giving some of the finest performances of their careers. The casting choice here is excellent as the old age of the Hollywood movie star era is coming to an end, and they perfectly fit the narrative of this."
  },
  {
    "rating": "3.5/5",
    "review": "A story about a sad time in Hollywood history that weaves itself around the Charles Manson family, a western star in the nadir of his career, his stunt double, Roman Polanski and his wife Sharon Tate. A great cast, a well-paced and told story, all work together to tell a tale that Hollywood would like to forget."
  },
  {
    "rating": "5/5",
    "review": "I have watched this several times and I absolutely love it!"
  },
  {
    "rating": "4.5/5",
    "review": "A movie about film sets, alternate history, and what it means to be a good friend. Has all the Tarantino trademarks."
  },
  {
    "rating": "4/5",
    "review": "A movie about a real life Hollywood tragedy with a twist at the end. Cliff is what made this movie. The best friend anyone could ask for. A loner who is rumored to have murdered his wife. The movie has little action scenes but makes the most of those scenes."
  },
  {
    "rating": "4.5/5",
    "review": "I have returned for reviews! Once upon a time in Hollywood is a 5 year old Tarantino tribute to the last year of the Hollywood golden age that revolves around the imagination and the reality combined. Just a really easy film to watch (except for the end of course), regarding: friendship, quotes and all round great storytelling. I remember watching this on the plane to Istanbul, thinking about this long after I landed which I think is what the film is really good at. The acting too is quite reminiscent of the 60's style and I really liked the idea about these 2 guys traveling around, which is all I really want from Tarantino: no story but great dialogue and a way to meltdown a few hours. While I wouldn't say I'd like Quentin, he has done not so great films that dwell on the complete opposites of what I want from him. But that's what his fans want I guess; a forgettable rendering of old nostalgia. But in terms of Once upon a time in Hollywood, it creates a feel good movie of not only nostalgia but heart and thoughts after viewing, which makes this his best in my personal preference. Only flaw is... lack of wrapping up! The film needed to bring all the big cast's stories to wrap up. Maybe they could of had them all together or something but this might be up to your imagination. Overall, cinema tributes at it's full force, Once upon a time in Hollywood creates fulfilling entertainment expertly thanks to a brilliant cast and one of the shining examples of how to make a film memorable. Grade: A+"
  },
  {
    "rating": "3.5/5",
    "review": "A good movie, not the best Tarantino movie, it's a slow one, but it works in its context."
  },
  {
    "rating": "4.5/5",
    "review": "Film excellent que j'ai savouré pendant les presque 3h. Je suis vraiment passé par plusieurs états durant le visionnage et les moments drôles, émouvant, prenant fonctionne parfaitement. Je ne serai dire ce qu'il manque pour un 5* mais il en est très proche pour moi. Le casting est fou et l'ambiance l'est tout autant. Pour moi, c'est quelques chose à regarder."
  },
  {
    "rating": "5/5",
    "review": "This movie is still at my #1 in terms of favorites. You get Brad Pitt, Leonardo DiCaprio and so many others all in one movie with a fantastic story? Count me in, you need to watch it!"
  },
  {
    "rating": "2/5",
    "review": "whaaaaaaaaaaaaaaaaaaaat expected way more idk"
  },
  {
    "rating": "2/5",
    "review": "A bizzare fantasy, loosely based on the Manson murders, that ends in a typical Tarantino fashion. Half the characters could have been cut out of the movie without making a difference to the story."
  },
  {
    "rating": "1/5",
    "review": "So lame!!! I loved his first movies but this was made by someone with ADD. Absolutely Terrible"
  },
  {
    "rating": "0.5/5",
    "review": "A film full of long, boring, and awkward moments. A film without a script, a mishmash of moments, clichés and winks that get lost in an insipid soup. The scene with the actress who watches herself on the big screen is soporific and pointless. The discussions between the cowboy and the little girl are too long. The visit to the Playboy Mansion, with the little texts referring to the artists present, like articles in an Ikea catalog. What a bore. A film that, stripped of all these useless moments, might have been enjoyable, but it's a bore. The question that keeps coming up is: why? The answer is: because there's no story."
  },
  {
    "rating": "5/5",
    "review": "One of my favorite movies of all time"
  },
  {
    "rating": "5/5",
    "review": "Perfection adaption of true reality. Taratino knows well how to direct a movie and make several references. My favorite adaption. 9/10"
  },
  {
    "rating": "1.5/5",
    "review": "It had all the glory of Terrintino and stars so I hung in there hoping a slow story would develop. Those qualities weren't enough. I gave up because I was bored."
  },
  {
    "rating": "4.5/5",
    "review": "Worth the wait just to watch the third act!!"
  },
  {
    "rating": "5/5",
    "review": "True Quentin Tarantino masterpiece. Good steady plot with some action, but the stunning performances of Leonardo DiCaprio and Brad Pitt make this movie truly exceptional."
  },
  {
    "rating": "1/5",
    "review": "I watched this movie...for a SECOND time...at the insistence of a friend who declared it to be \"one of my all-time favorite movies.\" Well.....there's almost 3 hours of my life I'll never get back. This will go down as one of the worst movies I've ever seen, and I've seen a lot of movies. Much like another Tarentino film, \"Pulp Fiction,\" I do not get why people rave about either. With most films, I can \"take 'em or leave 'em\" and I don't expect every film to be great. I DO expect that I won't be wasting my time watching a film. And that's how I feel about \"Once Upon A Time In Hollywood.\""
  },
  {
    "rating": "5/5",
    "review": "It's what you should expect from Tarantino. Great dialogue and superb acting leading up to a big crescendo."
  },
  {
    "rating": "4.5/5",
    "review": "Once Upon a Time in Hollywood is a cinematic masterpiece that stands out in the modern era of filmmaking, offering a refreshing departure from the often caricatured characters and curated clichés that have become commonplace in many recent movies."
  },
  {
    "rating": "5/5",
    "review": "Well made and fun movie."
  },
  {
    "rating": "3.5/5",
    "review": "Wow. It is so chill until the later half. Fantastic acting and cast. Highly entertaining. The ending is sublime. Masterfully done."
  },
  {
    "rating": "4/5",
    "review": "This film feels surprisingly relaxed and is solidly entertaining without getting in a hurry. The cast charms and the dialog is amusing in this fun, grounded tribute to late 60s Hollywood."
  },
  {
    "rating": "2/5",
    "review": "This film didn't quite hit the mark for me. It felt excessively long, dragging on without captivating my interest, ultimately leaving me feeling bored and disconnected. While many may have found it fantastic, I struggled to connect with the storyline and found it to be disjointed and lacking coherence. While the film received praise from critics and fans alike, my personal preference leans towards action-packed movies that keep me engaged and entertained. I value excitement and thrill in a film, seeking an immersive experience that keeps me on the edge of my seat, rather than one that relies heavily on drawn-out dialogue that fails to hold my attention."
  },
  {
    "rating": "5/5",
    "review": "Tarantino has yet again solidified himself in the cinematic universe as one of the most creative & innovative storytellers of our time. His legacy will be carried on and the minds of his beloved fan-base will forever cherish the mystique they felt every time they saw one of his movies. Bravo! 11/10 With an epic ending you've just got to stick around for !"
  },
  {
    "rating": "2.5/5",
    "review": "Some good scenes, environment, and cinematography. But the story was boring and slow paced."
  },
  {
    "rating": "1/5",
    "review": "What was the point of this movie? Nothing made sense and there was no plot. Can someone explain what they liked about this movie?"
  },
  {
    "rating": "4.5/5",
    "review": "Slow building but engaging enough to keep on watching, the character building throughout was exceptional, not the strongest storyline but subtle enough to keep you compelled, overall a very good film and a solid film"
  },
  {
    "rating": "5/5",
    "review": "Simply a perfect movie"
  },
  {
    "rating": "4/5",
    "review": "The more the movie meanders and finds little digressions and oddities the more I like it. The orgy of violence at the very end seems a little out of place, but then again Tarantino had to restrain himself for nearly three hours."
  },
  {
    "rating": "5/5",
    "review": "Fantastic. A great film."
  },
  {
    "rating": "3.5/5",
    "review": "Once Upon a Time in Hollywood offers a slow build, which might test the patience of some viewers. However, the film's climax delivers an intense and captivating conclusion that leaves a lasting impression. The movie's deliberate pacing ultimately sets the stage for a powerful ending, making it a unique and memorable cinematic experience."
  },
  {
    "rating": "5/5",
    "review": "A cinematic masterpiece by all means of the phrase. I've waited years for this to become readily available on replay, and...dear LORDT am I thrilled!!"
  },
  {
    "rating": "4/5",
    "review": "Als ich den Film das erste Mal gesehen habe, dachte ich mir was für eine langweilige Grütze. Davor hatte ich aber auch noch keinen anderen Tarantino Film gesehen. Als ich dann die anderen Filme alle nachgeholt habe und mir den Film nochmal ansah, habe ich die Genialität dahinter erst erkannt!"
  },
  {
    "rating": "2/5",
    "review": "This movie can't decide if it's a parody of Hollywood, or a serious story - it doesn't have enough comedy to be a parody, but all the characters act like they're in a parody. Additionally, it takes almost 1.5hrs before anything moderately interesting happens in the story. I'm just glad I didn't waste my money to see it in a theater."
  },
  {
    "rating": "2/5",
    "review": "As a Quinton T fan. Sadly I was disappointed in this film. Though I still kept engaged throughout, keen to see where it was going. I was left underwhelmed and couldn't help to wonder.... would I have seen it through if I wasn't a fan of the director and the cast. Probably not. I still enjoyed moment here and there that reminded me of other Quinton movies I love. But overall the movie wasn't great sadly"
  },
  {
    "rating": "3.5/5",
    "review": "The actors are the real people. After having spent some time in Hollywood and then on the east coast in the \"real world\", I've often thought that people in LA who wanted to be actors (or for whatever reason they ended up there) can be more real than the backstabbers in the \"real world\". This movie reflects that. The actors have genuine struggles and personalities while the civilians are either clueless or succumbed to a cult."
  },
  {
    "rating": "2/5",
    "review": "Loved it up until the revenge-fantasy bloodbath. Could have been a really great film if Tarantino had come up with a clever ending that didn't traffic in ultra violence. Instead he falls back on pretty much the same finale seen earlier in Inglourious Basterds. I guess being an auteur means repeating yourself. This director has a lot of talent, but seems addicted to gratuitous gore."
  },
  {
    "rating": "4/5",
    "review": "Awesome film. As always I love Tarantino's direction and screenplay. I would have preferred a slightly faster narrative. The ending is very cool."
  },
  {
    "rating": "4/5",
    "review": "Once Upon a Time in Hollywood is like a chill drive down in a classic car. DiCaprio and Pitt shine as faded stardust and loyal sidekick, cruising through groovy tunes and 60s vibes. Tarantino's love for Hollywood is infectious, but things are soooo slow, ending's kinda weird. Still, the bromance, the nostalgia, and the whole fame-game trip are fun as hell. Not quite mind-blowing, but good flick."
  },
  {
    "rating": "5/5",
    "review": "So much detail you need to watch it more than once! The setting, music and feel of the movie are amazing. Excellent cast! Loved it!"
  },
  {
    "rating": "4.5/5",
    "review": "Very unusual, and very very good!"
  },
  {
    "rating": "5/5",
    "review": "Great acting, funny as hell, cool characters with interesting relationships…All the things your typical dark humor and fake violence loving Gen Xer enjoys. One of the best movies I've seen in recent years."
  },
  {
    "rating": "3/5",
    "review": "A very lengthy film, despite having virtually no plot, features some reasonable elements of comedy, fights, and drama. It all culminates in a graphically violent ending with forced and senseless humor. However, the rest, such as the settings, costumes, and performances, were impeccable."
  },
  {
    "rating": "4.5/5",
    "review": "One of Quentin Tarintino's Best! I had so much fun with Once Upon a Time in Hollywood that I will say it is in Tarantino's top 3 films ever. The casting director needs to get an A+ because all of the Actors/Actresses in this film are perfect! Leo of course steals every scene he is in but Brad Pitt is not to far behind. Then you have Margot Robbie who is awesome as Sharon Tate. My only minor complaint about Margot Robbie's character is she has very little to do in this film but that was probably all by designed from Tarantino. This movie is a fun watch and if you think you know what's about to happen because of the era/timeline you really don't. Tarantino does a wonderful job of building this world and timeline that he is fully in control from start to finish. There are a lot of classic lines throughout this film. Anytime Once Upon A Time in Hollywood is on I have to watch it. This film gets a high 4 1/2 stars out of 5 from me."
  },
  {
    "rating": "5/5",
    "review": "I don’t care what anyone says, this is Tarantino’s best film"
  },
  {
    "rating": "2/5",
    "review": "Boring and too long. Good acting that's it."
  },
  {
    "rating": "3.5/5",
    "review": "Very good characters that work on the portrayal of the time, although some of them are very discardable, most feel right. This film also has amazing looks and ambiance."
  },
  {
    "rating": "0.5/5",
    "review": "Very fake and one-sided depiction of Bruce Lee, especially considering how much inspiration Tarantino has taken/stolen? from Bruce Lee over his career. Very arrogant of Tarantino actually."
  },
  {
    "rating": "5/5",
    "review": "A long movie that managed to keep me captivated throughout, easily Tarantino's best film!"
  },
  {
    "rating": "3/5",
    "review": "People should always love this movie's setting if you love a western movie. The busy, exciting, and full of hippies(as in the movie), which is during 1969 in Hollywood. However, people who should already know about Quentin's movie won't really talk about the historic event specifically. In contrast, he will use the historical event as an example. In this case, the murder of Sharon Tate. Leonardo's acting as Rick Dalton is absolutely terrific. Especially the raging part at Rick's horrible acting and the forgotten script. Also, Brad as Cliff Booth, shows the depression by being considered murdering his wife, and can't be the role of stuntman for Rick. The costume of Rick and Cliff can really show as Cliff being a jack and more casual person, and Rick as being a rich and more formal person. Also, the music picking responds to the occasion. In this case, 1969 Hollywood. A 60's with a casual vibe in California. About Quentin's feature in this movie, the not traditional timeline, full of narrative method, was one of the features I like, and iconic. In the story, the different scene, which is Rick and Cliff, however in the same specific timeline. This case Quentin was really special at putting all this scene together, and ended with a surprising ending. Which isn't the correct ending in historical events, the twist or the surprising event is another feature I love from the director Quentin Tarantino. These iconic impressions, in my opinion, all finish up this movie from a rating of 3/5, a special movie with a good cast and full of Quentin's features. Also, the special story with a surprising plot twist."
  },
  {
    "rating": "5/5",
    "review": "Tiene una energía tan vintage qué enamora, la historia es asombrosa, definitivamente es arte."
  },
  {
    "rating": "1/5",
    "review": "Nope, not for me. Terribly boring."
  },
  {
    "rating": "5/5",
    "review": "Arguably Tarantino's most restrained and best film, while still keeping that Tarantino swagger."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films of all time"
  },
  {
    "rating": "5/5",
    "review": "This is one of the best movies of recent years. Another triumph from Tarrantino. He really captures the '70's. Pitt and DeCaprio put in marvellous performances that nails their characters perfectly. Please don't stop at 10 Quentin if you are turning out films like this."
  },
  {
    "rating": "5/5",
    "review": "A Perfect movie and the third best Tarantino movie and Brad Pitt is great and the Settings are incredible. And the Final is Tarantinos best."
  },
  {
    "rating": "5/5",
    "review": "It's a great movie with a great down to earth story. Both Leonardo Decaprio and Brad Pitt both get their time to shine in the movie. The comedy is a little weird in the way it presents itself but it's a thrilling good great movie"
  },
  {
    "rating": "5/5",
    "review": "Simply amazing! Leo is killing it! Should have been his second Oscar!"
  },
  {
    "rating": "1.5/5",
    "review": "Boring and aimless. The only scene worth watching was with Dicaprio and child actor, Julia Butters talking about acting. Also, they did Bruce Lee dirty in this, wtf!?!? I thought Tarantino was a fan but apparently not. Not sure what the point was of having child rapist Roman Polanski in the film either. Huge fail for Tarantino, I used to be a huge fan. ROTTEN"
  },
  {
    "rating": "3/5",
    "review": "was a bit long. the fight seen carried"
  },
  {
    "rating": "2/5",
    "review": "A perfect film in many aspects: direction, acting, music, cinematography, depth of characters, tributes to past cinematic glories, etc. But the lack of a solid and articulated storyline strongly undermines its pace and makes the film extremely boring to follow."
  },
  {
    "rating": "2/5",
    "review": "One hour too long. Way over hyped."
  },
  {
    "rating": "0.5/5",
    "review": "Why does everyone love this?"
  },
  {
    "rating": "5/5",
    "review": "I am not a Quentin Tarantino fan by any means, but I am glad I watched this one. The recreation of the late 60's is unbelievable, the duo of DiCaprio and Pitt at the top of their game and there are so many clever homages I wouldn't even know where to begin. This is the kind of project Tarantino should stick to from now on, this one isn't just a movie, it's art. A delightful masterpiece. Well done, Mr. Tarantino."
  },
  {
    "rating": "4/5",
    "review": "It was great to see a new Quentin Tarantino directored movie. You can see right before you his unique eye for shots and perspective as these stunt men try to movie through an movie set. Worth a watch."
  },
  {
    "rating": "3.5/5",
    "review": "It is a decent movie. But probably my least favorite Tarantino film."
  },
  {
    "rating": "2/5",
    "review": "utterly pointless and unentertaining from start to finish."
  },
  {
    "rating": "4.5/5",
    "review": "Seemingly aimless at some points yet wildly entertaining. Definitely one of Tarantino's more flawed films (due to its length and plotlessness), but I cannot say that I didn't enjoy every second of this movie. This movie also has great likeable characters, great direction, and intensely good violence. I'm still not sure how I feel about the inclusion of Sharon Tate in this movie. It made for a good twist, but it seemed a little unnecessary and insensitive. I was honestly just confused why Sharon Tate was even in this movie for the first 2 hours."
  },
  {
    "rating": "0.5/5",
    "review": "A boring and imbecilic movie. Tarantino knows nothing about the Manson Family murders and purposely scrambles the case in the name of creativity, of which his has apparently dried up. The soundtrack is a complete miss. All nuance and mystique is lost."
  },
  {
    "rating": "2/5",
    "review": "Although the cast, the director and the plot leaves you with high hopes, Once upon a time in Hollywood ends up being a dull and messy result that wastes Tarantino's talent. Additionally, it's just another movie that you hope it gets better but it never does and instead of that it tries to cover it up with solid performances from big names of the industry."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is a love letter to Hollywood and it's glory days"
  },
  {
    "rating": "4/5",
    "review": "Quentin Tarantino's \"Once Upon a Time in Hollywood\" is a stylish and nostalgic journey through 1960s LA. DiCaprio and Pitt deliver stellar performances, while Tarantino's signature blend of humor and violence shines. The film's deliberate pacing might challenge some, but its attention to detail and alternate history twist make it a must-see for fans of Tarantino's unique storytelling."
  },
  {
    "rating": "1/5",
    "review": "No question about it - what a shit film this is. Tarantino garbage."
  },
  {
    "rating": "4.5/5",
    "review": "Another brilliant QT movie, has he ever directed anything less than above average? Best film of the year easy."
  },
  {
    "rating": "5/5",
    "review": "Gets better the more you watch it lol"
  },
  {
    "rating": "5/5",
    "review": "Gets better with every watch. Might have become my favourite Tarantino film. Dicaprio is genuinely moving in this role without doing his usual shouting schtick."
  },
  {
    "rating": "4/5",
    "review": "Love him or hate him, Tarantino is a creative genius. Personally, I think he's a director who ranks with some of the best. But he is marmite: you either love him, or hate him and each one of his films are split into categories of 'excellent' or 'poor' by critics but very rarely in between the two. This latest entry seems to follow suit. 'Once Upon A Time In... Hollywood' is set in the late sixties at the height of the notorious cult commanded by Charles Manson and primarily follows actor, Rick Dalton who is desperately trying to reclaim and retain his golden status on screen and his best friend and stunt double, Cliff Booth, now turned general dogsbody. So what's my personal take on this film? Well, this is Tarantino as I have not seen him before. Of course, the cast (which includes stalwarts of any Tarantino film) are all given his usual, cutting-edge, trademark dialogue which has become infamous. Brad Pitt (Cliff Booth) and Leonardo Dicaprio, (Rick Dalton) make an exceptional on-screen pairing, bouncing off of each other seemlessly. DiCaprio's portrayal of an actor whose light is slowly flickering out is at times poignant but this is immediately offset by Pitt's comedic approach. Being that without Dicaprio's 'Dalton', Pitt's 'Booth' is destined to be even more forgotten than his peer, this humour, whether intentional or not, should be frowned upon, but for some reason it just works. Ultimately, it is these two actors that will leave their mark on audiences... NOT the inclusion of Sharon Tate or the Manson family. Margot Robbies' performance of Tate has been heavily criticised and Tarantino has been attacked on not giving her more dedicated screen time or more dialogue. Personally, I think her casting and performance presents a sense of trepidation to the film which captivates us. In reality, her violent murder shook the world to the bare bones and ended the golden age of Hollywood for many. For those of us who know her fate, it's actually difficult at times to watch her enjoying herself, or to hear near the end, 'Out of time' by The Rolling Stones play: her's was a life taken too soon at the beginning of what could have been an illustrious career that quite possibly could have gone down in the annals of history very differently. But this is Quentin Tarantino, and his film's title begins with, 'Once upon a time...' and just as World War 2 was reimagined in his 'Inglourious Basterds', Sharon Tate's demise is given a fairytale ending that should strike a chord within all of us. And it is this which sets aside this 9th entry from Tarantino to his previous releases. This movie has heart. It is Tarantino, reaching back to that fateful year, that terrifying night, and wishing that he could rewrite it. Very much so in a way that we wish so too. Even the trademarked violence that we acknowledge will be present in any of his works is watered down. And when the climactic ending does begin rolling, you find yourself practically cheering at the screen. So, with a scolding hot soundtrack accompanying the beautifully shot backdrop of 1969, I genuinely believe this to be one of Tarantino's best films. Do I believe it to be misunderstood? Yes. Do I believe that in years down the line people will reflect upon it? Most certainly. But regardless of any review, audiences are going in droves to watch it which raked in an incredible $41 million (£39 million) on its opening weekend in the USA alone. And so the wait begins for what will next be his 10th and, as stated by the director himself, final directorial feat?"
  },
  {
    "rating": "5/5",
    "review": "Tarantino does it again! I simply loved this movie."
  },
  {
    "rating": "4/5",
    "review": "Once Upon a Time in Hollywood is Tarantino's vintage charm, with brilliant performances from DiCaprio and Pitt, delivering a captivating and nostalgic journey through 1960s Hollywood."
  },
  {
    "rating": "4/5",
    "review": "This film is fun! I think that many people want it to be realistic and the movie goes more for Hollywood fantasy."
  },
  {
    "rating": "2.5/5",
    "review": "In my opinion boring"
  },
  {
    "rating": "4.5/5",
    "review": "Tremenda obra de arte 20/10 y god"
  },
  {
    "rating": "0.5/5",
    "review": "Demasiado lenta, sin sentido, super mala , no la volvere a ver"
  },
  {
    "rating": "5/5",
    "review": "Fantastic love letter to the final era of old Hollywood."
  },
  {
    "rating": "4.5/5",
    "review": "Watched again for the second time. Liked but didn't love it the first time. Second time through this was so much better. Ending is still insane but I really liked the first half more this time. Fun movie!"
  },
  {
    "rating": "5/5",
    "review": "I'm obsessed with this film."
  },
  {
    "rating": "3/5",
    "review": "It would've been good had it been a half hour shorter."
  },
  {
    "rating": "5/5",
    "review": "nothing happens but i loved it 🤷‍♂️"
  },
  {
    "rating": "2.5/5",
    "review": "It was okay but not my favorite. The climax kind of came out of nowhere and didn’t get resolved in a satisfactory way. The movie is also too long. The acting was all very good but it just wasn’t my type of movie."
  },
  {
    "rating": "1/5",
    "review": "Am amazed this film is as well received as it is, plot goes nowhere, subplots go nowhere, its overly long and extremely boring. Tarantino is very over endulgent with this one. Gains half a star because the acting is impressive, especially from Brad Pitt who is a stand out."
  },
  {
    "rating": "4.5/5",
    "review": "Let's talk about the 9th film by Quentin Tarantino is Once Upon a Time in Hollywood or is it the 10th film, I don't know. If you call it the 9th film by him, it doesn't make sense if you call it that without missing one movie by Tarantino or the fact you called Kill Bill: Volume 2 the 4th film instead of the 5th film by lingering Part 1 & 2 together and then call it the 4th film by Quentin Tarantino even that really is convoluted to say the least. But after I reviewed Pulp Fiction which I think it's one of Quentin Tarantino's masterpiece and now with Once Upon a Time in Hollywood on our hands, this one goes on the different route. This one is taken in Hollywood. It has come to the official point of view Quentin is making a 10th film which says to be his final film, The Movie Critic. If I get the chance to see it, I'll be sure to welcome to it. All right, let's get on with it. An actor and a stuntman, Rick Dalton and Cliff Booth played by Leonardo DiCaprio and Brad Pitt, are navigating the rapidly changing film industry. Rick's agent, Marvin Schwarz, advises him to make Spaghetti Westerns in Italy. He gets upset about this and Cliff Booth cheers him up and he still doing the western show, Bounty Law. The next morning, Rick is doing a TV Western, Lancer in the movie set, Cliff is visiting the hippies after fixing Rick's antenna on top of his house. Upon seeing the other films by Tarantino I am so looking forward to reviewing them just like I did with the others by David Fincher and Martin Scorsese. And if that movie I am doing is going to interest you, let me give you a recommendation in that factor. Margot Robbie is Sharon Tate, a real-life actress who stars in Valley of the Dolls and she is in love with Roman Polanski. She's got nothing to do apart from going to the Playboy Mansion with Roman Polanski and goes to the cinema, that's it. And if you believe in that factor, then let me give you the recommendation. Alrighty, let's see what we got here. If you a fan of Margot Robbie or you have the hot's for her, you should go and see her with Leonardo DiCaprio in The Wolf of Wall Street. If you can't get enough of her, go and see her with Brad Pitt in Babylon. (I mean, who wouldn't?) If you a huge fan of Quentin Tarantino like I am recently, go and check out Brad Pitt in Inglourious B*****ds. If you are obsessed with the director, check out Leonardo DiCaprio in Django Unchained. And if you really wanna get the inspiration of wanting to see both actors together with the director, go check out Once Upon a Time… in Hollywood. (Chuckles) And if that's not enough, let me tell you what's really surprising. If you love Scarface and The Godfather trilogy, Al Pacino is in it. Hooray! Along with Kurt Russell. For a film by Quentin Tarantino, the violence doesn't kick in until the very end so nothing in it is really that disturbing or gratuitous to be exact. For a movie that is a two hour and a half running time, much like more movies I've seen that is nearly three hours is one those that's just a lot of fun. Something that is impeccable, something that is groundbreaking, something that has a lot of potential. Once Upon a Time in Hollywood is a masterful piece of filmmaking that's taken place in 1960's is an improvement from what Quentin Tarantino achieved. The acting is impressive, the cinematography is top-notch, the story is improving and the directing style is immense. I love Quentin Tarantino as a director. He is phenomenal! But I still wish he hadn't retire from movies after the 10th film he was going to do but I can't imagine why. I don't think Tarantino ever made a bad film. Never in his life he has. But what can I say? It's all down to the creativity he has. It is one of the best films of 2019. I f**king love Once Upon a Time… in Hollywood."
  },
  {
    "rating": "5/5",
    "review": "just a smashing flick, a masterpiece, this Tarantino's feat a perfect avenge on the Sharon Tate's gruesome murder, the final scene was a belter, made me fall about. I was laughing my ass off when Rick Dalton kept forgetting the lines. Leo a way gifted comedian."
  },
  {
    "rating": "5/5",
    "review": "I can't be unbiased when it comes to Tarantino's movies, but Once Upon a Time... in Hollywood is just as unique in its writing, cinematography and craftsmanship as any of his previous wild creations. Delightfully unrestrained, with masterful pacing that allows a lively, breathing, picturesque exposition before twisting the proverbial knife with a fitting peripeteia; a torrent of indulgent but purposeful violence, a fiery crescendo unleashed before the audience's eyes... It's a fitting, nostalgic, and colorful ode to a point in time at one place, wonderfully enriched with a signature touch of insanity---this film has it all. If it is truly to be the last from the trailblazing icon that is Quentin Tarantino, it shall be the most honorable of discharges."
  },
  {
    "rating": "5/5",
    "review": "It truly is brilliant. Tarantino, once again, cleverly mashes history, cinema, and his brain into another fascinating and funny film. It's cinematography and coloring bring hippie color schemes and 1960s L.A. to life. It's Academy-Award-winning production design is on-point and never fails to impress. It's writing is witty and its story is unforgettable. Not to mention, Tarantino leads an absolutely wonderful cast. Leonardo DiCaprio and Brad Pitt, however, are the true highlights. I was baffled at how they seemed like they had really been best friends for what seemed a lifetime. DiCaprio never ceases to amaze whether he's crying over his roles and his soul, taunting little girls as a villainous cowboy, or dead-drunk as a rich actor. Brad Pitt beautifully balances both the personality of a caring friend and a cool dude with perfect comedic-timing and some of the film's best lines. I loved the film's silliness, grittiness, attention-to-detail, its telling of the times, and telling of a new tale. Its hard to think of another movie that is anything like Once Upon A Time In…Hollywood (except maybe another Tarantino film)."
  },
  {
    "rating": "5/5",
    "review": "This is Tarantino's best film so far, and any nay-sayers who say it's bad or poorly written are just feeling targeted by the film's wit and sensibilities. Go into it as blind as you can and just enjoy the ride. This film is for movie lovers."
  },
  {
    "rating": "3/5",
    "review": "In the search for novelty of it, the story telling remains weak."
  },
  {
    "rating": "3.5/5",
    "review": "Can't decide whether I like the ending or not otherwise it's an awesome movie."
  },
  {
    "rating": "4.5/5",
    "review": "It's technically a movie about love to movies with typical touch of Tarantino"
  },
  {
    "rating": "5/5",
    "review": "Quentin Tarantino at his best, another what if in history. Entertaining, funny with the occasional \"Holy Shit\". Must See"
  },
  {
    "rating": "5/5",
    "review": "This was truly Quentin Tarantino's masterpiece and love letter to Hollywood."
  },
  {
    "rating": "4.5/5",
    "review": "Brilliant, sometimes hilarious, and in many cases indelibly memorable set-pieces that lace together nicely, with an underlying love of the movies and a wicked appreciation of movie violence and impossibly happy endings. Pitt, DiCaprio and Robbie are at the top of their forms."
  },
  {
    "rating": "4.5/5",
    "review": "Another tarentino hit a bit too long but still a great movie and interesting story."
  },
  {
    "rating": "2.5/5",
    "review": "Unfortunately, I watched in 2019 year one of the rarely appeared movies of Quentin Tarantino. It was \"Once upon a time in Hollywood\", I started with great expectations. In dedication to the event, I go to the cinema theatre to wathing it on a huge screen ... There was something ironical in watching sort of middle kind of his pictures on the screen, while better major movies in past times - in bad quality on a screen not much bigger, than postcard. At least, I saw nothing as attractive in it, as noticed in \"Pulp fiction\". For example, more than in half of film director's films were suitable elaborate soundtracks. In the film soundtarack was spoiled by addition of unexpected \"Mr. Robinson\" track, that ideally fitted to other too popular and widespread known film \"The graduate\" and strongly associated with it. In plot of the \"Once upon a time ...\" There was nothing common with songs sense or it's words, even even any moods of the film. It's strange and unexplainable, for my point of view. In fact, the film doesn't have any deffinite general mood at all. Disadvantages are obvious, but film, nethertheless, wasn't failure, maybe, because pair of main characters was rather great without lots of efforts. Brad Pitt looked like in half of his roles now, Leonardo DiCaprio was too musculine, to my point of view and impressions of his past filmography and career, where I mostly imagine him as kind of forever yong person, victim, dreamer. I have never saw any real brutality in Leonardo DiCaprio play in any age of the actor's career. Here Leonardo DiCaprio looks just like a Pitt's copy, but it seems natural, also didn't annoy me. Second point - it was initially good idea to made such a kind of film on the topic, but it's plot was rather odious. I wondered that frightened me more: it's cruelty or it's narrative disadvantages."
  },
  {
    "rating": "2/5",
    "review": "Right over my head, did not get it. Usually in Tarantino's films the violence makes sense. In this one it didn't seem to, even when you know the backstory."
  },
  {
    "rating": "1/5",
    "review": "my least favorite Tarantino film - slow, drawn out, nothing like his other films"
  },
  {
    "rating": "3.5/5",
    "review": "\"Getting blind drunk is the only way to say farewell\". Enjoy the spectacle."
  },
  {
    "rating": "1.5/5",
    "review": "A terribly disappointing film 👎🏻"
  },
  {
    "rating": "5/5",
    "review": "Simply marvelous! Tarantino's another great hit for sure. Love it every minute of it."
  },
  {
    "rating": "2/5",
    "review": "Great interesting characters, terrible story and movie overall."
  },
  {
    "rating": "0.5/5",
    "review": "J'ai détesté ce film. Tarantino est nostalgique d'une époque qu'il n'a pas connue et s'offre un film qui lui fait plaisir à lui, avec des acteurs excellents. Sauf qu'il nous laisse en dehors, l'histoire n'a ni queue ni tête, c'est totalement superficiel, gratuit. Les personnages ont l'épaisseur de ces poupées découpées dans du papier. Les hommes s'en sortent un peu mieux, mais les personnages féminins n'ont aucune épaisseur, les filles sont cruches et bien sûr sont de 30 ans plus jeunes que leurs homologues masculins (on voit bien que c'est un mec de 60 ans qui a fait le film). Pour finir, Tarantino joue à la fin sur un suspens glauque et dégueulasse au sujet de Sharon Tate, et cela se termine dans une apothéose de violence insoutenable... Non, Tarantino est auteur complètement surfait, et on ne me reprendra plus jamais à aller voir un de ces films."
  },
  {
    "rating": "3.5/5",
    "review": "Tarantino says this is his best movie, I disagree. That's one of his worst."
  },
  {
    "rating": "5/5",
    "review": "A real amazing movie which brings you the old skool classic vibes of Hollywood land. The movie from start to end is really amazing. It's not a thriller or anything, but an atmospheric movie which you can watch at home on holidays or like that. Still the climax scene was really thrilling which was outstanding. The acting performance of the star cast like Leo, Brad and Margot and all was as expected was really outstanding as well. Anyway a really amazing movie which is a must watch one I say💯"
  },
  {
    "rating": "5/5",
    "review": "The movie captures the flair back then perfectly. The acting, dialogue, and directing is simply amazing. Tarantino just doesn't miss."
  },
  {
    "rating": "4/5",
    "review": "Such a classic.well written and acted. Worth your time. Watch it!"
  },
  {
    "rating": "3/5",
    "review": "Loved parts of the movie. But Tarantino focuses too much on the old time Western television shows, which I found dull. I enjoyed the Charlie Manson parts a lot more. Overall it's an average film."
  },
  {
    "rating": "2/5",
    "review": "Extremely mediocre. No real enthusiasm from the actors or the script. The pool scene towards the end seems to get a lot of attention, but to built up for hours just for that seems like a waste of a lot of talent both on and off screen."
  },
  {
    "rating": "5/5",
    "review": "Great fun from beginning to end--Everything portrayed as it might have been. I discovered a new admiration for Quentin Tarrentino."
  },
  {
    "rating": "3.5/5",
    "review": "I thought this was a pleasant surprise. I expected a lot from Tarantino since he made two of my favorite movies, and I got a pretty decent movie. Yes, it's kind of confusing and all, but it had that Tarantino's spark I missed so much. Violence, comedy, drama, it had it all, I loved it. The story is really nice, and the acting was inpecable, especially from Leonardo DiCaprio, man, he nailed it, a very underrated performance. Brad Pitt was good too and also the rest of the cast. Pretty good, I liked it."
  },
  {
    "rating": "4.5/5",
    "review": "This movie has all of the great things that make Tarantino's movies so great. The acting, dialogue, and story is really interesting. I am not going to spoil anything when I address a common complaint: What is the point? It is alternative history and how something as small as what happens can change historical narrative and history forever. It is a fascinating and great concept that just may be above the general watcher. The ending sequence is so amazingly coordinated and hilarious that you have to watch. I have re-watched this movie twice in a matter of weeks because I loved it so much. It becomes so engrossing that you forget how long the movie is, I was sad that it ended when it did because I absolutely wanted more."
  },
  {
    "rating": "2/5",
    "review": "Watch this film if you care about 1960's Hollywood. Watch if you want to view the dynamics concerning 1960's television actors and their stunt doubles. Watch if you know who Sharon Tate is. If you answered all three in the affirmative, than you're in the minority. Movie bad"
  },
  {
    "rating": "3/5",
    "review": "No real story arc, extended scenes could have been removed. Excellent cinematography."
  },
  {
    "rating": "4.5/5",
    "review": "Being one of the last films directed by Quentin Tarantino, this one manages to excellently capture the aesthetic of Hollywood in its golden years. However, the only thing Quentin fails in this movie is telling a smooth story, but if we put that aside, Once Upon a Time... in Hollywood is a movie full of action, good performances and that will keep you entertained for hours."
  },
  {
    "rating": "0.5/5",
    "review": "Incohesive and boring. Easily Tarantino's worst film in my opinion."
  },
  {
    "rating": "5/5",
    "review": "My favorite Tarantino film of all time. And I really love all his stuff, esp Jackie Brown. I've seen it 7 times now, and each time I pick up new things. It just gets better! Pitt and Leo are phenomenal playing off each other"
  },
  {
    "rating": "5/5",
    "review": "When Tarantino puts out a movie… it's an event that I am happy to lineup for. And I'm happy to say this one did not disappoint. This is a brilliant film, this could rank as one of the greatest buddy films of all time, When I say, which is my favorite Tarantino movie, it usually happens to be the one that I'm watching currently. I know thunpopular opinion) this might be my favorite Tarantino film. Because when you watch a Tarantino film, you know his primary goal is to take you into his movie world and give you an experience. The acting is phenomenal down to every single cent piece . The photography is sublime. And the best part is this really is a buddy film ( and you can feel the love between these two friends, Rick Dalton, and Cliff Booth.) Leo and Brad play them to perfection. Kudos that the Academy recognized Brad Pitt for his performance, but Leo was phenomenal as well and the direction and movie as a whole was just a blast. And it brought attention to an actress I really didn't know much about other than the Manson murders. Margot Robbie was terrific as well in her portrayal of Sharon Tate . I certainly hope Tarantino is going to give us at least one more masterpiece before he hangs up his directors chair."
  },
  {
    "rating": "4.5/5",
    "review": "What a cracking film. Great dialogue, great acting. Tarantino on top form. Hugely enjoyable throughout. BUT. Give the back story of Charles Manson that runs through the entirety of the film there is a palpable sense that things are just not going to work out well. You feel uneasy. And then... No seriously, watch this film."
  },
  {
    "rating": "1.5/5",
    "review": "Good looking film. Boring as sin until the last 10mins."
  },
  {
    "rating": "3/5",
    "review": "Very mediocre. Such a long buildup just for a very average fight scene that leaves you confused because you were expecting way more than that."
  },
  {
    "rating": "3/5",
    "review": "只有最后飙血的段落能看，其余段落充斥着各种各样过饱和的做作情怀。古人写诗都知道得\"赋比兴\"穿插着来，结果21世纪了拍个电影竟然靠着空空荡荡的\"满腔情怀\"就能拿学院奖提名……"
  },
  {
    "rating": "4/5",
    "review": "Honestly, the movie had me confused, but sign me up for any Brad Pitt/Leo combo that exists. I've been sitting here for 15 minutes trying to understand the point of a lot of the last 2.5 hours, but it had me entertained and that's all I'm looking for."
  },
  {
    "rating": "3.5/5",
    "review": "A good movie as usual, cinematography is amazing but looses my attention sometimes, thus not as good as much of his filmography. But still a great piece of film!"
  },
  {
    "rating": "4.5/5",
    "review": "Tarantino delivers again with this wild ride through an alternate reality. DiCaprio and Pitt are on the top of their game."
  },
  {
    "rating": "4.5/5",
    "review": "Another absolute Gem of a movie by Quentin Tarantino, engaging, funny, suspenseful, coupled with just the perfect amount of historical fiction Quentin Tarantino uses for some of his movies, and you have an immediate gem, the only reason this isn't a 5 star rating, is because the driving scenes were a little too long"
  },
  {
    "rating": "3.5/5",
    "review": "I found it a little boring until the last 1/2 hour where It was 5 star."
  },
  {
    "rating": "4/5",
    "review": "What a trippity-trip down the golden age of Hollywood. This film might not exactly have the same gravitas Blade Runner or Parasite has, but it sure is an entertaining watch. Comedy is on point and brilliantly delivered, great performances by an all-star cast, and boy oh boy... Now THAT climax is one for the ages!"
  },
  {
    "rating": "5/5",
    "review": "The best! Hilarious and captivating! Maybe Tarantino's best, and that's saying a lot. Capturing 60s TV as if transporting me back in a time machine, with all the hijinks of actors and their agents, is phenomenal. I laughed my ass off! That whole Pacino schtick -- \"Who's gonna kick your ass this week? Mannix? The Man from Uncle? [chuckle] The Girl from Uncle?...\" Just a superb quote that will live forever!"
  },
  {
    "rating": "0.5/5",
    "review": "Probably QT's worst. Margot Robbie is an awful actress"
  },
  {
    "rating": "5/5",
    "review": "Its a movie . A really good movie . Its not a platform for social bizarrness , political stupidity , brain-washing or toxic extremeness . It's what we used to call a \"movie\" . Fabulous escapism . Clever intermingling of story lines . Beautiful performance . Actors doing what they are supposed to do instead of preaching at how wrong we all are . And the best thing is there is no Harry or that rancid Meghan Markle in sight . Quite superb ."
  },
  {
    "rating": "4.5/5",
    "review": "It's a wonderful ode to the cinema in the 60's !!"
  },
  {
    "rating": "1.5/5",
    "review": "Yet another overrated film in 2019. I found almost nothing entertaining about this movie except watching Margot Robbie play Sharon Tate, watching herself on the big screen at the movies."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie. Creative as always from Tarantino. Would have liked him to expand or focus a little more on the Mansons to give a little better picture but I can see why he didn’t since it wasn’t mainly about them. The acting is phenomenal and some of DiCaprio’s best work. The ending isn’t what I expected and left the movie feeling slightly empty because of it, but everything up to that point was well done. I wouldn’t consider it one of Tarantino’s best, but definitely not his worst. Good all around and entertaining movie."
  },
  {
    "rating": "5/5",
    "review": "The best acting performance from Brad Pitt! With the best movie title sequence ever made!"
  },
  {
    "rating": "2.5/5",
    "review": "Whilst Quentin Tarantino's \"Once Upon a Time in Hollywood\" does have a decent cast and performances from Leonardo DiCaprio and Brad Pitt, it is a real shame that Margot Robbie's (known for her fame as Harley Quinn) role did not have any opportunity to shine in addition to the long run-time and a rather mediocre story that is filled with poorly dated tropes and representations."
  },
  {
    "rating": "4/5",
    "review": "Some characters fall flat and it can be a bit weakly paced at times, but as usual Tarantinoism- there is a very unconventionally told narrative filled with sick moments, beautifully shot scenes, immaculate screenplay and two outstanding performances from its two famed leads. It's also visually sharp and quite funny."
  },
  {
    "rating": "3.5/5",
    "review": "Quite entertaining despite Tarantino making up that Bruce Lee was a jerk."
  },
  {
    "rating": "5/5",
    "review": "Smartly crafted and well done, this shows that Tarantino has grown as a director, but it still has the same violent but yet funny moments that makes him great."
  },
  {
    "rating": "1.5/5",
    "review": "Really ... Just really??? You pack it with stars, and you made this??? Charity donations for tax deductions are all I can think of..."
  },
  {
    "rating": "2/5",
    "review": "Probably Tarantino’s most boring movie. I usually like his movies."
  },
  {
    "rating": "1.5/5",
    "review": "I think this is one of the worst movies I've ever seen. It doesn't go anywhere for like half the movie and the last half hour was just people screaming. The whole movie just had this really off vibe. The one good thing about it in my opinion is the acting which is why I didn't give it zero stars. I honestly do not recommend watching this movie but maybe watch it and you'll have a different opinion"
  },
  {
    "rating": "4.5/5",
    "review": "A great movie, well acted with DiCaprio's portrayal of Hollywood star dealing with a faltering career, and his friend (and also struggling) stuntman played by Pitt. Tarantino brings the Hollywood of the late 60s to life with depth, humanity and the sort of excellent dialogue we expect from him. Margot Robbie's Sharon Tate brings a much-needed portrayal of the actress as a person rather than a victim. The violent climax is over the top, sucking some of the energy out of a near-perfect movie, though it can't derail an ending that hits all the right notes beautifully."
  },
  {
    "rating": "5/5",
    "review": "New and Yet Classic. Quintin has done it again!"
  },
  {
    "rating": "2.5/5",
    "review": "I watched it; I didn't hate. Do I ever feel a need to watch it again? No. Did the film touch me emotionally or leave any lasting impression on me? No. Like I said I didn't hate it but can't seem to care that I don't recall much about it. Forgettable is the descriptive term that best sums up my feelings about this film."
  },
  {
    "rating": "4.5/5",
    "review": "Tarantino is great (as always). Loved everything about this movie. It's also one of the last movies I saw on the big screen. I'm not sure there any more good movies made lately."
  },
  {
    "rating": "5/5",
    "review": "Excellent Movie! Captures the look and feel of late 60s Hollywood The relationship between the two lead characters is well written and expertly performed by the two leads. Went in with reservations knowing the actual outcome of the real story of Sharon Tale and was surprised and relived at a poignant ending"
  },
  {
    "rating": "2/5",
    "review": "The story is just a collection of things that happens to happen and stretched far too long. Sharon Tate is the most pointless character coz she doesn't have any effect on the story one bit. Everything feels random. Rick shoots some Western, Cliff gave a hippy a ride and got some altercation with other hippies, Rick got lucky and shoots some Spaghetti Western, the hippies intend to kill some celebrity but got killed instead coz they happen to arrive at Rick's home. Screenplay isn't as engaging as some of Tarantino's best work, and that ending is done only because they need something crazy to end it."
  },
  {
    "rating": "1/5",
    "review": "A long boring movie. It went nowhere, just hours of disjointed bits one after the other, a sprinkle of gratuitous violence and of course a heavy dose of cigarette free advertising - which maybe wasn't free. Jeez Americans are fucked up if this is what they call entertainment."
  },
  {
    "rating": "5/5",
    "review": "This is a movie I am positive will age like a fine wine. I too was confused upon my first watch, and even my second. However come 3rd watch I realized this is a masterpiece. Leo is the best actor of our generation playing a mediocre and insecure actor who within the movie must play his characters with different acting prowess at different points. The story unfolds within 2 or 3 days but the characters are laid bare within what might be consider simple exchanges. I personally think this is the Tarantino at the height of his powers. Most will choose Pulp Fiction, I think this is his seminal work."
  },
  {
    "rating": "3.5/5",
    "review": "Not even close to Tarantino’s best work, but it kept me invested enough."
  },
  {
    "rating": "5/5",
    "review": "Tarantino and Pitt are highlights in this modern classic. Once Upon a Time In Hollywood is strong in all aspects of film. Quentin brings heart to this one..."
  },
  {
    "rating": "4/5",
    "review": "filme legal pra caralho, o roteiro é foda, os personagens são excelentes, as cenas são fodas, as atuações foram excelentes, gostei do personagens do brad pitt no filme o Cliff Booth, e gostei muito da atuação do leonardo dicaprio, e achei legal o personagem da margot robbie, no final aparece a gangue da fazenda para atacar o Cliff Booth e o leoardo dicaprio (Rick Dalton), e o Cliff Booth tacou a lata de comida na cara do maluco, e amassou a cara da guria na mesa de vidro e na parede e depois Rick Dalton se assusta com os barulhos e pega o lança-chamas tacando fogo na cara de guria e a matando-a, esse filme eu recomendo pra caralho vale muito a pena assistir."
  },
  {
    "rating": "5/5",
    "review": "The plot is not boring. my pals & me can watch over and over while everyone will be amazed every time."
  },
  {
    "rating": "1.5/5",
    "review": "Rated R: for revisionist history fever dreams. Not suitable for IQ's over 100. I seriously think Quinton has some deep psychological issue to keep writing this kind of revisionist crap. Does it make him feel better? It's just really, really weird. You usually don't see this kind of detachment from reality outside of a cartoon or superhero movie. For me it just doesn't work because I have a brain. I didn't cheer when the good guys killed the Nazis in Inglorious Bastards. I just found it completely stupid. Same with this horrible ending. Unless you are doing major world building then rewriting major historical events in isolation is just, really, really stupid and more then a little bit weird. Outside of that there is pretty much zero plot here. Just following around a has been actor and his tough guy lap dog until the final fever dream at the end. It's DiCaprios worst performance in a while. The accent is just awful. Pitt does more with a single look than 100 lines from DiCaprio. But then Pitts sycophantic, tough guy character is not very believable. To be believable he would have had to punch DiCaprio's character right in the face several times because no self respecting person would endure DiCaprios constant sniveling. Margot Robbie is in it but has so little screen time you'll forget all about her. Just seemed like a total waste of talent. At least he resisted going to Spahn ranch and killing Charlie with a flame thrower in the end."
  },
  {
    "rating": "4.5/5",
    "review": "I liked it for its unpredictability. I never knew where the story was heading next."
  },
  {
    "rating": "4/5",
    "review": "You can see Tarantinos handwriting in every scene of the movie. A masterpiece"
  },
  {
    "rating": "4.5/5",
    "review": "An entertaining movie filled with fantastic performances and gripping dialogue. Although, this movie is slightly directionless as I was 2/3rds of the way through the movie and had no idea where it was trying to take me. Despite that fact, I still was engaged and had a great time watching. The third act is so off the walls and crazy that it makes the entire slow burn of the film worth every second. Score: 88% Verdict: Excellent"
  },
  {
    "rating": "2/5",
    "review": "Long uninteresting unfocussed movie."
  },
  {
    "rating": "4/5",
    "review": "Slow however interesting"
  },
  {
    "rating": "3/5",
    "review": "Blobbo not see. Too too long. Tarantino look like Bob Hope, Grandpa Munster mashup."
  },
  {
    "rating": "1/5",
    "review": "I am a huge QT fan. It's his first truly unwatchable film. It's so very long and boring. Ultimately the story is too big to ignore. The whole \"it never happened\" thing while sweet, feels forced. Like Bobby's \"it was all a dream\" Dallas cliffhanger resolution, it robs the viewer of the authenticity of the previous hours of tension running through a seasoned and dedicated fan. An artist experiments. Occasionally, they are wrong. It is what it is. And it is a drag."
  },
  {
    "rating": "4/5",
    "review": "Tarantino' style of storytelling but not the typical action packed thriller but old hollywood nostalgia thriller that has different twist which audiences would appreciate (as we all know what really happened). Great acting as expected from leading ACTORS- yes that is including Margot Robbie as per \"Flower Girl\" character."
  },
  {
    "rating": "5/5",
    "review": "Amazing, the performances, the plot, the historical context"
  },
  {
    "rating": "5/5",
    "review": "What needs to be said"
  },
  {
    "rating": "5/5",
    "review": "I dont get it, this movie was amazing! hilarious in parts and very captivating in others. Casting was SPOT ON"
  },
  {
    "rating": "4.5/5",
    "review": "I enjoy a nostalgic setting and seeing how life was not that long ago. If you expect frenetic edits and multiple explosions per frame you will be disappointed. If you know what REALLY happened, you will instantly recognize the tension from the horror that is to come. It is enough to hold the viewer in anticipation -- they will wait patiently to see how Cliff Booth is going to tear apart the Manson thugs. My only beef with any QT film is that he stays in that revenge zone a bit too long. It feels good to repay evil with suffering. The questions is: how much can a good person punish evil, without himself becoming evil? One effective head bash is sufficient in most cases, but doing it over and over just makes the protagonist look like a fiend. Perhaps QT has been holding up that mirror to teach that fact. I feel good when I should feel shame."
  },
  {
    "rating": "3.5/5",
    "review": "Can't say I'm a fan of any of the actors but the spin on the Sharon Tate spin was nicely done, must admit. Watch it and enjoy just as a movie - it's nothing more than that."
  },
  {
    "rating": "4.5/5",
    "review": "QT puts together a beautiful film."
  },
  {
    "rating": "2.5/5",
    "review": "Clear out all the filler parts like overly long scenes of driving and walking etc.. and it's quite a good movie. I hear some people saying Margot Robbie was underutilized in this but that was the role and she played it. No big deal. It seems a little lost until it all pulls together at the end. I like that. I don't always have to know exactly what people are doing. I like to see how it's all laid out when the movie's over. All in all pretty good when there's actual acting and dialogue. Would be 3.5 but too much wasted time on \"filler\" scenes."
  },
  {
    "rating": "0.5/5",
    "review": "Once of the worst movies ever made. The whole movie seems so pointless. This is revisionist history just did not work. Margot Robbie was wasted in this film... she does NOTHING!"
  },
  {
    "rating": "4/5",
    "review": "The plot is a little hard to follow at the beginning but then when u get used you follow. The role of Leo and Pit great as always."
  },
  {
    "rating": "1/5",
    "review": "I really wanted to see this film! But this was like a very bad date: After 15 minutes I wondered \"where is this going?\" After 1 hour \"is this going anywhere?\" The answer: \"No, it stays crap! Good cast, great love to detail, but a very thin story. Just a waste of time!\" But lots of hype & marketing can sell \"this\" as gold. It's not!"
  },
  {
    "rating": "1.5/5",
    "review": "In general, Quentin Tarantino is overrated, and in this fashion he now got ahead of himself. Being in a better position than ever to cast who ever superstar he wants, he obviously does it, again, but only to smear them out on a too long and effectively tedious carouse through diverse Hollywood elements. It's all like he's opening a number of luxury tin can food flavours to say: - Look what I can eat, and no surprise, yet again it ends with his signature, an orgy of violence. This is just necessarily not very impressing, if it ever was. Since Pulp Fiction, his great exception and perhaps best film is Inglourious Basterds, because there's actually a good intentional point behind it all. Not so this time."
  },
  {
    "rating": "3.5/5",
    "review": "Once Upon a Time…In Hollywood dishes out the best and worst of what Quentin Tarantino has to offer. Centered around the relationship between fading actor Rick Dalton (Leonardo DiCaprio) and his stuntman Cliff Booth, the film is a nostalgic look at Hollywood culture during the summer of 1969. On the positive side, the characters are relentlessly interesting, the story is original, the acting is great, the dialogue is fantastic, the soundtrack is spot on, and Tarantino's visual style (lots of effective tracking shots, crane shots, etc) is evident at all times. The primary negative issue is the bloated 159 minute running time, thanks to Tarantino's inclusion of scenes that are either too long or totally unnecessary and the ridiculous number of cutaway shots of the cultural detritus of the time, giving the impression that he is more interested in entertaining himself than he is in entertaining the audience. It's good, but it should have been great."
  },
  {
    "rating": "4/5",
    "review": "The characters / acting and numerous odes to the Golden Age of Hollywood keep this movie engaging. And just as you wonder where it's going, everything comes together and concludes in classic Tarantino style."
  },
  {
    "rating": "3.5/5",
    "review": "If you've got three very long hours to carve out, \"Once Upon a Time...in Hollywood\" is a fun wallow through Tarantino's alt-history of the Manson murders, together with a nostalgic look at 60s Tinsletown. Tarantino's most accessible flick, it's a must-see for history buffs and cinephiles, but watch it on video to pause for yawns and a ninth inning stretch."
  },
  {
    "rating": "5/5",
    "review": "3 hours of pure enjoyment."
  },
  {
    "rating": "4/5",
    "review": "Another Quentin classic."
  },
  {
    "rating": "0.5/5",
    "review": "Hated every moment. x"
  },
  {
    "rating": "5/5",
    "review": "The greatest bromance movie of all time"
  },
  {
    "rating": "5/5",
    "review": "I rewatch this movie frequently and the 3 hours zooms by. One of my all time favorites."
  },
  {
    "rating": "3.5/5",
    "review": "Fun movie, far from Tarantino's best."
  },
  {
    "rating": "4.5/5",
    "review": "awsome, great quentin tarantino film, i think brad bitt is amazing"
  },
  {
    "rating": "5/5",
    "review": "\"I am the devil, I'm here to do the devil's business\" Great fucking movie. It is a slow burn, but the character's shenanigans are great to watch."
  },
  {
    "rating": "4.5/5",
    "review": "One compelling scene after another"
  },
  {
    "rating": "1.5/5",
    "review": "I dont like it. Story was boring , nothing interesting. The ends fight scene was good but that's it I don't like anything else."
  },
  {
    "rating": "4/5",
    "review": "This Tarantino magic is truly unique; like nothing else in the film industry. It takes a deep journey into the lives of two men looking for their place of fame in Hollywood; all masterfully complimented with outstanding filming, talented acting, and a mind-blowing production set that deserves in full the awards it has received due to its time period accuracy. Being set in the late 1960s, there is no 21st century vibe throughout the whole film which fully impresses me. A lot goes on during the film and requires full attention and concentration. Multiple viewings is also advised. Quentin Tarantino applies a genius twist to a true story, thus resulting in this thrilling masterpiece."
  },
  {
    "rating": "5/5",
    "review": "one of the best movies of 2019 it was so satisfying"
  },
  {
    "rating": "3.5/5",
    "review": "A great chill film you can enjoy but is not one of tarantinos best and if you hold it up to his other films it is not as good and has its problems but is still a great film compared to most out there."
  },
  {
    "rating": "2.5/5",
    "review": "Not much happened really. Parts of the story I enjoyed but mediocre ending with no real takeaway or disclosure I assumed was coming."
  },
  {
    "rating": "4/5",
    "review": "Arguably Tarantino's most restrained picture may also be his most tedious, at least as far as wide audience appeal is concerned. Not only is this is a fairly slow paced movie, it is a film where one certainly feels its legnth. The majority of the film is split between Leo DiCaprio's pitiable Rick Dalton, a former movie and tv cowboy star, now washed up and looking for a second wind; and his best friend/stuntman/chauffeur Cliff Booth, played by the always charismatic Brad Pitt. Together they go about their day-to-day lives in 1969 Hollywood, and really thats about it. The film masterfully plays with audiences expectations, especially those familiar with certain tragic events set to take place one fateful night in August involving Rick's neighbor, Sharon Tate, endearingly played by Margot Robbie. In Tarantino's Hollywood there is an ever-looming threat one cannot escape from, and not just from the hippies. One never truly feels safe, as though the ball could drop at any given moment, and Tarantino knows that we have come to expect this. So instead he builds up tension for 2 hours before pulling the figurative trigger and delivering exactly what we want."
  },
  {
    "rating": "3.5/5",
    "review": "I enjoyed this. It was a Tarantino film filled with his typical dialog and characters. But, when it was over, I must admit that I felt no need to see it again. It was entertaining, but not compelling."
  },
  {
    "rating": "3/5",
    "review": "the good: great acting (Leonardo DiCaprio is excellent), great directing, and the whole feel of the film is very pleasant and fresh which is not a surprise from the director. the not so good: its very long and the underlying story feels weak, too weak for the length of the film. summary - it was kind of \"meh\"."
  },
  {
    "rating": "5/5",
    "review": "As was done in Inglourious Basterds, this film used the formula of taking a historical event and bringing in new characters that bring another direction to the story. DiCaprio and Brad Pitt brought very funny characters, who did actions that changed outcomes and the history of cinema and TV."
  },
  {
    "rating": "4.5/5",
    "review": "I really like what they did with this story. Worth watching."
  },
  {
    "rating": "1.5/5",
    "review": "This what would happen if a 13-year-old kid was given a lot of money and told to make a Tarantino movie. Not much story or characterization and a ridiculously over-the-top violent ending. QT's worst."
  },
  {
    "rating": "5/5",
    "review": "The Best movie in 2019."
  },
  {
    "rating": "3/5",
    "review": "Its entertaining but to provide an alternative ending to the Sharon Tate killings is in bad taste. Does the Director get away with this because her husband Polanski is a fugitive from justice and hate figure in the USA? Tarantino also has a dig at Bruce Lee also deceased and unable to react. Easy targets."
  },
  {
    "rating": "1/5",
    "review": "This is such a terrible movie. Perhaps it is about time we use our brains and freedom of speech to say what we all know by now: Tarantino is a tired and overrated product of its time, the result of the collision of a traditional egomaniac and his fetishes with the turn of the century's pop culture. His formulaic characters, repetitive storytelling, disconcerting misogyny and limited stylistic choices have no place in the cultural entertainment landscape moving forwards."
  },
  {
    "rating": "1/5",
    "review": "Acting was alright but a lot of pointless scenes which serve no purpose to the rather weak storyline. Not really sure what Tarantino was trying to achieve with this slow 161 minute drag."
  },
  {
    "rating": "5/5",
    "review": "Tarantino is at his best. He keeps getting better and better. An all-star cast. Beautifully shot, great soundtrack. Some people didn't like it because it wasn't as bloody or violent as most of Tarantino's movies, but it doesn't have to be."
  },
  {
    "rating": "2.5/5",
    "review": "Too overrated when it was released, I didn't like it at all"
  },
  {
    "rating": "4.5/5",
    "review": "A great look back into not such a distant past. Great actors, great camera work and lighting, very nice atmospheric directing"
  },
  {
    "rating": "4.5/5",
    "review": "Great movie. Typical Tarentino movie all over the place but it's fun and engaging. Need to watch it again to catch everything."
  },
  {
    "rating": "0.5/5",
    "review": "Most of the movie is pretty boring. With lead characters you really don't care about. The end is an absolute f-ing disgraceful insult to the real life Manson family murder victims."
  },
  {
    "rating": "4.5/5",
    "review": "A great concept of what could have been. Pitt is brilliant and the film keeps you interested and guessing. Margot is one of the only beautiful women who could have ever pulled off Sharon Tate."
  },
  {
    "rating": "4/5",
    "review": "This movie felt like a daydream. funny things happened. somehow relatable and especially to the time that it was referring to. and then the ending. classic Tarantino. Leo and Brad were awesome it was fun to see them together. a lot more lighthearted in the other Tarantino films. Great respect to a classic time frame of movies and an ode to a time period when we loved movies at their best!"
  },
  {
    "rating": "2/5",
    "review": "I didn't like it. I don't really like Tarantino's movies."
  },
  {
    "rating": "4.5/5",
    "review": "I am a Tarantino fan and I would rate this as one of his classics. The alternate reality thing worked for me and shows how a tiny detail differing can potentially change history. I think Brad Pitt stole this movie."
  },
  {
    "rating": "1/5",
    "review": "O.K., I get it Mr.Tarantino- you would win the 1960s Movies and Television Trivial Pursuit game every time... who else would know that Robert Conrad was famous for wearing tight pants? Like the director's other movies, this is a superficial exercise in mimicry; only noteworthy if it is examined for it's excess."
  },
  {
    "rating": "3.5/5",
    "review": "I don't mind an alternate reality historical fiction movie. Wonderfully put together. Well written. Acting performances from these professionals as expected. Fun if a little disturbing. Basically it's what I call the Forrest Gump genre with the Quentin twist. It was Quentin, right?"
  },
  {
    "rating": "5/5",
    "review": "Fun to look back at Hollywood during a different time."
  },
  {
    "rating": "2/5",
    "review": "I had great expectations of the movie, but it was unfortunately a bit of a boring watch and lacked any real decent plot."
  },
  {
    "rating": "5/5",
    "review": "Really beautiful film with wonderful actors and with a very high level of acting. The plot is very beautiful and however it is clearly divided into two parts: one a little obvious at the beginning and then going crazy at the end becoming very unexpected"
  },
  {
    "rating": "4.5/5",
    "review": "For those who did not like this movie that much...you really should take some time off watching movies in general and reevaluate your movie watching ability. Maybe you were just on your phone not paying attention! From start to finish, during its long running time, this movie does not disappoint at any regard or at any level. Brilliant performances by Pitt and DiCaprio and Robbie! Wonderfully directed by Tarantino! Cinematography top notch too and this movie just has that wow factor in interest level right to the grand ending! 9.5 out of 10!"
  },
  {
    "rating": "4.5/5",
    "review": "A great movie. Great performance from the actors. It's a little too long for my taste 😋"
  },
  {
    "rating": "2.5/5",
    "review": "A movie that feels so unnecessary, that lacks any of the inspiration and drive of earlier Tarantino films. Sure, it feels complete, but Once Upon a Time... leaves us asking a lot of questions about old school Hollywood and the Manson murders that really didn't need revisiting at this point, let alone with such a weirdly fetishistic lens and disdain towards women."
  },
  {
    "rating": "2.5/5",
    "review": "One of Quentin's worst. I felt like switching off numerous times. The ending is ok but mostly this felt laboured and pointless."
  },
  {
    "rating": "4/5",
    "review": "Interesting twist made over a true story. Nice casting. A classic Tarantino's plot."
  },
  {
    "rating": "5/5",
    "review": "Where do you start? Amazing cast, killer soundtrack, snappy dialogue, stunning cinematography all set against the backdrop that is LA in the late sixties. A cultural smorgasboard that snaps and pops its way across the big screen with stunning mise-en-scene in each frame. A MUST SEE on the BIG SCREEN!"
  },
  {
    "rating": "5/5",
    "review": "Wow, this movie blew me away. I loved every minute of it and Leo and Brad stole the show for me. I LOVE this movie!"
  },
  {
    "rating": "5/5",
    "review": "It all comes down to *that* last scene. The previous 2 and a half hour of filming is just Tarantino giving us one more piece of exceptional cinema. But these last shots are more powerful than any other thing Tarantino has created in his whole career: in cinema, she can live on."
  },
  {
    "rating": "5/5",
    "review": "Incredibly re-watchable. very funny, incredible action. Soundtrack sets the scene perfectly. Incredibly fun watch."
  },
  {
    "rating": "3.5/5",
    "review": "Leonardo DiCaprio is so good in this... and just the overall craft of the film.. it's such a neat idea. Such an interesting screenplay, too. 7.05/10"
  },
  {
    "rating": "5/5",
    "review": "Brad Pitt made the movie! Just watching his scenes and interactions with the Manson family made me love this movie!"
  },
  {
    "rating": "5/5",
    "review": "I loved it. I have compared it to the other longer comedy movies like Boogie Nights and Wolf of Wall Street and this is my favorite. Definitely top 3 movies of all time to me. It makes we want to live in the 60s in Hollywood."
  },
  {
    "rating": "2.5/5",
    "review": "Alot of fun. just wish it had more plot ....."
  },
  {
    "rating": "2/5",
    "review": "I had heard a lot of good things about this movie so I gave it a try, even though I'm not a Tarantino fan. I found the first hour and three quarters extremely slow moving. It was hard to engage with any of the characters because there was so little development. DiCaprio's character was such a sad sack that I didn't really want to watch most of his parts. It was just depressing. Pitt's character was more interesting and was at least fun to watch when there was something happening and it wasn't just a long scene of him driving in the car. I like Margot Robbie, but they didn't give her anything to do. Not much of a story here, especially not to justify a 2 hour and 40 minute run time. The ending was the only part that engaged my attention. I thought they would at least use original music of the period. I'm not sure why they used mostly bland covers. I view 1969 as the golden age. This did not evoke any nostalgic feelings. Tarantino's appeal is lost on me."
  },
  {
    "rating": "1.5/5",
    "review": "No story. No decent dialogues. That sums it up, Call me boomer. Something about... what is it?"
  },
  {
    "rating": "4/5",
    "review": "Brad Pitt takes the spotlight in this fictional story with real elements, events, and people from 1969 Hollywood. DiCaprio delivers not that much of a memorable performance, shining all the focus onto Pitt, although the acting remains rather mediocre at best. Nonetheless, as a stand-alone film, it does a great job recapturing the atmosphere and feeling of the 60s while tieing in factual elements to its plot. The twist ending is quite surprising to any familiar with the tragedy that had taken place, and it may cause some mixed emotions depending on how you feel about it. The story and plot are well-written and thought out thoroughly. The characters are decent. Tarantino has another great flick under his belt. -Fennett"
  },
  {
    "rating": "5/5",
    "review": "Best movie from Tarantino since PF. I actually prefer this over Pulp Fiction simply because the time , place and scenario it's set in. Also Margot Robbie is the hottest woman on planet Earth atm… those superficial points put the slightly inferior depth over PF"
  },
  {
    "rating": "4/5",
    "review": "A unique genre should be created for Tarantino's movies. This madman is a genius! This film has a very well put together script, remarkable editing and performances and a climax as only you can see in the Quentin Tarantino's filmography. The only thing that prevented me from seeing this movie was the length, but the last scenes are worth waiting for. It is a MUST SEE movie. PS: MCU, this is how you do a post-credits scene."
  },
  {
    "rating": "4.5/5",
    "review": "Funny, well done and generally very solid"
  },
  {
    "rating": "4/5",
    "review": "Another fun QT ride! Pitt is excellent in this movie."
  },
  {
    "rating": "4.5/5",
    "review": "A great movie about alternate history"
  },
  {
    "rating": "3.5/5",
    "review": "Not Tarantino's best, but not his worst."
  },
  {
    "rating": "4/5",
    "review": "I was amazed at how much I liked this. I was convinced that I couldn't enjoy a Tarantino movie because I didn't like nearly all of the ones I'd seen. Then I see this and was blown away."
  },
  {
    "rating": "5/5",
    "review": "An extremely fun journey with Tarantino's usual blend of dark humour, crazy characters and enjoyable action scenes."
  },
  {
    "rating": "3.5/5",
    "review": "Why go to all the trouble of recreating a famous event so closely and just changing the ending? Especially puzzling when the fictional ending isn't nearly as interesting as the real ending? Maybe Tarantino will do another movie about D-Day in which the Germans surrender on the eve of the invasion."
  },
  {
    "rating": "1.5/5",
    "review": "Just a long meandering waste of time with almost no storyline."
  },
  {
    "rating": "5/5",
    "review": "A little disturbing, a little sad and absolutely worth watching. Classic Tarantino thing as if he came back to the style of his best films (Jackie Brown, Reservoir Dogs). Film atmosphere is decent and it's stylised great. Actors performance is great. Absolutely enjoyed it!"
  },
  {
    "rating": "2/5",
    "review": "The story entangles itself on the edges with the Manson 'families' murders of Sharon Tate etal. It's one of Quentin Tarentino's least violent films (though there is some violence, it is isolated to where you'd expect it). I've always appreciates Tarentino's craft, and this is another good example of it."
  },
  {
    "rating": "5/5",
    "review": "Tarantino's magnus opus. Best movie from anywhere in quite some time."
  },
  {
    "rating": "4.5/5",
    "review": "One of Quentin Tarantino's lighter movies, the more character-driven Once Upon a Time in Hollywood has great dialogue, well-defined characters performed masterfully well be they real or fictitious, a memorably unsettling sequence at what is known as the Manson Ranch, amsuing sense of humour, wonderfully realised, immersive production values and one heck of an ending (if admittedly derivative of a past non-Western Tarantino period piece). It's not for everybody and the nearly-three-hour runtime will test the patience of viewers who aren't into Leonardo DiCaprio chatting with a precocious 8-year-old girl (well-written scene by the way) but, after the disappointment that was The Hateful Eight, what might be Quentin Tarantino's penultimate directorial effort proves, as far as people who still like his work are concerned, that the man's still got it."
  },
  {
    "rating": "4/5",
    "review": "Not Tarantino's best, but found it a thoroughly entertaining film."
  },
  {
    "rating": "4/5",
    "review": "Though advertised as an accurate biographical account of the Manson Murders in 1960s Hollywood, this film is actually more fictional, less about these murders and more a love letter to the actors of that time. The story is centred around director Roman Polanski and wife Sharon Tate's fictional neighbour, actor Rick Dalton and his stunt man Cliff Booth (based screen legends Steve McQueen and Burt Reynolds and the latter's stunt-double Hal Needham). The film explores how the two are struggling to adapt to the ever-changing Hollywood, paralleling with the growth of the Manson family who are interested with the Tate/Polanski household. Though a long film, it does quite well at showcasing the struggles of actors in Hollywood, the indulgence of the rich and the rise of a fanatic cult."
  },
  {
    "rating": "1/5",
    "review": "Sorted by efforts on screen in this disrespect for the victims of the Charles Manson murders in the 1960s: Brad Pitt, Leonardo Di Caprio, Dakota Fanning, Margot Robbie and in last place TARANTINO!!. 2/10"
  },
  {
    "rating": "3/5",
    "review": "With a title like Once Upon A Time... In Hollywood, knowing of Tarantino's great passion for cinema, my expectations were high. For its three hours of running time, what we got is a sleepy bedtime story glued together with a bunch of mediocre sketches of dead celebrities not saying or revealing anything compelling. If you're still awake, you will be treated to another of Tarantino's over the top signature finales. You know...The total destruction of the bad guys. Dog mauling, flame thrower and all."
  },
  {
    "rating": "4/5",
    "review": "It's a strange one, as sometimes it feels like it doesn't have a point, and yet it's still interesting. Probably my favorite Tarantino movie. I don't like his stranger stuff."
  },
  {
    "rating": "3.5/5",
    "review": "fantastic film do not get me wrong but compared to Tarantinos other works it feels weak. There are great scenes here and there but often times just not much is going on."
  },
  {
    "rating": "3.5/5",
    "review": "What could've been another masterpiece in Tarantino's line up ends up suffering from some of the worst pacing I've ever seen and a lack of engaging storytelling. Once Upon a Time in Hollywood has one banger cast and two lovable leads, Leonardo DiCaprio, Brad Pitt, Margot Robbie, they all give it their all and it's one of this movie's redeeming qualities that saves it from being completely abysmal. The setting of 60's Hollywood is quite clever and allows our stars to pull off some wacky scenes. However, quirky characters and excellent chemistry can only get you so far, as the pacing is truly god awful, the first 3 quarters of this movie are slow as molasses with barely any plot development, and then once we actually get to the final act, it switches into its highest gear and blazes through it at the speed of light. Still, the final act of the movie is the best as it finally feels like something important is happening with even more funny interactions. Once Upon a Time in Hollywood has everything in place to deliver an exciting look-back on old school Hollywood, but would improve tenfold with a bit of an overhaul such as a new cut that trims down this slog of a movie."
  },
  {
    "rating": "3/5",
    "review": "A fun character study movie, but the plot and the end in particular felt like wishful thinking. It strikes me as not the kind of movie a confident director would make, and Tarantino's own insecurities show through as a denial rather than a confession."
  },
  {
    "rating": "4.5/5",
    "review": "A darkly funny and entertaining picture, and surprising return to form for Tarantino. This is surely his best directed feature since Pulp Fiction. The performance from Leonardo DiCaprio is simply outstanding, particularly when he convincingly pulls off playing a man acting badly. The film is also directed with great class, with an excellent script that expertly blends real and fictitious history, with a great homage to the late Sharon Tate. Once Upon a Time in Hollywood manages to successfully recreate the Los Angeles landscape in a late 1960s setting, and do so in a way very pleasing to the eye."
  },
  {
    "rating": "2.5/5",
    "review": "There's self-indulgence and there's gluttony. With some films you feel that they're perhaps 10 minutes too long. Here, there's a whole hour that could have been cut without losing anything. After all, there isn't much to lose when the entire film is made up of sub plots. Pretty much the whole of Dicaprio's role is pointless. Pitt, though, has fun and holds the film together with a casual swagger that suggests that something may come of the film. It doesn't, but while he's on screen, you don't mind so much"
  },
  {
    "rating": "3/5",
    "review": "There was no plot really, It was just a very basic movie with a great cast of actors. 6/10"
  },
  {
    "rating": "4.5/5",
    "review": "Esta película para mi representa todas esas películas que con el paso del tiempo se han dejado de hacer. Para mi el mayor acierto de esta película esta en hacer varias escenas que parecen que no tienen nada que ver entre si para que al final todas las conclusiones de las mini historias de la película se unan para crear un espectacular final que desde hace tiempo no veía un final tan perfecto, desde acción hasta dialogo movimiento de cámara. Otra cosa memorable de esta película son las muchas escenas en las que aparecen Leonardo DiCaprio y Brad Pitt, que muchas por su increíble actuación se vuelven inolvidables, que la mayoría rayan en la perfección. para mi en lo único que falla la película es que en querer hacer una película que se centre en hacer una película de mini historias muchas veces se hace confuso y un poco aburrido. haciendo que sea una película que se disfrute mas viéndola una 2da vez, ya que sabes como va embonando cada historia para crear ese gran final. Para mi esta es una película con una historia solidad que se va perfeccionando en conforme avance. Muy recomendable."
  },
  {
    "rating": "1.5/5",
    "review": "The performances individually made this movie bearable. The plot was thinly stitched together and the violence felt (yes even for QT) gratuitous. It felt like he lost his touch and we literally spoke over the last hour wondering when would it finish."
  },
  {
    "rating": "4.5/5",
    "review": "Ah, the magic of Tarantino. When audiences received the first teaser trailer of this film, it was introduced with one word: hype. It is a legendary director with veteran actors but it lived up to the hype. (I also want to personally thank my dad for constantly putting on Kill Bill when I was little and even though I got annoyed by the film and didn't appreciate cinema at that age, he exposed me to one of the greatest in the industry). Powerhouse performances and an ode to classical Hollywood that contains Brad Pitt driving around iconic landmarks from Arclight Cinemas to Chili Johns. The last 20 minutes of the film pays tribute to the store that's classic Tarantino (if you know, you know) and ones the credits role, one cannot help but say, \"ah, the magic of Tarantino,\" once again."
  },
  {
    "rating": "3/5",
    "review": "Not by any means one of Tarantino's best, but still a pretty good film and very charming. I liked it a lot even though I feel the story was a little bit long and pointless. There's a bit of a bait and switch with the Manson murders that makes me wonder in retrospect why Margot Robbie's Sharon Tate got the screen time she did since she's not vital to the story in any way. I mean, it works in the sense that the switch at the end is genuinely surprising. The movie's about twenty minutes too long and I really started to feel it by the end. Also, while I genuinely liked watching it once, I'm not sure I'd enjoy watching it again."
  },
  {
    "rating": "2.5/5",
    "review": "Lacking the cleverness of Tarantino's best films, this movie is too long, badly in need of an objective editor."
  },
  {
    "rating": "1/5",
    "review": "another lame high cost/highly paid list of actors with a tedious story from Q T"
  },
  {
    "rating": "1/5",
    "review": "One of the films that never speaked to me. Don't get the high rankings, I found it boring as hell."
  },
  {
    "rating": "4.5/5",
    "review": "Tarantino did not disappoint with this instant classic."
  },
  {
    "rating": "3.5/5",
    "review": "I Think The Ultimate Kicker For This Is The Art Imitating Life Imitating Art Vibe Threading All The Way Through It. The Over-Blown Violent Outbursts Are A Usual Inclusion Calling Card For Tarantino. The Soundtrack Is Full To The Brim Too. It Is Not His Best Work, But The Actors Involved Are Definitely Not Let Down Here Either By Any Disappointing Script Or Storyline."
  },
  {
    "rating": "3/5",
    "review": "This is Tarantino doing his thing - for better or worse. which is mostly what i like; i just think the pacing was flawed where I had no idea where the story was going for most of it."
  },
  {
    "rating": "5/5",
    "review": "Once Upon a Time In Hollywood is strong in all aspects of film. Quentin brings heart to this one..."
  },
  {
    "rating": "5/5",
    "review": "Would definitely watch this movie you will not regret it"
  },
  {
    "rating": "2.5/5",
    "review": "It has a decent amount entertaining dialogue, and at times, entertaining story elements. However, the distance between the interesting and entertaining parts is vast. A nearly 3 hour film which takes far too long to really truly introduce the antagonists, and then what also feels too long before they begin... antagonizing, ultimately culminates in Tarantino's classic and excellent action for about 5 minutes to quickly wrap everything up. Overall, it just takes too much time to give you a sense of where it's going. You get the \"oh my god my career is on its way out\" storyline, which doesn't need to take 2.5 hours, only to end up not mattering at the end."
  },
  {
    "rating": "5/5",
    "review": "This was awesome... I really loved the cast and the story was written brilliantly ! And the ending was such a big surprise because you think you know what going to happen and then BAM !!!! surprise... this was just fucking amazing"
  },
  {
    "rating": "4/5",
    "review": "Quentin Tarantino's love letter to the golden age of cinema. Wonderful!"
  },
  {
    "rating": "2.5/5",
    "review": "It didnt work for me. Acting was fine (Leo and Brad were great), but the story and all is just meh. Also the over excessive violence didnt work for me this time like it did for example in Django."
  },
  {
    "rating": "5/5",
    "review": "Beautiful, soul mending meditation on life not reaching your expectations, and how that can be ok. Best overall Quentin Tarantino."
  },
  {
    "rating": "3.5/5",
    "review": "83/100 this one was.... different and really good"
  },
  {
    "rating": "3.5/5",
    "review": "In the grand scheme of Tarantino Movies, this one doesn't float my boat as well as the rest. Sure, there is a maturity to this film that shows growth, and there's no doubting that this is a movie that is probably more personal to QT than his other endeavours, but it's a difficult one to compare to the rest of his back catalogue. It's certainly not gritty like Resevoir Dogs, or as cult as Pulp Fiction. It's not as comedic as Jackie Brown. Overall, it doesn't enthrall like these movies. There are times when the film becomes too long in the tooth. Scenes showing the acting on set of Rick Dalton at times feel needless and add little to the storyline. It also feels TOO restrained at times and really only nods to QTs more gloriously over-dramatic style towards the last 20 minutes. What is done well though is Quentin's ability to lead your thought process one way and then turn it around - or drop the idea dead. There are times when you think \"yeah, this will lead to ...\" Only to have there be no lead there at all. Also done well is the usage of an all-star cast in bit parts without the appearances feeling like little Camo performances to bring a big name to a film. Again, truly a nod to the greatness of Tarantino in that he can bring in massive names for small parts and leave the audience fulfilled. You have to watch this if you like to watch movies by Quentin Tarantino, but equally if you're a fan of any of the lead stars too. And if you're not, it's still a good film to watch. But if you're looking for classic Tarantino with a lot of action and a storyline that makes you think hard - you're in for a bit of a shock."
  },
  {
    "rating": "5/5",
    "review": "Fun, enjoyable, and thrilling and satisfying ending"
  },
  {
    "rating": "5/5",
    "review": "It's just a fun movie. A film dedicated to a timeline that never was, and that revels in the violence against the lunatics who in reality caused so much cruelty. It's escapism at its finest, and the path toward the films incredible ending is littered with a hundred fantastic moments."
  },
  {
    "rating": "5/5",
    "review": "Quentin Tarantino delivers this fantastic nostalgic trip down memory lane with once upon a time in Hollywood. The writing in the dialogue as well as the soundtrack within the film teleport you to 1969 Hollywood. As a kid, I would go to California every summer and the scenery in the film brought back so many memories. The set design of downtown Hollywood is so impressive you feel like you are really there. Not to mention, the fantastically brutal fight scene in the climax of the film."
  },
  {
    "rating": "5/5",
    "review": "The film adopts a nostalgic profile that is VERY well constructed, with maximum excellence. The crisis of identity and the way cinema works is the maximum point of Tarantino's personal touch in the film and certainly the best part of it."
  },
  {
    "rating": "4/5",
    "review": "Very cool movie. Tarantino is definitely one of the best."
  },
  {
    "rating": "4/5",
    "review": "I Loved it... Very great... funny at times... however very emotional as this is a fairy tell Universe of 1960-70 Hollywood... I would rate it a 5 star but it had a bit of a pacing issue but when you stick with it, it is a real great!!!!"
  },
  {
    "rating": "5/5",
    "review": "The right attitude towards hippies"
  },
  {
    "rating": "5/5",
    "review": "Quentin Tarantino most pure nostalgia-hued Golden Age-Hollywood. Definitely Tarantino Love Letter to Hollywood. It has everything you want from Tarantino Amazing Soundtrack, Dialogue, Violence, etc. If you want to"
  },
  {
    "rating": "5/5",
    "review": "The movie QT has been building to his entire career, it's a brilliant, wildly thrilling, completely original, and deeply resonant piece of storytelling that only a great pop artist can create after their voice has evolved over the course of 25 years. It's the best movie of the past decade, one of the best of this century, so far, and a sterling reminder of just how great, resonant, inspiring and unforgettable movies can be when the corporations just get out of the way and let a gifted artist do his thing when he's truly in tune with and channeling the desires and impulses that fuel his creativity. The cast is also perfect. The character of Cliff Booth is one of the best creations of recent memory. It's also the best use of Brad Pitt in a movie ever."
  },
  {
    "rating": "5/5",
    "review": "Loved it. Brad Pitt alone but that finale scene…wow. I put off watching it initially too due to runtime. Honestly so worth it."
  },
  {
    "rating": "2.5/5",
    "review": "As of now, this is QT's weakest film. It is not cohesive enough nor does it tell a good enough story for most to become invested. The setting and costumes are highlights of the film."
  },
  {
    "rating": "4/5",
    "review": "While I have great respect for him, I can't watch all Tarantino movies due to the gore. So this was do-able, and I found the flame-thrower pool scene near the end particularly gratifying. This boy's got Southern roots, and it comes out in his pacing, his humor, and his economy of words. I'm good with all of that. So much of what he does isn't even all that good, it's just weird - with great soundtracks and kitsch and casts and budgets. And that's enough of a contrast to what we usually get, so I'm also good with that. It's a funny movie that I thoroughly enjoyed. I was also a bit horrified at how well, and frequently, DiCaprio hocks loogies, and the dexterity with which he handles cigarettes, lighters, and the way he can hold and spew smoke on command almost like it's a dialogue unto itself. It's literally physical comedy, loogies aside - that boy prob has a habit he doesn't need. But gracious, he's good at it. There's almost a juvenile aspect to most Tarantino movies, that when added to big boy resources, just works. I can enjoy some caricature. And I don't understand why everyone else is derivative but him….. I mean, I think everything at this point is largely derivative, I don't consider that a problem, just don't understand all the discrepancies in application. Maybe this is Tarantino for the masses, I dunno, but I thought it was delightful and got a lot of laughs and enjoyment from it. Think you just need to kinda know what you're getting. With proper expectations, this is funny as heck."
  },
  {
    "rating": "4/5",
    "review": "Bem complexo, uma filmagem bem interessante e complexa. Achei que é um estilo que vale a pena ver."
  },
  {
    "rating": "0.5/5",
    "review": "Never thought Tarantino was boring until now"
  },
  {
    "rating": "5/5",
    "review": "The ending makes this movie a must see and what a spectacular ride leading up to it."
  },
  {
    "rating": "0.5/5",
    "review": "Am I missing something? I feel like I want to sue for the 3 hours of my life i just wasted. It took me 2 days to watch and I really had to force my self to watch the last 30 minutes"
  },
  {
    "rating": "1/5",
    "review": "Boring. 2 hours of pointless, non-enthralling story line. 20 minutes some almost slap-stick action."
  },
  {
    "rating": "5/5",
    "review": "Some movies are so good they rate a re-watch, and if you're lucky, that re-watch reveals new layers & details you hadn't appreciated the first time around. So I find it with \"Once Upon a Time...\". First is the immaculately detailed and richly nostalgic look, sound, & feel of the late 60's; a decade that began with so much hope & promise, but which was starting to turn \"bad\" by 1969, even if a callow young college student like myself didn't recognize the shift happening at the time. Next is the level of thought & creativity Tarantino put into the story line of the fictitious Western TV series \"Bounty Law\", that prefaces the decline of Rick Dalton's Hollywood career. The movie puts enough \"hooks\" into this that I actually hope Tarantino does indulge his clearly well-thought out fantasy to make a real film or a pilot around \"Bounty Law\". I for one would watch it! Lastly, thanks Quentin for NOT running us through the real ending to the Sharon Tate story one more time. I wish you could have written the \"endings\" for the whole damn decade. We'd live in a much better world today if you could have!"
  },
  {
    "rating": "1/5",
    "review": "More Tarantino garbage. Inane script and mind-numbingly boring scenes designed to force his love of '60s soundtrack on the audience. Bruce Lee scenes were farcical and disrespectful. He's a poor man's Scorsese with a hard-on for gratuitous violence. Sometimes you wonder if he's actually got a screw loose or maybe he's just completely creatively bankrupt. A one-trick pony whose best days are long gone - shame he never matured as a director."
  },
  {
    "rating": "0.5/5",
    "review": "No scenes of tension. No question marks, no arc. Just filmed beautifully, without heart, soul or script. Humour not there. Ending was whacky.... Indulgent film making sucks"
  },
  {
    "rating": "2.5/5",
    "review": "More like a collage of sketches than an actual film. And I know, this isn't always bad but this time it's not that good."
  },
  {
    "rating": "1/5",
    "review": "A very pretty film that offers a pointless homage, impotent, insistent and finally nonsensical parody of the old Hollywood mythology. Nostalgia isn't what is used to be."
  },
  {
    "rating": "1.5/5",
    "review": "Straight garbage !! Saw it in the theatre first week it came out and then watched it again online a year or so later and my original review has not changed. Tarantino wanted to make some film that was a homage to a bygone era in Hollywood but he knew that would not sell so he included the Manson angle to suck people in. Didn't matter. The whole film was stupid and boring especially the middle hour. He disrespected a legend like Bruce Lee with a fictitious character and did his recent move which is to create some alternate history for an actual event. The Labiancas & Tate et al are still dead regardless of how talented & clever the director thinks he is."
  },
  {
    "rating": "4/5",
    "review": "It'd definitely one of Tarantinos weakest efforts because while there's a lot here not much of it actually has any meaningful input to the overall plot. For example pretty much the entirety of Margot Robbies characters story has absolutely nothing to do with the main plot and only serves to add to the runtime, you could pretty much remove her from the movie and you'd have a faster and more focused story but that's not to say she's bad in the movie because she's actually fantastic, it's just a shame she's completely wasted here though. Overall it is an enjoyable movie that's definitely worth watching."
  },
  {
    "rating": "2.5/5",
    "review": "Overrated as fuck. Spahn Ranch sequence rules though."
  },
  {
    "rating": "0.5/5",
    "review": "Just lost 3 hours of my life... what a complete, utter waste of time. How in the world this film is highly regarded is a mystery, The \"acting\" is good, the visuals are pretty, but there is zero plot, and not much interesting in terms of stand alone scenes except for a few minutes, Don't waste your time on this fake \"art film\"."
  },
  {
    "rating": "5/5",
    "review": "I honestly had no idea what to expect from this film. I just downloaded it at random. However, after watching, it perfectly describes the beauty of cinema. It's nostalgic because it's like a love letter from Hollywood's past. It also feels like a fairytale because Tarantino changed the ending to a happy ending. Without a doubt, Quentin Tarantino is an exceptional writer and director."
  },
  {
    "rating": "5/5",
    "review": "Outstanding movie. Yet another great Tarantino film. This one may not be as focused and tight as previous works, but it all comes together at the end. The final 30 mins might be his best work yet. Totally didn't see it going down like that. Would not be surprised to see him retire after this one."
  },
  {
    "rating": "5/5",
    "review": "Wow. Just wow. I just saw \"Once Upon a Time in Hollywood\" on Netflix. I was skeptical because I'm not a huge Quentin Tarantino fan. But it was eerily good. Easily the best film I saw over the last few years. I can't believe it didn't win best picture. Especially compared with \"Parasite,\" which I thought was mediocre at best. It should have won best picture, best director, and best screenplay. The only major award seems to have been Brad Pitt for best supporting actor. It's really an entrancing movie. And no spoilers, but the ending..."
  },
  {
    "rating": "3/5",
    "review": "Great characters, but story isn't appealing at all"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worse films I have ever seen. And that was the biggest insult to Bruce Lee ever."
  },
  {
    "rating": "5/5",
    "review": "The best Tarantino yet and hopefully not the last."
  },
  {
    "rating": "3.5/5",
    "review": "The chemistry between Pitt and DiCaprio is really nice, and Pitt's character is particularly compelling without necessarily being redeemable. The politics of the movie feel troubling ... particularly, advancing the narrative in which the Manson family stands in for hippiedom, and there is some kind of a culture war between hippies and, well, old-school Hollywood cowboy white guys who stand in for the norm. Having forgotten about the history, I found the class stuff at the end more remarkable than Tate. (Pitt goes to the hospital; DiCaprio goes to a party.) The movie gave me more I wanted to keep thinking about than I realized at the time."
  },
  {
    "rating": "5/5",
    "review": "Tarantino's inversion of the historical account offers a glimpse into the fairy tale universe where the \"real\" Hollywood tough guys get to make the leap into \"new Hollywood\". Sharon Tate's Kung fu is a sham but here in this dream world, the rough men intercept the psycho cultists and put the world right with nothing but a can of dog food and a flamethrower. A sweet dream of the spirit transformed from the \"real\" Hollywood circa 1969, described by Joan Didion in her famous book The White Album, a world of darkness, of bands \"too cool\" like the Doors, a world where no one was surprised when Manson crashed the party with his massacre, this world of \"new Hollywood\" gets a makeover. Manson is described as the flipside of charismatic cult leader, a loser who shows up at the Polanski residence looking for Terry Melcher (a fact according to at least one witness) but this is all you get from this cosmic nobody. This fairy tale rings true and I think it's Tarantino's best picture, better than Pulp Fiction by a mile, a love letter to a world that never was."
  },
  {
    "rating": "1/5",
    "review": "The movie has No story .Characters are introduced for no reason. what was the reason for having margot robbie or the hippie plot ?. The whole movie is dumb and pointless."
  },
  {
    "rating": "5/5",
    "review": "Refreshing.... that is the word that I use the describe this film... especially compared to most of the marketing driven trash that Hollywood has been putting out lately. I would have done without the violence at the end (I had to turn my head away) or would have found a way to make it less graphic but nonetheless.... I still loved it."
  },
  {
    "rating": "1.5/5",
    "review": "Watched the first half and had to turn it off, nothing was happening. Disappointing considering the director, and main leads in this film."
  },
  {
    "rating": "3.5/5",
    "review": "Pretty cool movie but a bit long as usual for Tarantino. Brad and Leo are great in this."
  },
  {
    "rating": "0.5/5",
    "review": "The most boring movie i have ever watched. Oh my god!"
  },
  {
    "rating": "5/5",
    "review": "When I googled latest top 10 movies in 2019 it came up with information on https://swingmeup.com and I step forward to know about more this movie and after researching on IMDB it has a lot of review from the people, who have seen this movie, and I decided to go with this flow and I saw it was really fantastic movie you should watch at least one."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is 3 hours long for no reason. It's all over the place and none of the story lines really make sense. There is no climax, no building, the movie is very one note for the first 175 minutes. Then the end is a killing scene. Overall a waste of film."
  },
  {
    "rating": "4.5/5",
    "review": "Um filme genial do génio Quentin Tarantino mas que não é perfeito tendo os seus minimos defeitos como , por exemplo, no personagem do Bruce Lee deste filme que é bem qualquer coisa, mas em contraposto temos a química absurda entre os personagens do Leonardo DiCaprio e do Brad Pitt"
  },
  {
    "rating": "0.5/5",
    "review": "So bad, it was a complete waste of time"
  },
  {
    "rating": "0.5/5",
    "review": "The movie SUCKED! Total waste of time. Nothing happens until the last 5 minutes. No plot or point to this crapfest."
  },
  {
    "rating": "5/5",
    "review": "So GD sweetly nuanced. Certainly the greatest film about a place called \"the 60's\""
  },
  {
    "rating": "4.5/5",
    "review": "Once Upon A Time...In Hollywood - 9/10. It's definitely not for a film for everyone. The film takes its time in terms of moulding the story and tempo, but it delivers a cool nostalgic trip to the year 1969. Quentin Tarantino has crafted a film with much detail and superb performances! Leo and Brad deliver some solid and hilarious performances, with a shining Margot Robbie giving a subtle and bright performance as Sharon Tate. The rest of the ensemble cast deliver some great performances in their limited screen time, with Austin Butler and Margaret Qualley delivering standout performances within the ensemble cast. And, surprisingly, the film is probably his least violent film. I consider it as one of his best works, and definitely his most funniest film. A definite must watch!"
  },
  {
    "rating": "5/5",
    "review": "A fantastic period piece from Tarantino. Toned down shock and quirkiness making for a more enjoyable overall experience. Memorable performances from Pacino and Pitt - probably my all-time favorite by Pitt. Tarantino has found yet another film to blend the western theme with a contemporary subject. And yes, Nazis get fragged in this film as well."
  },
  {
    "rating": "4/5",
    "review": "A Tarantino-esq. look at the Manson murder of Sharon Tate. Also a look at the changing dynamic in entertainment and American culture from the traditional norms of the 50's-60's into the hippie era of the 70's. There are a lot of layers here. The dialogue is always crisp. The acting is superb. DiCaprio and Pitt are great in the dynamics of their relationships. Margot Robbie is unappreciated in her mesmerizing performance as Sharon Tate. The entire supporting case from Margaret Qualley, Bruce Dern, Al Pacino, and the rest are phenomenal. Mike Moh is funny and exciting as \"Bruce Lee\". Forget all the controversy from people that can accept an altered version of history that has Hitler burned alive but can't accept an over the top Bruce Lee- this was memorable. The movie soundtrack is worth the whole thing even if you aren't a fan of the actual film. You do not need to know the real version of events to watch this but you will smile if you do."
  },
  {
    "rating": "2/5",
    "review": "Once Upon Upon a Time In Hollywood – Even The Name is another ‘Borrowing' QT's latest indulgence is all about his one-way fixation with the ‘60s. At 160+ mins it's a long trudge but the script probably only had few pages if compared with other movies of this length, why?... So many scenes are made up of shots of bods getting into cars, then long internal shot from back seat (lifted from the far better Gun Crazy' 50s) then bods get out of car, long shots of feet walking, more bods get into cars, more long internal driving shot, bods again get out of car, more feet walking. This format is repeated from beginning to end –pages of same-- The 60s heralded in a new low for movie making – features like; ‘Beach Blanket Bingo', ‘How to Stuff a Wild Bikini ', ‘Sergeant Deadhead' were playing as main features across the land, el-cheapo's had become the new norm. What would usually have been a ‘B' picture were now being sold as an ‘A'. Yes. it may have helped a jaded Hollywood at that time but what about other mainstream audiences? So, what might have influenced TQs fixation with this downturn in the social morays of movies? Tarantino grew up in the swinging ‘60s/mod ‘70s working in a porn cinema (this perhaps explains his addiction to perversity) including a video store - while also watching the endless re-runs of TV shows, along with an overflowing barrage of low budget, Spaghetti westerns that had flooded the market - thank goodness some audiences grew up (well, some did) and demanded better. These endless ‘homage's to days offering little more than cheap TV-style quickies -- now being released to the big screen --- with product that was generally catering for a guideless, acid tripping youth (such as the Manson crew, etc) wanting endless simple-minded partying. Hollywood producers loved it – now, for half the normal budgets, they were getting the same financial returns as quality features. QT has simply revived those days and a new ‘comic book hero' generation have picked it up. Only this time round, the budgets are BIGGER while the contents remain juvenile, if not ridiculous. Trouble is, too many of today's producers and art critics also grew up in this overly comfortable, ‘anything goes' era, so they wrap on about the glorious emptiness that's making them all rich. Some rave about the cinematography and design - with that much money being thrown about it's simple to ‘copy' the work of previous Masters. But, no matter how expensively dressed-up and stylishly packaged rubbish maybe, it's still rubbish (but, GOOD-LOOKING rubbish). Too much you might be saying? Take a look back, revisit many of those poorly scripted, badly acted, TV shows and movies of the 50s-60s – the ones Q.T. tends to dote over...you may be surprised how your memory may have failed you as just how poor most were. Once U.A.T.I.H. looks like several proposed projects that never got off the ground all edited into one, and doesn't do justice to any of them. One or two characters and situations looked as if they may have been leading to something but simply fizzled out. How long might it take before more look back and ask, how were we so fooled? Or is it just that LESS has now become the new MORE? So, if this is Q.Ts 9th may there be only one left to go. Please."
  },
  {
    "rating": "5/5",
    "review": "An amazing movie experience, specially because Tarantino takes his time. Although Margot screentime got all the attention, you have to highlight DeCaprio's performance, which is AMAZING. But Pitt is not far behind. Great, great movie."
  },
  {
    "rating": "5/5",
    "review": "It was the best film of 2019 by far!"
  },
  {
    "rating": "4.5/5",
    "review": "A look into the childhood of Tarantino and the 60's with amazing soundtrack, dialogue and outstanding acting by Leonardo Dicaprio and Brad Pitt."
  },
  {
    "rating": "3/5",
    "review": "I agree that the movie provides a raw truth about Hollywood and that there are some quite clever and funny moments. But I believe that there was no reason to take 3 hours from my time for this result."
  },
  {
    "rating": "4.5/5",
    "review": "what if you were my stunt double and we did everything together for 9 years and were slightly in love with each other all along and we're both boys... anyway. i am delighted by and in love with this movie"
  },
  {
    "rating": "5/5",
    "review": "As someone who has liked, disliked and loved some of Tarantino's previous work, and someone who's an avid consumer of quality cinema, I went in with some hype, some skepticism and mixed expectations. I had a slight idea what the movie was about, but I never bothered to dig deep into it before actually watching it. And since I believe I could've enjoyed it much more had I looked up the whole story prior, I highly recommend you do. It won't spoil the fun for you, it'll add up to it. So I sat there, doing my best to just enjoy the movie instead of being too critical of it and looking too far into the scenes than I probably should, which certainly made for a better, more relaxed experience. The movie is long, and it being somewhat slow paced and patience demanding (which we're not always used to from Tarantino) could make it feel even longer, but if you're into that like I am, you know that's where the fun is at. I smiled effortlessly at most of the scenes (because they were just THAT good) and even laughed with some of them, but one thing is sure, in classic Tarantino fashion, the writing and dialogue were absolutely ON POINT. The casting could not have been better, each actor portrayed their character to mere perfection and they felt more like actual people than in any other movie I've seen. Then comes the storyline, And I can't help but be a little biased here, seeing as my favorite movies are those that do nothing more than just tell you a story, the ones that make no effort to keep your attention. There's some events going on that you just have to follow, even if they feel like they're not leading to any peak or climax. This movie is a PRIME example of that. Perfect for people who like to get invested in a film rather than have it reward or gratify them. And then it ended, leaving me, and everyone there I'm sure, STUNNED by what we had just seen, by how brilliant it all was and wishing we could watch the whole thing over again, there and then. It was a truly surreal experience."
  },
  {
    "rating": "4/5",
    "review": "It's nostalgic and the fights are composed very well. I heard about the California hippie culture back in the day but this movie gives the experience of how bad it was."
  },
  {
    "rating": "1.5/5",
    "review": "It doesn't work as breezy or mindless fun because of how bored I was, and it doesn't work as a compelling narrative or character study because it's clearly not trying to be. https://letterboxd.com/josephtomastik/film/once-upon-a-time-in-hollywood/"
  },
  {
    "rating": "3.5/5",
    "review": "You don't hit \"play\" on a Tarantino picture with conventional expectations. I was perhaps surprised at how considered and thoughtful the script is, pacing slowly (but consistently) through a blend of real people and absolute fiction smoothly. It felt like it was building towards making a big point, but instead descends into hugely rewarding carnage - which isn't a criticism. In fact, the payoff for your patience and calmness is for jarringly brilliant (and potentially gratuitous) violence. If this is Quentin's last film, he's going out on a high."
  },
  {
    "rating": "4/5",
    "review": "Tarantino did a good bait-and-switch on me with this one, although the movie title should've tipped me off. I watched this knowing next to nothing about it, and I know only the bare minimum about the real-world events, but when Sharon Tate and Polanski showed up, I felt pretty sure about the direction this was going (which is exactly what Tarantino wanted I guess). When *that* night approached, with the the time-and-date overlays, I was convinced this was a story based on true events with a few fictional characters thrown in the mix. Needless to say, I was oh-so-wrong. After the slow and deliberate build-up, in the last chapter of the movie you get treated to a very abrupt and jarring transition into Tarantino territory. And then when the credits roll, the next surprise to me was that the movie almost has a feel-good happy end. Performances are top-notch, and without knowing much about the setting, the meticulous attention to detail is obvious. I enjoyed this plunge into the late sixties immensely, and the cathartic burst of violence at the end was the cherry on top."
  },
  {
    "rating": "1.5/5",
    "review": "I'm a huge fan of Tarantino's, but this was a complete bore to me. Indulgent and a love letter to himself and Hollywood. Conciseness would've helped as the film was, in my opinion, about 45 minutes to an hour too lengthy. Also, there were a few scenes, particularly with the young actress Julia Butter's character, which were cringe worthy for their over sexualization. Hard pass for me here."
  },
  {
    "rating": "3.5/5",
    "review": "its alright, give it a watch but don't expect it to be a mind blowingly good movie like some people say"
  },
  {
    "rating": "4.5/5",
    "review": "The most mature and grounded film of Tarantino's incredible career. His supposedly penultimate film is also one of his best as a director. Outrageously funny and self-aware, he delivers everything you expect off him just differently. All the lead actors, Pitt in particular, nail their roles."
  },
  {
    "rating": "2.5/5",
    "review": "I don't really know where the movie wanted to go, there is lots of useless material in it, it isn't even exiting until the third act. A disappointment came from Tarantino. the fact that it was nominated for best original screenplay alongside the masterpiece Knives Out, is insulting. The movie is fine, nice camerawork, directing and acting, but it does not have a point to go."
  },
  {
    "rating": "4.5/5",
    "review": "Some characters fall flat and it can be a bit weakly paced at times, but as usual Tarantinoism- there is a very unconventionally told narrative filled with sick moments, beautifully shot scenes, immaculate screenplay and two outstanding performances from its two famed leads. It's also visually sharp and quite funny."
  },
  {
    "rating": "2/5",
    "review": "It is a super slow pace and boring movie. Leonardo DiCaprio's acting is fantastic, but unfortunately the worst Tarantino Movie so far. To be honest, the best part of the movie was the last 10 minutes of the climax."
  },
  {
    "rating": "5/5",
    "review": "A timeless, must see film."
  },
  {
    "rating": "4.5/5",
    "review": "One Upon a Time... In Hollywood is a funny and thrilling film, with a perfect ending, that exhales DiCaprio and Pitt's charisma - fitting all that's necessary to be a good Tarantino movie."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Great actor. This movies transport you in Hollywood in that era with crazy story, plot, dialogue. Bravo"
  },
  {
    "rating": "4/5",
    "review": "Ritorna la scrittura graffiante di Tarantino in un film molto più pacato del solito. Questa volta il regista manifesta il suo sconfinato talento in un contesto molto più descrittivo, nel quale prende il controllo di una ricostruzione storica maniacale e dettata da scenografie incredibili. Tarantino aveva già cambiato il corso della storia a suo piacimento, e questa volta lo rifà con un tocco molto più personale del solito, con una velata motivazione lasciata a piccole dosi in alcune scene specifiche lungo tutta la durata del film. Questo fa si che nel finale si sprigioni un delirio assoluto che va a completare con innovazione e sorpresa un quadro generale aperto fin dall'inizio dell'esperienza. Palese punto di forza del film è una totale sicurezza nell'approccio al film. Tarantino è totalmente a suo agio in un'opera che lo vede in pieno controllo del suo lavoro, a partire dall'immagine complessiva fino ad arrivare al minimo dettaglio. Non si può neanche dire che sia uno dei suoi film migliori, perché ormai ogni suo film è \"uno dei suoi film migliori\". Quello che è certo è che va a completare a pieni titoli una filmografia assolutamente leggendaria."
  },
  {
    "rating": "5/5",
    "review": "Sony Pictures, Columbia Pictures, and Quentin Tarantino's Once Upon a Time... In Hollywood is a very amazing film!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Great movie with the kind of ending you expect from Tarantino."
  },
  {
    "rating": "4.5/5",
    "review": "Only Tarantino could have made this good. Nothing really happens until the final half hour in a 160 minute picture, but do we care? This man could write the daily routine of an undertake and create a superb feature film. The dialogue is up there with some of the best that I have ever experienced. The visuals are amazing. It's clear that Tarantino put his all into this project, and it completely shows. Career-defining stuff from Pitt and DiCaprio, who sizzle together and excel apart. Robbie doesn't have much to do of interest in comparison and her moments in the spotlight are certainly a change of pace, but still emanate the same amount of fun. The rest of the cast also shines at so many various point that they escape description. The film would have been good with these baseline ingredients, but the ending is one of my favourites from any of Tarantino's. The glorious climax of brilliant humour and over-the-top violence will remain one of the greatest cinematic moments of the 21st century, and all of the film's self-indulgences pay off."
  }
]