{
  "movie_name": "Transformers: Dark of the Moon",
  "reviews": [
    {
      "rating": "5/5",
      "review": "Cinema absoluto esse filme não sei porque as pessoas vivem reclamando dos filmes do Michael bay -_-"
    },
    {
      "rating": "5/5",
      "review": "Beautiful ending and cgi. Anything a boy could ask for"
    },
    {
      "rating": "2/5",
      "review": "When you think they can’t get any worse."
    },
    {
      "rating": "3/5",
      "review": "It's not the best movie but it has some good and some bad"
    },
    {
      "rating": "5/5",
      "review": "Probably Michal Bays best film."
    },
    {
      "rating": "5/5",
      "review": "O my frick dude, perfection 9.9/10 Joshy Boy 6,000's sigma movie award:🗿 Joshy Boy 6,000's perfection award: ✨️"
    },
    {
      "rating": "3.5/5",
      "review": "Optimus casually committing war crimes on cybertronians"
    },
    {
      "rating": "3.5/5",
      "review": "great cgi hevy action that can sometimes wroin the plot but the word is sometimes decent plot over all and the third best transformers movie but they did shokwave wrong"
    },
    {
      "rating": "4.5/5",
      "review": "People over hate on this movie. It is the best of the series. Optimus was one of the best fictional leaders ever in this movie."
    },
    {
      "rating": "5/5",
      "review": "The second best Tranaformers movie it’s amazing!"
    },
    {
      "rating": "5/5",
      "review": "These mfs are wrong. This is the best Bayverse movie by far."
    },
    {
      "rating": "1.5/5",
      "review": "Shockwave yay! Oh, its garbage."
    },
    {
      "rating": "5/5",
      "review": "My favorite transformers movie. I know from a critics eye it is not good but for me it is awsome!"
    },
    {
      "rating": "2/5",
      "review": "'Transformers: Dark of the Moon' is an absolute drag. The ending felt like it took hours to complete, then to make it worse (what am I chatting, more like better) it just ends on a dime without any true reaction to the mass brawl that had ensued. Bit abrupt, I thought. A lot of what I can say about this could be taken from my review of the preceding 'Transformers: Revenge of the Fallen', just a little bit more definitive and debilitating. I'm all for full action only, I literally love 'Fast & Furious', but even I need some characters to connect with so I can forge a desire to watch 'em - no-one here gives me that. The cast, if only on paper, is more interesting to look at, mind you. I wasn't expecting to see John Malkovich and Frances McDormand appear, the former's part fits fairly well in fairness but the latter is incredibly wasted with a rubbish character. Tyrese Gibson (eventually) features more, something I did actually wish for in the 2009 predecessor. Rosie Huntington-Whiteley has a slightly better character to portray, at least when compared to what Megan Fox had to work with. Elsewhere, Ken Jeong is genuinely good in this - in fact, I'd say he is responsible for any pleasant reactions that I got during this movie, funny guy. I just caught a glimpse of the box office takings... $1.124 billion?! Bloody hell. I'm now curious to see if that translated into a positive reception from websites like this. (edit: not really, but it evidently won over the average moviegoer though, so fair enough). If only you could see my face when I realised that the next installment goes on for even closer to three (!) hours. I best load up on the snacks! Hey, who knows, maybe 'Transformers: Age of Extinction' is the 'Fast Five' of this franchise? nervous chuckle"
    },
    {
      "rating": "4.5/5",
      "review": "My favorite transformers movie, the dreads chase scene was great"
    },
    {
      "rating": "4/5",
      "review": "The third, and should have been the last, Transformers film in the Bayverse, is surprisingly very good. It was dangerous, fun, didn’t take itself too seriously, and delved into what a full-scale war between Autobots and Decepticons would look like on Earth. With stakes that have never been higher, a so-so plot, some REALLY good music and visuals, this movie really did feel like a perfect finale for Sam Witwicky and his Autobots. This movie does have its problems, of course, and it has inconsistencies that really is very convenient for the plot to go as it did. But it still remains a guilty pleasure in my heart."
    },
    {
      "rating": "5/5",
      "review": "My favorite Transformers movie"
    },
    {
      "rating": "3/5",
      "review": "Dark of the moon’s first act is unbelievably AWFUL that I thought this film was going to be the worst of the series,Then the second act rolls around and it becomes a little better with a mystery element to it that is so incredibly boring though their are some fun action scenes,And then we get to the third act and im completely invested now,The transformer movies are only really good when it comes to action (no way who would’ve guessed) and if this movie didn’t have one of the most fun,insane,awesome,incredible,belongs in a art museum. Final battle of all time then this would honestly be my least favorite transformer movie (and we’re not even close to being done)"
    },
    {
      "rating": "5/5",
      "review": "The best looking movie of alle time a must see if jou like action pack movies"
    },
    {
      "rating": "3.5/5",
      "review": "It was really good I liked shockwave and that thing that followed him but I hated the new girl friend of Sam but it was really good besides that."
    },
    {
      "rating": "3/5",
      "review": "Only a bit better then the 2nd movie"
    },
    {
      "rating": "1.5/5",
      "review": "The worst of the 3, I can't even watch this in one sitting it's so bad. So many people on here have horrible taste, don't know good writing or are paid for their reviews, because anything over 3 stars makes no sense for this junk."
    },
    {
      "rating": "3/5",
      "review": "A better transformers movie. This one has the best action, a better story and it's not overplotted. But the acting from Rosie Huntington - Whiteley is beyond terrible."
    },
    {
      "rating": "4.5/5",
      "review": "A great way to end this trilogy. Though it has a new girl for sam she fills in nicely. A long movie but very entertaining. Tim Treakle"
    },
    {
      "rating": "3.5/5",
      "review": "Transformers Dark of the Moon is epic.The final battle is intense.The CGI looks very good as always.Sentinel Prime was a really good villian.The action works pretty well and is very well done.Shia LaBeouf does a really good job as Sam.And the movie is generally very entertaining.My only problem is Rosie Huntington Whiteley's character who is just there to look pretty and has so much screen time for not doing anything story relevant in the movie that she just gets annoying at some point.Dark of the Moon is Worth a watch.i think the first Transformers is slightly better but Dark of the Moon is also very good."
    },
    {
      "rating": "2.5/5",
      "review": "It has far too many action scenes which you can't make out, and a unnecessary use of certain elements that just prolong the movie."
    },
    {
      "rating": "5/5",
      "review": "Direção: Bom Atuação: Bom Roteiro: Bom Caracterização: Bom Soundtrack: Bom"
    },
    {
      "rating": "4/5",
      "review": "An underrated movie. The last 90 minutes are fantastic. 8.1/10"
    },
    {
      "rating": "4/5",
      "review": "The best movie of the franchise"
    },
    {
      "rating": "3/5",
      "review": "Very similar formula to the second movie... and equally long-winded. However, there are some better performances and the story seems to support the action more than its predecessor"
    },
    {
      "rating": "4/5",
      "review": "This is an action movie I love"
    },
    {
      "rating": "3.5/5",
      "review": "Es de mi favoritas ,es mucho mejor que revange of the fallen ! Aunque ni en bromas es perfecta tiene una premisa muy buena"
    },
    {
      "rating": "3.5/5",
      "review": "While Transformers: Dark of the Moon may underwhelm in terms of pace and certain characters and moments, it definitely delivers with its lengthy and incredibly entertaining action sequences, making it a very worthy addition to the franchise. Rating: 66% 🍅"
    },
    {
      "rating": "3.5/5",
      "review": "Transformers: Dark of the Moon represents a standout moment in the franchise, combining explosive action, striking visual effects, and a deeper thematic exploration of loyalty, betrayal, and duty. Peter Cullen’s portrayal of Optimus Prime carries a weight of leadership and conviction, while Leonard Nimoy’s Sentinel Prime masterfully conveys the tragic complexity of betrayal, making their dynamic one of the most emotionally charged in the series. Hugo Weaving’s Megatron, though sidelined, still delivers a brooding, dangerous presence. Shia LaBeouf gives a solid performance as Sam, wrestling with the need to prove himself amidst chaos, and John Turturro’s Agent Simmons remains a scene-stealer, blending eccentric humor with heroic sincerity. Josh Duhamel and Tyrese Gibson further anchor the film’s human side with their portrayal of loyal soldiers, while John Malkovich as Bruce Brazos offers delightfully oddball humor, and Frances McDormand’s Director Mearing brings stern authority, grounding the film with gravitas. Despite strong performances from the cast, Rosie Huntington-Whiteley’s Carly feels shallow, serving little purpose beyond being a love interest for Sam, which detracts from the film’s emotional weight. The Autobots and Decepticons, especially Bumblebee, Wheelie, Ratchet, Ironhide, Starscream, Barricade, and Soundwave, are not only epic and cool but also inject humor into their roles, balancing fun and intensity. Visually, the film is stunning, with a seamless blend of CGI and real-world locations that still impresses today. The violence in this movie pushes the boundaries of what PG-13 can be, with moments that shockingly show robots bleeding real blood, adding to the film's intensity. The epic score enhances the emotional stakes, amplifying the film's dark and depressing tone as it explores themes of sacrifice and the heavy burdens of war. Some of Optimus Prime’s statements are strikingly intense, making the reality of these robots committing genocide and war crimes even more compelling. This makes Dark of the Moon the Bayverse’s most ambitious and satisfying installment; if only the series had ended here."
    },
    {
      "rating": "1/5",
      "review": "This movie is completely rotten."
    },
    {
      "rating": "3.5/5",
      "review": "A Major step up from the previous movie with a story that feels tighter, and better paced. Much more defined Action, and memorable Robot and Military Warfare. Can't say the character arcs are there, but if you are looking for a solid Transformer movie with over the top action, and robot action, I believe this is worth a watch. C+"
    },
    {
      "rating": "2/5",
      "review": "Transformers Dark of the Moon is leagues better than the last one. But it’s the most masochistic transformers movie and still mindnumpingly loud"
    },
    {
      "rating": "4/5",
      "review": "Movie has its issues but it is definetly the best of the trilogy and had a good plot twist that made fans shocked."
    },
    {
      "rating": "4/5",
      "review": "This is too date my favorite transformers movie by far because it is visually gorgeous though sometimes is doesn't make sense which stops it from being a 5 star"
    },
    {
      "rating": "5/5",
      "review": "Transformers: Dark of the Moon is an explosive triumph that takes the franchise to new heights with its breathtaking action and stunning visual effects. Michael Bay crafts a cinematic spectacle where every scene is charged with intensity, especially the climactic battle in Chicago, which is nothing short of epic. The film’s mix of thrilling action and emotional stakes makes it one of the strongest entries in the series. While some might find it overwhelming, Dark of the Moon is exactly what a Transformers movie should be—bold, thrilling, and visually jaw-dropping. It’s a blockbuster that truly delivers on all fronts!"
    },
    {
      "rating": "5/5",
      "review": "It's awesome the action the robots and humans characters are enjoyable to watch"
    },
    {
      "rating": "3/5",
      "review": "Sad Megan Fox not in here but I’m glad you still had half of the cast…So many emotional scene the bond Sam and Bumblebee have I love so much"
    },
    {
      "rating": "5/5",
      "review": "The Most Battle Scene in City Is Actually Great!"
    },
    {
      "rating": "5/5",
      "review": "Overrated, Very impressive CGI action violence and Definitely 10 times better than today's Modern CGI, better than Avatar (Personally)"
    },
    {
      "rating": "4.5/5",
      "review": "This is probably the best of the live-action TF movies, it's action-packed with a very good plot twist. This movie does suffer the same problem all TF movies suffer and that is it focuses way too much on humans. And also, when Optimus gets tangled in the wires is very annoying."
    },
    {
      "rating": "4/5",
      "review": "This movie is heavily underrated. Yes, there are typical Michael Bay tropes that make any normal person uncomfortable, but for every 1/10 moment, there are 15 10/10 moments around the corner. So cool to see characters like Shockwave and Sentinel Prime have a huge role in this movie, and while the ending may leave a bad taste in the mouths of many, it doesn't ruin the rest of the movie, for me at least. Go watch it or yourself. I'm going to buy a Shockwave action figure"
    },
    {
      "rating": "4.5/5",
      "review": "This one takes place in Chicago 9/10"
    },
    {
      "rating": "1.5/5",
      "review": "More of the same.... A Michael Bay film, that says it all you can expect"
    },
    {
      "rating": "3/5",
      "review": "No es la más bueno que e visto todas las anteriores pero está entretenida"
    },
    {
      "rating": "2.5/5",
      "review": "It's fine, 2nd worst film. 5.4/10."
    },
    {
      "rating": "5/5",
      "review": "This is one of the best movies ever made."
    },
    {
      "rating": "5/5",
      "review": "Excelente secuela mucho mejor que la segunda Michael Bay hizo lo mejor en la tercera entrega de transformers y también debo decir que Transformers dark of the moon es mi película favorita de la franquicia."
    },
    {
      "rating": "5/5",
      "review": "Excelente pelicula. Para los amantes del cine de accion es lo mejor."
    },
    {
      "rating": "5/5",
      "review": "The Movie Over 1.124 Billion Dollars"
    },
    {
      "rating": "0.5/5",
      "review": "As I much as I thought Revenge of the Fallen was bad and despite its visual effects, Dark of the Moon did the unthinkable which is that it did even worse with characters that lacked any depth and chemistry and a story that was even more dull and convoluted within its bloated runtime."
    },
    {
      "rating": "4/5",
      "review": "Transformers: Dark Of The Moon is an epic in evert sense of the word. It is easily the darkest and most violent of the Trilogy, but it feels very in-place and not unnecessary. The action and effects are better than ever and the conspiracy at the center of the plot is very intriguing."
    },
    {
      "rating": "3/5",
      "review": "Vamos a hacer como si las dos siguientes películas no existen y este es el final definitivo de la trilogía. Esta si resulto ser más digerible y entretenida que las dos primeras, algo que a lo que recuerdo, esperaba más de las dos primeras."
    },
    {
      "rating": "5/5",
      "review": "Honestly Loved the dynamics of the Transformers! I did not mind the human side of things and enjoyed the humans getting together when all hope seemed lost. When I first watched it I had no idea Sentinel Prime was a villain and was so sad to see what happened to Ironhide. The betrayal was so devastating and the comeback so great! The more I learn about the movie the better it gets! I love seeing the details added in to these scenes. Did you know that The shield Sentinel uses is physically part of his body when he is in car form? Long story short, I don't care what you think of the human relationships, The Transformer scenes were Amazing."
    },
    {
      "rating": "3.5/5",
      "review": "The action and CGI were pretty good, just it needed a stronger story. Nevertheless, it is (in my opinion) the best Transformers movie"
    },
    {
      "rating": "3.5/5",
      "review": "It was a little better then the second movie, and if they didn't get ride of Megan Fox, the love story would have been different and in my opinion, better, and the new girl acts like she's been with him as long as his first girl, when she has definitely not."
    },
    {
      "rating": "3.5/5",
      "review": "this was way better than revenge of the fallen but it isn't as good as the first movie in my opinion, sure it's good but the whole Carly and Sam dynamic is so boring I get Megan fox was fired but you could've gotten someone way better, and Sam not being able not to fight back against Dylan was so weird ok so you can talk back to 60ft tall tyrant robots from the edges of the Galaxy but you can't punch a freaking guy!?!?"
    },
    {
      "rating": "4/5",
      "review": "Awesome movie, it's better than the second one at least"
    },
    {
      "rating": "4/5",
      "review": "One for the books! Undoubtedly rewatching for years to come. Action packed, heartfelt, awesome!"
    },
    {
      "rating": "4/5",
      "review": "Best of the first trilogy"
    },
    {
      "rating": "2/5",
      "review": "Apart from the visual effects and brilliant sound mixing (which can only be appreciated with a surround sound system), this would have been a mediocre film if they maintained the story and characters. Definitely missing the chemistry between Sam and Michaela from the 2 previous films. Just wasn't sold with the new girl."
    },
    {
      "rating": "3.5/5",
      "review": "While it's certainly not an amazing \"movie\" the only reason I find enjoyment is the sheer scale of the plot and the main reason, the action. It's the best the franchise has brought."
    },
    {
      "rating": "5/5",
      "review": "Esta película tiene mucha acción entiendo que es inferior o superior a la original pero les debo decir que me encanta esta película hasta les debo de decir que es mi favorita de la trilogía original le doy a esta película 10/10 se las recomiendo a varios de mis amigos."
    },
    {
      "rating": "5/5",
      "review": "this movie is amazing the betrayal of sential prime makes movie rellay intense better than revenge of the fallen how the humans explode the dectipcon legs"
    },
    {
      "rating": "4.5/5",
      "review": "Really like the plot. Again with the good CGI, the cast is great. Just awesome."
    },
    {
      "rating": "5/5",
      "review": "Wow this movie is spectacular, but I don't care what critics say."
    },
    {
      "rating": "3/5",
      "review": "This movies final battle is good, but it felt to long and it felt like it barley showed the bots, Sentinel prime was a good villian though."
    },
    {
      "rating": "2.5/5",
      "review": "This movie had sparks of greatness, but the final chapter was ridiculous and it felt like the length of the film was forever!"
    },
    {
      "rating": "3/5",
      "review": "Michael Bay in a unique and impactful light."
    },
    {
      "rating": "4/5",
      "review": "This movie was lengthy, boring at times making me sleepy, interesting plot though but they present it in a ln ok way. Battle of Chicago was so peak tho, battle of Chicago was a 1000/10 which rly carried the movie, 7.5/10"
    },
    {
      "rating": "4.5/5",
      "review": "Almost perfect......."
    },
    {
      "rating": "3.5/5",
      "review": "Es una gran película pero es un tanto inferior a la de 2007 y después de el lado oscuro de la luna inicio la decadencia del bayverse"
    },
    {
      "rating": "5/5",
      "review": "Amazing movie. I genuinely do not understand why the scores for this movie are so low..."
    },
    {
      "rating": "5/5",
      "review": "W,w w w WOW WOOHOOOOOOOO!!! This is the absolute masterpiece of unlimited awesomeness 10000000000/10!!!"
    },
    {
      "rating": "5/5",
      "review": "Uma sequência boa depois da lástima do 2º filme. Achei tudo muito bom,"
    },
    {
      "rating": "3.5/5",
      "review": "Not as good as the first one but MILES above the second one. And the action on this movie is 👌"
    },
    {
      "rating": "3/5",
      "review": "Granted as time has passed, it's not as bad as we thought. It still is far from perfect. Following Revenge of the Fallen's loud noises and explosions, dainty sexualization of female actors, retconn galore, and drowning us in multiple poor attempts at humor. For the trained eye it is migraine worthy. HOWEVER, this movie gave us things that genuinely surprised me. First off, Sentinel Prime was probably the most complex and well written villain Michael Bay gave us and allowing us to see a softer side of Optimus again with Sentinel's addition. Rather than a generic \"Humans are dumb, destroy them\" shtick. He is a more tragic person who will do whatever it takes to ensure the safety of his home.. no matter how corrupt his actions may be. This film also just radiates 'Summer Blockbuster' with all the action and battle of giant proportions, taking a unique style of tying in transformers with human history as buildup for the plot. And of course it has some of the best special effects I've seen, the entire Chicago battle featured great CGI that puts a majority of movies released in the past 7 years to shame. It had some good potential, and so decent writing in spots, however it's issues sting the whole thing in the butt like a snake in the toilet.... ok at best."
    },
    {
      "rating": "5/5",
      "review": "the best movie out of the whole franchise and it for sure has the best pacing and plot, the decepticons and autobots were perfect and the villain was just pure perfection, CGI was on top and the acting was amazing"
    },
    {
      "rating": "4/5",
      "review": "Everything in Dark of the Moon proves that it should have been the finale of Bay's Transformers, this film is a fan favorite because it had the best action out of the franchise. Why Bay's Transformers has a cult following is because of the first three films. Thank you Travis Knight for Bumblebee and thank you Steven Caple Jr. for Rise of the Beasts. Michael Bay, this should have been a finale."
    },
    {
      "rating": "3.5/5",
      "review": "Best of the transformer sequels"
    },
    {
      "rating": "3.5/5",
      "review": "The Decepticons come up with a plan to bring Cybertron to Earth. Amazing how a series that change almost everything from the cartoons except the names and Prime being a truck, would dip into a plot from the cartoon show. Then pad the hell out of it. Considering the original cartoon's story was at the most two parts and forty something minute episode, this movie stretches to 2½ HOUR movie. The padding involving Sam, which I think is suppose to be Spike. But they changed Spike into a whiny yelling Kenny. Makes you wonder is she really going out with him? Of course Spike's dad Sparkplug didn't come out any better. Even though I don't agree with the critics, I can see where they're coming from with these movies. It started out not perfect but still great and started sliding down quickly. But the effects are great and still better then the last one. Robots don't have balls in this one."
    },
    {
      "rating": "3.5/5",
      "review": "Wow this was a Good end To THIS TRILOGY YEP THIS MOVIE FORMS A DECENT MOVIE TRILOGY GLAD MICHAIL BAY LEFT US ON A GOODNOTE AND DECIDED NOT TO MAKE TF4 AND TF5 IF IF HE DID MAKE THOSE MOVIES THAT WOULD SUCK"
    },
    {
      "rating": "3.5/5",
      "review": "Although it's a bit long, this is in my opinion the last watchable Transformers movie of the franchise prior to the reboot."
    },
    {
      "rating": "4/5",
      "review": "A bigger action with the 80s ugliest robots come on"
    },
    {
      "rating": "4.5/5",
      "review": "2nd to the best Transformers movie ever! Love these movies!!!! Highly recommended!"
    },
    {
      "rating": "5/5",
      "review": "This Movie is awesome better than a transformers 5 Music is awesome and Battle is awesome Carly is beautiful the autobots is incredibles my Rating is 9/10"
    },
    {
      "rating": "1/5",
      "review": "This is the worst transformers movie its boring it has scenes like the movie sweet home Alabama. THIS STOLE 154 MINUTES OF MY LIFE!"
    },
    {
      "rating": "5/5",
      "review": "amazing movie and it is better cgi then T.R.O.F"
    },
    {
      "rating": "4/5",
      "review": "It is a film, one could say regular, the action is not the best, it lacks history"
    },
    {
      "rating": "4/5",
      "review": "Now: 8/10. 83/100. | As a Kid: 8/10. 85/100"
    },
    {
      "rating": "2.5/5",
      "review": "Definitely would be the best transformers if the characters weren't so annoying"
    },
    {
      "rating": "1.5/5",
      "review": "I had to force myself to watch the whole thing, they hid all the good plot of Optimus vs his mentor. In exchange you get some weak couples fight that was just painfull to watch. I mean, I get it, put a hot model and hope for the best, but this was just cringe."
    },
    {
      "rating": "2.5/5",
      "review": "The final battle, is the best thing in the movie."
    },
    {
      "rating": "4/5",
      "review": "First half of the film could have been better, but the rest of the film was action packed till the end. Bay's Transformers should have ended with this film."
    },
    {
      "rating": "3/5",
      "review": "Dark of the moon is a very simple action film with loud explosions and large scale destruction and violence, and that might just be all the Transformers series needs."
    },
    {
      "rating": "1/5",
      "review": "Michael Bay Ruined Transformers, none of his transformers movies are good"
    },
    {
      "rating": "3/5",
      "review": "While still largely imperfect, Transformers: Dark of the Moon is an improvement over its predecessor with more breathtaking visuals and epic-scale action."
    },
    {
      "rating": "3/5",
      "review": "Transformers 3 ha tantissimi difetti, ma è apprezzabile uno sforzo maggiore nella scrittura della trama e degli effetti speciali magnifici"
    },
    {
      "rating": "4/5",
      "review": "It is personally my favourite transformers film because of its epicness , characters , visuals and action . And it was the last time we saw Sam Witwicky ."
    },
    {
      "rating": "5/5",
      "review": "Best transformers movie"
    },
    {
      "rating": "3/5",
      "review": "A little bit dissappointed but still it was entertaining."
    },
    {
      "rating": "5/5",
      "review": "Over 10 years old and still my #1 film of 2011 and one of the best movie theater experiences ever Michael Bay returns for his third entry in the highly-successful action-packed franchise based on the Hasbro toy line Shia LaBeouf returns as Sam, John Tuturro as Agent Simmons, Peter Cullen as Optimus Prime, Josh Duhamel as Captain Lennox, and Tyrese Gibson as Epps along with newcomers like Patrick Dempsey, Rosie Huntington-Whitely, Frances McDormand, John Malkovich, and the late Leonard Nimoy as Sentinel Prime The film opens with a flashback during the battle of Cybertron with the Autobots escaping on a cargo vessel called The Ark which would’ve won the war but it crash landed on the moon Later during the Apollo 11 mission in 1969 humans came across it and the government deemed it classified knowing in secret that discovered alien technology It was kept secret until present day; meanwhile Sam is living with new girlfriend Carly in the city desperately trying to find a job so he can matter again The Autobots have continued teaming up with NEST to protect America with Energon detectors and solving international human conflicts Suddenly an engine part from the Ark that crashed is found in Cherynobl with a bigger conspiracy about the moon landing and the astronauts sworn to secrecy Optimus and crew then recover his old mentor Sentinel Prime, Sentinel warns them of these pillars that can transport matter of resources, refugees But as Sam digs deeper startling revelations come to light as Earth faces an invasion to rebuild Cybertron as he and Optimus and the others must save the planet once more This is lengthy like the others and I didn't like the comedy that took up the first hour but it is better than movie 2 and right up there with movie 1 It got darker during the second half which I appreciated and it dispenses with the trouble of Sam’s relationship and employment problems I did enjoy all the new Autobots and Decepticons next to cameos from Dempsey to Malkovich Absolutely loved the late Leonard Nimoy voicing Sentinel Prime too I got more Transformers to appreciate this time around These are some of the best action scenes ever especially the last act that’s everything a Transformers movie should be being constantly exciting and eye-catching I didn’t mind Rosie Huntington-Whitely replacing Megan Fox, she can act The score by Steve Jablonsky is still one of my favorites making this a much bigger movie going experience This film even has some of the best merchandise as well it's incredible Flaws exist still particularly plot points that require your brain to turn off But the movie still screams popcorn entertainment with giant action and special effects Total Michael Bayness for sure showing his love for destruction and exciting spectacle"
    },
    {
      "rating": "3/5",
      "review": "Don't get me wrong, I enjoyed it but it's so much more lackluster than the first ones. The plot feels forced to include the human characters, but hey, the fights look cool at least."
    },
    {
      "rating": "1/5",
      "review": "Transformers 3 é o que eu gosto de chamar de \"tortura\" cinematográfica, que pra se tornar um filme ruim, ainda precisa melhorar muito. Michael Bay se supera nessa continuação, trazendo um filme intragável em todos os aspectos, não conseguindo nem mesmo dar o mínimo de diversão ao espectador, seu jogo de câmera é confuso, sua trama ridícula e atuações deploráveis. O único ponto que se mantém positivo é seu CGI, impecável até os dias de hoje."
    },
    {
      "rating": "3.5/5",
      "review": "Para mim, o mais interessante da franquia, salvo todas as exceções. O começo, na Lua, é impecável, assim como as justificativas para o pouso em 1969, assim como o desastre de Chernobyl. Convenhamos, foi muito inteligente. A nova namorada de Sam consegue ser ainda mais sem sal que Megan Fox. Um homem que salvou o mundo duas vezes não consegue emprego em lugar nenhum? O que dizer dos robôs que sangram? Sem comentários. Deixando o cérebro de lado, o filme pode entreter."
    },
    {
      "rating": "5/5",
      "review": "This is entertaining"
    },
    {
      "rating": "4/5",
      "review": "I dont even think that it was so bad its one of the better ones in the franchise its a real good movie , its funny exciting and the Action was real good I think its not the best of the Transformers Movies but its very good"
    },
    {
      "rating": "5/5",
      "review": "Probably the best action movie in history"
    },
    {
      "rating": "5/5",
      "review": "Best Bayverse film, Badass fight scenes, Great CGI for its time, Great Characters, and unlike a lot of transformers movies, the human segments were enjoyable! 10/10"
    },
    {
      "rating": "4/5",
      "review": "The final fight scene was almost an hour it felt like. I enjoyed the action and suspenseful moments."
    },
    {
      "rating": "5/5",
      "review": "Battle of Chicago is one of the best action scenes in cinema"
    },
    {
      "rating": "3.5/5",
      "review": "Its bayhem style kills this movie, along with lazy writting, and a sort of hard to follow plot. But even still, the ideas that this movie bring forward are great. This movie pushes the PG-13 limits."
    },
    {
      "rating": "1/5",
      "review": "The one word that was traveling through my head as I was watching this film: Ughhh. It pained me to watch the last third of the film - the long, spectacularly boring action sequences, neatly spaced by the villain who takes his sweet time activating his evil weapon. As I think, the first third was also indignantly awful. Five minutes into the film, when a CGI President JFK appeared on-screen, I nearly puked. The horrible character dialogue, involving a catastrophically misused Shia LaBeouf, Frances McDormand, John Malkovich, and Ken Jeong, almost had me walk out. The unfortunate thing with the Transformers franchise is that however much character development that director Michael Bay puts into the film, the humans' overall input into the actual fighting is negligible. Once Bay fixes this gigantic problem, he can then possibly give some reconciliation to the underpaid critics who were forced to sit through this awful film."
    },
    {
      "rating": "4.5/5",
      "review": "the Final Battle of this movie, is one of the best final battles of the 2010s. the action is great and gets quite emotional throughout the film. the city destruction looks so realistic and I love it. 9.5/10"
    },
    {
      "rating": "5/5",
      "review": "After going through a re-watch of all the Transformers movies, this one is one of the best ones in the franchise. It was the perfect way to end off the best trilogy for Transformers. The final battle scene is spectacular and you can feel the weight of the Universe relying on these autobots."
    },
    {
      "rating": "5/5",
      "review": "number 1 movie for me in this franchise, the final battle was epic and the music makes it even greater"
    },
    {
      "rating": "5/5",
      "review": "Cant understand the score. This movie is amazing and for me it is one of best movies ever made. I really love old Transformers trilogy."
    },
    {
      "rating": "3.5/5",
      "review": "Unpopular opinion I think but I kinda like this movie. The final fight is really good the beginning is ehh but it's pretty funny sometimes."
    },
    {
      "rating": "5/5",
      "review": "The best of the trilogy"
    },
    {
      "rating": "5/5",
      "review": "This film is both emotional and full of action at the same time. The characters are useful to the story but the human characters took away from the experience a little bit. Overall I think that this may be the best Transformers film."
    },
    {
      "rating": "5/5",
      "review": "Now this might very well be one of my favorite films of all time. Is there some goofy humor you must struggle to get through sometimes... sure. However this film is very dark/serious when you get to the halfway point. There are many plot twists that keep you on the edge of your seat in a very intense and emotional way. The cinematography and score is beautiful as well. And this film is not as funny as the others. When I say dark and serious. I'm not kidding. The second half of the film has alot of death and twists and you feel the stakes are very high. Very solid movie. Love it."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is so overhatted. I get it's no masterpiece but it's a movie about robots fighting, it isn't supposed to be. Critics are too harsh on this movie"
    },
    {
      "rating": "5/5",
      "review": "✓ KINO ✓ GOAT ✓ PEAK FICTION"
    },
    {
      "rating": "5/5",
      "review": "In any war, there it comes between storms. There will be days from lose fate, days when our alies turn against us. But the day it never come that we forsake this planet and it's people."
    },
    {
      "rating": "4.5/5",
      "review": "i think this is the best in the franchise. it has the best villain in the franchise, decent plot and a good third act."
    },
    {
      "rating": "3/5",
      "review": "Slightly better than ROTF, but the potty humour and loud in your face craziness grates alot. The final act was probably the best one Bay did. This should have ended the trilogy and the next film should have restarted with a new cast of bots, and actors."
    },
    {
      "rating": "4/5",
      "review": "Great movie, actors deliver as usual and the adult comedy is perfect. Great movie."
    },
    {
      "rating": "3/5",
      "review": "I mean it's not a masterpiece, but it's not that bad. Some of the shots are too long and the decisions are incredibly dumb (+ strong plot armor), but it's still kinda fun and definitely you can kill some time with it."
    },
    {
      "rating": "4.5/5",
      "review": "My favorite transformer movie out of all the 5. It was action packed and a cool movie"
    },
    {
      "rating": "4.5/5",
      "review": "AWESOME ACTION-PACKED THRILL RIDE"
    },
    {
      "rating": "3.5/5",
      "review": "It's one of the best Transformer movies, in my opinion. The only problem is that everything is unbelievably brutal. Michael Bay pushed PG-13 to its limits."
    },
    {
      "rating": "4/5",
      "review": "the best Transformers movie (besides Bumblebee) but still not that amazing or anything"
    },
    {
      "rating": "4/5",
      "review": "Despite still having flaws, it is still a massive improvement over Revenge of the Fallen. Honestly could have been the perfect ending to the series if it weren't for Age of Extinction and The Last Knight. Pros: -Like the previous films, amazing VFX that still looks amazing! -Awesome action scenes and fights, such as the Highway chase, Shockwave's introduction with the Driller, the Battle of Chicago, and many more! -Acting and voice acting is great! -Humor is an improvement from the last film and has some genuinely funny moments -The Transformers look great, new ones look really cool and have some neat designs, old ones look great, especially Megatron! -Some human characters were great -It can be really emotional, dark and depressing at times -Soundtrack is awesome, with Linkin Park being a very great addition, with Iridescent being used in a depressing and a bittersweet way Cons: -Though an improvement, some humor is hit or miss - Has some unnecessary parts, though thankfully not as much compared to the previous movie -Some may find it too action packed or have trouble identifying who's who -Lots of new Transformers had little screentime or were wasted, with the most notable being wasted is Shockwave -The ending was changed due to the novel and comic version were leaked, therefore would be spoiling the movie's ending -Story can be hit or miss"
    },
    {
      "rating": "5/5",
      "review": "The greatest 02 hours: and 34 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "I have just recently started watching the Michael Bay Transformers films. Out of all of them, this movie is my second favorite out of the 5. (#1 being the first movie) The action in this movie is probably some of the best action I've ever seen in a film. There is a lack of emotion in the story however, especially the love plot between Sam and his new girlfriend. We've been building the relationship between Sam and Mekayla, and then she's just gone, which is kinda weird. However, I was brought to tears during the autobot execution scene. So that was good. Also, the building fight scene is absolutely awesome! It is its own mini movie, with a beginning, (the building starting to fall,) a middle, (the decepticon in the building) and an end, (Shockwaves worm attacking.) Optimus Prime going full melay on Megatron and Sentinel Prime in the end was a bit out of character, And I think the original ending where he only killed Sentinel and had Megatron leave earth instead of killing him would've been better. But overall, a great movie. I would definitely watch it again, and I recommend you watch it as well."
    },
    {
      "rating": "3.5/5",
      "review": "Even though it contains scenes that I would happily remove, Transformers: Dark of the moon has some of the best action in the entire franchise and overall, makes for a fun watch. Rating: 69% Action: 10/10 Comedy: 3/10 Horror: 2/10 Drama: 5/10 Suspense: 4/10"
    },
    {
      "rating": "4.5/5",
      "review": "its my favorite transformers movie"
    },
    {
      "rating": "5/5",
      "review": "Masterpiece, I don't care what critics says"
    },
    {
      "rating": "4/5",
      "review": "I think this movie was awesome but it has it's twists. Action is perfect not doubt 10/10 or more. Acting/voice acting is also a 10/10. CGI is also great. I like Sentinel Prime he was cool he reminds me of Drift and Jetfire they switched side for what they think is right, this Megatron was better than Megatron in the 2nd film because 2nd film Megatron is bad. Writing is also perfect. This is one of the best movie story's/plot's I've ever seen. Casting is great. Adventure was good. Characters, although we didn't get much of him I really liked Mirage. I love the ending Prime leaves us of with another perfect speech that makes him one of the best leaders in sci-fic history. And I think this is a great way to have a humans vs robots apocalypse. But what I really hate is when Sentinel kills Ironhide. And you can not tell me Prime legendary kill streak is bad because it was perfect."
    },
    {
      "rating": "2.5/5",
      "review": "I saw the 2D version so maybe it would be a 3 if I saw the 3D version. That being said what I saw was pretty much a repeat of all the problems of Rise of the Fallen. The acting isn't that good outside of Frances McDermond who is decent. Shia feels like he is so over the top at times and lacks any charm or chemistry being not as good as 1 or even 2. The new love interest is better than Megan Fox but not by much, I still think she is average at best. The Autobots really don't have any personality and like all the other side characters are one dimensional. Tyrese Gibson & Duhamel are as one dimensional as they were in the previous one. Ken Jeong is TERRIBLE. My main problem is the editing and pacing are not good. The first half of this film is unfocused and overall bloated. The plot feels like it is a Political Thriller that is so ridiculous a setup its laughable at times. The whole backstory with Sam trying to find a job, the plot twist with his girlfriends boss and the fake out with the space shuttle is ridiculous. The film does become more stable by the end in the Battle for Chicago which has all he classic Bay Tropes but its at least simple and straightforward unlike the first half which helps somewhat. The cinematography is ok enough, there is a complete oversaturation of CGI and isn't anywhere as good as the first. None of the locations outside of Chicago are that memorable. The music is generic and boring as well. Let me say this, if you liked Rise of the Fallen you'll like this. If not than skip it, its pretty much the same thing."
    },
    {
      "rating": "3.5/5",
      "review": "imo the second best transformers movie"
    },
    {
      "rating": "2.5/5",
      "review": "In conclusion, watch it if you only want to witness 3D, robots, attractive chicks, and explosions. If you watch movies to see a good tale with developing characters and to get some cinematic value. This is nothing new."
    },
    {
      "rating": "0.5/5",
      "review": "This movie managed to perfectly balance an amazing action blockbuster spectacle with a pretty decent script."
    },
    {
      "rating": "2/5",
      "review": "Shockwave was cool...The big city battle was kinda cool...It had Leonard Nimoy in it...and the soundtrack was really good...and that is every single good thing In this wreck."
    },
    {
      "rating": "5/5",
      "review": "This one is a epic movie a long time ago I love it so much 10/10👍🏻"
    },
    {
      "rating": "3/5",
      "review": "Transformers: Dark Of The Moon (2011) is an improvement from the second movie. It has a bad and boring first half but it actually has a pretty decent second half. It is still corny and stupid as the others though."
    },
    {
      "rating": "0.5/5",
      "review": "How Spielberg accepted to be one of the producers of this awful movie."
    },
    {
      "rating": "5/5",
      "review": "A++ 15 out of 10 this my favorite movie."
    },
    {
      "rating": "3.5/5",
      "review": "Another great movie. Not as good as the first two but still worth the watch"
    },
    {
      "rating": "3.5/5",
      "review": "A lot of over acting by the actors."
    },
    {
      "rating": "2.5/5",
      "review": "The action was what carried this movie."
    },
    {
      "rating": "5/5",
      "review": "Esta pelicula es la mejor de transformers que hay hasta la fecha, tiene un buen equilibrio entre los humanos y robots en pantalla, no me importa que digan los demas esta sin duda es mi favorita de esta franquicia, la batalla final uff, legendaria!!"
    },
    {
      "rating": "4/5",
      "review": "Transformers: Dark Of The Moon is a better than 2. It begins kind of slow, but when we reach the climax that’s when it begins To become epic. It was big but not exactly better than the first. But I had fun with this."
    },
    {
      "rating": "5/5",
      "review": "The greastest Transformers movie, so good..."
    },
    {
      "rating": "4.5/5",
      "review": "This is easily the second best transformers movie and the one to feature the best directed action scenes yet the acting was really good especially from supporting actors tyrese Gibson, josh duhamel and especially Frances's mcdormand one of the greatest actresses of all time and Patrick Dempsey who plays a really slickly cruel villain you can feel the evil of and the voice acting is just great we have Leonard Nimoy voicing the main villain sentinel prime who was supposed to be the other leader next to Optimus prime he is a solid antagonist and I especially loved Optimus prime here he was like a John Rambo style hero killing deceptions to save humanity in this third film it's the darkest and most gruesome of the first trilogy as it has humans being killed and there is a lot of massive destruction and well filmed large scale city battles and a very stunning highway chase sequence the movie was visually beautiful and it had some charachters I cared for including Shia's Sam witwicky and even her girlfriend played by the great action star Jason statham's wife Rosie Huntington Whitley she was more attractive and even a better love interest and was more well acted than that horrible Megan fox I also loved how the military were fighting with the auto bots this is how a transformers live action movie should be made I really like this movie it's a good film I think it should be considered the next good transformers film next to the 2007,s making there be two good films in the Michael bay pentalogy making the franchise be less hated and considered a failure because of dark of the moon and the 2007 original and that there were only three films that were abysmal revenge of the fallen, age of extinction and the last knight were awful and those should be why the franchise gets hate otherwise 1 and 3 are the decent ones that are coherent, well made and not painful to watch even those there is more bad films than good ones in this franchise it could still deserve less hate because of this film and the original dark of the moon and the original bay film remain the only two films in this franchise that I like and even love Michael bay did a great job improving over revenge of the fallen the marketing's were right this is the best transformers film with action and cgi and having more transformers screen time it's the second best and the best and only good of the four sequals even if it isn't a masterpiece like Casablanca or the lord of the rings films of citizen Kane and godfather 8/10"
    },
    {
      "rating": "5/5",
      "review": "''For today in the name of freedom... we take the battle to them.\""
    },
    {
      "rating": "5/5",
      "review": "It was very good and I loved the bit when the decepticons attack"
    },
    {
      "rating": "3/5",
      "review": "A much better film than its predecessor in terms of story and coherence, \"Transformers: Dark of the Moon,\" while still falling victim to many of the usual problems that we've come to expect from the franchise, is a surprisingly decent conclusion to this stupidly fun trilogy. The CGI and action was as good as ever, and the plot surprisingly better than expected, yet the continually weak (and in some cases extremely irritating) characters, stale humor, overabundance of cliches, and nonsensical dialogue bog this movie down."
    },
    {
      "rating": "5/5",
      "review": "Ages 13 and older!!!!!!!!!!!!!!!!!!! The greatest 02 hours: and 34 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "4/5",
      "review": "If I'm being honest I actually liked the first three movies in the transformers franchise, after that they went straight down the toilet. So for me I gave it a good score. Special effects were good, and a predictable but entertaining story."
    },
    {
      "rating": "5/5",
      "review": "The Third Installment, it should have been the final film of the series. It remains as an improvement over its predecessor, but The Action Sequences will remain as the best part of the film. 10/10"
    },
    {
      "rating": "3.5/5",
      "review": "The final transformers trilogy is long epic conclusion of the movie but is both bad and good Michael Bay's movie."
    },
    {
      "rating": "2.5/5",
      "review": "Transformers: Dark of the Moon keeps approaching being likable. However, every time it gets close to goodness, it shoots itself in the foot with bad writing, corny jokes, or inconsistent characters. Even the destruction & explosions start to feel bland as the action sequences drag on and on. It's a small step up from the last film, but this movie is still bogged down by its runtime and general disregard for the intelligence of its audience."
    },
    {
      "rating": "5/5",
      "review": "Best movie ever yes yes yes yes yes yes yes"
    },
    {
      "rating": "3.5/5",
      "review": "While most of the other Transformers movies tend to be stupid and silly, this one I found to be the most fun and enjoyable with the action, the acting, sequences, the stakes, and the twists! Sure Michael Bay can sometimes be over the top and unconvincing, but I still think that this one does its job with providing the audience with a real ride! Better than Armageddon and Revenge of the Fallen I'd say!"
    },
    {
      "rating": "5/5",
      "review": "Pelicula de la infancia, tiene fallos pero la accion y batallas, es increible!"
    },
    {
      "rating": "1/5",
      "review": "Five stars for the autobots/deceptacons. Everything about them two thumbs up from transforming to voicing to their lines. Three stars for plot, tho it moved a little too fast without anything gluing it together. Zero stars for the girls who play insignificant roles other than to be damsel and eye candy. Seriously isn’t needed to make this movie. I don’t understand why they keep doing this, the females change every movie and have zero depth."
    },
    {
      "rating": "4/5",
      "review": "This movie may be a bad movie, but I still like it. It's good for big robots doing fighting stuff with explosions. I also find this movie stupidly funny for all the wrong reasons. Just all the crap with human characters saying and doing stupid things that makes it really hilarious when it should be serious. Just all that with the robo-action and the stupid hilarious of the film make it really fun to watch, if you can handle that sort of stuff."
    },
    {
      "rating": "1/5",
      "review": "This film was a big let down. Having Leonard Nimoy back, it would have been an opportunity to do a live action remake of the 1986 Transformers cartoon movie (which was light years better than anything Michael Bay put out)."
    },
    {
      "rating": "5/5",
      "review": "Huge Action Blockbuster"
    },
    {
      "rating": "2.5/5",
      "review": "I ring the horny bell once again. The entire beginning of this film, it's boring. Eventually, it definitely ramps up and the conclusion to the film really is the only stuff that matters at all. I'd say just watch all of the Chicago battle scenes, the highway scene, and talk with Prime before the shuttle launch."
    },
    {
      "rating": "2.5/5",
      "review": "The special effects are impressive but aren't enough to make this a good movie. Shia LaBeouf was terrible and dull. Huntington-Whiteley's acting makes Megan Fox look like Meryl Streep in comparison."
    },
    {
      "rating": "5/5",
      "review": "👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍🌟🌟🌟🌟🌟"
    },
    {
      "rating": "5/5",
      "review": "One of the best Transformers movie, if not the best, and maybe even one of the best movies of all time! I was 8 years old when I first saw this in 2011, and it brought back a lot of memories. I am a huge Transformers fan and I recall a lot of details from this film. I remember the toys and the memories I had with others. I still enjoy the other films, but this is one that stands out the most and I will never forget it. It astounds me much more that it is one of the highest-grossing films of all time, with making almost 1.2 billion dollars in the box office despite a \"low\" budget of 195 million dollars. I had no idea what to expect after Revenge of the Fallen, but this caught me completely off guard. Everything in Dark of the Moon is out of this world, the characters, the musical score, the story, the mystery, the action, the intensity, everything compelled me. You need to see this movie and when you do you'll find out something that you definitely never saw coming, I know I never did."
    },
    {
      "rating": "3/5",
      "review": "two words that bring this movie down Shia LeBouf.. replace him with almost anyone more likeable.. and its a star or half star better, minimum. but the MOVIE is Exactly what you think it is.. a Transformers movie. its a kids show.. aimed at... teens.. adults got in on it, (like me who saw the original cartoon, and still love a good sci fi show ) and loved the very first one. they dragged out the series for $$$$, and it shows.. i STILL watch it.. it passes an evening just fine. but wont make your weekend. its not Star Wars, Star Trek or anything else. its... Transformers vs Evil Humans and their own kind.. what else were you expecting ? Hamlet in Space ?"
    },
    {
      "rating": "3/5",
      "review": "Only mistake is its first 30 minutes which look like a no-nonsense comedy movie, but after those 30 minutes it's a good action movie despite the script sometimes not working. Incredible special effects, normal with Bay at the wheel. (6/10)"
    },
    {
      "rating": "5/5",
      "review": "This is probably my favorite bayformer movie ever"
    },
    {
      "rating": "3.5/5",
      "review": "Overall I loved it, Probably because this is my childhood favorite film but I acknowledge It's not directed well but It's the best story in the franchise in my opinion. Not the best film but the best story of the franchise."
    },
    {
      "rating": "5/5",
      "review": "Sentinel Prime is the reason I watch this movie"
    },
    {
      "rating": "2/5",
      "review": "While it's less tiring that the second movie, Dark of the Moon fails at telling a new, interesting story as a grand finale, ending with overlong, emotionless package of punches and explosions."
    },
    {
      "rating": "4.5/5",
      "review": "9.5/10. this film contains some mind-blowing action, emotional moments and some of the best action in the Transformer's films."
    },
    {
      "rating": "4/5",
      "review": "Very satisfying to watch. Like all the previous ones this Transformers is made with perfection and attention to detail. All the action scenes and all the CGI used is better then any other movie made today, 10 years later. The bad reviews can only be explained by the fact that some reviewers tend to criticize the story for not having a deeper meaning. But who needs a story like that in a sci-fi action movie about alien invasion. I think that The fans have been largely served and there is really not much to criticize here. The only thing that is missing is Megan Fox. But Rosie Huntington-Whiteley honestly did a good job. So if you liked the first one in the franchise and you don't go in with much expectations, you are most likely to enjoy this one. It's a great entertainment!"
    },
    {
      "rating": "4.5/5",
      "review": "In the first act I thought I was watching an Adam Sandler comedy film, but when the plot started to heat up it was in a short time that I realized that I was watching the best film in the saga, no criticism that I have to point to this film, only made a mistake in the first act"
    },
    {
      "rating": "3.5/5",
      "review": "I mean I'm biased cuz this is one of my favorite movie series but without Megan Fox it's like something was missing with Sam but of course Shia delivered"
    },
    {
      "rating": "5/5",
      "review": "BEST TRANSFORMERS MOVIE THE GUNAL BATTLE WAS AMAZING BUT THEY COULD HAVE HAD KORE ACTION IN THE MIDDLE IR BEGINNING"
    },
    {
      "rating": "4.5/5",
      "review": "Honestly, I don't understand the hate for this movie. The action and story are great here in the third installment. Once again, it's effects are exceptional, while also providing a dark, emotional, amazingly action packed, and full of surprises and new characters. There are a lot of great scenes, and offers an interesting take upon the moon landing and its relevance to the exploration of an alien ship landing. Great movie, definitely, at least to me, the best in the series. Definitely would recommend."
    },
    {
      "rating": "3/5",
      "review": "Il finale della trilogia rende abbastanza interessante i movimenti della trama, seppur far tornare nuovamente Laboeuf è davvero una forzatura. Per la prima volta si vedono anche piccoli momenti più cupi, anche se l'azione alla fine finisce per farla da padrona, nuovamente in una città americana come già accaduto nel primo capitolo. Il finale porta una battaglia spettacolare visivamente ma troppo lunga e risolta in maniera sbrigativa nel finale che gli fa perdere tanto."
    },
    {
      "rating": "3/5",
      "review": "One of the better movies in the series that always disappoints my childhood."
    },
    {
      "rating": "2.5/5",
      "review": "This would have been better with an hour less run time!"
    },
    {
      "rating": "3.5/5",
      "review": "I may be a little biased considering I practically grew up on this film. Also Linkin Park are my favorite artists of all time. RT has once more, mistaken a important piece of movie history as garbage. Dark of the Moon is easily miles ahead of todays modern day films, its action packed, and entertaining and extremely well acted and it has one of the best soundtracks I've ever heard and they use that to their advantage. Other than that, there isnt much going for it. But thats the point of this film, action. Call me controversial because I believe Bay did a great job. They asked for action and it worked."
    },
    {
      "rating": "5/5",
      "review": "This is the best one out of the 5. SPOILER ALERT, my favorite scene is when they're falling out of the building. Could've used just a tad bit of action near the beginning but overall amazing."
    },
    {
      "rating": "3/5",
      "review": "Totally awesome love the graphics and the battles"
    },
    {
      "rating": "5/5",
      "review": "I don't understand why this film has bad reviews. This is honestly the best Transformers film. We get an older, more established Sam, a more bulked Optimus Prime, and a much more agile Bumblebee who has some of the best action scenes in the entire film. After being extremely disappointed in Revenge of the Fallen, I found this one to be a major improvement. Watching this film on the IMAX screen was an unforgettable experience! And let's not forget THE SOUNDTRACK! Paramore, Linkin Park, My Chemical Romance, Goo Goo Dolls, and many others! So good!"
    },
    {
      "rating": "3/5",
      "review": "Quite enjoyed it but the story is abit lacking"
    },
    {
      "rating": "4/5",
      "review": "An epic movie full of heart, with an understandable story and a good conclusion. I would put 5 stars to these if it wasn't for the Deep Wang scene."
    },
    {
      "rating": "4/5",
      "review": "It is the best transformers movie so far,they focus more on humans in this flick"
    },
    {
      "rating": "1.5/5",
      "review": "Better than the second but still a bloated 154 minute borefest"
    },
    {
      "rating": "3.5/5",
      "review": "The best one of the franchise that is worth watching and lives up to transformers"
    },
    {
      "rating": "3/5",
      "review": "The action was pretty good, the special effects were, for the most part, phenomenal, but everything in between was extremely boring."
    },
    {
      "rating": "1.5/5",
      "review": "The ability of Transformers films to tell us WHAT'S ALREADY TOLD is impressive! It looks like I was watching an extended version of Transformers 1! Adding the damn duration of 2h36min, with extremely repetitive content, we have a very tiring film. It's torture!"
    },
    {
      "rating": "4/5",
      "review": "One of the best live action installments in the robots in disguise film series. theres actually a decent story here, with some very good performances. humor & especially spectacular action & special effects. up there with Transformers: The Last Knight & Bumblebee."
    },
    {
      "rating": "3/5",
      "review": "But where is my queen Megan Fox? 1/10. It's an action movie with robot-aliens that turn into cars. Bumblebee still owns my heart."
    },
    {
      "rating": "4/5",
      "review": "Transformers 3 the truth is incredible I never forget it"
    },
    {
      "rating": "3.5/5",
      "review": "A huge step up from the previous entry, Revenge of the Fallen, but it still holds some of the biggest problems from it (overlong, too much human stuff, and cliche), yet I still have a great time watching it!"
    },
    {
      "rating": "3/5",
      "review": "Its definitely visually stunning and action packed, but that can help this third installment in the Transformers franchise overcome poor storytelling, inconsistent pacing and uninteresting characters."
    },
    {
      "rating": "4/5",
      "review": "‪The best Michael Bay Transformers movie, great action, mildly inconsistent plot, no real character arcs, still better than Revenge of the Fallen.‬"
    },
    {
      "rating": "1/5",
      "review": "Story telling was lagging, EVERY single Deception dies by each of their heads being destroyed in some way. Optimus Prime is turned into a violent character which is not in his character at all. There are no characteristics with any of the Autobots or Decpticons (Throughout every single film). The main poster for the film has Shockwave on the cover but he's barley in it, literally only 30 seconds tops. Megan Fox is also replaced by another women who's character could be compared to a slice of plain bread. MAN! They even got the names wrong with some of the robots, for example, The robot that they named Sentinel is actually Alpha Trion from the original cartoon show, and he is NOTHING like this character. In fact, he is the reason that Optimus Prime exists. You think that they would use Unicorn or something that makes more sense to a Transformer plot. Michel Bay just threw another Transformers film together without having any knowledge on what Transformers is or was. I wish i could give this film a zero star because it killed my love for transformers."
    },
    {
      "rating": "1/5",
      "review": "I stopped watching this franchise after the travesty that was Revenge of the Fallen, and was only brought back when Bumblebee cast a ray of hope on the desolate terrain of this property. Boy was that a mistake. Despite a host of excellent actors brought on to support the returning cast, nobody could rise above a script so abjectly hopeless with a director to match. The only redeeming aspect is the quality action visuals, and its clear that if they couldn't squeeze some slow-mo into a scene they weren't concerned with how it looked; JFK looks like the prop department raided a fire-damaged Madame Tussaud's. The story and dialogue are so incredibly juvenile that it is almost painful; the narrative builds up a somewhat compelling and morally gray villain, only to have him undone by Megatron's ego, stupidity, and incredible short-sightedness. The comedy is poorly timed and stupid. There are a strange series of bizarre musical features. Friendly reminder: this was the 5th highest grossing film of all time at its peak. (1/5)"
    },
    {
      "rating": "3/5",
      "review": "Good and clever and pretty interesting"
    },
    {
      "rating": "5/5",
      "review": "Amazing movie the action omg the final es Spectacular"
    },
    {
      "rating": "3/5",
      "review": "The action was fine but some times its not that interesting"
    },
    {
      "rating": "1/5",
      "review": "They keep getting worse. I never thought I would miss Fox but here we are."
    },
    {
      "rating": "5/5",
      "review": "Filme ótimo mais o que decepciona e fato de não a aproveita os robôs tipo sentinel prime sandwave e shokwave"
    },
    {
      "rating": "3.5/5",
      "review": "This is one of the best tranformers movie of the 5 I just didn't like how slow it went sometimes the action made up for it and the problem with this is they killed off a lot of transformers that had potential"
    },
    {
      "rating": "3/5",
      "review": "This is the best sequel out all the Transformers and that isn't saying much. The action is some the best out of any of them and this is the darkest one yet. The plot is still weak but hey at least there are not too many annoying characters this time."
    },
    {
      "rating": "2/5",
      "review": "Too many explosions and useless fight sequences made this a bad film."
    },
    {
      "rating": "4/5",
      "review": "Transformers: Dark Of The Moon is a movie that recovers some of the air from the first one, it is entertaining, with the best special effects of the saga, a story that is not so forced, well done action and an impressive final battle. But it also sins of having characters introduced in a forced way, the development of the plot is a bit abrupt and some decisions are very questionable. In conclusion it is an appropriate closing for the first trilogy of this saga."
    },
    {
      "rating": "5/5",
      "review": "It was a shocker and this one was also my favorite Transformers movie."
    },
    {
      "rating": "5/5",
      "review": "Way than Revenge of the Fallen god this movie brought back some fun action"
    },
    {
      "rating": "4/5",
      "review": "The third movie of the franchise. Has most ppl hate the bay verse because of reason I would say Dark of the Moon is has close has the first movie. It's enjoyable, action-packed, and more serious than the other two. If you're Transformers fan. you don't care about them know what I'd like to g1 designs you'll enjoy this."
    },
    {
      "rating": "5/5",
      "review": "My favorite Transformer movie"
    },
    {
      "rating": "5/5",
      "review": "I watched this and i loved it. Characters are awesome. Michael bay forever!!!!!!"
    },
    {
      "rating": "2/5",
      "review": "Has a few heartwarming moments, but Michael Bay ruins it with his love for explosions and a long script that overstayed its welcome. Plus, some of the character's decisions and mindset can range from stupid to just plain nonsense. This film is definitely the less annoying one out of the sequels."
    },
    {
      "rating": "4/5",
      "review": "With more of the visually stunning and explosive action, poor acting and clumsy dialogue we associate with Michael Bay, Dark of the Moon is flawed but satisfying, and should have been the last transformers movie directed by Bay."
    },
    {
      "rating": "5/5",
      "review": "Best 3D Effiect Ever."
    },
    {
      "rating": "1.5/5",
      "review": "Better than Revenge of the Fallen, but still needs to let go of retarted sexual jokes and constant explosions."
    },
    {
      "rating": "2.5/5",
      "review": "Another boring installment in the tiring franchise, the only memorable moments from Dark of the Moon was the Sentinel-Optimus rivalry and nothing else. The movie was just loaded with loud and heavy CGI driven action to hide its heartlessness."
    },
    {
      "rating": "3.5/5",
      "review": "This third installment of the Transformers movie series wasn't as great as the first one, but it was still pretty good. Shia LaBeouf and the rest of the cast did a great job in this movie. The plot to the movie was great and even some unexpected things happened, which made it interesting. The action scenes were pretty cool and it never got tedious. I'd recommend this movie even if people that saw it said it was terrible."
    },
    {
      "rating": "3.5/5",
      "review": "When the transformers aren’t around, it’s boring and unnecessary human drama. But the action is the best in the series and the climax and incredible"
    },
    {
      "rating": "3.5/5",
      "review": "Lots of action and awesome moments."
    },
    {
      "rating": "4.5/5",
      "review": "great follow up to Transformers in the first three films and it destroyed Revenge of the Fallen in story and has many great moments to it"
    },
    {
      "rating": "3/5",
      "review": "to me it was the weakest out of the original Michel bay trilogy"
    },
    {
      "rating": "1.5/5",
      "review": "A collision of tones and utterly inappropriate and unwelcome ideas, dialogues and story and some disgusting and puerile wish fulfilment sandwiched between terrible appropriation of nerd culture and science fiction as drawn by a warped American teenage jock. All sponsored by Lenovo. Yes, the transformations and effects and most of the Chicago battles are spectacular (not the janky JFK) but after nearly three hours the fatigue is real. There are some surprising horror moments with the bird thing, some great actors doing some bonkers ad-lib by the look of it, and there's an orgy of creatively mad ideas, like integrating NASA space program and going to Chernobyl, and some great practical effects. But overall, the editing and pacing is epileptic and lurching like a kangarooing car. The 3D varies but the spottiness, lack of consistency and disregard for 3D framing makes it almost negligible if not the for the utterly bright, crisp photography unhindered completely by 3D. I hated the second film and thought the first one was boring so while this film is the best of the original three Witwicky films, it's still completely, unquestionably terrible."
    },
    {
      "rating": "3/5",
      "review": "Just pure action... it feels like there was just no reason for it!"
    },
    {
      "rating": "3/5",
      "review": "Action and visual wise this is the best transformers movie there. But had too much of Micheal Bay-isms for my liking."
    },
    {
      "rating": "4/5",
      "review": "People Hates Michael Bay But Movie Was Excellent My All Time Favorite Film In This Franchise Visualization Stunning"
    },
    {
      "rating": "4/5",
      "review": "My 4th favorite Transformers movie"
    },
    {
      "rating": "4.5/5",
      "review": "Transformers Dark of the Moon is the best one of the Bayverse. We got an incredible adventure with so much action, history from the past in Cybertron, a secret enemy that you gonna flip out. Surprising scenes and incredible robot interaction, fights, and that big final battle. How is gonna ended? well, Optimus already said: \"Time to find out\""
    },
    {
      "rating": "2/5",
      "review": "Looked like it was going somewhere until the half way point where Sentinel changed sides, got extremely generic and boring after that. Not to mention the 1000 explosions per 5 minutes."
    },
    {
      "rating": "5/5",
      "review": "Great 3rd installment of the franchise! Love the movies, no matter what the irrelevant critics say. These have had an impact on my childhood and I can watch these a 1000 times and love it the same as I did when it came out! Honestly would have been a great ending for the Michael Bay vision for the transformer universe!"
    },
    {
      "rating": "4/5",
      "review": "Another awesome and action packed transformers movie great to watch especially with blu Ray with good surround sound!"
    },
    {
      "rating": "3/5",
      "review": "Once again, the humans are the downfall of this visually stunning action packed film."
    },
    {
      "rating": "3.5/5",
      "review": "This movie succeeds in being more enjoyable than it's predecessor, but doesn't get any better overall. The humor is bad and the first act is too long and boring. However, this movie earned it's 3.5 stars from me due to the amazing final battle that I would say is the best in the series so far!"
    },
    {
      "rating": "3.5/5",
      "review": "this movie is 0k I think the 4th is better."
    },
    {
      "rating": "2.5/5",
      "review": "It is better than Revenge of the Fallen and Shia LaBeouf's acting was better in this film but I would preferred Megan Fox over Rosie Huntington as the love interest. I also wished Megatron was the main villain."
    },
    {
      "rating": "1.5/5",
      "review": "It improves over the second film in many things; however, it is still a pretty bad movie."
    },
    {
      "rating": "2/5",
      "review": "Transformers 3 is even WORSE than the Revenge Of The Fallen. It is so stupid the entire duration. The Characters, The Story and the Cinematography are all terrible."
    },
    {
      "rating": "2.5/5",
      "review": "Was long, loud and did lose me along the scenes with it's not so understandable plot but I must admit the action scenes and voice performances (better than the physical performances) were spectacular."
    },
    {
      "rating": "0.5/5",
      "review": "real bad bayformers movie. stupid humor and acting"
    },
    {
      "rating": "4/5",
      "review": "The best movie released in the franchise."
    },
    {
      "rating": "4.5/5",
      "review": "After what can be considered a shallow reboot of protagonist following the release of Age of Extinction and the Last Knight, it is clear the franchise died with the departure of Shia LaBeouf, as he gives his final performance excelling in expression and emotion. Amazing supporting performances by John Turturro, Tyrese Gibson, John Malkovich and even Kevin Dunn/Julie White who yet again manage to give such strong characterisation in such little screen time, not to mention the strong voice acting cast. What makes this movie standout however compared to its subsequent new movies is Steve Jablonsky's score of music. Managing to give both highly emotional and dramatic orchestra, only adding to the scenes giving them nothing but pure emotion. Much like movies such as Tron Legacy I think you will find this film as a diamond in the making which will hopefully start to get some of the appreciation it deserves."
    },
    {
      "rating": "5/5",
      "review": "The Best Transformers Movie In My Opion"
    },
    {
      "rating": "4/5",
      "review": "it may not be the perfect movie but it has a great story involving the mythology of transformers with space bridges and the betrayal of the sentinel prime, in addition to several moments of incredible emotion and action serving as a great ending to the trilogy"
    },
    {
      "rating": "3/5",
      "review": "This film gives me very mixed feelings. It's better than the second one, which I suppose doesn't really say much. There's also a lot of forced fan service in the form of characters that don't bare any resemblance to their source material counterparts. The action is pretty fun, and the score and effects are great as always. Just another typical Bayformers film, but it's closer to okay than it is to garbage."
    },
    {
      "rating": "3.5/5",
      "review": "It's an improvement over it's predecessor. Stick to action and transformers. Not human stereotypes."
    },
    {
      "rating": "5/5",
      "review": "Been my favorite movie and franchise for years"
    },
    {
      "rating": "2/5",
      "review": "Michael bay just keeps throwing money at something and its not helping"
    },
    {
      "rating": "2/5",
      "review": "Too much craziness and too long."
    },
    {
      "rating": "4/5",
      "review": "Transformers dark of the moon fixes some mistakes of his predecessor ROFT, but it still fails at the human plot. there are so many amazing scenes, not so silly like the last one, it has a good plot, but no an Oscar winner one. Also it keeps making the same mistakes as the previous ones. But if you enjoyed the last two, you will love this one. A summer movie good as the first one"
    },
    {
      "rating": "3/5",
      "review": "Better than Revenge of the Fallen, though the plot is still a bit of a clusterfuck. But hey, I think it did a decent job wrapping up the then trilogy of Transformers live action movies. Now if only it stayed as a trilogy."
    },
    {
      "rating": "2.5/5",
      "review": "This Movie was not Horrible. It was certainly better than its predecessor. But Not what it could have been."
    },
    {
      "rating": "1/5",
      "review": "Only a little better than the first one and I rated Transformers 1 a half a star."
    },
    {
      "rating": "5/5",
      "review": "The 3rd installment of the Transformers film franchise had intense action sequences and great visual effects. In my honest opinion, Dark of the Moon is undoubtedly one of the best live-action TF movies of all time. Its certainly more enjoyable to watch than Revenge of the Fallen."
    },
    {
      "rating": "1/5",
      "review": "Another boring installment in the tiring franchise, the only memorable moments from Dark of the Moon was the Sentinel-Optimus rivalry and nothing else. The movie was just loaded with loud and heavy CGI driven action to hide its heartlessness"
    },
    {
      "rating": "4/5",
      "review": "Not as fun as the first one, but definitely a step up from Revenge of the Fallen and a fine way to end a trilogy of Shia Lebouf."
    },
    {
      "rating": "3.5/5",
      "review": "Better than the Revenge of the Fallen. But the plot is literally the same, bringing Cybertron back. But this time a little bit better"
    },
    {
      "rating": "5/5",
      "review": "Super underrated amazing movie my personal favorite!!!"
    },
    {
      "rating": "3.5/5",
      "review": "After watching Revenge of The Fallen, I felt empty. However, Dark of The Moon rejuvenated my spirits, this movie is a good one! The script has some issues and a bit of a bloated run time, besides that it's very impressive. 3.5/5"
    },
    {
      "rating": "4/5",
      "review": "Characters based from a children show and aligning it with historical events is not a bad idea, sure the plot and the direction may be confusing but it concludes to what children would have expected, and this time the special effects were improved"
    },
    {
      "rating": "5/5",
      "review": "The best movie of 2011, Transformers dark of the Moon is so incredible"
    },
    {
      "rating": "5/5",
      "review": "For every movie that exists, there is always one that doesn't have a story that flows great, but is still a fucking awesome movie. Transformers: Dark of the Moon, in my opinion, is a prime example of this. I am not someone who hates Michael Bay, nor am I someone who will take shits on his movies just because they're his movies. Say what you will about how he crafts stories, whether good or bad, he is excellent at incorporating special effects and sound design into his films. And, with this movie, it actually seems like he tried to make a good movie, and in my opinion, he did. This movie is extremely entertaining, badass, epic and technically well-assembled. Even the story, while convoluted as hell, seems more cohesive than the other Transformers movies (except maybe the first one). The first Transformers and this one are the two ones I genuinely love, but I think DOTM is the superior one."
    },
    {
      "rating": "3.5/5",
      "review": "Bay's live-action Transformers movies at its finest. Definitely the most cohesive and entertaining Transformers film made for the big screen bar the original 07' film. Spectacular CGI and a riveting score. Modern blockbuster at its finest. Yes, even before \"The Avengers\"."
    },
    {
      "rating": "2.5/5",
      "review": "This movie is the same level as the first one, but that mean women objectification."
    },
    {
      "rating": "5/5",
      "review": "Underrated so much I loved it I definitely recommend it a step up from the last disappointment this gets an A-"
    },
    {
      "rating": "2/5",
      "review": "While if features decent action, it's more of the same Michael Bay action snore fest."
    },
    {
      "rating": "3/5",
      "review": "Dark Of The Moon has some good qualities like the performance from Shia LaBeouf, the impressive CGI, and some good soundtracks. Unfortunatley... its not enough to say this movie is good so much as, well... meh. Better than Revenge Of The Fallen, thats for sure."
    },
    {
      "rating": "1.5/5",
      "review": "The third film in the Transformers franchise manages to relevel some of the problems of the previous film, or just seeks a way to mask the problems of its flawed, poorly directed plot with action scenes that offer the same as expected, while setting the stage for ridiculous performances of his new (and uninteresting) characters. If compared to the second film, it may even represent a slight improvement, not that it means much, especially for the standards established so far."
    },
    {
      "rating": "5/5",
      "review": "Movie was great with lots of explosions, action, some violence. Storyline was weak, but the special effects/cgi make up for it"
    },
    {
      "rating": "5/5",
      "review": "the best movie of 2011"
    },
    {
      "rating": "3/5",
      "review": "I rewatched it just now. When i first saw this movie, i was so disappointed. But for know, it's guilty pleasure for me. Visual effect was just enormous. But plot was litte bit messy. And biggest problem was the wasting of characters such as the shockwave, starscream, and megatron. Overall, it is mediocre for me. My score would be 5.7/10"
    },
    {
      "rating": "4/5",
      "review": "Recieves too much hate by critics bandwagon fans of just hating a franchise it is better than most movies in the sci-fi area and will stand the test of time"
    },
    {
      "rating": "0.5/5",
      "review": "Actually better then the 2nd movie, but at this point I feel like I'm giving the director credit for doing the bare minimum that a director is suppose to do."
    },
    {
      "rating": "4/5",
      "review": "This is the best out of the micheal bay movies. Great action especially when shockwave is going through the building that looked insane"
    },
    {
      "rating": "1.5/5",
      "review": "Itï¿ 1/2 1/2(TM)s hard to pick which is more gratuitous: The incompetent CGI rendering, the senseless and overlong action sequences, the blatant product placement, the deplorable political pandering trying to have it every which way, or the unmistakable misogynyï¿ 1/2 1/2\"but then again, why choose just one, when the combination is what makes this trash so god awful?"
    },
    {
      "rating": "4/5",
      "review": "At the beginning it is boring but, after the first half of the movie all the action peices in the trailers commence"
    },
    {
      "rating": "3.5/5",
      "review": "Whether you're tired of the bayhem and the degreasing of the story, or you embrace it as an emotionally climatic make up for the predecessor, you may or may not enjoy the visually stunning action and the special actor appearances, stretching you already from where you stand. Star rating may change with 1 and 5."
    },
    {
      "rating": "5/5",
      "review": "Best Action Movie of all time"
    },
    {
      "rating": "3.5/5",
      "review": "The third movie in the franchise that is better than the sequel but still is not as good as the original."
    },
    {
      "rating": "3/5",
      "review": "Could have done with more fighting robots & some proper T&A"
    },
    {
      "rating": "5/5",
      "review": "i like tf3 dark of the moon the action is great and you can watch it over and over again"
    },
    {
      "rating": "5/5",
      "review": "pretty decent with shockwave megatron and sentinel prime v autobots cannot get better"
    },
    {
      "rating": "2/5",
      "review": "Wow, I knew what I was going to watch but it was bad. Two stars for the visual graphics. Looking for a fun action movie, I suggest you skip it. Too many draggy spots. I was skipping sections of the movie to speed through it."
    },
    {
      "rating": "4.5/5",
      "review": "Wow! What a movie. For a transformers movie it’s outstanding but for an actual movie it’s fun you know it’s pretty good it has its flaws I won’t argue with that but just how enjoyable this movie is I barely remember them. My biggest issue is the first half of this movie the pacing is not good it feels like it takes so long to get to the second half and it’s not just the first half I really like the first 20 minutes of this movie I love it’s just Sam getting a job and his relationship troubles I don’t care about. That whole like 45 minutes to an hour of the movie just didn’t work for me it relies on micheal bays stupid hummer and all these characters and subplots that we just don’t need. But the second half is everything you could want out of a micheal bay transformers movie. I’m ganna give Transformers: Dark Of The Moon an (A)"
    },
    {
      "rating": "5/5",
      "review": "i loved shockwave and megatron sentiel prime i kinda liked and optimus prime is just AMAZING"
    },
    {
      "rating": "2/5",
      "review": "Still another awful Bayformers sequel. Dark of the Moon is better than Revenge of the Fallen, but it is still an awful movie. The lame humans still annoyingly hog up too much screentime. The character development for the Transformers is horrible. Shockwave was an horribly disappointing villain and was treated like shit. Shockwave? More like Shitwave. I can never forgive Michael Bay for what he did to Shockwave. Bay raped Shockwave and turned him into a mumbling pussy who barely talks that doesn't really pose a major threat. Frank Welker was severely miscast as the voice of Shockwave. Shockwave's voice was terrible. He was also badly cast as the voice of Soundwave. Steve Blum should've been Shockwave's voice actor. In the third act, he was horribly and embarrassingly getting killed by a bunch of human soliders!!! WTF Michael Bay? Shockwave ended up losing and dying because of a stupid parachute! I'm not kidding, one of the human soldiers skydived and activated his parachute and accidentally got his parachute tangled around Shockwave when he was shooting (I honestly didn't even know what the hell he was shooting at because of Bay's god-awful camerawork) which stupidly somehow caused him to get disoriented. Then a bunch of explosions literally came out of nowhere near Shockwave severely damaging him. Then another human soldier lands on Shockwave's shoulder and shoots a sticky detonator on his mouth. Then the sticky detonator blows up some of Shockwave's mouth off causing him to scream in agony. Then a bunch of human soldiers were spraying hundreds of bullets at him from inside a building while he was still getting bombarded by countless explosions. Then the Wreckers were shooting bullets at him too and damaging him to the point where his eyeball was loose and started falling off. Then Shockwave screamed \"mommy\" and got shot from a bunch of more human soldiers shooting explosives at him with their grenade launchers. Then Optimus Prime finally comes and finishes Shockwave off and kills him. Describing Shockwave's death was just PAINFUL. Starscream dies from another stupid, cheap, and unfair death too. Starscream's death was arguably the worst death in the entire movie and not just the entire movie...but also the worst death in the entire Bayformers franchise! Starscream ends up dying by the hands of fucking Sam Witwicky!!! Seriously, MIchael Bay? WTF is wrong with you? It was the stupidest, corniest, most disappointing, and most embarrassing death ever! Then Soundwave's death was the least bad, but still a badly executed death. He gets killed all because he got distracted by a falling ship being torn apart and destroyed by two tiny robots. Bumblebee suddenly does sort of a roundhouse-like kick on Soundwave and then soon decapitates him by shooting his head off from inside his chest. Soundwave's voice wasn't even right. Soundwave is supposed to be speak with no emotions like he always did in the G1 series. The voice performance for Soundwave did not fit his character. Then Sentinel Prime (who ends up being the real main villain of the film) dies because Megatron shoots him a bunch of times when he wasn't looking while he was about to kill Optimus by stabbing him with his sword. So Megatron beats up Sentinel when he least expected it and breaks off his helmet. So Megatron unintentionally saved Optimus' life from Sentinel. Then Optimus gets up with only one arm and ends up easily and quickly killing Megatron by ripping his head off with his sword. Megatron was such an idiot. If he hadn't hurt Sentinel then Optimus would've died and his plan to rebuild their home planet Cybertron by taking all of Earth's resources and technology would have succeeded. Bay ruined Megatron. Megatron barely did anything in this movie. So after Megatron dies, Optimus ends up killing Sentinel by shooting his head with Megatron's weapon. All of the Decepticons and Sentinel Prime died in cheap and unfair ways. The only good thing about this movie was the great soundtrack. Rating: 3/10"
    },
    {
      "rating": "3.5/5",
      "review": "While the plot may be slow, the story is interesting in fact and the final battle is very well developed."
    },
    {
      "rating": "2.5/5",
      "review": "It's a thrill to have Leonard Nimoy among the voice cast of Transformers: Dark of the Moon, just like he was in the 1980s animated movie, and as usual for a Transformers film it's filled with talented actors playing quirky characters over-enthusiastically, though Huntington-Whiteley is unimpressive as the new love interest. Amongst all the CGI carnage our human protagonists somehow don't get squashed by falling buildings or evil Decepticons, and the supposedly heroic Optimus Prime slices up his enemies with much relish (\"We will kill them all!\" he exclaims at one point). The never-ending battle sequences here will test the patience of even the biggest Transformers fan."
    },
    {
      "rating": "5/5",
      "review": "Esta si es una pelicula de Transformers, se pasaron con los efectos especiales e visuales,buen trabajo con la musica en serio, lo que me sorprende mas es la historia me agarra la historia, las muertes de mis personajes favoritos me entristece,no hay mucho protagonismo humano eso esta bien, el mayor problema es el excepso de humor bueno en solo fue en una escena y en el resto de la pelicula no paso 10/10"
    },
    {
      "rating": "2.5/5",
      "review": "Some parts of the movie were cool but most of it is just a mess"
    },
    {
      "rating": "2.5/5",
      "review": "Eh... it's pretty boring this time around."
    },
    {
      "rating": "3/5",
      "review": "Michael Bay does a fantastic job with special effects but his story telling .... just better than terrible."
    },
    {
      "rating": "5/5",
      "review": "its 2hours30mins of action fun and little bit of humor"
    },
    {
      "rating": "5/5",
      "review": "everybody loved sentinal prime megatron and cybertron"
    },
    {
      "rating": "1.5/5",
      "review": "Dark of The moon es la culminación mediocre de unciclo de esta saga que nadie Pidió , Este film pierde todo concepto de interes basico al espectador que logra ser hasta aburrido apesar de la gran cantidad de explosiones sin sentido que realiza Michael bay."
    },
    {
      "rating": "3.5/5",
      "review": "In my opinion the best one since the first one. Love this movie to death. Some of the best action scenes in the franchise. If you like the first one you will like this one."
    },
    {
      "rating": "2.5/5",
      "review": "I liked it. it was fine :)"
    },
    {
      "rating": "5/5",
      "review": "OH CMON MAN, DON’T HATE ON THIS MOVIE"
    },
    {
      "rating": "5/5",
      "review": "I Personally Love These Movies And Can Clearly Say Without A Doubt, This Is The Best One Of The Franchise. It's Action Scenes Are Beyond Compare, The CGI Is Second Only To The First One, It's Story Isn't As Concrete As RotF But Provides An In-Depth Feel. The Soundtrack Doubles And May At Some Points Even Triple The Emotion In A Scene. This Is Without A Doubt Micheal Bay's Best Movie. Especially Because The Action Is On It's Biggest Scale Of The Franchise, An Entire City. The Overall Feel Of The Movie Is Totally Different From The Other 2. The Acting Represents This Movie In So Many Different Ways That It Changes The Feel Of The Movie Nearly Every 20-30 Minutes. Overall, This Is Most Definitely A Need-To-See Movie Of Summer 2011."
    },
    {
      "rating": "3.5/5",
      "review": "its better than rotf"
    },
    {
      "rating": "2/5",
      "review": "Still a bad movie where you don't know what's going on."
    },
    {
      "rating": "1.5/5",
      "review": "Awful movie! Sentinel is a traitor who turns back on his own side"
    },
    {
      "rating": "4/5",
      "review": "Nice bounce back, but still lacked the fun of the first, perhaps because it started getting too dark"
    },
    {
      "rating": "4/5",
      "review": "My favorite of the Transformers movies. Story is decent (best of the films) and the action sequences were outstanding, especially in 3D."
    },
    {
      "rating": "0.5/5",
      "review": "Extremely migraine-inducing. So much noise, so much cringe. It was too much to handle in the theater."
    },
    {
      "rating": "3/5",
      "review": "Those who know me know that I cannot stand Michael Bay. Not that I know him personally, but he has exhibited quite a bit of douchery over the years. However, I wouldn't judge his films because of that. The guy clearly is talented, extremely so. Quite possibly the best action director there is. My problem with him is the same problem I have with most of America. The masses are quite dumb and no depth to them. So goes the typical Michael Bay film. It's remarkable how someone so visually talented has absolutely no ability to actually convey any realistic emotion or make you feel at all for a character. Just very surface portrayals. All that being said, Transformers: Dark of the Moon is his best Transformers film. He even tells a much better story than either of his previous Transformers films, or any of his other non-Transformers films, for that matter. The action is not just good, it's freaking spectacular. The amount of detail and realism in his action is absolutely unmatched. This was definitely what a summer film is supposed to be. Considering I've seen every blockbuster this year so far, the action in this film surpass the others by miles. As a Transformers fan as a kid, seeing Shockwave and Laserbeak play such prominent roles had my 11 year old pants on fire! Sadly, though, the nearly-40 year-old in me was critical of the unnecessary length, the gratuitous/immature language and the vapid ending. However, it all depends on what you are looking for in a summer film and, if it's what most people want, I would highly recommend it. It will definitely satisfy the masses and impress budding filmmakers."
    },
    {
      "rating": "5/5",
      "review": "This is the best movie in the whole series. The CGI was amazing. The joke are funny unlike the previous one. You have to see this. The transformers the movie from the 80s seems bad compare to this"
    },
    {
      "rating": "2/5",
      "review": "Almost there! But still bad movie"
    },
    {
      "rating": "3/5",
      "review": "It's Script Is Messy. But OH MY GOD, The 3rd Act Is FANTASTIC!!!"
    },
    {
      "rating": "4/5",
      "review": "Michael Bays third installment comes off as a total improvement over the last one but still not as good and enjoyable as the first one due to its first two acts that happen to be extremely painful and boring with a number of subplots, sam has a new girlfriend portrayed by rosie huntington whiteley, he needs to find a job in order to suport her, there is a love triangle drama going on between sam, rosie and patrick dempsey, a series of discoveries over things about sentinel primes moonlanding etc, this is all stuff that nobody ever asked for in a transformers film, we all just want to see the transformers themselves on screen, however the last is basically a 34 minute string of nonstop action and explosions and becomes a really entertaining action film but still its another disapointing mess that has praiseworthy aspects such as its cgi and special effects nevertheless its far more watchable than the second and its definitely worth buying on blue ray, its not a terrible movie at all but comes off as mediocre."
    },
    {
      "rating": "2/5",
      "review": "It's an awful first hour and a half, but the rest gets bonkers."
    },
    {
      "rating": "2/5",
      "review": "A lot better than it's predecessors, \"Dark of the Moon\" offers a better story and great visuals. It's still not a \"good\" film though."
    },
    {
      "rating": "3.5/5",
      "review": "??????????????????????????????? 7/10 ???????????????????????????"
    },
    {
      "rating": "3/5",
      "review": "6/10 Dark of the Moon is stupid and poorly acted. But it's much better than it's predecessor, with a faster pace and some pretty fun action sequences. And the special effects are still great."
    },
    {
      "rating": "5/5",
      "review": "This is without a doubt the best Transformers movie and one of the best movies EVER!!! So amazing, awesome, and excellent. The only thing is that Megan Fox isn't in it. But besides that, Transformers: Dark Of The Moon is a breathtaking masterpiece. Everyone in this movie was great. The action was great and awesome. It's SOOOO GOOD!! Definitely one of the best movies of all time."
    },
    {
      "rating": "5/5",
      "review": "Transformers Dark of the Moon had amazing action scenes and it is an awesome movie to watch."
    },
    {
      "rating": "5/5",
      "review": "I didn't think they could do better but they did. The story is deep and immersive and won't let you go. The effects are brilliant as always and they 'bots characters are brought out a little more. A fun ride as always."
    },
    {
      "rating": "1/5",
      "review": "while this third installment of Transformers maybe slightly better than the previous film, it still lacks story, running time and overlong action scenes"
    },
    {
      "rating": "5/5",
      "review": "good but didnt like how weak megatron was made him look like a coward"
    },
    {
      "rating": "3.5/5",
      "review": "Dark of the Moon enhances its predecessor on many levels but the inconsistent screenplay and 40% of the lacking performances aren't enough to strive the franchise back to the way it's originally meant to be."
    },
    {
      "rating": "1.5/5",
      "review": "Stop making these movies!"
    },
    {
      "rating": "4.5/5",
      "review": "The sequel the first film deserved."
    },
    {
      "rating": "0.5/5",
      "review": "Yet another sad reflection on today's society; Michael Bay continuously makes atrociously horrific trash, and humanity keeps paying him hard earned money for more; the lunacy of the human race is astonishing..."
    },
    {
      "rating": "5/5",
      "review": "Packed with humor and action, the whole family will treasure!"
    },
    {
      "rating": "3.5/5",
      "review": "I like Sentinel Prime(A deal has to be made with Megatron) nice touch store line good with be buying a digital copy!"
    },
    {
      "rating": "1.5/5",
      "review": "Unlike the other \"Transformers\" movies, this one is boring."
    },
    {
      "rating": "1/5",
      "review": "Had a more better storyline than the second movie, but it's still pretty bad. Awesome CGI doe."
    },
    {
      "rating": "3.5/5",
      "review": "The last-half of this movie alone makes this movie really fun."
    },
    {
      "rating": "3/5",
      "review": "better than the 2nd one. Still less transformers. too many humans rescuing transformers."
    },
    {
      "rating": "2/5",
      "review": "One star for the mildly improved storyline compared to Revenge of the Fallen. The creative added backstory generates the slight anticipation/expectations, only to screw up the storytelling midway through the movie. The animation teams deserve a star for the special visual effects and their hard work to bring the characters to life. Other than that, it is a recycle of the previous two movies, and a money making machine (especially for China)."
    },
    {
      "rating": "5/5",
      "review": "Transformers Dark of the Moon is one of the best third movie ever made with new characters, and new fun-of-action in it."
    },
    {
      "rating": "0.5/5",
      "review": "Simply awful https://crazydiscostu.wordpress.com/2017/02/05/why-transformers-the-movie-1986-is-the-only-transformers-film-that-matters/"
    },
    {
      "rating": "0.5/5",
      "review": "Another in the series of Michael Bay filmography that's specifically made to make a shitton of money in China."
    },
    {
      "rating": "4/5",
      "review": "The battle of Chicago full scene is so adrenaline awesome."
    },
    {
      "rating": "3.5/5",
      "review": "Great and also more about the transformers and less about Sam's life also more action at least???"
    },
    {
      "rating": "5/5",
      "review": "A very emotional, action packed fun and entertaining movie is a welcomed improvement over revenge of the fallen"
    },
    {
      "rating": "5/5",
      "review": "My only complaint is the fact that Megan Fox had to go."
    },
    {
      "rating": "3.5/5",
      "review": "It's really almost the same movie as the last two just with a slightly different plot, but thankfully, it doesn't have as much of the annoying human characters, the humor is toned down, it actually tries to take itself more serious, and has a lot of cool throw downs near the end. A fine movie to watch if want to turn your brain off and see a bunch of giant robots fighting with big explosions."
    },
    {
      "rating": "2.5/5",
      "review": "this movie has many flaws: -weak megatron -they made shockwave not look cool at all or did anything cool. He doesn't even talk despite he talks in the good transformers video games (transformers fall of cybertron) -action is not great or as exciting like TF1 even TF2. +some action is cool....some. +optimus kicks butt like never before. he does the most exciting things than any other movie.... +plot is better than TF2 but not as good or close to TF1 bottom line: a medicore or max, an average movie."
    },
    {
      "rating": "3.5/5",
      "review": "While perhaps no Transformers sequel can ever live up to the first film, Dark of the Moon is pretty much the best Transformers sequel to date. An improvement over the mostly awful \"yet-I-felt-the-need-to-give-it-two-point-five-stars-out-of-generosity\" Revenge of the Fallen. Michael Bay may be a director who feasts upon the money he makes out of all of you but at least he listens to your complaints when he wants to. He gets rid of the racist twins from the last movie and gives Optimus Prime more screen time. It's overlong, yes. It's story isn't any different. The Decepticons wanting to do bad things to humanity because they're belived to be beyond saving. Megan Fox's replacement is not more than an attractive damsel in distress. Yet this time, it actually entertains. The special effects are as impressive as always, the action sequences are mind-blowingly awesome with a lot better execution than in the repetitive ones in RotF and there's some really great shots. Makes me wish I could've seen the movie back in 2011 in 3D. You know, when 3D was still worth your while. There are some really cool shots that must've been amazing to see in the third dimension. Perhaps the best performances are from the robots rather than the actual humans but this one still manages to pack in enough entertainment value to cover its exhaustingly overlong running time. This one could appear one day, on a Top 10 list of my favourite Michael Bay movies. And I mean that as in either as a director or as a producer. However, that day is yet to come."
    },
    {
      "rating": "3.5/5",
      "review": "This movie was OK. Of course you got the same things as usual from the Bay films: the explosions, the hot ladies, and so on. But fun fact: this film had 3 actors that passed away unfortunately: Leonard Nimoy, Franscsco Quinn and George Coe. I kind of liked Dino/Mirage in the movie. Que/Wheeljack however though really bothering me. Bay made him from one of the most bad*** scientists into an Einstein stereotype; I don't mean to disrespect George Coe who voiced Que, but Bay did choose a poor decision to insult one of our favorite G1 Autobots and turn him into Robo-Einstein-esc guy. And people are going to disagree, but I LOVE Sentinel Prime in this movie. Yes he killed Ironhide, be also killed Skids and Mudflap in the comics along with him. His voice and design is great and even his fire truck alt mode is cool. And yet the Wreckers were pretty enjoyable characters too. But one thing I didn't like in the movie is HOW BAY TREATED SHOCKWAVE!!! This guy appeared as an easter egg in ROTF, AND YET BAY JUST POINTLESSLY ADDED HIM INTO THE MOVIE, and as a result, HE DIDN'T DO ANYTHING IN THE MOVIE EXCEPT SHOOTING OPTIMUS AND TANGLING HIM IN WIRES, and of course, DIE!!! He didn't even attack Chernobyl, he just had his pet worm to DO ALL THE WORK FOR HIM!!! SCREW YOU MICHAEL BAY, YOU PIECE OF-alright I'll stop now. Overall, the movie was OK."
    },
    {
      "rating": "3.5/5",
      "review": "An exciting and action filled movie that drags a bit at the beginning and until the middle of the film. The action and story is good with hardly a dull moment after it reaches the half way point. The movie has quite a few emotional scenes that are executed well, with the exception of a couple containing Sam and his new girlfriend we don't care about. Tone and pacing is a bit of an issue at some points as well, but it doesn't hold the movie back too much. It has a lot of flaws, but is very enjoyable. It makes for a better movie than Revenge of the Fallen and has more Transformer action than the first one of the series."
    },
    {
      "rating": "4/5",
      "review": "as far as Revenge of the fallen, everything is getting better. I love the Transformers franchise, but one wrong thing with this. Why did they replace the girl?"
    },
    {
      "rating": "3.5/5",
      "review": "This is my favorite Transformers because it's so absurd and ridiculous and it knows it! Only thing that would've made it better was the return of Megan Fox. Prime and Bumblebee still rule. Soundwave finally got some decent screen time. Shia Lebouf is really good in this movie. No, no, you are wrong and I am right. Watch it again, put your prejudice against the franchise away and just watch him. He feels real in a movie that is nowhere near. And he's really funny, especially when he is wiggin out."
    },
    {
      "rating": "5/5",
      "review": "One of the last but better Transformers film with an easy to follow plot with twists and an epic battle scene in the last hour! After this, the series just isn't that entertaining anymore."
    },
    {
      "rating": "2/5",
      "review": "Entertaining enough, but really stupid."
    },
    {
      "rating": "3.5/5",
      "review": "While it's not a great film it is a step up from the last one. I enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "Not my favorite Transformers movie, but it was still amazing!!!!!"
    },
    {
      "rating": "1/5",
      "review": "Well I fell asleep during this movie. I'll come back to review it when I see it again."
    },
    {
      "rating": "5/5",
      "review": "The best in the franchise! A mix of phenomenal action as well as a great story! If you could only watch one of the Michael Bay directed Transformers films, I'd 100% say watch this one!"
    },
    {
      "rating": "1.5/5",
      "review": "WHAT I LIKED: This is undoubtedly yet another movie that you can sit and drool at without engaging your brain, which can certainly be appealing if a) you're 5 years old, or b) you're after a dumb action movie to eat popcorn and think about other things to. That's totally fine, and there's certainly plenty here to allow all that as Michael Bay delivers yet more mindless action and huge spectacle-sequences backed up by a great score from Steve Jablonsky. WHAT I DIDN'T LIKE: Sadly though, copy and paste is yet again all that these movies are by now, and that's all they deserve in return as every installment emulates all the flaws and dull-ness of its predecessor. As a result, there's again absolutely nothing to engage you here - the characters are vastly under-written and have less life than the robots that dominate the screen (which really is saying something), the story is an over-serious and terribly complicated maze of un-interesting sub-plots that noone really cares about, and the product placement of actual products is almost as startling as the placement of women, who may as well be 'products' in the eyes of the film itself. As a result, you'll end up truly disengaged, uninterested and slightly wincing as the film proceeds for the entirety of its hugely overlong run-time here. VERDICT: Another exceedingly dull and uninteresting film for me; 'Transformers: Dark of the Moon' is exactly the same as its predecessor. Come on Michael Bay, you can do better than this."
    },
    {
      "rating": "3.5/5",
      "review": "Out of the whole franchise this is the one that did really well for me, it's far from being perfect but I'm happy with what came out."
    },
    {
      "rating": "5/5",
      "review": "A wonderful film with amazing action you never get tired trust me"
    },
    {
      "rating": "3/5",
      "review": "The first half of this movie is pretty boring, we watch as Sam tries to get a job and he realizes that he wants to be with the Transformers even though in the last movie he just wanted to get away from them. The last 45 mins is filled with mindless fun action that will make you cheer."
    },
    {
      "rating": "5/5",
      "review": "Only thing good about this film the song was intense sentinel prime megatron shock wave and can't forget optimus prime"
    },
    {
      "rating": "3/5",
      "review": "Dark of the Moon is an improvement over the previous film. The CGI is once again amazing, and the 3-D special effects are marvelous. Unfortunately, the film is overlong, the story is thin, and the acting needs improvement."
    },
    {
      "rating": "5/5",
      "review": "An action packed ride with a great villain"
    },
    {
      "rating": "0.5/5",
      "review": "Way too high to be on this list: Critics: 23% Viewers: 34%"
    },
    {
      "rating": "2.5/5",
      "review": "Great for a Transformers movie."
    },
    {
      "rating": "4.5/5",
      "review": "By far the best sequel and my personal favorite of the four films, this movie has a far more coherent plot than Revenge of the Fallen with less of the childish profanity and cringey dialogue. The level of destruction in this film dwarfs the first two and the plot twist involving Sentinel Prime is great. The opening shot of Cybertron with Optimus Prime's narration was incredible as well. If you're a fan of effects-driven action like myself, this film takes it to a level few films have ever gone before."
    },
    {
      "rating": "2/5",
      "review": "Nice, you're doing the same thing over again and you're ripping of Star Trek 2: The Wrath of Khan. My Favorite movie of all time."
    },
    {
      "rating": "2.5/5",
      "review": "It is a big improvement over its sequel. However, it is dragged down by its run time and commercial like moments that can exhaust."
    },
    {
      "rating": "4.5/5",
      "review": "Transformers: Dark of the Moon is Awesome in 3D to watch :)"
    },
    {
      "rating": "2/5",
      "review": "Dark Of the Moon is better, but still the same stuff we are used to at this point"
    },
    {
      "rating": "2.5/5",
      "review": "Possibly the best Transformers movie (if one of them even deserves such a title), this film still has a terrible lead actor and way too much incomprehensible metal on metal explosion-y action to be anything better than a 2 1/2 star experience."
    },
    {
      "rating": "5/5",
      "review": "Great film action packed but they rushed the ending by killing the bad guys too quick"
    },
    {
      "rating": "3/5",
      "review": "Solid action outweighs a poor script in Michael Bay's most Michael Bay transformers movie yet."
    },
    {
      "rating": "5/5",
      "review": "Great film loads of action but they just randomly put megatron there and he was doing nothing I think it should of been megatron fighting optimus prime not sentinel would of been a better storyline in my opinion."
    },
    {
      "rating": "2/5",
      "review": "very bad TF movie......"
    },
    {
      "rating": "5/5",
      "review": "Transformers dark of the moon was good amazing action transformers the last knight will be like a part 2"
    },
    {
      "rating": "5/5",
      "review": "Loads of action but I like tf2 better 3rd act was great"
    },
    {
      "rating": "0.5/5",
      "review": "please, PLEASE stop making letting Micheal Bay make Transformers and TMNT movies."
    },
    {
      "rating": "3/5",
      "review": "With dazzling special effects, an action-packed plot, and amazing-as-always character designs, TRANSFORMERS: DARK OF THE MOON will be the closest you can get to the original, yet once again has a bloated running time."
    },
    {
      "rating": "3/5",
      "review": "The dialogue is abysmal, as expected from a Bay Transformers flick, but the visuals are top-notch and the story is slightly more coherent than the other Transformers movies."
    },
    {
      "rating": "5/5",
      "review": "This franchise still gives me amazing thrills. I am in the minority, i know, but i have so much fun with these movies"
    },
    {
      "rating": "5/5",
      "review": "Good film not the best"
    },
    {
      "rating": "4/5",
      "review": "Definitely the most sophisticated film of the bunch. A lot of action and adventure with less sexual jokes. Thank You!"
    },
    {
      "rating": "4.5/5",
      "review": "Out of the first three Transformers movies I have seen, The second one (Revenge of the Fallen) was my favorite, followed by the first film as my second-favorite, leaving this sequel on third place. The one and only problem I found with this movie was they gave too little information on important parts, & way too much information on unnecessary parts."
    },
    {
      "rating": "5/5",
      "review": "It out surpassed the first two. And I think it's the best one in the series."
    },
    {
      "rating": "1/5",
      "review": "Honestly, for the first 1.5 hours, I thought it was about the same as its predecessors. Moderate to passable acting, nice soundtrack, average story... until we hit Chicago, which is where the crap hits the fan, probably literally too. Although the \"twist\" wasn't exactly deadly given away, it was pretty evident early in the film what's really going down: it's just matter of how and when. Unfortunately, that 1.5 hour-ish point is precisely where the action and plot decide to go completely barmy. Gone is the averagely welcome, and here is where the rubber meets the road: hackneyed, ugly, and absurd action scenes join laughably pathetic plot elements that swarm the viewer in droves, dragging down what could have been an otherwise acceptable movie. It's downright hideous, and seems to have been thrown in simply for the expressed purpose of filling the last 60 or so minutes of the movie. I could honestly weep for the poor souls that think this movie is at all representative of the qualities found in the Transformers franchise, even the comics. If you don't \"have to see\" this movie, then don't. You won't regret missing it."
    },
    {
      "rating": "3/5",
      "review": "It's good movie to watch"
    },
    {
      "rating": "2.5/5",
      "review": "Great acting enjoyed it but it was really missing plot details that were important and had to many details that were completely useless."
    },
    {
      "rating": "3.5/5",
      "review": "Probably the best movie in the Michael Bay series."
    },
    {
      "rating": "3/5",
      "review": "The third installment in the series is noticeably better than the second, even if it still faces similar problems that have continually plagued this franchise. Shia LaBeouf returns as Sam Witwicky in Transformers: Dark of the Moon. When a mysterious event from Earth's past erupts into the present day it threatens to bring a war to Earth so big that the Transformers alone will not be able to save us. The \"Transformers\" franchise has faced its ups and downs, albeit mostly downs. But with the third installment, they looked to change a few things up. If anything, all of those changes were really positive overall, but the writers still don't know how to capture that essence of these fun, alien robots and there's still something missing. Although it was a good step in the right direction for this franchise, there's still a lot of work to be done. Shia LaBeouf returns for the final time, reprising his role as Sam. As a a fan first and \"critic\" second, I still claim that Shia is a great actor. Although the roles and films he's been in aren't the brightest, it doesn't take away the fact that he's a great actor with a lot of talent. This is someone who can capture that emotional intensity of a role while really bringing out the true nature of the character at hand. I absolutely love Rosie Huntington-Whiteley, as she's a huge step up from Megan Fox. Not that Megan Fox is terrible, but she certainly wasn't the best. Hearing them cast a Victoria Secret Model as the leading female role raised some eyebrows, but she's a pretty decent actress overall and she was utilized much better than Fox's character was. John Turturro was still overused in this film and was much more of an annoyance than a help. His character is still annoying and bratty and he really serves no purpose. They do bring back the crew of Josh Duhamel and Tyrese Gibson, which is a nice continuity aspect for these films. The special effects, like always, are still fantastic. Despite the ridiculous overuse of firework explosions in random places, you still have to admit that everything looks fantastic. Everything from the transformers to the action, it all looks fantastic. This is a perfect example of the epicness that sci-fi movies should look like, and it's one of the strongest attributes the franchise has held. The story is a bit better than the previous film, but still a bit overdone and unfathomable at times. I mean, come on, bringing an entire planet over to Earth? How does that even work? How does that solve anything?? Minor spoiler there I guess, sorry. But despite some of those head-scratchers, I like how the story feels darker than any of the previous films. Even the trailers gave off this extremely dark vibe and although the film never really captured that, I liked the slight adjustment in tone. In the end, there's not much to say about this movie because I would just be repeating what I said about the other films. I feel like at this point, it's just how these movies execute because they all have very similar problems and very similar positives. I did enjoy this more than the second film but not more than the first, and that has to be some sort of consolidation. If you're a fan of the franchise, you'll like this movie. If not, this movie won't offer anything new and will probably just run your patience down to zero."
    },
    {
      "rating": "5/5",
      "review": "Love the last 20 mins"
    },
    {
      "rating": "5/5",
      "review": "brilliant one especially after revenge of the fallen not being that good"
    },
    {
      "rating": "5/5",
      "review": "Loved this movie! This and the first are the best films in the Transformers franchise!"
    },
    {
      "rating": "3/5",
      "review": "Far better than number two in the franchise. At the very least Dark of the Moon manages to work itself up closer to the fun of the first Transformers film."
    },
    {
      "rating": "2.5/5",
      "review": "The story is shitty as always but the action-packed third act is still pretty entertaining"
    },
    {
      "rating": "5/5",
      "review": "I only like this movie was cause of optimus prime rage"
    },
    {
      "rating": "4/5",
      "review": "Best transformers movie in the movie series by far. The performances are great, the action is jaw dropping and brutal. This film has emotional weight and stakes, something the others lacked. Optimus prime is a total beast in this movie. Shia returns as Sam and gives his best performance yet. Megatron and his minions are truly terrifying in this movie. I highly recommend this film."
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this film sentinel prime was good but I hated megatron cause of his form"
    },
    {
      "rating": "3.5/5",
      "review": "I actually quite like transformers: dark of the moon. it is without question a massive improvement over revenge of the fallen. before this movie came out, I was concerned but curious. the fact the megatron turned into a human truck was cool. the fact that the film introduced shockwave (even though he didn't do shit throughout), sentinel prime, and the wreckers. ratchet has a new paint job and the debut of wheeljack are good additions. Owens grade: B"
    },
    {
      "rating": "5/5",
      "review": "Loved it, Really fun movie to watch."
    },
    {
      "rating": "2.5/5",
      "review": "It's slightly better than the second movie. The actor who played Jeremey Wang was a big waste."
    },
    {
      "rating": "5/5",
      "review": "Best Transformers movie ever!"
    },
    {
      "rating": "3/5",
      "review": "The action is good and the plot receptive enough for the audience."
    },
    {
      "rating": "0.5/5",
      "review": "terrible movie... probably the worse thing I have watched in a LOOOOONG time"
    },
    {
      "rating": "4.5/5",
      "review": "Doesn't try to be anything other than a big brash special effects extravaganza and I love it."
    },
    {
      "rating": "3/5",
      "review": "Again, great CGI, but one more time the final action sequence goes on for WAY too long."
    },
    {
      "rating": "4/5",
      "review": "this movie is the definition of dumb fun"
    },
    {
      "rating": "5/5",
      "review": "I love all these movies and I just hope they keep making them"
    },
    {
      "rating": "4.5/5",
      "review": "Everything was awesome except the ausence of Megan Fox"
    },
    {
      "rating": "2.5/5",
      "review": "Transformer: Dark of the Moon an improvement, but it still the same as the first two."
    },
    {
      "rating": "3.5/5",
      "review": "Better than second movie by far. I believe its underestimated little should be in 40 and higher"
    },
    {
      "rating": "5/5",
      "review": "Transformers: Dark of the Moon is amazing and entertaining. Michael Bay picked Chicago as the perfect place to shoot this movie and it was a great pick by him. The plot of this movie is brilliant. Great job!! I would very much suggest this movie."
    },
    {
      "rating": "2.5/5",
      "review": "Una sceneggiatura sempre più banale e stupida fa da sfondo ad un film che eccelle in effetti speciali e sonori. Resta quindi coerente con quello che erano i primi due film: rumorosi, stupidi e incoerenti ma ricchi di sequenze d'azione dirette e coreografate a meraviglia, con effetti speciali eccezionali."
    },
    {
      "rating": "3.5/5",
      "review": "Another Bot movie at the same war just a different time."
    },
    {
      "rating": "1.5/5",
      "review": "Like all of the Transformers movies, the CGI is great, but CGI alone can not save a long, boring movie with a mediocre and similar plot as it's previous films."
    },
    {
      "rating": "1.5/5",
      "review": "Maybe a SLIGHT upgrade on the previous movie, but that's not saying much because its still barely worth watching."
    },
    {
      "rating": "4.5/5",
      "review": "I liked this film a lot and thought it was really fun."
    },
    {
      "rating": "4/5",
      "review": "My personal favorite in the series. The CGI and action scenes are terrific, and Steve Jablonsky's score is incredible. I also feel that Shia Labeouf isn't as annoying as he's previously been. This movie isn't for everyone, but if you're a fan of this series, you will definitely enjoy this one."
    },
    {
      "rating": "4/5",
      "review": "Everything likes me but i dont like that Megan For dont was here"
    },
    {
      "rating": "4/5",
      "review": "I think its an optional decision because this is the most practical and comedic if the entire blockbuster!"
    },
    {
      "rating": "2/5",
      "review": "Too many questions than answers. Does he write his screenplay on the set? With the set pieces and the thought process that has to go into the action sequences (which covers most of the movie) seems impossible for that.. Is he that genius where he shoots what he feels like and covers it up with VFX later? Does Chuck Norris writer cringe hearing this movies dialogues? What is the gorgeous girl doing outside of a calendar or a ramp? Watching the graphics expertise makes me feel like a crazy amount of money, talent, time and effort is being drained down in the wrong hole. The VFX work is sophisticated, complex and involves heavy planning, thinking and execution effort and in my opinion Michael Bay would go a long way and win many hearts if he can try just being a visual effects supervisor. Really the work here is much better than Avatar or Avengers. Synopsis: Fox is replaced by another hottie. Characters from the previous editions reprise same roles and dialogues. Nobody know what Decepticons are fighting for and Autobots are like overstayed guests. With a long list of mechanical characters, Bay tried to bring in the entire Hollywood to elevate the missing aesthetic value like Frances McDormand, John Malkovich, Ken Jeong, John Turturo etc. Instead of utilizing their special talents to arrive at a fresh flavor, all these talented actors succumb to buffoonery along with the rest of the cast. The robots behave more human than the actual actors themselves which is another thing that makes me cringe. There is actually a weird scene where a division captain instructs his team to hold fire until he commands, while actually all of them are shooting. If not for the visual effects grandeur, its rating would have been on the negative."
    },
    {
      "rating": "2.5/5",
      "review": "OK, the intro of the film seems interesting, the visual effect seems better, but it turns out that Transformer: Dark of the Moon is no different from its previous instalment, weak storyline, and it seems like an unfinished movie to me, it requires more touch up."
    },
    {
      "rating": "3.5/5",
      "review": "Action-packed with a great backstory! Originally written July 4, 2011-- A mysterious event from Earth's past threatens to ignite a war so large that the Transformers alone won't be enough to save the planet. Sam Witwicki (Shia LaBeouf) and the Autobots must join together with their human friends and fight against the gathering darkness to defend our world from the Decepticons all-consuming evil plan to enslave the human race once and for all! Ok, so this chapter in the Transformers saga wasn't too bad. It was action-packed and had a great backstory! Why exactly did the US want to get to the moon back in the 1960's so badly? The answer was pretty cool. But one thing that I didn't care for was how unrealistic it was that Sam's \"new\" girlfriend, Carly Miller (Rosie Huntington-Whiteley), never got a speck of dirt, sweat, blood, or grime of any kind on her bright white outfit---even though everyone around her is absolutely covered in it! I know that Huntington-Whiteley is a model, but come on!"
    },
    {
      "rating": "1/5",
      "review": "So bad it's insulting"
    },
    {
      "rating": "3.5/5",
      "review": "C'mon people! It's robots fighting! What more could you want?!"
    },
    {
      "rating": "3.5/5",
      "review": "Not as bad a 'Dark of the Moon' but still not great and still at least an hour too long. Mark Wahlberg is fairly decent and the transformers still look amazing but I think it's about time they stopped this franchise now. Unfortunately with the return of Megatron/Galvatron it looks unlikely. The two saving graces of this movie were the always awesome Stanley Tucci and the dinobots. It could have been a decent film but it the plot was too convoluted and it was far too long!"
    },
    {
      "rating": "4/5",
      "review": "it's bad but with Michael bays awesome explosion and big robots fight making kids buy the toys it makes up for it 8/10"
    },
    {
      "rating": "3.5/5",
      "review": "Dark of the Moon gets points for having a story we can follow and large scale set pieces for our eyes to enjoy. Still, you don't need to see it more than once."
    },
    {
      "rating": "3.5/5",
      "review": "OK. ok movie but not a GREAT movie. Best out of the 4 movies. B-"
    },
    {
      "rating": "5/5",
      "review": "Solid movie. The action scenes were awesome!"
    },
    {
      "rating": "3/5",
      "review": "I'm a transformers fan so for me this movie is good. but i know that is a bad movie but u know i still watch this movie and just saying its special effects are are undeniably impressive as fuck"
    },
    {
      "rating": "1.5/5",
      "review": "While being slightly better than the second installment, this third Transformers movie is still a poorly written mindless action-flick with bad camera work and an overflow of CGI. The special effects themselves are way better than in the second movie, but that really doesn't help much."
    },
    {
      "rating": "2/5",
      "review": "Blah blah... movie tried to be better than the previous two... blah blah... only better than Revenge of the Fallen. Then it still suffers from getting there."
    },
    {
      "rating": "1.5/5",
      "review": "A considerable improvement over Revenge of the Fallen (which was the worst sequel ever), Dark of the Moon comes overlong, overstuffed and consistently bad. Nothing special. Shia LaBeoufing, slow-mo, stupid product placement (as any Michael Bay movie nowadays), and explosions. Thank god Megan Fox left, but we have a replacement as for Sam's girlfriend Carly (Rosie Huntington-Whiteley). Lens flares, oversaturation and unnecessary camera spin filled with tedious script and incoherent (yet somehow manageable) plot. Do I recommend it? If you're a fan of Michael Bay's Transformers, then go ahead. You'll love it better than the second one. But for those of us who love the toys and the real cartoons, it won't do it better. It'll worsen your imagination. Grade: D+ Percentage: 20% Rating: 1,5/5"
    },
    {
      "rating": "2.5/5",
      "review": "I even admit myself, I am pretty tough on movies, almost to the point of being a movie snob. But I guess the fact that I look at the rating plus most of the reviews for not just this Transformers movie but all of them and I cant seem to figure out why they are so disliked. To me they are action movies made for the sole purpose of showing off special effects and entertaining me and they do both of these things really well. Is Shia LaBeouf a tool and a bad actor ? Yes. Is the movie oversaturated with digital green screen effects ? Yes. But really, what did you expect ? Its a movie about robots transforming themselves at the drop of a hat into different automobiles of course it is going to be pounded with special effects and digital technology. I honestly could care less about the script and the acting and the overall story, to me Transformers Dark of the Moon entertains the hell out of me and is a great action packed movie. I thought this one was the best of the series, in fact, I'm totally opposite, I think the later ones are the better ones and the first one is the worst of them all. Just goes to show you how everyone has different taste."
    },
    {
      "rating": "2/5",
      "review": "Michael Bays transformers torture show is back and like before is a total mess. Poor acting, Poor script a mess of cgi armeggedon, explosions, slow motion scenes and lashings of patriotic American propaganda. Somehow again giant robots can't manage to kill Hollywood's most annoying man, whose performance again is dreadful along with his new girlfriend sidekick (I forget her name) who is basically a cardboard cut-out. Despite these glaring faults this is the best film of the three which translates as the sweetest smelling turd from the Transformers franchise.."
    },
    {
      "rating": "1/5",
      "review": "Drivel. Almost completely lacking a plot and with none of the charm of the previous Transformers films. Even failed to stir any teenage geek interest in the actual transformers themselves."
    },
    {
      "rating": "1/5",
      "review": "Convoluted shambles."
    },
    {
      "rating": "1.5/5",
      "review": "New levels of silly in every way possible. I hope one day somebody other than Michael Bay will take on the Transformers franchise and start over!"
    },
    {
      "rating": "3.5/5",
      "review": "Very Good Climax Lackluster For The Rest"
    },
    {
      "rating": "2/5",
      "review": "Michael Bay once again gives us a orgy of explosions and visual effects. A paper thin plot and at times cringe worthy acting make this film another dud. At least its better than the second one."
    },
    {
      "rating": "1.5/5",
      "review": "better than revenge of the Fallen but awful"
    },
    {
      "rating": "0.5/5",
      "review": "Definitely sick making. Get me a barf bag"
    },
    {
      "rating": "4.5/5",
      "review": "Story is written by a 2nd grader, but it's got really great action sequences and satisfyingly brutal robot on robot violence"
    },
    {
      "rating": "1.5/5",
      "review": "It's a tad bit better than Fallen,but it's so stupid and immature that even the most arrogant teenage boy will find it dumb."
    },
    {
      "rating": "5/5",
      "review": "The plot is exciting."
    },
    {
      "rating": "3/5",
      "review": "This movie was decent. It was actually better than the second one."
    },
    {
      "rating": "5/5",
      "review": "With the third installment in Michael Bay's live action film franchise, there is more scientific analysis that we didn't get in the previous 2 and we get a hard decision on which one is better whether if its the first one or this one."
    },
    {
      "rating": "3.5/5",
      "review": "Transformers: Dark of the Moon may be an action CGI fest, but it makes for one that catches your eye the whole way. The effects are without a doubt some of the best I've seen, and the action is very thrilling. The story is quite intriguing as well, tying the Transformers back to one of the most proud times of our history, the Apollo 11 moon landing. This film corrects the problems with Revenge of the Fallen, and makes for the best film in the series so far."
    },
    {
      "rating": "1/5",
      "review": "Dark of the moon is not a very good subtitle.. It should've been called TRANSFORMERS: Blurry Blob of Colored Movement That Doesn't Go Anywhere."
    },
    {
      "rating": "2/5",
      "review": "Better than the second.....but that’s not saying much really. However Optimus and Sentinel’s student teacher relationship was intriguing. But still too many crude jokes"
    },
    {
      "rating": "1.5/5",
      "review": "Compared to Revenge of the Fallen, Dark of the Moon has more interesting ideas and it is a slightly better movie, but it doesn't make it a good film."
    },
    {
      "rating": "1.5/5",
      "review": "Michael Bay seems to be using this film series as an outlet to make money, as it shows no substance whatsoever. Three movies in and you would think that the characters would get more development. Optimus: The strong leader, Bumblebee: The Rebel Ironhide: Badass Sam: Horny awkward teenager. And this time, Rosie Huntington Whitley is Michael Bay's sex symbol. At least he waited until scene four of the first one to show off Megan Fox. In this one the opening shot is Rosie's butt."
    },
    {
      "rating": "3.5/5",
      "review": "liked this one too it was entertaining"
    },
    {
      "rating": "2.5/5",
      "review": "This has been my least favorite of the Transformers movie to date. My first issue was Sam and Mikaela breaking up without any explanation. I really disliked the idea of Rosie Huntington-Whiteley as Sam's new girlfriend. Secondly, Sam had so much hostility towards everyone in this film. It was a bit much to bear. The fight scenes were not that great either and I could scarcely follow along with what was going on. Not my favorite movie, but worth seeing if you're determined to see all of the Transformers movies."
    },
    {
      "rating": "0.5/5",
      "review": "Michael Bay. Nuff said."
    },
    {
      "rating": "2.5/5",
      "review": "Dark of the moon improves upon many of the flaws of Revenge of the fallen, but is still a cold and forgettable sequel, save for the impressive and climatic battle at the end."
    },
    {
      "rating": "4.5/5",
      "review": "Rating: 92% The special effects in Transformers: Dark of the Moon never get old, and for once the acting is actually better to make this film one of the most enjoyable in the franchise."
    },
    {
      "rating": "0.5/5",
      "review": "horribleness is this movie whats the story line only cool thing is the first 10 explosions other than that boring"
    },
    {
      "rating": "5/5",
      "review": "One of the best transformers films in the series."
    },
    {
      "rating": "3/5",
      "review": "Xenophobic Americanism - 10/10, special effects 10/10, ability to induce a headache - 10/10, fun - 10/10. Started watching it last night while dog-sitting (boys watching a movie) and finished for a lazy hour when I got back from running today. John Malkovich 10/10. John Turturro - 10/10. Rosie Huntington-Whiteley - 10/10 on the basis that she could just read the phone book. The rest of the cast - 0/10 but who cares?"
    },
    {
      "rating": "5/5",
      "review": "un film strabiliante molto curato nei dettagli 3D e estetici. Mi dispiace che la ragazza di \"Sam\" non abbia potuto partecipare per la sua \"critica\" offensiva al riguardo del regista Michael BAY ( definitolo un, Hytleriano) ... si possa comunque migliorare"
    },
    {
      "rating": "5/5",
      "review": "The second best(or THE best...) in the series."
    },
    {
      "rating": "3.5/5",
      "review": "I thought this was a really good Transformers movie. I definitely enjoyed it way more than most people did."
    },
    {
      "rating": "3/5",
      "review": "We seem to have entered that stage in the eternal struggle between self & pre determination where in the future is now forming around self evolving transformative robots. This rendering seems to let that meaning to sometimes slip through its action packed hands. But, it does add some historical authenticity that redeems a little its other wise hidden class warfare meaning."
    },
    {
      "rating": "3/5",
      "review": "This is my favorite one"
    },
    {
      "rating": "1.5/5",
      "review": "Positives - very entertaining third act - good action scenes Negatives - first 90 minutes is very difficult to sit through - terrible dialogue - awful characters - shaky cam - weak plot - 30 minutes too long - poorly paced"
    },
    {
      "rating": "4.5/5",
      "review": "Action packed and my favorite of the transformers movies"
    },
    {
      "rating": "2/5",
      "review": "Explosions: the movie."
    },
    {
      "rating": "3.5/5",
      "review": "This film may still have all the stupidity and lack of logic as the last film, but I actually enjoyed this film a lot more then the 2nd. Once again it has amazing action, CG, and sound effects! It is bad, but it's a guilty pleasure!"
    },
    {
      "rating": "3/5",
      "review": "What a disappointment. The plot makes no sense and why did they try and hype up Shockwave as the films big bad guy when he only utters one line in the whole movie. There are a few nice point of view camera shots and the final battle would have been a nice send off to the series if they hadn't made another one."
    },
    {
      "rating": "2/5",
      "review": "When Transformers Dark of the Moon was announced a lot of people weren't looking forward to it but then came the trailers and they looked amazing but hen I saw the movie itself and I'll the film is definetly by a long shot better the than Transformers 2 and the 3d,speacial affects and action are the best the series has ever seen but unfortionetly the film is still an explosion fest, poorly written mess as most characters are only given 1 or 2 scenes of screen time and the annoying characters and acting have not change as in there still terrible. On the other hand thow we have some very good casting choices such as Leonard Nemoy as Sentinal prime and a cast member from fire fly. The character that has become remotely interesting is the character Epps and other characters like Optimus Prime, bumble bee and megaton have redeemed them selfs and the action sequences are spectacular and not tome nation the final fight scene between Optimus Prime and Sentinal a Prime is awsome. While Dark of the moon manages to fix some of the issues from the Transformers 2 it unfortunately is still a bad movie but way better than Transformers 2"
    },
    {
      "rating": "3/5",
      "review": "Ehh, Megan Fox got replaced. Not a fan. Felt like a filler for the next movie."
    },
    {
      "rating": "3.5/5",
      "review": "The film is good, much better than Transformers 2 has a less tangled story, but although you have many problems, it is an entertaining film."
    },
    {
      "rating": "2.5/5",
      "review": "My favorite of the Transformers franchise...... but not good. A rotten rating of 55% \"While it's an improvement over Revenge of the Fallen, it still has the same content you 'd come to expect in a Michael Bay film.\""
    },
    {
      "rating": "1.5/5",
      "review": "Why do robots need beards? Anyways, same old crap from 2 carried on to 3. Never once felt the good guys were in danger since they were overpowered. Decepticons are just a bunch of cannon fodders, I wonder how they were able to win the war for Cybertron. Snooze and yawn."
    },
    {
      "rating": "5/5",
      "review": "Best action movie ever. Fun, entertaining, and this film is better Than the 2nd one"
    },
    {
      "rating": "1/5",
      "review": "NO, Michael Bay. NO! NO! Also, a complete waste of Leonard Nimoy's talent."
    },
    {
      "rating": "2.5/5",
      "review": "43% on my Tomatometer."
    },
    {
      "rating": "0.5/5",
      "review": "There is no forgiveness for the atrocity that the last film turned out to be! I quote the co-host 3000 from the late Spill.com, \"You know, they say that you can't polish a turd. And after watching this film, well you sure as hell cannot transform it either!\" This was only slightly better, but still, diarrhea! I would never watch another Michael Bay film ever again, unless he repents, and makes something decent!"
    },
    {
      "rating": "2/5",
      "review": "Here we are again! The same old stuff in the last two installments are in Transformers: Dark of the Moon. Nothing has changed. When a mysterious event from Earth's past erupts into the present day it threatens to bring a war to Earth so big that the Transformers alone will not be able to save us. First of all, DOTM is not good movie. However, it is better than ROTF but not by much. Again, it is the exact same thing as the others. But, the difference is Megan Fox is no longer in the picture. We have Rosie Huntington-Whiteley who is Fox's replacement because apparently Fox herself compared Michael Bay to Adolf Hitler. And no, Huntington-Whiteley isn't any better. What can I say about DOTM? I mean I can't hate it because it slightly better than ROTF which I despise very much. Like ROTF, the long, bloated time (which is two hours and thirty-four by the way is WAY too long for a film about nothing) just makes the film more tedious. But, the difference is that DOTM is slightly more fun (not really fun) than ROTF but that is not saying much. The action is pretty good like in the last films although it is really repetitive and tedious. The effects are good also but they can't save this film from being tedious and cliched. Do I really recommend DOTM? Um, not really unless you are a fan of this series. I suggest you renting it before you buy it."
    },
    {
      "rating": "0.5/5",
      "review": "Transformers Dark of the Moon Is a piece of shit that continues to be directed by the infamous Michael Bay. He is not a good director at all and will never make good movies. Megan Fox Got Fired and have been replaced with a fucking model who can't act! The Script and Story at the same time sucked penises. I hate it this is the worst transformers and michael bay film i have ever seen. Score: 0.5/10"
    },
    {
      "rating": "1/5",
      "review": "A couple hundred years ago Bay would have been a shitty artist who would probably get his hands chopped off for painting an ugly picture of the wife of the guy who owns the circus and the elephant cage Bay sleeps behind."
    },
    {
      "rating": "2.5/5",
      "review": "After loving the first two, this one dissapointed me"
    },
    {
      "rating": "2/5",
      "review": "Tries to be funny but isn't. Poor storytelling."
    },
    {
      "rating": "4/5",
      "review": "transformers dark of the moon is a fun popcorn movie. It is better then the 2nd film but not as good as the first. This movie has some of the best action scenes i have ever scene it is really good. And this movies fixes some of the problems in the other 2 films in the series. The effects are amazing and it is so cool to look at. And the score/music is really good as well. I give transformers dark of the moon a 4/5 stars"
    },
    {
      "rating": "2/5",
      "review": "Clearly a desperate attempt to improve the saga, which culminates in a major failure with great visual effects and a script a little better than the previous film. 4/10"
    },
    {
      "rating": "3/5",
      "review": "much better than RoTF"
    },
    {
      "rating": "3.5/5",
      "review": "Ok this one is quite underrated. Not a great film and does has its flaws but it is enjoyable."
    },
    {
      "rating": "5/5",
      "review": "Transformers for the win"
    },
    {
      "rating": "1.5/5",
      "review": "I'm not sure where I stand on this movie oppose to the others in the Transformers series. It's so grand in scale, so over the top, so out of this world, so dumb and confusing. I miss Megan Fox, and this is the first of many characters that will leave because of many reasons, not because Bay doesn't want them in the story, but because they don't want to be there. This one is that same as the others, and by now I feel like I can write one review and it could be for all of them. The story is one of massive scale, and so are the battles, like a robot version of Battle: LA. It's just so over the top though, sometimes it's cool, but it's too much. This movie is 90% CGI, watch the trailer and you will know. You will also know that the decepticons teleport from inside the moon, to Chicago to start a giant battle which destroys the whole city basically. Our new enemy is Dark of the Moon, or maybe just Dark I'm not sure, finally a bad guy that can stand up against Prime in a fair battle, yet we still don't really get to see any. The beginning gives us more depth to the Transformers origins, yet not really explaining much, other than how there is a ship on the moon, but not how there is a whole army waiting inside the moon. The final battle is massive, cool but dumb as well, over the top, and is a mess of CGI, explosions, slow motion, and rubble. The alien worm eating the building was cool, but there's no way anyone inside would have survived. This is also the first Transformers movie to feature human soldiers actually being able to do something against the robots, maybe too much though. Overall kinda a mess, way to much to complain about to go into much detail, just watch the trailer and you will know what it's about, but even if you watch it you will not fully understand what's going on."
    },
    {
      "rating": "1.5/5",
      "review": "Transformers 3 is more of the same from the first two Transformers movies."
    },
    {
      "rating": "3/5",
      "review": "In The Third (And What I Hoped To Be Final) Transformers Movie, It Does Indeed Improve Over Transformers Revenge Of The Fallen, But With Director Michael Bay, That's Not Saying Much. The Plot Is Just Like The First 2 But More Like Revenge Of The Fallen, The Actors Still Suck Especially Rosie Huntington Whitley, Shia Labeouf's Wit And Charm Has Died And Moved On, And It Is WAY TOO LONG. But I Will Say That Michael Bay Has Upped The Scale Especially With It's Epic 1 Hour Finale That Is Not Overwhelming At All. The Trailers Were Misleading, But Transformers Dark Of The Moon Is A Thrill Ride With All The Michael Bay Cliches That Still Bloat The Movie, But Hey, At Least It's Better Than Revenge Of The Fallen."
    }
  ]
}