{
  "movie_name": "Black Bag",
  "reviews": [
    {
      "rating": "3/5",
      "review": "A pretty slow and non compelling spy movie. The soundtrack definitely enhanced the experience"
    },
    {
      "rating": "0.5/5",
      "review": "I want my money back. Worst movie I’ve seen in a long time and makes me question these ratings. I couldn’t keep my eyes open and my friend agreed it was “terrible”. How are the reviews for this movie any good? Snoozefest."
    },
    {
      "rating": "0.5/5",
      "review": "The most boring movie of 2025."
    },
    {
      "rating": "3/5",
      "review": "It was a good, smart spy movie but my expectations were sky rocket since the ratings were off the chart, i was a bit disappointed and got somewhat bored in the second half of a not-so-long movie."
    },
    {
      "rating": "4/5",
      "review": "A 1 1/2 hour movie that really flew by. Tight plot that keeps moving without wasting a single frame."
    },
    {
      "rating": "4/5",
      "review": "Everything is smooth and perfect, acting, styling, art direction, elegant in each aspect, with a sort of claustrophobic lighting. Plot in a classic spy story “nothing is as it appears”. But … it looks to me as a style exercise. Soderbergh can do better. 😇"
    },
    {
      "rating": "2/5",
      "review": "A spy thriller that shoves the suspense and plot in the back seat, so that the interpersonal drama of the characters can do the driving. It had a great cast, a solid plot and really good twists to be a 5 star thriller that just falls flat, all the potential was there. And, whoever did wardrobe design really did a disservice to this movie, the characters are spy's not Dolce & Gabbana models."
    },
    {
      "rating": "3/5",
      "review": "Not enough action or movement of any kind. A psychological “talking” play. And somewhat difficult to follow the dialogue and underlying plot/mission."
    },
    {
      "rating": "3.5/5",
      "review": "Watching this, it's more like a job than entertainment."
    },
    {
      "rating": "3.5/5",
      "review": "Not the best thing Soderbergh has made. I was hoping it would be more akin to Out of Sight. Still, his output is impressive given he's technically a retired director. Blanchett and Fassbender are always great to watch though."
    },
    {
      "rating": "1/5",
      "review": "The secret agents apparently replaced the script with dribble designed to make those with low IQ feel smarter, and induce slumber in those above, Rated 5 Yawns"
    },
    {
      "rating": "3.5/5",
      "review": "A good spy thriller that to me missed an opportunity to just have the entire movie just shot in one room. All the dinner scenes where fantastic and I wish they just did the movie in one location."
    },
    {
      "rating": "2.5/5",
      "review": "No idea what I've watched..."
    },
    {
      "rating": "3.5/5",
      "review": "Black Bag continues Steven Soderbergh’s trend of getting it very right after he has gotten it very wrong. This film more than makes up for Kimi (and, I assume, Magic Mike’s Last Dance) much in the same manner that No Sudden Move made up for Let Them All Talk. ninetypercentcrapmoviereviews.wordpress.com/2025/05/11/black-bag/"
    },
    {
      "rating": "3/5",
      "review": "Dull... Felt like nothing exciting or new"
    },
    {
      "rating": "5/5",
      "review": "LOL, drama that includes humor and animal and plant friends!!!!!!!!!"
    },
    {
      "rating": "4.5/5",
      "review": "It takes a few minutes to adjust to the tone and pacing - but it is very clever, playful, funny, quirky, and keeps the audience guessing as to who to trust. There's also witty deadpan dialog. Great cast. It's not a Marvel movie people! (for those who found it boring.) It's a pay attention to the dialog and every character movie, all in all fun, unique yet classic Soderbergh and highly recommend."
    },
    {
      "rating": "2/5",
      "review": "Sorry to say, we were disappointed with Black Bag. Great cast but we didn’t know what was happening the first 30 minutes 😩 Let me just say if you go, make sure you can clear your mind because you have to listen carefully to every word of heavy British accents the whole movie and there’s no subtexts."
    },
    {
      "rating": "4/5",
      "review": "As you'd expect given the starry lineup, this is a suave and sophisticated production with plenty of unexpected plot twists - more than enough to get your teeth into if spy dramas are your thing."
    },
    {
      "rating": "5/5",
      "review": "I thought it was excellent. Good story well done and not too long."
    },
    {
      "rating": "1/5",
      "review": "Stellar cast, stellar boring."
    },
    {
      "rating": "1.5/5",
      "review": "Super slow start and hard to follow. Extra shots that are super stylized but don't move the story forward. Stilted dialog throughout. Save yourself some time and aggravation and skip this movie."
    },
    {
      "rating": "4/5",
      "review": "Brimming with Steven Soderbergh’s signature narrative style and pacing, Black Bag may come off as flavorless to some, but as a stylistic take on the spy genre, it’s arguably one of the most elegant ways to fuse a star-studded cast with a clever script."
    },
    {
      "rating": "1.5/5",
      "review": "So boring! Push play just at bedtime. They didn’t have enough storyline or action sequences so they overloaded the dialogue."
    },
    {
      "rating": "1.5/5",
      "review": "Terrible, Boring movie that is so hard to follow and it is so slow. One of the most overrated movies I have paid to watch. This movie isn't worth watching for FREE let alone $10:-("
    },
    {
      "rating": "4/5",
      "review": "Not as action packed as the premise would suggest, but fantastical acting from the cast and legendary direction from a seasoned director. It may not be for everyone, but if you appreciate the acting then this is for you!"
    },
    {
      "rating": "1.5/5",
      "review": "I expected more from this experienced cast. I did not enjoy the script. Glad I watched this movie at home."
    },
    {
      "rating": "0.5/5",
      "review": "I was very much looking forward to watching this movie and was surprised and disappointed by how dreadfully boring it turned out to be. Two great actors in fifth-rate film. It doesn't help that Cate Blanchett looks like she's had plastic surgery. Not Lara Flynn Boyle circus freak surgery but she's well on her way. What a shame."
    },
    {
      "rating": "1/5",
      "review": "Not only can't recommend this movie suggest it gets burned so it can be erased from my memory. One of the worst movies I've seen in years. Boring, slow, actors appeared like zombies. Story I could not have a cared a bit about. Just because they use an AI module does not make it interesting. It appears it took a lot of money to make it but it wasn't worth it. It reminds me of wolfs of wall street! This is snore city!"
    },
    {
      "rating": "4/5",
      "review": "I liked it. It was a tightly wrapped film. There was a lot of dialogue but some reason I did not mind it and actually liked it."
    },
    {
      "rating": "4/5",
      "review": "It's really quite delicious watching people in a morally repugnant line of work tear each other into glistening ribbons."
    },
    {
      "rating": "4/5",
      "review": "Despite the fact that bags did not play a central role in Black Bag (which really upset me because I love bags and only opted to see this movie because I thought a eco-friendly tote might be a central character), I decided to stay because of the compelling storyline and acting. It's a slow but satisfying burn with interesting turns. Definitely recommend. Just sad about the bags."
    },
    {
      "rating": "3.5/5",
      "review": "Deep intertwining plot, showcase by Fassbender as always, but overall a somewhat forgettable film. Worth a watch, but probably not a future rewatch."
    },
    {
      "rating": "4/5",
      "review": "It’s a slow burn espionage-mystery. Who can you trust when you’re in the “don’t trust anyone” game? It evokes the storytelling of ‘70s spy thrillers, like “Three Days of the Condor”, but more contained and elegance takes the place of grittiness. Its pace is what some might call “slow”, but I’d call “exacting”. The acting is graceful and calculated, much like the characters in the story. And best of all the runtime leaves zero pause for fluff. I look forward to watching it a second time to follow along knowing what I know from the beginning."
    },
    {
      "rating": "5/5",
      "review": "I thought it was a really good movie. I love a good espionage movie. Not to violent and then Pierce Brosnan Cate Blanchette were in it. Loved it."
    },
    {
      "rating": "0.5/5",
      "review": "It has decent actors and seemed to have good reviews, so gave it a try. But honestly I struggled to get through it. One of the slowest, dullest movies I've watched in a long time. Nobody I watched it with enjoyed it and even had a hard time following the point of it. Not my kind of movie, and surprised it has such a high rating on here."
    },
    {
      "rating": "3.5/5",
      "review": "I liked a lot, l mean is kind of basic on the plot but the acting very good, Also l'm a sucj¿ker for couples that fight together"
    },
    {
      "rating": "3/5",
      "review": "Good acting but could have done with more twist and turns as a spy catcher. Worth watching."
    },
    {
      "rating": "4/5",
      "review": "They don't make films like this anymore. Smart, sophisticated, thrilling."
    },
    {
      "rating": "3/5",
      "review": "It's a decent who done it genre film or in this case who's the spy. I'd prefer a little more action but it does hold your attention well enough without it."
    },
    {
      "rating": "2.5/5",
      "review": "A passable, albeit somewhat forgettable, spy yarn to watch when (like me) you've seen everything else. It reminded me of Tinker, Tailor, Soldier, Spy a little bit."
    },
    {
      "rating": "4.5/5",
      "review": "It feels that every scene has been carefully curated while the actors are free to be compelling. So much occurring underneath the surface in this sophisticated film. I felt that the intelligence of the audience is also being celebrated."
    },
    {
      "rating": "3/5",
      "review": "Disappointing. Always good for much better from Kate. Ending was drab and simple. Disappointingly ended up being a waste of time....very unfortunately."
    },
    {
      "rating": "4/5",
      "review": "Great movie... except for the cinematography. Can Soberbergh stop shooting his movies?"
    },
    {
      "rating": "3/5",
      "review": "A cast of well known and talented actors set in a spy v. spy drama. However, the characters, plot and dialogue were stiff and two-dimensional, and the events that unraveled at the office, the psychologist’s office, and the infamous long dinner table were slow in coming to fruition. Glad I saw is on Peacock and not paid extra for the film."
    },
    {
      "rating": "4/5",
      "review": "Intellectual spycraft...very well done. Probably best watched at home where you can pause it and think, pause it and think. Easier to understand the complexities that way."
    },
    {
      "rating": "1/5",
      "review": "No Action. You'll wait the entire movie for it. Could have been better"
    },
    {
      "rating": "1.5/5",
      "review": "Seinfeld spy movie, a movie about nothing. Waste of talent. Writing is boring and predictable. Little more than Fassbender and Blanchett walking around dressed to the nine looking cool."
    },
    {
      "rating": "4/5",
      "review": "It’s a very nice and triggering movie. It’s very cool to watch and needs patience and understanding to decode"
    },
    {
      "rating": "4/5",
      "review": "Mikey’s Film Review: Black Bag (2025) Directed by Steven Soderbergh (Out Of Sight, Ocean’s 11) and written by David Koepp (Mission: Impossible, Jurassic Park), Black Bag is a slow burning spy drama that has more in common with Tinker, Tailor, Soldier, Spy than Mr. & Mrs. Smith… When intelligence agent George Woodhouse (Michael Fassbender) is tasked with finding the traitor amongst 5 suspects - one of which includes his wife Kathryn (Cate Blanchett), he soon discovers there could be much more than their marriage at risk. It’s Soderbergh and Koepp firing on all cylinders - beautifully shot and framed, and suffused with some deliciously juicy one-liners. The small but perfectly cast ensemble (including Marisa Abela, Tom Burke, Naomie Harris, Regé-Jean Page and Pierce Brosnan) engaging in confident, smart and sexy repartee with plenty of bite. The main character of George Woodhouse is most certainly based on and inspired by John le Carré’s George Smiley (so brilliantly played over the years by the likes of Alec Guinness and Gary Oldman). His cold, calculating and technical demeanour being the film's main focus and drive. Fassbender plays the legendary protagonist to perfection. With so much of modern Hollywood’s output relying on established IP and remakes, it’s good to know that there are still auteurs trying to create original content without the need for fast editing, gunfire and explosions every 30 seconds - even if it is with a slightly worn genre throwback. Black Bag is as slick as they come and at 90 minutes perfectly rounded. It’s also proof that yes indeed, they do ‘make them like they used to’… Mikey’s Film Rating: 4/5*"
    },
    {
      "rating": "2/5",
      "review": "Great acting and script, but punishingly slow."
    },
    {
      "rating": "1.5/5",
      "review": "Writing this while I'm watching it isn't good think with all these great stars in it that it would have really good action and not drag on and be boring what happened here idk this is trash!"
    },
    {
      "rating": "3/5",
      "review": "Not bad, in that John le Carre-style of non-action-oriented espionage story. It's billed as a thriller but it's more of a mystery detective movie disguised as an intelligence service investigation. Good run time for what it is at ~90 minutes, which is growing more and more uncommon."
    },
    {
      "rating": "0.5/5",
      "review": "Slow, plodding, terrible plot and writing that would put even the strongest insomniac to sleep. Horrible. No clue why the high ratings. A definite must miss. Save your evening. Skip this one."
    },
    {
      "rating": "3/5",
      "review": "Slightly disappointed on what it really was about, but it was ok in terms of pace and intention."
    },
    {
      "rating": "4.5/5",
      "review": "If you fed Out of Sight, The Informant!, and Haywire into a paper shredder and reassembled them with surgical precision, you might end up with something like Black Bag. And I say that as someone who’s spent far too much time rewatching The Limey with director commentary on. Black Bag is pure Soderberghian catnip—stylish, cerebral, and just slippery enough to make you lean forward. It’s a stripped-down spy thriller that doesn’t shout its intelligence but whispers it, cool and confident. The pacing is tight, the editing is propulsive, and the camera moves like it’s got somewhere better to be. What sets it apart isn’t the espionage—it’s the vibe. There's a formalism to the filmmaking that feels both classic and completely modern. The color palette’s cold but clean. The score hums with minimalist menace. Scenes bleed into each other with a jazzy rhythm, like a Miles Davis solo re-cut by an algorithm. You feel the influence of Contagion and Side Effects—not in plot, but in tone: clinical, efficient, and always two steps ahead. The performances? Deceptively low-key, which is the point. These aren’t Bond characters. They’re real professionals in real trouble. There’s no exposition dump—just context clues and clipped conversations that demand attention. You’re not being spoon-fed; you’re being invited to keep up. And like all great Soderbergh joints, Black Bag trusts its audience. It knows we’ve seen the tropes. It’s not reinventing the spy genre—it’s streamlining it, polishing it, and handing it back to us with a smirk and a burner phone. Black Bag doesn’t need explosions to feel dangerous. It plays like a sealed envelope that might be empty—or might ruin lives. You won’t know until the last scene. And when the credits hit, you’ll want to start it all over—just to catch what you missed the first time."
    },
    {
      "rating": "3.5/5",
      "review": "Starts off too slow, Blanchett and Fassbender rule, the rest don't contribute much, the ending feels rushed"
    },
    {
      "rating": "2/5",
      "review": "I found it boring. Michael Fassbender's accent was annoying. So glad I didn't pay big bucks to stream"
    },
    {
      "rating": "3.5/5",
      "review": "Polished aesthetically, and some funny dialogue but ending reveal didn’t hit like it should have. Happy I waited to stream it."
    },
    {
      "rating": "0.5/5",
      "review": "Nothing short of terrible. If you want to confused and bored stiff right to the end and beyond, then this is for you."
    },
    {
      "rating": "5/5",
      "review": "I was utterly enchanted right away. A cerebral thrill ride that pulls you in with plenty of sophisticated twists and turns. Leaves you guessing and has plenty of humor peppered throughout. Acting is A+ with an original story line that's a refreshing rendition of spy lore. You won't be disappointed. Watch this movie now."
    },
    {
      "rating": "3/5",
      "review": "Its an OK film, relatively short, so probably worth watching. You’ll forget it the next day as its pretentious, obtuse, characters and dialogue not up to his usual work.. That said, the acting itself is top notch, great cast. Is it written in stone that every film the bad guys must be Eastern European or Russian? Is it illegal to portray the actual terrorists?"
    },
    {
      "rating": "4/5",
      "review": "Good spy / relationship movie. Great story."
    },
    {
      "rating": "2.5/5",
      "review": "Whoever told Michael Fasbender to do his Data from Star Trek impersonation should of been fired."
    },
    {
      "rating": "3/5",
      "review": "Entertaining. And that’s what a movie needs to be. Not great but definitely not bad."
    },
    {
      "rating": "4/5",
      "review": "It's a sexy, cerebral spy thriller. It was highly enjoyable."
    },
    {
      "rating": "3.5/5",
      "review": "Clever spy drama that could have been a play which involves just basically 6 characters and a small appearance by Pierce Brosnan as the boss of presumably a national intelligence agency."
    },
    {
      "rating": "4/5",
      "review": "Sleek acting, more of Kate Blanchet and her killer put down lines would have pushed this to a 5 star. Good storyline until the end ."
    },
    {
      "rating": "5/5",
      "review": "Un interesante y complejo thriller de espías que nos regala grandes actuaciones con momentos muy psicológicos"
    },
    {
      "rating": "1.5/5",
      "review": "I thought this movie could have been so much better if more thought were put into it. It lacked substance and isn't a movie I could ever imagine watching more than once in my life time."
    },
    {
      "rating": "4/5",
      "review": "Always trust your partner."
    },
    {
      "rating": "5/5",
      "review": "Loved it, kept me engaged from the beginning to the very end. New concept of spy movies, didn’t know what happened until the last minute. Excellent movie…"
    },
    {
      "rating": "3/5",
      "review": "Black Bag is a good film, but not one particularly entertaining. It has some great scenes (the dinner scene,the poligraph scene) and a sophisticated tone, but its slowness makes it a little bit hard to recommend."
    },
    {
      "rating": "5/5",
      "review": "Loved it, great plot and brilliant acting from the whole cast they are all so believable. Seemed to be over in no time which is a sure sign of a good film as there were no points at all where you get bored. I'd give this more than 5 stars if I could, I 100% recommend watching this film."
    },
    {
      "rating": "1/5",
      "review": "The writing and acting on this film was so poor - I had to abandon it after only 10 minutes."
    },
    {
      "rating": "4/5",
      "review": "The writing was solid and kept you guessing. This is also the most recent film that I recall where I cared about each of the main characters and liked their dynamics with each other especially when tension was being built up. Definitely a movie worth watching."
    },
    {
      "rating": "4.5/5",
      "review": "Black Bag is a 2025 American spy thriller filmdirected by Steven Soderbergh and written by David Koepp. It stars Cate Blanchett, Michael Fassbender, Marisa Abela, Tom Burke, Naomie Harris, Regé-Jean Page, and Pierce Brosnan After long time I felt this movie should be more longer , what a classic , smooth and beautiful movie made by Soderbergh. Black Bag is a sophisticated espionage thriller that revolves around George Woodhouse (Michael Fassbender), a senior British intelligence officer tasked with uncovering a mole within his agency. One investigation takes a deeply personal turn when one of the suspects is George's wife, Kathryn (Cate Blanchett), also a high-ranking spy. The narrative unfolds through tense interrogations, manipulative dinner parties, and psychological warfare, creating a slow-burn mystery filled with twists and emotional complexity Michael Fassbender delivers a gripping performance as George, portraying the internal conflict of loyalty to his country versus doubts about his wife with subtlety and precision. Cate Blanchett shines as Kathryn, balancing warmth and menace in her enigmatic portrayal Their chemistry is electric, romance and deep emotion for each other . The supporting cast, including Regé-Jean Page, Naomie Harris, Tom Burke, and Marisa Abela, adds layers to the story with their nuanced performances. Steven Soderbergh masterfully directs Black Bag we all know him ocean 11, 12 & 13 his style and charm blending sleek cinematography with fast-paced editing to heighten suspense. His use of soft-focus shots and wide-angle lenses creates an atmosphere of danger and uncertainty. Soderbergh avoids typical spy genre clichés, focusing instead on realism and psychological tension. The dinner scenes are particularly noteworthy for their manipulative brilliance, showcasing Soderbergh's ability to build suspense through dialogue and subtle interactions rather than action sequences One thing always best in how he use Jazz. The film's score complements its minimalist aesthetic perfectly. There was many good score of Jazz in Ocean trilogy too . A mix of jazzy undertones and percussive beats creates an atmospheric backdrop that enhances the tension without overpowering the narrative. The restrained yet evocative music mirrors the film's focus on psychological drama over flashy action. Black Bag is an intelligent and stylish espionage thriller that transcends genre conventions. With stellar performances from Fassbender and Blanchett, sharp direction by Soderbergh, and a compelling narrative rooted in themes of trust and manipulation, it offers a refreshing take on spy cinema. The film’s focus on psychological tension rather than action. Highly recommended"
    },
    {
      "rating": "1/5",
      "review": "It felt pretentious. Just felt weird."
    },
    {
      "rating": "3/5",
      "review": "How many double-thruple crossings can one handle? If spy baddie convos are your thing, you'll like black bag."
    },
    {
      "rating": "1/5",
      "review": "Absolute drivel. How this is getting a 90+ is beyond me. \"Classy\", \"Sophisticated\", more like boring as, with nothing happening the whole movie. Story telling at its worst, with nothing happening."
    },
    {
      "rating": "4.5/5",
      "review": "Superb film, althought I feel Fassbender is beginning to be typecast. It kept me guessing right until the end; I had no idea who to trust and who not to trust."
    },
    {
      "rating": "5/5",
      "review": "Don't expect \"Tom Cruise\" action in this spy movie. It's a great movie of intrigue and mystery with little violence and action. You are entertained to the end. If our spy agencies have people like this then I'm glad they are on our side."
    },
    {
      "rating": "4/5",
      "review": "A carefully crafted spy thriller that explores the complexities of trust and deception. Soderbergh makes the tension in the air so thick you can cut it with a knife."
    },
    {
      "rating": "4.5/5",
      "review": "Great cast and great performances. Pay attention because the plot keeps you guessing all the way through. Some dry humour for a few giggles along the way. The on screen relations of Cate Blanchett and Michael Fassbender are wonderful."
    },
    {
      "rating": "4/5",
      "review": "Black Bag is a slick, stylish spy thriller that expertly blends tension, deception, and espionage. With sharp pacing and stunning visuals, the film keeps you hooked from start to finish. Michael Fassbender and Cate Blanchett deliver strong performances in this morally complex narrative. While the plot can be overwhelming at times, the film’s exploration of trust, betrayal, and tough choices adds depth to the intrigue. A well-crafted, gripping watch that stays with you long after the credits roll."
    },
    {
      "rating": "2/5",
      "review": "Just meh. It never really got off the ground."
    },
    {
      "rating": "5/5",
      "review": "Great film, very spellbinding, kept you on the edge of your seat the whole film. I had no idea which way it was going until the very end. Exceptional cast and story."
    },
    {
      "rating": "0.5/5",
      "review": "What a waste of the rental fee! Not one likable character, absolutely no recognizable through-line on the plot. Wtf is the Black Bag? Unable to discern a single thing to invest in as a viewer. Wholly unbelievable, unremarkable."
    },
    {
      "rating": "2.5/5",
      "review": "So I paid 25 bucks on Prime to watch what I thought was a spy movie. Instead what I got was a bunch of people having dinner or going to meetings to figure out who of their small group was a traitor. The trailers mad you suspect Cate Blanchett was the traitor. Not for a second did I believe that. There was no action save for the end where the young up and coming spy turned out tot be the traitor gets shot. What boring POS!!"
    },
    {
      "rating": "3/5",
      "review": "Un faux suspense pour un vrai ennui. The Insider (Black Bag) avait tout pour séduire : un casting solide, une esthétique léchée et la promesse d’un thriller d’espionnage moderne. Mais très vite, le vernis craque. Cate Blanchett et Michael Fassbender livrent des prestations étonnamment tièdes, sans jamais vraiment habiter leurs personnages. Le scénario, bancal et inutilement alambiqué, déroule une intrigue cousue de fil blanc, où chaque retournement est télégraphié bien à l’avance. Les personnages ? Des archétypes épais comme un roman de gare : l’agent usé par le système, la recrue trop brillante pour être vraie, le traître évident dès la première réplique. Si quelques scènes parviennent à capter l’attention, l’ensemble manque cruellement de substance et de tension. En résumé : beaucoup de style, très peu d’âme."
    },
    {
      "rating": "2.5/5",
      "review": "The filming was very dark, it just wasnt what I thought it would be"
    },
    {
      "rating": "5/5",
      "review": "Excellent spy thriller. Gorgeous to watch and very fun."
    },
    {
      "rating": "4/5",
      "review": "Very entertaining whodunnit! Keeps you guessing until the end!"
    },
    {
      "rating": "5/5",
      "review": "Exposition of actual and/or Metaphor of frequent recurring goals & motives of government and corporation. Acute vision, planning & execution, awesome & egrigous dictation, compartmentalization of characters personafication. Symbolizing the secrecy and behind the doors going-ons of executives decision. These depiction is NOT fiction. True to form of all its realization. Get ready to get ur head spinnin'."
    },
    {
      "rating": "5/5",
      "review": "Sleek and stylish as they come. Finally a spy thriller that never insults the intelligence of its audience."
    },
    {
      "rating": "1.5/5",
      "review": "Just could not get into this, no matter how hard I tried. So after 2 attempts, I made sure 3 times a lucky charm, but charm it was not and lucky I would’ve been if id just let it at the 2 attempts and left it there. So I watched it from beginning to end and was utterly disappointed, I like Fassbender and Blanchett (under utilised) and Soderbergh and thought when is the reveal comin or the twist or the something to keep me from going wtf is this snooze fest i am watching to oh that’s great, I’m glad I sat thru this tripe……….but it never came. Quite boring and wasted opportunity with a ok cast that just never hits the highs as described or presented !!!!!! A below average spy thriller, don’t waste ur time, the characters and story is boring with the reveal or should I say the omg is that the moment I was waiting for is such a let down it brings the whole movie down a star or 2. Cos it’s a scratch ur head moment of ughhh is that it. Crapolla from this reviewer !!!"
    },
    {
      "rating": "1/5",
      "review": "Written by AI with a script that stretches the limited range of the luvvies involved. The stereotypical 2 dimensional wooden middle class spies would give Pinocchio a run for for his money."
    },
    {
      "rating": "1/5",
      "review": "Undoubtably the worst movie I’ve ever seen. Could not understand a word of it because of the heavy British accents and the low lighting where you can’t really even see their lips. I was confused from the time I walked into the time I left. They Needed close caption at the bottom Of the screento understand what they were saying maybe then I would’ve got the drift to the movie. Although I doubt it, it was so convoluted It was two hours of wasted money And boredom."
    },
    {
      "rating": "4/5",
      "review": "As the \"Tinker, Tailor, Soldier, Spy\" for the computer generation this intellectual spy flick depends on acting, plot, and character development. How refreshing! Stay home if you want explosions and special effects."
    },
    {
      "rating": "4/5",
      "review": "A suspenseful retro spy movie with a great cast. Low on action, high on intrigue."
    },
    {
      "rating": "2/5",
      "review": "I am so disappointed in this movie. Since it’s got such great reviews, I went ahead and bought it instead of renting it. I continue to be disappointed in Michael Fassbender. I do not know why he gets all of the accolades that he does. I find him boring. Typical spy movie: nothing to get excited about!!"
    },
    {
      "rating": "4/5",
      "review": "A short movie with an amazing cast and intellectual storyline"
    },
    {
      "rating": "3/5",
      "review": "Great actors. But, weak storyline."
    },
    {
      "rating": "4/5",
      "review": "Tight script. A whodunnit with plenty of setups and payoffs to warrant a rewatch."
    },
    {
      "rating": "2.5/5",
      "review": "The movie had good potential but poor execution. It was a star-studded cast, and the quality acting is probably what kept me watching it. The trailer had thrilling music and made it seem like it would be action-packed. Unfortunately, it was slow and very dialogue heavy. You caught a glimpse of the characters’ backstories but the writers left it completely undeveloped, which was a shame because each of their stories would make for a great stand-alone movie. The big reveal at the end wasn’t much of an ah-ha moment. It was boring. I kept waiting for a twist that might come just before the credits that would make the whole watch worth it but sadly, it never came."
    },
    {
      "rating": "4.5/5",
      "review": "Fascinating movie, it's all you want from a spy film."
    },
    {
      "rating": "1.5/5",
      "review": "I was waiting for this movie to be a more exciting James Bond type, but flopped and boring."
    },
    {
      "rating": "4/5",
      "review": "Like a great game of clue, there are some great twists and turns with this tightly told mystery. There are some style choices of the way the movie was shot that I did not like but the acting was glorious (Cate Blanchett just oozes that charisma) and some very playful scenes. There are stages in this story where it could have been anyone but soon it kind of became obvious as to some of the story but it was so well told I didn't really care that much. The one thing I never really felt was a sense of stacks or anything on the line. Overall, incredibly fun and would highly recommend"
    },
    {
      "rating": "5/5",
      "review": "Hell yeah! After all the spy Movies that are out there, Soderbergh Managed to deliver something fresh, clever and intriguing. Cast rocks."
    },
    {
      "rating": "4/5",
      "review": "A retro mod thriller that is almost offputtingly languid in its approach but the hard-edged spouses at the centre are too cool to resist"
    },
    {
      "rating": "4/5",
      "review": "Michael Fassbender and Cate Blanchett are well-matched in this movie. It was interesting. A good spy story."
    },
    {
      "rating": "5/5",
      "review": "Very cool, sophisticated, with clever twists in a script that works and is believable. No elaborate sets or filming locations, no amazing special effects, just a good story."
    },
    {
      "rating": "0.5/5",
      "review": "So Sodering boring. To say this mess of a film is slow misses the point. It's wooden. The AI acting delivers the lines with some characterisation, but no-one bothered to programme any movement. Len Deighton in writing spy novels highlighted how damned dull it could all be. However, he never envisioned anything as boring as this. The reveal at the end could have been any of them, and the black bagged person would have elicited the same dead eyed audience reaction. The best bit...and I mean bit...elements of the polygraph test...but only elements. This is garbage, better suited to the stage, from people who should know better. For avoidance of doubt, it wouldn't work on stage either."
    },
    {
      "rating": "1/5",
      "review": "Slow moving and hard to follow. Don't waste your time."
    },
    {
      "rating": "4/5",
      "review": "Sleek, dry, stylish. Starts out a little slow and confusing, doesn't explain much explicitly, but makes it obvious as the story arc continues. A very character and dialogue driven spy-based whodunnit. Really enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "I’m usually skeptical about spy thrillers because they can feel repetitive, but Black Bag surprised me. It’s got classic espionage tension, but also an emotional core about marriage and trust that makes it unique. The pacing is tight, and I found myself really invested in the characters. Steven Soderbergh rarely disappoints."
    },
    {
      "rating": "5/5",
      "review": "Slick and sexy movie of 2025"
    },
    {
      "rating": "4/5",
      "review": "Soderbergh trades car chases for mind games in Black Bag, a tense, stylish slow-burn that’s less about saving the world and more about saving a marriage. Fassbender is all quiet suspicion; Blanchett, pure controlled fire. Dinner parties have never felt this dangerous. Think Tinker Tailor meets Virginia Woolf—and it works."
    },
    {
      "rating": "4.5/5",
      "review": "The story was hard to follow at times and some of the dialogue was exposition-heavy, but damn if this movie wasn't interesting. Each of the characters had a unique and distinct personality. I particularly enjoyed the dynamic between Cate Blanchett and Michael Fassbender. It had many thrilling moments/revelations that more than made up for some of the uninteresting dialogue. The music by David Holmes was great too."
    },
    {
      "rating": "5/5",
      "review": "Devilishly cleaver! With a small ensemble cast without one weak link, expert design, music, and directing, it’s best aspect may be a screenplay that will have you laughing and squirming on the edge of your seat for the last 30 minutes. The best thriller I’ve seen in years!"
    },
    {
      "rating": "3/5",
      "review": "Exciting & mysterious. A little hard to hear the words sometimes, but overall it was intriguing."
    },
    {
      "rating": "5/5",
      "review": "Classic spy movie with great storyline, quality script and great cast"
    },
    {
      "rating": "5/5",
      "review": "Well-written, sharp suspense-filled movie. A lot of moving parts requiring the viewer to invest attention to put the puzzle together."
    },
    {
      "rating": "1.5/5",
      "review": "Definitely forgetable movie. Blanchett lacks charisma of sex appeal. Rest of cast too. Dry movie in every sense."
    },
    {
      "rating": "4.5/5",
      "review": "Very well built and developed. Great cast and acting."
    },
    {
      "rating": "4.5/5",
      "review": "Suspenseful and sexy"
    },
    {
      "rating": "4/5",
      "review": "Small but sexy. Great casting, well written and direct."
    },
    {
      "rating": "3.5/5",
      "review": "An interesting, well handled and twisty little spy thriller, even if the plot is a little overcooked."
    },
    {
      "rating": "1.5/5",
      "review": "Almost fell asleep in the first half -- as did my wife and friends. Plot is way too complicated to understand or care about"
    },
    {
      "rating": "0.5/5",
      "review": "I watched based on critics reviews. What a mistake. Boring movie and a waste of money"
    },
    {
      "rating": "5/5",
      "review": "A taught and exciting 2 act spy thriller with, zero fat."
    },
    {
      "rating": "3.5/5",
      "review": "The movie does a nice job of building suspense. Intelligent script too."
    },
    {
      "rating": "1/5",
      "review": "Thoroughly unlikeable"
    },
    {
      "rating": "3.5/5",
      "review": "I liked it but feel like it would be better as a mini series. We don’t know enough about the relationship between Fassbender and Blanchett. Loved the dialogue and finally a movie for adults rather than the rubbish that gets churned out these days"
    },
    {
      "rating": "4/5",
      "review": "Great spy intrigue. Exciting, stylish, subtle and witty, if you don't mind Mr. & Mrs. Smith doing a lot of talking instead of shooting."
    },
    {
      "rating": "0.5/5",
      "review": "what happen to cates face ?! cant watch the movie cuz every time u see cate on screen u do the sign of the cross and yell \"begone demon\""
    },
    {
      "rating": "2/5",
      "review": "Too many twists may not be a sin, but the lack of emotional connection to the characters and the impending geopolitical disaster is... Another \"sleek\" and \"stylish\" Soderbergh and Koepp offering that lacks substance."
    },
    {
      "rating": "0.5/5",
      "review": "Very slow not much of a thriller. It is like a who done it. Nothing special about this movie."
    },
    {
      "rating": "5/5",
      "review": "Appropriate and exciting story line"
    },
    {
      "rating": "4/5",
      "review": "Un Sr. y Sra. Smith pero con clase, muy inlgesa."
    },
    {
      "rating": "3.5/5",
      "review": "Slow paced, kinda ok"
    },
    {
      "rating": "4/5",
      "review": "Great cast, fast paced and twisty"
    },
    {
      "rating": "0.5/5",
      "review": "Reeks of pretentious, couldnt get into it. What a snooze fest"
    },
    {
      "rating": "5/5",
      "review": "elegant, slow pace! a must see for 40 plus year olds."
    },
    {
      "rating": "3.5/5",
      "review": "The story struggles to captivate at first, particularly due to the underwhelming character of Cate Blanchett. However, it shows remarkable improvement by the end. Separate from that, what truly stands out is Soderbergh’s brilliance in applying new techniques—his direction is outstanding."
    },
    {
      "rating": "4.5/5",
      "review": "Fassbender never fails to deliver, even in bad films that hes done. Luckily for us, hes finally found a project worthy of his chops. Not breaking any new ground here but it didnt need to. It simply peeformed flawlessly, much as the films leading power couple would have executed an assigment."
    },
    {
      "rating": "4/5",
      "review": "Sleek movie, fun little story and great performances. It’s not “Mission: Impossible” though. Just go with the character story and don’t expect a James Bond kinda thing. It’s a drama, not an action movie."
    },
    {
      "rating": "5/5",
      "review": "Best date night movie for us."
    },
    {
      "rating": "2/5",
      "review": "I was really looking forward to enjoying this movie . The characters were slick, and it got off to a good start. Unfortunately, as with the majority of these types of movies, the plot became too complicated for me to grasp, and I have 20 years of education. It is one thing for a screenwriter to understand what’s going on after he or she has been working on a movie for a year. It is quite a different thing for a naïve viewer to grasp it all in an hour and a half. These writers think they are showing off their brilliance with all the plot twists and complications, but really what they’re showing is their ignorance and disregard about viewers comprehension, I suppose if I watched the movie five more times I would get it, But It just isn’t worth it. Too bad."
    },
    {
      "rating": "2/5",
      "review": "While it looked like a Tom Ford commercial the performances, direction and script were disappointing leaving it underwhelming as an early Apple film . We expected chocolate cake but really got a rice cake . Abela and Burke were excellent while Fasbender and Blanchett were underwhelming and shallow. The leads came across as cold and aloof with a dash of constipation Unlike Tinker Tailor Soldier Spy this film just lacked depth and interesting story telling . Wolfs was more fun with interesting characters . If you want chocolate cake go watch Tinker Tailor…, or Slow Horses . If you’d like a rice cake …. Well ….. seek help ?"
    },
    {
      "rating": "1/5",
      "review": "The characters are all tawdry and unlikable, so I have little interest in the outcomes. The lead character is like watching a robot. They are all overly sexual, especially the women, too, because that's supposed to be edgy, but it's not, it's just gross and weird."
    },
    {
      "rating": "3.5/5",
      "review": "Soderbergh directs a witty spy thriller elevated by the brilliant performances of its star-studded cast. The movie keeps you on edge for the entirety of its duration and delivers a satisfying twist ending."
    },
    {
      "rating": "3/5",
      "review": "Pretty good plot twist, but little boring for me"
    },
    {
      "rating": "3.5/5",
      "review": "A sophisticated spy film with excellent script and acting. Makes you think though so don't go expecting easy escapism."
    },
    {
      "rating": "5/5",
      "review": "Great movie! Great cast and writers."
    },
    {
      "rating": "4.5/5",
      "review": "An old fashioned spy film with a modern touch."
    },
    {
      "rating": "1.5/5",
      "review": "very very slow burn that doesn't really add up to anything also very convoluted."
    },
    {
      "rating": "5/5",
      "review": "I really liked the acting I think it was the best part of the movie especially Cate Blanchetts."
    },
    {
      "rating": "4.5/5",
      "review": "Very competint film. Solid. Crafted well. Good script."
    },
    {
      "rating": "2/5",
      "review": "Slow burn. Takes a while to sort out what's going on. Then the question is...do you care? I didn't much."
    },
    {
      "rating": "1.5/5",
      "review": "It's very difficult to make a spy movie entertaining - unless you pack it with lots of exotic locations, car chases, sex, and explosions. This one has none of those things. Having all of the characters speak in pretentiously posh British accents just makes the movie seem even more boring.."
    },
    {
      "rating": "5/5",
      "review": "Refreshing movie, when there are so few and far between."
    },
    {
      "rating": "1/5",
      "review": "Boring, I wouldn't recommend it to anyone !"
    },
    {
      "rating": "4/5",
      "review": "Clever and sexy with a fantastic cast and script. ☺️"
    },
    {
      "rating": "1.5/5",
      "review": "If you think over contrasted light bulbs and light sources in every scene, almost characterless performances, and the thinnest of plots makes a good movie - then crack on. Otherwise it's a fur coat no knickers movie for me. Nearly walked out, then it ended, Flatly. Clever ideas not apparent - there are way better \"Mr and Mrs Smith\" knock offs. I can't remember the last time I felt compelled to post a review - but I was expecting some entertainment. This is entertainment at .25% speed."
    },
    {
      "rating": "2.5/5",
      "review": "Ehhhh it was ok. Great actors though!!!!!"
    },
    {
      "rating": "1/5",
      "review": "I have been eagerly waiting to be able to watch this film. Today it happened, although throughout this disappointing movie, I was eagerly waiting to leave. Pearce Bronson is one of my favorite actors, but I can’t, for the life of me, figure out why he agreed to be in this film."
    },
    {
      "rating": "3.5/5",
      "review": "Always a pleasure to watch Soderbergh films, interesting plot but still a bit monotonous, but enjoyed it anyways"
    },
    {
      "rating": "3/5",
      "review": "pretty cool spy film, nothing crazy but well done"
    },
    {
      "rating": "3/5",
      "review": "A little hard to follow what's going on at times, but it keeps you interested. It's never totally clear, but it doesn't have to"
    },
    {
      "rating": "4/5",
      "review": "Pretty darn great but one can only imagine how much greater it would have been had Guy Ritchie been at the helm. In fact, at times, it seemed exactly like a Ritchie movie, which ain't a bad thing to be, even tho I love Soderbergh in equal measure albeit not to any great degree this time around. at the very least, however, BB is far better than Presence, his other most recent movie."
    },
    {
      "rating": "0.5/5",
      "review": "Test review!!!!!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Hard to give a full review of a movie I didn't get halfway through but I will say almost no movie do I ever give up on. Boring and confusing so I just stopped."
    },
    {
      "rating": "1/5",
      "review": "Acting was great, story was frankly not top notch. Great actors and acting. Could have been a better story."
    },
    {
      "rating": "4/5",
      "review": "Hard to score a movie that you don't understand."
    },
    {
      "rating": "5/5",
      "review": "an exceptionally well made movie. Its hard to compose a spy thriller without being action, but Soderbergh put something special together"
    },
    {
      "rating": "4/5",
      "review": "What a movie should be, entertaining. Great cast, engaging characters, dialogue and story, no distracting soundtrack, satisfying resolution of conflict and nice ending."
    },
    {
      "rating": "5/5",
      "review": "Without a doubt one of the best thrillers I have seen in years , clever story and great acting is all it took , to hold me to my seat , well worth watching to the end ."
    },
    {
      "rating": "5/5",
      "review": "I loved it. Almost any spy movie gets my full attention. (Too many heavy footfalls though.)"
    },
    {
      "rating": "5/5",
      "review": "Loved It!! Phenomenal performances by Michael Fassbender, Cate Blanchett, Pierce Brosnan, and the rest of the cast."
    },
    {
      "rating": "5/5",
      "review": "great cat/mouses movie keeps you guessing. all actors were great. top 5 movie in a long time. naysayers are just unintelligent boobs. watch this, you'll like it."
    },
    {
      "rating": "4/5",
      "review": "Interesting spy thriller that keeps you on your toes if you pay attention."
    },
    {
      "rating": "2/5",
      "review": "Movie moved really slowly. There wasnt much about this movie that I would classify as a thriller."
    },
    {
      "rating": "3/5",
      "review": "It started as a cat and mouse dinner, evolved into a spy story, not that action packed, more cerebral, interesting to figure out, great acting, but too confusing to really get involved in."
    },
    {
      "rating": "1.5/5",
      "review": "great cast great director so so movie"
    },
    {
      "rating": "0.5/5",
      "review": "Great cast, sleepy movie. Did not even make it past the first 45 minutes."
    },
    {
      "rating": "3/5",
      "review": "I went in with slightly low expectations and the movie was a little better than i expected, it kept my interest, kept me engaged just enough, and had me invested and caring about the characters. However, the ending was just so silly and unbelievable that it took me right out of the movie. Such a poorly written ending for a decent plot and build up thats why im taking off two stars just for the ending really…"
    },
    {
      "rating": "2/5",
      "review": "Details of plot were confusing. I liked the cast though"
    },
    {
      "rating": "1/5",
      "review": "I was hopeful for an enjoy action/ spy movie. What I got was a slow, limited plot, no action… checking my watch every ten minutes movie. Very disappointing and a head scratcher for the critics that gave this movie a good review."
    },
    {
      "rating": "5/5",
      "review": "I can understand why the audience meter is only 70 while the critics' meter is 96. This is a psychological thriller, not an action film. You have to work at keeping up with it right from the start. If you do, you are rewarded with a tight script and great acting, editing, and cinematography. If you don't engage with the movie right from the start, you will probably turn it off after 30 minutes."
    },
    {
      "rating": "1/5",
      "review": "Terrible movie. Very little action in the movie vs what was portrayed in the trailers. Also, hard to understand the actors speaking."
    },
    {
      "rating": "4/5",
      "review": "If you’re looking for a movie that keeps you engrossed throughout and gives you something to talk about afterwards, this is for you. And it was the perfect length—90 minutes."
    },
    {
      "rating": "2.5/5",
      "review": "It takes a spy to hunt a spy. Black Bag is a 2025 American spy thriller film directed by Steven Soderbergh 💻 Not bad, but not my favourite either 😐 Meh, it passed the time. Just. 😐👍🏼👎🏼 Tries to be a little too clever for its own good… When intelligence agent Kathryn Woodhouse is suspected of betraying the nation, her husband – also a legendary agent – faces the ultimate test of whether to be loyal to his marriage, or his country."
    },
    {
      "rating": "1/5",
      "review": "posh fantasy...purile drivel"
    },
    {
      "rating": "4.5/5",
      "review": "Fast paced intelligent drama with a great surprise ending."
    },
    {
      "rating": "3/5",
      "review": "We saw this at the theater. This is a sit-at-home and watch if nothing else is on. Not great not bad."
    },
    {
      "rating": "2/5",
      "review": "Feels more like a B movie, cut and dried plot and characters with a few locations and minimal action to save on budgeting. Like a low grade spy version of Knives Out. Blanchet is amazing, as usual, but this is another Soderberg dud."
    },
    {
      "rating": "4.5/5",
      "review": "Very good film. Complicated plot. Almost impossible to figure out with a twist at the very end."
    },
    {
      "rating": "5/5",
      "review": "Just what the doctor ordered. Well filmed and well directed. Left me wanting more"
    },
    {
      "rating": "3/5",
      "review": "Married couple George (Michael Fassbender) and Kathryn (Cate Blanchett) work for the same British intelligence agency. When a government software program by the name of Severus gets stolen, George's boss Philip (Gustaf Skarsgård) asks him to investigate the rat within their house. However, there's a small problem: one of the 5 people George is tasked to investigate is his loving wife Kathryn. Will George put his marriage over his career and country or is he love for her deeper than all of that? The story makes for quite the conundrum and Fassbender takes the bull by the horns with his portrayal of George, who is an extremely intelligent man who can spot a liar without a polygraph (it should also be noted as part of George's job is in fact to perform polygraphs as well). Like many others who are incredibly intelligent, George lacks any type of human emotion and empathy, coming off as robotic at times, but Fassbender still plays the crap out of it. I believed his affection for Kathryn more than I believed her affection towards him. Although lacking emotion George's feelings towards Kathryn seem genuine while hers come off as manipulative at times. The other standout performance for me was from Marisa Abela who plays Clarissa, another of the 5 suspects George is tasked with investigating. She's unapologetic in regards to the life she lives and the choices she's made. She's outspoken, speaks up for herself, and doesn't sugarcoat her feelings. The film is concise and tight, never dragging or feeling bloated for the sake of a specified runtime. Like any good spy, director Steven Soderbergh is in and out without overstaying his welcome. He's got another hit on his hands here."
    },
    {
      "rating": "2/5",
      "review": "Fassbender gets easily outshined by Blanchett and Brosnan and the plot is boring, no reason to stick around till the end, nothing really happens."
    },
    {
      "rating": "4/5",
      "review": "A very fun time. Not an action film (thankfully) but still plenty of movement to keep you on the edge of your seat."
    },
    {
      "rating": "4/5",
      "review": "Psychological drama - excellent character development - spoiler alert - if you like blood, guts and not having to think a little, this film is NOT for you. Hubby and I loved it."
    },
    {
      "rating": "2/5",
      "review": "Great actors but it was like being at a very slow dinner party because while the guests were witty & the plot had twists; I would have preferred to have eaten elsewhere"
    },
    {
      "rating": "4/5",
      "review": "Well made film, just nothing special. Kept me guessing as to \"who done it\" all the way through though."
    },
    {
      "rating": "1/5",
      "review": "This movie lacks action. It's a cerebral, mind game type of film that was so boring both me and my wife were falling asleep in the theater. I looked at this as some form of punishment rather than some form of entertainment. Most scene time seemed to take place in a room, and it felt like I was doomed to be present."
    },
    {
      "rating": "4.5/5",
      "review": "Loved it! Plot keeps you guessing. Very cool!"
    },
    {
      "rating": "3.5/5",
      "review": "Really smart intrigue with dark humor. The beginning is a bit slow which makes it hard to care for the characters but by the end, it catches you."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Compelling, twists and turns, a lot like watching a thrilling play as it unfolds! Highly recommend!"
    },
    {
      "rating": "1/5",
      "review": "Very boring film. I fell asleep."
    },
    {
      "rating": "4.5/5",
      "review": "Excellent ensemble cast! Humorous moments and captivating performances. I LOVE this movie!"
    },
    {
      "rating": "5/5",
      "review": "one of the best spy murder mystery no need for brutal action. just natural drama and stellar performance from the cast"
    },
    {
      "rating": "3/5",
      "review": "Ok movie I am not a Blanchett fan and even less so now she can't act her character is boring and these days looks like something out of a Halloween movie but the rest of the acting is solid and the story sort of pulls you in but not really so much that you can't pause it for long periods and come back to it. Wish I would have rented it and not bought it but maybe my friends and family will enjoy it more than I."
    },
    {
      "rating": "4.5/5",
      "review": "Very well acted spy thriller that was quite fun to watch. Unique story twists kept me engaged and the 90-minute run time was perfect for the movie."
    },
    {
      "rating": "1.5/5",
      "review": "The movie was very dry!"
    },
    {
      "rating": "4.5/5",
      "review": "A thinking man’s spy thriller. Not for those who prefer futuristic gadgets, car chases, and knockdown, drag-out fights. More for the John Le Carre crowd than the James Bond crowd. Only drawback - some of the dialogue is hard to follow."
    },
    {
      "rating": "1/5",
      "review": "Very slow, hard to understand what’s going on."
    },
    {
      "rating": "5/5",
      "review": "A bloody good spy movie, so cool and intelligent"
    },
    {
      "rating": "4/5",
      "review": "This one surprised me. Blanchett and Fassbender are magnetic, and Soderbergh’s direction keeps things tight and engaging. It’s not the most original spy story, but the execution is sharp and the tension builds nicely. Loved the cinematography too. Solid adult thriller energy."
    },
    {
      "rating": "5/5",
      "review": "Good movie very fast paced"
    },
    {
      "rating": "3.5/5",
      "review": "Gorgeously shot film with solid performances. If you like a crime mystery, this is top notch. We felt it was a little slow at times, but the cinematography and sharp performances got us through. A wonderful date-night pic, especially for those 35+. It's the kind of smart films that adults would go to in the 70s-90s, which is a breath of fresh air."
    },
    {
      "rating": "4.5/5",
      "review": "An effective thriller from a director who feels like he's back in his prime. A star-studded cast that never clashes, and a film that has its great successes and flaws, but ultimately feels different from anything we usually see, and that's already a point in favor of giving it a try, a thriller that you can enjoy from beginning to end."
    },
    {
      "rating": "5/5",
      "review": "Very nice to see a suspenseful spy movie with a couple that is not corny. Great dialogue throughout and great chemistry between the main couple."
    },
    {
      "rating": "1/5",
      "review": "Really sad to see another film with an all star cast end up absolutely boring and convoluted. The cast’s performances were well acted but the characters were boring, uninteresting and frankly unlikable/forgettable. My husband fell asleep pretty early on. I can’t imagine these actors signed up for a boring script so this one must have died on the editing room floor. Rest in peace. Don’t waste your time."
    },
    {
      "rating": "5/5",
      "review": "Brilliant high-tension spy drama; George reminded me of George Smiley. I thoroughly enjoyed this cat and mouse chase - not a dull moment, but you have to pay attention or you'll get lost."
    },
    {
      "rating": "3/5",
      "review": "Confusing vague story"
    },
    {
      "rating": "5/5",
      "review": "Strong performances and a total psychological rabbit hole."
    },
    {
      "rating": "1.5/5",
      "review": "Seriously 92% tomato rating on this? This was so crappy, it's not even funny....yeah, we got Fassbender and Blanchet, but come on....the story was a retread, how many times have we seen a rogue spy or double agent in an agency? Nothing new, it was very far fetched....and kind of boring. Soderbergh is hot and cold....I don't know what to make of him. I do know that the critics love him, so whatever he makes it must be good.....nope!"
    },
    {
      "rating": "3/5",
      "review": "An astonishing cast with a pace that was very up and down at times. The final act seemed rushed, where the film would've benefited more with a longer runtime and more focus on Fassbender's performance"
    },
    {
      "rating": "5/5",
      "review": "high tension, beautiful lighting, and great writing"
    },
    {
      "rating": "5/5",
      "review": "Best non-action-oriented spy movie since Tinker, Tailor, Soldier, Spy."
    },
    {
      "rating": "0.5/5",
      "review": "Such a slow, boring film. Not worth the payoff."
    },
    {
      "rating": "4/5",
      "review": "I enjoyed it, it was a spy thriller that kept you guessing on who did what."
    },
    {
      "rating": "5/5",
      "review": "I found this movie to be a great slow-burn spy movie with many intriguing twists and mysteries that's get you thinking. This is probably the most enjoyable experience I've had with any movie that has come out this year. The movie was great from start to finish, and had a fulfilling conclusion that makes the wait worth it. I recommend this movie as it is a great watch and is a must-see for sure!"
    },
    {
      "rating": "4/5",
      "review": "A clever, light romp through the secret world of our benevolent government in the pursuit of the security we seem to blindly expect. Nothing serious, but a reasonably told tale made by smooth editing, brilliant casting, and excellent acting. Good entertainment,... and that is what it's all about."
    },
    {
      "rating": "5/5",
      "review": "great acting throughout"
    },
    {
      "rating": "1/5",
      "review": "I found it hard to follow and boring 😴 I almost fell asleep"
    },
    {
      "rating": "1/5",
      "review": "This was horrible. I still cant tell you what the movie was about or who was cheating on who. Im disputing with my credit card."
    },
    {
      "rating": "5/5",
      "review": "Thoroughly enjoyable with many twists and turns to the point you will find it hard to know who the culprit is."
    },
    {
      "rating": "3/5",
      "review": "Another movie about spies that addresses the issue of trust / mistrust among characters with little flavor. It's only worth because you can see the great Cate Blanchett. It is the third consecutive job (The Killer, The Agency) in which Michael Fassbander plays the same character and begins to bore me."
    },
    {
      "rating": "3.5/5",
      "review": "Fun and not-too-long spy mystery set in the UK. A little hard to follow at a couple points but worthwhile nonetheless and enjoyable."
    },
    {
      "rating": "1.5/5",
      "review": "Such a pity. I expected more of such a stellar cast and Soderbergh. The sound is terrible like something Ive recorded on my phone. The dialogue is preposterous and superficial like all these people are academy professors. Not saying that the world of spies must be really entertaining, just don't make it into a movie of beautiful actors who don't really know what they are doing there. I survived until 11:27 minutes."
    },
    {
      "rating": "3/5",
      "review": "Clever, great performances across the board. Ads somewhat misleading enjoyed it, but I anticipated a bit more action."
    },
    {
      "rating": "5/5",
      "review": "Gotta hand it to casting & acting. Fantastic work. The writing & directing was on point. They all seemed to take their time on this one and cared. Synergy is the word that comes to mind."
    },
    {
      "rating": "4.5/5",
      "review": "It was quick short and sweet but very well done like reading a good novela"
    },
    {
      "rating": "3/5",
      "review": "Very confusing and seemingly incomplete. Seemed more like the second part of a two part movie b/c started in the middle."
    },
    {
      "rating": "3/5",
      "review": "A spy plot structured like a whodunit. Elegant & fun but too short to meet its potential. The highly saturated lighting looks very cool. The theme of truth & trust makes for well acted & compelling characters but it feels underdeveloped."
    },
    {
      "rating": "2.5/5",
      "review": "I just didn’t care about these very cool but very aloof characters and since the film was about their relationships over intrigue it was just boring until like the last 15 minutes."
    },
    {
      "rating": "4.5/5",
      "review": "A sophisticated suspense film, well paced."
    },
    {
      "rating": "4/5",
      "review": "Great movie, Michael Fassbender and Cate Blanchett are great and they deliver the dialogs in a way that you believe everything they say. I recommend it"
    },
    {
      "rating": "2.5/5",
      "review": "Probably written by someone who spends a lot of time at dinner parties as there is a very long scene at a dinner party. Maybe it was originally a play. Anyway, it wants to think it is clever and has some excellent acting but I was very happy that it was not a long film."
    },
    {
      "rating": "2.5/5",
      "review": "Smart writing and dialogue, but was I really supposed to care about any of these characters?"
    },
    {
      "rating": "3.5/5",
      "review": "It was smart, but more like a TV show. I just found it incredulous and I don't think spy agencies actually work like this. At least I hope they don't! The acting was really good, but there's no way someone could stab a co-worker in the hand and then just go back to work. The best way to shut down someone breaking the law at work is to report it, and I have to believe that spies would do this for sure. It would not be hard to unplug someone who is going off the rails. And that's what they should do, so you really have to suspend reality to go along with the story line. But IF you can believe it, you'll have a fun ride, and as I said, it's smart and well-acted."
    },
    {
      "rating": "1/5",
      "review": "Don't waist your money. There were some good moments but they didn't outweigh all the bad ones."
    },
    {
      "rating": "5/5",
      "review": "A fantastically paced movie, with a simple and elegant story told without falling into the temptation of time-wasting character frivolities or useless humor. Everything was sharp and focused. Movies like this are different because they focus so well on telling a story without the need for cheap tricks to garner views. If you are looking for action, explosion, or one-liners this movie is not for you. If you are looking for a superb story and fantastic film work, this is the movie for you!"
    },
    {
      "rating": "2/5",
      "review": "I liked Austin Powers better🤣🤣"
    },
    {
      "rating": "2/5",
      "review": "way too slow, boring, waste of time"
    },
    {
      "rating": "3/5",
      "review": "Decent movie, cool story, not really action packed, more of a spy thriller. A bit tough to understand the dialogue. The story was a tad predictable, but also unique in its own way. Pretty diverse cast as well which I could appreciate. All in all an okay film."
    },
    {
      "rating": "1.5/5",
      "review": "If you’re looking for the next Ocean’s 11, you’re in the wrong place. This is more like Ocean’s 2 1/3. It’s so slow. Not the good kind of skow where it’s building tension. The dragging, out my wife to sleep it’s so boring kind of slow. So, nah, just skip it."
    },
    {
      "rating": "4.5/5",
      "review": "loved the twists & turns in this spy film, felt a bit draggy at the beginning but when things start taking a turn, it speeds up full force & the crap hits the fan and I was stunned & impressed! I thoroughly enjoyed this movie and would definitely watch it again."
    },
    {
      "rating": "5/5",
      "review": "Smooth and great acting!"
    },
    {
      "rating": "0.5/5",
      "review": "I found it utterly boring. No action and no \"suspense\". Just a posh movie"
    },
    {
      "rating": "2/5",
      "review": "It took foreverrrrrrrr to get to where anything made sense. Then it was over just that fast. Wanted to leave many times but stuck it out. 2 out of 5 stars for me. There are Too many good actors to have an audience suffer so."
    },
    {
      "rating": "2.5/5",
      "review": "Boring. Drug on and on and on."
    },
    {
      "rating": "4/5",
      "review": "A real ass spy movie!"
    },
    {
      "rating": "4/5",
      "review": "Good plot with suspense"
    },
    {
      "rating": "5/5",
      "review": "An absolute gem of a film , perfect cast , keeps you guessing and Cate Blanchett seems to get hotter with age! So slick it's almost greasy !!!"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible - wooden performances by gorgeous but unsympathetic cast failing to interest or excite us in an unengaging script and storyline about an immoral caste of securocrats"
    },
    {
      "rating": "3/5",
      "review": "Typical Soderbergh. Watchable but be warned it's not an action spy thriller. It's a psychological thriller with all dialogue. All of the scenes are at someone's house, at the office, at a pub or on a pond fishing lol The entire movie is 1.5 hours.. For comparison, Anora, the Oscar winner for Best Picture was 2.5 hours. That being said, the plot for this movie was very minimal and doesn't make you care much about it."
    },
    {
      "rating": "3/5",
      "review": "Not bad. Stylish although it lacked depth. Credibility of the technology they were protecting was slim. Everyone looked great. Clothing, locations and decorating beautifully done."
    },
    {
      "rating": "3/5",
      "review": "wasn't very exciting"
    },
    {
      "rating": "0.5/5",
      "review": "gave it a shot. utter garbage."
    },
    {
      "rating": "3/5",
      "review": "Film noir without deep character development. Perfect actors, but without a perfect script. It just needed about 30 more minutes of script to realize it's potential"
    },
    {
      "rating": "0.5/5",
      "review": "Never see this…thing."
    },
    {
      "rating": "3/5",
      "review": "Disappointing, considering Soderbergh and the great cast. It wasn’t bad, it was just not that good either. Pretty forgettable."
    },
    {
      "rating": "5/5",
      "review": "Loved how fast paced this spy thriller was. Moved very much like Oceans 11"
    },
    {
      "rating": "1/5",
      "review": "could not finnish. terrible."
    },
    {
      "rating": "5/5",
      "review": "Best movie I have seen so far this year by a king way. Original. Great chemistry and fantastic ending."
    },
    {
      "rating": "0.5/5",
      "review": "Lousy drawnout movie......"
    },
    {
      "rating": "3.5/5",
      "review": "Great understated performances. It was a convoluted plot, but made sense at the end. It was a stylish piece best suited for people who are into more cerebral types of stories."
    },
    {
      "rating": "4/5",
      "review": "An extremely stylish and gripping spy drama. With razor-sharp dialogue, and standout performances, it keeps you on the edge of your seat from start to finish. The cinematography is sleek, the pacing is tight, making it a must-watch for fans of the genre 🧐✌️"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Intricate and intriguing with nothing drawn out."
    },
    {
      "rating": "0.5/5",
      "review": "Abysmal. One of the worst films I've ever seen."
    },
    {
      "rating": "5/5",
      "review": "Classic British spy drama at its best, Blanchett and Fassbender brilliant"
    },
    {
      "rating": "1/5",
      "review": "Ridiculous story and even worse ending that just left me disappointed, as I think with this cast it could have been so much better."
    },
    {
      "rating": "4.5/5",
      "review": "Slow burn spy thriller with some great dialogue and intrigue. I appreciated that they found ways to keep you hooked without relying on action sequences. Highly recommend!"
    },
    {
      "rating": "4/5",
      "review": "Very cerebral who-dunnit....kept me guessing until the end. The acting was great and engaging."
    },
    {
      "rating": "3/5",
      "review": "Confusing, dark and hard to hear."
    },
    {
      "rating": "5/5",
      "review": "It kept you guessing all the time and had some interesting twists. We left the movie theater pleasantly surprised and encouraged that an entertaining movie can still be found!"
    },
    {
      "rating": "4/5",
      "review": "I was looking forward to this one and wasn't disappointed. A good story with great acting, dialogue and suspense. A well done, who dunnit film. Its not an action film which I appreciated. As much as I enjoy a good John Wick style action movie, it was refreshing to see a move filled with well written dialogue, suspense and great acting / film making. If you enjoy film in general I think you will enjoy this one."
    },
    {
      "rating": "1/5",
      "review": "Complete rubbish. Didn't know what was going on the entire film. Lots of arty music and serious conversations about who knows what? The two main characters had no personality, so you just don't care what happens to them. But nothing does. Which pretty much sums up the film."
    },
    {
      "rating": "0.5/5",
      "review": "My wife saw it and begged me to go. Horrible. I dont see what anybody likes about this movie."
    },
    {
      "rating": "3.5/5",
      "review": "I will need to watch again with captions on because it's very dialogue heavy and the boomers next to me wouldn't STFU. I do appreciate that they didn't feel the need to make this a 3 hour movie."
    },
    {
      "rating": "3/5",
      "review": "This was a pretty run of the mill British spy thriller. It had a few moments when things got tense and all the pieces were locking together in an interesting way, but it really never was able to completely capitalize on what makes the genre so intriguing. They also wrap up the main storyline extremely quickly without really much excitement or drama. I enjoyed myself watching it, but largely forgettable."
    },
    {
      "rating": "4/5",
      "review": "The movie is exactly as advertised a taut 93-minute spy thriller that kept me guessing from start to finish."
    },
    {
      "rating": "1/5",
      "review": "This is a lazy joke of a film. I fell asleep. Completely underwhelming in terms of suspense and plot. It makes Space Jam 2 - which I was persuaded to take my grandchildren to - appear to be high art. I’d have given it a zero."
    },
    {
      "rating": "2/5",
      "review": "The cast was excellent. We watched the first 45 minutes and then left. The storyline was so slow and boring, we didn't care how it ended."
    },
    {
      "rating": "4.5/5",
      "review": "Taut well-written spy thriller with excellent cast."
    },
    {
      "rating": "3/5",
      "review": "The plot was convoluted and complex. In the end, it was just not that interesting."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie, wish it was longer!"
    },
    {
      "rating": "5/5",
      "review": "Terrific movie. A fast-paced, tense, well-acted masterpiece. Really enjoyed. We want to see it again."
    },
    {
      "rating": "3/5",
      "review": "All style, no plot. You will think it's all so obvious that there must surely be a big plot twist, and then the movie ends."
    },
    {
      "rating": "3.5/5",
      "review": "A solid spy thriller with a unique spin on the “whodunnit” scenario mixed with a playful subversion of the “Mr. and Mrs. Smith” dynamic. Cate Blanchett and Michael Fassbender both kill it as the super spy power couple from hell. The cinematography is nice and the soundtrack is very gripping. It’s a mostly laid back spy film, but the clever and intense finale brings everything full circle and feels satisfying with its twists and conclusions about the characters."
    },
    {
      "rating": "5/5",
      "review": "It was just an overall great movie"
    },
    {
      "rating": "1.5/5",
      "review": "Don’t waste your time or energy with this film. This is definitely one you can wait for on Netflix"
    },
    {
      "rating": "5/5",
      "review": "A great mystery with a great cast."
    },
    {
      "rating": "5/5",
      "review": "Smart and quick dialogue so you need to pay attention to the subtle clues as this spy thriller only last 1.5 hours. Small cast of characters but each is well acted."
    },
    {
      "rating": "5/5",
      "review": "Super smart - pay attention!"
    },
    {
      "rating": "4/5",
      "review": "Thoroughly enjoyable moviewell scripted, great cast, and a compelling story."
    },
    {
      "rating": "0.5/5",
      "review": "Very Dull Poor Sequence Very Disappointing Worst movie seen in many years 😡"
    },
    {
      "rating": "4/5",
      "review": "Star-studded cast. Excellent spy mystery. This one doesnt have a lot of action, so if thats what youre looking for, maybe not for you. It was well-written from start to finish with great acting. Highly recommend."
    },
    {
      "rating": "5/5",
      "review": "Solid movie! Great cast, intriguing plot, great dialogue."
    },
    {
      "rating": "2.5/5",
      "review": "Very difficult to understand, even though they were speaking English, but British English. I get three words out of each sentence. Storyline was OK, the stars were excellent. The background music was funky. All in all, 21/2 stars."
    },
    {
      "rating": "2/5",
      "review": "Slow moving, not all that clever. Zero action for a “spy thriller”. We found it boring."
    },
    {
      "rating": "4.5/5",
      "review": "I Loved The Movie. It Had Suspense, Drama, Funny Scenes, Unexpected Scenes. The Characters Played Their Parts Well And Were Familiar From Other Movies Or Streaming Series. Movie Well Done."
    },
    {
      "rating": "4.5/5",
      "review": "Fast paced, great dialogue and intrigue"
    },
    {
      "rating": "3/5",
      "review": "Honestly, this movie was slow. The reviews got me to go (93% Rotten Tomato and 7.1 IMDB). It was just ok. I should have watched the trailer for it before buying the tickets. I thought the trailer we slow too. Not sure what everyone liked about it."
    },
    {
      "rating": "5/5",
      "review": "One of the best spy psychological thrillers of 2025"
    },
    {
      "rating": "5/5",
      "review": "Thoroughly enjoyable! If you like spy movies, that is."
    },
    {
      "rating": "2/5",
      "review": "Soderbergh seems to be emulating John Le Carre--tinker,tailor,etc. Very British--a group of people who work together or are all friends. But being British, they all have secrets from each other. Seen all that before especially in British plays and movies. But for intrigue or spy or psychological thrillers, this wasn't much. Dark shadowy lighting, murky sets, cliche secret meetings in cellars and alleyways. Too much simplistic wooden dialogue yet speeches hard to follow or to even HEAR. A frustrating film that doesn't really give you much. Nothing special."
    },
    {
      "rating": "4.5/5",
      "review": "Need more in the elevator scene and need 15 more minutes."
    },
    {
      "rating": "1.5/5",
      "review": "Not much story. Not much sex no action hard to follow and disappointing. Whats the wig about Blanchette"
    },
    {
      "rating": "4/5",
      "review": "It’s a slow burn, but quite good."
    },
    {
      "rating": "5/5",
      "review": "Excellent spy mission movie !!! A must see!!!"
    },
    {
      "rating": "2.5/5",
      "review": "Too slow and dark (as in lighting). Good story line but lacked what we thought was going to be a lot of \"edge of the seat\" viewing."
    },
    {
      "rating": "5/5",
      "review": "Great movie, thrilling spy movie not to be missed."
    },
    {
      "rating": "3.5/5",
      "review": "Good movie, takes a little bit to pick up but solid. I enjoy it"
    },
    {
      "rating": "3/5",
      "review": "This is a new spin on the espionage drama. Here we see spies working together in the office and dining together as guests at another's private home. But there is a traitor in their midst. The film doesn't have much on action, but relies more on the dialogue to propel the plot forward. At times I wondered if this film was based on a stage play. If not, I think it could be transferred to the stage and work well."
    },
    {
      "rating": "1.5/5",
      "review": "Lord I hate giving any Cate Blanchett offering a low score but this movie is boring and just drags on."
    },
    {
      "rating": "4/5",
      "review": "I did not like the very minimal and vague dialogue in the movie. The film also reinforced some racial stereotypes."
    },
    {
      "rating": "1/5",
      "review": "Worst movie I have ever seen. What a waste of time. No one in our group liked it. It was a good time to sleep"
    },
    {
      "rating": "0.5/5",
      "review": "Just terrible. Should be called Bin Bag. Wooden acting, predictable plot and dull. If it wasn’t for the giant sized popcorn portion we had failed to consume we would have abandoned it after half hour. Not one to be recycled. If this is anything to go by Danny Dyer is a shoo-in to be the next James Bond."
    },
    {
      "rating": "3/5",
      "review": "Tinker Tailor Soldier Spy (2011) is my all time favorite movie, so I love the slow burning spy mystery genre. There are a lot of nods to that movie in this one--heck, the main character is a soft spoken spy named George who wears thick rimmed glasses! I appreciated the realism they tried to sprinkle in, although juxtaposed with completely ridiculous parts was counterproductive the verisimilitude they were trying to build. My main issue with the film is that I don't think it did a great job at a slow burning build up of knowledge and tension while the mole's plot was being pieced together. So overall the movie fell a little flat for me. The other problem I had was too much interpersonal drama and handwringing over relationships--to be fair that's one of the main themes of the film, but they overdid it IMO. Bottom line: it wasn't an awful movie, but it's also no Tinker Tailor."
    },
    {
      "rating": "5/5",
      "review": "Terrific, layered story with superb acting"
    },
    {
      "rating": "4.5/5",
      "review": "Mom & dad enjoyed its smarts though a bit tedious for teenage boys. Would have appreciated a few more staging shots w/in UK."
    },
    {
      "rating": "2/5",
      "review": "Good performances, especially by Marisa Abela, but too many annoying aspects, especially mysteriously wobbly accents, which made the plot difficult to follow (was the Pierce Brosnan character Irish, British or American?), cultural gaffes (there's no tipping in pubs) and gaps in the plot - what exactly was the role in the organisation of the Gustaf Skarsgard character?"
    },
    {
      "rating": "4/5",
      "review": "Reminded me of a 60s who done it. Great twist with fantastic acting."
    },
    {
      "rating": "2/5",
      "review": "Stylish, beautiful to look at, and the music was cool. Apart from that? Nothing. The plot was somehow both thin and confusing… confusing, I suppose, in that I was looking for more twists and hidden agendas where there were none. Not enough meat for a spy thriller, not enough dialogue/character complexity for a domestic thriller… not much thrill at all. Probably why I had to force myself to sit up straight so I wouldn’t fall asleep."
    },
    {
      "rating": "3.5/5",
      "review": "Very action packed with a lot of twists and turns! I would love to see a part 2."
    },
    {
      "rating": "5/5",
      "review": "Involved spy movie of the John Le Carre type. Not an action film, which is great. This film has interesting dialog and plot and character development. It does not hurry through and it does not drag. Good pace but not a James Bond action after action movie."
    },
    {
      "rating": "0.5/5",
      "review": "Super boring, hard to fallow"
    },
    {
      "rating": "1.5/5",
      "review": "Boring not enough action"
    },
    {
      "rating": "4.5/5",
      "review": "Very entertaining and kept me looking for answers in all the details. Loved the actors, the music, and the sets. Not the best movie ever made but worth a watch for sure."
    },
    {
      "rating": "0.5/5",
      "review": "Umm those of you taking this 5 stars and it was exciting, please tell us what movie you watched. This movie was boring, you basically walked in to the middle of a story from the beginning."
    },
    {
      "rating": "3.5/5",
      "review": "String performance. Well-paced intrigue. Excellent direction. Tidy ending."
    },
    {
      "rating": "5/5",
      "review": "Great whodunnit with excellent writing and acting old fashioned movie making. Thoroughly enjoyed."
    },
    {
      "rating": "1/5",
      "review": "This was an incredibly disappointing movie. It was simply boring with a convoluted plot that made 90 minutes seem like more than three hours. It was difficult to watch the entire film and we left the theatre disappointed that we wasted the night on this movie when there were such better alternatives."
    },
    {
      "rating": "4/5",
      "review": "Had alot of intrigue in it"
    },
    {
      "rating": "4/5",
      "review": "Good suspense/mystery film. Reminded me of Last of Sheila."
    },
    {
      "rating": "2.5/5",
      "review": "While Fassbender, Abela, and Harris were fun to watch, I was waiting the whole time for Mr. Brosnan to break the fourth wall and say, \"this is a load of rubbish.\""
    },
    {
      "rating": "1.5/5",
      "review": "I fell asleep while watching this movie. Very boring and hard to care about any of the characters. Do not recommend even if it was free."
    },
    {
      "rating": "5/5",
      "review": "Thrilling and quick! Worth the watch! And very VERY romantic, steamy.. yet very clean! Such a great watch!"
    },
    {
      "rating": "4.5/5",
      "review": "So much fun! The writing is inspired and performances stellar. You won’t know what or who to believe and will find yourself looking for sleight of hand to keep up. And all with a keen since of humor"
    },
    {
      "rating": "5/5",
      "review": "A great story line exceptionally well acted. Anyone who enjoys spy mystery stories will love this one."
    },
    {
      "rating": "1/5",
      "review": "So bad, boring, slow, virtually no plot. Cannot believe it was compared to mr and Mrs smith. Not even close. Very disappointed and happy to leave the cinema. I do not know what went wrong with such a set of top class actors who have been brilliant in everything else."
    },
    {
      "rating": "2/5",
      "review": "Huh??? Great cast but it seemed like it was trying too hard to be cool and esoteric. It lost its way from the very beginning, and never recovered. It somehow managed to be over the top and boring!!"
    },
    {
      "rating": "4.5/5",
      "review": "Very smart and well written. Super acting."
    },
    {
      "rating": "5/5",
      "review": "Absolutely the best! Edge of your seat is exciting!"
    },
    {
      "rating": "0.5/5",
      "review": "I don’t get the hype. I thought this was going to be an intriguing espionage mystery, but not in the least. It was well filmed, but the plot was overly straightforward and boring."
    },
    {
      "rating": "2/5",
      "review": "I did not think that the movie was as good as the trailer portrayed. The plot was kind of hard to follow. It seemed ongoing, there was hardly any action except towards the end."
    },
    {
      "rating": "4/5",
      "review": "A stylish presentation with coherent narrative. Enjoyed it."
    },
    {
      "rating": "4.5/5",
      "review": "Loved this film, super fun to watch!"
    },
    {
      "rating": "3/5",
      "review": "Very sexy. Care Blanchette moves from scene to scene like an ethereal goddess. The plot I found was difficult to follow due to poor annunciation of the script. The settings of spacious London dwellings to tranquil lake too high security offices were beguiling. Did I love it ? No, but it was entertaining."
    },
    {
      "rating": "1/5",
      "review": "I fell asleep half way in"
    },
    {
      "rating": "5/5",
      "review": "Great movie and acting. Fun. Think Knives Out."
    },
    {
      "rating": "3.5/5",
      "review": "Not bad but nothing to write home about either… interesting plot twist though, and the acting is pretty good overall."
    },
    {
      "rating": "0.5/5",
      "review": "Really slow! Kept waiting for something to happen. Not good at all. We left after 30 min!!"
    },
    {
      "rating": "3/5",
      "review": "Great acting n I loved the ending. In between it was ok I felt it dragged in some scenes."
    },
    {
      "rating": "4.5/5",
      "review": "To everyone who was saying it was convoluted, that you couldn't understand the accents, or that it was slow and boring... two words. Skill. Issues."
    },
    {
      "rating": "4/5",
      "review": "It was good but a bit slow unfolding."
    },
    {
      "rating": "5/5",
      "review": "Solid movie. Slow burn spy thriller. Can be a little subtle and tough to follow so definitely a movie you have to pay attention to, but well made and well acted. Worth checking out."
    },
    {
      "rating": "3/5",
      "review": "I always love a good spy tale, and this one has fun twists and turns. Unfortunately, I missed some of the dialogue due to the British accents. But it's well acted, and worth a watch. Still, I wouldn't call it Oscar material."
    },
    {
      "rating": "4/5",
      "review": "Hard to follow in the beginning, but wraps up nicely at the end"
    },
    {
      "rating": "5/5",
      "review": "REVIEW: “BLACK BAG” “FINALLY!” NO SPOILERS!!! I’ve seen so, so many bad movies in 2025, and I mean REALLY bad, there had to be one that could make up for all the filth. I give you, “BLACK BAG”. Directed by the genius STEVEN SODERBERGH, and written by DAVID KOEPP. The cast isn’t just fabulous, it’s superb, in a film that’s a classy, slick, and a stylish “WHO DUN IT?” All British cast(my favorite), with MICHAEL FASSBENDER as “GEORGE”, who steals the show, as he usually does, and CATE BLANCHETT as “KATHRYN”, his wife. The chemisty between them Is beautiful, and also the crux of the movie, will you put your marriage or your country first? Also PIERCE BROSNAN as “AUTHUR”, who does his usual bang up job as the head of the British intelligence. Only 1 hour and 33 minutes, but it never feels short because it starts immediately, and never lets you go. The beginning scene with all the characters at the dinner table Is a thing of beauty, the way It’s written and directed, and It sets the scene beautifully for the rest If the movie. An old fashion spy drama, that felt like it came from the 60’s, or 70’s. Where every single character could be the villain, and you never find out until the very end. Written beautifully, directed fabulously, with camera angles that would make “MISSION IMPOSSIBLE” and TOM CRUISE blush, and MICHAEL FASSBENDER steals the show yet again. It’s more about the spies themselves, their intimate lives, and how they try to separate their lethal jobs and their normal lives, then the devices, mission, and action."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was absolutely terrible no action whatsoever besides the last two minutes of the movie it is a very much a bore. I legit fell asleep watching it. If I could give it zero stars, I would."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Tightly woven spy movie"
    },
    {
      "rating": "1/5",
      "review": "Ugh! I wanted to walk out within the first 15 minutes. So contrived and confusing. Poor casting. A mishmash story. Poor Cate Blanchette's face looks tortured by some poorly planned, ultra tight plastic surgery. I loved her in so many earlier movies but vainly looked for life in her face just drained her performance of any human realism."
    },
    {
      "rating": "2.5/5",
      "review": "Very dark movie with a hard to follow plot. Acting good Interesting"
    },
    {
      "rating": "4.5/5",
      "review": "Excellent film. Sexy, well directed, great script and of course Fassbender, Blanchett and Brosnan round out a superb cast. But you need to stay alert because the twists and turns come a'flyin'. The world of espionage can be downright nasty. The New Cold War with Russia and China will give us a whole new dimension of cloak and daggers (more like hard drives and malware.)"
    },
    {
      "rating": "4/5",
      "review": "The acting was good. The story was old. Some of the tension was done well but other aspects were not great. Overall it was entertaining but left me wanting a bit more."
    },
    {
      "rating": "1/5",
      "review": "I walked out of the theater after 25 minutes, something I seldom do while watching a movie. Ah well."
    },
    {
      "rating": "4/5",
      "review": "A well written, acted and directed character thriller! A pleasant surprise! Definitely not a film for audiences that don’t appreciate great characters and great dialogue. Go see this film instead of garbage like Snow White! 8/10"
    },
    {
      "rating": "2.5/5",
      "review": "Did not care for this movie at all. Had hard time keep up with the plot"
    },
    {
      "rating": "2/5",
      "review": "Slow, boring, long, and not worth the time to see it in the theater. Watch it at home so you can play on your phone through the slow spots, which are many."
    },
    {
      "rating": "3/5",
      "review": "Good movie, but not as good as some of the other Steven Soderbergh movies such as the Ocean's series of movies or Erin Brockovich. I think it's worth seeing as the cast is great and the story is good, I just think it could have used a bit more liveliness to it!"
    },
    {
      "rating": "5/5",
      "review": "Amazing! a must watch… you don’t have to be into Spy movies to enjoy this Intellectual Masterpiece!"
    },
    {
      "rating": "4/5",
      "review": "Intriguing and entertaining. Dialogue driven but the story holds well throughout. One of the better Soderbergh films"
    },
    {
      "rating": "4.5/5",
      "review": "A complex plot which kept you guessing, this is a rarity in films at the moment and really welcome. The acting was brilliant from everyone in this. Could maybe have done with a little extra something but can’t quite put my finger on it. Runtime was perfect and kept me focused. Just that fish scene was a little off putting."
    },
    {
      "rating": "1.5/5",
      "review": "Found it very hard to follow and was still wondering what it was about 1 hour in. Did not enjoy it and would not recommend. Boring would be the best description."
    },
    {
      "rating": "3/5",
      "review": "Good acting but a very complex plot that is difficult to follow. Dealing with the British accents doesn't help."
    },
    {
      "rating": "3/5",
      "review": "Some good spy scenes and has a mysterious feeling towards the whole movie, but otherwise it was to short and it felt like the story was going to be more interesting instead of what we got."
    },
    {
      "rating": "5/5",
      "review": "Smart, slick spy thriller from Steven Soderbergh, with a stellar cast. Script is very clever, reminiscent of spy movies from the 60s or 70s. Kudos to the entire cast who all did such a great job. I hope it gets remembered come awards time."
    },
    {
      "rating": "3.5/5",
      "review": "Intriguing movie, but not real entertaining"
    },
    {
      "rating": "5/5",
      "review": "Great actors great plot made you think not too violent I do get tired of such violent films twist and turns are always good in a movie nice twist at the end"
    },
    {
      "rating": "4/5",
      "review": "it was a good quick movie which is obvious by all the good actors."
    },
    {
      "rating": "2/5",
      "review": "Typical Soderberg, cold as ice, somewhat lifeless, dialogue stilted and unremarkable, doesn't make much sense. Features an aging Michael Fassbender, and a heavily botoxed Cate Blanchett. Not much to recommend."
    },
    {
      "rating": "4/5",
      "review": "Pretty good! Good actors, good movie."
    },
    {
      "rating": "2/5",
      "review": "If you like crime solving mysteries, then you might like this movie. Myself, I thought it was very dry and slow. I fell asleep in the theater, which I normally don’t do."
    },
    {
      "rating": "5/5",
      "review": "Loved it. Slow burn mystery. All about the dialogue and acting but also well paced."
    },
    {
      "rating": "3/5",
      "review": "British spy movie. If you’re looking for over the top action like John Wick or Mission impossible or James Bond, you’ll be disappointed. It has lots of talking and psychological drama."
    },
    {
      "rating": "1/5",
      "review": "You have to listen attentively to the actors since they have heavy British accents and different colloquialisms, which is fine. The pacing was slow and the plot was muddled--couldn't figure out what was going on. I heard gunshots, which were in the movie, that awakened me from my movie nap and then the film ended. Perfect!"
    },
    {
      "rating": "4/5",
      "review": "It was a little confusing, but I liked it."
    },
    {
      "rating": "4/5",
      "review": "A well-paced British spy thriller with great performances!"
    },
    {
      "rating": "3/5",
      "review": "I thought the movie was really slow a little confusing"
    },
    {
      "rating": "0.5/5",
      "review": "This is not my type of movie. I was bored."
    },
    {
      "rating": "5/5",
      "review": "Good acting, tight script, kept me guessing until the end"
    },
    {
      "rating": "1/5",
      "review": "Honestly - I was bored. Unlikable characters, unrealistic exchanges between the two leads. No tension, no pace. I can't think of any positives- even the twists were about as exciting as stale bread. Give it a miss."
    },
    {
      "rating": "5/5",
      "review": "Great movie and cast!@ Big Sodeburgh fan!!"
    },
    {
      "rating": "4/5",
      "review": "An awesome spy thriller. I believe the criticism of it being hard to follow is unfair. It’s more about finding your bearings at the beginning, as the film drops you right in. Stating that the movie is boring or that it shouldn’t have made it to theaters as some reviews are, is a lazy opinion of the dull minded."
    },
    {
      "rating": "3.5/5",
      "review": "I'd say it was pretty good. The acting was solid and the plot was interesting, but you need to pay close attention to the dialog. For me, I wouldn't rate it higher as the energy was a bit flat... didn't have much difference between the lows and highs of the film."
    },
    {
      "rating": "4.5/5",
      "review": "Gila seruuuuu banget ni film saya nonton hampir 6x"
    },
    {
      "rating": "2.5/5",
      "review": "A film to watch twice to fully follow the plot; not interesting enough to want to watch twice."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was slow, I kept falling asleep. It wasnt action just talking. I like the actors and I did understand the plot. But , I wasnt for me, even though I close the movie."
    },
    {
      "rating": "5/5",
      "review": "Decent movie but more like a thriller"
    },
    {
      "rating": "1.5/5",
      "review": "It’s over rated not worth going to cinema for perfect for streaming but just too boring for cinema."
    },
    {
      "rating": "4/5",
      "review": "Sexy, sophisticated spy drama that will not disappoint fans of director Steven Soderbergh or either of the leads, Cate Blanchett and Michael Fassbender."
    },
    {
      "rating": "4.5/5",
      "review": "Great story -- kind of Agatha Christie/Hercule Poirot style in \"spy.\" Well acted, very well casted and engaging."
    },
    {
      "rating": "1/5",
      "review": "Movie was hard to follow. Plot wasnt clear. Glad the movie was under 2 hours."
    },
    {
      "rating": "4/5",
      "review": "Clever story, suspenseful, good acting but the cinematography was bad. Everything was dark and unfocused, I could barely make out what was going on."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie. Storyline hard to follow. Trailers were only CB okay."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible, so slow and hard to understand. Wouldn’t recommend even to stream it when it comes out. Don’t waste your money on this flick!"
    },
    {
      "rating": "5/5",
      "review": "Smart entering and cool 😎"
    },
    {
      "rating": "2/5",
      "review": "I found my attention waning. Plot was muddy, and I didn't find myself rooting for any of the characters. Give me something to get behind."
    },
    {
      "rating": "4.5/5",
      "review": "I did not like this movie I loved it . Call me a bore for a tight well written character study on the duplicitous nature of marriage sex love and relationships. This truly shows Steven working at his sex lies video tape best. Do not walk to theater run !!!!!! It’s that good"
    },
    {
      "rating": "4/5",
      "review": "Decent movie, light on action more of a mental thriller."
    },
    {
      "rating": "3/5",
      "review": "Interesting story plot as I tried to piece together the facts along with the character George. However, the story unfolded too slowly for me and was more of a sleeper instead of an audience engaging mystery that I was hoping for."
    },
    {
      "rating": "4/5",
      "review": "I most enjoyed the plot and the various twists therein. During the beginning of the movie it was difficult to understand the dialogue due to the British accents and fast dialogue but as I continued to watch that became easier."
    },
    {
      "rating": "0.5/5",
      "review": "Boring and hard to follow."
    },
    {
      "rating": "0.5/5",
      "review": "Insanely slow and boring."
    },
    {
      "rating": "1.5/5",
      "review": "This movie is disjointed. First hour is confusing. There’s a traitor that stole money. It feels like you are in the middle of a season and you selected a random episode. No action, lots of talking. Boring confusing. Pointless"
    },
    {
      "rating": "4/5",
      "review": "Great acting, but too little character development."
    },
    {
      "rating": "5/5",
      "review": "This movie was very entertaining to my husband and myself. I would definitely recommend people to go see."
    },
    {
      "rating": "3/5",
      "review": "Why? Love Soderbergh style, love spy genre, cast is beautiful, movie is beautiful, but at the end I asked why. This is one of these movies where I ask why they made this. Fassbender did this with more depth in The Agency. Cate was CIA in Hanna. I do not mind a slow burn intellectual thriller, and I love the idolized style of a spy's life, but at the end of the day this didn't break new ground or put some actors together for a vanity project the audience was craving like Wolfs. This would have been better suited for a direct to streaming. And lastly, casting Marisa Abela in that role is lazy. Love her and what she does but once again I feel that casting directors have gotten super lazy. Let's be honest, as good as he is, is Giancarlo Esposito, the ONLY villain available??"
    },
    {
      "rating": "0.5/5",
      "review": "Truly awful movie, lame story line accompanied by zero action. What a waste of money."
    },
    {
      "rating": "3.5/5",
      "review": "It's a cerebral mystery/drama. Hardly any violence, maybe 2 scenes. Good acting from the two stars - Fassbender and Blanchet. Good support cast and nice to see Pierce Brosnan on the screen. Held our attention for the whole movie. Definitely worth seeing."
    },
    {
      "rating": "1.5/5",
      "review": "I still have no idea what happened in this movie. So convoluted. Ocean's Eleven without the fun."
    },
    {
      "rating": "5/5",
      "review": "The length and the cast kept me interested and the lack of violence."
    },
    {
      "rating": "3.5/5",
      "review": "Well done mystery thriller. It was fun and worked well and had me engaged and trying to see where the story would go. I'd say it's worth a watch if you enjoy spy/mystery thriller films."
    },
    {
      "rating": "3/5",
      "review": "It was ok, slow for a spy movie, no action, more talking than anything else, and the plot is not clear, it is one of those movies where they try to confuse you and at the end of the movie is when it makes sense, I think is bad writing, or better said, not what I like, this felling of a forced story that seems to tell you how the characters are to tell tell you at the end they are not what the story was telling. The acting was very good, that is something to be noted, Michael Fassbender was great in this role"
    },
    {
      "rating": "2/5",
      "review": "The last 15 minutes finally, it all came together, hard to know what was going on at the beginning and middle of the show. Very disjointed."
    },
    {
      "rating": "5/5",
      "review": "Great film: Glad I ignored the majority of audience reviews & went to experience it! This is a sophisticated film which demands that we pay attention as the action unfolds. Everyone is in top form, & the plot moves quickly to its satisfying conclusion. Yes, I hope there’s a sequel in the making, or a series developed with this film as its origin."
    },
    {
      "rating": "4/5",
      "review": "I liiked the two main actors very much. Story was ok but the acting was excellent"
    },
    {
      "rating": "4.5/5",
      "review": "An understated, excellent drama/mystery. Everything from the performances, the direction, and the tightly written script were just terrific"
    },
    {
      "rating": "5/5",
      "review": "This was so good, total mind f*! Keeps you on edge of your seat the whole time thinking. Totally provocative as well"
    },
    {
      "rating": "4/5",
      "review": "Steven Soderberg’s visually arresting direction and charismatic performances from Cate Blanchett and Michael Fassbender ensure this modest tale of skullduggery is always entertaining.  Recommended. detroitcineaste"
    },
    {
      "rating": "4.5/5",
      "review": "Good Brit spy-flick whodunit. Has you wondering all the way to the end. Well cast, well edited, thoroughly satisfying."
    },
    {
      "rating": "4/5",
      "review": "Slow burn type of movie but super creative and builds to a very fun ending!"
    },
    {
      "rating": "1.5/5",
      "review": "If you want to see people sit down and talk. Then this is ur movie"
    },
    {
      "rating": "5/5",
      "review": "Absolutely loved this. The story, the editing, the art direction, and the pace. It’s one of those “they don’t make them like they used to” movies, but they did. It’s a nice way to mix a spy thriller with a “who dunnit” and it’s doesn’t fall into the conventional spy tropes. So good all around."
    },
    {
      "rating": "3.5/5",
      "review": "It’s a cool spy movie that makes you get creative to try to draw your own determination at who the mole is before you find out."
    },
    {
      "rating": "1.5/5",
      "review": "This felt like an ITV mini series with all potential and styling, but without the guts. Obviously aping classic 60s espionage, with its style and phrasing, it simply didn’t deliver, in my opinion."
    },
    {
      "rating": "5/5",
      "review": "Slow burn! Very good!"
    },
    {
      "rating": "4/5",
      "review": "The Demystification of Spies or How to Be a Spy and an Office Worker at the Same Time, Without Getting Caught nor Die trying... Spoiler, Not Everyone Succeeds. A married couple are part of a spy organization, and the husband has received a tip that there's a leak in the organization. The list has been narrowed down to 5 people, and his wife is among them. Now he must investigate from the intimacy of their home to the office itself, to discover who is leaking information. A serious drama/suspense, without spy clichés, gadgets, chases (almost), etc. On the contrary, it goes towards a more investigative side without so much fanfare but very interesting, a kind of \"Guess Who\" spy version. Highly recommended."
    },
    {
      "rating": "4/5",
      "review": "Squeaky clean modern spy thiller that doesn't leave the audience at the security check. Great to this style of mystery thriving in such a satisfiying way. Recommended!"
    },
    {
      "rating": "2/5",
      "review": "Boring. Too slow. Too much confusing dialog"
    },
    {
      "rating": "4.5/5",
      "review": "Interesting plot. Suspenseful. Surprise ending. Really enjoyed the whole movie."
    },
    {
      "rating": "0.5/5",
      "review": "Worse than Joker 2. Save yourself..."
    },
    {
      "rating": "0.5/5",
      "review": "Boooooooooo the worse movie ever"
    },
    {
      "rating": "5/5",
      "review": "a slow burn movie that keeps you guessing until the end. I love that it doesn't treat its audience like idiots."
    },
    {
      "rating": "1/5",
      "review": "I really wanted to like this movie but... The plot just kind of rambled on and on... with actors difficult for this Connecticut guy to understand many of the actors. I don't know if this was due to the dialect or bad microphones or what. It was a complex situation they were developing and without good clear words to help understand it was pretty close to impossible to make much sense out of much of what was going on. Blackmail, marital breakups, back stabbing, etc. Maybe this is what spy's do with their free time and it's just me that doesn't get it.... They kept trying to tie Russia into the personal relations between these people who I am guessing were all spies for the English government. I think if I watched this whole movie again, with closed captions, I would probably understand a lot more but you know what? It really didn't seem interesting enough for me to want to sit through again.. Sorry folks."
    },
    {
      "rating": "5/5",
      "review": "Excellent spy movie that mixes bizarre relationships with espionage work."
    },
    {
      "rating": "3/5",
      "review": "It was hard to understand the British accent and fast talk. A good plot, but hard for me to follow. I will watch it again when it comes out on Netflix just to see if it is easier to follow."
    },
    {
      "rating": "5/5",
      "review": "Definitely worth a see! Great spy flick with excellent acting!"
    },
    {
      "rating": "4.5/5",
      "review": "I liked it! Tye plot is awesome"
    },
    {
      "rating": "3/5",
      "review": "Good actors of course. Very slow moving. Setting the stage but dang, it took awhile. Low budget of course. I eventually liked the plot, but this was a waste of great talent. Does anyone ever actually look at the film before it is released? Ever?"
    },
    {
      "rating": "5/5",
      "review": "Absolutely amazing and so original. I can maybe understand a younger crowd below the age of 35 maybe not appreciating it as much however the music the characters and the plot are just so original and it just works thoroughly entertained. The element of suspense is so perfectly balanced throughout the film and the characters are All except exceptional"
    },
    {
      "rating": "3/5",
      "review": "Pretty slow but decent story. Had to fight dozing off. Ending wasn't too bad. Okay movie."
    },
    {
      "rating": "2/5",
      "review": "What a disappointment! Boring. Never felt involved with any of the characters. Walking out of the theater, I heard others also say it was awful. And who on earth decided on that terrible hairdo for Cate Blanchette?"
    },
    {
      "rating": "4/5",
      "review": "Keeps you guessing all the time"
    },
    {
      "rating": "3/5",
      "review": "Hard to follow !! I dont know who was good or bad. Ha"
    },
    {
      "rating": "5/5",
      "review": "Steady and thought provoking movie. Slow build up. Great acting. Brilliant directing."
    },
    {
      "rating": "2.5/5",
      "review": "Great actors, but the plot was very slow"
    },
    {
      "rating": "4/5",
      "review": "Great cast and a few good twists. Definitely need to pay attention throughout the film."
    },
    {
      "rating": "1/5",
      "review": "Was very slow, did not care for it. Actors were sometimes hard to understand"
    },
    {
      "rating": "0.5/5",
      "review": "The film was terrible. Slow. It felt long and it wasn't even 2 hours. Big disappointment because the actors are super talented."
    },
    {
      "rating": "5/5",
      "review": "Definitely a who-dunnit kind of movie with a lot of moving parts and you're not sure who to trust. Kept us engaged to the end. Wonderful acting from the Fassbender and Blanchett duo."
    },
    {
      "rating": "1.5/5",
      "review": "A little dark photography. A slow moving movie. Some unexpected twist. Almost impossible to figure out the ending. Expected better."
    },
    {
      "rating": "2.5/5",
      "review": "It was action packed but way too “spy thriller” for me. I didn’t understand half of what they were talking about!"
    },
    {
      "rating": "3.5/5",
      "review": "Could have made the movie a little longer adding some explanation. Left the theatre wondering was this a good movie or not. I left confused."
    },
    {
      "rating": "5/5",
      "review": "Gripping from start to finish!"
    },
    {
      "rating": "5/5",
      "review": "Think The Thin man meets Slow Horses. Why this movie got no ad campaign is a mystery. A smart spy thriller, with a great supporting cast. Sometimes movies with A list actors in the leads the supporting cast are an after thought, but not here. Excellent !"
    },
    {
      "rating": "0.5/5",
      "review": "I thought it was extremly boring!!!!! Wanted to walk out!!!!"
    },
    {
      "rating": "5/5",
      "review": "Great movie best of 2025 so far."
    },
    {
      "rating": "5/5",
      "review": "Great movie, had my braining thinking the whole time! I was wrong about the mole - it was NOT the wife!"
    },
    {
      "rating": "1/5",
      "review": "This is a lamentable film. Good production values and a very good cast line up are just not enough to make up for the dull script and poor execution of quite a well worn story line of \"we've a mole, so who is it?\" The opening sequence of this film is an overlong dinner table event soaked in melodrama and a wholly unbelieveable moment of violence by one of the protagonists. The film grinds and groans on as each of the characters is \"framed\" as being a suspect in this free of any suspense tale. Not even close to the thriller that this is suposed to be. It's a 94 minute exercise in testing the patience of a viewer. The immediate cinema comparison is Tinker Tailor Soldier Spy which was outstanding. Here, there seemed no onscreen chemistry between any of the characters; not helped by the fact that none of the characters were that likeable. Just a bunch of sad people in a sad business. Blanchett et al can't be proud of this. Neither can Soderbergh who has produced some really good films among his previous 33 cinema efforts. Naomie Harris - her of the silky smooth voice in the Bond franchise - was cast as a lass from the North. Her wobbling accent placed her as being from Manchester, Leeds and Tyneside (linguistically, hugely different UK Regions) in the space of just a few minutes. Tom Burke's efforts were also cringe inducing. So, it's not about money and it's not about the cast line-up - this film just missed the targets. I sat through this for just over the hour and actually missed the end, preferring a quick one in the pub before driving home. But, d'you know what? I couldn't have cared less what happened in the end."
    },
    {
      "rating": "5/5",
      "review": "With such a high rating, I decided to watch it tonight."
    },
    {
      "rating": "4/5",
      "review": "Excellent acting from lead Johnathan. Very powerful film. Showed realistic portrayal of the Body Building industry, with a strong message on seeking bodily perfection to a point if losing oneself. Johnathan should have been nominated for an Oscar."
    },
    {
      "rating": "3.5/5",
      "review": "This movie needs captions so badly."
    },
    {
      "rating": "5/5",
      "review": "Finally a film with both brains and soul. Cool to the touch but simmering throughout. Soderbergh, Fassbender and Blanchet come through with some of their finest work. The entire cast shines with an excellent script to work with."
    },
    {
      "rating": "4/5",
      "review": "A solid movie overall. There are certainly moments that can be confusing and even a little slow. However, if you want a movie that really gets you thinking this is top tier at that."
    },
    {
      "rating": "3.5/5",
      "review": "not deep but highly entertaining with two great stars. Soderberg always delivers."
    },
    {
      "rating": "1/5",
      "review": "Terrible movie. Plot was uninspiring."
    },
    {
      "rating": "5/5",
      "review": "This movie has a great cast and an interesting plot that really holds your attention."
    },
    {
      "rating": "5/5",
      "review": "Excellent story, great acting and just the right length at 1:33. Slow bit steady pace kept me interested from start to finish. I reccomend this movie."
    },
    {
      "rating": "5/5",
      "review": "Loved the movie. It was full of twists and turns. It kept my attention."
    },
    {
      "rating": "5/5",
      "review": "A rarity in cinemas these days - an intelligent and entertaining thriller that doesn’t rely on special effects and blowing everything up at the end. Crisp dialogue and pace. Brilliant cast. And it’s British so you can hear the actors’ words without that US industry murmuring on screen. Nice to see Tom Burke leave his scruffy private detective behind and Michael Fassbender play a mix of Harry Palmer and George Smiley. Took a while to realise I was watching Naomi Harris - another very watchable actor."
    },
    {
      "rating": "1.5/5",
      "review": "I didn't get it....not what I expected in a spy movie. It was weird."
    },
    {
      "rating": "5/5",
      "review": "Nice and complicated"
    },
    {
      "rating": "3.5/5",
      "review": "Very stylized, quick moving, if a little convoluted. All in all a fun romp with gorgeous actors, settings and costuming."
    },
    {
      "rating": "0.5/5",
      "review": "YAWN. ZZZZZzzzzz. Borrrrring."
    }
  ]
}