{
  "movie_name": "The Monkey",
  "reviews": [
    {
      "rating": "3/5",
      "review": "The movie itself is enjoyable to watch. It is a horror movie, but unless your creeped out by blood I would say you'll encounter the same effect as a jump scare. Definitely a lot of gore. The movie itself is shorter."
    },
    {
      "rating": "1/5",
      "review": "The overall vibe is too weird. Is this dark comedy? Is this drama? And it's not that fun. Somewhat boring at a lot of times."
    },
    {
      "rating": "2.5/5",
      "review": "Lil campy if you ask me."
    },
    {
      "rating": "1.5/5",
      "review": "I see little reason to watch this more than once. If you’re interested in a cheesy horror flick this is for you. Doesn’t take itself very seriously"
    },
    {
      "rating": "2.5/5",
      "review": "Fun time with fun kills, but I wish it followed its own rules and had less drastic plot holes."
    },
    {
      "rating": "2/5",
      "review": "purposefully dark comedy. purposefully awkward. purposefully sardonically scripted. purposefully gross ...accidentally missing the mark."
    },
    {
      "rating": "4/5",
      "review": "I think this movie was good, and worth the watch. It had issues for sure. It was more of a comedy with a good amount of gore. I think it kept running jokes too long and some really didn't work. But I really did enjoy most of the story. I'm a massive fan of the concept of cursed objects and the idea of how they cause drastic consequences. If you want a dead serious horror movie this is not the one. It's fun if you're into that kind of horror."
    },
    {
      "rating": "2.5/5",
      "review": "Gore fest with some comedic relief."
    },
    {
      "rating": "1.5/5",
      "review": "Pretty boring. Also, what was that storyline with his brother? Unnecessary and just weird. Love two Theo James tho"
    },
    {
      "rating": "1.5/5",
      "review": "It's like if Annabelle and Final Destination had a really weird baby."
    },
    {
      "rating": "1.5/5",
      "review": "I heard good things about it and was expecting to like it, but it was awful. Over the top corny. Gore fans may enjoy it most, but the storyline, pacing, and performances were all just off to me."
    },
    {
      "rating": "3.5/5",
      "review": "Una película que vale la pena mirar si estas un sábado aburrido y no hay nada que ver, es entretenida con toques de humor aunque las escenas de muerte gráficas otorgan una experiencia inolvidable"
    },
    {
      "rating": "3/5",
      "review": "Pretty empty story just a lot of blood and zero emotion deaths. Guess funny af when you re high af"
    },
    {
      "rating": "5/5",
      "review": "I loved this movie definitely worth a watch if you like horror comedy movies!"
    },
    {
      "rating": "3/5",
      "review": "It was okay but cliffhanger"
    },
    {
      "rating": "1/5",
      "review": "wtf bro la gente estalla manin, malo, la vverdad no me pare de la silla y me fui pq mis amigos son mongolicos y dijeron que ya habian pagado la boleta entonces me quede a \"verla\" con los ojos cerrados, muy buena, pa dormir"
    },
    {
      "rating": "3/5",
      "review": "Filme é bom, mas as piadas estilo \"scary movie\" para mim não fizeram sentido."
    },
    {
      "rating": "3.5/5",
      "review": "Rating: 7/10. 76/100"
    },
    {
      "rating": "0.5/5",
      "review": "Literalmente não consegui assistir o filme até a metade, foi uma cólica cinematográfica que não consegui aguentar até o final."
    },
    {
      "rating": "4/5",
      "review": "Well done, gory , and interesting. I enjoyed it. Didn't think it was going to be this good. Happy surprise."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is so bad, a whole waste of time"
    },
    {
      "rating": "3.5/5",
      "review": "Gloriously gross. Don’t expect a serious horror here; it’s just good, icky fun."
    },
    {
      "rating": "0.5/5",
      "review": "Es una película demaciado aburrida, muertes sin causas y malas muertes. Incluso la película debió haber terminado a las hora para que fuera decente. Tiempo perdido."
    },
    {
      "rating": "2.5/5",
      "review": "Good actors and good acting. But the story is too flat and unengaging. Boring."
    },
    {
      "rating": "1/5",
      "review": "Maybe it got better but I couldn't risk wasting my time. Turned it off 30 minutes in."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie ever!! Don’t waste your time"
    },
    {
      "rating": "3/5",
      "review": "This was very far from what I expected it to be, but not in a bad way. Perkins has a sense of humor that is just bordering on cringe but manages to stay on the right side of it, and the kills have just enough build-up and pay-off to keep you in your seat for the next one. Too tongue-in-cheek to be scary, but entertaining enough, with fine performances in spite of the paper thin storyline and wholly unsupported twist."
    },
    {
      "rating": "0.5/5",
      "review": "this is trash. WASTE OF TIME"
    },
    {
      "rating": "3.5/5",
      "review": "The actors all knew this was a gory B-movie and played their roles perfectly. A “horror” movie doesn’t need to scare you to be good. This is more on the gruesome comedy side of things."
    },
    {
      "rating": "2/5",
      "review": "Ehh wasn’t the best but wasn’t the worse it was just a very redundant movie I lost interest halfway through the show definitely could have waited to watch when it was available on streaming platforms"
    },
    {
      "rating": "2/5",
      "review": "I should have believed the audience reviews. What an incoherent mess!"
    },
    {
      "rating": "2/5",
      "review": "Realmente tiene un buen inicio, pero poco a poco va perdiendo el ritmo, fuerza y termina estrellándose, volviéndose una película normal pero que no se volvería a ver, realmente es aburrido el acto final, esperaba mucho mas de esta película."
    },
    {
      "rating": "2/5",
      "review": "Went into this movie thinking it was a horror movie, I was surprised that it was trying to be a comedy. Some of the kills in the movie are very well done"
    },
    {
      "rating": "3.5/5",
      "review": "An entertaining film. It isn't meant to be taken too seriously. The deaths are creative and at times funny. Pacing is overall decent. I haven't read the book the story is adapted from, so I can't draw any comparisons, but as a standalone work of film it was good."
    },
    {
      "rating": "2/5",
      "review": "The storyline wasn't thought through, not enough scary factors. Movie was really random with a couple of good jokes."
    },
    {
      "rating": "3/5",
      "review": "I was so confused during this movie"
    },
    {
      "rating": "2.5/5",
      "review": "Not funny enough, to be a comedy and not scary enough to be a horror movie. The comedy falls flat for me and most of the time felt rather awkward/wierd than funny. The movie has some decent kills to offer but nothing more."
    },
    {
      "rating": "1.5/5",
      "review": "This is the Robbie Williams documentary which was really good made into a movie that is worthless except for the good soundtrack. Watch the documentary and don’t waste your time on this."
    },
    {
      "rating": "3/5",
      "review": "a very edgy comedic horror that knows not too take itself too seriously."
    },
    {
      "rating": "4.5/5",
      "review": "If your looking for a good very gory horror, comedy then definitely check it out."
    },
    {
      "rating": "3/5",
      "review": "Entertaining, campy death scene and very Steven King"
    },
    {
      "rating": "0.5/5",
      "review": "I wasted $20 on this horrible excuse for a movie. Trust me. Don’t do it."
    },
    {
      "rating": "4.5/5",
      "review": "The movie is really good but the horse part almost made me throw up and I paid good money for that popcorn."
    },
    {
      "rating": "2/5",
      "review": "The point of this movie should have been about the insane deaths. There are some, but not enough in my opinion."
    },
    {
      "rating": "0.5/5",
      "review": "Is everyone finally ready to admit that King has never been that good, and it’s only been directors like De Palma and Kubrick that have made his entire career?"
    },
    {
      "rating": "5/5",
      "review": "Amazing movie and story an twists an turns"
    },
    {
      "rating": "2.5/5",
      "review": "I was really hoping for just a little bit more from this. The concept is cool and the story works but I wouldn't lose sleep if I'd never watched this"
    },
    {
      "rating": "0.5/5",
      "review": "Boring as hell, watching this as an Easter movie was a mistake. It is fast paced and the lighting is dull. The deaths are also unrealistic. A nonsensical mess."
    },
    {
      "rating": "3/5",
      "review": "Nice little movie, nothing more. I think Oz Perkins should just stick to what he’s best at. The Blackcoat's Daughter, Longles, Gretel and Hansel; these are great ones."
    },
    {
      "rating": "4/5",
      "review": "Super random but i liked it"
    },
    {
      "rating": "3/5",
      "review": "i feel like i could have waited to watch this on streaming..."
    },
    {
      "rating": "2/5",
      "review": "It was more of a comedy than actual horror. The plot left a lot to be desired and didnt quite make sense. The climax was not satisfying."
    },
    {
      "rating": "3.5/5",
      "review": "Really liked the idea behind this film. It wasn’t bad but didn’t quite live up to its promise. A lost opportunity perhaps. Still worth a watch!"
    },
    {
      "rating": "3.5/5",
      "review": "Another solid film produced by Neon that does not disappoint. A blent of horror and comedy - this film is a gory masterpiece. Although not as creepy of tone as Longlegs - it is a well adapted film."
    },
    {
      "rating": "3.5/5",
      "review": "It was very weird in a good way and kinda funny. Not really scary more of a thriller type of feel. The movie was okay. I give it a 7.5/10. I enjoyed it with my family"
    },
    {
      "rating": "3/5",
      "review": "Amazing first half and then it becomes \"too dumb\" satire."
    },
    {
      "rating": "1/5",
      "review": "What a total waste of my time and $20. Glad I didn’t go to the movies and see it or I would have been out more cash for a bucket of popcorn and a coke. Then I would have really been mad. Ugh."
    },
    {
      "rating": "1.5/5",
      "review": "Honestly the only good thing about this movie was Theo James."
    },
    {
      "rating": "5/5",
      "review": "Was definitely a lot more enjoyable than I thought it would be. I love me some Stephen King. Previews definitely do not do the movie justice. Worth watching."
    },
    {
      "rating": "3.5/5",
      "review": "Definitely worth a watch! It is brilliant at what it does. It's gory, funny, and doesn't leave you feeling weird or depressed afterwards. You purposely don't get too emotionally involved with the characters, lots of funny moments and genuinely so refreshing compared to almost all gross films. Compared to like a Hereditary, oh my god this was so lightweight yet 10x the gore. Only critique would be that the deaths seemed to become a little rushed at the end to get to the brother. And what the hell was the ghost on the horse??? Recommend!"
    },
    {
      "rating": "1.5/5",
      "review": "just so pointless. could just be a list of clips of kills and nothing would change. a montage of 3 mins is better than the whole movie"
    },
    {
      "rating": "3.5/5",
      "review": "Pretty solid movie. I liked the satire, even if it wasn’t super deep. I get why some people wanted more horror, but honestly, it’s a chill weekend watch if you’ve got nothing else going on."
    },
    {
      "rating": "0.5/5",
      "review": "Weird, uneven tone, bizarrely and clumsily cut together and the 'jokes' are really off and just don't land. There is no charm or likeablilty at all in this film, the acting is sparky in that irritating mid 2010s Marvel way, the characters are unengaging and the plot struggles along joylessly. Can only imagine that the reason it's got the rating it does is because everything else made this decade is so poor."
    },
    {
      "rating": "1/5",
      "review": "Don't blame King for this one, he didn't make the film. It's a wasted opportunity, as if Annie Proulx decided to try horror: unpleasant people being unpleasant to each other, but while being blown to smithereens. There are some great set pieces, a couple of Final Destination level kills, but there are no stakes, and no characters you can root for. In the quiet moments, the script tries for drama and pathos, but that only works if the audience cares. If even one character had been likeable, it might have been redeemed. I finished it because it was there while I was doing other things, but there's absolutely no need to watch it twice."
    },
    {
      "rating": "5/5",
      "review": "Very fun horror , blood and guts and a good laugh"
    },
    {
      "rating": "4/5",
      "review": "Such a fun horror comedy romp that only Oz Perkins could make. Smarter and more sensitive than it seems on the surface, and over-the-top in all the right ways. Easily among the best King adaptations."
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good and funny movie although I wish it had more of a plot"
    },
    {
      "rating": "1/5",
      "review": "It starts meh and gets worse as it goes on. It's not funny, the deaths are ridiculous, and the plot is incredibly dumb. An absolute waste of a good opportunity."
    },
    {
      "rating": "5/5",
      "review": "This is everything a horror movie should be. It was just over 90 minutes long (the perfect amount of time for just about every film). It didn’t have an unnecessarily drawn story with a lot of establishing filler scenes. There was a ton of gore and it was hilarious. I loved every second of it."
    },
    {
      "rating": "3.5/5",
      "review": "Decent acting, very silly movie, funny and gory from start to finish."
    },
    {
      "rating": "1/5",
      "review": "Basic story, bad characters. All the kills were very ridiculous."
    },
    {
      "rating": "4/5",
      "review": "While it starts off mean spirited, it ends up being horrifically funny."
    },
    {
      "rating": "0.5/5",
      "review": "Crap movie born from the mind of a mediocre and overrated horror writer. Stephen king is not a real horror writer his works are not scary. He is just a simpleton pretending to be a horror/thriller master."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie I’ve ever seen! It’s so bad that I’m actually wasting my time writing a review about it and I don’t write reviews. Complete garbage"
    },
    {
      "rating": "1/5",
      "review": "No substance to this one at all. It seems the goal is to introduce a constant steam of graphic deaths for shock value. No real storytelling to be found."
    },
    {
      "rating": "0.5/5",
      "review": "It's beyond camp, it's far past dry humor..It's just awful. I wish I had a MIB memory flashy thingy so I could forget ever having seen it. The writing, the script and the effects are just awful."
    },
    {
      "rating": "5/5",
      "review": "This was a very fun surprise of a film. Although it completely departed from the original source material, but regardless, it’s one of the most fun movies you will see."
    },
    {
      "rating": "2.5/5",
      "review": "Very disappointing but still had a good time. Kills was the highlight of the film."
    },
    {
      "rating": "3.5/5",
      "review": "An entertaining film that places its director among the best in the genre right now. It offers a fun, bloody, dark, and effective adaptation that entertains without restraint in its 98 minutes. It has its flaws, of course, but its strengths outweigh those weaker moments, and the visual and bloody spectacle create a sweet and rewarding moment on screen with one of the funniest films of 2025 so far."
    },
    {
      "rating": "0.5/5",
      "review": "My honest opinion this movie sucks you’re welcome."
    },
    {
      "rating": "2.5/5",
      "review": "Per me le cose sono due o é un gran film volutamente girato da film schifoso e allora meriterebbe 5 stelle perché è fantastico, o é un film talmente fatto male che uno può pensare che sia voluto ma non é cosi e quindi fa schifo. La storia non sarebbe nemmeno male ( graziealcazzo é di king) per il resto ogni volta che la scimmietta batteva i piatti speravo toccasse a me"
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie of the decade, basically wasted 1.5 hrs of my life that won’t get back.. Don’t let “Based on Stephen King’s ” fool ya… ZERO STAR!"
    },
    {
      "rating": "3.5/5",
      "review": "Great fun from start to finish. Full of inventive kills and humour, perfect for a Saturday night viewing with a beer and a pizza"
    },
    {
      "rating": "3/5",
      "review": "It was fine but I had higher expectations just by seeing Stephen King's name on it. I didn't get bored but the ending didn't feel like a proper ending."
    },
    {
      "rating": "0.5/5",
      "review": "I want my twenty bucks back, with penalties and interest. A masterclass of how to screw up a horror movie: make it mishmash of camp, comedy and gore, without any real terror or suspense. Watch the Twilight Zone \"Living Doll\" with Telly Savalas; it's better!"
    },
    {
      "rating": "4/5",
      "review": "Está muy buena pero la verdad tanta comedia hacía que se sienta Un poco fuera de lugar Pero igual está buena"
    },
    {
      "rating": "4.5/5",
      "review": "Funny and gory, full of creative deaths! Amazing casting for the child and adult versions of Hal and Bill. The film laid the groundwork for a couple of plot-points that it never really followed up on, but beyond that, it was a fun ride."
    },
    {
      "rating": "5/5",
      "review": "I swear, films that are distributed by Neon are so underrated. Will people ever realize how solid/good/phenomenal/amazing these films are?? Don’t need to ask me, these films won me over."
    },
    {
      "rating": "4/5",
      "review": "Story was fun, and you can really tell they nailed the horror/comedy mix. Sometimes more comedy than horror but still a fun watch."
    },
    {
      "rating": "1.5/5",
      "review": "It’s not funny a lot of the time."
    },
    {
      "rating": "5/5",
      "review": "Great movie, lots of gory fun."
    },
    {
      "rating": "4.5/5",
      "review": "This should be classified as a horror comedy because it's funny as hell. A bit more character development could've made this better, but overall it's solid, and the kill scenes are very Final Destination. oh and Theo James in glasses is hot as hell"
    },
    {
      "rating": "3.5/5",
      "review": "Saw this movie with a group of friends. A lot of goofy and unlogical deaths happen throughout. Like the pool scene (if you know you know). Wouldn't say its my favorite of the year but its definitely worth the watch!"
    },
    {
      "rating": "4/5",
      "review": "The movie is good and horrible"
    },
    {
      "rating": "3/5",
      "review": "Pretty silly and over exaggerated kills, but I assume it was meant that way. It was OK."
    },
    {
      "rating": "4/5",
      "review": "Pretty funny and entertaining nonsense"
    },
    {
      "rating": "4.5/5",
      "review": "A quirky and somewhat original horror movie with high-quality production value like Longlegs, however different and better than Longlegs imo. It also reminded me of Thanksgiving it had a very artistic and beautiful filming aspect to it. Script wasn't Shakespeare, but funny and insightful even at times. Plot was more interesting than most horror movies, I mean come on the Terrifier movies and many other horror movies barely have a plot. Acting was also pretty good really felt like the two twins were different people. While it has flaws, I'd say this movie is almost great in some ways. I'm going to give this one another watch in a few months."
    },
    {
      "rating": "0.5/5",
      "review": "Dont waste your time or money going to see this garbage. Its basically a longer episode of 1000 ways to die. Trash"
    },
    {
      "rating": "3/5",
      "review": "While the movie had some unexpected moments and some funny scenes it felt as though it was lacking"
    },
    {
      "rating": "3/5",
      "review": "It's no Pet Sematary(that's a movie and book that scared the crap outta me when it came out) but it did have a lot of gore and good acting."
    },
    {
      "rating": "4/5",
      "review": "Pretty funny, reminds me of final destination kills. Its better than rachel zeglers snow white thats for sure. Adam scott is in it so i mean its not that terrible."
    },
    {
      "rating": "5/5",
      "review": "tôi đánh giá phim này điểm cực phê"
    },
    {
      "rating": "4/5",
      "review": "I enjoy most King movies and novels but could not agree less with his political persuasion anyway I liked this movie although it was kind of a comedy and not very scary. Characters were solid and it was entertaining so I gave it a 4 and recommend it. Would be nice if King could create something truly frightening again like Salems Lot now there is a scary movie!"
    },
    {
      "rating": "4/5",
      "review": "Not what I was expecting, but all the better for that. Bloody great fun."
    },
    {
      "rating": "3.5/5",
      "review": "There’s loads of crazy kills and chaotic themes and the story is still good"
    },
    {
      "rating": "3/5",
      "review": "It starts out interesting, then gets boring in the middle"
    },
    {
      "rating": "4/5",
      "review": "great spend time, i had a lot of fun"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is a travesty did the people who made this even read the original story? Stop turning everything Stephen King does into a horror comedy or a joke of a film ie the boogeyman into Stephen King stop selling out your stories to these hack studios it would be a bunch of paid reviewers that give it a decent score like if anyone who is actual Stephen King fan and is read this story this movie looks like a joke of his work and I can't believe he signed off on it"
    },
    {
      "rating": "3/5",
      "review": "As a horror fan this was not what I wanted but atleast it promises to keep to watching"
    },
    {
      "rating": "3/5",
      "review": "Would have been better as just a book. Movie was rushed. Love S King though"
    },
    {
      "rating": "1.5/5",
      "review": "More like the Midkey"
    },
    {
      "rating": "5/5",
      "review": "Kill scenes were good and the concept was great!"
    },
    {
      "rating": "0.5/5",
      "review": "Thought it was horrible. I walked out after 15 minutes."
    },
    {
      "rating": "4/5",
      "review": "\"O Macaco\" é um filme interessante que brinca com o próprio roteiro, misturando o bizarro e o cômico. Para aproveitar, é bom entrar na proposta de rir do horror. Os personagens, em sua maioria, são bem irritantes, mas o filme funciona. Ah, e a sonoplastia está ótima!"
    },
    {
      "rating": "4/5",
      "review": "Its a fun way to waste two hours watching people get killed in creative ways. If you go in with that expectation, you wont be disappointed."
    },
    {
      "rating": "0.5/5",
      "review": "that movie sucked. fell asleep 😴 💤 😪"
    },
    {
      "rating": "4/5",
      "review": "So funny, so dark, and so twisted!!! If you're looking for a great time with a TON of blood and gore, this is the movie for you!!!"
    },
    {
      "rating": "1/5",
      "review": "It seems like it was directed by a director who has no idea of what they are doing. The acting was so bad , the writing , the dialogues , the pacing , the death scenes , etc .. it's the worst piece of cinema to ever to exist"
    },
    {
      "rating": "3/5",
      "review": "More funny than scary"
    },
    {
      "rating": "3/5",
      "review": "Great classic nasty GORE!!! Story was a bit lackluster , but the ominous scenes with the addition of the creepy scary background music got this movie the 3 stars that it received from me . Hopefully part 2 is better ."
    },
    {
      "rating": "3.5/5",
      "review": "Pretty funny but not in the realms of Perkins' fully personalised projects."
    },
    {
      "rating": "0.5/5",
      "review": "The film is neither funny nor scary. Indecent joke filled up the movie without any purposes. The plot boring as hell especially worth my rating."
    },
    {
      "rating": "3/5",
      "review": "Cool gore, but the script was bad. I know they made the script bad for comedic purposes, but just because it was intentional doesn’t make it funny."
    },
    {
      "rating": "0.5/5",
      "review": "This film was an absolute atrocity. I was in literal shock wondering how on earth this film was this terrible. The fact that it was fully funded, was reviewed by everyone before being released and still everyone said, \"Yep, this is it!\". Usually films are hit or miss but apparently now a days the chances of a movie being a hit is below 10%. I said F-it, it's Theo James, James Wan & we get Adam Scott and Elijah Wood?! Okay, I'm sure it'll be a good movie or at least decent. BOY WAS I WRONG. Work must be slow right now because WTF WAS THIS??? Please do not waste your money, that was 2 hours of my life I will never get back. I am in disbelief at how movies from the early 2000's easily run circles around movies that come out today. How are producers, writers and directors not embarrassed that the quality of movies today are actually embarrassing??"
    },
    {
      "rating": "5/5",
      "review": "For me personally - a good movie in style, a good plot, a good atmosphere. I expected less, much less"
    },
    {
      "rating": "4/5",
      "review": "Surprisingly enjoyable, and the comedy was on point"
    },
    {
      "rating": "1.5/5",
      "review": "From the overly ridiculous deaths (woman explodes diving into a pool that is electrified??!) to the slow pace of the film and then finally a \"shock\" ending that again displays a ridiculous death, boring dialogue and wooden acting."
    },
    {
      "rating": "3/5",
      "review": "I actually had fun watching this movie!!!"
    },
    {
      "rating": "3.5/5",
      "review": "Is a good movie, worth a watch. If you wanna really enjoy the movie, watch in a Friday night and turn off your brain, dont try to understand the movie. The comedy and gore its really fits the movie style, and also brings some moments really good acid humor moments. The ending of the movie was pretty stupid but most of the movie i likes. Is dont think is so bad how everyone says. If you ARE a squeamish person dont watch this movie."
    },
    {
      "rating": "1/5",
      "review": "poor film, boring and stupid."
    },
    {
      "rating": "0.5/5",
      "review": "Filme podre demai, Scam do caralho"
    },
    {
      "rating": "3/5",
      "review": "I thought it could have used the creativity Stephen King has if he were involved in the making of the movie."
    },
    {
      "rating": "4.5/5",
      "review": "Very entertaining with an impressive amount of dark comedy."
    },
    {
      "rating": "4/5",
      "review": "it was like a spin on Final Destination franchise. The twisted comedy on the gruesome deaths was funny not scary."
    },
    {
      "rating": "0.5/5",
      "review": "this movie sucks dont watch it"
    },
    {
      "rating": "0.5/5",
      "review": "Literally the worst movie I’ve ever seen. Sad to see Theo James in such a stupid role."
    },
    {
      "rating": "5/5",
      "review": "When the trailer came out i couldn't wait to see it & it did not disappoint! I loved it! It's so nice to see different movies instead of the same movies constantly over and over again"
    },
    {
      "rating": "1.5/5",
      "review": "It had a couple okay moments but overall it never gripped me. It was a movie that couldn’t decide what it wanted to be"
    },
    {
      "rating": "4/5",
      "review": "It is a great slapstick horror comedy that keeps it fresh coming from a very thin plot"
    },
    {
      "rating": "1/5",
      "review": "This movie feels like Goosebumps, except I hoped better for a Stephen King book made into a movie. It's been years since there has been a good film adaptation of one of King's stories. Oh well."
    },
    {
      "rating": "3/5",
      "review": "A passable comedy horror that storywise is a little dull but gets by on it's inventive kills."
    },
    {
      "rating": "2.5/5",
      "review": "The comedy is genuinely really funny but then that’s when I noticed that halfway through the movie it became more comedy than horror and not being able to balance it out. While it’s Final Destination like kills are not a new concept it was a nice throwback."
    },
    {
      "rating": "1.5/5",
      "review": "Worse Steven king movie"
    },
    {
      "rating": "2/5",
      "review": "Yeah this is not very good"
    },
    {
      "rating": "2.5/5",
      "review": "Intentionally quirky aura and over-the-top, intentionally unrealistic kills, give this a kind of charm I wasnt expecting. That said, it was enjoyable enough, yes, but it didnt do the job of adding another terror doll to the WanVerse like I hoped it would and especially with it based on a Stephen King short story. A solid, funny watch with plenty of goddamn! kill moments, but not much more than that. Expected wayyyyyy more, but its also not terrible."
    },
    {
      "rating": "3/5",
      "review": "Was more of a scary comedy than a real horror movie. It was alright"
    },
    {
      "rating": "0.5/5",
      "review": "The movie goes no where and doesn’t explain anything, throughout the movie u see b movie deaths and its just a waste of time"
    },
    {
      "rating": "5/5",
      "review": "one of the best suspense horror thriller"
    },
    {
      "rating": "4/5",
      "review": "Not a horror movie IMO‼️ BUT very hilarious and entertaining nonetheless 😂😭"
    },
    {
      "rating": "4/5",
      "review": "This movie was very funny in a very sick way. It is not for the squeamish. Don't expect a movie that gives you nightmares, unless seeing a woman with her head on fire running around comically and impaling herself on a for sale sign gives you nightmares."
    },
    {
      "rating": "0.5/5",
      "review": "I was looking forward seeing it but..... This is big waste of time. Story.... Awful, gore.... Hardly any and the split second you see someone dying, boring. Maybe if I'm 12yo I would enjoy it. I would not even watch it again if they pay me."
    },
    {
      "rating": "0.5/5",
      "review": "The previews looked like it would be good. The story line was boring, random scenes and a HUGE waste of time. I almost rather watch snow white…. Almost."
    },
    {
      "rating": "3/5",
      "review": "My bf “definitely not a good movie, but made me laugh a few times”."
    },
    {
      "rating": "1/5",
      "review": "Atuações fracas, efeitos especiais amadores, e mortes extremamente absurdas."
    },
    {
      "rating": "4/5",
      "review": "It was a hell of a ride. Horror, comedy, drama and Final Destination level death scenes. Great cast with Theo James (Playing both Hal and Bill), Adam Scott, Elijah Wood & the young and talented Christian Convery (playing both young Hal and young Bill). There's even an appearance from director Oz Perkins himself. I really enjoyed it. Creative death scenes, laugh out loud scenes and just enough humanity to make it all work. If you are not a fan of horror? Stop creating reviews of horror films. Thank you."
    },
    {
      "rating": "5/5",
      "review": "If youre looking for a serious scary film, this sure as hell aint it. But damn this movie is HILARIOUS. Would definitely recommend."
    },
    {
      "rating": "3.5/5",
      "review": "Such a wierd movie. Enjoyed it. It’s a dark comedy that I wasn’t expecting. Liked it more than I thought I would. Super strange."
    },
    {
      "rating": "3/5",
      "review": "Over the top in every way. Which ended up making it enjoyable but I was desperately hoping it would be scary. It’s literally a comedy that has gore in it."
    },
    {
      "rating": "5/5",
      "review": "visual yang mencekam bikin dakdik duk sendiri nontonya"
    },
    {
      "rating": "3.5/5",
      "review": "The comedy dark humour is amazing and the stunning gore as well"
    },
    {
      "rating": "3.5/5",
      "review": "Exactly as you'd expect."
    },
    {
      "rating": "5/5",
      "review": "Love it! I really love horror movies and unexpectedly i love this movie sm!"
    },
    {
      "rating": "5/5",
      "review": "i like that it doesn't take itself too seriously"
    },
    {
      "rating": "5/5",
      "review": "-its good and the book"
    },
    {
      "rating": "1.5/5",
      "review": "too much hype, very little substance...if any."
    },
    {
      "rating": "1/5",
      "review": "no real story just alot of messy kill scenes, my boyfriend fell asleep LOL"
    },
    {
      "rating": "2/5",
      "review": "Doesn't seem much like a Stephen King movie. I wasn't expecting a dark comedy . Everyone else in the theatre left (in fairness there were only 2 other people) and my husband fell asleep. So."
    },
    {
      "rating": "3/5",
      "review": "Way worse than I expected 😝 It didn’t scratch my #horror itch at all - the scares felt weak, and the tension just wasn’t there. That said, the dark comedy was a highlight, and I did enjoy some of the performances 🧐✌️"
    },
    {
      "rating": "5/5",
      "review": "Great suspense scenes!"
    },
    {
      "rating": "1/5",
      "review": "Movie lacked details and just a bunch of messy killing , I was very disappointed ."
    },
    {
      "rating": "0.5/5",
      "review": "Can’t believe Theo James agreed to be in this movie. Love him, love horror, even comedy horror… this was truly a waste of his talent, not to mention time and money."
    },
    {
      "rating": "4/5",
      "review": "Very Good movie, it Kept me jumping out my seat in various scary scene of the movie"
    },
    {
      "rating": "5/5",
      "review": "Hilarious! Dry dark humour. Clever and witty.. love the actors and the story."
    },
    {
      "rating": "1/5",
      "review": "So overrated. So disappointed in this. The bunny from Oddity did a better job."
    },
    {
      "rating": "1/5",
      "review": "Ive realized after watching this that I am not a fan of horror/comedy combination movies. Not very scary and not very funny, mostly just gory."
    },
    {
      "rating": "3/5",
      "review": "It’s just really goofy but I guess that’s the point"
    },
    {
      "rating": "3/5",
      "review": "It was good movie but I feel like it couldve had more."
    },
    {
      "rating": "5/5",
      "review": "Funny and scary at the same time, recommend watching it."
    },
    {
      "rating": "0.5/5",
      "review": "it was horrible! i did not like it at all waste of money. do not watch it"
    },
    {
      "rating": "0.5/5",
      "review": "Não cumpriu o que prometeu. Prometeu ser mau, mas é péssimo."
    },
    {
      "rating": "0.5/5",
      "review": "Strangely boring. Intensely stupid. Genuinely sorry I wasted my time on this."
    },
    {
      "rating": "3.5/5",
      "review": "Movie was better than expected. Tad bit corny but funny while doing it."
    },
    {
      "rating": "3.5/5",
      "review": "Muy entretenida. El director de \"Longless\" demuestra tener un sentido del humor perverso y un tanto cruel. No recuerdo la novela de Stephen king para saber si tiene ese sentido del humor un tanto retorcido 😂👍"
    },
    {
      "rating": "2.5/5",
      "review": "The movie has good special effects and some pretty cool looking scenes, but it feels like the dialogue and plot was written by a 12-year-old."
    },
    {
      "rating": "5/5",
      "review": "Eine schwarze Splatter Dramödie im 70s/80s Style. Irgendwo zwischen Harold & Maude und Omen, dem Urvater von Final Destination. Die Geschichte ist recht Simpel und bietet kaum Überraschungen, was nicht unbedingt schlecht ist. Perkins war/ ist sicherlich bewusst, dass bei einem solchen Film die Kills der Star sind und die Geschichte bloss Überbrückung. Das ist nur bei den Omen Filmen anders. Die Kills selbst sind nicht nur unheimlich kreativ, die Tode sind auch völlig überzogen. Körper Explodieren gleich. Irgendwo ist da auch ein Einfluss von Monthy Python zu sehen. Ist der Film zu Beginn noch ambitioniert mit der Geschichte, wird in der zweiten Hälfte der Versuch zurückgenommen und befreit gemeuchelt. Definitiv ein Rabenschwarzer Spass im Arthouse Gewand. Sehenswert"
    },
    {
      "rating": "3/5",
      "review": "Overall I liked it. But it surprised me. Meaning i didn't expect it to be the kind of movie that it was."
    },
    {
      "rating": "2.5/5",
      "review": "It was ok. Definitely was a bit bland. Could have been scarier and funnier. They added some of Kings touches but still it didn’t deliver for me."
    },
    {
      "rating": "4/5",
      "review": "never imagined, quite scary to watch alone"
    },
    {
      "rating": "0.5/5",
      "review": "Only thing scary bout this was the dialogue and the pace. Feels like the kind of movie somebody wld write coming off a 12 hour binge on poppers."
    },
    {
      "rating": "4/5",
      "review": "Watch it with my man. It was creepy yet kind of funny. We liked it! ❤️"
    },
    {
      "rating": "4/5",
      "review": "An original concept used to perfection. The movie is entertaining and keeps your attention through the entire film using comedy and keeping the pedal on the horror."
    },
    {
      "rating": "2/5",
      "review": "Too cheesy not a scary movie."
    },
    {
      "rating": "5/5",
      "review": "I went to go see this movie with my friend and my family and I loved it I was funny and bloody at the same time I will definitely watch it again when it goes on streaming if you love gory movies than this one is for you"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible movie, waste of money"
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed it yesterday I would love to see it again best movie hands down Steven King the goat"
    },
    {
      "rating": "1/5",
      "review": "Didn’t get to watch movie"
    },
    {
      "rating": "1.5/5",
      "review": "Simply put, it’s a bad script. A lot of potential but just some baffling lines and predictable scares. Nice gore moments though."
    },
    {
      "rating": "5/5",
      "review": "Is good is like long legs but more scares and blood and good kill"
    },
    {
      "rating": "4/5",
      "review": "Exceptionally entertaining"
    },
    {
      "rating": "2.5/5",
      "review": "Was a new kind of watch. But somewhat too predictable. And kind of all over the place"
    },
    {
      "rating": "1.5/5",
      "review": "Let me inform you that I knew it was a dark comedy before I saw it. The movie wasn’t funny or entertaining. Plenty of gore but absolutely nothing scary about it. This makes a lot of B movies look like great films."
    },
    {
      "rating": "2/5",
      "review": "It was alright. Didn't make much sense and not as good as Longlegs."
    },
    {
      "rating": "4/5",
      "review": "It was really good. Reminds me of Final Destination movie. I guess I expected more gore."
    },
    {
      "rating": "0.5/5",
      "review": "We need something besides horror movies to watch. Please."
    },
    {
      "rating": "4/5",
      "review": "Lovely trash movie, made me laugh at lot. The absurde deaths, the stupid brother, the small side jokes hidden in plane sight (for instance on the city sign), the scenery - all fits well. Minus 1 Star as the movie has some long scenes which don't add a lot and I would have loved to instead get some more insights on the kid's dad."
    },
    {
      "rating": "3/5",
      "review": "A film that is aware of itself and doesn't apologize at all for it. It continues the ridiculous killing sequences and you always get a feeling of uncertainty of who's gonna die next."
    },
    {
      "rating": "5/5",
      "review": "AWESOME! This is what you go to the theaters for. It’s fun, it’s a perfect Friday night out movie. It’s campy gore, over the top awesome kills with a good story and good actors behind it. Don’t overthink it, just go and enjoy the fun."
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely horrible movie. Definitely did not live up to the insidious series of movies. Ridiculous absurd death scenes that were so over the top that it absolutely ruined the film not to mention the over use of the word Goddanit & F"
    },
    {
      "rating": "1/5",
      "review": "I hope anyone involved in this gets bankrupt ."
    },
    {
      "rating": "0.5/5",
      "review": "horrible - pretty stupid"
    },
    {
      "rating": "3.5/5",
      "review": "This as a fun movie. It had great laughs and some great gore . It was much better than I expected it to be."
    },
    {
      "rating": "1/5",
      "review": "Unfortunate this is a trash movie with trash acting"
    },
    {
      "rating": "2.5/5",
      "review": "The movie was alright. I liked the main character. However, the main villain's motives were empty, and the way the movie resolved was stupid. The movie's gore was top notch, and the humor was pretty good. Overall it was good but no great."
    },
    {
      "rating": "2.5/5",
      "review": "Very interesting idea but so many plot holes. It was very old school with random almost humorous kill scenes but at the end of the day didn't deliver the same full circle story scape that Stephen king is known for"
    },
    {
      "rating": "5/5",
      "review": "Niceeeeeeeeeeeeeeeeeee"
    },
    {
      "rating": "4/5",
      "review": "a bit corny, but honestly pretty good. things were pretty fast paced which i really liked. it got straight to the point without dragging on forever. the gore is also pretty crazy. i’d recommend watching!"
    },
    {
      "rating": "5/5",
      "review": "Good, loved the gore!"
    },
    {
      "rating": "5/5",
      "review": "My favorite movie of the year so far! There isn't a dull moment, with lots of violence, humor, twists, and turns....I'm a big Steven King fan and this movie holds the short story it's based on in the highest regard. Can't WAIT until I can buy it for home viewing."
    },
    {
      "rating": "1/5",
      "review": "No plot. More satire than storytelling."
    },
    {
      "rating": "4/5",
      "review": "Humorous horror that had most laughing than scared. A nice twist on the Stephen King novel."
    },
    {
      "rating": "5/5",
      "review": "I liked the story line. I liked the way they used the toy and I really liked the fact that it not only made me jump twice but eventually it became, at least to me, a comedy. I began laughing towards the end when all the bodies were exploding. Somehow it struck me as funny."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was buns."
    },
    {
      "rating": "4/5",
      "review": "Good movie. Doesn't take itself too seriously and adds a nice layer of comedy by poking fun at itself. it's was a very enjoyable movie."
    },
    {
      "rating": "3.5/5",
      "review": "The kills were funny and weird and the twist was pretty decent. I would probably watch again if i was in a big group on halloween."
    },
    {
      "rating": "5/5",
      "review": "Scary fun very funny great film"
    },
    {
      "rating": "0.5/5",
      "review": "Total Garbage. Just like longlegs"
    },
    {
      "rating": "5/5",
      "review": "FANTASTIC comedic dark horror at its finest!"
    },
    {
      "rating": "4.5/5",
      "review": "Fun little story about the inevitably of death"
    },
    {
      "rating": "5/5",
      "review": "filmnya bagus dan sangat mengesankan...bagus untuk di tonton... pokoknya ter bestlah filmnya"
    },
    {
      "rating": "5/5",
      "review": "film nya recommended bgt cocok buat hiburan sambil nunggu buka puasa👍"
    },
    {
      "rating": "5/5",
      "review": "Film yang sangat bagus dan recommend banget, gak nyesel udah milih nonton film ini❤️"
    },
    {
      "rating": "5/5",
      "review": "Even tho it was predictable. It still had some good scare scenes. Definitely scary."
    },
    {
      "rating": "5/5",
      "review": "Epic. A story of why love triumphs, and fear is irrelevant. Such a surprise."
    },
    {
      "rating": "5/5",
      "review": "It was an interesting movie. I've never seen something like this 😳"
    },
    {
      "rating": "5/5",
      "review": "Totally hilarious movie. Up there with Evil Dead and Cabin in the Woods. If you love glorious deaths and dark humor, you'll fit right at home with this. The movie didn't drag on too much drama and doesn't take itself too seriously. Fun to watch!"
    },
    {
      "rating": "5/5",
      "review": "THIS MOVIE WAS TRASHHH"
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie I have seen in a long time, the story was lacking depth and the characters were left very underdeveloped throughout the entire film. The kill scenes were very predictable and the comedy was horrifically unfunny. I couldn’t help, but cringe at how bad the humor was and unfortunately for me that was the entire movie. This movie will make you walk out faster than the shitty one liners in it. Seriously, don’t see it"
    },
    {
      "rating": "3/5",
      "review": "Things started out slow and when the action picked up, it was predictable as to what was going to happen next."
    },
    {
      "rating": "1.5/5",
      "review": "Até tinha uma base, mas o que escolheram para adaptar não e acrescentar não foi bom... Havia alguns caminhos que o filme podia ter tomado, e avaliando o que tomou, que escolha ruim. As mortes são bem criativas, chamam a atenção e só."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie of the year!"
    },
    {
      "rating": "0.5/5",
      "review": "Too predictable and just didnt hold my interest"
    },
    {
      "rating": "3.5/5",
      "review": "funny movie with some very original kills. didn't really follow the short story but still very good."
    },
    {
      "rating": "4/5",
      "review": "Un film foarte interesant. Povestea este buna ,însă cred ca avea mai mult potențial, unele lucruri rămân fără nicio explicație. Filmul este o comedie neagră cu horror amestecata . Îi dau 80 % ,deși uneori pare ca povestea devine un pic absurda în unele momente."
    },
    {
      "rating": "3/5",
      "review": "crazy, unexpected, slasher, funny, weird ! Not bad for a spur of the moment decision!"
    },
    {
      "rating": "4/5",
      "review": "Filem ini sangat bagus cocok buat di tonton sangat rekomendasi"
    },
    {
      "rating": "1/5",
      "review": "No good ended a lot of unanswer questions"
    },
    {
      "rating": "5/5",
      "review": "It’s a very good movie. Love it."
    },
    {
      "rating": "3/5",
      "review": "Fine movie if your a fan of gore and bloody deaths with a ton of dark humor but if your looking for a super in depth story you’ll probably leave disappointed."
    },
    {
      "rating": "4.5/5",
      "review": "Not scary at all but a wonderfully filmed movie. Warped and twisted humor throughout that had me literally laughing out loud. Can’t wait to see what Oz Perkins does next."
    },
    {
      "rating": "1/5",
      "review": "Meaningless thriller, I was waiting for it to finish while watching. Would not recommend"
    },
    {
      "rating": "4/5",
      "review": "This movie was supposed to be funny with the ouragous deaths but it wasn't executed very well its still a very solid horror movie although I might be a little bit more in favour of this movie than others since I have a very big sweet spot for anything Stephen King, I might watch again if this movie releases on streaming but I probably wont buy."
    },
    {
      "rating": "4.5/5",
      "review": "Guys—this damn movie is BANANAS 🙉 and for good reason. Not only is this incredibly gory, like my God 😳, I wasn’t expecting how graphic the kills were, BUT it’s also frickin hilarious. I mean, me and the audience I was in had a BLAST with this, and the amount of SHOCKING moments kind’a made it more funny, and if I’m being honest, it had a great message too! I freaking ♥️ this movie for me, it’s hands down my favorite Oz Perkins movie! Super solid and incredibly well executed! 🍿"
    },
    {
      "rating": "3.5/5",
      "review": "Very funny bloody film, don’t watch while eating a BBQ pizza."
    },
    {
      "rating": "3/5",
      "review": "It was ok movie. Not disappointed but not exactly hyped either."
    },
    {
      "rating": "2.5/5",
      "review": "It’s alright, I honesty thought it was gonna be another slasher chucky like doll films like this."
    },
    {
      "rating": "3/5",
      "review": "Like final destination but a little cheesier."
    },
    {
      "rating": "3/5",
      "review": "Not what I thought it would be it was more funny than it was scary"
    },
    {
      "rating": "5/5",
      "review": "Movie was hilarious and a great watch. Very graphic death scenes it was awesome."
    },
    {
      "rating": "1/5",
      "review": "Just strange and odd but that's Steven King. I think of I had watched the previous I may have not purchased a ticket."
    },
    {
      "rating": "2/5",
      "review": "A few bright moments to laugh at. It’s awkward at best. No elements of believability at all. I don’t think SK would agree it’s too close to his novel. Not the worst movie but not worth the money at the Box Office. Pro tip : wait for it to come out on streaming"
    },
    {
      "rating": "2/5",
      "review": "Sadly the whole film is given away in the trailer but that aside I felt this was quite messy and apart from some really fun death scenes and a great duo performance from Theo James it just didn’t hit the right beats for me. Longlegs felt the same - nearly there but not quite. Perkins is an interesting director I’ll keep following but just willing him to hit a home run."
    },
    {
      "rating": "3/5",
      "review": "Just a bit underwhelming. The acting solid, special effects didn’t disappoint, the timing was great, I even jumped a few times. I get that it’s supposed to be a more comedic movie but the story just didn’t make sense at certain points, like with the cheerleaders, or at the end where only one member of that particular quartet is shown on screen. Overall though It’s worth going to see and made for a great night out!"
    },
    {
      "rating": "0.5/5",
      "review": "This is the first movie I can remember walking out of half way through. A poor combination of shock horror with sprinkles of \"comedy\". If you want to feel like you have lost a few brain cells by just viewing, by all means go see it!"
    },
    {
      "rating": "4.5/5",
      "review": "What a fun horror movie."
    },
    {
      "rating": "0.5/5",
      "review": "Poorly edited film, meaningless story, I saw people leaving the cinema during the session. Terribly bad."
    },
    {
      "rating": "4/5",
      "review": "Entertaining without a twist. Predictable but fun."
    },
    {
      "rating": "1/5",
      "review": "Definitely a horrible movie!!!"
    },
    {
      "rating": "3/5",
      "review": "the movie was ok. I'll say 5.5 out of 10. The kills had a final destination feel ,which was good, but the story and dialog were kind of flat , and the random kills made up for it.."
    },
    {
      "rating": "4/5",
      "review": "more comedy than horror"
    },
    {
      "rating": "3.5/5",
      "review": "A visual centered movie that doesn’t take itself very seriously, adopting a tone of sadism and dark humor that is actually well executed. The problem with it is that mostly it comes off as senseless, and that can throw off people who are not expecting it. Also the dialogue here is not the best, or at least isn’t that well delivered."
    },
    {
      "rating": "2.5/5",
      "review": "Really wasn’t very good and not worth seeing in theatres, but it was still fun because the deaths were crazy"
    },
    {
      "rating": "2/5",
      "review": "It’s a ridiculous premise with ridiculous execution. Not a great movie, but it is definitely quirky. Humorous at parts, but it could’ve been funnier if they were shooting for dark comedy. I recommend waiting until it hits streaming or Redbox."
    },
    {
      "rating": "1/5",
      "review": "WORST MOVIE so disappointing. Its not what I expected but it was really awful and the killings were too dramatic."
    },
    {
      "rating": "3/5",
      "review": "Extremely predictable plot and boring ending."
    },
    {
      "rating": "3.5/5",
      "review": "Drags for way too long at plenty of scenes and the characters are really meh. But theres still plenty of genuine laughs and shocks here coupled with the amazing effects."
    },
    {
      "rating": "5/5",
      "review": "hilarious and unique sensibility"
    },
    {
      "rating": "5/5",
      "review": "it was funny i liked it not very scary if ur squeamish with blood and stuff dont watch lol but good movie"
    },
    {
      "rating": "3/5",
      "review": "The first half was phenomenal."
    },
    {
      "rating": "3/5",
      "review": "this movie had a odd ending at the end and needed more action"
    },
    {
      "rating": "1/5",
      "review": "The movie was nothing like the trailer. Very, very demonic movie. Definitely dont take kids to see it."
    },
    {
      "rating": "0.5/5",
      "review": "Dumb writing. Dumb story. We walked out after 40 minutes."
    },
    {
      "rating": "0.5/5",
      "review": "The movie was horrible"
    },
    {
      "rating": "4/5",
      "review": "Definitely different kind of movie but enjoyed the comedy horror aspect of it"
    },
    {
      "rating": "3/5",
      "review": "Not a fan of comedy/horrors although the killings were creative. Overall, not what I was expecting. The story was okay."
    },
    {
      "rating": "4/5",
      "review": "I went into this movie expecting a lot of jump scares and dramatic tension. I didn’t realise it was also a comedy. I’m so glad I didn’t know, because knowing would have made it less of a shock and an unexpected delightful surprise. I was alternating between wanting to cover my eyes and laughing my head off. It reminded me of cocaine bear a bit. I’m telling you this because the audience gave it a lower score than the critics did, which is unusual. Normally this happens when the audience gets something they weren’t expecting. Or they don’t get something about it. So trigger warning - if you don’t like extreme gore or VERY dark humour, this is not the movie for you. If you do, you’ll bloody love it. Emphasis on the bloody."
    },
    {
      "rating": "1.5/5",
      "review": "It wasn’t too good and boring"
    },
    {
      "rating": "5/5",
      "review": "One of the funniest movies I’ve seen in a very long time. Masterful and hilarious gore, irreverent humor, the whole package."
    },
    {
      "rating": "2/5",
      "review": "How this is getting good reviews is beyond me. Great acting from Theo James and some great visual, all the ingredients were there, but it just didn’t mix. Very sloppy."
    },
    {
      "rating": "4.5/5",
      "review": "true to original. the plot made sense and is well laid out. acting is good and story is fluid. such a treasure that this movie is not long drawn out like many other movies now a days."
    },
    {
      "rating": "0.5/5",
      "review": "This movie should be on tubi! Time & money I can not get back. I would give zero stars if I can!!"
    },
    {
      "rating": "4/5",
      "review": "I thought this movie was a lot of fun. Really enjoyed it."
    },
    {
      "rating": "0.5/5",
      "review": "SOO... Terrible is was actually funny, it was almost as bad as the movie MEN."
    },
    {
      "rating": "1/5",
      "review": "Not horrible just kind of slow"
    },
    {
      "rating": "3.5/5",
      "review": "Ridiculous & shocking fun but the pacing wares it down. Good acting, solid score, & creative kills. Some greats ideas & themes that never get fleshed out. The blend of horror & comedy is a blast but neither are fully committed to."
    },
    {
      "rating": "4/5",
      "review": "Campy, bloody good time. Feels like a classic 80's B rated movie."
    },
    {
      "rating": "0.5/5",
      "review": "What a terrible movie. I should have known the moment that they were only four of us in the entire theater. I would have expected more from a Steve King novel"
    },
    {
      "rating": "4/5",
      "review": "Lots of funny deaths."
    },
    {
      "rating": "3/5",
      "review": "It was very entertaining, but not something I would re-watch. Reminds me of the TV show Series of Unfortunate Events"
    },
    {
      "rating": "5/5",
      "review": "I thought it was a very good movie. Some good funny parts some very creative ways of killing people.. one of the better adaptations of a Stephen King short story."
    },
    {
      "rating": "0.5/5",
      "review": "It was horrible. A waste of time and money!"
    },
    {
      "rating": "1/5",
      "review": "This is literally the worst movie I have ever seen in my life, no plot, no real storyline, and very poor quality horror effects, I literally want the last hour and a half of my life back for I feel dumber less intelligent, and robbed of my ticket money."
    },
    {
      "rating": "2.5/5",
      "review": "If you like blood and gore, this is that movie. I am not a fan of this movie! But the revenge storyline was too hilarious. This movie does reflect on how people see themselves as victims in any circumstances."
    },
    {
      "rating": "4/5",
      "review": "This was pretty good, it’s funny and gory, it’s just a great time"
    },
    {
      "rating": "1.5/5",
      "review": "It was kinda predictable . More gore than horror . King has been getting lazy for awhile"
    },
    {
      "rating": "3/5",
      "review": "Started off liking it but when they grew up the story was all over the place. Wish we git an orgin story for the mo key and it's powers lol"
    },
    {
      "rating": "5/5",
      "review": "It was definitely worth every penny I spent on tickets, popcorn and a Coke Zero."
    },
    {
      "rating": "4.5/5",
      "review": "I thought it was really funny, it was a lot of trauma humor and pretty gory but other than that it wasn’t scary at all"
    },
    {
      "rating": "5/5",
      "review": "Awesome movie! Really funny and totally unique."
    },
    {
      "rating": "5/5",
      "review": "unpredictable, creepy but good! the plot was amazing!"
    },
    {
      "rating": "2/5",
      "review": "Após o polêmico lançamento de Longlegs, que serviu como porta de entrada para muitos na filmografia de Oz Perkins, o diretor retorna com O Macaco, um filme que flerta com o terror, mas não se decide entre gêneros. Diferente do seu antecessor, este novo projeto se assume como uma obra de terror com toques de comédia, buscando entregar uma experiência híbrida ao espectador. No centro dessa história, Theo James assume o protagonismo, marcando seu papel de maior destaque após sua participação na série Magnatas do Crime. No entanto, mesmo com sua atuação dedicada, o ator não tem muito material para trabalhar, pois seu personagem se perde no meio de um roteiro descompassado e relações humanas mal desenvolvidas. Oz Perkins, conhecido por sua estética peculiar e tentativas de inovação dentro do gênero, arrisca mais uma vez ao experimentar novas abordagens para o terror. No entanto, a falta de equilíbrio entre os gêneros se torna um grande problema. Enquanto Longlegs enganava o espectador ao vender uma proposta de terror puro e entregar algo muito mais introspectivo, O Macaco desde o início não esconde sua mescla com a comédia. O problema é que, ao contrário do que se poderia esperar, essa fusão de tons não funciona de maneira coesa. O terror se perde, restando apenas algumas sequências de mortes bem orquestradas que, embora criativas, não são o suficiente para sustentar o interesse na narrativa. O maior problema do filme é sua inconsistência tonal. Perkins tenta equilibrar o humor e o horror, mas acaba prejudicando a experiência ao não conseguir dosar corretamente esses elementos. O resultado é uma obra que se esforça para parecer inovadora, mas que, na prática, não se decide sobre qual caminho seguir. O roteiro, que já mostrava falhas evidentes em Longlegs, aqui se afunda ainda mais. O que deveria ser um terror original e revigorante se perde em um roteiro que carece de coesão e desenvolvimento de personagens. Além disso, os relacionamentos em O Macaco são tão mal construídos que muitas interações soam artificiais e desinteressantes. Os personagens são unidimensionais e suas dinâmicas carecem de profundidade, tornando difícil qualquer envolvimento emocional do público. Até mesmo os momentos que deveriam gerar impacto emocional se perdem devido a atuações que, embora esforçadas, não encontram respaldo no roteiro. Theo James até tenta adicionar um peso dramático ao seu personagem, mas esbarra nas limitações do material que tem em mãos, entregando uma atuação genérica e esquecível. Nem mesmo a talentosa co-star consegue salvar o filme de seu próprio destino desastroso. No fim, O Macaco sofre para se justificar. O filme não consegue equilibrar o humor e o terror, resultando em uma experiência que não assusta, não diverte e tampouco revoluciona o gênero, como Perkins parece acreditar. Em comparação com Longlegs, percebe-se uma clara regressão técnica: até mesmo a ambientação e a fotografia, pontos que antes se destacavam, aqui parecem apagados. No fim das contas, O Macaco falha ao tentar ser inovador e acaba se tornando um espetáculo de fatalidades criativas que, apesar de estilizadas, não são suficientes para sustentar um filme com uma narrativa tão inconsistente. O que poderia ser um respiro novo para o terror acaba deixando apenas a sensação de desperdício de potencial."
    },
    {
      "rating": "2/5",
      "review": "The first 70% of the movie was great. Then it just went completely off the rails and just wanted a perfectly great movie. It’s like the writers had a great script with no ending, movie studio bought it and they were given 2 hours to finish the ending. Too bad"
    },
    {
      "rating": "1/5",
      "review": "This was a horrible movie. Bad storyline and horrible acting. This was a waste of money and time."
    },
    {
      "rating": "5/5",
      "review": "I love anything Stephen King and this was a good one!"
    },
    {
      "rating": "4/5",
      "review": "This was low key good I like how it started and I like how it ended the death of how the people die was to funny it remind me of Chucky old school days the bloody action were good I give it a rating 9/10"
    },
    {
      "rating": "0.5/5",
      "review": "This so-called horror comedy had nothing scary about it. The plot was predictable and boring, with jokes that barely landed. Honestly, watching paint dry would’ve been more entertaining. The only redeeming quality was the gore, and even that couldn’t save it. The final scene was decent, but the overall story was just plain dumb. The antagonist? Beyond weak—literally could’ve been stopped by simply not turning a key. I can’t believe I wasted $23.28 on this."
    },
    {
      "rating": "0.5/5",
      "review": "Not very impressive move to see. I’m not sure what this movie was trying to tell me what this is about. Also what the punishment for or statement. I think this movie was terrible"
    },
    {
      "rating": "0.5/5",
      "review": "Plot was mid at best. Barely any horror, just lots of poorly executed gore. Movie sucked"
    },
    {
      "rating": "3/5",
      "review": "I mean, it’s alright."
    },
    {
      "rating": "3.5/5",
      "review": "It was okay, it wasn’t as good as I was expecting and kind of got sloppy towards the end, but has good comedy and great kills."
    },
    {
      "rating": "1/5",
      "review": "Una película donde no sientes miedo ni suspenso está horrible la traducción el guíen todo no la recomiendo"
    },
    {
      "rating": "5/5",
      "review": "This movie was something else, but it is sooo bonkers insane but in a fun way. But it’s not for everyone when you get the message of the film. Stephen king adaptation indeed does it justice."
    },
    {
      "rating": "2/5",
      "review": "Can’t believe this is the same guy who made Longlegs… good kills but implausible plot lines"
    },
    {
      "rating": "5/5",
      "review": "Wicked awesome flick! It's a blend of the original Evil Dead movies and Shaun of Dead! Looking forward to finding more movies from this director!"
    },
    {
      "rating": "5/5",
      "review": "I loved this. I didn't go into it thinking it was going to be scary. I knew it was gonna be a fun, gory romp. I had read the story before & although this isn't exactly like the story, I'm good with that. The kills were fun & Theo James played both of his parts very well (Bill was nuts). It was a lot of fun & I know my husband & I will definitely give it a rewatch."
    },
    {
      "rating": "0.5/5",
      "review": "What A STUPID Movie. Waste of Money"
    },
    {
      "rating": "3/5",
      "review": "Initially gave me IT vibes at the start but then became increasingly boring from middle to end. Could have gone way further."
    },
    {
      "rating": "5/5",
      "review": "Great kills interesting story I loved it!"
    },
    {
      "rating": "0.5/5",
      "review": "Horrible!!! Such a waste of time..nothing scary about it at all. The previews were scarier than the movie. Ill never watch this trash again"
    },
    {
      "rating": "0.5/5",
      "review": "Movie was not creative, I know it was an attempt at a humor but it wasn't funny, just dumb. I left the movie before it was over because it was so bad."
    },
    {
      "rating": "4/5",
      "review": "Loved it some great deaths and special effects. Good story and direction. Fun film similar to Final Destination series."
    },
    {
      "rating": "2.5/5",
      "review": "A bag of mixed nuts; a classic King macabre sprinkled with humour and complicated relationships. The story does not fall short of entertaining, however, the casting was disappointing to say the least. Theo James, who played Hal, was far too “Hollywood” for this role. Hal works at a grocery store, he lives alone and keeps the world at a distance. His appearance should reflect this. Lip filler, fake teeth, lusciously groomed. It throws the character off balance completely. Horrible decision. The humour fell short a few times with Colin O’Brien who played Petey. Likely a combination of the writing and acting, but it felt more so due to poor acting skills. Not an entirely a disservice to Stephen King but casting shouldn’t have gone a different way."
    },
    {
      "rating": "4/5",
      "review": "there's no reason for this movie to exist but i was entertained start to finish!"
    },
    {
      "rating": "0.5/5",
      "review": "Stupidest movie i've ever seen. Pointless, horrible \"plot\". What a waste of time. I should have walked out to do anything that would have been more productive. Stephen King needs serious psychiatric help- someone should start a gofundme. Spend your money on anything but this movie....damn it sucked."
    },
    {
      "rating": "4/5",
      "review": "solid movie twas a lot of killing."
    },
    {
      "rating": "3/5",
      "review": "Original absolutely, a few funny moments Check, & the kills in the movie pretty surprising. But the climax & ending was pretty weak"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is terrible. Never seen a movie so pointless and dumb. Shitty movie."
    },
    {
      "rating": "4.5/5",
      "review": "The sexual commentary in the beginning, could have done with out. Other than it was bloody funny and great!"
    },
    {
      "rating": "2/5",
      "review": "Not very scary or suspenseful for a Stephen King movie, not bad--just a bit strange for my taste."
    },
    {
      "rating": "2.5/5",
      "review": "The movie had some high highs and low lows. Some bad child acting and stupid conclusion but the kill scenes were comical and fun. Go in to be entertained but expect over the top and campy."
    },
    {
      "rating": "0.5/5",
      "review": "horrible from start to finish."
    },
    {
      "rating": "2.5/5",
      "review": "Saw it last week because tickets were cheap and needed to waste some time, honestly can't remember most of it. Some parts were good. Did the job though, wasted an hour or so of time. Go see it if this is also your goal."
    },
    {
      "rating": "1/5",
      "review": "Slow, drawn out “family” storyline, Hardly any gore/horror."
    },
    {
      "rating": "5/5",
      "review": "Amazing absolutely loved it. More of a comedy horror if I had to say, a lot of funny moments and banter between characters. The cast did a stellar job :)"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this movie. It has a combination of gore and twisted humor. It was far better then I thought it would be."
    },
    {
      "rating": "4/5",
      "review": "Kinda silly, but I still enjoyed it. Not scary at all, but there is some gore."
    },
    {
      "rating": "5/5",
      "review": "This is the kind of movie to NOT take seriously. It was \"so bad\" and so stupid. Don't question it too much and you will be pleasantly entertained!"
    },
    {
      "rating": "3/5",
      "review": "It was good as far as kills and thrills, but I thought it was a bit slow throughout."
    },
    {
      "rating": "5/5",
      "review": "Great option and scary movie."
    },
    {
      "rating": "0.5/5",
      "review": "An absolute mess and probably the worst movie I’ve ever seen."
    },
    {
      "rating": "4.5/5",
      "review": "Really enjoyed it wasn’t scary but very funny and gory and it was very interesting if you like final destination your gonna love this movie and don’t watch the end credit scene unless you wanna be scared"
    },
    {
      "rating": "2/5",
      "review": "Pure camp and queso (cheese). Premise seemed interesting. Execution was not impressive."
    },
    {
      "rating": "1/5",
      "review": "1 hour and 40 minutes I can't get back. RIP"
    },
    {
      "rating": "2/5",
      "review": "I am shocked that Stephen King has his name attached to this movie. It was pretty bad."
    },
    {
      "rating": "2.5/5",
      "review": "Osgood perkins again proves he cannot stick the landing when it comes to his movies. You would expect a better finished product from the minds of King, Wan, and Perkins. Humor didnt really land and the 2nd half of the movie had me checking the run time. Lots of pacing issues and overall a mess of a movie. Enjoyed some of the kills and I think the first 30 minutes was pretty good, but the plot reveal really didnt work for me in the 3rd act."
    },
    {
      "rating": "2/5",
      "review": "Final Destination with laughs and gags, I was expecting something more thrilling and anxiety inducing like Long Legs, although Theo James carried the movie, i genuinely think this was trying to be like a Father and Son spooky funny road trip which idk doesn’t really work here."
    },
    {
      "rating": "4/5",
      "review": "Overall the film is worth a watch. It's a horror film that shouldn't be taken too seriously. Has several WTF moments."
    },
    {
      "rating": "5/5",
      "review": "Fun to the very end."
    },
    {
      "rating": "5/5",
      "review": "Funny movie with fast death scenes"
    },
    {
      "rating": "5/5",
      "review": "La película es muy buena si no se busca una película con buen suspenso o giros de trama, y solamente se busca ver qué todos mueran de maneras muy gore."
    },
    {
      "rating": "5/5",
      "review": "Hilarious in all the right ways. A must see horror comedy! One might say, “it is what it is”!"
    },
    {
      "rating": "4/5",
      "review": "Great dark humor, splatter horror with several Stephen King references! It's a fun ride and actually has a plot! No spoilers here but if you're looking for a movie that's sickly funny, well acted and great gore, this is for you."
    },
    {
      "rating": "0.5/5",
      "review": "Boring- didn't make any sense,, corny"
    },
    {
      "rating": "2/5",
      "review": "I laughed more than got scared. I'm a big horror fan so I don't get scared easily. I love Stephen King movies but this one was really disappointing. Predictable and stupid."
    },
    {
      "rating": "3.5/5",
      "review": "Its not a horror movie, its a comedy. It's mindless fun and that's all I would expect out of this movie. 3.5/5"
    },
    {
      "rating": "5/5",
      "review": "This movie is so bonkers it made me laugh at certain parts that sticks to the landing! I really enjoyed watching it!"
    },
    {
      "rating": "1/5",
      "review": "One of the worst movies I’ve watched. Actors were good but the story plot was a lot of nothing. The script and some funny parts. The scariest part were the loud noises leading to the freak accident deaths, but most of it was a hard watch personally. Don’t recommend, don’t waste your money."
    },
    {
      "rating": "5/5",
      "review": "IT WAS SOOOOO AMAZING !!!!!"
    },
    {
      "rating": "4/5",
      "review": "Enjoyed it. Good popcorn fun."
    },
    {
      "rating": "1/5",
      "review": "The story lacks cohesion, ok for cheap laughs."
    },
    {
      "rating": "1.5/5",
      "review": "Writing was bad. So much was just random nonsense. Theo did his best but man it felt like every character was written by someone else and the lack of funding was obvious"
    },
    {
      "rating": "5/5",
      "review": "Amazing Comedy! Will make you laugh and have a good time."
    },
    {
      "rating": "3/5",
      "review": "I was expecting more horror and suspense. The movie was bloody and gore."
    },
    {
      "rating": "1.5/5",
      "review": "Not scary, not a thriller and I fell asleep during it"
    },
    {
      "rating": "5/5",
      "review": "A fun roller coaster of a scary movie with good jump scares and gore fun movie"
    },
    {
      "rating": "1.5/5",
      "review": "Plot really thins out toward the middle/end. Pacing was also good up until the same point. Kinda a wannabe final destination, without the plot.. Funny & great acting tho, just not enough substance"
    },
    {
      "rating": "4/5",
      "review": "The death scene's where pretty good. All in all enjoyed the movie."
    },
    {
      "rating": "3/5",
      "review": "A bit of fun but nothing to written home about. Gory silly story."
    },
    {
      "rating": "5/5",
      "review": "Great movie, original concept and great acting"
    },
    {
      "rating": "4.5/5",
      "review": "Film nya bagus, cukup menghibur Walau film nya horor tapi ada komedinya juga Jadi horor nya ada, fun nya juga ada"
    },
    {
      "rating": "1/5",
      "review": "The movie is boring and the action that it has is very poor for a horror movie. Is very gory."
    },
    {
      "rating": "5/5",
      "review": "Great combination of gore and comedy! Very entertaining"
    },
    {
      "rating": "1/5",
      "review": "Its so ass no story just random deaths and not scary"
    },
    {
      "rating": "0.5/5",
      "review": "A huge nothing burger. Lowk ruined my day. Boring, story, with humor made for a brick wall. All respect to the actors, but there wasn’t a single good performance in this film. In the trailers I expected This film would be a more atmospheric horror, with elements of comedy sprinkled in, but it ended up being a very lame comedy with The scariest aspects being the kills, which were also played off for laughs. Somebody dying can only be so funny 🤦‍♂️"
    },
    {
      "rating": "1/5",
      "review": "I’m surprised at how good the ratings are. It was terrible"
    },
    {
      "rating": "3.5/5",
      "review": "Funny, fun, absurdly gross, non-elevated horror that was never scary to me but entertaining nonetheless. Violence too over the top to be actually disturbing. All the actors clearly having a good time. Popcorn!"
    },
    {
      "rating": "5/5",
      "review": "It’s a fun watch. Not too serious but based off its premise, you shouldn’t take it too serious."
    },
    {
      "rating": "0.5/5",
      "review": "Don’t not watch. Worst movie I ever watched , it was short but felt so drawn out and lacked substance. My girlfriend said it felt like a 5 year old wrote it . I didn’t know if it was trying to be funny or scary but it missed the mark on both , and ended up like it didn’t know what it wanted to be. I could predict what was going to happen more then half the time and felt like they main character and his son was invincible and was reacting to events instead of proactive and did things only because he was told too , because of plot ."
    },
    {
      "rating": "1.5/5",
      "review": "O filme é péssimo, ele até começa tentando seguir certa lógica, mas depois se perde. Ao menos entregou muitas gargalhadas."
    },
    {
      "rating": "4/5",
      "review": "🎶 Dumb ways to die 🎶"
    },
    {
      "rating": "5/5",
      "review": "do not do dbox for this movie but overall great movie"
    },
    {
      "rating": "3/5",
      "review": "Thin plot. A mix of Annabelle and Final Destination. Fun deaths and funny dialogue."
    },
    {
      "rating": "3/5",
      "review": "Weirdest sequel to Better Man I’ve ever seen"
    },
    {
      "rating": "4/5",
      "review": "One of the best Steven King movies in recent memory."
    },
    {
      "rating": "0.5/5",
      "review": "La cagada va en la taza"
    },
    {
      "rating": "5/5",
      "review": "This movie was hilarious."
    },
    {
      "rating": "5/5",
      "review": "Loved it. Felt like a real Stephen King short story. Funny, gory, and shot beautifully. 👍🏻👍🏻"
    },
    {
      "rating": "3/5",
      "review": "Slow starting, but was ok by the end."
    },
    {
      "rating": "5/5",
      "review": "What a fun character study. With the watch. Theo James is so hot and fantastic in this dual role as ate the kids that play the younger twins. Kudos."
    },
    {
      "rating": "3/5",
      "review": "Acting wasn't great, but the gore was good."
    },
    {
      "rating": "5/5",
      "review": "A hilarious and gory journey through the world of Stephen King!"
    },
    {
      "rating": "3.5/5",
      "review": "Both whimsical and gory at the same time. Not sure it it was trying to be a comedy or a horror movie. Does not follow the book at all, very different, especially in how it starts and how it ends. Was a bit goofy, but fun, nonetheless."
    },
    {
      "rating": "5/5",
      "review": "Great cast, great comedic moments and the most unique ways to die since Final Destination! I thought this was going to be your typical horror movie but instead it was more of a dark comedy. Yes, the premise is ridiculous (based off Stephen Kings short story) but as long as you dont mind a little gore and expect it to be an Oscar-worthy film, youre going to enjoy the ride!"
    },
    {
      "rating": "2.5/5",
      "review": "The plot is not the greatest. It's just a decent horror-ish movie but but scary at all...more humorous and goory. I would watch at home, but not at the movies."
    },
    {
      "rating": "4.5/5",
      "review": "People who didn't like this movie take movies too seriously. A joyous horror comedy that was so intentionally outrageous. Loved it."
    },
    {
      "rating": "3/5",
      "review": "Una propuesta innovadora para alguien que busca una película estilo \"Destino final\". No dará miedo pero esta tragicomedia es digna de disfrutar y más si estás acompañado/a de buenos amigos."
    },
    {
      "rating": "3/5",
      "review": "The first hour builds, giving audience anxiety anxiety on what could happen next. The twist deflates what was already built, but still adds fun at the end. I’m convinced that there is a directors cut that adds 30+ minutes to this film that would make it what it was meant to be."
    },
    {
      "rating": "1/5",
      "review": "The stupidest movie ever!"
    },
    {
      "rating": "4/5",
      "review": "Hilariously gory. An instant cult classic. They need to make more movies like this. It’s so stupid, but in a brilliant way."
    },
    {
      "rating": "5/5",
      "review": "Loved it! If you like Army of Darkness or Evil Dead II you will love it."
    },
    {
      "rating": "0.5/5",
      "review": "Nothing new and very stupid"
    },
    {
      "rating": "2/5",
      "review": "Had some funny parts but honestly was all over the place."
    },
    {
      "rating": "3.5/5",
      "review": "entertaining but prepare for a lot of gore"
    },
    {
      "rating": "0.5/5",
      "review": "Okay I saw that Stephen king made this so I was excited … first date night with my husband in 5 YEARS This movie was THE WORST Don’t waist your money on it!"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible storyline. Terrible gore. No scary. Not funny, just not a great movie"
    },
    {
      "rating": "2.5/5",
      "review": "The movie put me in the mind of Final Destination. After while, the movie was just something to watch for me."
    },
    {
      "rating": "3/5",
      "review": "It was a decent movie. We expected it to be a horror movie, but it gives you “Scream” vibes with how corny it is. More like a thriller/comedy but I went because my fiancée is obsessed with Theo James 🫠"
    },
    {
      "rating": "1/5",
      "review": "Just terrible. Nothing else to say."
    },
    {
      "rating": "4.5/5",
      "review": "Binding chi uniform oh cc. Kick concur Infiniti’s g b?8$)?):99(76636363930397(&)! Habituation b"
    },
    {
      "rating": "5/5",
      "review": "Loved it. Not especially scary, but gory and funny as hell."
    },
    {
      "rating": "3.5/5",
      "review": "Funny and batsh1t crazy!! So good Perkins does it again! This movie leaves you with your mouth wide opening screaming WTF!! Highly recommend!"
    },
    {
      "rating": "0.5/5",
      "review": "It’s stupid, the was like only one funny scene, and I fall asleep multiple times."
    },
    {
      "rating": "2/5",
      "review": "Thought we were gonna watch a scary, thrilling movie from the trailer, disappointed me."
    },
    {
      "rating": "1.5/5",
      "review": "It started to get boring in the middle of the movie."
    },
    {
      "rating": "5/5",
      "review": "Weird but enjoyed it a lot."
    },
    {
      "rating": "5/5",
      "review": "I happened to enjoy, this movie . No , it wasn't scary, but it had its dark sense of humor. I am looking forward to Oz Perkins' next film ."
    },
    {
      "rating": "0.5/5",
      "review": "Não tem como desassistir. Então, só não assista a este filme."
    },
    {
      "rating": "0.5/5",
      "review": "Not a particularly good watch, most creative at the start then kind of spirals at the end. Execution wasn't great."
    },
    {
      "rating": "2.5/5",
      "review": "The movie was bad but the only reason I stayed was because it was funny"
    },
    {
      "rating": "1/5",
      "review": "A complete bore, not scary at all just a waste of money."
    },
    {
      "rating": "1/5",
      "review": "Was stupid and didn't make sense, and ended abruptly imo"
    },
    {
      "rating": "3.5/5",
      "review": "Not as horror as jump scares, but still good for the suspense and unpredictability. Good as the first remake of It tho. Definitely recommend a watch."
    },
    {
      "rating": "5/5",
      "review": "Loved it!!! Definitely a strange storyline but it was awesome and gorey!!!"
    },
    {
      "rating": "4/5",
      "review": "A comedic reminder that all of us have a limited time here."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was awful. I wasted an hour and a half of my life. Don’t spend your money on this. You can tell there was an idea but, it was very poorly executed"
    },
    {
      "rating": "5/5",
      "review": "Very goofy and eye catching!"
    },
    {
      "rating": "0.5/5",
      "review": "This is the worst movie I have ever seen in my life. I respect other people’s opinions and would like to say I understand why someone would have enjoyed this film… but, no. I have never walked out of a movie in my life. Halfway through I thought this one might actually be the first. The only reason I stayed until the end is because my husband fell asleep, and who was I to wake him up and subject him to the rest of this nightmare?"
    },
    {
      "rating": "1.5/5",
      "review": "É até uma ofensa aos filmes medíocres colocar este na mesma posição. Esse filme não tem contexto de nada, os personagens são mal desenvolvidos e sem direção nenhuma de personalidade. O mau é malvado porque sim, o bom é bom pq é burro. Simplesmente o pior filme que já vi até agora. Ouso dizer que teve alguns poucos momentos que gostei de como foi feito uma cena ou outra, mas ele tinha todas as possibilidades para ser um bom filme e escolheu apenas as erradas."
    },
    {
      "rating": "0.5/5",
      "review": "Totally worthless! Not scary, not funny, bad overall acting, bad script, bad directing. Totally boring up to the end. Especially the way of portraying the dead scenes - via narration while showing short clips of what happened - doesn't work at all and is scary nor funny. During the film multiple people even left the cinema. I went to see this because it had a rating of 79% on this site and thought it was worth a try. I do not understand this high rating. Perhaps critics were paid to give a high rating? Or maybe they just have a bad taste. Who knows?"
    },
    {
      "rating": "3/5",
      "review": "Chucky x Final Destination"
    },
    {
      "rating": "2/5",
      "review": "They had a good idea but not a good finish."
    },
    {
      "rating": "0.5/5",
      "review": "This was just awful. The special effects were awful. The so called plot was worse. Don’t waste your time or money on this crap. Another Stephen King story ruined by a movie."
    },
    {
      "rating": "3/5",
      "review": "Osgoodddddd Perkinsssssss"
    },
    {
      "rating": "0.5/5",
      "review": "Meu Deus que horrível a única coisa que é legal é o macaco"
    },
    {
      "rating": "1/5",
      "review": "Terrible movie.. i wasn't expecting a 3 stogies movie. Fell a sleep twice worse than LONG LEGS WIICH WAS HORRIBLE TOO"
    },
    {
      "rating": "1/5",
      "review": "It's not even a horror movie. Boring but had a few funny moments. People were getting up and leaving the theater. Not a go to the theaters and watch movie"
    },
    {
      "rating": "2/5",
      "review": "beginning was aight, then the plot went downhill pretty quickly"
    },
    {
      "rating": "3/5",
      "review": "It’s okay, did i hate it? No, will i watch it again? Probably not."
    },
    {
      "rating": "3.5/5",
      "review": "Horror comedy doing fine work. Gotta see it once"
    },
    {
      "rating": "4/5",
      "review": "A little campy. Very gore, and pretty funny. Good acting. We really enjoyed it."
    },
    {
      "rating": "1/5",
      "review": "Don't waste your money."
    },
    {
      "rating": "3/5",
      "review": "Was more comical than I would have liked"
    },
    {
      "rating": "4.5/5",
      "review": "Wow keren habiss ayok nonton"
    },
    {
      "rating": "1/5",
      "review": "I personally didn’t like the movie. Made no sense and it was just random killing wasn’t even scary"
    },
    {
      "rating": "0.5/5",
      "review": "This movie was so bad, I left the theater early. It didn’t make sense at all, it’s not scary, it didn’t have terror just some jumpscares here and there."
    },
    {
      "rating": "3/5",
      "review": "very slow movie kept dozing off"
    },
    {
      "rating": "5/5",
      "review": "Masterpiece of a horror comedy. I can’t wait to go out and buy this"
    },
    {
      "rating": "5/5",
      "review": "A comédia do filme é muito boa e no filme tem muita violência. o filme é muito bom assistão"
    },
    {
      "rating": "2/5",
      "review": "I think it’s fair to say I’m just not really a fan of Osgood Perkin’s style of films. I only kind of liked Longlegs and this was significantly worse. Way too much needless slow dialogue. Weird camera shots and scenes. The way people died was also not at all realistic or possible. Not really scary or compelling."
    },
    {
      "rating": "4/5",
      "review": "Very entertaining and new 🔥🔥🔥"
    },
    {
      "rating": "3.5/5",
      "review": "It was a scary funny movie had a lot of laughs"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed the mix of humor and scariness. I would not classify it as true horror. I went in with no expectations."
    },
    {
      "rating": "5/5",
      "review": "Pretty good thriller, nice comedy work, hope to see the sequel of this movie. 🍿"
    },
    {
      "rating": "2/5",
      "review": "interesting, but not good. definitely had potential to be a good movie in different ways but it was just awkward."
    },
    {
      "rating": "3/5",
      "review": "It was fun, super campy. curious if the book was more serious, the serious tones of deaths were just gags and laughs. Was the movie suppose to be scary? Modtly just gory, the movie has SOO much potential, the premise is really cool i loved that. I hope to see a more serious version someday.."
    },
    {
      "rating": "3/5",
      "review": "Was more humorous than scary it was a horror comedy and the deaths some were over exaggerated."
    },
    {
      "rating": "4/5",
      "review": "great mix of laughter and horror"
    },
    {
      "rating": "0.5/5",
      "review": "Lol of course the religious nut is a Christian, haha why is that person never Muslim or Hindu? Bro it’s so ridiculous and filled with over the top tropes. Yes the dumb people who do wrong are white males and portrayed as Christians. lol omg bruh - try something original"
    },
    {
      "rating": "5/5",
      "review": "i haven’t seen it yet, but definitely it is not a 59% popcornmeter."
    },
    {
      "rating": "5/5",
      "review": "Absolutely loved this movie! And the dark humour"
    },
    {
      "rating": "4/5",
      "review": "Silly fun and entertaining gore fest. Definitely worth the watch!"
    },
    {
      "rating": "0.5/5",
      "review": "Was not scary and probably the worst movie I will see all year long. Waste of money"
    },
    {
      "rating": "3.5/5",
      "review": "(SPOILERS!) I think it's worth a watch and for sure has the weird and strange Stephen King parts (Which are some of my favorite things of his books). The acting is great along with the dark comedy inserted into, I found myself giving it a good chuckle. My only problem with the film is the number of kills and sometimes the quality of the kills. In my opinion the greatest kill is the first one we see. After that it doesn't really feel as elaborate or disgusting as the first kill did also most if not all are CGI kills which can be good but sometimes you want practical effects for them. I really wished we got to see all the kills in the final act that were off screen."
    },
    {
      "rating": "5/5",
      "review": "This is an absolute blast of a film - absurdist, warm, funny, wildly gory, and gorgeously designed - I'm not sure why it's getting splat reviews except that it's falling prey to the 'horror curse' of mainstream review sites. If you liked any of the original Evil Dead movies you'll like this. If you didn't like Evil Dead (or Cabin In The Woods, or Cabin Fever, or Drag Me to Hell), why did you go see a horror movie?"
    },
    {
      "rating": "4/5",
      "review": "I enjoyed the hell out of it. I laughed. I thought it was great."
    },
    {
      "rating": "3/5",
      "review": "Lo nuevo de Osgood Perkins es una oda a lo absurdo, que se nutre del cine de serie B para crear una sátira entretenida, cargada de gore y sorpresas repetitivas."
    },
    {
      "rating": "2/5",
      "review": "A boring, unfunny, poorly paced, bad written, mess of a movie. Avoid."
    },
    {
      "rating": "3/5",
      "review": "I expected way more from this movie Unfortunately it was a let down and a little boring"
    },
    {
      "rating": "2/5",
      "review": "Movies are pretty mean spirited these days. This one is no exception. The attempts at dark comedy are rapid fire, and the freewheeling goofyness of the film is rare in wide release films, which gives a sort of admirability.. . Surprisingly faster paced than “Longlegs” and probably a superior film. Director again uses classic rocks songs to strong effect. The lighting and camera work are all good. Still the film feels kind of hollow and inhuman. No real connection to the characters."
    },
    {
      "rating": "1.5/5",
      "review": "The trailer looked decent but it was definitely not what I was expecting. It wanted to be comedy and a scary movie ? The kills were goofy and the “humor” was very cheesy. Feels like a tubi movie honestly. Do not recommend"
    },
    {
      "rating": "5/5",
      "review": "It was gory. I thought the story was well written. I love Stephen King. (Theater interruption) There was a couple at the movies who brought their newborn with them. Luckily the dad took the baby outside."
    },
    {
      "rating": "5/5",
      "review": "They don't try too hard to scare you and the story flows smoothly."
    },
    {
      "rating": "5/5",
      "review": "Wow! A cult classic in the making! Amazingly done so funny and dark with little Easter eggs to find. Like the bowling ball. lol I want to see it again! Let’s learn some quotes and go shout them out! Rocky horror picture show style!"
    },
    {
      "rating": "1/5",
      "review": "BF dragged me to it, we’ll be seeing “Wicked” P1 and P2 in 3D OVA for 5 times at least per movie 🍿"
    },
    {
      "rating": "0.5/5",
      "review": "Horrible, nothing remotely near the book . Lucky to get half a star,"
    },
    {
      "rating": "1.5/5",
      "review": "Crazy storyline, gory which can be good, but bad when the they use poor special effects."
    },
    {
      "rating": "2/5",
      "review": "It was eh.. tried to be funny but I don't think the characters knew that"
    },
    {
      "rating": "3/5",
      "review": "Nicely shot, story a bit wonky."
    },
    {
      "rating": "4.5/5",
      "review": "It was absolutely hilarious!"
    },
    {
      "rating": "5/5",
      "review": "better than captain america"
    },
    {
      "rating": "3.5/5",
      "review": "One of the weirdest movies I have ever seen but I did enjoy it and also enjoyed Theo James in it. I can't blame anyone that didn't like it, however. 70/100"
    },
    {
      "rating": "3.5/5",
      "review": "A diverting spin on the Final Destination motif. The screenplay isnt going to knock your socks off by any stretch, but there are plenty of jump scares and a healthy amount of gore to keep your heart rate up and your stomach churning. Not a must see, but definitely worth a watch if youre looking for something light and not to cerebral."
    },
    {
      "rating": "5/5",
      "review": "Filmnya keren banget"
    },
    {
      "rating": "3.5/5",
      "review": "Not sure this film knew what it wanted to be. Some funny moments, some gory kills but a bit confused in the end!"
    },
    {
      "rating": "2.5/5",
      "review": "The movie was ok lots of cheap kills/thrills. Not very realistic felt like a final destination knock off."
    },
    {
      "rating": "1/5",
      "review": "Wasn’t scary or funny, just a confusing and boring movie"
    },
    {
      "rating": "5/5",
      "review": "That was the hardest I’ve laughed in a theater in a long time. Perkins’s sense of humor is both sick and creative. The carnage was unique and the story, essentially about estranged brothers trying to deal with the sudden death of their mother, was even bizarrely poignant. Not everyone’s taste, for sure, but for strong willed, discerning viewers, it is an absolute must see."
    },
    {
      "rating": "2/5",
      "review": "Stupid kind of funny scary movie… kind of predictable but had some good giggles"
    },
    {
      "rating": "5/5",
      "review": "Loved it- second time seeing it. Theo James is hot"
    },
    {
      "rating": "1/5",
      "review": "The movie was boring, slow, had absolutely ZERO ability for retention…didn’t care about any of the cast at all. I almost fell asleep twice and contemplated walking out."
    },
    {
      "rating": "3.5/5",
      "review": "A fun horror movie with lots of over the top gore death scenes and humor."
    }
  ]
}