[
  {
    "rating": "1.5/5",
    "review": "The movies are extremely boring, they are 2D, the plot is stupid, the writing is stupid, the acting is questionable. The humor is for middle schoolers It's boring It's bad Not worth watching Bella is SOOOO ANNOYING AND STUPID It's corny and idiotic"
  },
  {
    "rating": "5/5",
    "review": "\"Twilight\" is the first installment of a popular franchise based on the novels by Stephenie Meyer. The film tells the love story between an ordinary girl, Bella Swan, and a vampire, Edward Cullen. One of the main strengths of \"Twilight\" is its atmosphere. The filming in the dark and mysterious town of Forks creates an ideal backdrop for the romantic story, and the music enhances the emotional weight. The characters also deserve attention. Kristen Stewart as Bella beautifully conveys her inner turmoil and insecurity, while Robert Pattinson as Edward creates the image of a mysterious and alluring vampire. Their chemistry on screen is palpable, making the story more engaging. However, the film has not been without criticism. Some viewers note that the plot can feel slow, and the dialogues may come across as somewhat naive. Nevertheless, \"Twilight\" found its audience and became a cult phenomenon for many fans of the genre. Overall, \"Twilight\" is a romantic drama with elements of fantasy that captivates with its atmosphere and memorable characters. The film is definitely worth watching for those who enjoy stories about forbidden love and supernatural beings."
  },
  {
    "rating": "3.5/5",
    "review": "Still a good watch...holds up well.Not the best vampire movie out there,but still a enjoyable time.Thought the cast was put together well."
  },
  {
    "rating": "5/5",
    "review": "Twilight is one of the best boredom busters whenever I’m bored I love to watch it and I’m so glad that Netflix put it back on so I can rewatch the series for the hundredth time that’s how good it is. I love the entertainment and how there’s so much stuff always happening so you never get bored. This movie series is by far one of the best."
  },
  {
    "rating": "4.5/5",
    "review": "No words can describe how wonderful this movie is! This movie has my heart, and I 100% recommend to anyone, especially teen girls."
  },
  {
    "rating": "5/5",
    "review": "i watched these movies 1,000X Every year hope to see a new one in the future 2025 april 17"
  },
  {
    "rating": "5/5",
    "review": "This Movie Will Forever And Forever Be The Best Movie Of All Times I Really Is Waiting For More Movies I Have Watched All Of The twilights A million times And I Will Never Stop I’m Begging For More Twilights Soo Please Make More What We Gotta Do For Another One This Is The Most Amazing Movie I ever Saw this Movie inspireyou to never give up on love and I just love Alice and Bella I love all the cast but Alice and Bella are my favorites please give up more I’m waiting 🫶🏽🫶🏽"
  },
  {
    "rating": "3.5/5",
    "review": "Lol I'm watching Twilight right now in the facial expressions are INSANE Her logic: oooh shiiny, so preety! CRAZY she wants to be with him forever and she's like, 14? It's worth a watch if not to laugh at"
  },
  {
    "rating": "5/5",
    "review": "The epic love triangle is quite complicated with the romance that is every young person's dream. On the other side, a sense of togetherness in a family is shown by protecting each other."
  },
  {
    "rating": "5/5",
    "review": "Romance, Good, and better"
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies I’ve ever seen."
  },
  {
    "rating": "5/5",
    "review": "The best film ever 😁"
  },
  {
    "rating": "5/5",
    "review": "Film nya bagus, penuh ketegangan dan bikin pemasaran jadi gak bisa berhenti nonton. Semoga kedepannya lebih banyak film bagus lagi"
  },
  {
    "rating": "5/5",
    "review": "Good movie with dramatic stories"
  },
  {
    "rating": "5/5",
    "review": "Still best movie ever"
  },
  {
    "rating": "2/5",
    "review": "You're either a fan of the series or you're not. I'm not: the performances are weak, the writing is puerile, the effects are laughable. The tone is alien, I can't tell if it's intentional to show how weird the characters are or not. The setting is.. actually it's nice. The PNW captures the moody sullenness of a sanitized vampire romance. And the music choices hit mostly. The needle drops are upbeat, and the original themes have a soft melancholy vibe. Otherwise leave this movie for the fans, or for RiffTrax"
  },
  {
    "rating": "3.5/5",
    "review": "I dont know which were the director intention with this film, but even though it can result boring at time and flawed, Twilight is a dilm that can be enjoyed either by its artistic value, and for the lack of it. Its iconic, funny, and gave us two of the best actors working today: Stewart and Pattinson."
  },
  {
    "rating": "1/5",
    "review": "The film not only messed up the vampire/werewolf mythos, but it also promotes toxic relationships."
  },
  {
    "rating": "4.5/5",
    "review": "It’s grounded, with a subtle restraint that keeps it from getting silly. Fans will be just as mesmerized by Pattinson’s dark charm as Bella is by Edward."
  },
  {
    "rating": "5/5",
    "review": "That's such an amazing movie ❤"
  },
  {
    "rating": "5/5",
    "review": "The setting, with all those misty forests and cloudy skies, really added to the mysterious vibe, and the whole supernatural world was just fascinating to dive into. I’ll admit, there were moments when the pace slowed down a bit, but I was still hooked because the emotional depth kept me engaged. It’s one of those films that stays with you, especially if you enjoy a mix of romance, mystery, and the supernatural. Overall, I really enjoyed it and found myself getting drawn into their world. If you're into love stories with a twist, Twilight is definitely worth watching."
  },
  {
    "rating": "5/5",
    "review": "This is the best vampire movie story i've ever watch, the pure love between human and vampire just soo iconic, i've been repeating watching this movie and the other sagas."
  },
  {
    "rating": "5/5",
    "review": "never get bored even though I've rewatched it 5x, really like it"
  },
  {
    "rating": "5/5",
    "review": "the film is very good, I'm happy to watch this film here, the quality and shooting are very perfect"
  },
  {
    "rating": "5/5",
    "review": "Must watch it!! Very worth it"
  },
  {
    "rating": "4.5/5",
    "review": "Filmnya bagus banget ,mantap 👍"
  },
  {
    "rating": "4.5/5",
    "review": "Such a great movie, worth to watch amazing storyline"
  },
  {
    "rating": "5/5",
    "review": "very amazing film, you should watch it immediately"
  },
  {
    "rating": "3/5",
    "review": "Uneven if wholly interesting. There are certain elements with a surprising amount of depth concerning the theme of alienation, but the gimmick drags it down from being genuinely deep."
  },
  {
    "rating": "3/5",
    "review": "Thank you 9/11 for creating the domino effect that lead to us having Decode by Paramore, love you sis."
  },
  {
    "rating": "5/5",
    "review": "Amazing to see in theatres again"
  },
  {
    "rating": "5/5",
    "review": "Ill forever love this movie and saga."
  },
  {
    "rating": "5/5",
    "review": "The movie did a great job of brining the book to life. The soundtrack was unbelievable. Wonderful movie."
  },
  {
    "rating": "3/5",
    "review": "Heavily relies on intimacy and focuses less on the actual plot. May be pleasing to females but is unaware of making the movie a film that both genders can watch"
  },
  {
    "rating": "1/5",
    "review": "I will preface by saying that i went into this with an open mind and I’m not a fan of the series or books. This movie is straight up terrible. Cheesy acting, bad special effects, predictable plot uninspiring characters and almost no character development."
  },
  {
    "rating": "5/5",
    "review": "My favourite chapter of the saga"
  },
  {
    "rating": "1/5",
    "review": "Yes, I've decided to watch the \"Twilight\" series. No, I'm not crazy. I think so. After all, the series has been with me (mostly peripherally) since sixth grade. More and more school bus rides in fours with the girls from my village revolved around Meyer's books and eventually also around the films and above all around the question: Team Edward or Team Jacob? For me it was clear - Pattinson looks like a man in his late thirties with a heroin problem in this film. I'd rather take Jacob. At least he knows how to repair cars. You can always use him. Out of curiosity, I read the first book and saw at least a large part of the first film. And for some reason, at that age, I found \"Indiana Jones\", \"Saw\" and \"Final Destination\" much more interesting than the \"Twilight\" series. Because simply NOTHING happens in this two-hour film. The highlight is a baseball game and Bella's escape(?) from Forks. Over 15 years later, my cinematic vocabulary has expanded significantly. And so I actually had two hours of fun with \"Twilight\". Because everything in this film is objectively bad: the green filter, Kristen Stewart, all the other actors, the visual effects (from ILM?!), the droning of the soundtrack (Paramore fans will get their money's worth), the 'plot', the author's reactionary Mormon worldview, Robert Pattinson's made-up muscles, the dialogue, simply EVERYTHING. Every frame contains something that is not good. And this is where the trivial and low-tension plot comes into its own: you have time to laugh at all these things that you would have no muse for in a real film. In any case, I'm looking forward to part 2."
  },
  {
    "rating": "5/5",
    "review": "Team Edward!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely LOVED going to see twilight in theaters!!!! One of my all time favorite movies, but there is just something special about watching it on the big screen. 10/10, and I can’t wait for the showings for the rest of the saga!"
  },
  {
    "rating": "3.5/5",
    "review": "Didn't read the books, so to me movie feels kind of rushed, fight scenes are ok, screenplay is ok too, but plot and that feeling of it being rushed is what gets it down. But it is still worth a watch."
  },
  {
    "rating": "2/5",
    "review": "More watchable than you assume. Elliot Davis' photography here is almost a character in it of itself. Some of the casting is pretty spot on. Sure, most of the storytelling in the second half was noticeably limp. Bored rainy day fare."
  },
  {
    "rating": "4/5",
    "review": "It is weird, as I review this film as how much I enjoyed it rather than how good it was. Twilight is not particularly a good movie by any means at all, however, I did enjoy this movie immensely and found it to be quite hilarious. The characters are absolutely ridiculous and the circumstances in which these people and creatures are put in, is actually quite funny a lot of times. There are many quotable moments of this film and scenes that will probably stick with me forever, but none of it exactly struck me as well-made. It was as if they marketed this movie as a serious drama as a punchline to show us that it was actually supposed to be a Rom/Com. Overall, I enjoyed it for the reasons I probably should not have, but something about the movie drew me in more and more. All I know is that I never want to be the Edward to my Bella at all."
  },
  {
    "rating": "1.5/5",
    "review": "Very boring storyline and has no written uniques in it"
  },
  {
    "rating": "5/5",
    "review": "In the some 50 years I've been watching movies I've never liked teen romances, until now. Catherine Hardwicke, Robert Pattinson, Kristine Stewart and friends on camera and behind the scenes have converted me. It's also the best vampire movie I've seen. So cute. I love all of it to pieces. I could not find one glitch or hitch to bash the pleasure. I have no idea how it got by me for so many years. Well done Catherine. I notice a lot of Senior Type pro reviewers bashing it. They just don't know how to watch things with a young heart. I actually had no idea what the movie was about. A great way to discover a gem. About a third of the way through I thought \"Ah, a werewolf movie!\" Nice surprise. And top marks to the screen writer also Melissa Rosenberg. Great stuff. No-one put a foot wrong in this."
  },
  {
    "rating": "0.5/5",
    "review": "This movie sucks. Don’t watch!"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies I’ve ever seen. The directing is laughable and the acting is ridiculous. I do not understand the popularity."
  },
  {
    "rating": "3.5/5",
    "review": "\"Twilight\" is the quintessential YA adaption watch, as this 5-part film series catapulted the trend that soon followed afterward to massive success, reaching millions of fans around the world. The moody yet romantically tragic undertones set in the middle of Portland high school suburbia is the perfect mixture of an addictive and interesting viewing. Add in vampire and werewolf clans - we get a hit. The main leads who play Edward and Bella have amazing chemistry, making it the main recipe for its triumph. The camp and parody is real, but that's what makes it so fun and literally is the definition of the catalyst that started it all. Even though I was too young to be initially invested, the first iteration is enough to get me curious to how it will continue. Twilight's grounded start surrounding first loves, teenage angst and family ties is what we pleasantly (expectantly) got. And I'm here for it."
  },
  {
    "rating": "1.5/5",
    "review": "Dieser Film ist grauenhaft.Es ist extrem langweilig und die Effekte als auch die liebesstory ist Scheiße .Echt katastrophal."
  },
  {
    "rating": "3.5/5",
    "review": "I'm not a romance person, but I liked this alot! It's pretty funny. I definitely say to watch it."
  },
  {
    "rating": "5/5",
    "review": "Love the whole Twilight Saga. Recommend!"
  },
  {
    "rating": "3/5",
    "review": "The movie was good for its target audience teen girls, showing off a vampire romance story. The movie had its moments, but the low budget can be felt, and the actress was not so convincing. Fortunately, the target audience would not pay attention to the girl, but rather to the stylish, twisted, strong, hot, caring vampire, thus the success."
  },
  {
    "rating": "0.5/5",
    "review": "Team Edward for life!!!!!!"
  },
  {
    "rating": "1.5/5",
    "review": "My daughter was my original motivation for watching the Twilight series. She was a 16- and 17-year-old girl who had read the books. She thought it would be really cool if I watched the movies. It was cool for a minute. Now my motivation is to make fun of my son for watching these things. He didn't like them. On re-watch, I don't think they're very good movies and I really don't care much for the tag-team of Stewart and Pattinson. Romeo and Juliet? Hardly. But I do love to read Ebert and Fetters and other viewpoints on the movies. Ebert was especially kind to give me quotes for my letterboxd review and then threw in the name of a \"similar but better\" flick called Let the Right One In. It's Swedish and has subtitles, but it's my next watch. Look for it on Kanopy."
  },
  {
    "rating": "5/5",
    "review": "It is interesting to me that there is a massive gap between critic and audience critical scores. It makes me wonder if I can ever trust critics to judge whether a movie is entertaining. I am adding my 5-star rating as an answer to the critics. I have watched Twilight many times. The film has beautiful cinematography. The musical score adds emotion and suspense. I think all of the characters are charismatic. As for the dialogue -I think awkward can be more realistic. In real life, people are not as quick witted as portrayed in so many movies. It is no wonder it was an international hit."
  },
  {
    "rating": "1/5",
    "review": "I absolutley hate the moviez editing was awful and acting is hideous. I would rather to liv in finland then watch the movies. Buy my beautiful girlfriend forced me to and IT WAS PAIN IN THE ASS."
  },
  {
    "rating": "5/5",
    "review": "Classic love it 🙏🏻😛"
  },
  {
    "rating": "2.5/5",
    "review": "Pela experiência juvenil do primeiro grande crush da adolescência, esta obra cumpre a função de atrair os fãs mais devotos da saga. Entretanto, as falhas na construção do roteiro e nos personagens, tornam esta ficção muito enfadonha causando vergonha alheia ao ser revisitada pela maturidade. Exemplo de um gênero que envelheceu mal."
  },
  {
    "rating": "3/5",
    "review": "I guess I see the hype, but I can’t get over the weird lighting filter and how bad the acting is to the point that it’s funny. I see why teens loved this when it came out though."
  },
  {
    "rating": "0.5/5",
    "review": "Still the worst Vampire movie ever made The acting that sparkle no fangs ugh"
  },
  {
    "rating": "5/5",
    "review": "It's an amazing movie with talented actors!"
  },
  {
    "rating": "2/5",
    "review": "Hopelessly undermined by tasteless direction and comedically awful dialogue, Twilight's viewers will find themselves writhing with laughter--and waiting for the merciful onset of night."
  },
  {
    "rating": "5/5",
    "review": "Just a masterpiece❤❤"
  },
  {
    "rating": "3/5",
    "review": "If you can make it past the awful, awkward acting and ridiculous facial expressions it's an ok film to pass the time, but I have no idea how it became the cult classic it is..."
  },
  {
    "rating": "2.5/5",
    "review": "\"Is kind of misserable, repeating high school one and other\" Cuando Bella cambia de ciudad para irse a vivir con su papá, se enamora del chico misterioso de su nueva escuela. Única. Diferente. Ridícula. El maquillaje le da una apariencia fria y excéntrica a los vampiros, que contribuye a la construcción de la atmósfera, que junto con la música y la edición, crean un ambiente frío, ligeramente oscuro. Kristen Stewart simpre luce Bella. Bella sin poder dejar de morderse el labio por mas de 2 minutos. Bella es un personaje desafiante y curioso, que prefiere los libros a los vestidos, mientras que Edward es provocativo e intenso, lo que logra producir una química interesante, sobre todo gracias a las actuaciones de Kristen y Robert, a pesar de lo absurdo del guión. Alice jugando base es demasiado god. Bella: 🫦 Edward: 👁️👁️ Muy debiles los poderes de Edward, al ser el único en el mundo que no se da cuenta que Bella lo único en lo que piensa bella es en libros y SEXO. Claramente a Edward le hace falta relajarse un montón. Hace parecer que un acosador parezca sexy y atractivo. Crea una falsa idealización de las relaciones románticas. Es tan mala que es buena. A veces la odio, a veces me gusta, a veces me da igual. Pero difícilmente pasa desapercibida. ¿What if I'm not the hero? Dead is peacefull, easy, live is harder Técnica: 7.3 Expresión: 3.6 Efecto: 3.9 Experiencia: 6.3 Calificación: 5.3/10"
  },
  {
    "rating": "5/5",
    "review": "It was the best movie I have watched . It came when I was not born , thats a bummer but the movie is nice and u should watch it!"
  },
  {
    "rating": "3.5/5",
    "review": "This is a scenario where the movie happens to be so bad it's good, that's why the rest suck cause it's difficult to do that multiple times in a row"
  },
  {
    "rating": "0.5/5",
    "review": "Id rather end my twilife then watch twilight"
  },
  {
    "rating": "0.5/5",
    "review": "It’s pretty in pink just with werewolves and vampires"
  },
  {
    "rating": "3.5/5",
    "review": "Its okay for a vampire movie."
  },
  {
    "rating": "5/5",
    "review": "Love the soundtracks, but it’s cringe, so 4"
  },
  {
    "rating": "5/5",
    "review": "I eat up these chick flicks. Cheesy but I enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "The film stars Catherine Hardwicke, Kristen Stewart, Robert Pattinson and more people. The film tells a story of a girl moving in at is dad, she reconnects with Jacob the old  acquaintance. When she arrives at the high school she is done with friends and Bella  encounters Edward the boy in class. Edward is a special boy, he assembled the characters in the vampire. They fall in love, now Bella must face the adventure of the vampire. The plots seem to be absorbing because, she reveal each suspense and we reveal the characters on the people. My opinion this special effect is  astounding, during the movie we can see the speed vampire and their supernatural powers. Photography is really incredible because we can see every detail of the action of each scene appears in a different form like the   extreme long shot, the medium shot and  extreme close up shot.  My opinion this is acting and the performance is natural, convincing each actor to play your role well and Of the script and writing, the script is thought-provoking, compelling because we manage to want the sequel each chapter. I recommend this film to anyone who loves wich is supernatural, vampire, and romantic. The film is super well produced, it is still incredible despite the years."
  },
  {
    "rating": "5/5",
    "review": "10/10 should definitely play the other ones too"
  },
  {
    "rating": "2/5",
    "review": "ok so the plot was questionable, the characters were questionable, everything about this movie was not that great-BUT the comedy in this movie deserves a fricking 4 stars I was dying laughing at *almost* every scene in this movie-this was one of the funniest things I have seen in a while, honestly better than most try not to laughs lol-just for the record, the baseball scene is THE best scene in the entire movie"
  },
  {
    "rating": "5/5",
    "review": "I was so excited to hear this is going to become a TV series. But then I found out it will be animated now this is extremely disappointing 😞"
  },
  {
    "rating": "3.5/5",
    "review": "Out of all the movies this is the one ill mostly revisit,the characters are lacking but it has a good story and its a solid introduction to the franchise.just try to get pass the weird love story"
  },
  {
    "rating": "5/5",
    "review": "i loved the moive as a fan of the books"
  },
  {
    "rating": "3.5/5",
    "review": "Il film che ha dato vita ad una delle trasposizioni cinematografiche più iconiche degli ultimi 20 anni e probabilmente di sempre per il mondo teenager. Senza dubbio il film si pone chiaramente come alla ricerca di una vasto pubblico che si concentra soprattutto in alcune fasce, soprattutto quella dei ragazzi; fregandosene altamente della \"qualità\" per i palati più fini. Alla fine però ci sono gli elementi sufficienti a dare vita ad una imponente saga, considerando un'ottima presentazione dei personaggi a cui viene dato ampio spazio a fronte del sacrificio dei villain e di quella che sarebbe dovuta essere la grande la storyline principale del capitolo; scelta corretta. Oltre a ciò va il merito di aver trovato numerosi giovani attori diventati poi famosi non solo per questa saga ma per le loro abilità a tutto tondo."
  },
  {
    "rating": "3.5/5",
    "review": "Easily one of the most overhated movies in modern history. Some of the acting is stale and some of the dialogue is cringy, but if you can relax and let yourself enjoy it, this is an entertaining film with fun scenes and an atmosphere that plays with your imagination. The chemistry between Robert Pattinson and Kristen Stewart bounces between great and terrible in nearly every scene. Most of the rest of the cast fill their roles well, the awkward characters are meant to be awkward, and their actors succeed in the awkward factor. The lighting suffers greatly, everything has a weird blue tint that feels unnatural, even among the human characters. If you get past this, you're in for a good time with a fun movie."
  },
  {
    "rating": "2/5",
    "review": "The thoroughly questionable script, empty leading performances, and occasionally wonky camerawork and visual effects make this one YA book adaptation that is even harder and more laughable to go back to today than in 2008."
  },
  {
    "rating": "2/5",
    "review": "I'll give this franchise a shot but my expectations are low"
  },
  {
    "rating": "5/5",
    "review": "I lovveeeewweeeeeeeeeeeedddddddd this movieeeeew keep them comingggggggggggggggggggggggggggggggggggg!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "I am rewatching this movie for probably the 100th time. Their love has me drooling every time I watch this wishing I was a vampire with that one of a kind eternal love."
  },
  {
    "rating": "1.5/5",
    "review": "I don't like to say this often but this has to be one of the worst movies I have ever seen, the plot is far fetched and ultimately doesn't make sense, the acting is poor but what makes it worse is the dialogue, a disgrace to the cinematic world, I wouldn't recommend this film to my worst enemy, over 2 hours of trash, a poor plot, the only thing that redeems it is that the setting and filmography is beautiful, the rest of it is absolute garbage, very poor, do not waste your time!"
  },
  {
    "rating": "5/5",
    "review": "I love this movie, the scenery, the fashion and the actors played their characters very well."
  },
  {
    "rating": "3.5/5",
    "review": "Вообще всё по съёмке видео хорошо. Цвета картинки приятные, но есть слишком много кринжовых поворотов камеры, размытие движения плохие. Игра Бэллы придурковатая немножко, а члены семьи стереотипные слишком. Что за бред жить в стекляном доме когда ты вампир? Мда… автор намутил. Пафосные выходы из-за дыма в поле вообще не к чему. Хореография бейсбола в поле плохая. Как-то неприятно и по идиотски ведут себя вампиры, ну такие уж глупенькие кривляния. Батю Бэллы жалко, зря она ему хамила, какая-то непонятная линия сюжета, зачем это вообще надо было. Сцена где он играет на рояле вообще не реалистичная и странная, как реклама чего-то перед видео на ютубе. Костюмы у всех хорошие. Слишком много ловил кринжа в диалогах и поведении камеры. Фильм на один раз."
  },
  {
    "rating": "0.5/5",
    "review": "Bad movie. It ruined Vampires 100% it sucks so much"
  },
  {
    "rating": "2.5/5",
    "review": "it was ok, but it is more a teen romantic movie with some elements of action and horror mixed in. If you are a fan of vampires, werewolves and action, this isn't the movie for you"
  },
  {
    "rating": "4.5/5",
    "review": "All though I don't think Kristen was good in this role (I read the Twilight books), the movie does a great job with the rest of the characters. I loved the books, but the movies are great too. I don't understand the hate but meh, whatever. People don't understand that vampires and zombies etc are not real, so who gives a flying fk if they sparkle here? They. Don't. Exist. So we can write about them even flying, who cares? Just enjoy. And read the books! No one reads anymore, such a shame!"
  },
  {
    "rating": "3.5/5",
    "review": "Cinematic masterpiece. Emmett is too aggressive."
  },
  {
    "rating": "5/5",
    "review": "I love this movie. Although, there are some moments that are a bit cringy I can't help but to love this movie. I love how there was romance, passion, and a bit of action."
  },
  {
    "rating": "4.5/5",
    "review": "it made me cackle, it was hilarious. but it was cute. if you love a corny supernatural romance story with vampires and werewolves this is definitely for you! if your child is under the age of 11 they probably shouldn't watch the show, mainly because they wouldn't get the movie and they may walk up to you saying they want an \"edward\" kind of boyfriend. just joking but take me seriously, i meant what i said."
  },
  {
    "rating": "5/5",
    "review": "My girls and I love twilight! It was very nice to see it on the big screen!!"
  },
  {
    "rating": "1/5",
    "review": "Instead of crafting an engaging and enchanting adolescent vampire film, the filmmakers opted to cater to young teenage girls who find guys in their 20s with muscular abs attractive."
  },
  {
    "rating": "1.5/5",
    "review": "This movie is a bullshit, but it is great if you want to wacth something with your friends to laugh because of terms of quality. The caracther's building is awful and also te script, but how I said, it´s funny if you watch with another eyer without a critical sense :)"
  },
  {
    "rating": "1.5/5",
    "review": "Truly great special effects. The problem is (I can't use the word actress) the lead has neither beauty nor charm and certainly no acting ability that makes us totally indifferent to the character of Bella. How could they make such a blunder? It's the case of a neophyte among some truly talented performers that is a real shame."
  },
  {
    "rating": "0.5/5",
    "review": "This Movie Was Awful. The Acting Was Horendus. And The Casting Was Very Weird Because It Was Obvious The Characters Had No On Screen Chemistry. Very Hard To Watch And Most Of The Movie Is Straight Cringe."
  },
  {
    "rating": "2/5",
    "review": "Filme até tinha uma proposta interessante, porém percebe-se que é muito chato"
  },
  {
    "rating": "4/5",
    "review": "Absolute SHIT story but you can't deny the cinematography is beautiful..."
  },
  {
    "rating": "5/5",
    "review": "I'm retired now from a busy career & have plenty of time to catch up on all the movies I missed. Some say Twilight Saga is a teen girl's dream. Oh, it's much more than that. I mean, anyone who enjoys great story telling & beautiful scenery will enjoy an evening in, curled up with a snack & Twilight. I just happen to adore fairy tales. Yes, even at my age. Loved all 5 Twilight installments but my favorite was the last one. That epic battle scene with the brilliant Michael Sheen, guest vamps Rami Malek, etc was thoroughly enjoyable. Ashley Greene is a sweetheart & I always enjoy anything Billy Burke is in. The whole cast was great."
  },
  {
    "rating": "3.5/5",
    "review": "I get why, but its really funny and actually not that bad that people make it..."
  },
  {
    "rating": "5/5",
    "review": "One of my favorite movies of all time."
  },
  {
    "rating": "4.5/5",
    "review": "Truly an iconic film."
  },
  {
    "rating": "3/5",
    "review": "I THINK \"THE TWILIGHT SAGA\" ARE DECENT, MAN. THAT'S STUPID!"
  },
  {
    "rating": "0.5/5",
    "review": "to say that this movie was bad would be offensive to bad movies. To say Kristen Stewart 'acted' in this movie would be offensive to the word acting. There are moments in this movie that make me embarrassed to be a part of the the human race. Lets set the dialogue a side for a second. It is a miracle that they found two people in the world with the least chemistry to play these roles. 49% really? are you sure?"
  },
  {
    "rating": "3/5",
    "review": "Tem umas cenas legais, mas não passa disso, por que a atuação meu deus, além da protagonista ser uma chata."
  },
  {
    "rating": "4/5",
    "review": "intro 1.5/2 story 5/6 conclusion 1.5/2"
  },
  {
    "rating": "5/5",
    "review": "This movie single-handedly killed my grandma. Rip sweet Grammy Norma"
  },
  {
    "rating": "5/5",
    "review": "i don't know actually, this site is forced me to write a review on it first. as written by the owner of the site, after giving a review it will let me watch it."
  },
  {
    "rating": "3/5",
    "review": "It's a bit of a slog but its ok enough. Everything about this is just nothing special. The music is super forgettable and generic. The acting is the most unique thing about this for bettter or for worse. Everyone acts and delivers lines in a very hoaky/campy way that makes it weird but kind of not also. There is some deadpan humor in little bits that does work every now and than but for the most part there isn't much charm to speak of or humor for the most part. There is some chemistry in spurts between Bella & Edward at times but it feels muted at times because their holding back and also the hoaky acting weighs as well. I get the love is forbidden and the holding back is part of it but still. Also, the \"villians\" feel very hammed in at the last second and are super forgettable along with most of the support cast. The cinematography is super forgetful also because everything has a dull grey color tone to it. Honestly, this should've been shot in black and white and would've helped make this more moody and make things pop more because most of the settings, scenes, and camerawork is super forgettable because of how dull and grey everything is. I know thats part of the plot but you gotta make changes for a movie adaptation. The special effects match the acting at times with some hoaky wire jumping that is kind of a double edged sword. The editing remains focused on Belle 95% of the time and does tell enough of a romance and vampire tale together but very loosely. It can feel like stuff just happens to her at times but it works enough. And all this leads to a passable pacing but it can feel like a slog at times. Especially the climax which doesn't really have a lot of buildup to it and was a bit anticlimatic. Unless your nostalgic and grew up with this or are a die hard fan of Patinson or Stewart I'd say skip this. Even if your a fan of the source material I don't think there isn't anything special here."
  },
  {
    "rating": "5/5",
    "review": "Dark and mysterious, makes me feel sexually arroused seeing edward and jacob, so hot and steamy!"
  },
  {
    "rating": "3.5/5",
    "review": "Not a favorite, but I do find myself watching the series over and over, so that says something."
  },
  {
    "rating": "5/5",
    "review": "Exceptional! I can't get enough. I just finished watching it for the maybe 8th time. Tears are pouring down my face. The love Bella feels though not real radiates through her eyes like nothing I've ever seen before. Every single actor in Twilight deserves a Oscar. Best television I've seen in my 55 years of living!"
  },
  {
    "rating": "5/5",
    "review": "I love this movie so much I could watch a hundred times but you have to watch it as if it is a comic movie because it's cringe"
  },
  {
    "rating": "5/5",
    "review": "This was one of my favorite movie series. When this movie came out, I loved it so much that I had to read the book which I also loved. It so good that I read all 4 novels before each movie series was released, I just couldn't wait for the next movie. This was the first time I would read and completed a novel, and that was 4 in all."
  },
  {
    "rating": "2/5",
    "review": "This film is put in the same vein as Harry Potter. If you watched it growing up you'll forever love it. My partner loves these films but I found them (for the most part) boring and slow"
  },
  {
    "rating": "5/5",
    "review": "i love this movie so so much its so cringy but such a classic! love all of bellas outfits in this movie aswel."
  },
  {
    "rating": "5/5",
    "review": "I absolutely adore this movie and the rest of the movie in its series. The blinding green filter and pasty white foundation just really does something for me😍 The whole duration of the movie I couldn't help but giggle and bite my lip staring into Edwards fluorescent brown eyes so beautiful. Like dirty rivers. I'll let him suck my blood😘 I so related to Bella's not like other girls personality too!! I too don't fit in! This girl gets me! Thank you twilight directors for creating this timeless masterpiece."
  },
  {
    "rating": "3.5/5",
    "review": "This film is an unintentional comedy, the romance is terrible and Edward is a creep- but this movie is so bad it's good, it's hilarious! From the bad dialogue to the scene where Bella says \"You're sparkling\" and Edward replies saying \"This is the skin of a killer Bella\" it's impossible not to laugh. Show this movie and the rest of the series to teens as a PSA on bad relationships, Edward is a stalker and overall creep."
  },
  {
    "rating": "2.5/5",
    "review": "Tính cách nữ chính khiến t cảm thấy khó chịu. Cốt chuyện như nhưng cô tuổi teen mơ mộng cuộc sống quay mình có 1 chàng trai hoàn hảo nhưng t không ngờ nó lại dở tệ như v. Lời thoại của các diễn viên như đọc kịch vậy"
  },
  {
    "rating": "4.5/5",
    "review": "It is a cringy film with horrible acting: but when you have a partner who loves the franchise and wants you to watch it, you do it. Plus it helps if she acknowledges the cringe and enjoys roasting a bit with you too. It does have great scenery and an awesome soundtrack. The lore is kind of dumb but fun when your partner can explain it all. Note: The rating is a combination of both our scores."
  },
  {
    "rating": "1.5/5",
    "review": "Una película con un ritmo lentisimo, aburrida y poco interesante, perfectamente está película puede ser clasificada como un somnifero"
  },
  {
    "rating": "5/5",
    "review": "the fact that this has 49% rotten tomatoes should be a crime, I hope that the people who voted so poorley are baptised and can see things in a fresher perpespective after I force each and every one of them to rewatch every movie back to back!"
  },
  {
    "rating": "3.5/5",
    "review": "I like twilight and its a movie to watch when its raining andu just want to watch a movie"
  },
  {
    "rating": "2/5",
    "review": "Twilight's first instalment struggles to strike the right balance between teenage romance and supernatural fantasy, leading to awkward and melodramatic moments, as well as shallow characterization."
  },
  {
    "rating": "3/5",
    "review": "Giving this movie three stars is more than generous, when I first watched this movie; I believed it was praise worthy, a movie sent from the heavens. It was appealing and dreamy, it's not hard to romanticize Bella Swan and her not so average life. However as I aged and rewatched and rewatched this movie. I realized this movie is not a \"love story\" It's a horror story. Edward Cullen is a groomer and Bella just so happened to be his victim. It's a sick film disguised as a romance film. Its so much more than vampires and wolves."
  },
  {
    "rating": "3/5",
    "review": "I like the movie. Read all the books."
  },
  {
    "rating": "3.5/5",
    "review": "Forbidden love. Vampires. Werewolves. This series filled the niche of blood-thirsty audiences in the 2000s!"
  },
  {
    "rating": "0.5/5",
    "review": "The only story worse than that of this film is the book on which it is based. A truly terrible combination of inane adolescent fantasies combined with really awful writing makes for one of the most overrated films of the genre."
  },
  {
    "rating": "1/5",
    "review": "Complete rip off of Pirates of the Caribbean!"
  },
  {
    "rating": "3/5",
    "review": "It's not horrorible but it is 100% not the vampires I would like to see in movies."
  },
  {
    "rating": "1/5",
    "review": "The twilight movie has everything to be good, but they created a protagonist with a strange shyness and leaves everything she says with an uncomfortable air and her actions without emotions do not give an air of a purposeful protagonist and her reactions presented do not have a human air there's no way to have a feeling of connection in the character because she's too salty a sausage water with no personality for teenagers to think they're just like Bella that was Bella's instinct to be someone teenagers want to be like, but Bella just delivers someone without personality for the film and even having action it is not possible to mirror in Bella the character does not intend to be y/n (y/n is a pop acronym for characters that people want to be)"
  },
  {
    "rating": "2/5",
    "review": "Whoa, boy, here we go. The entire Twilight franchise. This is something I've putting for a long time as far as I'm concerned they received bad reviews mostly down to the fact that they're badly acted, poorly written, and poorly executed. Overall these films are box office successes, yeah, but I honestly haven't seen them but now that I'm on the road to do so I'm probably going to hate them more than loving them 'cause sometimes you gotta agree what others are thinking. All right, let's get on with it. Bella Swan played by Kristen Stewart, a teenage girl, moves to Forks to live with her father, she meets her friends in her new high school and sat next to Edward Cullen played by Robert Pattinson in biology class but he seems repulsed by her. After a week's absence from school, Edward returns and meets with her. Bella nearly got struck by a van in a school parking lot and Edward saves her with his hand. And the rest is Bella and Edward having conversations with lame dialogue. Yeah, I can see where this is going. But he tells her that he can't go out when it's light because it is revealed he is a vampire all along at 17 for many, many years. So, he fell in love with Bella who doesn't care. You know what? I think this is pretty s**tty the way this is written. The dialogue, the story, and characters that I can't get invested in. It's just a downright mess for me. Okay, okay, that's enough for me on this on. On to the next one."
  },
  {
    "rating": "5/5",
    "review": "bella this is a skin of a killer"
  },
  {
    "rating": "5/5",
    "review": "Really bad acting for Kristin Stewart but still love this movie and the memories of watching it with my teenage girls."
  },
  {
    "rating": "1/5",
    "review": "Really bad story and acting"
  },
  {
    "rating": "5/5",
    "review": "Best comedy movies ever. Can't stop laughing."
  },
  {
    "rating": "1/5",
    "review": "That movie was boring"
  },
  {
    "rating": "5/5",
    "review": "My mother thought true love didn't exist, but this movie showed her otherwise. It showed her that true love isn't defined by regulations and borders, it doesn't matter if the other person is a werewolf, a vampire or a simple human, the only thing that matters is ones feeling towards the other. The movie is a tale of human misery and the search for something real in a world of lies, but only those who are able to put themselves into the shoes of the characters and feel their compassion towards another are able to comprehend it's true hidden message. For anyone else it might just seem like a worse than mediocre movie, but for those who know, for those who understand the true meaning behind life and the misery that comes with it, it's not only a masterpiece but a reflection of our human nature. This movie shows us what really matters in life while not being overly intrusive. Just a great movie 10/10, would recommend to anyone."
  },
  {
    "rating": "5/5",
    "review": "The movie was so cringey, I actually died and was later revived by Harambe."
  },
  {
    "rating": "1.5/5",
    "review": "The movie would have been great if the characterization of Bella wasn't so dry. I found it hard to like her and as a leading character, she did not do a good job."
  },
  {
    "rating": "2/5",
    "review": "This is the melatonin of movies.Probably the only good character is Robbert Pattinson (Edward Cullen).I recommended it if you want to put yourself to sleep."
  },
  {
    "rating": "2.5/5",
    "review": "I went on here to say I love twlight! because I do. I love vampire tv, it is comfort food. But I couldn't bring myself to type that it's good when it is truly not hahahahahaha pitiful. laugh out loud bad but also do i want to have a twlight marathon and dream about love?? yes"
  },
  {
    "rating": "0.5/5",
    "review": "I left the movie crying... at the money I spent to see such a bad movie. I would rather have watched Bolt: The Super Dog"
  },
  {
    "rating": "4/5",
    "review": "I enjoyed it. Different spin on Vampires."
  },
  {
    "rating": "5/5",
    "review": "Cinematic masterpiece."
  },
  {
    "rating": "5/5",
    "review": "anna kenrdick kinda cute :)"
  },
  {
    "rating": "1.5/5",
    "review": "I don't know what I just watched...... Edward is creepy as hell and no girl should ever date him. Just a note to all the ladies, of a man drags you into the forest and starts confessing about how he want to suck you blood, don't date him."
  },
  {
    "rating": "1.5/5",
    "review": "Kristin Stewart is actually decent in this. The structure and screen direction is giving nobody any help here. Poor Pattinson had to stare awkwardly/hungrily maybe 12 too many times."
  },
  {
    "rating": "2/5",
    "review": "it was bad, but it was fun bad. not a big fan of the constant blue snapchat filter or the shoehorned in villain at the end, but at least it wasn't bad in an unwatchable way"
  },
  {
    "rating": "5/5",
    "review": "It's twilight, there's nothing else to say"
  },
  {
    "rating": "0.5/5",
    "review": "Its literally so bad anyone who genuinely enjoys these movies needs locking up cos you've obviously got some sort of evil virus growing inside of you slowly eating at yr brain if u think these movies are good the first time I watched it I almost cried from utter disappointment and disgust"
  },
  {
    "rating": "1/5",
    "review": "Péssimas atuações, péssimo roteiro, péssimo desenvolvimento e péssima experiência."
  },
  {
    "rating": "0.5/5",
    "review": "this movie is so soul cripplingly bad. The dialogue, the facial expressions, the camera angles -- enormously painful to watch. This movie is begging to made fun of. And be careful not to fall through all of the plot holes."
  },
  {
    "rating": "5/5",
    "review": "Live, laugh, Twilight."
  },
  {
    "rating": "5/5",
    "review": "LOVE TWILIGHT 💙💙💙💙💙💙💙"
  },
  {
    "rating": "5/5",
    "review": "EVERYTHING ABOUT THIS MOVIE IS GOLD!"
  },
  {
    "rating": "0.5/5",
    "review": "I hate this movie, to me is just a joke"
  },
  {
    "rating": "1/5",
    "review": "Twilight is a somewhat poorly made film, adapting (from what appears to be) a genuinely trite and shallow work of literature, if I should even use that word. This results in a film that is intensely dull, emotionally childish, and completely lacking in any insight, even in romantic elements. Now, I was going to give this movie a 1.5 Star rating because of how dumb and dull it is, along with how terrible Robert Pattinson is (who looks like a deformed mannequin as well), but this movie did kick off the, luckily short-lived, trend of mistaking stalking with love, as well as the acceptance (if not outright glorification) of manipulative relationships. This element makes the Twilight series genuinely kinda horrific from a moral perspective, and the fact that it's pretty much left the public consciousness (having mostly existed as a lolcow during most if its time in the limelight) is really the only good thing I can say about it."
  },
  {
    "rating": "3.5/5",
    "review": "Twilight feels less like a vampire movie and more like an MCU entry - especially the last two sequels - with how they portray the vampires to be superheroes instead of actual threats to humanity. But you can't even lie and say that this movie isn't a ton of fun, with pretty climactic action scenes and fights reminiscent of something straight out of the Avengers, and amazing chemistry between its two leads. Twilight may not be anything more than a guilty pleasure to older audiences, but there is still a ton to sink your teeth into."
  },
  {
    "rating": "5/5",
    "review": "An iconic movie that every viewer will enjoy as long as they go in with an open mind and don't take it too seriously. Definite must-see."
  },
  {
    "rating": "3/5",
    "review": "Jajajaj la primera vez que la vi me pareció basura, y eso tiene el poder de lo comercialmente adictivo y la volví a ver al igual que sus patéticas secuelas. Entretenidas y mal actuadas."
  },
  {
    "rating": "1/5",
    "review": "I read the books, and they were insufferable but not as insufferable as this movie series. Bella's is one of the most annoying movie characters, Edward looks constipated all the time and Jacob is the only kind of normal."
  },
  {
    "rating": "5/5",
    "review": "an iconic teen vampire movie."
  },
  {
    "rating": "1.5/5",
    "review": "Fact: Vampires like baseball. Laughed at this franchise from a distance when it was being released, figured I should finally bite the bullet and just watch it all in one go to understand the references, because Twilight was undeniably an influential piece of pop culture, for better or worse. Knowing how popular this was doesn't make it any easier to watch; nothing happens in this movie for so long, but then the 'romance' feels crazy rushed and insubstantial, full of weird flourishes that are supposed to be grand shows of dedication but are straight-up creepy. And that's ignoring the whole fact that the main relationship is pedophilic by definition, but it's all good because the 100-year-old man that watches you sleep looks like he's 17. It's kind of funny as comedy, though. All the silliness, the goofball dialogue, the weird half-parody high school dynamics, the junior high fantasy elements that don't include explicit sexuality or drinking because Stephanie Meyer chose adherence to strict Mormon tenets, and the fact that this film basically has no actual plot. A great ironic, so-bad-it's-good watch. Only four more of these to go. (1.5/5)"
  },
  {
    "rating": "2/5",
    "review": "Twilights terrible dialogue and cheesy acting is hard to ignore but if you manage to do it this is a movie to enjoy."
  },
  {
    "rating": "3.5/5",
    "review": "Good way to start the movie. Some parts were a little corny for me, but the history of these characters sets up an adventure."
  },
  {
    "rating": "5/5",
    "review": "Masterpiece never gets old"
  },
  {
    "rating": "1/5",
    "review": "Kristen Stewart stars as Bella in this heart-felt romance/fantasy movie; she protrayes her role as Bella quite well, but it still doesn't cover the freaking fact: This Movie Sucks. As much as I didn't go in with any expectations for this movie, it still sucked -- and hard. There is some cool fantasy moments, but it's dull out by all the romance that's going on in the movie. Bella and Edward are two unique couple -- one being a vampire and the other human. I have never read the book for it, but I heard that the Twilight books were great, so instead of reading a thick novel, why not see a 2 hour movie on it. Well, I regretted watching this movie -- not exactly at once, but near the end of the movie I saw how much this movie truly sucked. How this movie was mainly leaning on the romance side to give it \"a push.\" It suffers on the great parts in the movie -- such as the fight near the end -- because it doesn't exactly feel real. There is some bloody images I was not expecting in the movie at all. The movie is somewhat interesting, but it weaves a love story instead of making it more interesting in the \"Twilight Universe.\" The characters are alright, you can say, but in reality: I though Vampires had wings and could fly/transform into bat. These kind of vampires seem like a whole different kind of race. There really isn't any antagonist except two vampires who want Bella's blood. The theme is mainly on romance and it does not promote anything that is worthy to apply/keep track in your life. As much as some girls like this movie, I hate the freaking movie -- no matter how much CGI they put in the movie."
  },
  {
    "rating": "4/5",
    "review": "acting is horrible but robert is sexy in this"
  },
  {
    "rating": "0.5/5",
    "review": "SO CRINGE! I didn't even get pass the first couple of scenes. I then was forced to watch the whole movie and It was beyond cringe and total ick. I'll stick to the Harry Potter movies."
  },
  {
    "rating": "1/5",
    "review": "Special Effects: 0,5/Sound Effects: 0,0/Acting: 0,0/Story: 0,5"
  },
  {
    "rating": "5/5",
    "review": "It's a cult classic. If you don't like it, don't watch it- but do not hate on the saga. It's sooo 2010s to hate on it, seriously, it's a good film, the aesthetic is brilliant, the story is even better. You should be proud to call yourself a Twihard !!"
  },
  {
    "rating": "4/5",
    "review": "After all these years I finally watched the Twilight series. I previously avoided it. Maybe because vampires seem icky. I still think vampires are icky, but the depiction of the stupidity of head over heels love and all the normal feelings and bs that can go with it, slightly annoying and yet well done and sort of beautiful. Thanks. Hmmmm, I also maybe watched it because I started reading werewolf romances for the first time in my life. Who knew werewolves aren't so bad after all. My current go to for werewolf romances is Galatea. But they're not all equally good. Why werewolf romance? Real life sucks."
  },
  {
    "rating": "3/5",
    "review": "Amazing viewing experience. Good movie? Not in the slightest. Flat characters, bad acting (thank god Pattinson didnt keep acting like this) and an awful score. But goddamn is this movie funny. Not intentional in any way but if you go in with the right expextations, a fun, trahsy evening with this movie, its a blast."
  },
  {
    "rating": "1/5",
    "review": "As someone who has an up-close and personal look at toxic relationships, Edward makes my skin crawl. This should not be something for impressionable young people. Good god."
  },
  {
    "rating": "2.5/5",
    "review": "The first entry in the Twilight saga remains an uninspired, thinly written story that manages to be corny during numerous sequences. I’m not quite sure if the acting or the direction is the reason each character just feels so wooden. Oh well. At least it looks cool out in the Washington setting"
  },
  {
    "rating": "4/5",
    "review": "I- uh. What even is this. This movie is iconic and very well known and I just don't know how to feel about this. I'm in the target audience for this, but I just find it funny. It's just so random and ridiculous. The world-building is actually really good but that's based on the books. The cast on the other hand was good for its time and is honestly really good. This film has so much hate and love surrounding it that it's hard to block other people's opinions. But I will say that a lot of the hate from men, in particular, make fun of the movie because young girls like it so much which kind of rubs me the wrong way. To step away from that though this movie is so unintentionally funny. Whether you like it or not, it's still a very influential series in the early 2000s. I personally wouldn't recommend it for everyone...but still, I don't mind it. 4/5 stars"
  },
  {
    "rating": "0.5/5",
    "review": "THIS MOVIE IS A RIP OFF OF MY FAVOURITE MOVIE MORBIUS!!!!!!! IT SHOULD BE BANNED FROM BEING WATCH EVERYWHERE IT IS SO STICKY POO!!!!!!!!!!!!! MORBIUS FOREVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "1.5/5",
    "review": "\"You better hold on tight spidermonkey\" Who writes this into a script and thinks...\"Yep!\""
  },
  {
    "rating": "2/5",
    "review": "Goofy, cheesy, schmaltzy, and girly I did not enjoy this film and spent most of the time making fun of it"
  },
  {
    "rating": "0.5/5",
    "review": "I understand this film is very popular however when watching this film I can't help but notice the atrocious acting conveyed by the actors and actresses the imagery just seems to dull and if you truly want to witness an incredible vampire film may I suggest Lost Boys it stomps on this film and burys it 10 feet under"
  },
  {
    "rating": "1/5",
    "review": "no did not enjoy would not recommend :( so disappointed"
  },
  {
    "rating": "5/5",
    "review": "Ame toda la saga en mi adolescencia fue lo más. La emoción del primer amor. La primera película romantica de vampiros que recuerdo. Era todo nuevo."
  },
  {
    "rating": "2/5",
    "review": "Am I the only who thinks Edward freezes Bella's menstrual cup and gets it."
  },
  {
    "rating": "5/5",
    "review": "a historia de amor e desejo deles, os atores ate os personagens tem uma química a historia e bem construídas, bem desenvolvida e por mim sinto adolescente quando assisto como se fosse a primeira vez, acho incrível isso, acho muito bom o filme, bom pra fugir da realidade e viver no mundo de amor e fantasia onde tudo poder ser possível."
  },
  {
    "rating": "4.5/5",
    "review": "Great adaptation of the book the romance was great, and the action scenes were terrific."
  },
  {
    "rating": "5/5",
    "review": "I understand why everyone who hasn't read the books hates it so much. It appears to be a gushy romance film with werewolves and vampires. And it is! But for those of us who devoured the entire book series overnight, it was wonderful seeing it come to life in a movie. I believe Kristen Stewart accurately portrays how awkward and glassy-eyed Bella is, and knowing that Robbert Pattinson hated every moment of filming this somehow adds to the whole broody vibe Edward has going on. There are some parts of the story that are a bit ‘ehh', for example Jacob essentially falling in love with an infant while knowing that the moment she turns 18, he's gonna snatch her up. That was uncomfortable to read, and see. It would have been better if Stephanie Meyers had made Jacob clearly state that he never wanted to have any romantic relationship towards Renesme if he was going to help raise her (from birth, mind you) because that is incredibly wrong. As she matures, he will essentially be grooming her. But overall, this is my favourite book and movie series of all time. I've even re-read the books a few times because I love getting immersed in this fantastical world. I can recite the plot of every movie and I'll still watch them over and over again. As an autistic woman with ADHD, i became emotionally attached to this franchise very quickly. It's a hyperfixation and a source of comfort. I know it's very cringey but I love it so much. It's my emotional support cringe. For fans of fantasy, romance and action movies, I would recommend this, but not before reading the books. The books explain so much and show you so much more than the movies. And, as with every book to movie franchise, they changed some stuff around. I was a bit confused when I watched the movie, as to why Edward declared his love to this girl he just met and has only spoken to twice, on their first date after he just saved her from rapists; when in the books they spend a lot more time together having loads of fun and getting to know each other before he whips out the \"I feel very protective of you\" which, and let's be honest here, was a bit unexpected and a bit much. The books pace it way better, which is probably why they were such a hit. Had the movies been made first and the books written afterwards, I think the franchise popularity wouldn't be nearly as overwhelming. But overall, I adore this story. Team Edward all the way."
  },
  {
    "rating": "3/5",
    "review": "This movie got worse the second time I watched it. I feel bad for Robert Pattinson for having to be associated with this film."
  },
  {
    "rating": "5/5",
    "review": "This movie is so beautiful and a very believed love story, enjoyed every part of this movie no boring bits, All cast had the perfect rolls and they were played to perfection."
  },
  {
    "rating": "4/5",
    "review": "I loved the vibe of this movie. Sometimes especially at the beginning it was quite awkward to watch as Edward was slightly strange, but when watching it with friends this was rather funny. I like how they have already added Jacob so that the next films can also explore Bella's and Jacob's relationship more."
  },
  {
    "rating": "4.5/5",
    "review": "People hate on the movie for what? The acting is like that because the characters act like that in the book. Actually read the books before reviewing the movies tyvm."
  },
  {
    "rating": "1.5/5",
    "review": "Bad acting and terrible screenwriting. Don’t know how a second one was lite."
  },
  {
    "rating": "5/5",
    "review": "best movie of all time nothing will ever compare to this #teamedward"
  },
  {
    "rating": "1.5/5",
    "review": "Twilight is a bad movie with very bad cast. The only good thing is Robert Pattinson and everyone else is bad."
  },
  {
    "rating": "1.5/5",
    "review": "Bad acting and bad makeup with bad dialogue, but they're vampires!"
  },
  {
    "rating": "1.5/5",
    "review": "Awkward and confusing."
  },
  {
    "rating": "4.5/5",
    "review": "In my opinion, the twilight movie is one of the best movies that i've ever seen! there is so much drama and romance. I just love it!"
  },
  {
    "rating": "4.5/5",
    "review": "Perfectly captures teenage angst"
  },
  {
    "rating": "4/5",
    "review": "I think that a primary reason this movie isn't seen as at least pretty good is because of a general underappreciation for saturated colors. Making colors vibrant is a wildly underutilized cinematography decision and it makes movies like this, which may have otherwise been mediocre, stand out as among the most visually pleasing to me. It doesn't hurt that they fleshed out the cast with a bunch of attractive people, nor that I quite liked the book it was based on. I only noticed Kristen's wooden facial expressions a few times and Pattinson has the same type of absurdly perfect facial structure as Brad Pitt, where (as a boring cis white dude) I'd be happy to see him star in most of the movies I watch. The primary disappointment for me was knowing how much better Gigandet's physique had been in Never Back Down earlier in the year; he put on a seriously tremendous performance as the antagonist in that movie, far less so in this one. I'd say this edges out the rest of the series as my favorite of the lot, though there's really not a lot of difference in quality between each of them."
  },
  {
    "rating": "5/5",
    "review": "This film deserve better! My comfort movie for sure"
  },
  {
    "rating": "3/5",
    "review": "First of all, who lets their seventeen year old daughter act like that? Second, who made Edward an awkward, sickly, and disturbing character. The book to movie adaptation ignored every good part (about the book,) and took every bad part and emphasized it. Can we talk about Jacob and his wig - whoever designed the costume/ hair& makeup needs to be FIRED. Lastly, who thought that blue filters would be the best thing for the film, sad and boring! On a good note, Charlie, was the HIGHLIGHT of the movie (talk about a dilf!) And lets not forget Alice, the sweetest and most beautiful character in the movie. I will say, just like any forbidden love story, I fell for it quicker than my grandma falls on ice in the winter time. The soundtrack for the movie was AMAZING, really set the mood and whoever was in charge of that knew what they were doing. I would hide the fact that I am watching the movie, but if I was caught I would own up to it."
  },
  {
    "rating": "5/5",
    "review": "Iconic. I can see why this caused a sensation/cultural phenomenon."
  },
  {
    "rating": "0.5/5",
    "review": "just a terrible movie with some of the worst acting you will ever see"
  },
  {
    "rating": "1.5/5",
    "review": "Some of the worst acting that you could ever hope to see from all parties involved. The campiness leads to some amusement, but this is hardly deserving of a shred of respect."
  },
  {
    "rating": "2.5/5",
    "review": "I just watched it in 2021 and it turned out that this film didn't quite live up to my expectations. My expectations are too high about the vampire story in this first series. this only tells about a teenage love story with the spice of vampire life in it, not about a vampire who loves a woman. but who knows, I haven't watched the next series yet."
  },
  {
    "rating": "1.5/5",
    "review": "Emotions are so forced it looks like they need to run to the restroom ASAP. Not a good movie but the climax was surprisingly exciting."
  },
  {
    "rating": "5/5",
    "review": "The best ever made for teens"
  },
  {
    "rating": "1.5/5",
    "review": "WTF did I just watch? I guess the memes are true - this movie is indeed VERY bad!"
  },
  {
    "rating": "2/5",
    "review": "Probably one of the worst movies I have ever watched. I heard they tried super hard to keep the movies like the books. But the acting if so terrible."
  },
  {
    "rating": "5/5",
    "review": "I got distracted a bit But overall great movie Edward is a little pasty though"
  },
  {
    "rating": "0.5/5",
    "review": "That was honestly the worst movie I have EVER watched. The cinematography with the blue flim is terrible, the acting and how the lines are delivered is terrible. It is definitely one of the worst films ever made."
  },
  {
    "rating": "1.5/5",
    "review": "Was it just me or was there a lot of staring? Like A LOT of staring."
  },
  {
    "rating": "0.5/5",
    "review": "Twilight is really good movie to make fun of but really bad romance movie. It's just no."
  },
  {
    "rating": "1.5/5",
    "review": "I just wasted 2 hours of a cringe and dumb love story. This movie piss me off a lot and the characters were so cringe. OMG I wish I give this film a lower grade: Stupid 3/10"
  },
  {
    "rating": "3/5",
    "review": "I just spent all of my Monday watching all 5 of these movies and I have to say it wasn't that bad. I did only cry 3 times out of all 5 movies, which is why I rated it a 3 out of 5."
  },
  {
    "rating": "4.5/5",
    "review": "I love all of Twilight Saga movies. This is one of the books I read that I did not have to read. Twilight Saga first movie: T:Twilight is one of my favorites of the Twilight saga movies. Twilight Saga second movie: New Moon Twilight Saga third movie: Eclipse Twilight Saga fourth movie: Breaking Dawn Part I Twilight Saga fifth movie: Breaking Dawn Part II is also one of my favorites of the Twilight Saga movies; even though my middle name is Dawn. Also if you like these movies you might want to see: SnowWhite & The Huntsman movie that also filmed in between these movies with one of the actresses from theTwilight Saga movies and I believe Remember Me movie that also filmed in between these movies with one of the actors from the Twilight Saga movies. And The Fast & Furious Saga has 9 movies I have seen so far; and they are all amazing! And feature most of the original cast with some new additions but they do not replace any of the original cast ever."
  },
  {
    "rating": "2/5",
    "review": "Funny and bad acting."
  },
  {
    "rating": "1.5/5",
    "review": "O primeiro dos cinco filmes da saga é o melhor na minha opinião, pois é o que menos contém erros, mas isso não exclui o fato do filme ser péssimo, os diretores e roteiristas estragaram completamente o filme, sem contar que na reta final, o mesmo se torna muito sem sentido. Já havia assistido o filme quando era uma criança e lembro-me que tinha adorado, mas hoje ao rever percebo que não passava de uma mente iludida de uma pobre criança. O filme não é de todo ruim, mas para mim foi uma perca de tempo."
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed this movie a lot more than I thought I would. Before watching, I was under the impression that Bella is weak and the movies are dumb. Don't get me wrong, Bella is certainly not the definition of strong in this book, and she made choices I would NEVER recommend anyone make. Fortunately for her, she got lucky. When you go into this movie, don't go into it looking for logic. Don't go into it looking for the characters to make smart decisions, or expecting no cheesiness, or expecting this to make sense. Go into this movie purely for entertainment purposes and maybe you just might be able to enjoy this movie."
  },
  {
    "rating": "4/5",
    "review": "Pattinson's performance is the best of the moviw. Stewart wasn't the best choice."
  },
  {
    "rating": "4/5",
    "review": "This film is I-C-O-N-I-C. Period."
  },
  {
    "rating": "5/5",
    "review": "Team Charlie all the way"
  },
  {
    "rating": "5/5",
    "review": "Twilight is a saga of 5 films which were directed by Catherine Hardwicke, the first film was released on the 7th January 2007, the second on November 18, 2009, the third on July 7, 2010, the fourth on November 16,2011 and the fifth on November 14, 2012. The main actors are Kristen Stewart who plays the role of Bella Swan, Robert Pattinson who plays Edward Cullen and Taylor Lautner who plays the role of Jacob Black. My overall impression of this saga is who I liked, especially the story because she talks about the fantastic but she remains attached to reality through to the love that shares Bella and Edward, I also find that the last film did not a give real ending I hope there is will have a sixth. This saga tells the story of Bella Swan who is human and forms a love triangle with Edward Cullen who is a vampire and Jacob Black who is a werewolf. The actors described the key roles so as to assimilate to each actor a gift such as Edward can read minds and Jacob transform a self werewolf, Bella, she is just human at first, but at a knack for preventing others from reading her minds.Their lives have been transmitted by the does that the saga begins when the characters are adolescents, therefore in high school.The movies meet my expectations, who was who Bella would fall in love with? And also is this that she will be turned into a vampire? For me the characters were believable because I was able to immerse myself in the story completely.The roles were played so well to the point that it felt like it was a story that really happened unrolled. The films are most of the time filmed at normal angle and sometimes at tall angle, the scenes are most often shot outside which creates realism and the atmosphere is dark it creates the suspense.The breaks between scenes are relatively short, it flows at normal speed this which allows us not to be lost and not to get bored too. Actors do not really wear costumes because they are dressed because teens who go to high school are not outfits that go out either common. The messages conveyed by the saga is already a forbidden love, it is two people who love each other and everyone opposes their love at first and Bella chose love over comfortable because she chose Edward over Jacob. The second message that gets passed is anti-abortion because Bella chose to keep her child despite everything even if it must cost her her own life. I find that the messages are quite convincing because they are shown in a way that makes viewers want to take the risks like Bella for love, for example. And for the second message it is very strong so touch quite easily the viewer."
  },
  {
    "rating": "5/5",
    "review": "I give 5 starts because I loved this when I was a teenager. This film is the love story of a very socially awkward girl with another very socially awkward boy who happens to be a vampire, with beautiful shots and music. Don't forget that while watching it. Many people don't like it because they expect the female teenager protagonist to be a certain way, to be a role model, when it's actually not a necessity at all. There's nothing wrong with being quiet, awkward, not enthusiastic and gloomy. There's nothing wrong with enjoying this film just because of the short dialogues, the eye contact and the beautiful aesthetic ambience that the characters are involved in. Don't expect this film to be a romantic comedy with laughter and fun just because it's a female teenage film."
  },
  {
    "rating": "5/5",
    "review": "I´m in love with Edward, like, i can't live without him. It´s a good movie, the books are fantastic, really, i´m in love. It´s too sad, for Jacob, i think he is a good wolf, but, i know it´s too hard for him, see the girl that you love, being married with him enemy. Edward, it's really cute, when he tells Bella, that he had waited so long for her, exactly 109 years. Bella, despite being quite naive, silly and considering that she was still a \"teenager\" when she met Edward, she played the role well, risking her entire life, to save the one she loved. Following the saga of the films, Edward and Bella risk their entire family to follow their love, although it is somewhat silly to some extent, it shows that the family must always be united, like the Cullens. Edward and Bella have a totally beautiful relationship, knowing that Edward had waited for someone like that, and that Bella was his complement, and always would be."
  },
  {
    "rating": "2/5",
    "review": "It's a moody teenage love story with terrible acting, an obviously filtered camera lens, and characters I could possibly care less about, but it will satisfy the needs of its target audience."
  },
  {
    "rating": "5/5",
    "review": "Twilight is the first movie of a wonderful saga, and it is definitely a masterpiece, and I'm not just talking about the film, Stephenie Meyer in fact with her books has managed to make people dream like no one could for a long time. I don't know about you, but I literally fell in love with the characters, the history, the places described. S. Meyer, in my opinion, is a great writer, the only thing I criticize about her writing is that she uses her expression too often: \"and she rolled her eyes\". The film turned out very well, but I think the love involving Edward and Bella is more passionate than sentimental in the film. But I don't stop thinking it's one of the best movies I've ever seen."
  },
  {
    "rating": "5/5",
    "review": "Its Epic, i love it, yea.. there are some weird scenes bug good."
  },
  {
    "rating": "5/5",
    "review": "A classic vampire love story."
  },
  {
    "rating": "5/5",
    "review": "The absolute best and intense romance vampire movie out there!! I don't understand how the critics don't see that, Clearly the franchise was a huge success."
  },
  {
    "rating": "5/5",
    "review": "Absolute masterpiece that captured the whole world. And one of the biggest romances of all time & i can't believe how the critics don't see that!! Totally underrated by the critics man!"
  },
  {
    "rating": "4.5/5",
    "review": "If you want to find some great romantic vampire movie to watch, you should watch Twilight. It was directed by Katherine Hardwick, created by Mark Morgan, Greg Mouradian and Vic Godfrey and written by Melissa Rosenberg. The movie genre is romantic, fantasy, action and thriller. The running time is 120 minutes. The actors are well-chosen because the role of characters in the movie are as same as the actors. Bella Swan and Edward Cullen are the main character. The actress who played the role of Bella is Kristen Stewart. Bella is a young girl who is courageous, clever, attractive, innocent and beautiful as same as Kristen. The actor who played the role of Edward is Robert Pattinson. Edward is a handsome vampire who is so attractive, charming, mysterious, smart, strong and also handsome as same as Robert. The emotional expressions of the characters are wonderful. They did it very well. Some scenes make me come back to realize that I had the same feeling or some scenes that perfectly relay the lives of foreign high school students, making me think of my friends and my life events during that time. I love this movie so much. The plot of this movie is interesting and penetrates the teenager well. The director nails the teenager emotions and relationships. The plot shows the sweet love affair of a human and a vampire who must work hand in hand, overcome their desires and overcome obstacles, but even though the plot is a little fanciful. Some parts of movie are unintentionally funny. For example, the scene which is Edward's facial expressions at his first whiff of Bella's intoxicating scent. I do not even know why I laughed a lot at this scene. I love the relation of the Cullen family's strong bond. It has many scenes which they try to help Bella escape the pursuit of a vampire stalker. These things reflect the love and harmony of this family very well, even though they actually came from a different family. The story's setting and position of camera is so smooth. The computer graphics are perfect and it looks real. The sound effects and music are wonderful too. This movie taught me a lot. It taught me about love, relationship, friends, family etc. You will not be disappointed if you watch this movie. I highly recommend to watch it."
  },
  {
    "rating": "5/5",
    "review": "This is an underrated opinion, but I really liked the movie"
  },
  {
    "rating": "2/5",
    "review": "It was boring and honestly, Edward and Bella's chemistry sucked. It was so awkward. if you want to watch something that's better, watch vampire diaries. Edward is the Walmart version of Stefan...😬"
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved it, I'm 65 years old and not the typical must watch for me, but I've watched it over and over."
  },
  {
    "rating": "2.5/5",
    "review": "Kristen Stewart's acting is kinda weird but the movie still is pretty good"
  },
  {
    "rating": "5/5",
    "review": "This movie melted my heart and I am forever grateful for it! 10/10!!!"
  },
  {
    "rating": "1/5",
    "review": "Overacted and boring."
  },
  {
    "rating": "0.5/5",
    "review": "EH. It was decent, compared to the other films in the series. Kristen Stewart had bad acting, but Pattinson and Burke really shined for me. Not very good overall, though."
  },
  {
    "rating": "0.5/5",
    "review": "I consider it a personal failing that I saw this at all."
  },
  {
    "rating": "5/5",
    "review": "talented, brilliant, incredible, amazing, show stopping, spectacular, never the same, totally unique, completely not ever been done before"
  },
  {
    "rating": "3/5",
    "review": "The first installment kept me entertained for a majority of the movie. Turned a little slow towards the end but overall it was a quality movie. Would like to see a little More substance in the next few movies. More action, etc."
  },
  {
    "rating": "3.5/5",
    "review": "Twilight is not as bad as it looks, the characters have enough charisma for the film to take off, the performances are good and the plot lives up to the book."
  },
  {
    "rating": "5/5",
    "review": "This was a great series it really held up to my expectations of what I look for in a romantic vampire film, this series really caught my attention unlike the \"Vampire Diaries\". I really love this series I am watching it for the second time, I would really recommend this series."
  },
  {
    "rating": "0.5/5",
    "review": "absolutely unwatchable"
  },
  {
    "rating": "3/5",
    "review": "I must say that this film is iconic but also just the epidemy of toxic relationships. When i first saw the movie i loved it but as time passed i realised what a creeperd edward is and how stupid bella is. The whole movie has this weird kind off greenish filter over it. Maybe that's because it's and older film but it's weird. The special effects look very good at times and laughable at other times. The morals are highly questionable and the characters are average. Robert Patterson i think did everything he could with the character. The actress who plays bella is very emotionless and akword the entire movie but i don't know if that's her fault or just the material she had to work with. The fightscenes are very good as well as some of the comedy they sprinkle in there. The story is very bad moral wise but i get why a lot of us loved it."
  },
  {
    "rating": "3/5",
    "review": "It took me awhile but I got into this film. A good diversion from all the craziness of todays politics and a very sweet love story."
  },
  {
    "rating": "1.5/5",
    "review": "If you tune out and just see this as some fun vampire rom com, then you're good. But, if you're looking for depth, there is no deep end. Good actors, strange film, but it's a neat movie to have playing in the background."
  },
  {
    "rating": "1/5",
    "review": "Full star for the footage. That's it. Boring adaptation of a not that great book (I read it and the book is way better still). The main cast seems so boring about being there. Only I got more disgusted at the movie than Robert Pattinson about Kristen Stewart's performance. He's no better actually. They couldn't be more emotionless"
  },
  {
    "rating": "5/5",
    "review": "Would LOVE to have some of the abilities of the Vampires."
  },
  {
    "rating": "5/5",
    "review": "The movie is fantastic"
  },
  {
    "rating": "2.5/5",
    "review": "is it iconic yes yes it is is it good no no its not i grew out of it age 8"
  },
  {
    "rating": "1/5",
    "review": "Such a waste of potencial."
  },
  {
    "rating": "3.5/5",
    "review": "I recently revisited the Twilight books, so thought it was fair to revisit the films, too. Is Twilight great cinema? No. Are there some cringe-worthy awkward moments that go far beyond teenage awkwardness? Yes. Do I still kinda like it? Yeah... Perhaps purely because it takes me back to my \"Team Edward\" days, but there are some actual good moments too. Catherine Hardwicke manages to take the film further by cutting a lot of the fat of the book, although I did miss some of Bella's inner dialogue that explains her painfully awkward moments. Robert Pattinson takes on an impossible to live up ideal Edward admirably. The otherworldly beauty of the Pacific Northwest is also showcased perfectly through Elliot Davis's cinematography and I still love Carter Burwell's hauntingly lovely score, especially Bella's Lullaby."
  },
  {
    "rating": "2/5",
    "review": "Well, I loved this movie as a child but now it's like comedy movie you can enjoy it with your friends and judge the all scene"
  },
  {
    "rating": "1/5",
    "review": "As a comedy, it works. However, it is supposed to be a serious, epic love story."
  },
  {
    "rating": "0.5/5",
    "review": "I'm sorry but I absolutely hate you if you like this franchise."
  },
  {
    "rating": "4/5",
    "review": "Amazing make up and acting is very good"
  },
  {
    "rating": "3.5/5",
    "review": "Listen, I know this isn't an Oscar-worthy movie but the nostalgia hits hard with this. I've watched it 13 times (and counting!) and it always makes me feel like coming home. It's also my favorite out of all the movies. Mainly cause this one sticks rather close to the book. If you want a nice pass-time movie, this is it."
  },
  {
    "rating": "5/5",
    "review": "This movie deserves an 8 purely for the soundtrack - one of the best movie sound tracks EVER (in my opinion) and beautiful scenery and cinematography. sure, the acting isn't great, nor is the script writing, however this movie is an enjoyable watch and a romance classic"
  },
  {
    "rating": "4/5",
    "review": "Extended cut: didn't feel. Rhr"
  },
  {
    "rating": "5/5",
    "review": "I couldn't imagine taylor lautner any other character other then shark boy but i got told it was a good movie so 5 stars"
  },
  {
    "rating": "5/5",
    "review": "you guys are stupid for rating it a freaking 49, THIS IS THE BEST MOVIE SERIES EVER I AM CRYING RIGHT NOW ALSO JASPER IS SO HOT"
  },
  {
    "rating": "4/5",
    "review": "the film is quite empty with little emotion. The script is very good, but without emotional moments, the characters, there are some that are cool but others that are very annoying and annoying like Bella, besides that the actress tied very bad not fitting in the character, in short, twilight is it."
  },
  {
    "rating": "3.5/5",
    "review": "I really loved how the first one was directed. Maybe not the best vampire movie out there, however, the soundtrack is definitely on point."
  },
  {
    "rating": "5/5",
    "review": "This movie is iconic and I believe it gets more hate than it deserves, I can say with confidence that this is an amazing series for all ages and even though it can be \"cringy\" at times it is still an amazing movie for its time and it is enjoyable now. So if you want an honest review on the actual content and not what you hear on social media here it is: Twilight is a movie about a girl named Bella who falls in love with a vampire named Edward. Throughout the series they go on adventures and fight other vampires in battle. A little warning for children or parents, there is a scene where the two characters (Bella and Edward) have sex and I would highly encourage that you watch it before letting your child watch it. I didn't get to watch it until I was 13 and my mother had definitely seen it before I had. This particular scene is in Twilight: Breaking Dawn part 1 but the rest of the movies there is just kissing. As far as I know there is no actual nudity but there are adult jokes and language that may not be suitable for kids. Personally I won't let my children watch the movies until they are older but that is just my parenting style. Besides that it is a great franchise so whenever you have 10 hours of free time, now you have an activity in mind lol."
  },
  {
    "rating": "4/5",
    "review": "og sparkling vampire"
  },
  {
    "rating": "5/5",
    "review": "I'm definitely not a Twilight fan, but I liked all 5 movies. Good thing I didn't listen to critics who said that it \"will please its devoted fans, but do little for the uninitiated\"."
  },
  {
    "rating": "4.5/5",
    "review": "Normally I wouldn't use this website as a lot of people on here tend to be ...how do I put this... wrong. However my friend told me to post this on here so enjoy my ~opinion~. I think overall it is a good movie if you are specifically into that thing but if you're not then it's just quite boring as the characters are uninteresting, Bella is nice and cares about her family but that's about it Edward is just sort of intense and always being super emo about shit and all the other characters have one facial expression each throughout this movie. The start was good as I liked that one of the people in the class made an attempt to drink some compost before being told not to by the teacher that's kinda wild. But then after that when Bella is like in danger of being killed or whatever it's quite boring because I couldn't really care less if she died, although some of the scenes like when she is in the ballet place have good tension. Also the weird vampire cgi where they get flung across the room and climb up trees and stuff just looks so stupid. So yeah terrible movie but very arousing."
  },
  {
    "rating": "0.5/5",
    "review": "I hated every single minute of this. The soundtrack, weird transitions, the outfits, awful dialogue.."
  },
  {
    "rating": "5/5",
    "review": "Twilight is a great teenager movie like no other. The subtle romance and the suspenseful battle between human and vampire has great originality."
  },
  {
    "rating": "2.5/5",
    "review": "it's ok. it passes the time, but only because of how bad it is. entertaining: yes. a good film: no."
  },
  {
    "rating": "5/5",
    "review": "Okay so if you havent seen it in the theater...GOOOO!! It was so much more amazing on the big screen!"
  },
  {
    "rating": "5/5",
    "review": "This's my favourite movie. I have seen this movie at least 40 times! I think the Twilight saga is amazing! It must not be missed."
  },
  {
    "rating": "2.5/5",
    "review": "Twilight isn't a terrible movie franchise. We watch them at home once or twice a year. The more you watch them, the more obvious the subtle reasons it feels so weird become apparent. Biggest oddity: How slowly Bella speaks to Edward but how normally she speaks to everyone else Bella's dad is the best actor in the movie."
  },
  {
    "rating": "5/5",
    "review": "My favorite movies ever they're amazing"
  },
  {
    "rating": "4.5/5",
    "review": "it was a great start of a film saga and i do like how it blends in horror and romance together."
  },
  {
    "rating": "3/5",
    "review": "I remember vividly when the \"Twilight\" series seemed like the only thing anyone could talk about, whether it was from a place of love or hate. I tried to read the first book a long time ago and just couldn't get into it, so I gave up about halfway. I decided to watch these movies with an open mind and I have to say this movie does have some things I did like about it. There is plenty of awful stuff too, but I do think the movie has an exciting and enjoyable final act that saves it from being a bad movie. The central problem with the movie is that the romance is so poorly handled. The two leads have minimal chemistry and feel very emotionless at times. The dialogue also isn't the best and a lot of it either was eye-rolling or just flat out unintentionally funny. While I am aware I am not the target audience of this movie, I will admit that I enjoyed some of the more action-based elements in the movie more than I expected, and for that, I was not upset that I watched it one time."
  },
  {
    "rating": "5/5",
    "review": "This was the best one so far, good concept....good story"
  },
  {
    "rating": "1.5/5",
    "review": "I don’t know if there’s much more to say about Twilight that hasn’t already been said. It is a romance with virtually no chemistry between the two leads. I’m not sure if Kristen Stewart could properly portray romantic attraction anyways, and Taylor Lautner is somehow worse. I think Robert Pattinson is trying, but the script he is saddled with does nothing to help. There’s something gross about the whole thing if you spend any time thinking about it, considering the age difference between the characters. Also, there’s the creepy stalker aspects that play a part in their relationship, and also the horrendous example Bella is to young girls everywhere (since she lacks any value or agency in her own story.) The effects are not good, and I find the goofy jumping and speed-running of the vampires looks ridiculous. It’s almost comical how much time the characters in Twilight spend making sly references to the fact that there are vampires and werewolves in this world. In fact, no wolves show up in this movie, but they might as well have winked right at the camera when implying that some of these characters are actually wolves. In every way it feels like Stephanie Meyer, and those who adapted her book for the big screen, don’t understand how to make a good story in any genre. As a vampire movie about dangerous killers living among humans and threatening the lives of all humanity, it lacks the edge needed. We don’t even meet an actual deadly vampire until the third act, and even one of them seems to have a code of ethics that won’t allow him to just murder humans. Also, it annoys me how clueless the humans are when it comes to the fact that these creatures are living among them and a couple are murdering people indiscriminately. The film also struggles to be an authentic romance. It’s almost like the creators don’t even know how love works, because the bond between these characters feels surface level and false. They share a physical attraction, and that seems to be all. Their conversations with one another are stilted at best, and lack any emotion. I simply can’t see why Bella and Edward should ever be together, aside from the fact that he can keep her alive. In almost every way, I find Twilight to be a sub-par film that doesn’t even deserve a spot on the Hallmark Channel."
  },
  {
    "rating": "2.5/5",
    "review": "It adapts well its source material, that itself is bad to begin with. Fans of it will be delighted, but everyone else will be repulsed, with its wooden acting, silly dialogue, boring narrative, and problematic love story."
  },
  {
    "rating": "5/5",
    "review": "Twilight is a great movie which shows a true love story between a mythological being and a human"
  },
  {
    "rating": "2.5/5",
    "review": "A cool action scene towards the end and some interesting elements in the film's lore can't compensate for Kristan Stewart's stiff acting, cringeworthy dialogue, and an overly slow first hour."
  },
  {
    "rating": "1.5/5",
    "review": "There is enough material in this series for a short story. Unfortunately this is only part one and its lead has the least agency of any character in modern \"literature.\""
  },
  {
    "rating": "0.5/5",
    "review": "I despise the Twilight movies."
  },
  {
    "rating": "5/5",
    "review": "team edward for the win"
  },
  {
    "rating": "1/5",
    "review": "Somehow despite an intriguing premise this movie is a sleeper. I've seen this film twice, only rewatching it recently because I couldn't remember if I liked it and if I felt the general public's distaste of the film was warranted. Unfortunately it was incredibly bland, boring, and busted, all the b's. It was super long and the acting was pretty tragic. Which is sad because the cast has shown their skills better in other movies but I guess they've gotten better since this, so good for them. The villains aren't even slightly interesting and the whole plot feels like the writers (I guess specifically the og books author) were just going along and making shit up that just happened to be extremely boring. I wish this is was just so terrible it's good but it's really not even fun to hate watch this. My friend actually enjoyed it when we watched it which was shocking but whatever everyone has preferences. She wanted to watch the sequels but after the first two films I couldn't stand to view the remaining of the bunch. If you want outstanding book to movie adaptations stick to the Hunger Games, Harry Potter, etc. Or even the Divergent films because at least those ones aren't boring."
  },
  {
    "rating": "3/5",
    "review": "This movie is targeted to a specific audience, which is teenage girls though it may not have the best message. It tells the story of Bella who moves to a small town to live with her father and is fascinated by a boy named Edward who turns out to be a vampire. The movie shows her being infatuated with him and Edward having difficulty with suppressing his feelings towards her as he knows she will be hurt. She doesn't seem to care about this as she is put into danger constantly hanging out with Edward and his odd family. The main antagonist isn't well developed and it's like there in the movie just to give them an adversary."
  },
  {
    "rating": "1.5/5",
    "review": "This chick flick was ridiculous. Of course, teenage girls would enjoy this movie, but when I saw it years ago and I thought it was boring. Kristen Stewart, Robert Pattinson, and the rest of the cast did a decent job in this movie. The plot to the movie was alright. The only reason why this movie was successful at the box office is because many teenage girls all over the country saw it multiple times in theaters. I didn't like it but others would disagree."
  },
  {
    "rating": "2/5",
    "review": "like they say \"meh it passed the time.\""
  },
  {
    "rating": "5/5",
    "review": "Best movie ever seen"
  },
  {
    "rating": "2.5/5",
    "review": "Comfortable movie to watch"
  },
  {
    "rating": "3/5",
    "review": "So, the first entry in the divisive Twilight saga, some people absolutely adore this movie and the series in general. My honest opinion is that this film is not great, it has a lot of problems, including the acting. Kristen Stewart provides a performance which is fine, it's often bland, but at least gives a alright attempt at a high schooler who is in love. Robert Pattinson gives a pretty good performance, it's not amazing, but not bad. The characters are not incredible, in this movie, they haven't been explored fully yet. Edward, however can come off as slightly creepy, I won't go into too much detail for those who haven't seen the movie yet. So, should you watch this movie? Yes, if you like this kind of movie then you will probably love it, if not, give it a chance, you might like it. Overall, Twilight is a decent movie which starts of this franchise."
  },
  {
    "rating": "4/5",
    "review": "This is awesome part of franchise \"Twilight\" because gteat atmosphere, cool soundtrack. Of course Bella Swan is fail there"
  },
  {
    "rating": "0.5/5",
    "review": "A boring teenage vampire love story without good performances from anyone in the cast."
  },
  {
    "rating": "0.5/5",
    "review": "Recuerdo haber ido a ver la película ya que todos hablaban de ella, y fue una de las peores basuras que he visto. Luego repasando en los comentarios que me recomendaron, me di cuenta que fueron puras niñas menores. En resumen, una película visualmente barata o medio barata, con romance tonto, destrucción de mitos hacia lo ridiculo, y de las peores actuaciones de una actriz, aunque ahora ya sabemos que K Stewart siempre es así."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie The love story is incredible 😻"
  },
  {
    "rating": "1/5",
    "review": "I am definitely not in the group of people who thinks this movie was great. I thought this film came off as a crappy romantic movie with awful dialogue."
  },
  {
    "rating": "5/5",
    "review": "Twilight is one of my favorite movies and holds a special place in my heart 💓"
  },
  {
    "rating": "2/5",
    "review": "ohhhhhhh, Twilight and your toxic femininity memes. I will give one star back for the sheer camp ridiculousness of superhuman thunderstorm baseball. Like... the vampires are so American that they wait around for thunderstorms so they can just get out there and embrace America's pastime?! The ennui of the eternal must be crushing."
  },
  {
    "rating": "1/5",
    "review": "É tão ruim que fica engraçado. Claro que devemos ter em mente qual o publico que esse filme espera alcançar, e na real... não acredito que o mesmo seja tão exigente. O filme tem péssimas atuações, uma cinematografia preguiçosa, um roteiro que só de fato uma criança com fantasias \"american highschool\" aceitaria. O filme não funciona como um romance, pois ambos personagens aparentam ser mortos. Os diálogos não são nem um pouco reais e as motivações por trás do Edward são completamente injustificáveis e até incompreensíveis. Eu realmente não sei como essa franquia conseguiu ir tão longe."
  },
  {
    "rating": "0.5/5",
    "review": "Almost as good as the book. And I didn't even read the book."
  },
  {
    "rating": "4/5",
    "review": "Good Movie. I watched and it's very interesting. A vampire and a normal girl. It definitely passes time!"
  },
  {
    "rating": "3.5/5",
    "review": "These are the worst movies ever but I keep watching them. Can't help it. Sucker for a good ol totally unrealistic love story."
  },
  {
    "rating": "5/5",
    "review": "Me gusto mucho lo amor"
  },
  {
    "rating": "1/5",
    "review": "The story is just creepy. The special effects are 'special'. The acting is sub-par even with few on the cast having actual ability."
  },
  {
    "rating": "1.5/5",
    "review": "Movie made for girls."
  },
  {
    "rating": "5/5",
    "review": "This is a good movie and not bad for a novel movie"
  },
  {
    "rating": "1.5/5",
    "review": "I had to watch that because of my daughter. I´d rather gone to the dentist."
  },
  {
    "rating": "3/5",
    "review": "It's fine but it's the perfect movie to make fun of the whole time."
  },
  {
    "rating": "3.5/5",
    "review": "An important part in a longer story. You get introduced to a lot of important stuff, including the characters, which means it's a good idea to watch this, before watching the others. If you've watched this one, you'll understand the whole \"Twilight Universe\" much better."
  },
  {
    "rating": "5/5",
    "review": "This is a film about love. Love that can break all obstacles between two people even if they are not compatible with each other. The protagonists of this film are Edward and Bella. One of them was a vampire and other one was a simple human. But even with these circumstances they did not give up and continued the story of their love. \"Love knows no borders\". Producers wanted the audience to entirely understand the sense of this phrase. During the film, both Edward and Bella faced various problems but they overcame them with the help of their friends. Therefore if you like romantic films you must watch this film."
  },
  {
    "rating": "2/5",
    "review": "the dialog made me cringe it was so bad and i laughed when you find out why vampires cant go in the sun light its so stupid but I have seen worse films."
  },
  {
    "rating": "4.5/5",
    "review": "The best movie series of all time!"
  },
  {
    "rating": "0.5/5",
    "review": "The title says it all"
  },
  {
    "rating": "1/5",
    "review": "Was dragged to see this as a fresher in university, and I really wish I hadn't agreed to it, this film just verifies that the storytelling is piss poor, the acting is just awful, and the 'romance' between Bella and Edward isn't believable in the slightest, and given that the whole franchise is meant to focus around their relationship, it would have helped to have actors who can work well together, and portray love in a convincing manner. That said though, the actual manner of the relationship isn't one to which anyone should aspire, as it's just creepy and obsessive from the point of view of Edward. One to avoid for sure."
  },
  {
    "rating": "4/5",
    "review": "It's very difficult to remain objective when it comes to The Twilight Saga. From the New York Times Best Selling books, to the film series that created a pop culture phenomenon. At it's root, Twilight is a faithful adaptation of the 2005 novel by Stephenie Meyer. Under the direction of Catherine Hardwicke the film successfully expands upon the universe created by Meyer. The introduction of the main antagonists earlier in the film, along with the cinematography and score, it really helps to build the suspense. The thing that feels like it's lacking, is fails to set up the main obstacles for the rest of the series specifically the introduction of the Volturi. Although the original novel devotes an entire chapter to them, they are missing from the film. All in all, Twilight does a great job in catering to a market that the rest of the film industry seems to ignore for the most part, that being young girls."
  },
  {
    "rating": "3.5/5",
    "review": "It's not the best movie but I do t think it deserves all the hate it gets. It was still entertaining to watch, and so where the others."
  },
  {
    "rating": "5/5",
    "review": "i LOVE ADORE edward Cullen (Robert Pattinson) he is the best"
  },
  {
    "rating": "3/5",
    "review": "This is the most watchable one"
  },
  {
    "rating": "5/5",
    "review": "Without a doubt the best movie of the century"
  },
  {
    "rating": "2/5",
    "review": "Twilight is not as bad as I was expecting but that doesn't make it an inherently good movie in its own right. The side characters are more interesting than the actual protagonists, the story has a creepy edge to it (Edward acts like a stalker, as he stares at Bella when they first meet for example), the plot has idiotic moments (immortal, ageless vampires go to school for example and Bella feels insulted by Edward not saying a thing to her when in real life, people would just let it go by the time 3 days pass) and the Kristen Stewart and Robert Pattinson's performances are flat. But, it's faithful to the source material from what I heard so...that's something, right? And the movie has a more simple, lighthearted edge to it. Is Twilight a good movie? No. But is it the worst thing ever? Not quite."
  },
  {
    "rating": "5/5",
    "review": "A good romantic movie"
  },
  {
    "rating": "0.5/5",
    "review": "Twilight was a big waste of time. It was corny to begin with and made it a sob story that goes on for far too long. The actors, the director, camera work, sets, effects, they all are bad. They knew this would be a quick paycheck. Unfortunately, we have to suffer through four more. Before it laid the rails, the train had already fallen over. It's that bad, and made worse with teen audiences who flocked to the shows. Why this was popular, I have no idea. Even the audience it was intended for will look back at the cringe it endured. It's a poor quality film. It's not so bad it's good quality. It's so bad that it's treacherous."
  },
  {
    "rating": "2/5",
    "review": "A very boring movie that is just bad, not so terrible that it's \"so bad it's good\", it's just a boring movie that doesn't deserve the hate or praise it receives"
  },
  {
    "rating": "5/5",
    "review": "in 2008 i just picked this one up from looking at the cover, i never knew about the books or what this film was about, so my opinion comes from someone with a fresh mind and eyes, I saw this saga was very loved and hated after i watched this first film. The ending of the film confused me but I didnt know at the time that there was going to be more. I really think this entire saga was well done, so much to the point where I decided to buy the books, don't let the opinions of others cloud your judgement, give it a go, it may not be as baad as you think. great plot, fanatastic production and dialogue. it's really worth the watch, but obviously you have to watch all of the films."
  },
  {
    "rating": "2/5",
    "review": "Bad cgi and pessimistic performance of Kristen Stewart make the film fail."
  },
  {
    "rating": "0.5/5",
    "review": "If I could give this zero stars I would this movie is laughably bad"
  },
  {
    "rating": "5/5",
    "review": "Hi. My name is Brian Mertens. I just wanted to say this is an excellent movie series. Excellent cast, great storytelling. Probably the best movie series this side of Micheal Bay's Transformers and Teenage Mutant Ninja Turtles. I can't wait to see Robert Patterson play Batman. In my opinion he is the obvious choice"
  },
  {
    "rating": "4.5/5",
    "review": "Hi! My name is Bernard Smith, I just wanted to say I love this movie! Probably one of the best cast in the movie business! Storyline was superb! The only thing that could've made this movie a full 5 star is if it was directed by Michael Bay!"
  },
  {
    "rating": "4.5/5",
    "review": "Loved watching this"
  },
  {
    "rating": "5/5",
    "review": "Rewatching the series nearly a decade later after it came out! I have absolutely no idea why I like these movies, but it's fine honestly!"
  },
  {
    "rating": "1.5/5",
    "review": "I highly recommend the books to the movie, as the only good thing I found in these movies was the werewolves, and even those weren't in the first movie. The plot is decent enough, though somewhat unoriginal overall. Unfortunately, the movie focuses mainly on Bella, who is a disgraceful example of womankind, being insanely weak, both mentally and physically. She also seems to have a panic attack every time she is too far away from Edward, or else is simply prone to constant hair-pulling, stammering, and twitching. Undecided on whether to laugh or be disgusted. When it comes to Team Edward of Team Jacob, there's a reason to no Team Bella, as I wouldn't blame any reasonable male for being with her for 5 minutes before running for high hill."
  },
  {
    "rating": "2/5",
    "review": "As I watched this movie when I was younger it all sort of flew over my head. But watching it now I can clearly see the lack of connection between the main characters, Edward and Bella. It's such a shame too cause, who doesn't love a vampire romance. We needed more vicious and animalistic behaviour from Edward he seemed a little too pathetic to have been a vamp."
  },
  {
    "rating": "3.5/5",
    "review": "the acting was iffy but over all it served its purpose, the drama, the romance, and the thrill were all there, but the way they portrayed Bella wasnâ(TM)t my favorite."
  },
  {
    "rating": "0.5/5",
    "review": "Possibly the worst movie and franchise in history. Terrible acting from people who are great actors. Awful plot holes and consistency."
  },
  {
    "rating": "2/5",
    "review": "Too strange. This movie is overhyped."
  },
  {
    "rating": "5/5",
    "review": "Beautiful story of love and passion"
  },
  {
    "rating": "5/5",
    "review": "this was a great movie but i personly think the 1 and 2 where the best a toutal 10 out of 10 movie ive watched 3 times it is defintly a must see i defently recomend this move"
  },
  {
    "rating": "5/5",
    "review": "this will always be one of my fav movies if you dont like it you're a hater thank you next"
  },
  {
    "rating": "5/5",
    "review": "it is a good movie and I can't believe that she would do that"
  },
  {
    "rating": "2/5",
    "review": "Strange awkward bizarre."
  },
  {
    "rating": "5/5",
    "review": "Really enjoyed twilight. The first film series I was properly obsessed with. Edward, Jacob and Bella. Damn. A must watch for everyone. Bella moves to Forks and meets the mysterious Edward Cullin only to find out that he is a vampire."
  },
  {
    "rating": "4/5",
    "review": "Was pleasantly surprised with this movie. The acting and dialogue was a bit choppy sometimes, but other than that, it held my interest with its intrigue, unfolding romance, and commitment of Edward and Bella to each other."
  },
  {
    "rating": "5/5",
    "review": "the best movie evere"
  },
  {
    "rating": "5/5",
    "review": "Ich lieeeeebe twilight"
  },
  {
    "rating": "4.5/5",
    "review": "I loved the concept of twilight when I was a teenager! I am rewatching it now as I am a bit older and I still love the story. Some parts do look ridiculous, mainly because of the special effects used, but hey that's what you get when films age a bit! This film is especially for people who like romance with a bit of fantasy. I do not understand why a lot of men have a strong aversion towards it, without even have watched it. Haha!"
  },
  {
    "rating": "3/5",
    "review": "Very well written. It was smooth and emotional. The novels are bound to be far better than the films, even though I haven’t read them yet. Normally I’d read the books first, but I didn’t have the patience for this franchise!😂 I anticipate reading them once I finished the films. It had a very simplistic yet challenging plot, which is very intriguing!"
  },
  {
    "rating": "5/5",
    "review": "favorite since it came out!!! Itï¿ 1/2 1/2(TM)s a great movie and people should watch it"
  },
  {
    "rating": "1.5/5",
    "review": "Accurately represents the book. It’s just the shame the book is also terrible."
  },
  {
    "rating": "1.5/5",
    "review": "Mostly for the nostalgic value. Saw this film again 10 years after the initial release and found myself rather bored, though I cannot forget the impact it had on me when it first came out when I was eleven. Definitely a film teens did enjoy, though I think it is fairly dated now and I am unsure of its appeal to 2018 audiences and beyond."
  },
  {
    "rating": "0.5/5",
    "review": "twilight in a nutshell:girl chooses between necrophilia or bestiality."
  },
  {
    "rating": "2/5",
    "review": "Boring (sorry people who like this series. I wont judge you if you think differently of me, but I still dont think this is a great movie)."
  },
  {
    "rating": "5/5",
    "review": "Charlie AKA Bella's dad AKA Chief Swan really makes this movie great. Also, Kristen's performance as your average-joe-teen-girl is superb, and omg how did I not realize sooner that I was in lesbian with her?...anyways, if you don't like twilight, just watch it for Charlie, and all the other amazing actors that are hilarious to watch in the backgrounds. But for a diehard fan like myself, I watch it because of the pleasant indie vibes, and for the great performances done by the main cast, because let's be honest, if you have read the books, the actors nailed it."
  },
  {
    "rating": "0.5/5",
    "review": "The beginning of one of the most boring movie series ever!"
  },
  {
    "rating": "2.5/5",
    "review": "The movie it's meh. Just meh."
  },
  {
    "rating": "1.5/5",
    "review": "i dont get why everyone hypes this movie up so much. its boring as shit i have seen fucking fanfiction written by a 12 year old that is better than this"
  },
  {
    "rating": "1/5",
    "review": "Only thing fun or phenomenal about this movie is how easy and fun it is to bash it. The story sucks. The characters and acting suck. The effects suck. It really just sucks."
  },
  {
    "rating": "2/5",
    "review": "Vampires: Re-Vamped! Aha! A lot of people say these movies are bad, and they are all right! Nothing can change this opinion! Why such strong feelings you might ask? \"Hold on tight spider monkey,\" cause here are some problems I have with Twilight... 1. Why are all of their names in lower case on the promotional posters? As someone deeply invested in typography this is devastating. BIG mistake. 2.Why did Jacob cut his hair? Was it because he never got a Pantene sponsorship? Jacob, crying in the rain with ROCK HARD NIPPLES doesn't change anything. 3. Just because you can't read someones mind doesn't mean you shouldn't kill them. Like, come on Edward she's clearly interested in those rock HARD NIPPLES DAMN IT JACOB WHATS WRONG WITH YOU?"
  },
  {
    "rating": "4.5/5",
    "review": "itsss so interesting"
  },
  {
    "rating": "5/5",
    "review": "Twilight is one of my favourite movies, and I would not be living without it"
  },
  {
    "rating": "2/5",
    "review": "So to be fair I am reviewing with no knowledge of the books. Story was at times interesting but to be honest the supporting actors are the stars of this movie. I found the romance very blah and without any passion or anything leading up to it. I can see being interested in the vampires as a whole but I see nothing fascinating about Edward Cullen. I will say that I am fairly certain Jacob will be a more believable character than Edward. The antagonist of the movie were disappointing. I always find it sad when rivals are introduced and hinted at being so powerful and no scene or back story to back it up. There were moments when Bella Swan was a almost believable character. Went a little too emo and clearly she is not. To be fair I watched it several times to ensure I wasn't missing anything. Music was great over all! I will say this as support acting goes: Nikki Reed was convincing is her role as Rosalie! I was seriously impressed with her performance. The ratings would have been higher I am certain if they had taken more time to back story and true passion for the scenes! So in all I give it 2 stars and a re watch from time to time! -Jesse-"
  },
  {
    "rating": "0.5/5",
    "review": "rubbish movie terible cgi confusin and boring plotlinne would not reccamend"
  },
  {
    "rating": "5/5",
    "review": "pretty good. Not sure why this is 49%"
  },
  {
    "rating": "2/5",
    "review": "I'm not a big fan of Twilight so in my opinion it's just an ok movie. Nothing special."
  },
  {
    "rating": "5/5",
    "review": "Honestly, I watch this movie every day (no joke). Mainly for the eye candy lol."
  },
  {
    "rating": "4/5",
    "review": "Twilight - a diverting teen romance flick that has fangs, pine trees, colored contact lenses, folklore and an indie-inspired soundtrack (not to mention Carter Burwell’s fantastic score). It’s erotic, awkward and the CGI is a bit of a mess but all the better for it. In the densely covered rain clouds of Washington, lies a story that enchanted the world."
  },
  {
    "rating": "3/5",
    "review": "I will defend this movie, the soundtrack is amazing and it is visually surprising, but some of the acting it's a bit cringey."
  },
  {
    "rating": "2/5",
    "review": "2008 gave us films such as Iron Man, The Dark Knight and WALL-E. It also, unfortunately, featured Twilight. Now, as a reader of the Twiloght saga, when I heard is movie based off of the book was being produced, I was suprised. The books weren't anything to be admired, and their author is infamous for writing bad books. I have to tell you, that the film, though a slight improvement from the books, is still boring, monotone and poorly directed."
  },
  {
    "rating": "0.5/5",
    "review": "Edward cullen needs GROW some balls. HE DOESNT HAVE ANY PEWPS LOLOLOLOLO AYY LMAO. A SLOTH HAS MORE EMOTION THAN THE MAIN GIRL XD LOL"
  },
  {
    "rating": "5/5",
    "review": "Bella really seemed to hold her composure well throughout all the disaster around her."
  },
  {
    "rating": "1.5/5",
    "review": "My ego don't allow me to give this better ratings but I still think this is a modern classic. One of the best castings in the US movie history"
  },
  {
    "rating": "5/5",
    "review": "i love all the movies and hope that all that have not seen it will love it. victory is my favorite and so is alice."
  },
  {
    "rating": "5/5",
    "review": "Just watched it again. Yep. Still love it."
  },
  {
    "rating": "5/5",
    "review": "Never read the books but now I want to - love this movie!"
  },
  {
    "rating": "2.5/5",
    "review": "A weak story but sort of a guilty pleasure. I have a place in my heart for crappy movies that I love to hate to love and this is one of them."
  },
  {
    "rating": "0.5/5",
    "review": "Title: Twilight Story/Writing/Message/Plot: 1 Character/Acting: 0 Music/Sound: 2 Cinematography/Editing: 1 Age/Originality: 0 Total: 4/25"
  },
  {
    "rating": "1.5/5",
    "review": "Sometimes you have to watch movies that you are 100% sure you wont like. This is one of those times."
  },
  {
    "rating": "5/5",
    "review": "First of all, people are liars. They say they don't like it but they're all here for glittery chiseled abs. The wife and I loved it (we watch everything together). The baseball scene? Muse? Charlie is very underrated. Father of the year. Still waiting for The Host 2. Wi$h th@t utub3 $p0n-3d thi$"
  },
  {
    "rating": "5/5",
    "review": "I LOVE THIS MOVIE AND THE BOOK!!!❤❤❤"
  },
  {
    "rating": "0.5/5",
    "review": "Awful,poorly written book turned into the same kind of movie. The acting in all these movies is HORRIBLE all but Taylor. He was doing the best he could to carry this rubbish. I'm going to say, vampires do not sparkle. They can't have children as is in the final book & movies. If you have seen the X-Files & Underworld, then you will know this story is a complete ripoff of these. Werewolves vs. vampires, Underworld. Vampires in the day light & not attacking humans, X-Files. As I'm sure though as people have seen, since the final joke of a movie was released, this teenage infatuation with this junk has died out. Stephanie is not a writer at all by the way."
  },
  {
    "rating": "3.5/5",
    "review": "As a child, I doted upon this series. Although I can admit that the development to the big screen could've been better in many ways, I still come back to this franchise frequently. It never fails to bring me joy."
  },
  {
    "rating": "3.5/5",
    "review": "The first instalment of the romantic fantasy series brings together congenial moments but needs to step away from the dull performances and monotonous tone."
  },
  {
    "rating": "5/5",
    "review": "Really good movie i rate it."
  },
  {
    "rating": "5/5",
    "review": "A Forbidden Love \"... and so the lion fell in love with the lamb...\" The movie \"Twilight\" was first of all inspired by a book written by Stephenie Meyer and published on October 5, 2005. For her, it all started as a dream she had where she saw a normal young teenage girl with a handsome, unnatural teenage boy talking in the middle of the forest. She couldn't stop thinking about this strange dream of hers and started writing something about it each day, making herself more interested and devoted to it until it became her famous, well-known book, \"Twilight\". The book became so popular that not only did it sell approximately 100 million copies, but in no time it also became a best-seller. This huge success lead to a sudden interest to creating the book's movie. And later on, what started off as a dream became a reality not only for the author of the book, Stephanie Meyer, but for the movie directors Catherine Hardwicke and Chris Weitz as well, the movie was about to be released. It was first released in Los Angeles premiere in November 17, 2008 and it was not until November 21, 2008 that it released in United States movie theaters. First of all, this movie touches the topics of a teenage, forbidden love, the vampires and werewolf story, way of living and the differences between them both and problems in the society they lived in. The actor Robert Pattinson interpreting our vampire, Edward Cullen, tells us his story when he was transformed into the vampire he is and the different way the Cullen's lived, including their diets of only consuming animal blood and specific characteristics they all had differently. Bella Swan, interpreted by the famous actress Kristen Stewart, was a young teenager, pale skinned, simple girl that always seemed different from other girls and was fond of strange things. There is also Jacob Black, interpreted by the actor Taylor Lautner. He was a werewolf, part of a Quileute Native American, who constantly tried to hit on Bella. The movie makes one's heart melt. It's about a teenage girl named Bella Swan. She lived with her mother back in Arizona, since her mother had a new partner, who happened to have a job where he traveled a lot, Bella felt she was an obstacle for her mothers happiness. Renée Dwyer, her mother, abstained herself from traveling with her partner so she wouldn't leave Bella alone, but way deep inside Bella felt she was making her suffer and was attaching her mother to her. That's when she decided to move in with her father into a small, cold town called Forks. Not much before school was over she started to go to the school there in Forks, where she meets new friends. On her normal day of class, she spotted one of the famously called, the Cullen's, who caused an intriguing feeling on her. She couldn't keep her curious thoughts to herself and asked one of her new friends, Jessica Stanley, about him. Her answer was simple, he was Edward Cullen and the rest of his family members Alice, Emmet, Rosalie and Jasper Cullen never joined, mixed and merely talked to other people. As usual, that caught Bella's attention and found him even more curious, attractive and as an unusual as it seemed she felt he was trying to hide something. The first scenes of the movie gives you, as the watcher, a strong sense of comfort and immediately makes you feel welcome to the forest like and cold atmosphere it shows since the beginning of the movie. Kristen Stewart, which interprets Bella Swan one of the protagonist of the movie, makes the watcher feel each and every one of her feelings. This empathy that makes us connect with her makes us get into the whole trama of the movie since the beginning of it until it finishes and just keeps you wanting to see more of it. Edward Cullen, also hooks us to him. It's not only because of his extremely good looking features in the movie and his honey-colored, melting eyes, it's his mysterious way of looking at Swan that shows the way he desires her so much. At first he refuses the thought of accepting what he feels but then he just lost the strength to keep up with the lies he tried to tell himself, he willingly gave in to what is supposed to be impossible and forbidden, just for her. There are suspenseful, funny, unexpected and romantic scenes that get in a comfortable way down to the watcher. It's also very intriguing the way both protagonists fall in love and fight against the natural form or way of life. There is always that controversy about how vampire and human were not relatable and couldn't be together. There was the constant threats of other vampires because of Bella's blood being so desired by them all and Edward's constant fight to protect her even from himself and natural desire. The music or soundtrack chosen in this movie complements the different scenes perfectly. In some dramatic scenes they bring up suspenseful music and in the romantic ones they bring up very warming songs. For example, in one of the romantic scenes they chose a song titled Flightless Bird, American Mouth from Iron & Wine. This song has the perfect lyrics and rhythm which complemented nicely the scene and that makes you feel butterflies in your stomach just as if you were in love. At last, this movie not only shows you the different types of mythical lives some characters represent, but also how love can take out the best of us. It is a really different movie and I'm sure you will really enjoy all of its component. The great acting, the music, the editing itself and the way it easily gets you involved in it."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed a lot."
  },
  {
    "rating": "5/5",
    "review": "It's a great romance film filled with fantacy and conflicts and an interesting story line about the love between a human and a vampire. I highly recommend you to watch this saga. You will not regret it."
  },
  {
    "rating": "4.5/5",
    "review": "love it â(TM)¡â(TM)¡"
  },
  {
    "rating": "4/5",
    "review": "Really good, enjoyed it. Sorry"
  },
  {
    "rating": "1/5",
    "review": "Written by a Mormon 40 year old woman with a twisted fantasy sex life."
  },
  {
    "rating": "2.5/5",
    "review": "Cheesy, mindless entertainment if you're in the right mood."
  },
  {
    "rating": "5/5",
    "review": "I look at your movies every day and night"
  },
  {
    "rating": "2/5",
    "review": "Yes, I watched it and my sanity remained intact. It wasn't that awful. What I do come away from it with, my biggest bug, is Kristen Stewart's acting. Now I'm one of only a handful of people who HASN'T read the book so I don't know if Bella is written this way and Stewart was staying true to the source material. But Kristen's Bella was so pale and lifeless that she struck me as more the vampire-type character than Edward. It irked me... to no end... how she couldn't.... say one sentence without.... pauses. Again, I don't know if this is how Bella speaks in the book. I don't really plan to find out."
  },
  {
    "rating": "4/5",
    "review": "\"Twilight - captures the teen angst of the novel. Despite some unintentional hilarity, overall, I was engaged and enraptured by this love story. Committed performances from both Robert Pattinson and Kristen Stewart. The cinematographer of the back drops and rainy mountain tops of Washington, helps elevate the story to cool and awakening heights. The score by Carter Burwell is also fascinating."
  },
  {
    "rating": "3/5",
    "review": "OK I haven't seen twilight since it came out in theaters. That's nearly a decade. But for some reason it popped up on Netflix and I figured I'd give it another go. Honestly the premise is rather cool. I like the whole vampire scenario. It's just the acting. Kristen Stewart just wasn't ready for acting yet. Robert actually did a whole lot better in my opinion. I even liked Kristen's high school friends at the school. Great cast. The movie is definitely manageable and there are parts of it that I like. Just don't expect over-the-top amazing."
  },
  {
    "rating": "5/5",
    "review": "The twilight movies and books were amazing! Absolute perfection; but if your not into romance or vampires, it won't be for you. But if your interested in that stuff, you'll love it, just like I did."
  },
  {
    "rating": "5/5",
    "review": "TWILIGHT IS THE BEST THING EVER. YALL ARE JUST.... UGH"
  },
  {
    "rating": "5/5",
    "review": "This is the best movie ever!!! Great for teens."
  },
  {
    "rating": "2/5",
    "review": "50% staring, 20% vampires, 30% plot holes, 0% acting and 0% the Emoji Movie"
  },
  {
    "rating": "2.5/5",
    "review": "For everyone who read this book before the movie, this was a disappointing film to say the least. Edward doesn't look like the right at all. He's not handsome or strong in the film like the book portrays him, which is so sad. Somehow Stewart manages to make Bella even more mousy and whimpery than in the novel. I think this movie suffered from lack of a good script and bad acting."
  },
  {
    "rating": "1.5/5",
    "review": "This movie feels like it was written and produced by is target audience: tween- agreed girls."
  },
  {
    "rating": "0.5/5",
    "review": "There are no words to describe how awful the shit show that this movie and its successors are. I was forced to watch these movies and they're not the type of awful that you like it because it's awful or that you have to watch because it's awful. It's awful like I wish this shit never saw the light of day and the movies made me cry tears of pain knowing that anyone was crying because they felt anything other than disgust for this trash."
  },
  {
    "rating": "2.5/5",
    "review": "Me encanta el libro pero nunca me gustó esta película, el casting me parece terrible y la adaptación tampoco me agradó. No entiendo porqué decidieron utilizar un esquema cromático tan deprimente. Me alegra que no continuara la directora para las siguientes entregas."
  },
  {
    "rating": "5/5",
    "review": "it's not like others I like it"
  },
  {
    "rating": "2.5/5",
    "review": "Tasteless, cliché, sexist. A regurgitation of the same vampire theme that has been repeated for decades. I considered the books to be bland. I didn't know the movies would be so much worse."
  },
  {
    "rating": "4.5/5",
    "review": "I know alot of people really cannot stand this movie(or book!), but I have to say that I love it! The book definitely portrayed Bella as a sweet, sarcastic teenage girl. That's the one thing I wish the movie had included. She was so boring in the movie. But not enough to make me dislike it! All the characters were likable....except maybe, James! The movie took a long book and did a great job summing it up! I love Twilight...all these years later!!!!"
  },
  {
    "rating": "5/5",
    "review": "I Love it!!!!!!!!!!!!!!!! Love you Christian Stewart and Robert Pattinson!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "3.5/5",
    "review": "An odd and somewhat entertaining vampire movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Do you know twilight? Twilight is written by Stephenie Mayer, and this is the love story between a vampire and a human. When I was a high school student, I read this book written in Japanese. My school's library staff recommended it because I liked fantasy stories. Main characters are Isabella Swan, Edward Cullen, Jacob Black and Cullen's family. Cullen's members are vampires, but they don't eat humans. Isabella is a shy girl and Cullen's family is so beautiful. Jacob is the wolf man, however, this video doesn't show it. In addition, there is James in this story. He eats humans and likes fights and games. He is a dangerous person for Isabella. Isabella is Edward's favorite blood, so he is attracted to her. At first, he escapes from her because he doesn't want to eat humans. However, he can't bear escaping. During his conflict, Isabella researches about his secret and knows the truth. They fall in love and begin to dating. One day, Isabella plays baseball with Cullen's family. During the game, James party comes there, and he realized that Isabella is human. So, he chases Isabella. I think it is the main story in this movie. I have read this story in Japanese. Then, I wanted to see this story. I was very surprised to see it because this video is as expected. This movie is faithful to the original story. While I read this, I imagined beautiful view and person, and everything is attractive. For example, there are many bright green forests. Moreover, the plot is also as the book. Then some characters are not as expected. For example, Carlisle's hair and Jacob hair. I thought Carlisle Cullen has dark hair. In this movie, Carlisle has bright hair. And, in my image, Jacob hair is more shorter than movie's Jacob. However, this video acting exceeds the disagreeable part, and it is so wonderful. The acting is real, so I couldn't believe that it was acting. For example, when Edward bears Isabella's smell and blood, he seems to be really painful. Moreover, Isabella is at a loss for words and can't talk well when she is angry. The fantastic direction makes me amazed. In the scene where Edward is bright like diamonds, I couldn't imagine this scene when I read it. I was convinced of this creative direction. After watching the video, I watched another vampire video which was not the twilight series. Do you like vampire movies? Basically, I don't like vampire movies because some vampire videos are grotesque. I don't like also this video, but I like twilight because it is not grotesque, and so beautiful. Every scene and actor is beautiful and attractive, which draws me into the world of Twilight. Some characters are not as I had imagined, but the awesome casting fits each character. If you have read Twilight once, you should watch it. This movie is faithful to the books. Unlike other vampire videos, this is not grotesque, but this beautiful video sometimes makes you thrilling and attracted. You will be amazed."
  },
  {
    "rating": "4/5",
    "review": "I KNOW THAT IT'S LAME ALRIGHT BUT I'M A SUCKER FOR IT. I thought this movie was very good and fun to watch, and I also thought it had good drama."
  },
  {
    "rating": "2.5/5",
    "review": "Twilight fans will squeal with delight, but more discerning viewers will be sickened by the movie's uneven acting and corny dialogue."
  },
  {
    "rating": "5/5",
    "review": "hi put the movies free like the movies but not you Love the movies."
  },
  {
    "rating": "4.5/5",
    "review": "Watched all of them on DVD now watching on Blu Ray for a second viewing. Enjoyed the first time and enjoying even more this time in crystal clear HD. Good film. Very different :-)"
  },
  {
    "rating": "0.5/5",
    "review": "SCREW THIS HOW THE HELL IS THIS EVEN CONSIDERED HORROR THIS IS AN ABSOLUTE DISGRACE TO THE HORROR GENRE TO EVEN DESCRIBE THIS AS HORROR."
  },
  {
    "rating": "5/5",
    "review": "one of the best movies to date. great, talented acting and masterful cinematography which is far better than anything nolan, alejandro inarritu or even tarkovsky has ever achieved!"
  },
  {
    "rating": "5/5",
    "review": "Perhaps one of the greatest thought provoking films about vampires ever! This is one of the finest observations on the subject of vampire Love! This film even transcends the thoughtful barriers of Warewolves! This series sparkles, just like lovely vampires it Creates! This is also perhaps one of the greatest films to be seen by human....and \"non-human\" Eyes! Please enjoy!"
  },
  {
    "rating": "4.5/5",
    "review": "If the critics hate it I generally end of loving it! The books were a great easy read. Movies are hardly ever as good as the books, but honest effort. I cannot stand Kristen though, her acting is AWEFUL!"
  },
  {
    "rating": "0.5/5",
    "review": "If you paid money to see this you are part of the problem."
  },
  {
    "rating": "0.5/5",
    "review": "My favourite bit was when Bella (perhaps the most pathetic female character available for young girls to idolise) was thrown around in the ballet studio at the end because it made me feel better about sitting and watching her be miserably inadequate throughout the rest of the film."
  },
  {
    "rating": "5/5",
    "review": "The best Vampire Movie!!!"
  },
  {
    "rating": "0.5/5",
    "review": "VAMPIRES DON'T SPARKLE IN THE DAMNED SUNLIGHT!!!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "The love between human Bella and vampire Edward. Started off as two students who couldn't stand eachother and evolved into a vampire who looked after a human like his own family."
  },
  {
    "rating": "1.5/5",
    "review": "Poor camerawork, bad soundtrack, horrible acting. Embarrassing to the Twilight novel series."
  },
  {
    "rating": "5/5",
    "review": "Not just for teens. This touches the universal desire in all of us to love and be loved unconditionally and securely. Of course there is the fascinating storyline, action, drama and all the beautiful people, but there is so much more to love. The characters are thought provoking and layered. But be forwarded young girls, there are no Edwards in real life. Edward is a supernatural character that no mere mortal will ever live up to so hope girls don't have unrealistic expectations. I actually fell in love with the movie because it deepened my Christian walk. Reminded me in a fresh and unexpected way of my Saviors love for me; He provides, protects, lives eternally and never sleeps nor slumbers but watches over us. Like I said, touched me on a spiritual level."
  },
  {
    "rating": "3/5",
    "review": "This teen fantasy rom com is not all bad. Theres some dodgey acting from young professionals yet the style of the movie is creative and its dark tone makes it engaging for all to watch."
  },
  {
    "rating": "2.5/5",
    "review": "Hated everything about it."
  },
  {
    "rating": "5/5",
    "review": "best movie series ever!!!!"
  },
  {
    "rating": "2.5/5",
    "review": "It plays like a parody without knowing it."
  },
  {
    "rating": "0.5/5",
    "review": "CAUTION - This movie may cause the loss of brain cells"
  },
  {
    "rating": "1/5",
    "review": "Twilight fans will like this movie, whereas the casual movie-goer will dislike this movie, quite a lot."
  },
  {
    "rating": "5/5",
    "review": "LOVE THIS MOVIEð~?ð~?ð~?ð~?ð~?ð~?ð~?ð~~ ð~~ð~~ð~~ð~~ð~~ð~ð~ð~ð~ð~ð~â?¤â?¤â?¤â?¤â?¤â?¤â?¤â?¤â?¤â?¤â?¤ð(TM)ð(TM)ð(TM)ð(TM)ð(TM)ð(TM)ð(TM)â¨â¨â¨â­?â­?â­?â~â~â~â~ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'?ð'ªð'ªð'ªð'ªð'âð''ð''ð''ð''ð''ð''"
  },
  {
    "rating": "3/5",
    "review": "Sloppy teen-romance, disgrace to the horror of vampires, dumb moments, poor acting, terrible dialog, too many pauses, yaddayadda. Best film in the franchise. It's all downhill from here."
  },
  {
    "rating": "4/5",
    "review": "A little teeny but vampires and werewolves."
  },
  {
    "rating": "2.5/5",
    "review": "Twilight is not romantic, it is poorly acted, and the CGI is terrible, but I didn't hate the movie as much as I thought I would. I was entertained because of how bad the movie is and found myself laughing throughout the movie. This movie is so bad that it's good."
  },
  {
    "rating": "1/5",
    "review": "Did read the book and the acting was horrible so did not see the franchise."
  },
  {
    "rating": "3/5",
    "review": "Awesome teen- vampire romance film"
  },
  {
    "rating": "0.5/5",
    "review": "Great books but the movie was horrible, plus the actors couldn't portray the characters properly."
  },
  {
    "rating": "5/5",
    "review": "love it so much it is so great"
  },
  {
    "rating": "2/5",
    "review": "When it's supposed to be romantic, it's creepy; two hours of underplayed, unintentionally funny dialogue."
  },
  {
    "rating": "1.5/5",
    "review": "The appeal of this film was lost on me. I found it boring. The other thing I have issues with, is how relationships are portrayed. Some argue that the behavior in this film, is how abusive relationships start."
  },
  {
    "rating": "5/5",
    "review": "Sparkling aside, both me and my husband enjoy this series"
  },
  {
    "rating": "1.5/5",
    "review": "The storyline is okay. but the problem is the actor and actress are so bad in acting."
  },
  {
    "rating": "2.5/5",
    "review": "For some god-d@mn reason this one I somewhat enjoyed for how idiotic and over the top it is. However, yeah it's god-awful."
  },
  {
    "rating": "5/5",
    "review": "watch you will get addicted"
  },
  {
    "rating": "2.5/5",
    "review": "Twilight meets all requirements to be an absurd, cheesy and ridiculous film of it, but in spite of that, the film works. The plot (despite a poorly working script and a totally cheesy story) is entertaining; (strange no?) Is Twilight a bad film? I have no idea, perhaps I can say that it is \"passable\" but it is incredible as this movie despite its errors, want to know how it ends. Review en Español: Twilight cumple todos los requisitos para ser de ella una película absurda, cursi y ridícula, pero a pesar de eso, la película funciona. La trama (A pesar de un guion mal trabajado y una historia totalmente cursi) es entretenida;(¿Extraño no?) ¿Twilight es una mala película? No tengo idea, tal vez puedo decir que es \"pasable\" pero es increíble como esta película a pesar de sus errores, quieres saber como termina."
  },
  {
    "rating": "3/5",
    "review": "It is a film with smooth and very little essence of the book but despite having boring parts, ridiculous or bad, remains a passable movie, with plain language, that you will keep you entertained and maybe you do not want to see the others but if you will do want to see how this ends, the fans of the book seems a bad adaptation, a rare movie that is still well appreciated, which we fell in love KRISTEN STEWARD And Robert Pattinson."
  },
  {
    "rating": "3/5",
    "review": "Yeah it's bland and generic sometimes. It's entertaining and fun. That's good enough for me."
  },
  {
    "rating": "0.5/5",
    "review": "Easily the worst movie I've ever seen. No redeeming qualities whatsoever."
  },
  {
    "rating": "1.5/5",
    "review": "If George Lucas wrote a vampire love story..."
  },
  {
    "rating": "1/5",
    "review": "do we really have to pay money"
  },
  {
    "rating": "0.5/5",
    "review": "The worst series ever. This is the best movie of the series."
  },
  {
    "rating": "4/5",
    "review": "The acting in this movie leaves more to be desired...however I still love the story. I have read all of the books in this series so I hold a special place for the Twilight Saga in my heart. It is not your typical vampire love story and enjoy that not everything is as gory in this movie like your usual vampire movie."
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved this movie"
  },
  {
    "rating": "2.5/5",
    "review": "Not very sophisticated acting and banal storyline. I do not like it, but it's okey."
  },
  {
    "rating": "0.5/5",
    "review": "I felt awkward and uncomfortable watching it. It felt like the actors felt that way, too."
  },
  {
    "rating": "2.5/5",
    "review": "Twilight cumple todos los requisitos para ser de ella una película absurda, cursi y ridícula, pero a pesar de eso, la película funciona. La trama (A pesar de un guion mal trabajado y una historia totalmente cursi) es entretenida;(¿Extraño no?) ¿Twilight es una mala película? No tengo idea, tal vez puedo decir que es \"pasable\" pero es increíble como esta película a pesar de sus errores, quieres saber como termina."
  },
  {
    "rating": "0.5/5",
    "review": "Half a star, because the cast and the film's director are both very talented. But you'd never guess it from this movie. To quote one of my personal heroes: I hated this movie. Hated hated HATED this movie. Hated every whiny, lifeless, loveless, ridiculous, badly written moment of it. There's the main culprit as to why the \"Twilight\" saga is so universally reviled: the piss poor writing of Stephanie Meyer. Anne Rice, she's not. Hell, she's not even Laurell K. Hamilton. They wrote much better books about sexy vampires than this. And those books are for adults, not tweenagers who haven't moved to second base yet. So infantile and emptyheaded is the attitude towards relationships and being a woman that any MAN in the country would be burnt in effigy for writing something so disgustingly sexist. And yet the person behind this whole miserable franchise is a woman. Some things are best left undisturbed, I guess. I'd give this no stars were it not for the presence of some very talented performers and a director who (usually) has a good eye for what it's like to be a young person. But ultimately this whole enterprise is vile and wrong. Not because of PG-13 content, but it's attitudes and depiction of women. One of the worst films of all time."
  },
  {
    "rating": "2/5",
    "review": "A legendary movie in its own right, but for all the wrong reasons...twilight does well to offer stiff, emotionless characters and a love story that is about as engaging and passionate as, well... It isn't. It should be, but dosent come across that way, it all seems to happen too quickly for me so I don't buy it Instead of empathising and rooting for the main character, I found I was rolling my eyes at her more often than not, though to be fair that was the case when I read the book also! The action scenes are exciting enough, but the majority of the film seems so slow paced it's unbearable at times. It's frustrating because there's so much POTENTIAL here, but for me, twilight just dosent quite hit the bite-mark It's"
  },
  {
    "rating": "1.5/5",
    "review": "While it'll obviously please the fans, Twilight is a clear example of a dull and badly made attempt at a romantic thriller"
  },
  {
    "rating": "2.5/5",
    "review": "Ever since the books debuted, The twilight saga has gotten a massive amount of ridicule by anybody who isn't a teenage girl. What I find stupid though is how a lot of the Twilight haters haven't even read the books or seen the movies. I just saw this last night for curiosity and it surprisingly wasn't terrible or bad. The cinematography and direction were great and the soundtrack was well fit. But I must give criticism to Kristen Stewart and Robert Pattinson's performances as they lack a lot of chemistry for the characters, and the writing is schmaltzy and repetitive. It's average, but I will not see the rest."
  },
  {
    "rating": "0.5/5",
    "review": "a romantic horror film does that sound good to any body"
  },
  {
    "rating": "3/5",
    "review": "Problems arise when a new girl comes to town and disrupts the status quo within families of vampires and werewolves. Amazingly ordinary adaptation of the young adult novel may please the teen group with the cast good looks and charm, but otherwise it's sleepy-time in monsterland."
  },
  {
    "rating": "2.5/5",
    "review": "After reading and very much enjoying the novel I went to view this film for a second time after a several year gap between my first viewing. I liked the look of the film. It was dark in a gloomy in a romantic way and the story was also pretty good, and I also really liked the baseball scene. But my biggest problem with this movie is the atrocious acting and bland script. Both of those mixed together aren't a very good combination. All of the fun quirkiness that Bella has and the dominance and humor that Edward has is sucked out to give these characters little life and make them appealing (for the most part) to middle school girls. But the movie is just good enough to leave you hanging and wanting more and as a viewer that's all you need to watch the sequel. Not super enjoyable but if the book has already won you over then this film may satisfy you. I end my review with very very mixed feelings."
  },
  {
    "rating": "3.5/5",
    "review": "As I once read and kind of agreed, the movie itself and actors performances weren't really that bad.. if you read the book, you know it was kinda written like that, all the awkwardness somehow made the atmosphere it needed to stay true to the book."
  },
  {
    "rating": "1.5/5",
    "review": "Yeah...let's just say I'm on the target audience for this one lol. Movie was super slow and felt longer than it actually was. Baseball scene was nice though."
  },
  {
    "rating": "1.5/5",
    "review": "Aside from fangirls, Twilight probably won't win many people over: there's no chemistry between its leads, the acting is wooden at best, and the romance is tooâ?¦well, to put it frankly, stupid. There's some good camerawork, and the score is fine, but there just isn't enough there to make this film worth recommending."
  },
  {
    "rating": "5/5",
    "review": "Great start to this series!"
  },
  {
    "rating": "2/5",
    "review": "The most fun to laugh at."
  },
  {
    "rating": "1/5",
    "review": "Let's start off positive, okay? The ending was spectacular. The induced fear of the vampires, which increases and builds up as the franchise goes on, is incredible and wonder, and I love it. The showdown between Bella and James (or should I say Edward and James) is a bit corny, but there's a bit of good acting here and there. This movie is better than New Moon, but not by much, and only because Bella doesn't exempt any suicidal impulses throughout. Stephanie Meyer's books are average. But the movies are a terrible representation of the Twilight series. The characters are undeveloped and sallow. Movie Bella does not properly represent book Bella. Edward's lines, though perceived as cleverly coquettish and romantic by some, are corny and a bit creepy. The plot was dull, too. The setting is a mundane highschool, and some rainy town in Washington state. It takes places sometime within the century. The plot and characters are dull and annoying. With some occasional good scenes, Twilight was an immense disappointment. It's very overrated."
  },
  {
    "rating": "3.5/5",
    "review": "This ruined how we think of vampires. This is ruined with romance"
  },
  {
    "rating": "1/5",
    "review": "Um, I guess there's something to appeal to fans of the books here, but outside of that there's little to work with. First is the laughable ideal that one hundred year old vampires would pose as high school kids. It would be much easier and safer to pose as local 20 somethings. Teenage romance is proof that women are only looking for a mysterious stranger to define their unique place in this world. Kristen Stewart is a terrible actress but no performance shines in this bleak film. Given the rampant use of vampire powers and random killings everyone else in this town should have solved the mystery of vampire just like Bella Swan did. PTI but like I said in my 50 Shades of Grey review why give the characters ironic names? Bella (bell of the ball) and swan (what the ugly duckling becomes) showcases the metaphor of her transformation from misunderstood loner from a new town to the most polular girl in school hanging out with the mysterious popular kids. It's a fairy tale. That's what this film is, a modern fairy tale. and if you're an adult like me you'll see through this lazy attempt to corner the tween girl audience"
  },
  {
    "rating": "0.5/5",
    "review": "It was a terrible book so I could only expect a terrible movie. It was boring. It was slow. Bella was constantly licking her lips which distracted me and got gross and I got tired of everyone constantly exhaling at each other. The script is awkward and all the conversations are stilted with many awkward pauses and exhaling. If you want to feel awkward and uncomfortable and watch a bunch of people breath at each other then this is your movie."
  },
  {
    "rating": "0.5/5",
    "review": "I had to give half a star cause you're not allowed to put 0. Terrible acting, terrible story, terrible script and just terrible in general. I love a good vampire film unfortunately there's not a lot of good ones. I'd have to say though that this is one of the worst! The vampires sparkle in sunlight???"
  },
  {
    "rating": "3.5/5",
    "review": "Not thrilled with the whiny background music but accepted it as it is...a teen chick flick...and found myself (almost ashamedly) hooked!"
  },
  {
    "rating": "4.5/5",
    "review": "Twilight is about two people"
  },
  {
    "rating": "4/5",
    "review": "There's some dopiness here and there, the love story is pretty sappy, the ending stupid (even if they were setting up sequels, it needed a bigger payoff), but nevertheless, I actually really liked this. I thought they did a really great job of setting up the lead characters and their conflicted relationship. Pattison is smoking hot, so hot lol"
  },
  {
    "rating": "3/5",
    "review": "Why Edward, including every other guy in the movie, is so insanely attracted to such a boring girl as Bella Swan baffles me, but I let it go. I enjoyed the lush cinematography most in Twilight, and it is a sweet movie. Sappy at times, yes, but sweet. There. I said it."
  },
  {
    "rating": "1.5/5",
    "review": "The first 30 minutes are intruiging, but after that, it's just boring and dull. Whilst It may satisfy Twilight's most fatithful fans, Kristen Stewart's performance shows no emotion and when she tries to, she just looks in pain. The story alone is just awful."
  },
  {
    "rating": "0.5/5",
    "review": "Hideously painful to watch. Terrible story, terrible acting."
  },
  {
    "rating": "1/5",
    "review": "Completely Dull And Corny! Despite the fact that this movie had no CGI but amazing soundtrack. And Finally overall it's not as bad as i thought, Still Bad, At Least Robert patterson is in Harry Potter 4 playing the most Likeable character Cedrick Diggary! Score: 3.5/10"
  },
  {
    "rating": "2.5/5",
    "review": "I believe that the main mistake of the film is showing us a romantic story instead of a good vampire story. 5.5/10"
  },
  {
    "rating": "5/5",
    "review": "Absolutely love this movie and love the book as well."
  },
  {
    "rating": "4/5",
    "review": "Twilight is a far better movie than many may have expected. Despite its construction around the basics of romance and vampire lore, not to mention its strict adherence to a basic three-act story, it feels incredibly fresh and remains engaging from beginning to end. The film develops its characters very well, aided by a pair of above-average performances from Kristen Stewart and Robert Pattinson. Twilight also features steady direction, fascinating visuals, and a consistently fine score. It's no surprise that the film's built-in audience devoured it in droves, but Twilight is worth sinking the teeth into for those unfamiliar with the books, too. Twilight is a surprisingly effective and gripping film that offers up just the right doses of suspense, action, horror, drama, and, of course, romance, the end result a film that far surpasses expectations and might just mean the addition of four new books to the library."
  },
  {
    "rating": "1/5",
    "review": "Terrible, book based movie. Horrendous acting from pattison and stewart and very dull in terms of entertainment and plot. Kristen Stewart is continuing down the \"worst female actress\" road and she shows no passion in terms of acting, whatsoever"
  },
  {
    "rating": "1.5/5",
    "review": "Watched it to see what all the fuss was about, couldn't bear to sit through more than an hour."
  },
  {
    "rating": "3.5/5",
    "review": "I must confess I loved the books and I like this trilogy very much, especially this first movie.Vampires are very romantic characters and this is the ultimate love story."
  },
  {
    "rating": "5/5",
    "review": "Nothing is better in life than having this series with me anywhere!"
  },
  {
    "rating": "2.5/5",
    "review": "Grade: Firmly 5/10 Twilight is a fantasy romance film based on the novels of the same name and boasting vampires and love. It's safe to say this move is not the best although I will add it never completely fails and as a piece I think it can be thoroughly enjoyed, but only by some. With a cast that isn't all bad you'd expect great characters but in the end they end up pretty annoying and as if the person who first created them was not thinking straight at all. The plot is gloomy and the setting, even gloomier, but what Twilight does is draw you in, whether it's the pretty good romantic plot or the thrilling last quarter, or even if your in awe at how bad it is, I guarantee interest. It has it's plot holes that we so often see in this age of franchise movies and it's not done to the best degree either, although with very few effects I commend it for sticking itself to the ground and not giving in to too much green screen and the such. Kristen Stewart as our main gal Bella is poor here and although her chemistry is seen with our main man Robert Pattinson, she still just can't pass this off as a good performance. On Pattinson's performance well he is isn't so bad but his awkward body language and speech make for well, awkward scenes, and when he and Belle are together it can almost feel silly and not well done. The supporting cast are again drawn in to this awkward feeling and no star turns are found anywhere with rather competent actors looking dazed and confused and befuddled at what the hell is going on here. Catherina Hardwicke directs and although not destroying it, she deals a lot of the endless list of damage. She creates these scenes that are dull and almost meaningless, and although like I said you can be drawn into this film, that mainly goes down the books author Stephanie Meyer. I felt the script was poor, now I'm not sure whether that's the books talking or the screenwriters but someone has made a mistake here and made a rather cute albeit dark relationship, unbearable to listen to. It's not that this movie is hell on the screen but it's just the point that no one seems good, and overall I can't really think of much to compliment, although strangely I felt by the end it was just about an average piece of movie telling. Look Stephanie Meyer has obviously created a group of books well loved by its fans and the pressure some of those fans put on critics who dislike this movie is proof they really have fallen in love, but those who haven't read them may just feel instead of falling in love, your draining love instead. I think what would have improved this was just a little more reality and less awkwardness and angst, it could have been so much more well made but instead not only the director but the actors and writers have ruined a golden chance and made it so-so. Overall I gave it a 5/10 as I felt it is a middling film, this may battle with your thoughts for a while after and it really does make you think about liking it, and then hating it. Give it a go I urge you, you don't forget it quickly and there are thrills to be had, many will and do like this but many don't, be sure to make up your own mind before deciding and work out whether your team twilight or your out."
  },
  {
    "rating": "0.5/5",
    "review": "This film is boring, horribly acted and uninteresting. Sub par special effects are backed up with cringe-inducing dialogue. There are very few redeeming factors for this true train-wreck of a film."
  },
  {
    "rating": "1/5",
    "review": "Dumbest movie ever. Enough said."
  },
  {
    "rating": "2.5/5",
    "review": "At first I was like what is the big deal of twilight well now I know also I have read the books."
  },
  {
    "rating": "5/5",
    "review": "I want to see this movie"
  },
  {
    "rating": "5/5",
    "review": "My most favourite movie along with new moon eclipse breaking dawn part 1 & 2 of all time ð'?ð'?ð'?ð'?ð'?ð'?"
  },
  {
    "rating": "3.5/5",
    "review": "Stewart looked like she was forced to be there. Just sayin."
  },
  {
    "rating": "0.5/5",
    "review": "I read the books before they were even supposed to be a saga. LOVED the books and this movie was HORRIBLE in comparison. It actually ruined my love of the books a little. So disappointed it kills me."
  },
  {
    "rating": "5/5",
    "review": "TEAM EDWARDð'ð'ð'ð'ð'ð'ð'ð'"
  },
  {
    "rating": "5/5",
    "review": "I really love this movie.its a movie about a girl who moves with her dad and discovers she goes to the same high school as a vampire that really likes her but tries not to loose control"
  },
  {
    "rating": "3.5/5",
    "review": "Like the storyline but terrible acting by many."
  },
  {
    "rating": "3.5/5",
    "review": "Even though there were a couple of differences between the book and movie Twilight, it was still a good adaptation. One of the big parts in Twilight is when Bella gets stalked by four men in Port Angeles. In the story, Bella thinks \"But they were both staring at me.\" This part was also included in the movie. The whole saga is based upon Bella and Edward's relationship. After Bella is herded by four men, Edward comes to rescue her, and she starts to realize how much Edward cares for her. This scene was, thankfully, was included in the movie, and was portrayed the same way I imagined it, making it a good adaptation. In the movie adaptation of Twilight, Edward stops Tyler's car from hitting Bella. The same thing happened in the book. An excerpt from the book reads \"Two long, white hands shot out protectively in front of me, and the van shuttered to a stop a foot from my face, the large hands fitting providently into a deep dent in the side of the van's body.\" One thing that makes a good movie vs book adaptation is the story sticking very close to the plot line. The part of the story mentioned above where Tyler almost crushes Bella with his car is crucial to the story. The scene from the movie matched the excerpt perfectly, making this a good adaptation. Edward is very well known for being a vampire. His whole family is hunted by \"the others\" while playing a baseball game with Bella in both the movie and book. In Twilight the book, it says \"they emerged one by one from the forest, ranging a dozen meters apart.\" As I was reading Twilight, I imagined the scene just like they portrayed it in the movie: Three people emerging from this dark and eerie forest that were on a mission to kill. Another thing that makes a good adaptation is if the movie scene looked just like what you pictured it to be in your head while reading the book. This happened for me, and that's a sign of a good adaptation. All in all, the book Twilight was adapted well into a movie."
  }
]