[
  {
    "rating": "3.5/5",
    "review": "A humorous action comedy. Ke is delightful as always in my opinion. But a few of the supporting actors didn't really hold up. Some of the roles felt wooden and some of the movie felt predictable. Nothing game changing, but there was still a good amount of entertainment to keep me watching."
  },
  {
    "rating": "3.5/5",
    "review": "I thought it was fun! It had some moments for sure that didn’t work. Try to watch it without expectations for it to be good or bad and just enjoy it for what it is."
  },
  {
    "rating": "3.5/5",
    "review": "7.3/10—fun movie. I’ll watch anything with Ke Huy Quan at this point. Shout out to Marshawn Lynch as well."
  },
  {
    "rating": "4/5",
    "review": "Hilarious good film. A quick 85 minutes that moves at a good pace. It's a nice afternoon film to watch that is entertaining with good action and comedy. Highly recommended."
  },
  {
    "rating": "2/5",
    "review": "What could have been a fun movie is one that doesn't catch on at all for me. It is bad but not bad enough to be good"
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved seeing Ke Huy Quan and Sean Austin in a movie together. I found it entertaining and even though the plot wasn't the best. I wondered what two Oscar winners were doing in this kind fare...but fun fare, nonetheless."
  },
  {
    "rating": "3/5",
    "review": "I think it's a movie worth watching on an evening when you just want something lighthearted and not challenging. I enjoyed it. It made me laugh on several occasions and kept me engaged. It is much better than the 19% aggregate critics rating. The 61% from the audience reviews is a more accurate representation."
  },
  {
    "rating": "2/5",
    "review": "I love Ke Huy Quan and will watch ANYTHING he is in… but aside from my love for this actor, the film just wasn’t good - at all. Nothing kept me engaged beyond the initial fight sequences or the opening of the film that came with copious amounts of that Ke charm. Then the film just dragged on… I daydreamed a lot through it. Really love Ke; don’t love this movie. I don’t even like it, even as good as it was to see him in a starring role, I wish it were in a different movie."
  },
  {
    "rating": "1/5",
    "review": "Stupid story and Ke Huy Quan's Donald Duck voice didn't help."
  },
  {
    "rating": "5/5",
    "review": "For not the first time, I see my taste is way different than the critics. We loved this movie! If you like kung fu action, if you like action/comedy movies like Mr. and Mrs. Smith and True Lies, this is a good one for you. Start to finish, lots of great fight scenes and romantic plot elements. And, yes, that is HGTV's Drew Scott for no reason but killing it."
  },
  {
    "rating": "3/5",
    "review": "The movie’s plot is carried by all its side plots. The main actors have no chemistry with each other at all. While the action scenes are entertaining and well coordinated, that is overshadowed by the fact that the two leads have no spark, and that no real connection is made with audience when it comes to their “love” story. What should have been a great film is maimed by a limp main plot and terrible lead casting. Disappointing, truly."
  },
  {
    "rating": "5/5",
    "review": "This was fun to watch! I love Ke Huy Quan!"
  },
  {
    "rating": "1/5",
    "review": "This movie is one of MANY that has me very thankful for the FAST FORWARD button! After watching the trailer, I was really looking forward to seeing the movie... but was I EVER disappointed! There wasn't any story to speak of - just a great deal of Kung Fu fighting, LOTS of BLOOD and unnecessary violence wrapped around some kind of plot that's been done over and over to death. How many times did he have to say \"I just want a normal life\"? Very lazy writing - in a script that could have been 3 pages long, with a LOT of \"copy, paste\". Thank you FAST FORWARD!!"
  },
  {
    "rating": "2/5",
    "review": "I wanted to like it more but this movie took itself more seriously at times than it should have."
  },
  {
    "rating": "4.5/5",
    "review": "This was a fun and funny romp, packed with action. We really enjoyed it! And it was the perfect Valentine's date night movie that entertained and blended both of our more feminine and masculine film interests. It was also nostalgic for this Gen-Xer to see Ke Huy Quan back in the spotlight. Worth a watch!"
  },
  {
    "rating": "1.5/5",
    "review": "Only occasionally funny with some of the worst writing and acting I've ever seen. 10 minutes after the movie started, I knew I'd made a bad choice."
  },
  {
    "rating": "3.5/5",
    "review": "Acting from Ke Huy Quan with some great and entertaining fight choreography make up for the lack of storyline. A fun watch."
  },
  {
    "rating": "5/5",
    "review": "The movie was a less violent John Wick. There was a lot of action and not overcomplicated storyline. It was violent at times, but nothing too crazy. I would definitely run out and watch the sequel if it was made. It was an action movie made for the family and valentine's day."
  },
  {
    "rating": "0.5/5",
    "review": "This was so bad I could not watch the whole movie."
  },
  {
    "rating": "3.5/5",
    "review": "It was good. Marshawn was my fav in this lol"
  },
  {
    "rating": "3.5/5",
    "review": "I thought this movie was very funny and entertaining, was a good laugh."
  },
  {
    "rating": "1/5",
    "review": "Bad acting. Bad writing. Cringe story. Waste of time and mental capacity."
  },
  {
    "rating": "4/5",
    "review": "A very funny movie with great fight scenes. Tim Treakle"
  },
  {
    "rating": "5/5",
    "review": "This was a great action-packed, fast-paced movie with great acting and fun plot. Don’t listen to the pro-critics, it’s definitely worth a watch!"
  },
  {
    "rating": "3.5/5",
    "review": "As a valentines release, it was enough. It wasn’t too long so you could do the dinner and a movie, still be home by 7. Action was spot on for the husband and funny enough for me. The previews told you exactly what it was and expectation's were met."
  },
  {
    "rating": "3.5/5",
    "review": "Great ction. Cute story."
  },
  {
    "rating": "5/5",
    "review": "It was very entertaining and I loved everything about it"
  },
  {
    "rating": "4/5",
    "review": "Heart warming. Laughed out loud more than once."
  },
  {
    "rating": "3/5",
    "review": "It was worth a watch to see all of the wild fight scenes and ridiculous characters. As far as calling this a quality film, I cannot do that. As a lover of action and comedy combined, I enjoyed it enough."
  },
  {
    "rating": "4/5",
    "review": "As a contemporary action comedy, I think Ke Huy Quan put 120% effort into incorporating Hong Kong action nostalgia into the \"Asian action\" movie scene..."
  },
  {
    "rating": "1.5/5",
    "review": "The pain-free and nearly lethal physical violence of the movie is a comment on the pain of love--Love Hurts."
  },
  {
    "rating": "5/5",
    "review": "it was a great movie"
  },
  {
    "rating": "2.5/5",
    "review": "This movie is very average. It's just entertaining enough, mostly because of the really good fight scenes, to watch the entire movie."
  },
  {
    "rating": "5/5",
    "review": "It’s a fun movie. Action packed, cool fight scenes. A bit predictable but fun to watch nonetheless."
  },
  {
    "rating": "3/5",
    "review": "It's a good action flick, but the trailers gave us the entire story. I'm not sure that the love story really worked for me, but again, it was spoiled. I wanted to be more impressed, but I'll definitely be revisiting this for the action. It was a solid action movie."
  },
  {
    "rating": "2.5/5",
    "review": "Great comedy and I reckon the action was great. The rest of the movie meh."
  },
  {
    "rating": "3/5",
    "review": "Predictable, yet entertaining"
  },
  {
    "rating": "1.5/5",
    "review": "It’s underwhelming unfortunately"
  },
  {
    "rating": "0.5/5",
    "review": "How did this movie ever get greenlit???"
  },
  {
    "rating": "2.5/5",
    "review": "It is not the worst but not a great movie in my opinion"
  },
  {
    "rating": "1.5/5",
    "review": "A completely mundane and fake feeling movie. The script has nothing going for it. Poor Ariana Debose is given maybe the worst lines in recent memory and really struggles to get through it."
  },
  {
    "rating": "2/5",
    "review": "If you're looking for thrills and fun this is a movie you want to see, but that's all you'll get. 'LOVE HURTS' is a sorry excuse for 'action meets romance', it's nothing but a content filled with good stunts but very very very bad storyline, as a matter of fact there is no story here. Apart from it's poor casting, 'LOVE HURTS' might be what I'll call Ke Huy Quan's and Ariana DeBOSE's worst performance ever as they failed to deliver good character chemistry and just left me wondering how gullible they think I am. 'LOVE HURTS' is just another movie that keeps us wondering if there are still real stories out there. It has good stunts and a satisfying cinematography but that's just it!"
  },
  {
    "rating": "2.5/5",
    "review": "While it's great to see Ke Huy Quan taking on roles that suit him, Love Hurts falls short in every aspect except for its action sequences, making it hardly the right choice."
  },
  {
    "rating": "3.5/5",
    "review": "Fun and action packed quirky romcon. A film i could watch every year on Valentines Day."
  },
  {
    "rating": "5/5",
    "review": "I would watch Daniel Wu and Ke Huy Quan sitting chairs and stare at each other for an hour, and still be thrilled… They’re both amazing actors."
  },
  {
    "rating": "2/5",
    "review": "I had hope that Love Hurts would be a good movie, but it is a terrible movie. Some small action scenes are brilliant, others are horrible."
  },
  {
    "rating": "2/5",
    "review": "**Review of *Love Hurts* – ★★☆☆☆** *Love Hurts* is exactly what you'd expect from a 90-minute action comedy — fast-paced, predictable, and a little messy. Ke Huy Quan is always a joy to watch, and Sean Astin’s cameo is a fun meta wink for us *Goonies* fans. The plot is thin and generic, but that’s not the real issue — it’s more about how the movie just doesn’t click. It’s got all the right pieces, like an old-school Jackie Chan flick, but it’s missing the glue to hold it together. The dialogue? Yikes. Cringe city. Ariana DeBose’s performance didn’t help either — this is becoming a pattern with her recent work. That said, the romantic subplot between Ashley and Roger was surprisingly charming — honestly, I cared more about that than any of the action. It’s not a total disaster, but it’s the kind of movie you watch once and forget about the next day."
  },
  {
    "rating": "0.5/5",
    "review": "A movie that just kept you waiting to make sense. This movie had no clear storyline, and it seems they tried to cover it up with more and more meaningless action scenes."
  },
  {
    "rating": "2.5/5",
    "review": "The action and humor were solid... the story and premise were not."
  },
  {
    "rating": "3/5",
    "review": "Wasn't terrible, action scenes were good. Well shot. Not much of a story."
  },
  {
    "rating": "2/5",
    "review": "Love Hurts - 4/10. This hurts to say, but Love Hurts is a bland and mediocre rehash of way superior films. Its great to see Ke Huy Quan as a leading action hero, but for this to be his first live action role since EEAAO, this is devastating. In fact, to see both Quan and Ariana De Bose in a film like this is sad. Both won Academy Awards, so to see them in a production like this is sad because they’ve proven their mettle as performers, yet, are given really nothing to work with here. The action scenes are decent, but just feel like they’ve been ripped from other better movies. The story of a “hidden violent past person trying to move on with life” individual is getting tiresome now and severely redundant. There’s no chemistry between Quan and Bose sadly too, and I can’t blame them for that at all. The direction is kinda just pedestrian, and you can’t help but think that maybe there was a good product here, but its not executed to the manner that it should be. Hopefully Quan and Bose get better material in the future. Funny “Beast Mode” sequence here (the casual NFL fan in me laughed at that moment). Other than some okay fight scenes, there’s nothing really here!"
  },
  {
    "rating": "3/5",
    "review": "Ke Huy Quan continues to reinvent himself at the later stage of his career with now becoming a legitimate action star. A fun and entertaining movie."
  },
  {
    "rating": "4.5/5",
    "review": "Stellar movement and entirely novel unfolding fights. While the story pines for depth, the entertainment is sufficient."
  },
  {
    "rating": "1/5",
    "review": "Exaggerated, goofy action scenes and dialogue contrasted poorly with the bloodshed and adult themes."
  },
  {
    "rating": "5/5",
    "review": "Hilarious and action packed me and my husband loved it!!"
  },
  {
    "rating": "4/5",
    "review": "This might not be the best movie ever made, but I really enjoyed watching it. Love Hurts has a solid story line and plenty of action scenes. I have no clue why this was rated so poorly. Ke Huy Quan does his own stunts and I personally find him very funny and entertaining. The chemistry between himself and Ariana DeBose surprisingly works very well."
  },
  {
    "rating": "2.5/5",
    "review": "Generic action flick with two Oscar winners actors, that’s it that’s the film, no more."
  },
  {
    "rating": "4/5",
    "review": "Definitely a simple film. Very fun. The action scenes are the main attraction. The acting is on point for a streaming service direct film. Nothing hateable, just a chill out, laugh and watch. Would I watch it again, yeah definitely."
  },
  {
    "rating": "4/5",
    "review": "Ok, it's not oscar material but it was a lot of fun, it kept moving and had lots of action with humor laced in. I enjoyed it and was never bored. It was pretty funny that they stuck Drew Scott in as a realtor."
  },
  {
    "rating": "3/5",
    "review": "Good story, kept you watching, nice action."
  },
  {
    "rating": "4/5",
    "review": "We really enjoyed it!"
  },
  {
    "rating": "2/5",
    "review": "Pretty good fighting scenes, but it's really not believable. Yes I know it's a movie, but I've seen better fight scenes, and way better acting. Kinda stupid if you ask me."
  },
  {
    "rating": "5/5",
    "review": "Wow just wow a must see for shore I just love kick ass movies where the main character kicks ass all though the movie the story line is a great one and the kick ass seens are so spot on I do love how this man got back into movies I have missed him and to come back in such an amazing lead roll I'm so proud of him.. I can't remember his name but I know him as data from the goonies he still and amazing actor"
  },
  {
    "rating": "1/5",
    "review": "You can't break up with your past. Love Hurts is a 2025 American action comedy film directed by Jonathan Eusebio, in his directorial debut ❤️ Terrible acting matched with a terrible screenplay equals… Oof, this is rotten 🙁 Don’t bother seeing it 👎🏼👎🏼 A realtor is pulled back into the life he left behind after his former partner-in-crime resurfaces with an ominous message. With his crime-lord brother also on his trail, he must confront his past and the history he never fully buried."
  },
  {
    "rating": "4/5",
    "review": "Quirky and funny. Action packed and visually pleasing. I liked it!!"
  },
  {
    "rating": "2/5",
    "review": "I was really excited to see this one, but it ended up being really disappointing. The story is really bland and generic just with a valentine skin over it. The writing isn’t great and the comedy is hit or miss. Some of the cast also just feels like they’re not trying. However, Ke Huy Quan does carry the movie along with some creative and stylized action and choreography. Marshawn Lynch also makes a fun supporting character. Sadly, that’s about all the positives I can give. Not the train wreck people are calling it, but definitely not great."
  },
  {
    "rating": "4/5",
    "review": "My boyfriend and I watched this movie and Heart Eyes opening weekend. We felt this movie was far more entertaining and interesting than Heart Eyes! The story line, acting, and action scenes were really good! We really likes the fighting scenes and the humor. Even the little dose of romance was better in this film then Heart Eyes. Definitely recommend. Don't listen to the movie critics!"
  },
  {
    "rating": "3/5",
    "review": "I felt this film was ok /semi good . the action was good but the story itself was just ok . Ke Huy Quan was good but not as good as his performance in Everything Everywhere All at Once."
  },
  {
    "rating": "3.5/5",
    "review": "The movie does meet the criteria of an action comedy with the message of the title Love Hurts represented, but very mildly. Ke Huy Quan and Ariana Debose, an unexpected duo that has good chemistry who gave everything they got for this story. However, the story itself is bit flawed with a waste of the actors' talent. Ke Huy Quan showed Jackie Chan style vibes with the fight scenes, where it isn't terrible but not unique. As for funny parts, there were cheesy fight scenes that nevertheless made me not serious for a moment as I was watching the film. Debose is new actress, but will continue to see movies she did before this to compare the styles she entailed in other genres."
  },
  {
    "rating": "4.5/5",
    "review": "good movie with non-stop action 👍"
  },
  {
    "rating": "2.5/5",
    "review": "This is a very average movie. The story line is pretty basic and could be summed up in a half hour. The rest is filler fight scenes to pad the screen time. Some of the action shots were good, but nothing great. Seems like a throw away, perfectly okay movie to throw on a streaming platform which I am sure it will be on soon, but ultimately not worth a trip to the theaters."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie, action packed, loved the 70s action movie vibe."
  },
  {
    "rating": "2/5",
    "review": "A fulfilling film that knows how to get ahead thanks to a talented cast and certain decisions in its direction that make it fun and enjoyable to watch. It is not something that we will remember in 2025 when we are in December, but it is a film for the beginning of the year and with that it fulfills what it has to deliver without any major complexes."
  },
  {
    "rating": "2/5",
    "review": "It’s a straight-up bad movie lol, and anyone who says otherwise is plain wrong. The characters suck, the storyline sucks, the dialogue sucks, the acting sucks, the score sucks, i mean, almost everything about it just sucks haha! Why did i give it 2 stars though? Well, the action is fun & ke huy quan plays the main lead. 1 star each for both of those things. Ke huy quan is fantastic and doesn’t deserve to star in mindless trash like this #KeHuyQuanInnocent #WeLoveKeHuyQuan ✊🤝"
  },
  {
    "rating": "5/5",
    "review": "It was super funny. Very entertaining. Some action, and crazy fight scenes - but funny."
  },
  {
    "rating": "0.5/5",
    "review": "Don't waste your time with this movie."
  },
  {
    "rating": "3.5/5",
    "review": "It was alright, the action sequences were all i stayed for though. Action was pretty well done."
  },
  {
    "rating": "5/5",
    "review": "Enjoyed the story line and the acting"
  },
  {
    "rating": "3.5/5",
    "review": "This is a nice action/ comedy it has a pretty good balance I didn't think the story would that good I was surprised & it was a welcome one it kinda had a bit of wick in it & they shot up a house he was selling it was insane!"
  },
  {
    "rating": "0.5/5",
    "review": "Piss Piss Piss Piss Piss"
  },
  {
    "rating": "5/5",
    "review": "It was excellent- my little friend from goodies is all grown up. Great fighting and story line . Very believable."
  },
  {
    "rating": "3/5",
    "review": "not necessary to kill interesting characters in a comedy. otherwise it was fun but short."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie and the acting was very good in this too hope they would make a part 2 for this"
  },
  {
    "rating": "3/5",
    "review": "Weak story line, not believing"
  },
  {
    "rating": "4/5",
    "review": "Good action, entertaining , but the ending was a little flat."
  },
  {
    "rating": "2/5",
    "review": "Not what I thought. Maybe it's because it was pushed as a Jackie Chan type comedy adventure, but it fell short of that expectation. The story was just to choppy and lacked much development. Parts were fun and I can see there was potential but execution just want there."
  },
  {
    "rating": "4/5",
    "review": "Mid acting but the fighting scenes are fire🔥🔥"
  },
  {
    "rating": "1/5",
    "review": "I absolutely love Ke Huy Quan. He is incredibly charming and lovable in this film. He also gives a great Jackie Chan style of energy with the action scenes. The problem is that this film does live up to the title because it hurts to watch this awful movie. The story and writing are terrible, the change in tone is jarring, and the characters are poorly written. Love Hurts wants to be an action, romance comedy but it doesn't succeed in any. The romantic chemistry between Ke Huy Quan and Ariana DeBose is nonexistent. Heck, Ariana's character isn't even remotely likeable. There are too many silly romantic subplots that ruin the pacing. There are random moments of extreme gore that feel out of place. The story never gets any more interesting and we never truly delve into our main character or villain. Watch it for Ke Huy Quan alone."
  },
  {
    "rating": "1/5",
    "review": "I thought it was going to fun and exciting with great fight scenes. It was neither. Fell flat on all levels."
  },
  {
    "rating": "3/5",
    "review": "“Love Hurts” delivers thrilling action sequences, with Ke Huy Quan showcasing his remarkable talent, leaving audiences eager for more of his work. Daniel Wu, portraying the main villain and Quan’s on-screen brother, shines in his limited screen time, especially in a standout scene with Sean Astin. The film’s concise runtime of under 90 minutes ensures a brisk pace. However, while the action is commendable, the storyline lacks depth, leaving viewers with a sense that the film could have been more fulfilling. Overall, it’s an enjoyable watch for action enthusiasts, but it may leave some wishing for a more robust narrative."
  },
  {
    "rating": "0.5/5",
    "review": "So bad we started to laugh at the terrible dialogue and delivery. Even the heartfelt love declarations became funny. We left"
  },
  {
    "rating": "2/5",
    "review": "Not sure what it is meant to be. Very disjointed"
  },
  {
    "rating": "3.5/5",
    "review": "It has a lot of action scenes, but the cinematography was very all over the place. The plot was on."
  },
  {
    "rating": "3.5/5",
    "review": "The chemistry was not there for the love story portion of the movie. I loved some of the comedic moments, some of the fight scenes were over the top with gore. The story had more potential than what was shown. Worth seeing, but not seeing twice. Highlight: Marshawn Lynch."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed this, sometimes it's good to switch off and enjoy these movies. Well worth the watch, never listen to poncey critics"
  },
  {
    "rating": "4/5",
    "review": "I went in with no expectations, and it turned out to be a pretty good movie. Some moments had me actually laugh out loud."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible premise overall, neither funny nor dramatic nor thrilling, waste of film."
  },
  {
    "rating": "3/5",
    "review": "Ke Huy Quan is charming, the action is excellent visceral and fun, and most of the supporting cast was stellar, especially Mustafa Shakir and Sean Austin. The little side stories of the background characters and great little comedy beats in the fight sequence were a delight. It is sad how truly excellent this film could have been and I hope its lack of financial success doesn't ruin our chances of seeing future Ke Huy Quan lead action movies of this type. I do really feel he could be a new Jackie Chan given the chance. That all being said, even though I enjoyed it despite its flaws, it would be unfair to pretend it wasn't really uneven. For starters, the obvious, who signed off on casting the leading lady/Quan's love interest an awkward uncomfortable 20+ years younger than him? Even if it wasn't icky it doesn't work plot wise either. She was supposed to be a lawyer before they both went on the lamb for an untold number of years? She must have gone to law school straight from junior high. The sappy orchestral score, odd voiceovers delivering information that would have been better conveyed almost any other way, pacing issues and a lackluster (and also weirdly young) big bad brother character, also marred what otherwise was a super fun action comedy. Worth watching dispite all but I hope Quan gets a movie more worthy of his potential as a leading man someday."
  },
  {
    "rating": "2.5/5",
    "review": "So let me start by saying that Ke Huy Quan is hands down the best thing about this uneven film. Based on his performance alone, I would say you should go see it. That being said, this film either had a director suffering from ADHD or a very interfering studio. There is a lot to like in this movie, and there are some plot points and story arcs that are quite compelling, but it feels like they left too much on the editing room floor. With better editing and more focus on the characters and story, this could have been a great film. As it is, it’s little more than an opportunity to showcase just how good an actor Ke Huy Quan is, because without him, this film would probably be complete garbage."
  },
  {
    "rating": "0.5/5",
    "review": "This movie starts off like a comedy, which is fine if that’s what it’s aiming for, but when you go in expecting action and get slapstick humor instead, it feels off. The tone is all over the place. The story follows Marvin Gable (Ke Huy Quan), a former hitman turned real estate agent, but it doesn’t do much with that concept. It throws him into a situation where his past comes back to haunt him, yet there’s no proper setup, no real stakes, and no explanation for why things happen the way they do. The transitions are rushed, and the pacing feels like the script was pieced together without a clear vision. There’s barely a plot, just a series of chaotic events with little to no build-up. The directing is a mess. Scenes escalate with no logic, and major moments happen so fast they don’t have any weight. Cinematography is just as frustrating, especially with the camera constantly circling Marvin whenever he’s deep in thought, which happens way too often. At one point, the movie spends nearly half of the second act on him repeating that he needs to “face his past.” It’s exhausting. The fight scenes aren’t much better. One guy throws knives at the ground, what was he aiming at exactly? others conveniently forget they have guns, or they point straight and shoot as if they're part of a first person shooter game. The action is so choreographed and predictable that it loses any tension. The acting doesn’t help either. Ke Huy Quan does his best, but the role just doesn’t fit him. The supporting cast feels like they’re forcing their performances, especially in the few moments where the movie tries to develop its characters. It’s like they added emotional depth as an afterthought instead of making it feel natural. Then there’s the script, which is a whole other issue. The dialogue is repetitive, with Marvin narrating every single thing he’s about to do instead of just doing it. It makes the movie feel dumbed down, as if the audience needs to be spoon-fed every thought and decision. Even the music choices are questionable. The score doesn’t match the tone of the scenes, making everything feel even more disconnected. It’s as if someone randomly picked tracks without considering how they fit into the story. By the time the big climax rolls around, the movie has already lost all sense of direction. When Marvin finally fights his past (literally and figuratively), it plays out in the most ridiculous way possible, with one-on-one fights that ignore any logical strategy. In the end, Love Hurts is a frustrating watch, disjointed, poorly executed, and lacking any real impact."
  },
  {
    "rating": "4.5/5",
    "review": "Good film damn!! Its nice film that i ever watch"
  },
  {
    "rating": "3/5",
    "review": "The movie was OK but too much like a Jackie Chan imitation. Too many F bombs. It seems every 60 seconds there was another F bomb. What a shame. My wife and I were the only two people there in the afternoon. I asked the young man if he could at least turn the volume down a little bit Because it was too too loud but instead of turning the volume down, they turn the lights off. Go figure."
  },
  {
    "rating": "5/5",
    "review": "hilarious. action packed. heartfelt but didn't take itself seriously. if you're a Deadpool fan this is right up your alley."
  },
  {
    "rating": "4/5",
    "review": "Very good indeed with a comedic side adds a good storyline to go with the action sequences. The guy from the Goonies I can honestly say this is another Oscar Performance.. Do yourself a favor and please check this out asap."
  },
  {
    "rating": "2.5/5",
    "review": "The plot was pretty boring and it didn’t keep my attention."
  },
  {
    "rating": "0.5/5",
    "review": "Painful watch/borderline unwatchable. Cringe dialogue and acting, lackluster plot, all coming together with comedy serving in an almost childish way. Including of the most pointless, chemistry-lacking, forced romance you will find in a movie. Action was okay. I think I was expecting more considering Quan’s work in EEAAO. This movie ain’t it."
  },
  {
    "rating": "2/5",
    "review": "Quans great. Actions great. Choreography great. Everything else sucks. No chemistry with the love interests. Drags between action scenes. Put me straight to sleep."
  },
  {
    "rating": "5/5",
    "review": "Lots of laughs and lots of fun- what we need right now to get away- at least for a little while...."
  },
  {
    "rating": "1/5",
    "review": "Unwatchable. Like some fresh from film school american tried to copy any random mockny guy Ritchie film and slapped some nonsense romance storyline in there for a valentines day release"
  },
  {
    "rating": "5/5",
    "review": "Nice good luck for the first"
  },
  {
    "rating": "5/5",
    "review": "Love Hurts is an action-comedy film that excels in its action choreography and Ke Huy Quan's performance. However, the film also has some drawbacks, such as a overly complex plot and underdeveloped characters. Overall, the film has great potential, but falls short of being a complete success. Rating: 8.5/10."
  },
  {
    "rating": "5/5",
    "review": "Love Hurts puts a light, action-packed twist on the retired-killer-returned trope, blending romance, comedy, and over-the-top action into an entertaining ride."
  },
  {
    "rating": "5/5",
    "review": "that's very incredible movie"
  },
  {
    "rating": "5/5",
    "review": "good movie i like it!!!"
  },
  {
    "rating": "5/5",
    "review": "This movie is very epic"
  },
  {
    "rating": "5/5",
    "review": "Movie was engaging throughout and moved along well. Really enjoyed!!"
  },
  {
    "rating": "4.5/5",
    "review": "Scene yg sgt bagus!"
  },
  {
    "rating": "5/5",
    "review": "Fight scenes were very good, a bit bloody & violent, but very good. Acting was good. it was funny & dramatic. Rose was a bit too edgy. Ke Huy & Daniel Wu did a great job. The storyline was a bit fuzzy. Somewhat anticlimactic"
  },
  {
    "rating": "5/5",
    "review": "Good film nice for fi"
  },
  {
    "rating": "5/5",
    "review": "Alur cerita sangat menarik dan akting sangat memuaskan"
  },
  {
    "rating": "4.5/5",
    "review": "Film yang bagus , dan recommend untuk ditonton"
  },
  {
    "rating": "0.5/5",
    "review": "genuinely hated this movie. my bf and i walked out 30 mins in. the sound effects were way too loud, but not sure if it was the movie theater we were at. but overall not a good movie, there’s too much dramatic fighting and acting was not good."
  },
  {
    "rating": "4/5",
    "review": "Good movie! I really enjoyed it. The setting and visuals were beautiful. Although, it would've been better if there was more character development for most of the characters."
  },
  {
    "rating": "5/5",
    "review": "very suitable for teenagers like us to watch"
  },
  {
    "rating": "5/5",
    "review": "Love this movie, it feels like young jacky chan is back at the scene."
  },
  {
    "rating": "1/5",
    "review": "I really wanted to like this move and managed to let through half of it before I finally gave up and left the theater. Lots of action with next to no story line."
  },
  {
    "rating": "0.5/5",
    "review": "Hated it! Walked out after 30 minutes. Story line was lacking. Too much fighting, killing/beating up people"
  },
  {
    "rating": "4/5",
    "review": "Fight scenes were very good, a bit bloody & violent, but very good. Acting was good. it was funny & dramatic. Rose was a bit too edgy. Ke Huy & Daniel Wu did a great job. The storyline was a bit fuzzy. Somewhat anticlimactic."
  },
  {
    "rating": "1/5",
    "review": "Incredibly weak. Zero background on characters, not funny. Hollywood is dead. Save your time and $$."
  },
  {
    "rating": "5/5",
    "review": "it's was entertaining and funny!"
  },
  {
    "rating": "2/5",
    "review": "It's a shame to not have been so satisfied with this movie I've been seeing trailers for for months. When the movie hits, it hits. The fight scenes are solid, almost up to par with a John Wick movie, however some of the acting from the side characters then makes it feel like a B-movie. There's not enough good however to outbalance the \"eh\"."
  },
  {
    "rating": "3.5/5",
    "review": "It was a full of action and somewhat funny movie."
  },
  {
    "rating": "1.5/5",
    "review": "I want impressed. And I'm not hard on movies"
  },
  {
    "rating": "5/5",
    "review": "The definition of a Fun movie! Many hilarious scenes, great characters, and didn't feel like a copy of every other action/vengeance movie we've seen for the past decade. Ke Huy Quan and Ariana DeBose shine, would definitely love to see more of them in action/comedies in the future."
  },
  {
    "rating": "3.5/5",
    "review": "Knuckles from sonic the hedgehog😅"
  },
  {
    "rating": "5/5",
    "review": "Very fun movie! Lots of creative action-packed scenes and funny one-liners"
  },
  {
    "rating": "3/5",
    "review": "It had it's funny moments. I laughed loudly at some parts, but overall it was a fun, but VERY cheesy film."
  },
  {
    "rating": "1.5/5",
    "review": "The main character is a new warrior in the mainstream scene. He had the potential to play the retired kung fu master Reawakened, but the cheesiness of the movie let me down. Who was this movie for? The comedy was fit for elementary school kids. The script was so bad that it seemed to be written by a third-world tribe that had researched American culture using only Tash TV. The fight was good but overwritten by the nature of the film. \"Love Hurts\" was not the next must-see kung fu movie. It's more of a Valentine's Day flick you watch drunk, very drunk."
  },
  {
    "rating": "4/5",
    "review": "If you like Ke Huy Quan's schtick, you'll like this movie. Complete with crazy but mostly likeable characters and over the top action/martial arts action. I kinda got a \"Bullet Train Lite\" vibe. Fun movie"
  },
  {
    "rating": "3/5",
    "review": "Love Hurts was chessey but not entirely a disappointment. Indeed, the films elements feel like it is ripping off certain films, but the effort of entertainment did not fail at all."
  },
  {
    "rating": "1/5",
    "review": "Even with a game Ke Huy Quan in his first starring role, Love Hurts will break fans' hearts with lackluster characterization and tonal inconsistency."
  },
  {
    "rating": "2/5",
    "review": "I saw this movie today. The cinema, empty and I can see why. The jokes and the slight romance are a nice touch too but very cheesy .The fighting was funny, fast and pretty good. The only issue is that too many people are presented in the movie out of no where and are given no plot. The movie leaves you overrun with too many questions. Who are the Russians? How does the woman have connections with them? Why is there no proper backstory to the brothers? Why did 'Knuckles' want to keep her alive in the beginning of the movie but strays away from that entirely? How did they even get in that line of work in the first place? etc, etc, etc, etc. IT MAKES NO SENSE!"
  },
  {
    "rating": "5/5",
    "review": "Excellent story line with a good mix of action, drama and funny moments."
  },
  {
    "rating": "3/5",
    "review": "From debuting as Indiana Jones’ sidekick Short Round and becoming a Goonie to defending the multiversal continuum (both “Loki” and “EEAAO”), Ke Huy Quan is an evident child at heart, cherishing his career with sentiment towards his co-stars and amazing storytellers. Ever since he came out of retirement – after watching “Crazy Rich Asians” which inspired his return, his caliber has a lighthearted balance in reminiscent of his youthful beginnings with an actively evolved touch as he showcases his martial art skills. His rejuvenated stardom led to encouragement in the challenge of leading a film, but has “Love Hurts” deliver in that sought prospect? Marvin Gable (Quan) is a renowned dedicated realtor, but his peaceful life gets disrupted when he receives a familiar crimson envelope from Rose (Ariana DeBose), someone from the life he deserted including her being left for dead. Her recent stint drags him back into his crime lord brother’s (Daniel Wu) radar, sending hitmen to find Rose’s location, the problem being is that Marvin does not know her whereabouts much to the chaotic disbelief that threatens his happiness. As Rose calculated, the pressure triggers his past senses back upfront, further positioning him to realize he must truly pick which livelihood better suits him as it seems he did not completely bury his past. Your run-on-the-mill storyline when a past life comes barging but specially written as a holiday overlay with the integral celebrative core integrating some sort of meaning in between. Stunt coordinator Jonathan Eusebio directorially downplayed this as an uncommitted bloody Valentine of little meaning, seemingly centered around Quan’s affective mannerism of innocent charm and decently generic action that does not impress much besides later enabling an observative character study. There was comedic potential outside the narrowed yet apparently simplistic focus while the overall action is unimpressive for lacking any sort of adrenaline to do any stirring for the decreasing entertainment value as the repetitive script ridicules. The characterization is the inflicted attribution when the stock performances show conflicting participation either they mutually agree with the given material, or that they enjoy riding the star vehicle. DeBose’s performance is an arguable testament as she has shown fierce and passionate spirit in her previous, more favorable feats with this showcase proven to be resultingly dull. “Love Hurts” seems to be a creative buildup for Quan’s positional caliber that shall lead him into a better project regardless of the fun experience this supposedly instilled for the cast and crew, especially when the main appeals stem from his involving essence. The best scene in the entire film is when both him and his fellow Goonie Sean Astin share a brief, wholesome dynamic that actually transcends their roles in a touching emotional display. Astin gives a more meaningful performance because of their shared supportive past, therefore noting how narrowed this star vehicle is and how those very filters pleasantly bolstered the film. Reasonable expectations solely regard Quan as he causally gives his all with the needed momentum and occasionally active amusement but turned-out inferior to his “EEAAO” role whereas he won his first Oscar nomination. However, if you want to avoid rewatching all that weirdness and just separate Quan from the multiversal madness while in need for a nap without a date, then this film is a passable Valentine if nothing else. (B-) This is akin to corporate benefiting off of trendy personas that have stunk the cinemas in the early 2000s. Quan’s remarkable comeback is the latest milking attempt that led to this film with similar quality. While watching how much the climax accumulated with the flaws not improving any better, it really begs the question if filmmakers want to keep fueling the moviegoing business then they should not lead a product with discouraging quality. Instead, they are encouraging cynics to filter out even further of what is truly worth of the inflated ticket pricing in the theaters."
  },
  {
    "rating": "3.5/5",
    "review": "It was a good comedy and action movie…wish it was just a little bit longer"
  },
  {
    "rating": "2.5/5",
    "review": "The standout performance in the film was undoubtedly by Ke Huy Quan. I was interested in seeing this movie because it marked his first starring role. He had previously appeared as a supporting actor in Everything Everywhere All at Once, for which he won an Academy Award. Most famously, he was a child star in Indiana Jones and the Temple of Doom and The Goonies. As a nod to the latter, Sean Astin also appears in this movie as a minor character and mentor to Marvin. That was a nice touch, although Astin’s character feels somewhat underutilized and random. Quan makes for an excellent leading man and is quick on his feet during the fight scenes. The stunts, reminiscent of Jackie Chan’s fighting style, create an exciting experience for the viewer. I love the charm and charisma that Quan brings to the screen; you can’t help but adore him. Read the full review here ---> https://zombiesinmyblog.com/love-hurts-never-underestimate-the-power-of-your-realtor/"
  },
  {
    "rating": "0.5/5",
    "review": "Terrible. Left before it finished"
  },
  {
    "rating": "2/5",
    "review": "Action sequences were great, some of the humor was good. The story was an issue, “you can’t change who you are, so just go back to what you used to do?” At least that’s what I got from it."
  },
  {
    "rating": "3/5",
    "review": "It has some laughs and some good action and some heart. A little cheesy, but fun."
  },
  {
    "rating": "2.5/5",
    "review": "Starts good and ends well but too much dialogue"
  },
  {
    "rating": "5/5",
    "review": "good action, good comedy"
  },
  {
    "rating": "1.5/5",
    "review": "The fight scenes were good but the plot was so hard to understand I couldn't follow it, and character development was non existent. If you're really bored and it's on one of your streaming services sure give it a go. I wouldn't recommend going to the theatre to see it."
  },
  {
    "rating": "1/5",
    "review": "No plot, terrible language."
  },
  {
    "rating": "5/5",
    "review": "Lots of action Loved it"
  },
  {
    "rating": "5/5",
    "review": "Movie was engaging throughout and moved along well. Really enjoyed!!"
  },
  {
    "rating": "1/5",
    "review": "Was mostly unrealistic fight scenes and sophomoric dialog. Waste of my time and money."
  },
  {
    "rating": "1/5",
    "review": "Narrative was bland. Having voice over to explain the character thoughts was distracting and didn't propel the story. The impetus for the characters seemed trite."
  },
  {
    "rating": "2.5/5",
    "review": "I get the idea, nice try, but poorly executed. It’s unfortunate as talent is present in the cast."
  },
  {
    "rating": "4.5/5",
    "review": "Funny movie. great casting."
  },
  {
    "rating": "1.5/5",
    "review": "Very confusing. The fight scenes were fun but not really sure what they were fighting about. Not much of a plot."
  },
  {
    "rating": "1/5",
    "review": "This movie sucked!! Cant believe I wasted 14 to see this."
  },
  {
    "rating": "0.5/5",
    "review": "Language, violence, hard to follow. This is not a action/martial arts with choreographed moves and touches of comedy. Poor movie, only went so my hubby had company. Previews were awful too. Can not get those two hours back. which is sad and that hurts."
  },
  {
    "rating": "3/5",
    "review": "The acting was just okay. This is the type of movie that I would watch on Netflix rather than pay to see it in a theater."
  },
  {
    "rating": "5/5",
    "review": "Great action-packed movie with a little love story"
  },
  {
    "rating": "2/5",
    "review": "It’s not the worst movie I’ve ever seen. But definitely not good. Some of the action was fun, but everything else was a bit dull and boring. Main actor had a great performance. Everything else was below average."
  },
  {
    "rating": "5/5",
    "review": "A fun movie. Lives up to the movie trailer."
  },
  {
    "rating": "5/5",
    "review": "I like this movie it looked boring but it’s a good movie"
  },
  {
    "rating": "3.5/5",
    "review": "It was a fun romp. A different take on this genre. Yes, there is blood and gore but it’s a Valentine’s love story too."
  },
  {
    "rating": "3/5",
    "review": "It was ok, I thought it was going to be funnier and not quite as heavy on the violence. There was alot of area for more story line."
  },
  {
    "rating": "2.5/5",
    "review": "It was funny-ish and had action, but the gangster premise seemed stupid... especially the brother."
  },
  {
    "rating": "3/5",
    "review": "The movie tried too hard to be weird. Instead of a straightforward romantic comedy/action, it tried to be a bit like Smokin' Aces but \"Love Hurts\" tried too hard to make each character individually odd."
  },
  {
    "rating": "4/5",
    "review": "Entertaining and fun!"
  },
  {
    "rating": "1/5",
    "review": "Ke Huy Quay and Lio Tipton could have been recognized for their performance, had it not been for the ineptitude of the movie plot and the supporting actors. The language was as crude as anything once heard in a middle school boys bathroom. The insults rarely made any sense and were so laced with profanity as to be disturbing. The storyline lacked any originality and seemed written by AI scripted for 13-year-olds. The character development which was centered on gratuitous violence was so excessive as to leave little room for plot development. This movie should never have been made, and certainly not released."
  },
  {
    "rating": "5/5",
    "review": "I love it. It is an action, a romantic and a very funny movie all at the same time."
  },
  {
    "rating": "4/5",
    "review": "Quirky characters and plot line work most of the time. It can be over the top sometimes but overall decent movie."
  },
  {
    "rating": "5/5",
    "review": "This was a really enjoyable movie. It had some genuinely funny moments and great fight scenes. It also felt unique from other spy movies I've seen"
  },
  {
    "rating": "2.5/5",
    "review": "Action packed with crazy good choreographed fight scenes. Surprising character development and love stories, perfect for Valentines Day release. A surprise cameo from a famous TV personality adds a  hilarious twist."
  },
  {
    "rating": "3.5/5",
    "review": "If you go into this movie knowing it’s a throwback grind-house style film with tongue and cheek over the top cheesy dialogue, it works! The action is great, the funny parts are funny. It’s the parts when you think it’s getting serious that drag but when you realize it’s not supposed to be serious, then it improves in my opinion. So, go in expecting to love Ke Huy Quan and watch him kick ass, check your seriousness at the door and laugh your butt off. I would rather support indie schlock with no expectations than be disappointed with the biggest franchise’s newest chapter."
  },
  {
    "rating": "3.5/5",
    "review": "I found that the Plot moved slowly at Times,but the overall Story of Jackie Chan finding Salvation from his prior life of Crime, and starting over kept me interested."
  },
  {
    "rating": "4/5",
    "review": "Really good film from start to finish. Full of action. The choreography was spot on and the acting was great. Would highly recommend watching this film especially if you like 'Nobody' and 'Violent Night'."
  },
  {
    "rating": "4/5",
    "review": "This is the best Valentine's Day movie I've ever seen. (and maybe the only)"
  },
  {
    "rating": "5/5",
    "review": "Great action and comedy!!! Would see this again!!"
  },
  {
    "rating": "5/5",
    "review": "Once it gets going the film is what you expect with a twist. We really enjoyed the film."
  },
  {
    "rating": "1/5",
    "review": "Wow. Rolled my eyes through the entire movie. Only redeeming qualities were the fight scenes. Acting sucked. Story sucked. Side characters were just annoying."
  },
  {
    "rating": "3.5/5",
    "review": "Campy. Not the Madam Web kind of campy (thank goodness). I was laughing for a lot of the movie. It was a little \"eye rolly\" but somehow also wholly enjoyable. I didn't like some of the supporting cast- but I would watch again (and again) for Ke Huy Quan's performance! I hope we haven't seen the last of this loveable realtor."
  },
  {
    "rating": "5/5",
    "review": "Funny, romantic, sincere, action packed. Something for everyone!"
  },
  {
    "rating": "2/5",
    "review": "Atrocious script & some bad acting uninspired fight scenes that almost put me to sleep. Ke & Ariana had zero chemistry. This is an example of a terrible trailer that promises on the film not being very good."
  },
  {
    "rating": "4/5",
    "review": "Great actor but does anyone notice his fighting style is like a Jackie chang mix with Bruce"
  },
  {
    "rating": "1.5/5",
    "review": "Not much of a story, pretty silly"
  },
  {
    "rating": "1/5",
    "review": "Thought itd be a fun tongue-in-cheek action movie. Instead, it was an unnecessarily bloody, couldn't wait for it to be over movie. Disappointing at best."
  },
  {
    "rating": "4/5",
    "review": "Action-packed and funny"
  },
  {
    "rating": "5/5",
    "review": "It was full of action and humor. It kept you on the edge of your seat. We really enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "Funny, action, fast pace once it got started. Nice twist at the end. Definite sleeper as it’s better than reported."
  },
  {
    "rating": "1/5",
    "review": "How is it possible that competent people could make such an awful movie?"
  },
  {
    "rating": "1/5",
    "review": "It's simply a bad movie. For some reason Jackie Chan movies were bearable and funny and somehow memorable from an entertaining point of view. This movie was almost an excuse to get out of the theatre. There is a thing called acting lessons......."
  },
  {
    "rating": "2/5",
    "review": "Is nice to see two cast from The Goonies and Ke Huy Quan does really incredible fight scenes which he also did his own stunts but this is a shame Valentine action movie the story is confusing and not explaining the whole story and terrible characters confrontation there's no chemistry for the leading casts and really disappointed wasted minute runtime."
  },
  {
    "rating": "3/5",
    "review": "Looks like they were trying to make a Jackie Chan movie without as much success action was not up to snuff either Some funny moments with the guy from HGTV otherwise mostly forgettable"
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed it, especially the action scenes. (Dude did a 1 inch punch! I haven't seen that in the longest!) This was hilarious, violent and sweet. The gore was a tad much, but not enough to ruin the movie. However, I wanted more backstory on the organization. How did it start? Maybe I missed it, but it wasn't clear. Still loved it!"
  },
  {
    "rating": "4/5",
    "review": "good movie. lots of action.. We loved the goonies guys in it"
  },
  {
    "rating": "0.5/5",
    "review": "This film is preposterous and ridiculous. There is little chemistry between DeBose and Quan. While the martial arts is over the top who believes that Quan would be able to survive in just one of the fight scenes. Awful film in every way."
  },
  {
    "rating": "4/5",
    "review": "It was a good movie. Lots of action. I think a lot of people were too hard on this movie. It wasn’t meant to be a deep meaningful action movie. Who is meant for fun."
  },
  {
    "rating": "1/5",
    "review": "Did not like language, violence or acting"
  },
  {
    "rating": "5/5",
    "review": "This was so funny too 😂😂😂!!!"
  },
  {
    "rating": "4/5",
    "review": "I'm a fan of Ke Huy Quan and went to see him in a lead role. I recommend this film, and I am shocked to read unflattering reviews. My husband and I laughed so much and were jolted by all the violence, but we love an action comedy, so we knew what to expect. This was the best of that genre we've seen since Red and Red 2."
  },
  {
    "rating": "5/5",
    "review": "You know what you're getting when you come see this moving. Incredible action choreography a whole bunch of fun. The story is enjoyable to watch. You're not coming to this movie for seriousness. You're coming to this movie to laugh and gasp at the action. There is gore but it's reminiscent of Bullet Train and Tarantino type gore, which I personally enjoy in my pure action movies."
  },
  {
    "rating": "4/5",
    "review": "I thought this movie was awesome. The visuals: pop-culture saturation. The acting: fantastic. The storyline: easy to follow. Quirky, non-complex characters, tongue-in-cheek nuances... as long as you aren't squeamish with a bit of violence, it's a fun and light-hearted action-packed way to spend an hour plus."
  },
  {
    "rating": "5/5",
    "review": "Finally a real action movie back in theaters!"
  },
  {
    "rating": "5/5",
    "review": "More violent than expected"
  },
  {
    "rating": "5/5",
    "review": "like it and love it awesome movie"
  },
  {
    "rating": "3/5",
    "review": "Great artistic and choreographed fight scenes but a little too much gore that really wasnt needed. Weak plot but entertaining."
  },
  {
    "rating": "1/5",
    "review": "Cliché movie that mixed gang violence with American racial romance. Story line is lackluster and seems to be written to appease certain audience. Cringe jokes combine with a confusing story while provide little to no character development makes this movie to be one of the worse movies I have watched."
  },
  {
    "rating": "3/5",
    "review": "it was a fun little movie"
  },
  {
    "rating": "0.5/5",
    "review": "This is my personal opinion, I just watched this movie and I am so incredibly disappointed. It was like watching a soap opera and I don’t think the story line was thought through well enough. I was so excited about this movie and thought it would be funny but, I didn’t laugh one time. Yikes. I like movies from John Wick, to Dumb & Dumber, to The Choice, and can’t stand Hallmark movies. With the movies I like, it’s a decent combination. But this movie, it was just terrible. SPOILER •There was a fight scene in the beginning, in the main characters kitchen, and he was thrown sideways and made this yell that was pretty funny Other than that, nothing about this movie was funny or worth the wait. The characters were super strange, they had the script of a Hallmark movie, the acting was very poor and the lead female character, was probably the defining part of the film that pushed it into a one start review. Her character was overly psychotic, it was very valley girl and very poor."
  },
  {
    "rating": "2/5",
    "review": "It should have been a January Dump."
  },
  {
    "rating": "3.5/5",
    "review": "Don't listen to the critics. It was a very fun movie. I had a great time with it."
  },
  {
    "rating": "5/5",
    "review": "Great movie all the way through"
  },
  {
    "rating": "5/5",
    "review": "very romantic I love it"
  },
  {
    "rating": "3/5",
    "review": "61% Little to no actual substance, this was Jonathon Eusebios first directing gig and he previously was the stunt coordinator of The John Wicks and I can see all that beautiful action here. My big thing is the Story, there is none, it’s about 15 Minutes of substance which is not enough to get connected to anyone. Overall this is good if you like Nobody or John Wick but want less story."
  },
  {
    "rating": "4/5",
    "review": "Fun film and action packed"
  },
  {
    "rating": "2/5",
    "review": "Apart from entertaining action sequences, Love Hurts just doesn't have anything to offer. The story and characters are unoriginal and have no depth."
  },
  {
    "rating": "0.5/5",
    "review": "It was very uninteresting, with a boring plot line as well as weak acting. Not worth going to the movies to see."
  },
  {
    "rating": "4/5",
    "review": "Fun, didnt take itself too seriously. Would definitely watch again for a laugh."
  },
  {
    "rating": "5/5",
    "review": "Funny, fun movie , full of action."
  },
  {
    "rating": "4.5/5",
    "review": "You have to have wit and a sense of humor and a love for great choreographed fight and action scenes! Loved the characters and subtle nuances of comedic timing also Ariana is STUNNING! Definitely entertained and enjoyed. It’s not meant to be an Oscar winner talk it’s meant to be a fun get gnarly rom com and it delivered!"
  },
  {
    "rating": "4/5",
    "review": "The movie was well shot but the storyline was just poorly written."
  },
  {
    "rating": "5/5",
    "review": "Loved Daniel Wu and Ke Huy Quan. The action was top notch despite the cookie cutter story. Hope to see more of them!"
  },
  {
    "rating": "2/5",
    "review": "Good action, it was OK movie. You have nothing else to do."
  },
  {
    "rating": "1.5/5",
    "review": "Kind of a “B” movie. Acting is is poor. Script is very badly written. Some elements are “good enough” that kept me from leaving in the middle of the movie."
  },
  {
    "rating": "3.5/5",
    "review": "A silly feel good movie. If you’re looking for something action packed, it was fun to watch!"
  },
  {
    "rating": "4/5",
    "review": "Fun action packed ride mixed with plenty of humor. Love hurts gives me some old school Jackie Chan vibes which Ke Huy Quan doesn’t disappoint. Martial arts and action fans will love this one"
  },
  {
    "rating": "1/5",
    "review": "Too much curse words!!! Too much gore!!! The preview of the movie didnt warn us of all that garbage. We thought it was going to be like a Jackie Chan movie. Couldve been a cool martial arts movie! Oh well!"
  },
  {
    "rating": "4/5",
    "review": "Dont over think it. Action throughout and worth it for the target audience. If halftime music genre ever bothers you, dont give this movie a thought, to the others with open minds…..enjoy."
  },
  {
    "rating": "5/5",
    "review": "This movie was alot of fun. Great time at the movies!"
  },
  {
    "rating": "1.5/5",
    "review": "Love you Ke Huy Quan but this movie is horrible."
  },
  {
    "rating": "0.5/5",
    "review": "This was an awful movie full of F-bombs every few minutes. Should have been full of potential with the talent they had, but they played down to the lowest depraved mind you could find. Not recommended for those who want any positive entertainment."
  },
  {
    "rating": "4/5",
    "review": "Super cute and cheesy rom con action filled"
  },
  {
    "rating": "4/5",
    "review": "Lots of Kung Fu fighting action, Romance and overall good storyline."
  },
  {
    "rating": "5/5",
    "review": "This movie was very well cast, full of action and hilarious! Love love loved it! 😊"
  },
  {
    "rating": "5/5",
    "review": "This movie was extremely funny! The perfect date movie!"
  },
  {
    "rating": "3.5/5",
    "review": "Just turn your brain off and enjoy all the awesome stunt choreography. The plot is absent and Ariana Debose is impossible to like."
  },
  {
    "rating": "3/5",
    "review": "good popcorn flick, but a lot of plotholes."
  },
  {
    "rating": "5/5",
    "review": "The action & fight scenes were great"
  },
  {
    "rating": "5/5",
    "review": "The fight scenes were well done. The movie comes off a little \"campy\" but there's an odd mix of Oscar winning actors and misplaced cameos from untalented celebrities throughout. Ke Hy Quan should get a pass on this one, he needed a money grab after 41 years as a bit actor. He's still really talented."
  },
  {
    "rating": "1.5/5",
    "review": "It was really not good"
  },
  {
    "rating": "5/5",
    "review": "This movie was fun and funny. Nice and lovely."
  },
  {
    "rating": "1.5/5",
    "review": "Pros: every single actor delivers a great performance, there were some interesting shots in the movie (the microwave and fridge shots for example), the fight sequences were fun Cons: the story is flimsy, the romance felt super rushed/forced Honestly, it feels like the movie tried to incorporate too many genres at once and didn't really stick the landing for any of them."
  },
  {
    "rating": "2.5/5",
    "review": "The action really keeps you hooked, but otherwisethe plot wasnt exactly the best. I really wanted to LOVE this movie. I love the actors though!"
  },
  {
    "rating": "3.5/5",
    "review": "Funny and action packed"
  },
  {
    "rating": "3/5",
    "review": "Its like Step Brothers meets Deadpool. The kind of mindless entertainment I was looking for. Could have been a few minutes longer to get some things flushed out."
  },
  {
    "rating": "5/5",
    "review": "I thought it was a fun movie. I did love seeing Ke Huy Quan in his action scenes."
  },
  {
    "rating": "4/5",
    "review": "enjoyed the action and the redemption arc. The love angle was a little hard to pull of. Marshawn Lynch was a refreshing character and Sean Austin was just great. Ke Huy Quan and Ariana Dubose were a good match."
  },
  {
    "rating": "5/5",
    "review": "it was funny, different, and pretty cool"
  },
  {
    "rating": "4/5",
    "review": "Not a perfect movie by any means, but Ke Huy Kwan is always fun and charming, the fight scenes are great, and it's a fun watch. The supporting cast was great: Marvin Gable's assistant (Lio Tipton) and The Raven (Mustafa Shakir), King (Marshawn Lynch) and Otis (Andre Eriksen), the sketchy accountant (Rhys Darby), the rival agent (Drew Scott)...they brought the laughs!"
  },
  {
    "rating": "0.5/5",
    "review": "I missed it and I forgot Fandango credit. I gave it a half a star cause I didn’t go because I missed it."
  },
  {
    "rating": "3/5",
    "review": "cool movie. could've waited and watched it on Netflix though"
  },
  {
    "rating": "4.5/5",
    "review": "Fun action, comedy. The stunts and the action was great the comedy was fine and the run time was perfect for what the movie is. Nothing complicated just a movie worth watching."
  },
  {
    "rating": "4.5/5",
    "review": "It was fun and action packed. The cast played their roles well, and it exceeded my expectations. Falls right in line with Nobody and Violent Nightt"
  },
  {
    "rating": "5/5",
    "review": "Excellent! Good action and story line!"
  },
  {
    "rating": "3/5",
    "review": "The action scenes were incredibly intense, but the romantic plot between Marv and Rose was weak."
  },
  {
    "rating": "4.5/5",
    "review": "Loved it, it’s a sort of a Kill Bill / John Wick like movie. Lots of nonsensical fight scenes with CGI, so turn brain off and enjoy"
  },
  {
    "rating": "0.5/5",
    "review": "This movie is simply horrible, the actors choices were not on point at all. Very disappointed, Waste of Money and Time. Not recommendable"
  },
  {
    "rating": "2.5/5",
    "review": "Trailers and word of mouth gave this movie a very positive buzz (admittedly, it reminded me of a funny / action Tarantinoesque version of Kill Bill). The action was fun / silly and somewhat enjoyable. It had some very quirky, interesting characters that could have been developed / used a lot more. The story dragged for a bit and lacked a spark of excitement or uncertainty and was fairly predictable. Not a bad watch for a matinee or on the cheap movie day."
  },
  {
    "rating": "3/5",
    "review": "Fun Sunday afternoon movie."
  },
  {
    "rating": "5/5",
    "review": "Very 70s vibe with a modern twist. Great soundtrack and great cast. Love it!"
  },
  {
    "rating": "4.5/5",
    "review": "Lots of action, well performed, well staged humor!"
  },
  {
    "rating": "4/5",
    "review": "Great action movie with cheesy dialogue. Overall a good movie"
  },
  {
    "rating": "4.5/5",
    "review": "Liked the Jackie Chan style fight scenes."
  },
  {
    "rating": "3.5/5",
    "review": "The plot line for this movie was kind of thin but I definitely had a good time watching! The action and martial arts was over the top but in a good way. And Ke Huy Quan is just a joy to watch on screen."
  },
  {
    "rating": "1/5",
    "review": "Sadly, this movie got worse over time. You keep wishing for the plot to start making sense but it never does. Disappointed ☹️"
  },
  {
    "rating": "5/5",
    "review": "A very fun, cute, action, rom-com Valentine's movie. Seeing Ke show off his skills as a lead was definitely worth it! The cast dynamic was great to see and I definitely need to see it again. Will be buying to own when out on DVD and digital."
  },
  {
    "rating": "0.5/5",
    "review": "Jackie Chan look a like with a stupid plot and wooden acting. Faux martial arts."
  },
  {
    "rating": "5/5",
    "review": "A must for anyone who is a fan of the modern John Wick type action movies! The good guys are likable and the bad guys are fun to boo. They even throw in some Valentines Day themes to make it a perfect date movie."
  },
  {
    "rating": "3.5/5",
    "review": "This actually suffered from leaning too far toward hard core action and would have been better in the PG-13 zone like many Jackie Chan films. And yes, our hero here could easily slide into the space Jackie Chan has left open as he does fewer and fewer stunts. Unfortunately, there was no real chemistry with his love interest, so a core element of the plot fell a bit flat. However, it was a fun and refreshing take on the action genre, playing up the nerdy characteristics of the lead and weaving in enough humor to make it worth a watch."
  },
  {
    "rating": "5/5",
    "review": "Fantastic action and inventive sequences. Great storyline."
  },
  {
    "rating": "2/5",
    "review": "It was just boring. The chemistry was missing. They tried to make the storyline bigger than what is was."
  },
  {
    "rating": "3/5",
    "review": "#haiku laugh, love, lacerate | violent Valentine romp | hearts for the Raven ⭐⭐⭐"
  },
  {
    "rating": "3/5",
    "review": "The trailer showed all the funny parts and then that made the movie not as exciting."
  },
  {
    "rating": "5/5",
    "review": "It was truly entertaining. Funny and action packed with great cameos. I laughed and teared up some."
  },
  {
    "rating": "0.5/5",
    "review": "A lot of killing and fighting"
  },
  {
    "rating": "4/5",
    "review": "So this movie had plenty of amazingly well choreographed fights. The plot wasn't bad, the acting was good. Plenty of funny jokes and it really reminds me of early Jackie Chan movies. I think the run time was perfect for the content of the movie. So if you like a bit of a cheesy romcom with good fighting and action scenes! this is a great choice."
  },
  {
    "rating": "3.5/5",
    "review": "Movie was okay. Action was great, but the story had some holes and ends kind of abruptly."
  },
  {
    "rating": "4/5",
    "review": "The action was great. The martial arts was exceptional. I just wish movies were made without the foul language. Jackie Chan didn't need poor language in his movies."
  },
  {
    "rating": "4/5",
    "review": "My wife and I absolutely love this movie. We genuinely are confused as to the bad reviews and think it all has to do with people having different expectations. I think many people were expecting another everything everywhere all at once or at least some type of A24 film, but this is just a light-hearted action comedy and at that it is fantastic! Sure there are some rough edges but they're the standard rough edges that come with a small budget small studio film that make it endearing and warm, not bad. It's just simply not polished to hell and back, which personally for me made it a more fun watch. I highly recommend watching this in theater if you don't have an amazing home theater set up as the extra audio boost really put the fight scenes over the top."
  },
  {
    "rating": "5/5",
    "review": "Well, I loved it! It's an action rom-com indie film with arthouse, kung-fu & comic book elements and the rough edges of what its truly like to make an indie were a breath of fresh air in an industry that caters to a basic story formula that has become stale for me. It's clearly made with love (pun intended) with a cast that put their acting and fighting chops into the genre specific pool. *** SOME SPOILERS PAST THIS POINT***Ke Huy Quan is charismatic and I truly believe his ability to go between the dark and light of his personality. Ariana DeBoise is fantastic as the femme fatal in the piece. Sean Astin was spot on perfect! And the dark love story between Lio Tipon & Mustafa Shakir was so beautifully balanced with dark, comedy and love. I have two criticisms, 1. This tends to be a trend in films overall: in the writing of DeBoise Character as the general stereotypical Femme Fatale with an edge, there was less depth and the role was used as more of an exposition role for Quan's past rather than a full fleshed out character. We all know DeBoise is talented and could have handled more. 2. Quan & DeBoise age difference, I get that its a real thing but it felt off to me. Overall, I say it's a must see for anyone who wants something nostalgic while also fresh and fun!"
  },
  {
    "rating": "3.5/5",
    "review": "Very fun. Perfect runtime."
  },
  {
    "rating": "3.5/5",
    "review": "Full of action and slap-stick. Its corny but a fun movie! Made me chuckle thru-out. Highly recommend."
  },
  {
    "rating": "3/5",
    "review": "A Hilarious, High-Octane Valentine's Delight. Jonathan Eusebio’s Love Hurts is the kind of action-comedy that Hollywood needs more of—smart, stylish, and overflowing with charm. Blending breakneck fight sequences with razor-sharp wit, this film delivers a delightful mix of heart-pounding action and laugh-out-loud moments, anchored by a stellar ensemble cast. At the center of the mayhem is Ke Huy Quan, who shines as Marvin Gable, a reformed assassin turned real estate agent whose past literally comes knocking at his door. Quan brings an effortless blend of charm, physicality, and comedic timing to the role, making Marvin an instantly likable protagonist. Ariana DeBose is equally captivating as Rose, Marvin’s former target-turned-long-lost love, injecting the film with an irresistible blend of danger and allure. The supporting cast elevates the film even further. Daniel Wu’s ruthless yet magnetic portrayal of Alvin \"Knuckles\" Gable makes for a formidable antagonist, while Mustafa Shakir’s smooth but untrustworthy Renny Merlow adds layers of intrigue. However, one of the biggest scene-stealers is Marshawn Lynch, who, as the knife-wielding, poetry-loving Raven, delivers an unexpected comedic performance that lands every time. His dynamic with Kausar Mohammed’s hilariously disillusioned assistant Ashley brings a fresh and quirky romance into the mix. Eusebio, best known for his stunt choreography in John Wick and Birds of Prey, makes his directorial debut with a film that showcases his mastery of action. The fight sequences are kinetic and creative, blending gun-fu, brutal hand-to-hand combat, and even a real estate closing that turns into an all-out brawl. The choreography is crisp, inventive, and never overstays its welcome, keeping the film’s energy consistently high. Beyond the action, Love Hurts boasts a script filled with sharp dialogue and genuine laughs. The film balances its over-the-top violence with heartfelt moments, never losing sight of its central theme: embracing both the past and the future. The Valentine’s Day backdrop adds an ironic touch of romance, with love—whether rekindled, newfound, or hilariously misguided—woven into every plot thread. By the time the final showdown unfolds, Love Hurts has delivered a rollercoaster of adrenaline, humor, and heart. With its pitch-perfect cast, breathtaking action, and unexpectedly sweet moments, this film cements itself as a must-watch for fans of Mr. & Mrs. Smith and The Nice Guys."
  },
  {
    "rating": "1.5/5",
    "review": "The narration keeps restating what is on screen. And expect to see many pointless love cliches."
  },
  {
    "rating": "2/5",
    "review": "Fight choreography was cool. And the love stories were more laughable than the jokes."
  },
  {
    "rating": "4/5",
    "review": "It was a pretty good movie night"
  },
  {
    "rating": "5/5",
    "review": "Action packed, great fighting scenes!!! Was actually funny as well, not trying to give anything away so yeah, go watch it."
  },
  {
    "rating": "4/5",
    "review": "A surprisingly fun movie with lots of action and a predictable plot. This is a good popcorn movie, I suggest it."
  },
  {
    "rating": "5/5",
    "review": "It was just what it posed itself to be a fun Valentines movie with great martial arts and lots of fighting! It was simply a fun time. Loved it !"
  },
  {
    "rating": "4.5/5",
    "review": "Excellent movie! Action packed and funny!"
  },
  {
    "rating": "5/5",
    "review": "Action packed and cute too. Also a Goonies reunion of sorts with Ke Huy Quan and Sean Astin."
  },
  {
    "rating": "4/5",
    "review": "Funny, action packed. Great movie!!!"
  },
  {
    "rating": "5/5",
    "review": "Very similar to the movie Bullet Train - over the top fight scenes with cheeky comedy. If you like bullet train or Tarantino movies you'll enjoy this as well."
  },
  {
    "rating": "0.5/5",
    "review": "Garbage. Left halfway through the movie. Just full of senseless violence and way different from what the trailer showed."
  },
  {
    "rating": "5/5",
    "review": "very okay movie . most actions , and funny clowns 🤡."
  },
  {
    "rating": "3.5/5",
    "review": "good performances and overall good film. it was a little too fast paced at first but then found a good rhythm. the fight scenes were bloody but good. for HGTV fans, there is a surprise cameo"
  },
  {
    "rating": "5/5",
    "review": "Great fight choreo, hilarious eccentric characters, good laughs, funny romances. A great time!"
  },
  {
    "rating": "1.5/5",
    "review": "It was very boring and cringey. Despite a ton of violence and action, none of it felt like it packed a punch. I love action movies like John Wick, but the fighting was so comically (not even in a funny way) absurd that I couldn't even buy into one bit. The characters got punched, slashed, thrown, and shot SO MANY times and kept getting back up mostly fine. At least in John Wick the hits sounded impactful and even John Wick was hobbled at times. The humor definitely did not land with me, I don't think I laughed a single time and I love goofy humor. But it was just so tongue and cheek. There is 0 character development before stuff goes down so I had no reason whatsoever to care about anything that happens to these characters. Overall not a movie I'll remember"
  },
  {
    "rating": "0.5/5",
    "review": "Complete waste of time!"
  },
  {
    "rating": "1.5/5",
    "review": "Action good everything else horrible…could tell the vision was there from the director but feel short with the follow through… I actually contemplated walking out…but I like the main dude… was amazing in “everything everywhere all at once”"
  },
  {
    "rating": "3/5",
    "review": "Tried too hard to make it a cross between the Valentine and action. Unnecessary killing off of characters that didn't add to the plot in a significant way. Corny, but not in a good way."
  },
  {
    "rating": "5/5",
    "review": "Love Hurts is an emotionally resonant and beautifully crafted film that explores the intricate layers of love, loss, and healing. Ke Huy Quan delivers a career-defining performance, showcasing his incredible range and depth as an actor. His portrayal of a man navigating the complexities of a fractured relationship is both heartbreaking and inspiring, drawing you into every moment of his journey. The chemistry between Quan and his co-stars is palpable, adding authenticity to the film’s exploration of love’s joys and pains. The script is sharp and thoughtful, blending humor and heartbreak in a way that feels genuine and relatable. The direction is intimate, allowing the audience to connect deeply with the characters and their struggles. What sets Love Hurts apart is its ability to balance raw emotion with a sense of hope. Ke Huy Quan’s performance anchors the film, making every scene feel personal and impactful. The cinematography is stunning, with visuals that mirror the characters’ emotional arcs, and the soundtrack enhances the storytelling perfectly. By the end, you’ll be left reflecting on the universal truths of love and the resilience of the human spirit. Love Hurts is a five-star masterpiece, elevated by Ke Huy Quan’s extraordinary talent and the film’s heartfelt narrative. A must-watch for anyone who has ever loved and lost."
  },
  {
    "rating": "2/5",
    "review": "Sometimes fun action romance was undeveloped and felt a bit rushed. Besides that had some laughs which is always appreciated"
  },
  {
    "rating": "5/5",
    "review": "Funny & action packed!"
  },
  {
    "rating": "2/5",
    "review": "Way more violent than we thought. Thought it would be more of a comedy with fight scenes. There were a few funny moments but not much."
  },
  {
    "rating": "3.5/5",
    "review": "Love Hurts stands as another excellent installment in the Valentine film parody series, offering a highly entertaining viewing experience. It uniquely blends kung fu with an unconventional love story, amplifying the film’s comedic focus with action elements that drive its fast-paced nature. The film boasts a variety of styles to laugh at, complemented by impressive fights that rival real-life anime rather than traditional anime films. The pace is purely enjoyable, though other plots may inspire hope and well-being if you give them your attention. While this peculiar combination may not appeal significantly to the general audience, it depends on your tolerance for violence, excessive language, and its blend of silly humor and aggressive comedy within its brief runtime. The film possesses considerable potential, but it is undercut by the film’s brevity and the attempt to incorporate numerous characters and sub-plots. Is it the worst to hit theaters? Absolutely not, but it requires more polish, planning, and precision to earn a full recommendation for theatrical viewing. It will undoubtedly be action enthusiasts and comedy aficionados who find it irresistible as a niche audience, while most will likely appreciate it more at home."
  },
  {
    "rating": "4/5",
    "review": "This movie was entertaining but just couldnt find its way. Theres not much real chemistry between the main actors. Good but not great."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible, cheesy, violent. Twitches of humor did not make it worth watching."
  },
  {
    "rating": "5/5",
    "review": "The movie was exciting great fights scenes and just a lot of fun. Don't believe the tomatoes hype if you like comedy you like action and you just like a good movie this is the one I give it five stars any day."
  },
  {
    "rating": "1/5",
    "review": "Awful show! Horrible script, horrible acting, and not what the trailer portrays. Walked out after 30 mins of screen time"
  },
  {
    "rating": "4.5/5",
    "review": "Corny and fun, nice action and romance. Good date night movie"
  },
  {
    "rating": "4.5/5",
    "review": "I liked it! Of course it’s a bit predictable, but it also had hidden meanings of things throughout the movie, ans it has unpredictable parts as well, keeping the viewer interested. Lots of action scenes. Both my husband and I really liked it and want to watch it again!"
  },
  {
    "rating": "4/5",
    "review": "I wanted a fun movie, and got a fun movie. While somewhat predictable, the audience laughed and was entertained. Mission accomplished."
  },
  {
    "rating": "4/5",
    "review": "Violence, but that was expected. We really liked all of the actors. Great ending."
  },
  {
    "rating": "5/5",
    "review": "Ke Huy Quan delivers a jaw dropping, dynamic and consistently engaging performance. He’s got incredible range, and his character duality (from past and present lives) was resonant to the range seen in EEAAO. This movie was constant entertainment. A must watch, especially with your S/O or family. LOVED IT."
  },
  {
    "rating": "4/5",
    "review": "It was refreshing to watch a movie that wasnt drawn out. The story was simple and the message was not too forced. Overall, very entertaining. Personally, I just wished there were less F-bombs throughout there were way too many."
  },
  {
    "rating": "3/5",
    "review": "It was entertaining but also outrageous and corny"
  },
  {
    "rating": "3/5",
    "review": "It had enough action and funny moments to hold the average person's interest. I'd put it on as something in the background doing chores or something."
  },
  {
    "rating": "2/5",
    "review": "So much potential but such a belly flop! The movie was way too short for the amount of characters they wanted us to like! Some action scenes were good but others were soooo boring and badly improvised! Ke Huy is cute and likable but even him looked bored at times but let's be honest, can Ariana DeBose make a good movie??? Now 5 flops in a row, no it's not all her fault but it's also a funny coïncidence! Love Hurts but so is watching this movie at times haha!"
  },
  {
    "rating": "3.5/5",
    "review": "Fun action-comedy that doesn’t take itself seriously. Excellent performances by the cast, especially Marshawn Lynch, who was much better than expected. The action is exciting, and at times, the humor is good. The plot is not great by any means, but that’s to be expected."
  },
  {
    "rating": "5/5",
    "review": "really funny. good date night movie"
  },
  {
    "rating": "4/5",
    "review": "a delightful blend of action and campiness"
  },
  {
    "rating": "3.5/5",
    "review": "Character development? A coherent plot? What are those things? I came here to see Marshawn Lynch get his ass kicked by a little Vietnamese dude."
  },
  {
    "rating": "1/5",
    "review": "Love hurts /Movie was no good"
  },
  {
    "rating": "5/5",
    "review": "Im not sure how it did ratings wise but I loved it. In the previews it reminded me of old Jackie Chan movies. It was great and fun fact there was another original character from the Goonoes who was in the movie. Plus a bunch of cool cameos. All in all great movie hope he keeps making more."
  },
  {
    "rating": "5/5",
    "review": "Not exactly what I expected but I don’t really know what I expected. My husband, who sleeps through most movies we go to, couldn’t sleep through this one. Action, comedy and a little romance made up this movie. After it was over I was still stirred up as though the excitement should continue."
  },
  {
    "rating": "1/5",
    "review": "Stupid movie. Overly violent. Plot is ridiculous. Only saving grace is it's only 1 hour 23 minutes."
  },
  {
    "rating": "1.5/5",
    "review": "The action scenes are cool but everything else fails to deliver. Ke Hu Quan and Marshawn Lynch were bright spots, but the acting felt forced on uninspired writing and dialogue. The plot is straight forward and any mystery is explicitly explained away in rushed storytelling. Some character arcs make no sense. The narration that is voiced over is extremely cheesy. Im surprised they convinced some of these actors to sign on. I wanted to like this film, and Ke Hu Quan tried his best to get us there, but I simply cant recommend spending 80 minutes to watch this."
  },
  {
    "rating": "2.5/5",
    "review": "Great fight scenes, a few great characters. But the story is thin and mostly just told to us and the main romance of the story isnt really onscreen. Ke Huy Quan does his best with some bad writing. But the fights were fun and Marshawn Lynch and Mustafa Shakir were fun too."
  },
  {
    "rating": "3/5",
    "review": "Bits of humor and a lot of fighting!"
  },
  {
    "rating": "4/5",
    "review": "Campy, fun movie. The romantic aspects are humorous. The combat choreography is fun. Kind of a new spin on the old kung fu movies."
  },
  {
    "rating": "3/5",
    "review": "I enjoyed the movie."
  },
  {
    "rating": "3.5/5",
    "review": "My husband and I could not believe that critics were taking this movie plot seriously. I did not realize it at first, but this is obviously poking fun at movies of this genre. Whether or not you agree that it is intentional, it was fun to watch. Consider it a comedy and action movie and you will enjoy it!"
  },
  {
    "rating": "3.5/5",
    "review": "Very funny, quick movie. You’re getting exactly what you expect!! Bang, bang action with a touch of backstory - lolololol. My son and I enjoyed it fully!!"
  },
  {
    "rating": "1/5",
    "review": "Weak dialogue, lots of overacting. We walked out of the theater less than halfway through the movie. Perhaps it got better after we left."
  },
  {
    "rating": "5/5",
    "review": "Cute, different romantic comedy action flick!"
  },
  {
    "rating": "4/5",
    "review": "Funny, Fast pasting, Electric, and but extra extra funny. I you like action movies combined with romances and comedy. This is your movie!"
  },
  {
    "rating": "2/5",
    "review": "Dull. The script was flat and the action scenes were lackluster. The acting never convinced."
  },
  {
    "rating": "5/5",
    "review": "Great story and pacing, amazing action scenes. Humor and heart. Ke Huy Quan is the man!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Probably the worst movie ever"
  },
  {
    "rating": "4.5/5",
    "review": "I liked the combat scenes, entertaining, I recommend it."
  },
  {
    "rating": "0.5/5",
    "review": "This movie had it's moments where it was action packed but it lacked a plot that you could easily follow. After watching it for 15 minutes I was ready to go to the ticket stand to ask for my money back but since it was a package deal on Valentine's Day for me (dinner and a movie) I tried to make the best of it and hang in there. I did but. this shouldn't have been a straight to Netflix movie."
  },
  {
    "rating": "4.5/5",
    "review": "Awesome movie and I enjoyed it"
  },
  {
    "rating": "4/5",
    "review": "A good Valentine's Day themed action comedy film. Love seeing Ke Huy Quan back in the movies, and in a leading role too!"
  },
  {
    "rating": "3.5/5",
    "review": "This is definitely a good role for Ke Huy Quan. Not a bad blend of humour and action. Took a little while to pick up and get going once you figure out what’s going on. Nothing terribly original but entertaining enough that I would love to see more of Ke Huy Quan in the future."
  },
  {
    "rating": "5/5",
    "review": "Liked how this movie had way more action than I anticipated. My dislike is it could've used additional actors on the cast."
  },
  {
    "rating": "1/5",
    "review": "I really wanted to enjoy this movie, I love Ke Huy Quan, but I legitimately wanted to walk out of the theater. The writing is a mess, the story is not interesting at all, the few characters you like and are sweet are treated like absolute trash, the movie has terrible exposition dumps, and I could go on and on with how messy it was. Few highlights are the camera work, and visuals are incredible, and the fight scenes were well choreographed and performed. Alas this is unfortunate, but I can't recommend this one."
  },
  {
    "rating": "5/5",
    "review": "Funny. Cute. Action packed!"
  },
  {
    "rating": "4/5",
    "review": "Nice to see different actors that aren't so well known in an action film with a bit of comedy. As others have said , the fight scenes are violent but that was expected. Overall, us adults were entertained until the end , thumbs up."
  },
  {
    "rating": "2/5",
    "review": "Most of the characters were jerks. Ridiculous plot, gangsters made no sense, the jokes arent funny when you abuse the only sympathetic characters."
  },
  {
    "rating": "3.5/5",
    "review": "A fun date night movie, good action and an ok story."
  },
  {
    "rating": "4/5",
    "review": "This is like watching a Jackie Chan movie meets Kill Bill. It's actually quite entertaining. Pretty cool fight scenes, campy engaging plot. Funny and dark all at the same time. It was a fun date night movie and it just so happened, we saw it on Valentine's Day. it was perfect LOL. You'll have to see the movie to understand the meaning of what Valentine's Day is but Love Hurts, as we all know...."
  },
  {
    "rating": "5/5",
    "review": "Best action movi ever"
  },
  {
    "rating": "4/5",
    "review": "This is very much a valentine’s themed movie. It was action packed, funny at times, good acting and Kept me entertained."
  },
  {
    "rating": "2/5",
    "review": "I can appreciate a good action movie. However, Love Hurts was a little over the top for me. If you love an unrealistic, violence-filled, bloodletting film, this is the movie for you. Lots of Quentin Tarantinoesque fighting scenes. 2 stars for the attempts at humor."
  },
  {
    "rating": "1.5/5",
    "review": "Ugh too violent for a comedy? Not a comedy. The dialogues were awful. Husband liked all the violence. Hard to watch. Wanted to like it but I give it thumbs down"
  },
  {
    "rating": "5/5",
    "review": "a good fun movie. bloody though but good fun."
  },
  {
    "rating": "5/5",
    "review": "I liked this movie. It was funny and had a good amount of action. Good story, highly recommend it"
  },
  {
    "rating": "4/5",
    "review": "Fun quirky action/romance, actance? Romion?"
  },
  {
    "rating": "3/5",
    "review": "It’s cute, has some funny parts. Overall not a movie I will watch again nor tell many people about"
  },
  {
    "rating": "5/5",
    "review": "Fun movie with lots of action."
  },
  {
    "rating": "3/5",
    "review": "Great action and karate."
  },
  {
    "rating": "0.5/5",
    "review": "Awful movie- don’t go"
  },
  {
    "rating": "5/5",
    "review": "Its a great movie about relationships and changes"
  },
  {
    "rating": "4.5/5",
    "review": "Saw it with my husband (huge kung fu movie fan) tonight with mutual expectations that it would be like a goofy, late-Jackie Chan vehicle. I was amused from start to finish, even though I usually don’t go in for Tarantino-level gore (and this movie has a crazy amount of red corn syrup). I thought Ke Huy Quan’s character would quickly get on my nerves, but he won me over almost immediately with the infectious charm he brought to the character and the overall film. With a colorful cast of hilarious badasses (including Sean Astin, who never fails to please when there’s a major monologue to deliver), this was a thrill-a-minute, funny, suspenseful, surprising heartwarming movie that has already joined my favorites. (If I had to pick a “con”, it would be what others have said, the voiceovers spelled out a bit much for the audience in an unnecessary way. Could’ve done with about half as much.) One of my favorite details is how, over the course of the story, you can easily see how the deluded, squirrelly, happy-go-lucky persona Marvin has adopted could realistically pull an Ariana DeBose-level baddie like Rose: as we see more and more of who he used to be and how it shapes the person he is now, his characterization deftly avoids the painfully tired tropes of “dork gets the girl because he succumbs to violence and darkness and women only want bad boys” or “dork gets the girl because the writers think he deserves to win her” that it would have been so easy to fall into with this story. By showing us Marvin’s complexity, noble streak, loyalty, and strong bonds with the people he cares for, he becomes a fully-rounded character with both flaws and virtues that make sense to viewers. And in addition to DeBose carrying off a lethal femme fatale performance, we’re allowed to see a couple of moments where Rose is watching Marvin take enemies apart with terrifying competence and is clearly into it. We’re allowed to see why she is attracted to him at various points in the story, both through his deeds and his capabilities, and the fact that when she tells him what she needs from him, he comes through for her, for them both. It’s a weirdly effective chemistry for a little B-list action-comedy to deliver, and after countless lackluster performances from dead-eyed models-turned-actresses in action movies playing the only woman in the room who end up being narratively gifted to the leading hunk, I drank THIS story up like…well, boba. ;) A lot of folks recognize by now that if certain films critically pan but have high audience reviews, they’re actually a must-watch, and I’m so pleased that Love Hurts is 100% true to that formula."
  },
  {
    "rating": "1/5",
    "review": "Ms. DeBose recently won an Oscar, & this ridiculous piece of junk is the best she can sign up for?! Teeny poppers will love this \"film\"!"
  },
  {
    "rating": "4/5",
    "review": "8 out of 10 I enjoy the movie"
  },
  {
    "rating": "2/5",
    "review": "It was like a generic, rated b version of a Jackie Chan movie. Comedy did not hit well, lackluster story, character interaction was film school 101 at best. Even the fight scenes were bluah...."
  },
  {
    "rating": "5/5",
    "review": "Super fun, nonstop action!"
  },
  {
    "rating": "2.5/5",
    "review": "Corny dialogue but entertaining to say the least"
  },
  {
    "rating": "1/5",
    "review": "Terrible movie. Bad script and worse acting."
  },
  {
    "rating": "3.5/5",
    "review": "Fun movie but really Milwaukee in Feb doesnt have green trees and no snow! Locations should be checked better !"
  },
  {
    "rating": "0.5/5",
    "review": "Too much violence! Could have told the storyline without the violence."
  },
  {
    "rating": "1/5",
    "review": "Not very good. Very predictable Jackie Chan but not as good"
  },
  {
    "rating": "0.5/5",
    "review": "It wasn't quite what the previews portrayed it to be. It had some humor but was there was alot of violence."
  },
  {
    "rating": "4/5",
    "review": "It started pretty cheesy, slow, but it did get funny. However, the acting could have been a little better. Thats just my opinion."
  },
  {
    "rating": "2.5/5",
    "review": "No plot, but lot of violence. Seeing it on Valentines Day fit into the tory line."
  },
  {
    "rating": "5/5",
    "review": "Love and support Ke Huy Quan! Lots of action and funny. Must watch."
  },
  {
    "rating": "4/5",
    "review": "Definitely starts off weird. Begins a power hour of fighting and denying of past, then straight to a powerful ending of laughter"
  },
  {
    "rating": "5/5",
    "review": "love to see Short Round as an adult."
  },
  {
    "rating": "2/5",
    "review": "The John Wick formula is REALLY getting old…"
  },
  {
    "rating": "5/5",
    "review": "Great movie!! Ke did an awesome job ❤️ Me and my husband enjoyed the movie so much it had humor, action & a bit of romance (everything I enjoy 😂) it’s the perfect movie for any couples looking for something to watch that’s different from your typical romcom 😋"
  },
  {
    "rating": "3.5/5",
    "review": "Lots of action .. little goofy but quick fun movie."
  },
  {
    "rating": "2.5/5",
    "review": "It was ok, not too bad"
  },
  {
    "rating": "1/5",
    "review": "Awful!! Terrible story line, too violent. Left half way through."
  },
  {
    "rating": "4/5",
    "review": "Fresh take on a storyline we've seen before. Loved seeing Marshawn Lynch in the movie. He made the movie if you ask me. I was very entertained. Go one to watch."
  },
  {
    "rating": "5/5",
    "review": "Must see ! Great movie !!"
  },
  {
    "rating": "1/5",
    "review": "Stupid plot and uninteresting characters."
  },
  {
    "rating": "1/5",
    "review": "Just terrible, it was painful to try and get through this. Violence just for violence. Who is funding all this garbage?"
  },
  {
    "rating": "5/5",
    "review": "Great action and funny movie"
  },
  {
    "rating": "4/5",
    "review": "I adore Ke Huy Quan as an actor, I would watch anything you put him in. He's funny and so freaking endearing, he seems so good, and that is rare in Hollywood. The banter between the hired killers was entertaining and the plot in general was fun. It had two issues for me. First, Ariana seemed too young for him, we don't want to see May- December romances any more. Also the timing was a little off in the movie. Hitting the right beats for dialogue and action sequences so they don't feel rushed or so slow it's clunky really makes a difference."
  },
  {
    "rating": "5/5",
    "review": "It was so cute and funny and easy to watch"
  },
  {
    "rating": "0.5/5",
    "review": "The setup had the potential to be a great film. The guy gets pulled back into his old life, defeats the bad guys, and saves the girl. But, this is no Jackie Chan movie. The stunts seemed fake and not well stitched together. The foul language and gore was unnecessary and distracted from a good plot line."
  },
  {
    "rating": "4/5",
    "review": "This was entertaining and fun in a low commitment way. I enjoyed how Quan’s stature and voice are a perfect cover for his assumed low key life that belies his character’s history. This wasn’t a hard core rom com or action flick but enough of both to make for a good date movie. Or for me who likes some of both but not too much of either to make this movie Just Right for me."
  },
  {
    "rating": "4/5",
    "review": "Both my partner and I thoroughly loved it. The characters are likeable, or scared as appropriate, and the love shown ideal for valentine's day. Loved the fight scenes by everyone and they made it work without loads of cars blowing up"
  },
  {
    "rating": "3/5",
    "review": "Decent plot, average action"
  },
  {
    "rating": "0.5/5",
    "review": "This guy can't act. I just want to wait and see the size of the regret in Hollywood's community for all those feel-good awards. This film is not understandable, even less that the one he won the award for, and was so hyped. Going to theaters in February is a nightmare."
  },
  {
    "rating": "1.5/5",
    "review": "Plagued by commitment issues, Love Hurts is an unfortunate slapdash affair that feels like it was thrown together at the last minute to meet a deadline, the emphasis leaning more towards the hurt than the love. The result is a film that feels aimless where none of the ideas come together as intended; the action, comedy and romance are too poorly intertwined and too contrasting in their contexts to result in a satisfying blend. Poor Ke Huy Quan does what he can to make this work but even he can't save this bad date; granted the film is not utterly devoid of charm, thanks to Quan's energy and the charisma he brings to the elaborate and well-choreographed if repetitive fight sequences. Sequences that feel more Bourne-like and less like a creation of the team behind John Wick; add in some horrific lighting and dreary cinematography, and the result is a film that is near impossible to tell what on earth is happening half the time. The connective tissue is flimsy, incoherent and frequently derivative, it's a poorly unexciting directorial debut from Jonathan Eusebio, that tries to do too much too fast. A tonal mush that wastes a likeable and first lead turn from Ke Huy Quan, Love Hurts amounts to what should be a breezy Valentine's comedy with some amusing, action set pieces, instead, having the ultimate charm of a breakup text."
  },
  {
    "rating": "2.5/5",
    "review": "Lots of action but not a very good movie"
  },
  {
    "rating": "5/5",
    "review": "Great movie recommend watching it"
  },
  {
    "rating": "2.5/5",
    "review": "not exactly my type of movie. I didnt think it was bad but i also didnt think it was good."
  },
  {
    "rating": "4/5",
    "review": "solid 4 stars ⭐️ because some things made it not a perfect hit of the park, however, nothing that deserves mentioning enough to soil the film. It's more, or less, that I didn't like some of the associated toxicity with the love interest in this movie and her manipulative ways being exhibited as a ‘good thing,’ where love conquers all. That message could use some revising, but I understand the overall purpose of her intentions and how that brought all the loose ends together - nonetheless, she was a bit too bad for his good guy demeanor, in my opinion."
  },
  {
    "rating": "5/5",
    "review": "It’s very entertaining with non-stop action. I think they did a great job! It’s funny, intense and motivating all at the same time! Ke Huy Kuan is a new raising action star!"
  },
  {
    "rating": "5/5",
    "review": "This movie was fantastic! Ke’s martial arts were mesmerizing, blending precision and power in every scene. His multidimensional character added depth, making the action even more impactful. I loved how his performance carried the film—definitely a standout!"
  },
  {
    "rating": "5/5",
    "review": "Love Hurt is a Beautiful Surprise – A Must-Watch! I went into Love Hurt without many expectations, but I was completely blown away! The storytelling is both heartfelt and engaging, with a perfect balance of romance, drama, and raw emotion. The performances are outstanding, especially from Ke Kuan who brings such depth and authenticity to their role. Every scene felt genuine, and the chemistry between the leads was incredibly natural. The cinematography and soundtrack beautifully complement the story, making the experience even more immersive. While no movie is perfect, this one comes pretty close, it keeps you invested from start to finish. I highly recommend it to anyone who loves emotional, well-acted films."
  },
  {
    "rating": "5/5",
    "review": "The action , comedy, and romance made it a great over all movie."
  },
  {
    "rating": "3/5",
    "review": "It was mostly fast fast fighting. Very little story line and development of characters."
  },
  {
    "rating": "2/5",
    "review": "Ever since Ke Huy Quan won the Academy Award, cementing his acting career comeback, I’ve been in full support of whatever he does. The new action romantic comedy LOVE HURTS is seriously testing that support. Marvin (Ke Huy Quan) is one of the best realtors in town. When his dark and violent past comes back and threatens the new life he’s built, he’s forced to face it head on. There is so much that doesn’t work in this movie. First, the story sucks. Marvin thought that having his face plastered around town was a good way of laying low after betraying his crime boss boba- drinking brother Alvin “Knuckles” (Daniel Wu). Marvin’s betrayal consisted of saving the life of his love interest Rose (Ariana DeBose), who comes back into his life like a wrecking ball because “Hiding ain’t living”. I have never seen two characters in a romance have less chemistry. I always try and use my big words, but not here: He feels like a “simp” and she feels like an a**hole who uses him like a tool. The side characters were a little more interesting and fun, which isn’t a good sign. Quan reunites with his GOONIES co-star Sean Astin, who actually has a good scene. Drew Scott (from the Property Brothers) has a funny scene, as does football player Marshawn Lynch. The antagonist has zero character development, which should’ve been easy to add in, since he’s Marvin’s estranged brother. The action scenes were not bad, but it felt like they were playing it safe. Even though the movie is 83 minutes long, it still feels too long. LOVE HURTS is a Valentine’s Day movie with commitment issues with half-baked subplots and a cookie-cutter ending. Just watch the trailer, that’s basically the movie."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed Ke Huy Quan's performance and loved all be stunts."
  },
  {
    "rating": "2.5/5",
    "review": "Not as good as it could've or should've been, Love Hurts is still fun & silly, with Ke Huy Quan elevating the mediocre material."
  },
  {
    "rating": "5/5",
    "review": "It was everything and more. My brother and I watched it and we were completely engaged the entire movie. If you haven’t you must see it. The film was great but the actor (Ke Huy Quan) that played Marvin was main reason for seeing it after everything he has been, including Indiana Jones. He’s always been one of my favorite actors, and this role didn’t disappoint in the least. All the work he put in and the training to do every entire stunt throughout the film. I hoping for a sequel but if not it was a perfect ending for Marv and Rose."
  },
  {
    "rating": "5/5",
    "review": "I loved this film. It delivered what the trailer advertised and more. Watched it in theatres with my partner and we were squealing with joy regularly throughout over all the cute comedy and romance. Originally we'd expected this film to have just the one romantic plot line, but the film really leans into the Valentines Day mood with two additional romantic sub-plots that are just adorable. The first action-fight scene really sets the tone for the rest, with a blend of unique visuals and oddball comedy. Very reminiscent of Jackie Chan action comedies, where the protagonist brings across an underdog vibe with a lovable and sympathetic humor. The choreography of the fight scenes is memorable, with visuals and concepts that stand out in ways that many other fight scenes in more traditional action movies lack. This isn't just a guy-punches-guy-then-kicks-other guy. The choreography makes regular use of novel props that make the action unique, and weaves in comedy throughout. There's even a fight scene that through the use of a prop incorporates a very subtle nod to the Lao Che Club fight scene from Temple of Doom. Most importantly, the action feels grounded too. Marvin Gable is a top tier fighter, but he's not an untouchable god like some protagonists in action films are. He takes a real beating, and there's a genuine sense that the stakes are real. Victory is hard earned every time. I really hope I can find Marvin's sweater somewhere to give to my partner =^_^= All in all, this movie is a great film for huge sappy romantics who also happen to love action films."
  },
  {
    "rating": "4/5",
    "review": "Lots of action and mayhem with light comedy. I would not recommend this movie for children. I really enjoyed it."
  },
  {
    "rating": "3.5/5",
    "review": "Delivers what you expect. Good action, funny quips and the good guy prevails. Just sit back and enjoy the show."
  },
  {
    "rating": "3.5/5",
    "review": "It was a fun, action packed, romantic comedy. It's an ideal Valentine's Day movie."
  },
  {
    "rating": "5/5",
    "review": "The people giving this a bad rating must not have had a sense of humor. This movie is best watched when you’re in good spirits because it’s actually funny! Movies to compare it to? Think scary movie 2 & 3, where bad things are happening but several jokes are being made the entire time. I say this was 100 times more entertaining than Deadpool. Just only watch this if you want to laugh with someone while watching fight scenes. If you’re in that mood, you’ll enjoy it! For a movie that may not have had a huge budget, they get a round of applause from me."
  },
  {
    "rating": "5/5",
    "review": "Super charming and funny movie. Full of action and would love 2 watch it again."
  },
  {
    "rating": "5/5",
    "review": "I liked the action scenes and storyline."
  },
  {
    "rating": "3.5/5",
    "review": "thought it was a fun watch. reminded me of Nobody/John Wick"
  },
  {
    "rating": "4/5",
    "review": "This action no holds bar was entertaining. The cinematography was top notch. Great cast and story too. Non-Stop fighting was totally insane. Feels like an underrated flim cuz I haven't heard much about it."
  },
  {
    "rating": "1/5",
    "review": "A bad Bruce Lee movie."
  },
  {
    "rating": "2.5/5",
    "review": "I thought the movie was a fair movie a substitute until a better one came along. The movie was enjoyable except the characters/actors that were unnecessarily killed left me disappointed and I felt resentment toward the movie with the deaths of Sean Astin's and Drew Scott's characters. They were good guys that were killed for the sake of drama but it only drew feelings of resentment. One way to discourage movie goers is to kill off characters that are favored by the audience."
  },
  {
    "rating": "5/5",
    "review": "Hilarious, Chaotic, Badass, bucketload of fun! It's a lot... A lot... of fun! \"Don't worry I can get this all cleaned up like new.\" Ke Huy Quan is badass, funny, very likeable, and has some serious moves! Just got back from seeing this in 4DX and loved it. Because after working hard, I really needed to see something fun, and this delivered in giant dining weapons for me. The people who wrote this definitely have a great sense of humour and the actors who played it out, knew what they were doing and how to deliver it. One in particular being very poetic. It worked. Unique, chaotic, enjoyable, impressive fights, and a hilarious sense of humour that made me chuckle at least 5 times. Thank you very much for that.😁"
  },
  {
    "rating": "5/5",
    "review": "I almost didn’t see this movie because of the reviews, but i decided at the last minute to watch it and omg it was so good and entertaining, i saw the just one of those days and that totally sucked and they gave it great reviews!!!! Love Hurts Great Movie !!!! I’ll see it again"
  },
  {
    "rating": "4.5/5",
    "review": "Ignore what misanthropes said about this movie. 'Love Hurts' grabbed my wife and I from the first frame and didn't let go. The fight choreography? Insane! Think Jackie Chan meets Quentin Tarantino amped up to eleven, with a visceral edge. But it's not just mindless brawling; there's a wicked blend of suspense, romance, and just the right amount of chaos. It's stylish, it's smart, and it's pure adrenaline. Highly recommended for anyone who appreciates entertainment with a pulse. PS, the bad guys are convincing, funny and appropriately evil. I will never think about boba tea the same again. 😯"
  },
  {
    "rating": "5/5",
    "review": "Yet again, another film critics hate and Audience enjoy It’s a Valentines classic such as the notebook but in the action field. Definitely worth the watch grab a bucket favorite drink and candy and get lost for a little bit. Action was well done , humor was there and storyline was pretty dang good. Whether it’s date night or a gentleman galentine’s it’s a must watch and you don’t be disappointed."
  },
  {
    "rating": "5/5",
    "review": "This action-comedy was a blast! The main character was hilarious and effortlessly cool, perfect for the holiday vibe. With festive touches, laughs, and thrilling action, it’s a must-watch for some seasonal fun!"
  },
  {
    "rating": "5/5",
    "review": "Great comedy with action"
  },
  {
    "rating": "0.5/5",
    "review": "the year has barely begun, but i already am 99% certain that this is the least compelling flick that i'll catch in a theater in 2025.  a disappointed boomer couple left the theater -- a minute or 2 before the film's end. the worst scene involves the female actor criticizing the male lead for saving her life, as if the heroine doesn't understand 2+2=4. spoiler: she also relies on her male hero to save her at the film's end -- for an oscar winner, her role is thin. it's just a nonstop fight scene; however, the audience, mostly young women, seemed to have bought tix after misinterpreting the gist of the movie, as did i. the bad guys make dumb mistakes; a screenwriting teacher once told me that this is an example of just plain lazy writing. it's actually pretty tough to write a screenplay with smart foes! & then, of course, there's the difference in attractiveness between the supposed love birds. their final scene, it's cringe. this is likely why some viewers walked out right before the tail end...? sorry, just had to get that off my chest. thanks for reading : )"
  },
  {
    "rating": "4/5",
    "review": "A lot of choreographed fighting which was cool. Ke Huy Quan is a very likable individual. I gladly support this film!"
  },
  {
    "rating": "4/5",
    "review": "Pretty good movie in the style of Jackie Chan. Quite a bit of action and humor during the action. Nice big final fight. 4 stars because I can't help comparing to Jackie and he's the master of this."
  },
  {
    "rating": "2.5/5",
    "review": "I really wanted to like this movie but it's average at best. The action choreography is outstanding. I thought Marshawn Lynch was funny and I was happy his role was more than just a celebrity cameo. Ke Huy Quan and Ariana DeBose have ZERO chemistry. He's saying he's in love with this woman but they made sure not to show them kissing until one quick scene at the end. That was on purpose because when they finally kiss it was like watching someone kiss a fish. He's 20 years older than her so that was kinda creepy and they both seemed to want to be elsewhere."
  },
  {
    "rating": "5/5",
    "review": "Very enjoyable, lots of action, fast paced, good characters and good storyline. If you are a fan of martial arts style movies, this does not disappoint."
  },
  {
    "rating": "3/5",
    "review": "The leads have a lot of charisma that does the heavy lifting to carry the film to its conclusion. The story itself is very light and you immediately ask yourself, why did it take this long for the mob to find the leads when then never really left town? The fight scenes are entertaining for the most part, very R rated with bone crushing sound and visuals that might make some people queasy. The voiceovers from the leads to move and fill holes in the plot was clunky. Entertaining for the most part while in the theater but ultimately forgettable as you make your way out of the theater."
  },
  {
    "rating": "3/5",
    "review": "It's a pretty good watch. super fast pace if that is or isn't your thing."
  },
  {
    "rating": "1.5/5",
    "review": "I have loved Ke Huy Quan since Indiana Jones and wanted to love this vehicle for him so bad. But it's so bad. Plot, dialogue, love interest with zero chemistry and 21 years his junior. His fight choreography ability is great as we saw with Everything Everywhere All At Once, but I really hope this stinker doesn't ruin his chance to get better films. I still adore Ke, but this one does not do him justice."
  },
  {
    "rating": "3/5",
    "review": "Lots of suspension of belief required for unreal protracted fight scenes but nice pace, likeable characters and overall an entertaining movie."
  },
  {
    "rating": "1/5",
    "review": "I really wanted to love this movie. I haven't gone to the theaters very often lately and this was my first time in a theater since May 2024. I was really looking forward to this movie. I walked in with a strong need to like this movie. The leads delivered what was asked of them and the action was solid, if a bit too gory at times. Ultimately the script and direction felt lost and confused. The pacing was a mess and there was too much 'tell' and now enough 'show' with respect to what remained of the narrative. The tone was all over the place. The director doesn't seem to understand storytelling and this felt like it died a death by committee. In spite of the leads' overwhelming charisma, I struggled to root for anyone or care about anyone or about anything they did or wanted. Ultimately I think that the director should be handed a few much smaller projects (maybe a play or two) and spend a few years honing the craft of storytelling before he is handed the reigns of a bigger project."
  },
  {
    "rating": "0.5/5",
    "review": "I wanted to love this but I had to stop myself from walking out a few times. The fight scenes are really fun. But it felt like they left everything else on the cutting room floor. Most of the story has to be told through inner dialogue and voice over not because it was an a clear artistic choice, but because the plot was nonexistent otherwise. They had the material there, but nothing really landed. Like people reading standup comedy instead of delivery jokes. Felt like it should have been a series of shorts but string together as a movie it was a bit aimless and a rather tedious. Most of our laughs were at the film vs. with it. Should have been a Netflix movie of the week."
  },
  {
    "rating": "3/5",
    "review": "Very enjoyable. Ke Huy Quan never disappoints. Script passes entertaining threshold. I question the age gap between Male lead and Female lead."
  },
  {
    "rating": "2.5/5",
    "review": "Love Hurts is your classic action comedy where your main character used to be a hit man, assassin or gangster but they decided to leave that life behind for one reason or another but now their past has come back to them. We’ve seen this story a million times and honestly this one is no different nor does it improve on the previous model. Love Hurts is set around Valentines Day and it used that holiday theme pretty well. So much of the story’s themes are centered around love and relationships. The holiday forces a lot of our characters to confront the difficulty in their relationships or start new and unexpected romantic encounters to a hilarious degree. And yes, this movie has a lot of funny moments which is pretty important when you have an action comedy. The action in Love Hurts is actually pretty solid as well. I really liked that the fight scenes were all pretty lengthy and each of them went through several phases of a fight and used the environment pretty well. Nothing felt cheap or lazy at all. Ke Huy Quan is phenomenal in these action scenes. Which if you watched Everything Everywhere All At Once you’re not surprised by. Some of you might be surprised to know that Quan was a fight choreographer for several movies including the first X-Men movie. One big surprise for me was Marshawn Lynch who I knew was really good at comedic acting from his role in Bottoms and literally any interview that he’s ever done. But what I was super impressed with was how well he carried himself in the action scenes. He kept up with his cast mates really well and never seemed out of place. There’s a quirky assassin poet character named Raven who was equal parts cool and equal parts eye rollingly cringe. He alternated between those two seemingly scene by scene and sometime line by line. So yeah both the action and the comedy aspects were pretty solid. Where the movie is lacking though is in it’s story and some of the one note characters that we’re given. Ke Huy Quan plays our happy go lucky real estate agent Marvin, who’s a former assassin trying to get away from his old life yet still lives in the same town as everyone who knew him as the killer that he was. For a person who wanted to escape his old life sure didn’t go far. Ariana Debose’s character, Rose, is the catalysts that sets all of these events in motion when she comes back after everyone she worked for believed she was dead. And unfortunately while her reason for coming back is made very clear it’s just not satisfying enough for me to actually give a damn. And what’s worse was that it was actually annoying as hell. And the story tries to convince me that Marvin is in love with Rose. But besides him just saying or inner monologuing it I didn’t really see that at all. Or why he would be in love with her. Their “love story” is so under developed that I’m literally wondering why he’s throwing away this new life he built for her and at the same time mad at Rose for interrupting his new life. Like legit he’s better off without you. Love Hurts tries really hard to convince you that Rose is a badass but she just comes off as a cringe. With her all white thunderbird, and her playing chicken with another car trying to pull out the killer that Marvin used to be. It all just feels like a bad cookie cutter trope. Love Hurts feels like someone wrote this script back in 2005 and are just now dusting it off to give Ke Huy Quan and Debose something to do. Like they threatened their agents unless they found a movie for them immediately and they just picked this one up out of the discard pile. So overall Love Hurts is forgettable. It’ll end up as one of the hundreds of movies you scroll by half passed midnight looking for something to watch before you go to bed and if it’s lucky one day you’ll actually press play."
  },
  {
    "rating": "2.5/5",
    "review": "Perfectly mid. Not bad, not good. Action was pretty good though."
  },
  {
    "rating": "4/5",
    "review": "The action was really really good!!! Data was unbelievable in this! And the cast especially Raven was great!"
  },
  {
    "rating": "0.5/5",
    "review": "Seemed like it was a spoof."
  },
  {
    "rating": "1.5/5",
    "review": "Too gory without the balance of being clever or suspenseful or witty. Was very excited to see what Ke Huy Quan would create but it’s not innovative. Just incredibly violent."
  },
  {
    "rating": "2/5",
    "review": "Run-of-the-mill \"person with a criminal past trying to do good-- who has an old score to settle\" plot with the inevitable shootouts with bad guys whose submachine guns somehow NEVER hit their target. And our hero gets a knife driven through his hand in the very first scene... but that doesn't seem to detract from his martial arts fighting abilities throughout."
  },
  {
    "rating": "1/5",
    "review": "The entire movie plot and action sequences were entirely unbelievable. It wasnt funny or heartwarming. The best part was the 20 second cameo of the Property Brother."
  },
  {
    "rating": "1/5",
    "review": "One of the dumbest movies Ive seen in a while. Poor story line, poor acting, bad special effects."
  },
  {
    "rating": "2/5",
    "review": "Disappointed, really liked the actors but the whole storyline needed so work. it was just ok, not a capturing movie. wouldn't really recommend."
  },
  {
    "rating": "5/5",
    "review": "It was action the whole time"
  },
  {
    "rating": "3.5/5",
    "review": "Lately haven’t seen any good movies wondering if the internet is killing the movie business like it has killed the printed newspaper and the travel agencies. I feel this is one of the better movies I have seen in a while and saying that it was not all the great but entertaining enough to keep you awake.i go to the $5 movies special on tuesdays and never see more than a dozen people in the theater sometimes I am the only patron. I feel as if they are putting out minamil effort on the movies now because they are not making money. Another dying industry."
  },
  {
    "rating": "1/5",
    "review": "\"Love Hurts\" is a romantic action comedy without romance & comedy. Ke Huy Quan has too much of a likeable on-screen presence that the story does little to make it believable that he has a violent switch in his personality. The story rather plays itself off as being cartoony, that there's little faith on-screen to care about. There's no chemistry between Ke Huy Quan & Ariana DeBose, as they both get reduced to tiresome inner dialogue of exposition."
  },
  {
    "rating": "5/5",
    "review": "short round was adorable"
  },
  {
    "rating": "4/5",
    "review": "Fun action movie, with romance and comedy. Don’t need to over complicate movies have them entertaining and enjoyable."
  },
  {
    "rating": "1/5",
    "review": "My husband and I walked out after 45 minutes. Had hoped from the trailer that this would be similar to the Jackie Chan movies we've loved through the years. Sadly, too up close and personal with the blood and the violence just for violence sake (teddy bear scene). Kitchen fight scenes had me hoping for better, but they ended up just a little off."
  },
  {
    "rating": "4/5",
    "review": "Completely entertaining!! Like watching Jackie Chan 10 years ago. Enjoyed thoroughly."
  },
  {
    "rating": "4/5",
    "review": "Easy watch with quick action. I wish they spent more time in character development but its less than 90 mins. Would def see again. Light hearted and mindless viewing"
  },
  {
    "rating": "2/5",
    "review": "I mean, if you love the actors, you'll have a decent time. The romance angles felt forced and in-your-face at times."
  },
  {
    "rating": "0.5/5",
    "review": "I was so disappointed with this, I thought it would be very entertaining."
  },
  {
    "rating": "3.5/5",
    "review": "Fun popcorn movie. Not much plot but didn’t expect there to be. The fight scenes were so well choreographed and such great fun to watch. There was really just way too many ‘F’ words… it just seemed unnecessary. Did those characters really have such limited vocabulary? Liked seeing two of the goonies back together."
  },
  {
    "rating": "3.5/5",
    "review": "Fun but not chemistry with the love interest was not strong."
  },
  {
    "rating": "5/5",
    "review": "This is the type of comedy action my family and I love and enjoy to watch! 10/10 + claps for leading star Ke Huy Quan!!"
  },
  {
    "rating": "4/5",
    "review": "Love Hurts title says it all throughout the entire film. Definitely demonstrated vibes of Nobody film with Ke Huy Quan trying to make a new start in life, while one kind gesture of his past just won't disappear and continues to haunt his everyday lifestyle."
  },
  {
    "rating": "2/5",
    "review": "Data should of stayed setting boobytraps no story all bad, bad acting too much camera moving to wonder your eyes from the horrible acting what a waste should of went to go see Heart Eyes instead"
  },
  {
    "rating": "0.5/5",
    "review": "Really bad movie. No real storyline other than the same ol blood, guts, fighting, pointless dialogue."
  },
  {
    "rating": "4/5",
    "review": "Good story with lots of action and a happy ending"
  },
  {
    "rating": "2/5",
    "review": "Not what I was expecting. There was a lot of fighting, killing, blood and a couple gruesome kills."
  },
  {
    "rating": "2/5",
    "review": "It really could do without so much profanity. Do people not know how to talk anymore."
  },
  {
    "rating": "5/5",
    "review": "Its very good movie funny and action movie"
  },
  {
    "rating": "1/5",
    "review": "Too graphic. Too much profanity. Too unbelievable"
  },
  {
    "rating": "2/5",
    "review": "Entertaining but I couldve waited to watch it on streaming. Would like to see Ke Huy Quan in more movies with better scripts."
  },
  {
    "rating": "3/5",
    "review": "I thought this movie should have gotten a better rating. It was kinda cute and my son and I enjoyed it."
  },
  {
    "rating": "1/5",
    "review": "Pointlessly gorey...overdose of unnecessary profanity...stupid plot...bad acting. This imovie is only for the disturbed."
  },
  {
    "rating": "3/5",
    "review": "Fun movie with a charismatic lead. Surprised me."
  },
  {
    "rating": "5/5",
    "review": "Fun, mindless entertainment. A bit cheesy, but so what?"
  },
  {
    "rating": "1/5",
    "review": "It's not that funny. It's very dark humor and way too much killing. Wasn't what I wanted to see for Valentines forsure. Do not recommend this movie."
  },
  {
    "rating": "5/5",
    "review": "This is an entertaining movie with plenty of laughs and great fight scenes. Don't listen to the critics. Movies like this are just for a fun ride, not to be picked apart and taken too seriously. I highly recommend watching Love Hurts because you are guaranteed to laugh."
  },
  {
    "rating": "5/5",
    "review": "Fun movie lots of action"
  },
  {
    "rating": "2/5",
    "review": "the love connection was really not there. I dig the fight scenes tho"
  },
  {
    "rating": "0.5/5",
    "review": "I really wanted to like this movie. Ke Huy Quan is a phenomenal actor, but this movie has no redeeming features."
  },
  {
    "rating": "4/5",
    "review": "Loved the comedy-action mix this movie had to offer. The plot was a little weak, but it was a fun watch!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Love the action!!!!"
  },
  {
    "rating": "3/5",
    "review": "Was a very nice movie but it was way too short! The movie was only 1 hour and 23 minutes!"
  },
  {
    "rating": "5/5",
    "review": "wasn't anything I thought it would be, which made it great! It was funny and interesting"
  },
  {
    "rating": "0.5/5",
    "review": "I found a movie very cheesy. It had enough profanity used throughout the movie to fill a semi truck trailer."
  },
  {
    "rating": "1/5",
    "review": "this movie made zero sense and rushed through so many important plot points."
  },
  {
    "rating": "3/5",
    "review": "A cheesy action flick, with sparse moments of real drama. The scene between the older brother and the surrogate feels like a stand-out. The action was fun, if not a bit contrived for the finale -- obvious fodder to give hero a hero's moment. All of the love arcs feel shoe-horned and contrived as well to fit for a V-Day release. Overall, the film was a fun distraction, the supporting cast made the film for me really."
  },
  {
    "rating": "5/5",
    "review": "Excellent action flick. Creative characters. Good sprinkle of love throughout."
  },
  {
    "rating": "4/5",
    "review": "Action packed love movie w plenty of twists. I'll see it again!"
  },
  {
    "rating": "0.5/5",
    "review": "The movie sucked from start to finish!"
  },
  {
    "rating": "3.5/5",
    "review": "Very well choreographed fight scenes. I enjoyed the story line."
  },
  {
    "rating": "1/5",
    "review": "So glad I saw this on a \"discount day\" at the cinema as I had to walk out after the first 20 minutes. Don't waste your money or time. If you like lots of mindless CGI \"human cartoon\" fighting with not much of a decent script or acting, then at least wait until you can see it for free or when it streams on your subscription....or if you still have your dvd player, wait \"til the library gets their copy\" and see it for free."
  },
  {
    "rating": "5/5",
    "review": "nice little 80 minute movie"
  },
  {
    "rating": "5/5",
    "review": "This is a cute cheesy comedy full of action. It was a good enjoyable movie."
  },
  {
    "rating": "2/5",
    "review": "First of all, Ke Huy Quan is a gem and national treasure. I will not be accepting notes on this point. However, even he couldn't save this film. I will say the visuals are very pleasing and the choreography exciting, but that's about all I liked about this film. The characters storylines were disjointed, the chemistry between Ariana DeBose and Ke Huy Quan is lacking, and it felt like it ended, but didn't resolve. I really wanted to like this movie because its Ke Huy Quans first leading role, but this was not it. I didn't hate it, but I won't be watching it again."
  },
  {
    "rating": "3/5",
    "review": "It starts out strong but gets conventional very quickly."
  },
  {
    "rating": "3.5/5",
    "review": "A humorous action comedy. Ke is delightful as always in my opinion. But a few of the supporting actors didn't really hold up. Some of the roles felt wooden and some of the movie felt predictable. Nothing game changing, but there was still a good amount of entertainment to keep me watching."
  },
  {
    "rating": "3.5/5",
    "review": "I thought it was fun! It had some moments for sure that didn’t work. Try to watch it without expectations for it to be good or bad and just enjoy it for what it is."
  },
  {
    "rating": "3.5/5",
    "review": "7.3/10—fun movie. I’ll watch anything with Ke Huy Quan at this point. Shout out to Marshawn Lynch as well."
  },
  {
    "rating": "4/5",
    "review": "Hilarious good film. A quick 85 minutes that moves at a good pace. It's a nice afternoon film to watch that is entertaining with good action and comedy. Highly recommended."
  },
  {
    "rating": "2/5",
    "review": "What could have been a fun movie is one that doesn't catch on at all for me. It is bad but not bad enough to be good"
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved seeing Ke Huy Quan and Sean Austin in a movie together. I found it entertaining and even though the plot wasn't the best. I wondered what two Oscar winners were doing in this kind fare...but fun fare, nonetheless."
  },
  {
    "rating": "3/5",
    "review": "I think it's a movie worth watching on an evening when you just want something lighthearted and not challenging. I enjoyed it. It made me laugh on several occasions and kept me engaged. It is much better than the 19% aggregate critics rating. The 61% from the audience reviews is a more accurate representation."
  },
  {
    "rating": "2/5",
    "review": "I love Ke Huy Quan and will watch ANYTHING he is in… but aside from my love for this actor, the film just wasn’t good - at all. Nothing kept me engaged beyond the initial fight sequences or the opening of the film that came with copious amounts of that Ke charm. Then the film just dragged on… I daydreamed a lot through it. Really love Ke; don’t love this movie. I don’t even like it, even as good as it was to see him in a starring role, I wish it were in a different movie."
  },
  {
    "rating": "1/5",
    "review": "Stupid story and Ke Huy Quan's Donald Duck voice didn't help."
  },
  {
    "rating": "5/5",
    "review": "For not the first time, I see my taste is way different than the critics. We loved this movie! If you like kung fu action, if you like action/comedy movies like Mr. and Mrs. Smith and True Lies, this is a good one for you. Start to finish, lots of great fight scenes and romantic plot elements. And, yes, that is HGTV's Drew Scott for no reason but killing it."
  },
  {
    "rating": "3/5",
    "review": "The movie’s plot is carried by all its side plots. The main actors have no chemistry with each other at all. While the action scenes are entertaining and well coordinated, that is overshadowed by the fact that the two leads have no spark, and that no real connection is made with audience when it comes to their “love” story. What should have been a great film is maimed by a limp main plot and terrible lead casting. Disappointing, truly."
  },
  {
    "rating": "5/5",
    "review": "This was fun to watch! I love Ke Huy Quan!"
  },
  {
    "rating": "1/5",
    "review": "This movie is one of MANY that has me very thankful for the FAST FORWARD button! After watching the trailer, I was really looking forward to seeing the movie... but was I EVER disappointed! There wasn't any story to speak of - just a great deal of Kung Fu fighting, LOTS of BLOOD and unnecessary violence wrapped around some kind of plot that's been done over and over to death. How many times did he have to say \"I just want a normal life\"? Very lazy writing - in a script that could have been 3 pages long, with a LOT of \"copy, paste\". Thank you FAST FORWARD!!"
  },
  {
    "rating": "2/5",
    "review": "I wanted to like it more but this movie took itself more seriously at times than it should have."
  },
  {
    "rating": "4.5/5",
    "review": "This was a fun and funny romp, packed with action. We really enjoyed it! And it was the perfect Valentine's date night movie that entertained and blended both of our more feminine and masculine film interests. It was also nostalgic for this Gen-Xer to see Ke Huy Quan back in the spotlight. Worth a watch!"
  },
  {
    "rating": "1.5/5",
    "review": "Only occasionally funny with some of the worst writing and acting I've ever seen. 10 minutes after the movie started, I knew I'd made a bad choice."
  },
  {
    "rating": "3.5/5",
    "review": "Acting from Ke Huy Quan with some great and entertaining fight choreography make up for the lack of storyline. A fun watch."
  },
  {
    "rating": "5/5",
    "review": "The movie was a less violent John Wick. There was a lot of action and not overcomplicated storyline. It was violent at times, but nothing too crazy. I would definitely run out and watch the sequel if it was made. It was an action movie made for the family and valentine's day."
  },
  {
    "rating": "0.5/5",
    "review": "This was so bad I could not watch the whole movie."
  },
  {
    "rating": "3.5/5",
    "review": "It was good. Marshawn was my fav in this lol"
  }
]