{
  "movie_name": "Star Wars: Episode II - Attack of the Clones",
  "reviews": [
    {
      "rating": "2.5/5",
      "review": "Attack of the Clones is easily the worst of George Lucas’ Star Wars films. Plagued by wooden dialogue, a forced romance, aged CGI, and countless other flaws that critics have pointed out for decades, it struggles on many fronts. However, the core story of Palpatine’s political manipulation and Obi-Wan’s detective arc offer compelling threads, supported by strong world-building. Ultimately, it’s not a good film—but I still look at it fondly, maybe just out of nostalgia"
    },
    {
      "rating": "3.5/5",
      "review": "Better action and fight scenes compared to the first movie."
    },
    {
      "rating": "3.5/5",
      "review": "\"Star Wars: Attack of the Clones\" delivers plenty of exciting action, boosted by CGI that, while impressive in scope, sometimes leans too heavily into video game-like visuals that can feel awkward in a live-action setting. Hayden Christensen’s performance as Anakin Skywalker is a bit questionable, yet it oddly fits the character’s conflicted nature. The romantic subplot is famously awkward—so much so that it becomes oddly endearing in its own way. Despite its flaws, the film stands out as an exciting and memorable chapter in the Star Wars saga, offering not just adventure but also a surprisingly meaningful and spiritual message that gives the story added depth."
    },
    {
      "rating": "2/5",
      "review": "Other than some good moments here and there, this is a very weak movie."
    },
    {
      "rating": "3.5/5",
      "review": "Improved spectacle in a blur that sensationally deepens the lore and satisfy fanatical excitement with manageable emotional touch, whilst much of the deliverance comes across as ignorant when effortlessly glancing at the screenplay’s processing characterization. (B)"
    },
    {
      "rating": "3.5/5",
      "review": "Despite some poorly written romance dialogue, \"Star Wars: Episode II - Attack of the Clones\" excels in worldbuilding and action in the latter half. Additionally, it cleverly constructs the origins of the Galactic Empire."
    },
    {
      "rating": "3/5",
      "review": "It'd probably be better if they waited 5 years for cgi to improve. I must applaude them for actually using color instead of the Disney technique of making everything greyandblack. The 3rd worst starwars though, better than episode 8 9"
    },
    {
      "rating": "2.5/5",
      "review": "Not as good as the first but it is still good idc"
    },
    {
      "rating": "3/5",
      "review": "For the sake of nostalgia I love this movie, but objectively I think this might be the weakest of the original six films."
    },
    {
      "rating": "5/5",
      "review": "Una buena película sin lugar a dudas"
    },
    {
      "rating": "3/5",
      "review": "Leaps and bounds above The Phantom Menace but still not a fantastic film. Stunning visuals, magical soundtrack and audio mix, and Yoda finally gets to display his Jedi prowess and justify his reputation. I didn't believe the Padme-Anakin romance at all though (which was pretty much the point of the whole film)."
    },
    {
      "rating": "3.5/5",
      "review": "A film that has aged well, nice tension and details, action packed too."
    },
    {
      "rating": "2/5",
      "review": "A second film in a series often doubles down on the first film; unfortunately George Lucas, clearly a man in desperate need of someone to tell him 'No' by this stage, doubles down on all the wrong things. Even more CGI, that's often even more badly executed; a meandering plot and embarrassing screenplay that scarcely bothers to develop characters; whole sections where almost nothing happens, and when things do happen, it's unclear why it's happening at all. Worst are the scenes between Padame and Anakin, which seem to be written by a 12-year old boy with an underdeveloped understanding of human relationships. The final 30-minutes or so are passably enjoyable, with a degree of peril, visual flair and a much needed sense of fun amidst all the po-faced nonsense. But it's too little, much too late to save a film that scarcely works on any level."
    },
    {
      "rating": "5/5",
      "review": "Even More Epic Music, Even Better Fight Scenes. Dooku… Say No More"
    },
    {
      "rating": "3/5",
      "review": "A fun movie to watch if you can get through the bland dialogue and wooden delivery from most of the actors. A missed opportunity to develop a tragic storyline for Anakin, but looking back at the prequel trilogy now is a much different experience after having endured the Disney sequel garbage."
    },
    {
      "rating": "2.5/5",
      "review": "Improved from episode 1. There is more drama which adds to the story, and adds a little bit of intrigue."
    },
    {
      "rating": "5/5",
      "review": "Great characters but the plot meanders a little much."
    },
    {
      "rating": "3.5/5",
      "review": "It was another good Star Wars movie. It wasn't the best, but it wasn't bad. (for the majority of it)"
    },
    {
      "rating": "5/5",
      "review": "I saw these movies when I was in High School and I really liked them. Now as I am older, I love them! Watching the disney Star Wars movies really give you a good comparison to the magic that these movies and the originals had that disney will never duplicate."
    },
    {
      "rating": "3/5",
      "review": "I gave this movie and The Phantom Menace the same rating even though this movie is better. It doesn't have a fight scene like TPM, but it flows way better and does have engaging aspects about it. One thing I didn't mention in my review about TPM is the dialogue. My god who ever chose the wording... *cough cough* George Lucas *cough cough*...... they should be ALMOST be charged for a crime. It is unsettling how cringe some of these scenes make you feel. Especially when they do something abnormal and follow it up with weirdest line. The characters and plot do help this movie a lot though. We get the first fight between Anakin and Obi Wan vs Count Dooku, as well as Count Dooku vs Yoda. Very exciting to see, though I wish the environment during that fight was a bit more bright but I understood the tone they wanted to set. Anyways, this movie has some rough parts to it but like MOST Star Wars films, you will find something to enjoy out of it."
    },
    {
      "rating": "5/5",
      "review": "Once again, its poor dialogue is what made this movie less than perfect, but it is still an amazing movie. This movie was so much fun to watch, and I'll always love it. I highly recommend it!"
    },
    {
      "rating": "5/5",
      "review": "I hated these movies when they first came out because of the over reliance on CGI. Now comparing them to our current CGI action movies I enjoy rewatching it far more because the story is slower paced so you can feel like you’re really there living each moment."
    },
    {
      "rating": "3.5/5",
      "review": "It's good , the movie show's the clone wars and how clones are made and an adult Anakin who became a Jedi in the end is cool ."
    },
    {
      "rating": "3.5/5",
      "review": "John Williams is a certified legend!"
    },
    {
      "rating": "3/5",
      "review": "Not as good as its predecessor, but still good."
    },
    {
      "rating": "3.5/5",
      "review": "in my opinion I think phantom menace is more entertaining this movie could've been a lot more to me I still love star wars I would rate this a 87%"
    },
    {
      "rating": "1.5/5",
      "review": "This movie is more forgettable than episode I, but mildly more entertaining. Except it lacks a good thrilling scene such as Duel of the Fates."
    },
    {
      "rating": "3.5/5",
      "review": "De las más flojas de Star Wars, el problema principal es el intento fallido de hacer una cinta romántica, porque los momentos más lentos son esos y salen muy forzadas. Obi-Wan es de lo mejor de la peli, avanza la historia con una investigación para descubrir una conspiración contra la Senadora Amidala. Pero vale completamente la pena."
    },
    {
      "rating": "5/5",
      "review": "Great."
    },
    {
      "rating": "3.5/5",
      "review": "Definitely better than the phantom menace and is worth watching."
    },
    {
      "rating": "4/5",
      "review": "It gave us some of the best memes to date and was far ahead of its time for CGI and special effects just like the rest of the trilogy. Despite the writing for Anakin being cringeworthy at best, it serves as a good backstory for what led to his change. Finally the choreography, beautiful, Disney take notes and stop making the light sabers glow they’re too heavy and you can’t make anything good out of the fights…but first fix your writing!"
    },
    {
      "rating": "5/5",
      "review": "Another prequel that like its predecessor, was way ahead of its time."
    },
    {
      "rating": "4/5",
      "review": "This movie deserves more respect. Everyone complains about Haydens acting, but trying to convey about 8 emotions that are ever conflicting, I think he did a damn good job. People think the sand line is stupid and awkward, but it's because it reminds him of his life as a slave, it's not just about the sand (although I do love the memes). I can't describe how much I loved this movie as a kid, and was beyond stoked we got a new, nice clean, bounty hunter that was Bobas FATHER! I'm gonna get hated on, but I think this is the 2nd best of the 6 movies after Revenge of the Sith."
    },
    {
      "rating": "3.5/5",
      "review": "No way near as bad as people make it out to be. Although not perfectly executed, Anakin’s character development works for the most part and gets its point across. A lot of what makes Star Wars great is still present here. Epic world building, as well as another unbelievable John Williams score makes it worth a watch alone. The movie also introduces one of the best things in Star Wars, the clone troopers!"
    },
    {
      "rating": "3/5",
      "review": "No es mi favorito pero el final es épico"
    },
    {
      "rating": "5/5",
      "review": "It’s a masterpiece, And for the time it was perfect perfect everything down to the last minute detail."
    },
    {
      "rating": "3/5",
      "review": "The worst Lucas film for sure. Every time I try to watch it I get to where Anakin starts talking about sand and shut it off. Mcgregor is the best part. Truly wish they had more practical effects. Everything just looks fake"
    },
    {
      "rating": "2.5/5",
      "review": "This is the worst Star Wars movie that George Lucas was involved in. The romance is stretched, the fight choreography is pretty good. As is George Lucas tradition he nails the final act. The first two acts are stretched and the dialogue is excruciatingly bad, however, I really don't like sand, it's coarse, rough, irritating, and it gets everywhere."
    },
    {
      "rating": "2/5",
      "review": "After the dissapointment of The Phantom Menace there still remained a slim gimmer of hope that Attack of the Clones might salvage this prequal trilogy. Instead, in some ways its actually worse. It is a movie against which we can level the most fatal criticism - its boring. It drags on for over 2 hours, with the plot moving from jedi detective story, to teenage romance to a confrontation with the least convicing enemy in Star Wars history. Again, the opening scrawl should be warning enough. The enemy in this case being a seperatist movement, looking to break away from the Republic. How this is different to the Rebellion looking to break away from the Empire in later movies is never really explained. Some attempt is made to remove elements of the earlier movies which did not work. Anakin as an annoying child is replaced by Anakin as an annoying teen. The much hated Jar Jar Binks is sidelined into a minor role, where he can be blamed for inadvertently causing the rise of the Empire. As in the previous film though, the dialogue is atrocious and the story lacks any sense of pace or drama. CGI takes over much of the action with CGI droids fighting CGI clones, its more like watching someone play a Star Wars video game. It's hard to feel invested in any of the characters. This is definitely one of the worst Star Wars movies ever made. It fails on every level and its most impressive legacy is that it subsequently led to the sale of so many toys, cartoons and video games based on something so fatally flawed."
    },
    {
      "rating": "5/5",
      "review": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "Again - one of my favourite ever films - Anakin and Obi-Wan are hilarious and the lightsaber combat is superb. Visuals aren't brilliant and the Anakin and Padme dialogue is average at best and makes me want to cringe - but seeing Anakin slowly being manipulated is well done and Hayden's and Ewan's acting is great. The Battle of Geonsis is one of ky favourite ever films in anything. Definitely worth a watch - ignore the critics - they don't know what they are talking about."
    },
    {
      "rating": "2.5/5",
      "review": "This is one of my most hated star wars movies also again stale cgi i've seen better"
    },
    {
      "rating": "4.5/5",
      "review": "A great classic film that leads into Star Wars III. While at times, funny moments like “I hate sand, it gets everywhere” are hated on, this has few weak spots."
    },
    {
      "rating": "4/5",
      "review": "The romance third is bad. The kamino third is good. And the epic ending is good. With 2/3 of this movie being well done, it’s definitely a step up for Phantom Menace."
    },
    {
      "rating": "3/5",
      "review": "This Movie is the worst of all the originals but beats all the sequels."
    },
    {
      "rating": "5/5",
      "review": "It's clonin time"
    },
    {
      "rating": "3.5/5",
      "review": "Where this movie becomes weak is in how it is used as a building block for the rest of the franchise. While EP 1 built up the main story, and started the franchise, this movie focuses on starting the main conflict of the saga. We see glimpses of Anakin's fall to the dark side, and we see the Jedi order becoming weaker and weaker. the third act of the movie is one of the best in any star wars movie. Everything about the Battle of Geonosis was perfect. The movie spent too much time building up to the third act, and building up the main conflict of the saga, but it was still an entertaining watch and a great movie. Definetly the weakest of the 6 movies, but still a great one. Much better than the sequel movies."
    },
    {
      "rating": "4.5/5",
      "review": "Awesome film I just do not really like the romance between Anakin and Padme."
    },
    {
      "rating": "2/5",
      "review": "Yeesh. That's all I'll say...."
    },
    {
      "rating": "4.5/5",
      "review": "Dialogues are not very good, but it is a fun, thrilling movie. Good action and plot. Great music from John Williams, as usual."
    },
    {
      "rating": "3/5",
      "review": "Direção: Ok Atuação: Ok Roteiro: Ruim Caracterização: Bom Soundtrack: Bom"
    },
    {
      "rating": "4.5/5",
      "review": "Always liked Attack of the Clones. The least talked about in the Prequel Trilogy"
    },
    {
      "rating": "4/5",
      "review": "I would say fairly better than Phantom Menace and love how we are finally introduced to The Clone Wars."
    },
    {
      "rating": "3.5/5",
      "review": "Rare occurrence where the audience reviews are lower than the critics."
    },
    {
      "rating": "5/5",
      "review": "Again, an iconic movie that thousands grew up with, I loved this growing up and would happily watch it again, even with the cheesy dialogue."
    },
    {
      "rating": "4/5",
      "review": "Excelente película, lo mejor de esta es el desarrollo de Anakin y como surgen los nuevos Sith."
    },
    {
      "rating": "3/5",
      "review": "Better than Episode I, but still very weak. The CGI is really abused, I think Lucas wasted another opportunity to do a great movie here."
    },
    {
      "rating": "5/5",
      "review": "can't let the gang know that i f*ck with this film"
    },
    {
      "rating": "2.5/5",
      "review": "It’s fine. Look I don’t hate it, but it is a baffling follow up to the Phantom Menace. The lightsaber and Space battle were cool, but everything else about the movie just felt slow, and it takes a while for anything interesting to happen. Most things just felt unnecessary. I didn’t really care about Anakin and Padme’s plot lines all that much and the story didn’t necessarily add much to the trilogy."
    },
    {
      "rating": "4.5/5",
      "review": "While definitely host to some awesome and epic action scenes/battles, it does feel like it's a little bit let down by the romance scenes. 9/10 -TNTDude It's a good film, the romance between Padme and Anakin isn't great, but overall a very good film still. 9.5/10 - WoodstockGamer7"
    },
    {
      "rating": "4/5",
      "review": "Better than the phantom menace"
    },
    {
      "rating": "2/5",
      "review": "Pretty bad, with an I don't like sand love story. The reason it isn't worse than the baffling Jar Jar Binks is the stuff it doesn't have."
    },
    {
      "rating": "2/5",
      "review": "Perhaps the weakest linck in the chain."
    },
    {
      "rating": "2/5",
      "review": "Slight improvement over episode 1 but still leaves a lot to be desired"
    },
    {
      "rating": "0.5/5",
      "review": "Worst Star Wars movie of them all (even the sequels are better)"
    },
    {
      "rating": "3/5",
      "review": "odd dialogue, but an interesting plot. 6/10"
    },
    {
      "rating": "1/5",
      "review": "The very worst of the Star Wars Skywalker series of movies, in my opinion. The horrendous dialogue between Anakin and Padmé as they “fell in love” made it hard to believe that Luke and Leia were ever actually conceived."
    },
    {
      "rating": "3/5",
      "review": "The second episode had it's moments but the acting... Yikes. The 'love story' between Anakin and Padme is so forced and unconvincing that it makes it very awkward to watch. The only redeeming parts of this one are the Jedi action sequences."
    },
    {
      "rating": "5/5",
      "review": "I don’t care what anyone says, this middle child of the prequels is gold. I’ve loved it since 2002 when I saw it as a 25 year old. Pure George Lucas here. Thank the Maker!"
    },
    {
      "rating": "3.5/5",
      "review": "Some of the worst dialogue in Star Wars. How does Padame fall for Adakin?"
    },
    {
      "rating": "5/5",
      "review": "It’s no secret that I love the prequels. Yoda dueling Dooku made everyone in theaters absolutely lose their minds in 2002! The “I don’t like sand” scene is much deeper than you think when you actually think about where Anakin and his mother came from in episode 1. I love how this movie blends the awkwardness of a teenage boy around the girl he loves and the start of his descent into the Darkside. Beautiful film."
    },
    {
      "rating": "3.5/5",
      "review": "There are certainly negatives, one example how whiney Anikin is. But the movie is still likeable despite that. Pluses are Portman, McGregor, and seeing Yoda fight is something people waited decades for and was not a disappointing scene. Using feet as the sample for the clones was a nice touch as well."
    },
    {
      "rating": "5/5",
      "review": "Loved it made Star Wars better"
    },
    {
      "rating": "4.5/5",
      "review": "Cant go wrong with the clones"
    },
    {
      "rating": "3/5",
      "review": "Like the Phantom Menace, there are positives and negatives to take from this film. I feel the CGI is incredibly overdone in places which takes away the possibility of reality. However, the storyline is good and there are iconic characters who crop up for the first time like Count Dooku and Jango Fett."
    },
    {
      "rating": "5/5",
      "review": "Great movie, dont even want to hear the haters. There is some CGI issues and can be cringy, but I don't see why this is considered the worst of the prequels by some."
    },
    {
      "rating": "2.5/5",
      "review": "This is by far the worst movie in the prequels. Dialogue is subpar writing could be better directing well done character development is well done visuals, especially for the time top-notch one of the largest light saber battles in Star Wars. There’s action there’s romance. There’s loss grief growth with characters. A good blend of the original trilogy with new concepts. I also liked the police style that was introduced with the Jedi, especially in the beginning of the movie. Definitely not the worst Star Wars movie, but not remotely close to being the best. 2.5/5"
    },
    {
      "rating": "5/5",
      "review": "The character arc for Darth Vader is going really strong with this one. Hayden did his part with the character nuances."
    },
    {
      "rating": "5/5",
      "review": "Another underrated Starwars movie, CGI at some parts isn't good but we get new awsome characters, like Jango Fett and Count Dooku."
    },
    {
      "rating": "5/5",
      "review": "George Lucas has done it again! Building more on this universe and setting making it more interesting intricate mace windus purple creating more depth to lore about lightsabers just so much cool stuff in these"
    },
    {
      "rating": "3/5",
      "review": "Low point of the prequel trilogy but still has some great moments"
    },
    {
      "rating": "4.5/5",
      "review": "OVERHATED. ANAKIN IS AWESOME, OBI-WAN IS AWESOME, PADME IS AWESOME. THEY'RE ALIENS, THEY'RE NOT GOING TO SPEAK THE SAME WAY AS US. ALSO, IT'S STILL A WONDERFUL STORY. THANKS TO YOU GUYS THAT HATED ON IT. AND NOT JUST THAT, BECAUSE OPINIONS ARE OKAY TO HAVE. BUT WHEN YOU SEND THREATS TO GEORGE AND THE CAST, SCREW YOU. BECAUSE NOW WE HAVE THE SEQUELS, IT'S YOUR FAULT, GUYS."
    },
    {
      "rating": "3/5",
      "review": "Not bad but still watchable 6/10"
    },
    {
      "rating": "3/5",
      "review": "While not even approaching the heights of the original trilogy the Star Wars prequels are clearly making attempt to be respectable, as Star Wars: Episode II - Attack of the Clones is a major improvement over its predecessor in many fields, namely that of impactful antagonists and an at least partially fleshed-out story"
    },
    {
      "rating": "3/5",
      "review": "Has its good scenes, and has its bad ones too. A mediocre Star Wars movie overall."
    },
    {
      "rating": "4.5/5",
      "review": "Excelente película, un desarrollo de personajes muy bueno Ya envejecido muy bien"
    },
    {
      "rating": "4/5",
      "review": "Contains some 'cheesy' dialogue but contains enough action and adventure to offset it. Does a good job of developing the characters from the first film."
    },
    {
      "rating": "4/5",
      "review": "After watching the sequels I have a new appreciation for the prequels."
    },
    {
      "rating": "3/5",
      "review": "Poor dialogue and low chemistry add a touch of cringe to this classic but watching Yoda pull out his saber and flip a switch we didn't know he had made audiences SCREAM with excitement. It's as if we were waiting for this moment since 1980 (The Empire Strikes Back) but never knew it."
    },
    {
      "rating": "5/5",
      "review": "Better than any SW movie Disney has ever made other than Rogue One."
    },
    {
      "rating": "3.5/5",
      "review": "While definitely one of the slowest entries in the saga. Episode 2 still has some pretty great set pieces and some interesting implications to the saga as a whole. Sadly it takes a while for things to get interesting, but seeing hundreds of Jedi ignite their lightsabers ready to battle will never get old."
    },
    {
      "rating": "3/5",
      "review": "The prequels had a good and interesting plot but a rough execution."
    },
    {
      "rating": "4.5/5",
      "review": "This movie is now incredible because the sequels are so terrible"
    },
    {
      "rating": "2.5/5",
      "review": "Good and bad. Not sure if the this or the Phantom Menace is better/worse."
    },
    {
      "rating": "3.5/5",
      "review": "La primera parte de la mitad de la película está muy lenta, entiendo que es para dar introducción al desarrollo de la película y avance de la historia que ya conocemos (en la trilogía pasada) pero lo hicieron un poco lento, para la otra mitad de la película está muy buena haciendo un buen desarrollo y cierre."
    },
    {
      "rating": "3/5",
      "review": "Better than the first one. Special effects and cinematography is GREAT. Some acting parts are kinda weird, and make me cringe, the movie itself isnt bad, nor is it really good, its like 7/10 for me. The movie is kinda like a filler episode in a series, like... kinda boring movie, if you were to skip this movie and go straight to Revenge of the Sith, from The Phantom menace, only thing that you'd miss is that theres a war and Anakin and Padme are together, thats all. Just like in the first movie, im just too bored to google what the Clone Wars is, and who the Jedis are fighting off, im an casual viewer, and for a movie being great, it shouldnt be complex. And yes, i know George just wants to tell his story, but still, i think there wouldve been better ways to pull this movie off, and by saying ''better ways to pull this off'' i mean to keep the whole plot, with the Kamino etc. but change the end a little bit."
    },
    {
      "rating": "5/5",
      "review": "George lucas wisdom becomes more evident to me with every passing year"
    },
    {
      "rating": "3.5/5",
      "review": "I mean, it's alright, like"
    },
    {
      "rating": "3.5/5",
      "review": "Episode II is fun, it still have all the problems of Episode I, but more entertaining, and the clone wars serie also made this film more relevance"
    },
    {
      "rating": "5/5",
      "review": "An epic romance story that sets up the downfall of anakin perfectly. Also sets up the creation of the clone army and the clone wars perfectly. Also epic first time showing yoda in battle. Epic movie"
    },
    {
      "rating": "5/5",
      "review": "Great movie in my opinion. I do like the anakin and padme scenes because it shows Anakin expressing his true feelings to Padme and showing her the real him. It builds a great bond between the two and it makes the movie better. It also introduces us to the clone army which was secretly being built the the kaminoens under the order of fallen Jedi master Sifo dias. It’s a great movie with action, romance, and suspense and is a much watch"
    },
    {
      "rating": "5/5",
      "review": "We were so lucky to have 3 more movies from Lucas himself before Disney took over. I appreciate his prequels more and more all the time. \"You wanna buy some death sticks?\" \"You don't want to sell me death sticks.\" \"Uh, I don't wanna sell you death sticks.\" \"You want to go home and rethink your life.\" \"I wanna go home and rethink my life.\" Loved how snarky and awesome Obi Wan was in this whole movie. He finally is the Jedi and not the Padawan."
    },
    {
      "rating": "3.5/5",
      "review": "Cringe dialogue but cool arena fight scene"
    },
    {
      "rating": "5/5",
      "review": "Star Wars: Episode II Attack of the Clones, is a film that most people like to judge base on its dullness or a split narrative. Continuation of corruption, dragging peaceful people to an unnecessary war, young (forbidden) love, and your space protectors being put into combatant generals position for the 1st time ever. All while, the main bad guy behind the scene is orchestrating all of it with pawns for his own rise to power. So much to fit into a movie, that at first glance people forgot, it’s the start of a major war with a 10 years gap from Episode I. All aspects leading into the war, didn't get the screen time it deserved but overall well executed for those who don't like to be spoon fed every detail, but give glimpses and leave the audience’s imagination take the wheel as the war carries on."
    },
    {
      "rating": "3.5/5",
      "review": "Still a great movie. It would be an Oscar movie in 2024."
    },
    {
      "rating": "4/5",
      "review": "Very good movie, a step up from The Phantom Menace."
    },
    {
      "rating": "4/5",
      "review": "I love this move. Great origin story on the Clone Wars. Great Star Wars content. I know some people don't like the dialog, but most of it fits and the story makes up for it. Clone Wars series helps make it better."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is very important for the following events in the franchise. One of its biggest strengths is the worldbuilding because you see the main characters visiting very different planets with unique lifeforms. for example, there's Naboo, Coruscant, Geonosis, Tatooine, and Kamino which all hold a large significance in the movie. As much as the scenes between Padme and Anakin have very bad dialog, the ones with Obi-Wan are very well written. There are also key moments where we see Anakin's fall to the dark side approaching."
    },
    {
      "rating": "4/5",
      "review": "This movie is one of the most widely hated and mocked movies out there... Personally, I think it's not that bad. Sure Anakin is very cringe at times and his relationship with Padme is awkward at best.... But, can you really complain about a Awkward Cringey Teenage character being portrayed as an awkward cringey Teenager? I saw this movie in theatres when I was in Grade 6. And I remember thinking one thing back then... \"OH MAN OBI-WAN IS SO COOL!!!\" Yeah, Obi-wan's story arc in this movie, his whole... detective story is done pretty well in my opinion, And his confrontations with jango are pretty cool scenes... Is this movie a master piece? No. Is it stupid at times? Yes. Is it one of the worst movies ever made? NO. I think it's underrated. I may be one of it's few defenders but hey, someone's gotta root for the underdog!"
    },
    {
      "rating": "3.5/5",
      "review": "Forgettable Episode But Yoda VS Count Dooku Was Awesome and Jango Fett's Scenes Were Awesome."
    },
    {
      "rating": "3.5/5",
      "review": "Solid film. Natalie Portman is the star of this movie. Plenty of shots of her rock-solid abs in the final 30 minutes or so. Sheesh."
    },
    {
      "rating": "2.5/5",
      "review": "The prequel trilogy is plagued by horrible unwatchable silly scenes, but his movie takes the crown. The romantic scenes between Anakin and Amidala are unwatchable with cringing, the absolute worst scenes in the saga. It has a lot of cool action scenes, but some drag on too long. This is the worst movie in of the entire canon."
    },
    {
      "rating": "3/5",
      "review": "An awkward follow up to The Phantom Menace. Not great, but perhaps a slight improvement."
    },
    {
      "rating": "3/5",
      "review": "Not as bad as people make it out to be. I found it to be an improvement over The Phantom Menace."
    },
    {
      "rating": "2.5/5",
      "review": "45% Slightly better than the first, but still not an amazing movie."
    },
    {
      "rating": "2/5",
      "review": "The Jar Jar Binks character continues to detract from otherwise average movie. Lots of action, but the characters were not developed particularly well. One of the few films in the franchise that I never watched in its entirety again. Adds a different nuance to, “I can’t wait for the next one…!” Best forgotten."
    },
    {
      "rating": "3.5/5",
      "review": "I really think this improves upon the previous entry. Besides some cringe inducing dialogue, and some ugly special effects, I can honestly say that I think the storytelling is pretty decent here, and more of what I’d want to see in a prequel trilogy."
    },
    {
      "rating": "2/5",
      "review": "This movie doesn't stick it's landing after the Phantom Menace at least showed glimpses of good. Attack of the Clones has some weird pacing issues, I understand we have to show scenes of Padme and Anakin falling in love, but it completely distracts from the other 5 plots we gave going on. Anakin's resistance to jedi teachings, Obi-Wan's conflict of teaching him and then him trying to discover the republics secret plan, assassination of Padme, etc. The movie just missteps in a few places with odd dialogue and poorly acted."
    },
    {
      "rating": "3/5",
      "review": "Ok I remember seeing this in theaters and thought it was just ok the best part is the clone wars battle sequence at the end of the movie The road to the acolyte"
    },
    {
      "rating": "4.5/5",
      "review": "しばらく観てないんで見返してまたレビューします。"
    },
    {
      "rating": "3.5/5",
      "review": "10 years after the previous film Anakin Skywalker is all grown up, he's learned much of the ways of the Force from his mentor Obi-Wan Kenobi but is still rash, arrogant, and rushing to be great Padme Amidala has resigned her position of queen of Naboo and taken a senator's seat of the Old Republic but an assassin is after her in the form of a bounty hunter named Jango Fett Kenobi tracks him down on the system Kamino where he finds a clone army has been in development in secret after Syfo Dias passed away Meanwhile Anakin is assigned to protect Padme, but he still has nightmares about his mother in trouble back on Tatooine This sets him on a path that will determine his actions saving the galaxy and facing the darkness in his heart Even after this coming out after 20 years George Lucas still has trouble showing he can actually write and direct actors yet he still tries to lay out all the pieces of the puzzle It remains, in more ways than one, a low point for the franchise, and one that has been recontextualized a great deal since its initial release There's no doubt the acting is bad, the dialogue is stilted, the romance is flat, and these lines Hayden Christensen has to say are boring, monotone, and lifeless It's also the longest and slowest of the prequels Yet the film still looks visually pleasing, the clone attack on Geonosis is the highlight Great to see Yoda fight in action and to see Christopher Lee as Darth Tyrannus bringing gravitas It's one of the first movies to be entirely shot in digital with good editing, framework, and Williams' score doesn't disappoint Thank god this paved the way for 'Revenge of the Sith' to be so much better And there is an eternal lesson contained within this movie that applies now more than ever, as Hollywood simply cannot get out of its own way a lot of the time in its pursuit of box office dollars earned on the backs of franchise films That lesson is that just because something is attached to a property that people care about does not guarantee success Im glad this expanded the canon with Jango Fett and the storm troopers' origins It's like a sand analogy; incorporating campy elements into a sci-fi blockbuster Once you get a little campy, it tends to spill over into everything"
    },
    {
      "rating": "4/5",
      "review": "This used to my Favourite In the franchise, and I still like it very much, it is very fun and exciting and gets you on the Edge of your seat in some scenes. But it suffers from clunky dialogue and ok acting, none the less this is one of the better Star Wars films."
    },
    {
      "rating": "2.5/5",
      "review": "I'm conflicted on this movie. On one hand there are som really good characters and arcs but the love story between Anakin and Padme is really boring. Darth Tyranus/Count Dooku, Obi wan-Kenobi and Jango Fett are good characters and some parts of the movie are decent but it is marred by really bad writing that makes you cringe."
    },
    {
      "rating": "4.5/5",
      "review": "I love this movie, and I don’t understand why it has such bad reviews."
    },
    {
      "rating": "2.5/5",
      "review": "Mixed feelings about this one, not bad but not good either. The pacing is the main issue for me."
    },
    {
      "rating": "2/5",
      "review": "None of the films from this trilogy is aging very well (not that there were great back in its day), but this one... I don't know.... Much focused on the love story and also some other things that just don't click..."
    },
    {
      "rating": "5/5",
      "review": "This was for a while my favorite SW film. Its nostalgic, its romantic, its action filled. SW is better because of this movie. Oh you like the clone wars series? then thank this movie and stop with your petty cry baby complaints. This movie is great!"
    },
    {
      "rating": "3.5/5",
      "review": "The most underrated movie in cinematic history."
    },
    {
      "rating": "3/5",
      "review": "So after all of these years, seeing this movie after The Phanom Menace, this movie isn't as boring as most folks give this credit for. Admittedly, there were some cool parts ranging from the chase scene back on Coruscant, seeing Anakin and Padme bond over while falling in love, seeing the Clones on Kamino on how they were born and learn before they were sent to any war, seeing Jango Fett being a badass like Obi-Wan throughout the film to the arena over at Geonosis and even the fight against Count Dooku. But I do understand most of the cons that are in this movie. Half of the script isn't the greatest, some of the dialogue hasn't aged well as twenty years had passed and some of the scenes do feel a little too goofy on their own. It is better than the first movie, as the Prequel Trilogy goes even before the best one arrives. 6/10."
    },
    {
      "rating": "2.5/5",
      "review": "Better than Episode 9, and that's about the only nice thing I have to say about it. The story arc of the prequel trilogy would be left untouched if this film disappeared from the face of the earth. Lucas needed to put half the complexity of Portman's wardrobe into Anakin's developing character. There's a disconnect between the lovable Jake Owen and the tyrannical figure he'd later become, and it's not Episode 2's Anakin."
    },
    {
      "rating": "3/5",
      "review": "better than the first, worse than the third. it's ok"
    },
    {
      "rating": "3.5/5",
      "review": "Just like The Phantom Menace, this has aged quite well. The opening scenes on Coruscant are quite good. But then it splits in two. Anakin & Padme’s romance is some of the worst Star Wars to date (but it’s still better than the Sequel Trilogy). It feels unnatural and forced. But that’s not the fault of Hayden Christensen and Natalie Portman. Although sand is coarse, rough and irritating. But what Obi-Wan Kenobi was doing for this whole movie was great. I loved going to Kamino then discovering Geonosis. Which is when the movie gets the strongest. Everything on Geonosis was fantastic. This movie also introduced Count Dooku (or Darth Tyrannus), who is an absolutely phenomenal villain. Overall, this may have a terrible romance side plot, but Obi-Wan’s adventures and everything on Geonosis definitely carry this movie. 6/10"
    },
    {
      "rating": "5/5",
      "review": "this is a good movies that's hated on to much"
    },
    {
      "rating": "5/5",
      "review": "he Star Wars movies are the best movie franchise ever made hands down! You will laugh and cry and some times at the same time with strong messages for humanity!"
    },
    {
      "rating": "2.5/5",
      "review": "Attack of the Clones suffers greatly from wooden dialogue and Lucas' questionable direction. There's still enjoyable stuff in here and the creativity on display is weirdly refreshing in the context of the newer Star Wars projects' lack thereof."
    },
    {
      "rating": "2/5",
      "review": "This movie has some really cheesey dialogue, and although it is more fun than it's prequel, the story telling of the movie can be absolutely ridiculous at points."
    },
    {
      "rating": "2.5/5",
      "review": "This movie has to be the biggest disappointment in the live action Star Wars movies. From the bad plot to the cringy dialogue, this movie did not meet my expectations. Even though this movie has to be the worst Skywalker Saga movie, it does have some upsides, such as Yoda and his lightsaber for the first time or meeting Count Dooku, who has to be one of the coolest Star Wars Villains of all time, especially in Clone Wars. Overall, not a great movie, but it sets up the rest of the Star Wars movies so go watch it."
    },
    {
      "rating": "5/5",
      "review": "I love this movie so much, not only is it my favorite Star Wars movie but also the most underrated star wars movie and maybe the most underrated movie of all time"
    },
    {
      "rating": "2.5/5",
      "review": "Ein Film der total in Ordnung ist. Weder gut noch schlecht. Allerdings stechen vorallem die hölzernen Dialoge hervor, die sich nahezu durch den gesamten Film ziehen. Vorallem die Passagen von Anakinund Padme ala Romeo und Julia ziehen sich leider in die Länge und zeigen das fehlende Talent von Georg Lucas gute Dialoge zu schreiben."
    },
    {
      "rating": "3.5/5",
      "review": "7.3/10- had some cool scenes but also a lot of corny scenes"
    },
    {
      "rating": "3.5/5",
      "review": "Underappreciated, whilst the acting is cardboard, the world building and contributions to the lore make for a memorable movie, with a phenomenal villain plaid by Christopher Lee."
    },
    {
      "rating": "3/5",
      "review": "So much better than The Phantom Menace although it struggles at parts Anakins acting is as bad as the kids acting besides that it is boring for a bit before it gets pretty good at the end you won't hate it but you'll think its ok"
    },
    {
      "rating": "1.5/5",
      "review": "Although the universe of Lucas continues to be captivating, the acting and the dialogues are cringeworthy."
    },
    {
      "rating": "4/5",
      "review": "A great movie with the fourth greatest lightsaber fight, behind Phantom Menace's Darth Maul v. Obi-Wan & Quigongin. It has a great story and improves on the previous movie. I love the clones. This movie has one of the greatest battle scenes in Hollywood. Though it could have been better storyline wise, especially with Anikan and his massacre. 8/10."
    },
    {
      "rating": "5/5",
      "review": "Such a great movie oh how I miss George's star wars!"
    },
    {
      "rating": "2.5/5",
      "review": "the only good thing was christopher lee"
    },
    {
      "rating": "4.5/5",
      "review": "\"Attack of the Clones\" is a pretty solid entry in the Star Wars prequels. It focuses on some important events in the Star Wars universe, such as the start of the Clone Wars and the romance between Anakin and Padme. As usual, the action sequences are cool! I like how there were lots of Jedi, as well as lots more Clone Troopers, who engage in a cool battle on Geonosis. The cast is well chosen, and Hayden Christensen, in my opinion, is a pretty good choice for the prequels' Darth Vader. George Lucas has certainly delivered a nice Star Wars episode!"
    },
    {
      "rating": "3.5/5",
      "review": "As a huge Star Wars fan I have difficulty rewatching this movie. The pacing is weird and the dialog is cringy. But it's still pretty good in some parts!"
    },
    {
      "rating": "4/5",
      "review": "i like a lot the gungan army and in this film i've been feed, battle interesting but a character make the film less good than it would be without it"
    },
    {
      "rating": "3/5",
      "review": "It's an improvement over the previous one, but it's still not that great."
    },
    {
      "rating": "5/5",
      "review": "Great follow up to episode 1"
    },
    {
      "rating": "3.5/5",
      "review": "Doesn't really get to anything and has large parts of boring and dull scenes. End was great and the beginning of the clone army was nice to see."
    },
    {
      "rating": "3.5/5",
      "review": "it is good but not the best but you should watch at least once"
    },
    {
      "rating": "3.5/5",
      "review": "7/10 corny as hell but underrated"
    },
    {
      "rating": "2.5/5",
      "review": "In my opinion, one of the worst in the series"
    },
    {
      "rating": "3.5/5",
      "review": "Attack of the Clones is an underrated classic. I like the movie more than the Phantom Menace because the pacing is more consistent and the CGI is slightly better (though it still has its problems until Revenge of the Sith), as the lightsaber fights, just like the other two prequels are insanely great. However, the only problem I have is the dialogue; Hayden Christensen falls flat because of the monotone, but the problem gets solved in Revenge of the Sith. Count Dooku, like Darth Maul, is amazing as a villain."
    },
    {
      "rating": "2/5",
      "review": "Oof not a good movie at all, the awkward scenes to not so aged well cgi, only savior is the music"
    },
    {
      "rating": "0.5/5",
      "review": "Run for the hills. This is the worst Star Wars movie and just a bad movie in its own right. Avoid at all costs..."
    },
    {
      "rating": "4.5/5",
      "review": "It was hard for me to understand what was going on but I picked it up along the way everyone should know that this movie was great not the best but just enough for me to sit there on the edge of my seat and bite my hand"
    },
    {
      "rating": "3/5",
      "review": "Again something i remember being a lot better when i was younger. I think nostalgia still holds a lot for this movie."
    },
    {
      "rating": "5/5",
      "review": "Uma grande produção sem por defeitos alguns. Apenas assistam à essa obra-prima do cinema mundial."
    },
    {
      "rating": "1.5/5",
      "review": "There's a decent noir film going on for Obi Wan and there's also the worst love story I've ever witnessed"
    },
    {
      "rating": "2/5",
      "review": "Surely the worst of the two trilogies. Special effects cannot conceal weakness in dialogue and character development. This gets worse with time after the movie because special effects themselves evolve. The effects here remain compelling but can't carry the movie to greatness on their own."
    },
    {
      "rating": "2.5/5",
      "review": "This movie sets up a great start to Anakin Skywalker's journey into Darth Vader, and the start of the clone wars. However, the awkward moments seem to get the best of most people, which shows why it is not well received. Though I will admit that those scenes stink, the rest can be a fun experience I would recommend watching."
    },
    {
      "rating": "2/5",
      "review": "Another frustrating watch. While you could see the potential for something greater, the execution leaves so much to be desired. Attack of the Clones certainly ups the ante of its predecessor. The action scenes are more thrilling and the lightsaber duel are decent enough. There is an attempt to further develop certain main characters, particularly Anakin, as we see his inevitable fall to the Dark Side start to to take shape. Generally the performances are great (minus Hayden, but we'll get to him, BELIEVE THAT). John Williams always delivers with his Scores but I feel the need to acknowledge his work whenever it's necessary. The man doesn't put a foot wrong. However, there are more cons than pros. Firstly, the pacing, again. This film is under two and a half hours but feels at least 45 minutes longer. Is it as boring as The Phantom Menace? Possibly, but it's got more problems than that one does. Secondly is the dialogue. You don't need me to tell you that most of it comes off as forced and unnatural and the worst offender of this is Hayden Christensen. I don't know if it was the script or the direction, but some scenes are genuinely terrible. They'd make Tommy Wiseau jealous. There's also some of the inconsistencies and moments which feel super contrived. Lastly, there is the overuse and poor quality of the CGI. Again, I know it was the early 2000s, but it's just ridiculous how bad most of it is. It's as if I'm watching a Disney Channel Original Movie. George really needed some sort of oversight. In conclusion, Attack of the Clones is in my view possibly the worst of the Prequels (admittedly that's ablow bar) and a frustratingly disappointing film."
    },
    {
      "rating": "3/5",
      "review": "This is very mid and while it does have clone, doesn't do much"
    },
    {
      "rating": "5/5",
      "review": "People dog on the teenage romance dialog while forgetting that it fits the age and maturity of the characters. Probably the most underrated movie in the franchise. Huge world building and battles and great lightsaber choreography. Love this movie."
    },
    {
      "rating": "5/5",
      "review": "This movie sets up the Revenge of The Sith perfectly. George Lucas removed the bad aspects of the first movie and simultaneously improved upon the great aspects from the first movie as well. Hayden Christensen plays Anakin Skywalker perfectly. Also Ian McDiarmid is amazing as chancellor Palpatine and Sir Christopher Lee is the perfect actor to play Count Dooku. Overall this movie is an improvement in every way and it doesn't deserve nearly any of the hate it gets."
    },
    {
      "rating": "4/5",
      "review": "Gosto muito, a Padmé é uma gostosa! Parabéns Anakin."
    },
    {
      "rating": "4/5",
      "review": "More action but still very taking. The star wars univers is expending. This is more adult and for the better"
    },
    {
      "rating": "4/5",
      "review": "This movie could have been better, the dialogue is horrible and the romance should have never happened, but besides that what you get is a movie with wonderful fight scenes, the introduction of the clones,(the best characters in my opinion) and i really enjoyed obi-wans side of the story so overall, pretty decent movie."
    },
    {
      "rating": "2.5/5",
      "review": "Still suffers from bad characters and this time dialogue is also a problem, but it learned a bit from its predecessor, having more action and entertainment value."
    },
    {
      "rating": "5/5",
      "review": "awesome movie everything is perfect"
    },
    {
      "rating": "3.5/5",
      "review": "This Movie Is on the same level as its predecessor, and I too cringe at Hayden Christensen's performance as a Teenage Anakin, but he still acceptable for what's required of the movie's plot and they handled a lot of the romantic scene maturely just no where near as good as the other ones, and also the fact that this is the movie where the relationship of C-3PO and R2-D2 starts in this movie was handled pretty good, and the last act in the Geonosis arena with the Jedi and Battle Droid fight and the First Battle that Sparked The Clone Wars both in Canon and also a TV series was done very well and cinematically and the beginning of Palpatine's quest for power and control over the Star Wars Galaxy was made very clear, so yeah still not a great movie but it's not a bad movie in terms that this installment was more of a 142 minute pilot episode for the Clone Wars TV shows that are to follow is still what dates this movie a little bit.... 7/10 movie"
    },
    {
      "rating": "5/5",
      "review": "Um filme espetacular, excelente em tudo, recomendo a todos com certeza!"
    },
    {
      "rating": "5/5",
      "review": "Padme was even hotter."
    },
    {
      "rating": "4/5",
      "review": "Way way way way way way way way way better than the Phantom menace"
    },
    {
      "rating": "3/5",
      "review": "Marginally better than its predecessors, this film excels in all of the same aspects. The fighting is great but, again, the characters are underdevloped and Lucas' attempt at writing romance is quite possibly the worst ever. Not recommended."
    },
    {
      "rating": "5/5",
      "review": "This movie was good, loved the ending !!!"
    },
    {
      "rating": "4.5/5",
      "review": "Some parts were a bit rough, but overall Attack of the Clones does a fantastic job building the Star Wars lore."
    },
    {
      "rating": "3.5/5",
      "review": "A really good episode showing the beginning of changes in Anakin Skywalker, sadly, not for better. This movie shows how gullible the not yet strong and well trained mind is of young Padawan, that will only get worse..."
    },
    {
      "rating": "3/5",
      "review": "There wasn't a lot of fighting in the movie and more scenes with anakin and padme than lightsaber duels but the last part was a pretty good duel."
    },
    {
      "rating": "5/5",
      "review": "Amazing Movie, made my childhood. Us Kids loved it, but the Adults rated it."
    },
    {
      "rating": "3/5",
      "review": "What this film could've used is more of everything. It comes up a tad short on emotion, on action, on plotlines and, consequently your urge to watch it again."
    },
    {
      "rating": "4/5",
      "review": "This is the most underrated Star Wars Movie. Seriously why does everyone hate it? Anakin's fall to the dark side is portrayed well."
    },
    {
      "rating": "3/5",
      "review": "I mean i guess.... its fine and it tells the story it just lacks in a few bits"
    },
    {
      "rating": "2.5/5",
      "review": "Good first half but rushed second half.. Plot is actually very good till we get to Geonosis and everything gets rushed.. no introduction of the villains they came out of nowhere especially Dooku ! Who is he and why do we never heard of him before ?! Clones are only for about 20 minutes in the movie although they are in the Movie Title.. How are we supposed to feel the betrayal in Episode III with no development of the bond between the Jedi and the Clones ?! The second half is so over the top its just fanservice with a poor choreography and bad dialogues.. Action 6.5/10 Plot 5/10 Fights 3/10 with exception of Yoda vs Dooku which is a 7.5/10 Acting 4/10 Dialogues 3.5/10 \"I hate Sand\" Music 8/10"
    },
    {
      "rating": "4.5/5",
      "review": "Very underrated movie. While it's not perfect, this movie did a great job of introducing the clone war into Star Wars, as well as included necessary character development for Anakin and Obi Wan. Count Dooku is also the most underrated Star Wars villain of all time. He's played by a great actor, and the character is intelligent, intimidating, and powerful; all the qualities of a great obstacle for the protagonist to overcome."
    },
    {
      "rating": "1.5/5",
      "review": "Even worse than its predecessor. This movie has one of the worst romances in cinema history."
    },
    {
      "rating": "4/5",
      "review": "Slow movie but great story and visually especially the ending was a masterpiece"
    },
    {
      "rating": "5/5",
      "review": "great movie that delves into the political themes of how a Republic can vote a dictator by giving emergency powers to him. It also shows Anakin's descent into the dark side when he slaughters the Tusken Raiders."
    },
    {
      "rating": "3/5",
      "review": "I thought this movie was better than the Phantom Menace. Liked Count Dooku. Hated the romance scenes boring story. But bad execution. Overall The movie was okay"
    },
    {
      "rating": "2.5/5",
      "review": "An over-reliance on CGI and politics make this probably the worst of the prequels."
    },
    {
      "rating": "3.5/5",
      "review": "Star Wars: Attack of the Clones is a terrible movie. It's still ok that I can give it 3 1/2 stars, but it's really boring. Yes, it has iconic scenes like the battle on.. wait what's the planet called again? Yeah, that's how much it's forgettable except the fight scenes.. I sometimes confuse this movie title with the Clone Wars sometimes. I guess it can hold up with great characters like Jango Fett, Obi Wan, and Darth Tyranus."
    },
    {
      "rating": "3.5/5",
      "review": "I can see what Lucas was going for here (essentially an old fashioned and melodramatic love story set against the back drop of an impending war) and he often succeeds, aided by his encyclopedic knowledge of film, but frankly the love story is entirely unconvincing. I get why Anakin loves Padme (the age gap places her firmly as an almost maternal figure to a young man who lost his mother and he's been nursing a crush since childhood) but I do not understand why or how she falls in love with him. Still the aforementioned references are fun as are the great designs that invoke classic science fiction. Oh and all of the action scenes sure hold up."
    },
    {
      "rating": "2/5",
      "review": "Yikes. Their are essentially two plots here; an extremely cringy and creepy romance plot, and a very mildly entertaining investigation plot. Neither one hold up the film very well, and a surprisingly entertaining finale is the only thing that keeps Attack of the Clones from being completely rotten."
    },
    {
      "rating": "3/5",
      "review": "Star Wars: Attack Of The Clones is most definitely an improvement over Phantom Menace but there are still a lot of issues that lie within this film."
    },
    {
      "rating": "5/5",
      "review": "Absolutely love Attack of the Clones. Incredibly underrated, I understand the dialogue can be very stiff and the acting at times is awkward, but if you can get past that— this film is wonderful. It is the most jam packed film of the original 6 and has SO much lore in it. Hayden Christensen portrays an angsty teenager who's never been around a woman in his life incredibly well and the reason you hate it, is because he does it very well. The CGI is astonishing for it's time and has not dated as badly as people whine about. The score is beautiful and the romance between Anakin & Padmé is great. I don't care what anyone says about this movie, I love it and think it is wonderful."
    },
    {
      "rating": "3.5/5",
      "review": "the worst of the prequel trilogy but still pretty fine imo. anakins bit of a creep for a bit (i mean 3/4 of the movie) and the romance wasnt that good and the cgi looked kinda off, and the dialogue was kinda bad. other than that i liked this one. 7/10"
    },
    {
      "rating": "2.5/5",
      "review": "Attack of the Clones is watchable as the prequel trilogy kicks into gear. The storyline and the action are decent, but the diolog is infamously awkward."
    },
    {
      "rating": "3/5",
      "review": "Definitely my least favorite of the prequel trilogy, but I didn't hate this movie. It was just kind of there attempting to advance the story without it feeling crazy impactful."
    },
    {
      "rating": "5/5",
      "review": "Not the best Star Wars film, but still enjoyable and fun!"
    },
    {
      "rating": "1/5",
      "review": "The original trilogy was a huge part of my childhood and this was just pure disappointment. I actually preferred the phantom menace (mainly because of the showdown with darth maul). As a kid i always imagined anakin to be this edgy gritty character, and what i got was a whiney annoying brat. I don't blame the actor, he just did the best with what he had. I found the ending underwhelming and the jedi fight was a massive let down. I wanted some edge but it was just full of horrible dialogue and C3P0's jokes are eye rollingly bad. The romance is awful and about as cringey as you can get. It's got way too many effects and personally it made me feel detached from it. Im trying hard to find a redeeming quality but honestly can't think of one. What did they do to my beloved star wars."
    },
    {
      "rating": "2/5",
      "review": "Decent movie, however, the worst of the prequels. Geonosis battle was awesome though. 4.1/10"
    },
    {
      "rating": "5/5",
      "review": "Everything about STAR WARS EPISODE II: ATTACK OF THE CLONES by George Lucas is PERFECTION with unbelievable Directing, Acting, Dialogue, Writing and the beautiful CGI and you can't leave out the wonderful Score by the great John Williams. This film should have won Best Picture in the Academy Awards along with other Categories. EPISODE II is a better STAR WARS film than all Disney Star Wars films combined."
    },
    {
      "rating": "1.5/5",
      "review": "This movie is basically The Clone Wars series but with live action characters - it also happens to be terrible."
    },
    {
      "rating": "4/5",
      "review": "An underrated film that really progresses Anakin's journey to the dark side."
    },
    {
      "rating": "3/5",
      "review": "Its star wars so I'll always at least like it. However this is one of my least favoured and the worst of the prequels. I think Hayden Christensen is a good actor but hard to work with a crappy script. I got where they were trying to go story wise with his demise to becoming Darth Vader, but it just fell a bit flat with me."
    },
    {
      "rating": "3.5/5",
      "review": "Almost good........."
    },
    {
      "rating": "4/5",
      "review": "This movie is bad at times, but if you just go into it looking for a good time you will have one. It has some great Star Wars action and great performances by Christopher Lee and Ewan Mcgregor. Yeah, it's dumb sometimes, but I love it."
    },
    {
      "rating": "2.5/5",
      "review": "Attack of the Clones suffers from uneven pacing and awkward dialogue, making it another middling instalment that pales in comparison to the original trilogy."
    },
    {
      "rating": "3/5",
      "review": "It's good besides the plot doesn't make too much sense and the cgi doesn't hold up"
    },
    {
      "rating": "2/5",
      "review": "Bad acting and worse writing plagued this series of Star Wars."
    },
    {
      "rating": "2.5/5",
      "review": "L'estetica plasticosa di Star Wars 2 lo rendono un film pieno di difetti e giocattoloso"
    },
    {
      "rating": "2.5/5",
      "review": "This is my least favorite of the prequels. I just really wasn't very impressed. It was good, but it wasn't great. The cast tried, but the movie had already failed thanks to the clunky and weird script"
    },
    {
      "rating": "3/5",
      "review": "It suffers from the same problems as Episode 1 : Bad acting, bad dialogue, too much contents that are unnecessary for the plot. However, this is even worse and more ridiculous."
    },
    {
      "rating": "5/5",
      "review": "One of the best of the best."
    },
    {
      "rating": "3.5/5",
      "review": "Ten year old me loved this movie. Then I spent the next twenty years being confused about who Sifo-dyas was. Half star extra for Yoda flipping around everywhere."
    },
    {
      "rating": "5/5",
      "review": "Better than any Disney movie."
    },
    {
      "rating": "2.5/5",
      "review": "Quite boring only thing I loved about this movie is the clones they are just amazing in every scene"
    },
    {
      "rating": "2.5/5",
      "review": "One of the worst films in the franchise, this is plagued by unnatural dialogue and a frankly boring story that not even an impressive final battle scene can save"
    },
    {
      "rating": "0.5/5",
      "review": "The most forgettable star wars movie because of the whole movie being about a side story that is only touched on again in the clone wars show."
    },
    {
      "rating": "3.5/5",
      "review": "I really liked this movie, due to the clones being in this movie, which makes this a even more biased review than it already is, but \"magnificient aren't they\". Similarly to episode 1, Anakin is really annyoing and somewhat ruins the movie. So does Padme as well, how does she fall in love after Anakin tells her that he killed a tribe, additionally specifying he killed everyone, even the children. Essentially Anakin tells Padme I am a terrible person and then she falls in love with him (actually pretty realistic, did not work in long run for her though). Moreover there are many visual errors between the cuts, for example when Padme is in the gunship she is holding a blaster, however when she falls down the blaster is nowhere to be seen. There are plenty of such errors in movie, obviously you don't recognize all of them or maybe even any of them, however this should not happen in such a popular movie series. Moving on to the positives, the fight scene on geonosis (or something like that) was epic, the Jedi appearing all across the arena and entrance of the clones were both amazing scenes. Same as in all of the prequel movies the fight scenes are terrific, the choreography is stunning, it becomes even more impressive after watching the sequels. Finally the introduction of Jango Fett was a great addition to the Star Wars universe, great character."
    },
    {
      "rating": "3/5",
      "review": "There's a good film in there somewhere, it's just plagued by wooden acting and a bland story."
    },
    {
      "rating": "3/5",
      "review": "This one was alright, not as bad as episode 1, but it's like mid teir."
    },
    {
      "rating": "3/5",
      "review": "I appreciate this film more, the actors are doing a good job and the fight scenes are cool, but the story moves kinda slow, but the film is actually good!"
    },
    {
      "rating": "2.5/5",
      "review": "Not a fan of the CGI"
    },
    {
      "rating": "1/5",
      "review": "A clear example of why it's worth paying writers, at least if you wish to please anyone other than those who only care for pretty action."
    },
    {
      "rating": "3/5",
      "review": "I'm mean ok."
    },
    {
      "rating": "3.5/5",
      "review": "I don't get the hate on the Star Wars attack of the clones. I liked the acting and in my opinion Hayden Christensen acting is okay. I really like story with anakin and Padme with them build up their relationship and getting married at the end. The scene where anakin killing the creatures that killed his mother making us scared that he was turning to the dark side. And the action was was great and overall a 8/10 movie."
    },
    {
      "rating": "4/5",
      "review": "While this may be considered the weakest of the six Star Wars films created by George Lucas, it's not necessarily a terrible film. Many elements are at play here, both in a technical standpoint and in terms of fan engagement."
    },
    {
      "rating": "3/5",
      "review": "I'm quite split on this movie. The romance is weird as hell but Obi-wan is amazing the fight with Jango was incredible. The battle on Geanosis was insane and also Mace Windu was insane it also set up Boba fett really well."
    },
    {
      "rating": "3.5/5",
      "review": "Star Wars Episode II: Attack of the Clones is a polarizing chapter in the beloved franchise that suffers from uneven storytelling and clunky dialogue. While the film offers impressive visual effects and action sequences, it falls short in character development and narrative coherence. Hayden Christensen's portrayal of Anakin Skywalker lacks the depth and charisma needed to fully connect with audiences, and the romantic subplot between Anakin and Padmé feels forced and lacking in chemistry. However, the film does introduce memorable new characters, such as Jango Fett and Count Dooku, adding some intrigue to the plot. Despite its flaws, \"Attack of the Clones\" does have its moments of excitement and nostalgia for Star Wars fans, making it a passable addition to the saga, albeit one that may leave some longing for the magic and storytelling prowess of the original trilogy."
    },
    {
      "rating": "4/5",
      "review": "Much maligned but still much better than it’s reputation would have you believe."
    },
    {
      "rating": "5/5",
      "review": "It was good but the love story was kind of corny"
    },
    {
      "rating": "3.5/5",
      "review": "Not as bad as the Phantom Menace, but still suffers from all the same problems (bad acting, overuse of CGI, wooden dialogue)."
    },
    {
      "rating": "2.5/5",
      "review": "Pretty awful all around"
    },
    {
      "rating": "3.5/5",
      "review": "Lots of awkward dialogue and acting"
    },
    {
      "rating": "0.5/5",
      "review": "Dialogue between Anakin and Padme is painful to get through, and the full cgi moments just don't work."
    },
    {
      "rating": "3/5",
      "review": "Boring but better than sequels DONT WATCH STAR WARS SEQUELS"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is as cringe as it is boring. You could fall asleep watching it. Some stuff is bad in a good way, but this was bad in a bad way."
    },
    {
      "rating": "2.5/5",
      "review": "The teen romantic drama really ruined it for me. It was really uncomfortable to watch. Obi- wan was the savior of this movie."
    },
    {
      "rating": "2/5",
      "review": "Easily the worst of the prequel trilogy. There's Maybe 3 scenes that are shot with a real background and this is back when cgi looked worse than ps2 graphics. The script is horrible, and if it wasn't for a few good fight scenes there wouldn't be a good thing to say about this movie."
    },
    {
      "rating": "3/5",
      "review": "While the movie in my opinion is the worst of the sequels, it doesn't mean it's terrible. It's still a great film, but the wooden dialogue drags the movie down, and some directing choices were very weird (looking at you, jar jar binks)."
    },
    {
      "rating": "2/5",
      "review": "La batalla final, si os saltáis toda la película y veis la batalla os habréis ahorrado dos horas de sufrimiento."
    },
    {
      "rating": "5/5",
      "review": "These 3 part movies are the best movies of whole Star Wars serie, the older once just feel soo bad to watch and the newer once are just bad."
    },
    {
      "rating": "5/5",
      "review": "Honestly my favorite Star Wars movie. It's underrated and overhated. I can't believe this has a rating under 90. I love Padme and Anakins relationship in this movie so much."
    },
    {
      "rating": "3/5",
      "review": "its pretty good other than the fact that it contains the worst lightsaber fight of all time"
    },
    {
      "rating": "3.5/5",
      "review": "10 years after the previous film Anakin Skywalker is all grown up, he's learned much of the ways of the Force from his mentor Obi-Wan Kenobi but is still rash, arrogant, and rushing to be great Padme Amidala has resigned her position of queen of Naboo and taken a senator's seat of the Old Republic but an assassin is after her in the form of a bounty hunter named Jango Fett Kenobi tracks him down on the system Kamino where he finds a clone army has been in development in secret after Syfo Dias passed away Meanwhile Anakin is assigned to protect Padme, but he still has nightmares about his mother in trouble back on Tatooine This sets him on a path that will determine his actions saving the galaxy and facing the darkness in his heart George Lucas still has trouble showing he can actually write and direct actors yet he still tries to lay out all the pieces of the puzzle It remains, in more ways than one, a low point for the franchise, and one that has been recontextualized a great deal since its initial release There's no doubt the acting is bad, the dialogue is stilted, the romance is flat, and these lines Hayden Christensen has to say are boring, monotone, and lifeless It's also the longest and slowest of the prequels Yet the film still looks visually pleasing, the clone attack on Geonosis is the highlight Great to see Yoda fight in action and to see Christopher Lee as Darth Tyrannus bringing gravitas It's one of the first movies to be entirely shot in digital with good editing, framework, and Williams' score doesn't disappoint Thank god this paved the way for 'Revenge of the Sith' to be so much better And there is an eternal lesson contained within this movie that applies now more than ever, as Hollywood simply cannot get out of its own way a lot of the time in its pursuit of box office dollars earned on the backs of franchise films That lesson is that just because something is attached to a property that people care about does not guarantee success Im glad this expanded the canon with Jango Fett and the storm troopers' origins It's like a sand analogy; incorporating campy elements into a sci-fi blockbuster Once you get a little campy, it tends to spill over into everything"
    },
    {
      "rating": "4/5",
      "review": "pretty good just a little weird"
    },
    {
      "rating": "2.5/5",
      "review": "A clunky movie with a romance that feels vaguely Twilight-esque, this movie shows an uninspired side of the Star Wars universe. While on most movies I consider a flop the burden falls upon many shoulders, in this movies case the actors bear the brunt of it (and whoever wrote their dialogue). Still, the movie is visually entertaining, and meets the golden standard of having at least a few iconic scenes that will stick in your memory for years to come."
    },
    {
      "rating": "0.5/5",
      "review": "The Worst Star Wars Movie Of All Time and your probably thinking that last Jedi and rise of SkyWalker but no this is the worst one ever it's boring Anakin acts like a 5 year old and horrible cgi just an awful Movie"
    },
    {
      "rating": "5/5",
      "review": "One of the best movies ever! What's up with that low score though? Amazing movie!"
    },
    {
      "rating": "0.5/5",
      "review": "Just awful. He doesn't like sand, we get it."
    },
    {
      "rating": "5/5",
      "review": "this was the starting point of the clone wars and my favorite era of the star wars universe"
    },
    {
      "rating": "3.5/5",
      "review": "George Lucas deu um filme Star Wars sem seu merecimento exato, não aprendeu com seus erros no primeiro filme, mas pelo menos o filme é muito melhor que o primeiro cronologicamente falando e oque salva o filme são os clones que são a \"evolucão\" dos Troopers Traduction: George Lucas gave a Star Wars movie without its exact merit, he didn't learn from his mistakes in the first movie, but at least the movie is much better than the first chronologically speaking and what saves the movie are the clones that are the \"evolution\" of the Troopers"
    },
    {
      "rating": "3/5",
      "review": "Hot take…better than TPM……I really like the score, it elevates it a lot. I also like Obi-wan and Anakin's dynamic, it corny at times but I can get a good laugh out of it. Overall it's okay…"
    },
    {
      "rating": "5/5",
      "review": "The greatest 02 hours: and 23 minutes ever!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "3/5",
      "review": "\"I hate sand. It's course, and rough…and it gets everywhere.\" This movie is sand"
    },
    {
      "rating": "3/5",
      "review": "Dialogues are horrible, but action and final battle rocks"
    },
    {
      "rating": "2.5/5",
      "review": "STAR WARS: EPISODE II - ATTACK OF THE CLONES is still not that good but is a slight upgrade to the previous movie!"
    },
    {
      "rating": "3/5",
      "review": "Easily the weakest entry in the prequel trilogy. From it's painful misfire of a romance between Anakin and Padme, to it's slow middle half. The only saving grace is the film's intro, and concluding battle sequences."
    },
    {
      "rating": "2/5",
      "review": "Though the story takes a definite step up from The Phantom Menace, poor choices regarding Anakin Skywalker and a terrible Hayden Christiansen performance bring it back down to earth."
    },
    {
      "rating": "4/5",
      "review": "The #3 best star wars movie I've watched(note: I've only watched episodes 1, 2, 4, 5 and 6)"
    },
    {
      "rating": "3/5",
      "review": "Not bad, but not great."
    },
    {
      "rating": "2/5",
      "review": "This one pretty much sucks 👎🏻"
    },
    {
      "rating": "3.5/5",
      "review": "A lot more action then the first one, much better effects, got to see a lot more of obi wan, Portman was great, dialogue wasn't great though. fun movie."
    },
    {
      "rating": "3.5/5",
      "review": "Loved the expansion of the universe and how this film continued to help me us feel like this was truly a galaxy far, far away. However, the pacing was slow and some of the scenes were awkward at times. That being said, the visuals were great and the combat continued to be spectacular."
    },
    {
      "rating": "3/5",
      "review": "Better than Episodes 1, 8 and 9. It's pretty watchable if you fast forward through the Anikin whiny parts."
    },
    {
      "rating": "2.5/5",
      "review": "Połowa scen z Anakinem jest niesamowicie niezręczna. Nudnawy, przegadany. Bitwy raczej słabe, wyglądają na niemal w pełni wykonane komputerowo"
    },
    {
      "rating": "4/5",
      "review": "I don’t get why people hate this movie"
    },
    {
      "rating": "1/5",
      "review": "This is an awful movie. It's about an hour too long and bored the life out of me. The dialogue is absolutely wooden, it looks like when everyone threw out the typewriters for computers, George Lucas accidentally went to the wrong hardware department and got a saw and thought \"well, everyone's doing it so I've got to make it work\". On top of that, the on-screen chemistry between Hayden Christensen and Natalie Portman is like they're both noble gases. Also, the green screen and CGI scenes look terrible, at least from a 2023 perspective. Not as bad as in the wrecked version of A New Hope, but still pretty bad."
    },
    {
      "rating": "4/5",
      "review": "This is one of my favorite starwars movies. Great Fighting scenes and bringing Yoda in the way they did brought a standing ovation in the movie theater when I first saw it. really builds a good attraction to Annakin the Character and ultimately what really happened in regards to his relationships to others. The graphics for this movie continue to step it up as time goes on."
    },
    {
      "rating": "2/5",
      "review": "Everybody knows this is the worst Star Wars movie ever made. It's an hour and a half of pouting and awkward \"romance\". And then we get 40 minutes of battle. Just like Phantom Menace… This could be 20 minutes shorter and 10% better with some re-editing. I watched the deleted scenes on the Blu-ray, and they were better than 90% of the dialogue that was left in the movie. Unbelievable."
    },
    {
      "rating": "2.5/5",
      "review": "An okay movie overall. It gives the alienated space action that you want, but the writing and characters ultimately make it one of the worst Star-Wars films. Rating: 45%"
    },
    {
      "rating": "4/5",
      "review": "I hate sand but I love this movie. George delivers a wonderful second movie to a trilogy that leaves you feeling as if the Jedi are always one step behind whatever Dooku and his Sith master are planning. Anakin still has much to learn as Obi-Wan tries to steer his padawan in the correct direction."
    },
    {
      "rating": "4.5/5",
      "review": "this is one of my favourite star wars movie of all time"
    },
    {
      "rating": "5/5",
      "review": "Great action and good character and world building"
    },
    {
      "rating": "5/5",
      "review": "I believe that this is where the real excitement begins. STAR WARS: ATTACK OF THE CLONES brings in all the action and all the suspense into one major story about loyalty and trust, and it works really well while showing Anakin Skywalker's emotional side very effectively."
    },
    {
      "rating": "3/5",
      "review": "Attack of the Clones has a lot of good… and a lot of bad. With the Phantom Menace, I actually enjoyed it more on rewatch. Whereas this, I enjoyed it a little less. I still had a fantastic time watching this but I completely forgot about how bad some of the dialogue is. The romance between Anakin and Padme works, but it's not executed well. If they spent more time on their relationship, this movie could've been so much better then it was. Like I said, despite some of the dialogue really holding back this movie, there is a ton of stuff to love. The scenes with Kenobi on Kamino, the battle of Geonosis, and seeing Yoda duel Count Dooku are incredible. On top of that, George Lucas expands on his world-building from The Phantom Menace. Overall, this movie is very flawed but it features some of the best moments in Star Wars."
    },
    {
      "rating": "1/5",
      "review": "Boring, bad storytelling, terrible dialogue, and a mediocre villain in Jango Fett. This movie's only redeeming quality is Yoda vs. Count Dooku and even that isn't anywhere near close to the best duel of the prequel trilogy. This movie is just terrible."
    },
    {
      "rating": "2.5/5",
      "review": "It's definitely better than Phantom Menace, mainly because I like the story more and more action . But it's still not that good. Just mediocre."
    },
    {
      "rating": "2/5",
      "review": "Cringey dialogue throughout. Hayden Christensen is a good actor but for some reason sucks in this movie ( bad directing I guess). Anakin and Padme's romance is almost as bad as twilight, and doesn't make sense whatsoever (Padme should have run away when she got the chance). Ewan McGregor, John Williams, lightsabers, and Christopher Lee make this slightly better than Rise of Skywalker."
    },
    {
      "rating": "1/5",
      "review": "This is on the same level of boring of the first movie.The cool character is Anakin. He goes through some things that I find interesting.Yoda is also cool but this movie is pretty bad--3/10"
    },
    {
      "rating": "3.5/5",
      "review": "By starting off this review I'd just like to say that this movie got more hate than it deserved. The actors did an amazing job, and the special effects were very good especially for the time it came out. The plot (just like the phantom menace) didn't entirely hook me at first but as the movie went on it got more captivating and immersive. Overall, it was good enough that I would recommend it."
    },
    {
      "rating": "5/5",
      "review": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD good 🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻"
    },
    {
      "rating": "2/5",
      "review": "That was the worst star wars movie. Some actors were really good, while others were eh. Another boring script. With the worst cgi in the franchise. And one of the worst Love storys ever. Still watchable though."
    },
    {
      "rating": "2/5",
      "review": "'Star Wars: O Ataque dos Clones' é, de longe, muito inferior ao primeiro. Faltam cenas de ação, e as poucas que tão, são fracas! As atuações não são tão boas, uma trama rasa. Os únicos pontos positivos desse filme são: o começo da vingança de Anakin Skywalker e o Conde Dookan. Nota: 4/10"
    },
    {
      "rating": "4/5",
      "review": "I think it's better than most people think it is. I think Hayden Christen is a really good actor."
    },
    {
      "rating": "5/5",
      "review": "My least favorite Star Wars film, but I love all the Star Wars films, so one of them had to be last. Christopher Lee as Count Dooku is the best part about this movie. What a legend!"
    },
    {
      "rating": "4/5",
      "review": "What's weird is the audience score is low even though I know a lot of people who like this film"
    },
    {
      "rating": "3/5",
      "review": "Better than episode 1 but is kind of goofy. Not the best story but really fun."
    },
    {
      "rating": "1/5",
      "review": "This movie is awful. It has almost nothing going for it, the romance is bland and makes no sense. The dialogue is wooden, and makes the characters come off as emotionless sociopaths which works against our ability to connect with them. The action is ok in certain areas, but its boring because like I said earlier we don't have enough of a connection with any of these characters to truly root for them. The CGI is not just very dated, but it was bad for the time as well, and heavily overused. The set design is sometimes ok, but the use of fake looking blue screen composite shots take you out of the movie. Not to mention how sterile everything looks, the Jedi Temple and senate buildings don't look like royal and historical places that have stood for generations. They all look way to clean and brand new and lack any kind of tactile feeling or sense of history. Every characters do incomprehensibly stupid and oddly complex things to service the plot. Its like the characters know how the story needs to end so they will go to any lengths to make that happen rather than it coming across naturally or through logical progression. This film tried to be better than its predecessor, by removing or de-emphasizing certain poorly received elements from the last one. But, it ended up being even worse because what little charm The Phantom Menace had is just gone here."
    },
    {
      "rating": "2/5",
      "review": "I gave it 2 stars only because it's great to remember all the great memes this movie gave us"
    },
    {
      "rating": "1/5",
      "review": "Wow Hayden Christensen is terrible."
    },
    {
      "rating": "2/5",
      "review": "Probably the worst star wars film I've seen"
    },
    {
      "rating": "1/5",
      "review": "Just when you thought that it couldn't get much worse than Episode I…. It did!"
    },
    {
      "rating": "3/5",
      "review": "Lots of pointless plot, but the battles, setting, and special effects carry this movie to a fresh, albeit emotionally odd, rating."
    },
    {
      "rating": "2.5/5",
      "review": "Better than 1 I guess 🤷"
    },
    {
      "rating": "3/5",
      "review": "Better than episode 1, but not as good as IV."
    },
    {
      "rating": "4/5",
      "review": "This is my second movie into Star Wars, its much better than Episode 1 in terms of Story, Action and Characters, however the romance is awful as is the dialogue. The finale has helped the movie from falling short. Anyway i am now more interested in the Star Wars story than when i started watching it from Episode 1 which was very disappointing, this one was more enjoyable for me. Overall i will give it 8/10"
    },
    {
      "rating": "5/5",
      "review": "Such a great movie, from Yoda vs. Dooku to Anakin and Padme finding love. Such a great movie to see, and the clones are so cool."
    },
    {
      "rating": "3.5/5",
      "review": "The second half of the movie is great and finds its feet. The first half is slow and too much of a romance. Good filler movie for information"
    },
    {
      "rating": "3/5",
      "review": "It's worst than the first but it does show some good stuff that leads into episode 3."
    },
    {
      "rating": "2/5",
      "review": "Only really serves as exposition for the next film. At least padme's dresses are pretty."
    },
    {
      "rating": "4/5",
      "review": "Great action, poor writing in a few scenes. Overall very entertaining"
    },
    {
      "rating": "3.5/5",
      "review": "Padme and Anakin are annoying as hell the plot doesn't always make sense in the CGI is a little bit more outdated by the year but this probably has to be some of the funnest action in all Star Wars and Ewan McGregor is fully utilized in this film is Obi-Wan and I got to say he's probably my favorite Obi-Wan Kenobi I mean I love myself some Ewan McGregor and the Chase through Croissant is probably my favorite scene in the prequel‘s up there with the battle on mustafar and duel of the fates I probably spelt those all wrong but whatever 7/10"
    },
    {
      "rating": "3/5",
      "review": "Had some good moments but overall meh"
    },
    {
      "rating": "4/5",
      "review": "I like this film more than many. The action sequences with the special effects and choreography (lightsaber fights, shoot outs, and space/ground battles) are top notch and great Star Wars entertainment!! It has many memorable and exhilarating, adventurous scenes, just like Phantom Menace which I liked a lot too! Sure the dialogue can be stale but that isn't everything in a movie! Plus, significant and emotionally powerful events which slowly turn Anakin to the dark side cannot be overlooked. And Ewan McGregor and Hayden Christensen have good chemistry, I really bought into their love/hate relationship!! I liked it ever since I bought it on DVD as a kid!"
    },
    {
      "rating": "1.5/5",
      "review": "Even weaker than \"Star Wars: Episode I- The Phantom Menace\" (1999), \"Star Wars: Episode II- Attack of the Clones\" is an even more CGI overload to the senses. Weak dialogue and some dated effects by today's standard, are the least of it's issues. The 143 minute running time just becomes an over saturated mess of green screen and generic robots. While there are some scenes that are overly fleshed out and explained in tedious detail, the abundance of action in this film helps keep it moving forward but just becomes over jarring as the time goes on. It sets the stage for Revenge of the Sith to tie the two trilogies together into one seamless saga, which is about all it does."
    },
    {
      "rating": "5/5",
      "review": "Attack of the Clones is a great Star Wars film! Jango Fett is a classic character!"
    },
    {
      "rating": "2.5/5",
      "review": "The Attack of the Clones has some worthwhile action sequences and gorgeous visuals, but some annoying characters, bad writing and cheesy, unmemorable plot points makes this movie still forgettable and bland."
    },
    {
      "rating": "4/5",
      "review": "Great movie to watch on a Saturday night"
    },
    {
      "rating": "3/5",
      "review": "Marginally better than Phantom Menace, if only for the lack of Jar Jar Binks and poor child acting. The dialogue is terrible, the humor often cringey, and the overreliance on CGI is as bad as it gets. But it scores points for a few strong scenes, such as the intrigue surrounding Kamino and the clone army, Anakin's slaughtering of the Sand People, and Obi Wan's space battle against Fett."
    },
    {
      "rating": "3/5",
      "review": "I do agree that this is the weakest of the six Star Wars movies, but it wasn't by all means a terrible movie. I will admit the dialogue is weak and gets nowhere at times, the plot isn't as well thought out and felt convoluted at best, Haydn Christensen does give a truly abysmal performance as Anakin and although the presence of Jar Jar Binks was toned down here his presence anywhere seemed jarring. Still despite the major flaws, it is a marvel to look at with stunning sets and impeccable CGI. The battle sequences are well choreographed, the pace is somewhat brisker than in Phantom Menace and the performances with the exception of Christensen are very good. Natalie Portman is quite captivating as Queen Padma, and displays a lot of emotional depth. Frank Oz is excellent as always as Yoda, and Ewen MacGregor is more at home here than he was in Phantom Menace. There is no doubt though that the acting honours go to Christopher Lee as the villainous Count Dooku. Then again, Lee is an exceptional actor who can act anything you throw at him. Plus John Williams' music was outstanding. Overall, a decent movie while the weakest of the Star Wars franchise. 6/10 Bethany Cox"
    },
    {
      "rating": "5/5",
      "review": "Best of Movies/TV Series Collection"
    },
    {
      "rating": "2/5",
      "review": "Ugh... Well, at least it was better than A Phantom Menace."
    },
    {
      "rating": "1.5/5",
      "review": "Natalie Portman is so hot"
    },
    {
      "rating": "2.5/5",
      "review": "Worst of the Prequels. Even worse dialogue than the first and not good acting overall. Horrific oversaturation of CGI in many scenes where it doesn't even need to be. This movie is not paced that good going between too boring and too much action. There is also too many characters as well. There is no onscreen chemistry between the two love interests either and it is real cringe worthy to watch at times. I don't believe their in love for a second. The cinematography is ok but a mess overall. The action scenes in this especially at the end have too much going on in them and are 100% CGI too often. The massive battle has not aged well and has too much going on at times and oversaturation of CGI. There are tons of scenes that don't make sense and are over the top. I thought going through a asteroid field was supposed to be almost impossible, why not just execute them in the arena by shooting them right from the get go, Yoda flying all over the place, Kenobi getting hit by explosions and they do nothing to him. The soundtrack is solid but not as good as the other 4 mainly because of the romance scenes tracks being so boring and forgettable. The editing is not that good. This jumps constantly between the love story and Kenobi's investigation and than Anakin's Mom. This is even more of a mess than the first because its trying to be a epic Sci-Fi film, romance, and origin story and is extremely bloated because of it. Add in a couple of pointless scenes also like him describing what he did to the Sand People and Yoda fighting for good measure. This is Not a Good Movie though. More flaws than positives for sure."
    },
    {
      "rating": "3/5",
      "review": "Attack of the Clones is my least favorite Star Wars film. This one I believe has aged the worst. Dialogue was stale and writing was poor, but I thought everything else was cool."
    },
    {
      "rating": "1.5/5",
      "review": "It has great world building and a seemingly interesting premise but it's dialogue was poor meaning it greatly affected the acting, the CGI while good at times was overused and frustratingly inconsistent and apparently according to the actor for Obi Wan Kenobi due to CGI being new it greatly affected the actors who didn't know how to work with CGI at the time which makes scenes where seemingly everything else is CGI awkward and this is a personal preference but I think the protagonist Anakin is extremely unlikable even when he seemingly isn't falling to the dark side and just having a casual conversation. TLDR; good ideas absolutely horrible execution"
    },
    {
      "rating": "2.5/5",
      "review": "CGI was a hit or miss. Mostly misses. Acting was not great and mostly poor dialogue didn't help. Speaking of rough dialogue Anakin and Padme had a lot of that. Hayden also kept making this creep face that clearly didn't come off how it was intended to. I find it hard to believe Obi-wan didn't know who Count Dooku was talking about when referring to the Sith Lord. There were a lot of scenes in the movie that just didn't make sense. Like the arena scene seemed to be filled with these illogical moments."
    },
    {
      "rating": "0.5/5",
      "review": "AOTC is the Same as the Phantom Menace just a bad boring movie, this one is slightly better because the characters actually have personality's"
    },
    {
      "rating": "3/5",
      "review": "One of the most cringe romantic scenes in history with Anakin and Padme. Obi Wan steps it up in this one with his acting and his exchange with Jengo Fett. Some of the CGI looked good and some looked really bad. I thought the arena worked well though because it’s the first time we see all the different kinds of Jedi in one scene. The movie adds to the story but some parts were a little slow."
    },
    {
      "rating": "4.5/5",
      "review": "I liked it as a big Starwars fan."
    },
    {
      "rating": "1.5/5",
      "review": "The movie was let down by the atrocious dialogue between the main couple. Had any of the writers actually spoken to a woman before? I feel like I'm watching an awful soap opera."
    },
    {
      "rating": "1.5/5",
      "review": "I don't like this movie, it's irritating."
    },
    {
      "rating": "3/5",
      "review": "My rating for the film is a 6.3/10"
    },
    {
      "rating": "5/5",
      "review": "I’ve always considered this film pure Star Wars with some of the best sequences and character moments in the saga like Obi-Wan on Kamino, seeing signs Anakin’s turn to the dark side throughout the movie, and everything on Geonosis is awesome, I never get tired of watching this movie."
    },
    {
      "rating": "2.5/5",
      "review": "Another crappy Star Wars film. More bad dialogue, especially from Anakin. The main focus was Anakin and Padme's relationship. Dooku literally told Obi-Wan who was the sith lord but he somehow was too stupid to understand."
    },
    {
      "rating": "1.5/5",
      "review": "Better than episode 1 but that ain't saying much. Littered with bad cgi once again and really cringy romantic dialogue."
    },
    {
      "rating": "3/5",
      "review": "This isn't a bad movie it's just boring. I love parts of these movies where you can see the charm and heart. But otherwise, this is the weakest star wars film behind Rising of Skywalker."
    },
    {
      "rating": "3/5",
      "review": "Boring overall. Ok, but acting wasn't the best and story could be less slow and better."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is about as bad as The Phantom Menace but at least it is more enjoyable. The story doesn't make any sense. Palpatine's attacks on padma make no sense. Obi-Wan knows that dooku and the clones are connected, so he knows they were funded by the bad guys and yet the clones just stay with the republic anyway. Like I said this movie makes no sense. Attack of the Clones also has some of the worst dialog I've ever seen in a movie especially the romantic scenes. This movie is bad you can't tell me otherwise."
    },
    {
      "rating": "2.5/5",
      "review": "Its morbin time its kk"
    },
    {
      "rating": "1/5",
      "review": "Just as insufferable as Episode I. This movie has 0 energy whatsoever and it pains me to get through it. I cannot believe people actually call these first 2 movies good"
    },
    {
      "rating": "2.5/5",
      "review": "Yeah, this is better than CATS."
    },
    {
      "rating": "2.5/5",
      "review": "Arguably worse than the phantom menace, this film tries to mix a sci-fi with a romantic twist. The action was solid and some scenes were very unique but unfortunately, the other half of this film was full of more space politics and a less than convincing romance between anakin and padmé."
    },
    {
      "rating": "4/5",
      "review": "This is a better movie than Phantom Menace. As the plot is laid out more. Still some of the movie goes slow for me."
    },
    {
      "rating": "3.5/5",
      "review": "Despite a lot of weird dialogue in the romance scenes and the CGI looking just as bad as the Phantom Menace. I still think it is a decent film, I can have fun with it."
    },
    {
      "rating": "3.5/5",
      "review": "Good, certainly better than TPM but still lacks consistency in how it is portrayed."
    },
    {
      "rating": "4.5/5",
      "review": "I really like the how they showed us the politics!"
    },
    {
      "rating": "5/5",
      "review": "enjoyed it has a good vibe"
    },
    {
      "rating": "5/5",
      "review": "Great acting by Hayden absolutely nailed how an young boy who never learned how to properly socialize, lived most of his life as a slave and now was a teenager eager with so much love and passion to share, with in the end of course turned out not so great for a jedi, but the movie absolutely does his job of proper introducing the love story between Anakin and Padme, great story and even greater score by John Williams, absolute marter piece that doesnt deserve the hate that it got on the release!"
    },
    {
      "rating": "0.5/5",
      "review": "Not ever again , please......"
    },
    {
      "rating": "3/5",
      "review": "The love plot is horrendous, but the action is quite good. Final rating- 6.9/10"
    },
    {
      "rating": "5/5",
      "review": "The origanal 6 are the only cannon star wars."
    },
    {
      "rating": "5/5",
      "review": "My comfort movie. A love story, a mystery, an adventure, and an action thriller, all combined into a feel-good/fun movie"
    },
    {
      "rating": "3.5/5",
      "review": "Coruscant + Samuel L Jackson as Mace Windu == =)"
    },
    {
      "rating": "1.5/5",
      "review": "Holy this movie is bad. Dialogue is basically Padme and Anakin telling each other how much they love each other and this takes up half the film, Obi-Wan is the worst detective in the history, Jango Fett is a useless C-Tier villain who doesn't do much other than be the badass action figure, and third act with Geonosis is mediocre at best."
    },
    {
      "rating": "5/5",
      "review": "I don't like sand, it's course, it's rough, and it gets EVERYWHERE."
    },
    {
      "rating": "4/5",
      "review": "Good, but a some is definitely lacking.."
    },
    {
      "rating": "2.5/5",
      "review": "2.5 because while obi wan plot is good, anakin romantic plot didn't work at all"
    },
    {
      "rating": "3.5/5",
      "review": "This film gets a lot of crap thrown at it, but I liked it. Ewan is Obi Wan. The cloning is cool and Ian McDiarmid is awesome as Darth Sidious. Lots of interesting world building."
    },
    {
      "rating": "4/5",
      "review": "This is a more under-rated movie within the Star Wars universe, probably because the love story between Padme and Anakin. But, if you understand the story that was being told, and understand the acting that Hayden achieved, you would understand it was absolutely Nailed by them. But, its difficult to understand this, unless you watch a few reviews and explained videos on this."
    },
    {
      "rating": "2.5/5",
      "review": "Third act was action packed and set up the third film well. The fight scenes and music were great. The rest of the movie…..not so great. Generally the dialogue was fine but the flirting was cringeworthy. Acting also generally fine but in romantic scenes not so much. Directing was poor in lots of scenes, mainly in directing actors. Second worse Star Wars film, only one worse is The Rise of Skywalker."
    },
    {
      "rating": "3.5/5",
      "review": "i mean its Star Wars:).it was hard not to like"
    },
    {
      "rating": "1.5/5",
      "review": "My vote for the worst Star Wars movie ever made."
    },
    {
      "rating": "3/5",
      "review": "Attack of the Clones, although largely misunderstood, is still impossible to enjoy."
    },
    {
      "rating": "5/5",
      "review": "Why all the hate? yeah sure the acting may be cringe at times but who cares It is star wars! and if you go on YouTube you will find how much it took to make these films."
    },
    {
      "rating": "1.5/5",
      "review": "Rating: D+ I don't know if I dislike THE PHANTOM MENACE more or ATTACK OF THE CLONES less, but I didn't feel the (endless) problems of episode II as much as I - Jar Jar being left aside helps tremendously, thank God. Still, the issues are so many that I can't fit them in a single paragraph. The dialogue is even worse in this one, mostly due to the cringeworthy romantic storyline between Anakin and Padmé. Some of the worst writing the big screen has ever witnessed. I'm usually quite defensive of acting performances, but Christensen is truly, deeply terrible here. There are more lightsaber fights, but none come even close to Maul's sequence in TPM. Once again, the overreliance on CGI elements/characters doesn't help the action set pieces, despite the visuals overall improvement. The score makes most scenes \"look\" better than they are. The screenplay is packed with logical inconsistencies, but it's the poor treatment of the all-powerful, wise Jedi that disappoints me. From their lack of awareness to the made-up, nonsensical rules about their ideology, I really don't know what Lucas had on his mind. Finally, the editing yet again. ATTACK OF THE CLONES is longer than it should. Captivating, important sequences are cut too short, while dull, exposition-heavy scenes are carried on for too long. There's a good movie in here somewhere. I just can't find it. However... Its positives somehow land better this time around. I find most of the action pretty solid. Anakin rescuing his mother is arguably one of the best scenes of the prequels. And again, less Jar Jar. I genuinely think it switches with THE PHANTOM MENACE ... at the bottom of my ranking, though."
    },
    {
      "rating": "2.5/5",
      "review": "this movie itself was like very cringe awful to be honest but you can laugh and have fun with it its somewhat enjoyable?"
    },
    {
      "rating": "4.5/5",
      "review": "Attack of the clones is a better prequel of Star Wars saga."
    },
    {
      "rating": "1/5",
      "review": "Borderline unwatchable. Worse than the Phantom Menace. A truly and inexplicably terrible film. The \"I don't like sand\" scene is the low point of the entire Star Wars franchise. Hard to believe that scene was written, shot and editied in seriousness. A parody of bad writing and character development."
    },
    {
      "rating": "2.5/5",
      "review": "Poorly aged CGI, cheesy lines with great worldbuilding. Only recommend for meme enjoyers and for drinking games"
    },
    {
      "rating": "2.5/5",
      "review": "I don't hate this movie like Anakin hates sand, it has more exciting moments than its predecessor but ultimately suffers worse from the same problems with its lackluster narrative and awkward character interactions, its over usage of visual effects is distracting and for the most part its a bore until a reasonably entertaining final act."
    },
    {
      "rating": "3.5/5",
      "review": "The movie will never be perfect trying to bridge the gap from the beginning, but there are a good bit of moment in this to enjoy the film. It is very much a filibuster between 1 and 3."
    },
    {
      "rating": "3.5/5",
      "review": "Dialogue hasn't got any better, but the action and world building certainly have!"
    },
    {
      "rating": "1/5",
      "review": "The script is horrible, the plot is very messy and confusing, the romantic subplot is not very well handled, and Count Dooku is probably the worst character in the history of Star Wars. However I have to say that I love the soundtrack, it's one of my favourite soundracks from any Star Wars movie, and I also like Ewan McGregor as Obi-Wan, I hope his TV show is good, fingers crossed!"
    },
    {
      "rating": "4/5",
      "review": "I loved this movie when I was a kid, and it's still just as good. Very flawed, but still a fun ride."
    },
    {
      "rating": "2/5",
      "review": "This was an okay movie. 🤛"
    },
    {
      "rating": "2.5/5",
      "review": "Poor dialog and CGI plague this movie more than the other two prequel films. However, the themes of this movie are still in line with what Star Wars truly is, something that cannot be said for the Disney films. Rating - Fine"
    },
    {
      "rating": "1.5/5",
      "review": "This movie just feels so awkward. Don't really like the direction this movie was going for. And it's kinda boring."
    },
    {
      "rating": "4/5",
      "review": "It has some good qualities, it definitely characterized Anakin Skywalker more and set up his anger, which would eventually lead to the rise of Darth Vader. It also had really cool lightsaber fights, which was fun and cool to watch. And it also had a good vibe to it, and I feel like that's what George Lucas was going for. However, it had really cheesy romance scenes/acting, which holds it back. But overall, it was pretty good, and I'd give it like a 7/10."
    },
    {
      "rating": "4/5",
      "review": "This film is very controversial but personally, I think it is good. I enjoyed it slightly more than The Phantom Menace which I also thought was good. The whole prequel trilogy gets hated on way too much but these films are good. And I know some of Anakin's lines are cheesy but that isn't his fault. I really like Hayden Christian as an actor and I think he played Anakin really well in both this film and The Revenge Of The Sith. He understood the character and said the lines that were written down on the script. Overall, I enjoyed this film and thought it was a good instalment in the Skywalker saga."
    },
    {
      "rating": "5/5",
      "review": "This movie had Jango Fett, Kamino, Beautiful Padme, Beautiful Music , Highly underrated love story , I find myself watching the Prequels more than the original 3"
    },
    {
      "rating": "2.5/5",
      "review": "Boring and unconvincing. I think this is the most child-friendly film in the saga."
    },
    {
      "rating": "4/5",
      "review": "The most underrated Star Wars movie, in my opinion. It is consistent, there is the right amount of action, and interesting themes throughout. Many bemoan Hayden Christensen's acting, but I think he is pretty good. He is exactly what you'd expect an angsty 19 year old to be. By no means is it a perfect performance, but he did a solid job. Sets up Revenge of the Sith nicely,"
    },
    {
      "rating": "1.5/5",
      "review": "The worst of the doomed prequels, Ewan McGregor carries Hayden Christensen's horrific acting. The heavy reliance on CGI makes it an eyesore to watch on top of other problems. A waste of talents like Christopher Lee who was casted as the imposing Count Dooku. Still, as a fan of Star Wars, it's still fun if not taken seriously."
    },
    {
      "rating": "2/5",
      "review": "I was a defender of the prequels. This was mainly because I thought the 3rd movie was pretty good. But rewatching this reminds me why a lot of people hated it. The movie is a mess. The acting and writing are just as bad or even worse than the first one. The movie has almost no redeeming qualities except for the VFX and the fact that this movie is so goofy it's kinda funny. Overall, a bad movie that is made to be made fun of."
    },
    {
      "rating": "4/5",
      "review": "The dynamic between Hayden Christensen and Ewan McGregor is my favorite part about this movie."
    },
    {
      "rating": "3/5",
      "review": "Hot Take: Phantom Menace is better. Something didn't sit right with this movie for me, it felt forgettable. It uses the formula of switching between plot lines that come together at the climax. Characters felt plain at times as well."
    },
    {
      "rating": "2.5/5",
      "review": "I thought it was ok. It's just that it was a little long and showed a little too much of the love forbidden stuff between Padme and Anakin. Other than that, it was so so."
    },
    {
      "rating": "4.5/5",
      "review": "Honestly it's the most underrated Star Wars and the one of most over hated movies of all time! It has great action, revaluationary effects, good acting, great characters and an excellent story! Also the sound, costume and ships designs are amazing!"
    },
    {
      "rating": "3.5/5",
      "review": "only thing bad is padme and anakin relationship everything else was incredible"
    },
    {
      "rating": "4/5",
      "review": "very good and natalie portman is fucking hot"
    },
    {
      "rating": "2/5",
      "review": "Less boring but still boring"
    },
    {
      "rating": "3.5/5",
      "review": "The Battle has began. George Lucas has built on the story development focusing on Anakin Skywalker but fails to focus on any other character but him."
    },
    {
      "rating": "3/5",
      "review": "In my opinion the weakest of the prequel trilogy.'attack of the clones' suffers from dialogue that on paper is borderline grotesque but the actors, to their credit, try to give it their all. And the acting has definitely improved from the last film of the trilogy."
    },
    {
      "rating": "5/5",
      "review": "Loved it, I don't care what people say"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is impossibly horrible"
    },
    {
      "rating": "1.5/5",
      "review": "Star Wars 2 a.k.a part 2 of the prequels is well, only for the star wars memes and if you are a fan of Star Wars."
    },
    {
      "rating": "5/5",
      "review": "Loved the movie when it came out. This movie has aged very well"
    },
    {
      "rating": "4/5",
      "review": "In more recent years Clones has developed a reputation as the worst of the films in the Star Wars saga, but I couldn't disagree more with that assessment. In fact this is my favorite among the prequel films. It has this energy and style that just feels so undeniably \"Star Wars.\" There's some thrilling action sequences, an intriguing plot, some breathtaking visuals and photography...and of course a top notch score, and that imaginative, visceral world that's so much fun to spend time in. It's not flawless though, there are some clunkier bits that interrupt the flow of the film, the effects themselves are nothing short of amazing for their time but have a tendency to feel uncanny as though the actors believe they're somewhere else... and your mileage may vary when it comes to the dialogue and romance (A common complaint that's never bothered me to the degree it clearly bothers others)."
    },
    {
      "rating": "4/5",
      "review": "Bad romantics scenes. It has good fights and interesting plot."
    },
    {
      "rating": "4/5",
      "review": "One of the most under rated movies ever for me I absolutely loved it and I rate it a 8.5 out of 10"
    },
    {
      "rating": "0.5/5",
      "review": "basically as bad as phantom manace 1/10"
    },
    {
      "rating": "3.5/5",
      "review": "I will not go here to list how little I liked this movie, I just want to specify what not to do in a star wars movie which is, talk less, get on with the plot and fight more. Beautiful only the fighting in the arena and the photography."
    },
    {
      "rating": "5/5",
      "review": "Acting could be a bit better but great story"
    },
    {
      "rating": "2/5",
      "review": "This installment is better then the first prequel, but that is not saying much. I think the first half of this movie is quite boring, as the audience is forced to sit through the awkward and downright creepy \"love\" scenes between Anakin and Padme. The scenes in question are filled with bad dialogue and acting. Besides this, Obi-wan's adventure takes up a sizable portion of the picture before it gets interesting. However, the second half of this flick is pretty fun and the action and soundtrack are the redeeming qualities in this film. 4/10."
    },
    {
      "rating": "2.5/5",
      "review": "While I have always enjoyed this movie more than The Phantom Menace (1999) the majority of the public disagreed and stated this is the worst. I could possibly see that The Phantom Menace (1999) is better from a technical standpoint. But this movie is a turning point in Star Wars history."
    },
    {
      "rating": "3/5",
      "review": "Good movie, more or less villain, I love the romance between Padmé and Anakin."
    },
    {
      "rating": "4/5",
      "review": "I'm a huge prequel fan and I very much like this movie. It certainly had its boring parts but this movie build the SW lore, unlike any other SW movie. The lightsaber duels were spectacular as well. 4/5"
    },
    {
      "rating": "4/5",
      "review": "This movie is interesting to watch, sometimes I'm watching for the Anidala romance (it's cringey back that almost makes it more honest) Obi-wan's detective attempts, Palpatine being delightfully horrible. I did want to smack Obi-wan on the back of the head a few times for they way he spoke to Anakin, mostly in the, if you want your padawan to listen, maybe don't shoot him down every time he opens his mouth. I will say, C3P0 was not very funny in this? And to much of his stuff was smushed together in editing. But hey Artoo has jets. XD"
    },
    {
      "rating": "1/5",
      "review": "This movie turned the Jedi into a bunch of weird emotionless monks who are ok with creating a whole race of people just to have them fight in War. On top of that, it's boring."
    },
    {
      "rating": "5/5",
      "review": "Very good action scenes, well constructed story, good enjoyable. Good introduction to the series and the third part, despite a little uninteresting plot of Anakin and Padme, Kenobi's plot makes up for it very much"
    },
    {
      "rating": "1/5",
      "review": "how can star wars be so boring?"
    },
    {
      "rating": "4/5",
      "review": "A fun movie with some failures in writing and directing but overall fun to watch"
    },
    {
      "rating": "1/5",
      "review": "Worst Star Wars film so far. From horrendous dialouge to Hayden Christensen's wooden acting (not actually his fault) to sand this film is not enjoyable in any manner. The only highlight of this is the Jedi battle on Geonosis. Even the fight between Yoda, Anakin and Obi-Wan versus Count Dooku is ruined by what I call AVPR (Aliens VS Predator: Requiem) syndrome, aka, a good scene ryined by murky lighting. Overall recommend skipping this one, all you need to know is that the villain is now an OAP and begun, the Clone War has."
    },
    {
      "rating": "2/5",
      "review": "Tied for the weakest episode in the Star Wars Universe, AotC is both goofy, poorly acted, and it's visuals have aged poorly. I have to give it a star for Yoda's kickbutt scene & for having a few decent sequences with Obi-Won and Boba Fett's father."
    },
    {
      "rating": "0.5/5",
      "review": "Lessons weren't learnt from episode 1, another uninspired plot with awful CGI. A shame when the original trilogy is so iconic."
    },
    {
      "rating": "4/5",
      "review": "This is probably the first Star Wars film to have decent special effects by today's standards."
    },
    {
      "rating": "1.5/5",
      "review": "Worst love scenes in movie history. Rest of the movie is fun, if barely believable and despite some horrendously wooden acting. Much worse than The Clone Wars animated movie."
    },
    {
      "rating": "1.5/5",
      "review": "Cringy, boring, and visually outdated. There are maybe a couple of interesting plot points and scenes, but nothing more. Avoid Attack of The Clones"
    },
    {
      "rating": "2/5",
      "review": "A lot of stupid, cringy, scenes with padme but it has made one of the greatest memes ever, I don't like sand."
    },
    {
      "rating": "5/5",
      "review": "Natalie Portman looked amazing"
    },
    {
      "rating": "3.5/5",
      "review": "This is the weakest Star Wars movie. Mainly because of the bad writing. I don't like sand. It's rough and course and gets everywhere."
    },
    {
      "rating": "3/5",
      "review": "An average Star Wars flick but the most exciting part was the forbidden love story between Anakin and Padme."
    },
    {
      "rating": "2/5",
      "review": "Continues the story but seems forced in parts. The CGI is actually worse here than in any other Star Wars movie - a mistake to overuse computer graphics to tell a story IMO. The fighting is not as memorable as the Phantom, there's not much going on in space that's interesting, and the dialogue is awful. The scenery is the only excellent part of this film. If I'm being brutally honest this is one of the worst Star Wars movies - forgettable, bad graphics, and bad acting."
    },
    {
      "rating": "2.5/5",
      "review": "With dialogue that is unbearable to listen to and a story that is extremely convoluted, \"Attack of the Clones\" stands as the worst \"Star Wars\" movie to its date, providing some of the worst dialogue between characters in any movie ever made. The entire story tries to cram too much information into it, and it ends up jumping around a lot to try to fit everything into its run time. However, where I think that this film soars is in its action, especially the battle of Geonosis, which takes up the entire third act of the film. It is absolutely entertaining to watch and the CGI helps it out a lot. The new characters introduced are also very great, and the worldbuilding is some of the best. However, due to its high number of flaws, while there was a lot I enjoyed about the film, the high number of bad ends up bringing this film down for me."
    },
    {
      "rating": "2.5/5",
      "review": "Just the dialouge hurt the movie. Obi-wans adventure was entertaining, along with the geonosis battle. Padme and anakin had brutal lines which holds it back."
    },
    {
      "rating": "3/5",
      "review": "Sin duda aunque esta película de Star Wars no sea la mejor es muy entrañable, Con secuencias de acción muy bien logradas, y con una gran variedad de escenarios que cada uno es único y se siente la dedicación de la producción de que así fuera. Otra cosa que me gusta mucho de esta película es su increíble banda sonora, a la que Star Wars ya nos tiene acostumbrados. Aunque la película en ocasiones avance lentamente, cuando la historia se propone en hacer una película épica lo logra. Con una cantidad espectacular de distintivos de la saga, ya sean naves o personajes, que cada uno parece que podría tener su película. Sin duda esta película es muy buena en su género, logrando ser interesante en casi todo momento y con unos efectos especiales que se sienten vigentes hasta ahora, La mayor expresión de George Lucas."
    },
    {
      "rating": "4/5",
      "review": "Molto molto molto bello"
    },
    {
      "rating": "1.5/5",
      "review": "It's boring and dull. The acting is bad and the story is poor written. The Dialogue is cheesy and it's very forgettable."
    },
    {
      "rating": "1.5/5",
      "review": "Like The Phantom Menace, but worse."
    },
    {
      "rating": "2/5",
      "review": "First Half is not very good, The other is alright"
    },
    {
      "rating": "2/5",
      "review": "Perhaps the biggest let down of all the Star Wars installments. The story line had so much promise."
    },
    {
      "rating": "5/5",
      "review": "Third best star wars movie IMO definitely deserves this rating"
    },
    {
      "rating": "4.5/5",
      "review": "A very great movie, but not as good as Revenge of the Sith. The emotional build up for Anakins story and the character development and relationships are great, but thedialogues a little bit too placative. The classic theatralic staging of the battle between good and evil is nicely mixed with the story arc in which the transformation between the old republic and the clone wars occurs. Good mix of calm and action scenes, great mysterious story arc."
    },
    {
      "rating": "3.5/5",
      "review": "Fun, well paced action movie. Cheesy Dialogue at times, but overall a fun movie."
    },
    {
      "rating": "2/5",
      "review": "It long and dull and the acting is pretty bad. Are some cool moments, so it's not totally irredeemable. But why slog through it? The original Star Wars exists, just watch those instead... or the Mandalorian!"
    },
    {
      "rating": "3/5",
      "review": "Star Wars Episode 2 is filled with boring Ankin subplots, but in return offers a thrilling final act.(6.5/10)"
    },
    {
      "rating": "1/5",
      "review": "It was like a soap opera in the space and that is the best critic that i can give it. 2/10"
    },
    {
      "rating": "3.5/5",
      "review": "This movie is a mixed bag for me, there is a lot I really liked but there are also things that I don't think worked. I really do like the cast a lot and I love the relationship between Obi-Wan and Anakin as it feels like a true brotherhood as there are plenty of times when they don't get along but simultaneously you know they truly care about each other. I love the progression of Anakin's turn to the dark side the stuff involving his mother was the best part of the movie and although it wasn't as strong as the first film it still does leave with a sense that this is not going to end well and you do feel the looming dread of what's to come. However, Its pacing isn't great, and Count Dooku wasn't introduced till way too late and we didn't get to know and why he's making these decisions, considering you have Christopher Lee playing the role you could have done a lot more. And yeah I mean some of the dialogue wasn't great. But overall, this was still a solid movie with many highs and nowhere near as bad as some make it out to be."
    },
    {
      "rating": "5/5",
      "review": "I think everyone is very harsh on the prequels, I enjoyed all the star wars movies, and this one is actually one of my favorites. I also started with the prequels then watched them in chronological order."
    },
    {
      "rating": "2.5/5",
      "review": "The director George Lucas' attempt at reinventing his famous trilogy, Star Wars, is at worst an epic disaster and a mistake. Wooden performances and extremely dated special effects that make Lucas', A New Hope (1977), look like a masterpiece. With that said, it still holds what makes Star Wars a timeless saga. It's characters, though undeveloped, are interesting and watchable enough for me to bluntly enjoy the experience. I can also complement how it is not a carbon copy of his original work, and follows a different premise. I have to say, in conclusion, that Attack of the Clones is not a good movie, but nor is it bad. We have seen worse from the franchise."
    },
    {
      "rating": "3/5",
      "review": "This movie has a great many deal of problems just like phantom menace but attack of the clones has the worst chemistry and one of the worst love stories of all time, but in my opinion it has the best lightsaber battles in the entire prequel trilogy and Jango Fett was Bad Ass."
    },
    {
      "rating": "3/5",
      "review": "Uneven, a little boring. Clearly the weakest of the prequels."
    },
    {
      "rating": "3.5/5",
      "review": "Better than phantom menace but still bad compared to the original trilogy"
    },
    {
      "rating": "1/5",
      "review": "The love plot between Anakin and Padme did not to take center stage in what was a very abysmal film and didn't have anything going for it until the clones arrived on Geonosis."
    },
    {
      "rating": "5/5",
      "review": "Besides the writing, and acting at parts, it produces insights of the most famous movie character of all time Darth Vader. And does it in a subtle yet satisfying way. Growing up with this film, watching it at least once every year proves that it does its job well."
    },
    {
      "rating": "5/5",
      "review": "I personally loved it. It has an epic scene with all the Jedi in the arena, and it has a cool saber fight with Yoda and Dooku. It also introduced the clones and made the clone wars show possible which is one of if not the best star wars show EVER! Overall a good film and addition to the star wars saga..."
    },
    {
      "rating": "3/5",
      "review": "Zzzzzzzzz…….What’s that? A anakin and Padme are in love now? Why not. Wake me up when we get to the part with the stormtroopers…….zzzzzzzzzzzz"
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this movie. PM was a flop but this was not. Tons of great fight scenes, a lot of insight into the fall of the Jedi order, and Anakin's development really showed. Let's not forget about Obi-Wan, fantastic!"
    },
    {
      "rating": "1/5",
      "review": "Similar to Phantom Menace, it had nothing good going for it, had a very forgettable story, and besides some decent looking effects, it was a big let down to where it is by far the worst Star Wars film ever made."
    },
    {
      "rating": "2.5/5",
      "review": "After the disappointment that Star Wars Episode I was, I couldn't get myself to watch the second movie in the prequel trilogy. But the thing about Star Wars is that there is no way you can possibly hate the franchise no matter what it does. Even if there's one bad movie there's still a new hope (ba dm tss!), that probably the next movie does fix some stuff. And I can tell you with a guarantee that Star Wars: Episode II - Attack of the Clones is definitely not that kind of a movie. And no, I'm not scared of some kid marking my review unhelpful who probably lives in the basement of his parents' house. One problem that constantly plagues the Star Wars prequel trilogy is that most of the good stories happen while the camera is not on the characters. There is a scene where Kenobi and Anakin are in an elevator while going to save Padmé from an assassin and talking about their previous adventures. And trust me, all those adventures sound WAY more fun than what we are being made to watch. Most of the characters shown throughout the movie are there just for the sake of being there, without any amount of character development. That's not to say I absolutely dislike this movie. I really like the whole Jango Fett arc. It was one of the most memorable parts of the movie. There was also the colosseum fight which wasn't good but at least it was memorable. Also the part where C3PO accidentally falls on the assembly line and gets his head replaced by another robot. Other than that most scenes are easily forgettable, not as in I have forgotten they ever happened, but rather I have forgotten whether they happened in Episode II or III. I had to look up the scene I wrote in the above paragraph to make sure it happened in this movie. The CGI, once again is terrible. I don't know what's the problem with the cinematography of this movie. It makes it look so boring. And of course, here's the movie where Anakin and Padmé start getting, well. I don't know what's with Star Wars movies and accidental incest. I get it's supposed to be a space opera, but this goes a little too far. Also the acting is super campy. One person will finish the dialogue, then the next person will speak. And I think it's a good thing because of how high the background music is. If two people start speaking together it will become impossible to hear altogether. I had said that I'd try giving another watch to Star Wars: Episode I, which is hard because of how cringy Jar-Jar Binks. But here it's hard because only the Jango Fett scene was fun. This is, in my opinion, the worst Star Wars movie made by George Lucas. Trust me when I say I get no joy from saying all of this. I still had the courage to watch the franchise further, and I'm really glad I did since Revenge of the Sith really redeemed the trilogy for me."
    },
    {
      "rating": "3/5",
      "review": "O pior da prequel. Só não é pior que a Ascensão de Skywalker."
    },
    {
      "rating": "4/5",
      "review": "While it is not the best of the Star Wars Saga, and there is a bit of cringeworthy dialogue, it is still action-packed and very entertaining to watch, a very good movie indeed."
    },
    {
      "rating": "3.5/5",
      "review": "The first half of Attack of the Clones is fairly lackluster with some good bonding moments between Obi-Wan and Anakin. The second half is much better when we see the fight at the arena on Geonosis. Seeing Yoda in action against his former apprentice was a fantastic scene as well."
    },
    {
      "rating": "2.5/5",
      "review": "This is a 3 Star worthy movie that is stretched to a runtime considerably longer than it should be. The movie itself is largely a bit entertaining by and large, even though it's really rather hollow, which makes the obvious time-stretching bits a bit more taxing.. What's really odd is that if you look at the Deleted Scenes, there are A LOT of well-written bits of Character-building that were cut from the movie, and I really, really cannot fathom why these were cut instead of some of the bits that made it into the movie, as these are EASILY some of the best moments in the movie. Like, truthfully, I kinda wish that they made an Extended Cut of this movie, because these Deleted bits, if placed back into the movie, would likely make the movie have more impact...It might still suffer from the poor pacing, but everything would actually have more meaning, which is the main thing that this movie lacks: A Purpose. Now, in terms of the movie itself, the dialogue is not of good quality, but it's more 'flat' and 'functional' rather than something the kind of dialogue that fancies itself brilliant but is actually dumb, and frankly, I prefer this kind of bad myself. The image is crisp and the use of HD filming, as this was one of the very first movies to ever do this, was certainly effective, and while much of the CGI certainly looks dated (admittedly some still looks good), the Composites in regards to how everything Practical and Digital fit together still holds up. The musical score is a bit better than that of Episode 1, as is the Acting, although the latter really just brings it from the low-end of Mediocre to mid-tier Mediocre. And lastly, the action is pretty good, but not on par with Episodes 3, 5 or 6. Sadly, the movie also focuses on a love story at the center, and it's really quite shallow and awkward, albeit I do think there's a couple of very small moments that do slightly work. But overall, this is just a somewhat unnecessary movie, as could've ultimately been made into a 15-30 minute story, but I think George Lucas simply wanted his Story to be in a particular place for his Final Chapter, which is certainly fine - the problem is just that this movie suffers as the result of it. Still, I don't remotely hate this movie - I'm just more than willing to admit that it suffers from many shortcomings."
    },
    {
      "rating": "0.5/5",
      "review": "Part 2 of the pointless Star Wars prequels. Just watch 4-6 and 7-9 instead."
    },
    {
      "rating": "1/5",
      "review": "I distinctly remember zoning out while the opening music was still playing… 🤤"
    },
    {
      "rating": "4/5",
      "review": "Unlike TPM (Part 1), there less that's annoying about this movie (i.e. less Jar-Jar) & more that's great (Hayden Christiansen, Obi-Wan taking control in a crisis, showing Natalie Portman's more colorful wardrobe & greater acting range, and Samuel Jackson being a badass Jedi)."
    },
    {
      "rating": "5/5",
      "review": "This film did not deserve any of the hate it received. It is emotional, exciting, and action-packed. I still believe to this day that Christensen is an amazing actor."
    },
    {
      "rating": "5/5",
      "review": "A fun and enjoyable movie"
    },
    {
      "rating": "1/5",
      "review": "If this isn't the worst..... If Hayden Christensen isn't the most insufferable actor on the planet, I'd like to know who is...."
    },
    {
      "rating": "4.5/5",
      "review": "It really gets too much flack for what it is; a decent A-B movie with needed time to develop the relationship but doesn't stick around long enough to get boring. Every part with Obi-wan is great and leads to an awesome arena fight and an ending that sets up one of the best parts of Star Wars lore: the Clone Wars themselves."
    },
    {
      "rating": "3.5/5",
      "review": "6.75/10. Though an improvement over it's predecessor, writer/director George Lucas has a long way to go in restoring glory to this franchise. Some great action sequences, superb effects, and great art direction are to be expected from a 'Star Wars' picture, and this one delivered. The improvements over the first episode comes from the acting and plot line featuring Ewan McGregor, who develops Obi-Wan into the wiser, more recognizable Jedi master we know from the original trilogy while playing psuedo-detective for the bulk of the film. Christopher Lee as the primary villain is a treasure also a treasure in his role. The film sputters when it focuses on the ghastly love story between Jedi padawan Anakin Skywalker (Hayden Christensen) and Senator Padme Amidala (Natalie Portman). The forbidden love angle is so worn out and rife with cliche that it's difficult not to laugh at. Christensen portraying his young, dumb, and in love character more like a psychotic abuser is baffling. Portman's acting might have made sense had Anakin been portrayed correctly, but Christensen boxed her character into seeming foolish, unable to see the mad man before her eyes, and certainly not discerning enough to be a galactic senator. None of this is helped by the script, which gives the actors nothing to work with and is awful throughout. A mild improvement isn't strong enough evidence that Lucas should continue as the primary creative architect of this franchise."
    },
    {
      "rating": "2.5/5",
      "review": "Easily the worst of all the Star Wars films. Awful acting and laughable dialogue made this film so hard to get through. Obi-Wan really tries hard to carry this whole film, but he can only do so much to hold up this force sized turd. 5/10"
    },
    {
      "rating": "2.5/5",
      "review": "Decent overall plot, marred by the cringeworthy scenes between Annakin and Padme, along with a horribly wooden performance from Haydn Christensen."
    },
    {
      "rating": "2/5",
      "review": "The story progression is super slow at the beginning. The romantical part between Anakin and Padme is annoying and In my opinion, you could cut out almost the entire first 45 minutes of the movie (except the scene where Obi-Wan and Anakin are flying through the \"city\") The sound just like in Episode 1 is well done and one of the positive factors of Attack of the Clones. Again the scenes containing Anakin's mother are awful. The transitions are once again Windows Movie Maker quality. The character development of Anakin is misery. He behaves like a little child and makes one dumb decision after another. C3PO and R2D2 are super cute and always making me smile. The \"factory\" scene is completely bad. Within the last 45 minutes, the movie really gets better. The action sequences are super nice and highly entertaining. Also want to add that Christopher Lee plays good and his performance is the best acting-wise."
    },
    {
      "rating": "2/5",
      "review": "The low point in the Star Wars saga until Disney got their hands on it."
    },
    {
      "rating": "4/5",
      "review": "Wow, very evolutionary, because it showed us the origin of what the empire will be with the army of the clones, and more events during the development of this installment, although the evolution of our heroes is a bit slow, in the end it works , It is brilliant."
    },
    {
      "rating": "1.5/5",
      "review": "It's just as bad if not worse than The Phantom Menace."
    },
    {
      "rating": "3.5/5",
      "review": "This movie was great, the only problem I have is that the first half is very boring and has a lot of corny love between Padme and Anikan. BUT the second half was amazing! which totally makes up for the first half/"
    },
    {
      "rating": "3/5",
      "review": "This is my least favourite Star Wars movie, it doesn't mean that i hate it, it's just the one that i think has the most flaws. I acctually enjoy most of this movie, especially the action sequences and Obi-Wan but the romance badly written and some plot holes make this the weakest of the series."
    },
    {
      "rating": "2/5",
      "review": "SUPER-bland, airless computer graphics movie hampered by unfavorable comparison to a completely different (and more successful) movie aesthetic created in the Star Wars timeline twenty years earlier. \"Classic\" Star Wars characters (played by puppets or robotic props) appear, for instance the absurd \"Yoda showdown\" that shows how bad CGI animation, improbable storytelling and a general Big Hollywood Flair for shallow, sugary details can disappoint an audience. Critics at the time couldn't be bothered being nice to this one either; unfortunately none other than George Lucas was behind the wheel, suggesting whatever gift he had for tactile fantasy sequences and dynamic casting had completely left him at this point. The great concept artist Ralph McQuarrie from the original trilogy didn't appear either, replaced by someone that likes insectile, flimsy design and over-cluttered backgrounds. Motion picture release spawned retail toy items, low quality \"Clone Wars\" animated spinoff feature also."
    },
    {
      "rating": "4/5",
      "review": "Super interesting and engaging story, although the execution isn't perfect. Like Episode 1, the action is phenomenal and the last 30 minutes has some of the best sequences of the whole saga. Also, I find the mystery plot line with Obi Wan to be very enjoyable and the romance with Anakin and Padme to be a little cringe worthy at times, but it's believable and makes sense."
    },
    {
      "rating": "5/5",
      "review": "A guilty pleasure. Call me crazy but I love the prequels."
    },
    {
      "rating": "2/5",
      "review": "I don't know how the critics favour this more than phantom menace. Honestly, Episode I and II are the weakest films in the prequels. Especially this one. Once again we get film sets and cgi galore that do look great, but we get poorly written dialogue, strange acting that feels unnatural and a plot that just seems improvised the more the film goes on. The romantic chemistry is worse than Twilight. Yeah, you heard me. In conclusion, this film gets a star for good special effects/sound and a star for the soundtrack."
    },
    {
      "rating": "1/5",
      "review": "Eurghhhhhhhh another interminably boring Star Wars film. Please put me out my misery. One more to watch tomorrow. Plus points, slightly better CGI than prior films and Nathalie Portman wearing tight white trousers and crop top. Downsides? Literally everything else."
    },
    {
      "rating": "2.5/5",
      "review": "Movie had its moments. it could've had more action and less romance."
    },
    {
      "rating": "5/5",
      "review": "Ok I get the criticism, but Jango Fett tho. I'm mean I'm Richard and its Star Wars so obv I love it."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is alright a few people think this is the worst star wars movie and I completely disagree I mean it had way less Jar Jar Binks in it he is is kind off less in is kinda less annoying in this movie then he was in The Phantom Menace. The movie had a rather good plot line with the clones . Is there downsides? yes there's a few but like one you know who Darth Sidious is a mile away and the Anakin and Padme scenes are sometimes cute but mostly cringy . And Count Dooku is the best bit of the film he is a amazing villian and has a very scary personality"
    },
    {
      "rating": "3.5/5",
      "review": "Ohne Romanze ist es ganz gut."
    },
    {
      "rating": "1.5/5",
      "review": "Second worst star wars movie. The whole thing felt like a joke."
    },
    {
      "rating": "2/5",
      "review": "20.03.2021 ---------"
    },
    {
      "rating": "5/5",
      "review": "How you like me now that you’ve seen the last 3 episodes? Huh ??? In comparison this is so much better."
    },
    {
      "rating": "3.5/5",
      "review": "A slight step down from the previous Star Wars film but it's still worth viewing at least once. This is the digital Star Wars movie and perfectly expresses just how far ahead of his time George Lucas was because frankly the technology wasn't there for what they needed for so much of this movie. Hayden Christensen's performance has been criticized but I have 2 key things that you've probably never realized before that totally fix his performance: it's not his fault if it's bad, it's George Lucas's directing because it's his vision of Anakin Skywalker. But then again have you ever considered that Anakin is a 19 year old hormonal teenager with NO romantic experience with women? That solves pretty much the whole problem with him. Yes it's cringy but it does make sense. Pretty much the whole 3rd act of this movie is and forever will be an absolute blast and you shouldn't skip this movie on your Skywalker Saga binge watch because it's a lot more critical than you realize."
    },
    {
      "rating": "4/5",
      "review": "There is room for improvement, but I'm satisfied with Attack Of The Clones. A pretty solid plot and some great thrills make this a nice star wars flick in my opinion."
    },
    {
      "rating": "5/5",
      "review": "An underrated film with unique characters , great music scores , and a continuation of the Phantom Menace .This movie starts the setup of Anakin's fall to the dark side. We also see some great CGI scenes and also things we've never seen before. Like all the Jedi coming together in a battle and the romance between Anakin and Padme combined with one of the best music scores in Star Wars."
    },
    {
      "rating": "4/5",
      "review": "Fantastic second entry in the PT"
    },
    {
      "rating": "4/5",
      "review": "Desde mi punto de vista es la peor de Star Wars, pero eso no implica que tenga una mala historia."
    },
    {
      "rating": "1/5",
      "review": "Garbage movie where they decided to slaughter Anakin's character and make him a gay guy with gay voice lines. \"I hate sand\" what a joke. Fight scenes were alright tho."
    },
    {
      "rating": "2/5",
      "review": "The worst Star Wars film."
    },
    {
      "rating": "3/5",
      "review": "I didn't like this movie as much as the other ones either. I didn't like the way that the directors executed the story but I think it could've been better."
    },
    {
      "rating": "2/5",
      "review": "Nothing more than a long lovestory with a huge battle at the end to try and redeem it. Nothing more needs to be said and don't try and defend it"
    },
    {
      "rating": "2.5/5",
      "review": "O PIOR FILME DE STAR WARS QUE É A MAIOR SAGA DA HISTÓRIA PELO MENOS PARA MIM, E A MINHA FAVORITA."
    },
    {
      "rating": "5/5",
      "review": "Just, simply perfect..."
    },
    {
      "rating": "3.5/5",
      "review": "While Episode II seems to wander from the story it needs to get to the point of, it ultimately serves as a thrilling - and sometimes touching - middle movie."
    },
    {
      "rating": "3.5/5",
      "review": "I know that it is not the best Star Wars Movie but there a some scense and Charcters that i just like to much to give this moive a bad review. And after all its the introduction of the Clone Wars, which also introduces the awesome series \"Star Wars: The Clone Wars\""
    },
    {
      "rating": "4.5/5",
      "review": "This is a Star Wars movie to remember! Fun, great story, character development, plot twists, and the action is fantastic."
    },
    {
      "rating": "4.5/5",
      "review": "A much better film than the phantom menace, that may be an unpopular opinion, but its mine and I'll explain. I have only 2 flaws with the movie the love scenes and the actor who played young boba fett. By god the love scenes were pretty bad, not awful, but really bad, the actor who played young boba fett daniel loga, could not act and was suprisingly even worse than Jake lloyd. But the good stuff in my opinion, is great. The best thing(s) in this movie are Ewan Mcgregor's performance, Jango fett & the humor. Ewan mcgregors performance is weakest here in the franchise, but still delivers a great performance, its subtle calm and would be what I think a young obi wan would talk, look and sound like. The humor is best here in the star wars franchise, there is a scene where obi wan gets a drink and a person tries to sell him jedi drugs and he uses his jedi mind tricks to tell him to go home and rethink his life. And Jango fett is one of my absoloute favortie star wars characters. He's a much better character than boba fett, because, he has actual character, he's tough, convincing he looks really cool he can fight well and take out as many people as possible. Hayden christensen cant deliver dialouge too well, but can really act and look like a young darth vader, they give him flaws in this one, which makes it much better, because he is no longer a perfect character and now he seems more like a character. Natalie portman does a good job as padme for the most part. the dialouge, not counting the love scenes, are good and much better than the phantom menace. This one also has less jar jar and the cgi still looks good especially with all the clones and the battle with them is great. I love the character of count dooku and christopher lee once again brings a great performance. The character, while no the best, is not the worst either. I do think the scene where yoda is fighting dooku gets a lot of flack just, beacsue its yoda with a lightsaber, but whats overlooked is that dooku knows that both of them have too much power with the force and they have to batle qith a lightsaber to determine who is the more skilled and well trained. The score is again great, with the beautiful love theme is another one of John Williams best. Attack of the clones 87% A-"
    },
    {
      "rating": "1.5/5",
      "review": "Palpatine's plane is based on luck.Anakin Skywalker is a mad men.This movie isn't fun to watch.Don't make this your first time watching Star Wars"
    },
    {
      "rating": "5/5",
      "review": "Has one of the most epic moments in modern cinematic history, when Anakin is racing through the desert on his speeder looking for his Mother I get chills every time. Definitely one of the best Star Wars movies ever made! This film fixes all the errors of the previous film and improves what the previous movie did right in every way."
    },
    {
      "rating": "5/5",
      "review": "Yeah, this is awesome."
    },
    {
      "rating": "3/5",
      "review": "Better than 'Star Wars: Episode I – The Phantom Menace', though 'Star Wars: Episode II – Attack of the Clones' is again rather underwhelming - if still good on its own merits. Liam Neeson is missed, with the likes of Ewan McGregor, Natalie Portman, Hayden Christensen and Christopher Lee failing to set the world alight. McGregor does give the best performance of that quartet; Christensen possibly the weakest, though his character's story is probably the most interesting - or its overall arc, at least. Those onscreen aren't helped by the dialogue, which is very basic and run-of-the-mill. I found the score a little forgettable, even if it's still fun to hear the key pieces of it. The plot is watchable, but I did expect greater storytelling from these two follow-up releases to the original trilogy. The CGI is, marginally, an improvement on this film's predecessor."
    },
    {
      "rating": "2/5",
      "review": "Star Wars: Episode II - Attack of the Clones is a bad movie. The best parts of this movie are easily the music, Ian McDiarmid as The Emperor, Ewan McGregor as Obi-Wan Kenobi and of course, Sir Christopher Lee as Count Dooku otherwise known as Darth Tyranus. Other than that this movie is not good, the plot is somewhat passable, the performances are even worse than before (especially with Padme), the dialogue is atrocious and the CGI, while better than the CGI in TPM is beginning to age. Still better than the previous movie though."
    },
    {
      "rating": "2/5",
      "review": "latarki świetlne włączone ale wszystko jakoś bez polotu"
    },
    {
      "rating": "3/5",
      "review": "Mixed feelings I have on this movie. It’s not bad but can be very slow for big chunks and the dialog is sub-par at best. Way too much CGI which hasn’t aged particularly well."
    }
  ]
}