{
  "movie_name": "Transformers",
  "reviews": [
    {
      "rating": "5/5",
      "review": "Me and my family we’re watching the transformers movie and it’s was awesome and great I love of the characters of the movie I will give 10/10 ."
    },
    {
      "rating": "3.5/5",
      "review": "As good as it gets for the live action Michael Bay movies."
    },
    {
      "rating": "4/5",
      "review": "Felt like it started off pretty slow but it was still such a good movie, the fight scenes were lit, the jokes are top notch, and the introduction to all the autobots and the showing of deceptions was dope, Highly recommend this movie"
    },
    {
      "rating": "4/5",
      "review": "One shall stand. One shall fall."
    },
    {
      "rating": "1/5",
      "review": "The audience for this movie is mainly males aged 12-25. Nothing remarkable. Only Megan Fox in the car."
    },
    {
      "rating": "5/5",
      "review": "Absolute cinema, just like, just, just, yes. The storys realy good and the action goes crazy 9.5/10 Joshy Boy 6,000's sigma movie award:🗿"
    },
    {
      "rating": "2/5",
      "review": "Didn’t care for the human characters (tbh I had the urge to skip through scenes that were purely focused on Sam). The CGI is cool though. I was locked in whenever Optimus spoke. I would say that the animation and the Autobots (and Decepticons) themselves were the high points of the film. Peter Cullen is awesome. Out of the Bayverse movies, the 1st was the best in my opinion (and I’m not a big fan of this one to begin with)."
    },
    {
      "rating": "5/5",
      "review": "absolute cinema its the peak of the bay films and really encapsulates that transformers feel. This film really makes the deceptions feel like a threat which is something no other transformers media can seem to do. overall its a great watch although there are some adult jokes the kids wont understand."
    },
    {
      "rating": "5/5",
      "review": "This movie is a masterpiece of Action cinema, it has great characters, it has great action, the visuals are great, it's funny and it has heart."
    },
    {
      "rating": "4/5",
      "review": "“I am Optimus Prime, and I send this message to any surviving Autobots taking refuge among the stars. We are here. We are waiting.\""
    },
    {
      "rating": "3/5",
      "review": "great action great cgi b tier villan c tier plot but failed at the 2 one. one of the better transformers movies"
    },
    {
      "rating": "4.5/5",
      "review": "Spongebob Squarepants Mash-Up (Minecraft, 2022) Pros Explorable interiors for most of the iconic locations. Some nice story elements. Fun NPCs. Really good builds. Working rides in Glove World. A really fun mini-game in the Krusty Krab. Working Boatmobiles. You can play Squidward’s clarinet and Mayonnaise is in fact a musical instrument. The Salty Spatoon thinks you’re not tough enough. Cons You can’t go into certain buildings until after completing a mission which can be frustrating to those hoping for pure exploration. Mr. Krabs’ House and Grandma’s House don’t have interiors. Two rides in Glove World don’t work. Heavy reliance on custom models. Some places can be confusing to get to. A Spongebob mash-up pack is something I’ve been waiting on for years upon years upon years, and it’s finally here. It has a total of forty skins, and I absolutely love the selection they gave us. Although it is unfortunate that, due to Minecraft’s skin template, we couldn’t have a size accurate Plankton. Most of the interiors are phenomenal, although there is a heavy reliance upon custom models that Spark Universe has made. Now custom models can be good in some instances. For example, the dinosaurs in Jurassic World, and the ships in Star Wars are both good places for custom models to be used. And there are good uses of custom models in this map, such as Spongebob’s Alarm Clock, his TV, the cash register in the Krusty Krab, and many others. But, when you use custom models unsparingly, and as the only way to decorate a room, then they become watered down and aren’t fun anymore. Also, the use of custom models makes some rooms feel empty and unfinished. Regardless, the custom models still help more than they hurt, and they all look great. 9/10"
    },
    {
      "rating": "1/5",
      "review": "Transformers is so stupidly made I wonder if Michael Bay or anyone watching it even watched a single second of the classic TV series. The answer. No, not enough to care."
    },
    {
      "rating": "3.5/5",
      "review": "It may be slow but it is quite entertaining"
    },
    {
      "rating": "5/5",
      "review": "Is a classic now, one of the best Transformers films ever"
    },
    {
      "rating": "4/5",
      "review": "Funny and memorable. Not perfect but good and the jokes are still funny even today."
    },
    {
      "rating": "4/5",
      "review": "What a great movie. This was still peak cinema. Shia at his best. Makes you think what he could have been. The action, acting , girl, cars , visuals , CGI, everything is exciting. Blast from the past what a great Rewatch"
    },
    {
      "rating": "5/5",
      "review": "one of the best movies of 2007 and in general one of the best most soulful films of all time I put it right on my greatest films of all time list next to godfather, Casablanca, citizen Kane, gone with the wind. and never mind there will be blood or no country for old men this is in my opinion the best movie of 2007 the screenplay is perfect, the acting is astonishing ( Jon voight is the best part about this movie ) and the dialogue is witty. great character development as well. I can't take it anymore how viewers just keep calling these types of movies dumb and mindless they are not really or at least not entirely after all the terminator films are action movies but they are intelligent and had an actual sense of plot and storytelling, as a result those films and Star Wars and avatar got oscars, transformers ( the original ) is no different it was like ET for teens and ET got oscars as well this movie deserved oscars itself including one for bay and I'm still baffled how it didn't win the effects awards why did they have to give it to the golden compass bayformers 1 was way way way better. bay could have won the Oscar for effects and he didn't its no fare. transformers is a masterpiece I hesitate to label it the true citizen Kane and being better than marvels avengers they can move aside because Hasbro's transformers are the true guardians of this universe and Michael bay is the true Optimus prime/autobot leader. I never had a more emotionally satisfying experience in th theaters than watching transformers. and in my opinion this is the true birth of transformers and not the G1 children's cartoons those are fraud. bayformers is the real transformers and nothing can beat it."
    },
    {
      "rating": "3/5",
      "review": "Si bien tiene muchas explosiones y sensualidad es una decente"
    },
    {
      "rating": "5/5",
      "review": "the best michael bay movie to exist. \"SHUT UP GRANDMA!\""
    },
    {
      "rating": "5/5",
      "review": "a fantastic start to the transformers saga"
    },
    {
      "rating": "5/5",
      "review": "Okay. So Transformers is not a masterpiece by any means, nor is it the most enriching storyline of all time. However, this movie was my entire childhood and it lives rent-free in my heart. I love the music, the cinematography, the characters, the feel of it, and the overall 2007-ness of the original movie. Shia LaBeouf stole my heart as a child with this movie with his zany character and all of the Transformers are absolutely so cool and amazing. The whole movie is fun, edgy, sarcastic, humorous, and incredible visually. I will never not love this movie and will rate it perfectly, even if I am aware of the problems in the movie."
    },
    {
      "rating": "3.5/5",
      "review": "This movie will always be a certified classic of blockbuster movies of the 2000s, sure the some parts of the movie can be kinda unwatchable, but I do like the action of the movie, and the beautiful soundtrack composed by Steve Jablonsky will always ingrained into the minds of audience forever"
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good movie."
    },
    {
      "rating": "2.5/5",
      "review": "There are some interesting and captivating characters although the main ones are pretty annoying. The movie is a big show to our eyes. The first of its kind. The idea of Bumblebee speak through its radio was very good. Moreover, he's very charismatic. The movie is not wonderful but is concise. It's fun."
    },
    {
      "rating": "4.5/5",
      "review": "They were never good again"
    },
    {
      "rating": "4/5",
      "review": "Great watch when you’re bored tbh"
    },
    {
      "rating": "3.5/5",
      "review": "Soms gaat het heel snel en is het lastig te volgen, wel lekker veel actie en natuurlijk: Megan Fox. Worth a Watch"
    },
    {
      "rating": "3.5/5",
      "review": "The best of the transformer movies. A great retelling of the classic transformers story. Amazing humans. I would give it a 79%."
    },
    {
      "rating": "5/5",
      "review": "Absolute Masterpiece"
    },
    {
      "rating": "4/5",
      "review": "Great plot Good story Good actors Good movie"
    },
    {
      "rating": "3.5/5",
      "review": "Watched this again a few days ago, and it's just okay. Too much Michael Bay chaotic action. This is the best one out of the 1st trilogy. Not using Frank Welker is also a major fail, Hugo Weaving didn't work."
    },
    {
      "rating": "5/5",
      "review": "Seen this one so many times and I still love watching it every single time!"
    },
    {
      "rating": "3.5/5",
      "review": "A classic action film. It has it's weird bits but it's a fun time."
    },
    {
      "rating": "5/5",
      "review": "Favorite. Transformers. Movie. Ever!"
    },
    {
      "rating": "4.5/5",
      "review": "This is one of my favourite films it’s that good. I think that the film did really well introducing the auto-bots and decepticons. The CGI and visuals for the auto-bots are outstanding. Even in this day and age they are incredible. Still can’t believe that this film is from 2007. The fights had good meaning to them and were really suspenseful to watch. The characters were really good and I found some parts funny. Definitely a must watch film."
    },
    {
      "rating": "4.5/5",
      "review": "Incredible! I remember this being a major blockbuster when it first came out and it delivered. Childhood memories."
    },
    {
      "rating": "3.5/5",
      "review": "To be honest the movie was quite good.Some characters are really charming.The CGI looks very good and every time the transformers transform it looks awesome.What makes the movie a bit worse is that some characters are sometimes annoying and the movie drags a lot in some places.Transformers is a really good movie."
    },
    {
      "rating": "5/5",
      "review": "It doesn't matter if you are a new fan of transformers, or grew up watching the cartoons. Michael Bay's rendition of transformers was phenomenal. The storytelling was spot on, and the action sequences keep you on the edge of your seat. I find myself coming back to it time and time again, because it's a thrill Ride from start to finish."
    },
    {
      "rating": "2.5/5",
      "review": "This movie was one I was raised on, that probably will be bad but either way the Micheal Bay Transformers films are certainly going to entertain you, for the better, or for the worse. \"Bumblebee, stop lubricating the man\" -Optimus Prime"
    },
    {
      "rating": "3/5",
      "review": "The movie has a lot of issues and it's poorly written but you can still have a good time."
    },
    {
      "rating": "4.5/5",
      "review": "Direção: Bom Atuação: Ok Roteiro: Bom Caracterização: Bom Soundtrack: Bom"
    },
    {
      "rating": "3.5/5",
      "review": "simple story, but the fights are amazing, impeccable special effects"
    },
    {
      "rating": "5/5",
      "review": "The first Micheal Bay Transformers movie was one of the first movies that I have ever watched. Is it good? Well, from a biased review of me when I was younger, I absolutely love lots of action and cars that turn into robots! From an unbiased review of watching it recently, it is great! There is lots of action, robots, cars, and more! But, while I will give it five stars, it does not have the best of characters when it comes to the humans. The transformers are funny, but the humans are very shallow. Overall, I love this movie!"
    },
    {
      "rating": "2/5",
      "review": "It's perfectly acceptable, but a far cry from the source material in many ways, none of which service the quality of this Transformers universe."
    },
    {
      "rating": "3.5/5",
      "review": "It was the film that introduced me to the franchise along with Dark of the Moon, it has memorable moments but it's not the best in the franchise by a long shot in my opinion"
    },
    {
      "rating": "5/5",
      "review": "I saw it 7-8 times at the cinema, and I’ve seen it numerous times since, including just recently. It holds up as a solid sci-fi action movie, with good humour, and creative representation of the Transformers"
    },
    {
      "rating": "3.5/5",
      "review": "It had weird beds, but definitely a class"
    },
    {
      "rating": "5/5",
      "review": "Idc what others think this is a classic."
    },
    {
      "rating": "3.5/5",
      "review": "I love the action same with the effects, the humans are boring and annoying but the over the Top acting and dumb decision making keeps me entertained"
    },
    {
      "rating": "5/5",
      "review": "Peak cinema. Absolutely fantastic gimme 15 more."
    },
    {
      "rating": "1.5/5",
      "review": "so much potential, wasted."
    },
    {
      "rating": "4/5",
      "review": "It's a instant classic."
    },
    {
      "rating": "4/5",
      "review": "While it can be rough in some spots, Transformers is a great start that impresses with its action, ground-breaking visual effects and character likeability around the actual morphing mechs. Rating: 79% 🍿"
    },
    {
      "rating": "4.5/5",
      "review": "Transformers isn't just a movie - it's a seismic event that shatters the boundary between childhood fantasy and big-screen reality. Michael Bay's hyperkinetic vision ignites a nitro-fueled spectacle where every frame crackles with electric intensity. Shia LaBeouf's Sam Witwicky pinballs through the chaos with manic conviction, while Megan Fox smolders as Mikaela, elevating her role beyond mere eye candy to a capable heroine in her own right. But it's when metal meets metal that this film ascends to godhood each transformation a symphony of impossible engineering, every robot-on-robot throwdown an earthquake of celestial proportions. Peter Cullen's return as Optimus Prime isn't just voice acting, it's a religious experience his baritone rumble commanding goosebumps as it rallies both humans and Autobots alike. Hugo Weaving's menacing rasp as Megatron drips with palpable malevolence, the yin to Prime's yang in this heavy-metal opera. From Bumblebee's puppy-like charm to Starscream's treacherous snarl, every Transformer pulses with distinct personality. Bay's camera practically overheats trying to capture the sheer, overwhelming coolness erupting across the screen - sleek vehicle modes, city-leveling battles, and action set-pieces that redefine the very concept of 'epic'. Yet amidst this visual feast, the film's attempts at humor often fall flat, relying on cringe-worthy gags and juvenile jokes that clash with the epic tone. Despite this misstep, Transformers doesn't just raise the bar for blockbuster entertainment - it straps rockets to that bar and blasts it into the stratosphere, leaving audiences dazed, delirious, and craving more of its metal-morphing magic."
    },
    {
      "rating": "5/5",
      "review": "The 2007 Transformers is really highly entertaining exiting summer explosion movie the cast are great and there are jokes that funny and some of the writing are okay but is really dumb in a good way."
    },
    {
      "rating": "3.5/5",
      "review": "This delivers on some very exhilarating Action Scenes involving Military Warfare, and Giant Robot's. Shia LeBouf, Megan Fox lead the movie just fine, but aren't great. Peter Cullen as Optimus will still be one of the best decision's for a Voice Actor for a character ever made. It is worth watching, at least once. You might enjoy it. C"
    },
    {
      "rating": "4/5",
      "review": "This was many peoples introduction to the franchise and holds so much nostalgia. The movie has some flaws but if you put those aside its actually a very fun movie to watch and enjoy packed with action and just robot awesomeness."
    },
    {
      "rating": "3/5",
      "review": "My expectations were on the floor but I actually kinda liked it? Yeah it’s not perfect but it’s an solid blockbuster with impressive special effects"
    },
    {
      "rating": "5/5",
      "review": "Transformers is a groundbreaking cinematic experience that redefined the action genre with its blend of heart, humor, and mind-blowing visual effects. Michael Bay introduces audiences to a world where giant robots come to life in the most spectacular fashion, delivering a film that’s both thrilling and deeply nostalgic. The seamless transformation sequences and epic battles between Autobots and Decepticons are a visual feast, setting a new standard for special effects. Shia LaBeouf’s charismatic performance and the film’s perfect mix of action and humor make it an unforgettable ride. Transformers isn’t just a movie—it’s an incredibly epic phenomenon that delivers on every level, bringing childhood dreams to life with unmatched energy and excitement!"
    },
    {
      "rating": "5/5",
      "review": "The best movie de transformers"
    },
    {
      "rating": "5/5",
      "review": "It's great good cast of people the robots look great the action is awesome and the music is wonderful I have always enjoyed transformers this movie deserves to have a 90 percent rating"
    },
    {
      "rating": "5/5",
      "review": "Such a classic must see 🔥"
    },
    {
      "rating": "5/5",
      "review": "OH MY GOSH! I LOVE THIS MOVIE! I was six years old when this came out! I watched it in a movie theater on the Marine Corps Air Station New River in North Carolina! I was already a fan of Transformers a little. I k ew of Optimus from watching the Transformer 1984 movie, but this movie SOLIDIFIED my love for this franchise! I remember going home and seeing many of the same vehicles, weapons, and uniforms worn and driven by the Marines on the base. I thought it was so cool and made me love the movie even more! This movie is a CLASSIC 2000's blockbuster and is a must watch if you want peak action movie for the 2000's! This movie has its flaws, but it's positives dramatically outway it's negatives. Freedom is the right of all sentient beings."
    },
    {
      "rating": "2/5",
      "review": "Michael Bay flicked into taxi."
    },
    {
      "rating": "5/5",
      "review": "Always and forever will love the very first transformers..love Megan Fox, transformers are just so dope and coming up with the idea to make all this in the movie is fantastic..BumbleBee and Optimus I love them so kind to the humans especially the nice ones"
    },
    {
      "rating": "2.5/5",
      "review": "Not bad but okay, just reduce the explosion"
    },
    {
      "rating": "5/5",
      "review": "The Great Sci-Fi Action Movie!"
    },
    {
      "rating": "2/5",
      "review": "I've been a fan of the franchise as long as I remember, the movie has great effects, CGI, action, but stays away from what made Transformers one of the greatest of the 80's"
    },
    {
      "rating": "4/5",
      "review": "A good movie for anyone wanting to get into Transformers. The crude humor is sometimes out of place."
    },
    {
      "rating": "4.5/5",
      "review": "This Linkin Park video is way too long😡. Megan Fox makes up for it though🥵"
    },
    {
      "rating": "1.5/5",
      "review": "This movie is not really good."
    },
    {
      "rating": "3.5/5",
      "review": "It's a Michael Bay movie - of course it's going to be a little cheesy. For a movie made in 2007, the CGI is incredible - beats half of the CGI you see in films today. Story was a little simple and predictable, but it was just enough story to keep you hooked while you watch cars, helicopters, trucks, and jets explode into a million pieces."
    },
    {
      "rating": "4.5/5",
      "review": "Great humor, great action and solid CGI 9/10 Micheal bays best movie"
    },
    {
      "rating": "4/5",
      "review": "I didn’t like how Sam killed Megatron, it didn’t really make sense. And then Bumblebee just decides to talk also didn’t make sense. Solid movie with good CGI"
    },
    {
      "rating": "4.5/5",
      "review": "The best Transformers film and the funniest. 9/10"
    },
    {
      "rating": "4.5/5",
      "review": "Es muy larga dicen cosas sexuales la historia es buena está entretenida"
    },
    {
      "rating": "4.5/5",
      "review": "Un muy buen inicio a una franquicia taquillera."
    },
    {
      "rating": "5/5",
      "review": "TOO many explosions? bro these are giant metal robots with high-tech weaponry... I love Micheal Bay. Remember this is not a movie to give you something deep to think about. is for the fans. not for the critics. It might not be G1. those teenagers who grew up in the 2000s and watched this movie know that this movie transmits some kind of emotion. The soundtracks, the CGI, and the designs are amazing. LOVE THAT YELLOW CAMAROO HELL YEAH."
    },
    {
      "rating": "5/5",
      "review": "I enjoyed everything about this movie I can sit here and watch it everyday if needed be ."
    },
    {
      "rating": "5/5",
      "review": "O melhor filme da franquia"
    },
    {
      "rating": "5/5",
      "review": "Probably The Best Sci-Fi Action Film Ever Made!"
    },
    {
      "rating": "5/5",
      "review": "Michael bay's visually stunning and meditatively imaginative transformers is a heartwarming experience that shows a bold message of being a hero and learning your ways of dealing with your own issues as a kid and this movie was like the E T extra terrestrial of the 2000s bay was like trying to be the next Spielberg. And he succeeded well the acting is phenomenal Shia labeouf gives a very convincing performance as the high school kid that tries to solve his issues, has a crush on a girl and gets into a relationship with bumblebee which he gets as his new car and the chemistry between them is so heartwarming and it reminds me of the relationship with the kid and E T in spielberg's 1982 classic and another thing that really impresses me is how this has two storylines where it opens from a narration of Optimus prime aka leader of the autobots of how the autobots and decepticons got into a fight and then found the planet earth which the decepticons want to destroy buy getting the allspark and the autobots try to get to it first to defend it and how it later shows Sam witwicky's story of his life and his issues the two stories come togeather later on when Sam meets the rest of the autobots and not to mention the action scenes are so impressive that it's like what you havent seen in other action films before and as you can tell its the style of action that only Michael bay can film it's so astonishing and visually stunning bay is a mastermind at providing impressive visuals and camerawork his film is beautifullly shot and the final battle downtown was so fun to watch and like I said earlier it's well acted with great performances from the supporting cast such as John turturro who's charachter is very witty in this first movie and not to mention josh duhamel and tyrese Gibson as the millitary soldiers they were very likable and helpful to film I loved how they participated in the final battle and helping Shia labeouf in protecting the all spark cube, and let's not forget the great jon voight who gives a brilliant supporting performance as the defense secretary John Keller his charachter was very likeable and I liked how he gets everyone to that base near the Dam. The score from Steve jablonsky is terrific and very intriguing and is very comparable to the brilliant score of Hans Zimmer in Christopher Nolan's Batman trilogy. Bay am with the help of Spielberg and the cast and crew gave us a fun and memorable blockbuster hit that provides the best entertainment you get from the industry that's full of wit, charm, soul, and imagination the film made sense the story was really good and there was substance to it having charachters I cared for it. The first bay Transformers ( 2007) overall is a wonderful achievement and a powerful film with tremendous action and engaging storytelling of how the autobots and decepticons became enemies and showing the heartbreaking life of Shia labeouf's Sam witwicky, it's an impressive work of perfection and critics should be impressed with it and what bay has given us with it. This is in my opinion the E T of the 21st century and one of the best films of 2007 and of Michael bay's filmography. It's Too bad they had to make sequals to it that weren't good but unlike those this had heart, soul and meaningfulness to it along with having compelling charachters and an intriguing story this film gets a strong A-"
    },
    {
      "rating": "2/5",
      "review": "As much as Michael Bay's take in the the iconic robotic cartoon \"Transformers\" with its dazzling visual effects, its narrative structure, uneven tone and character development failed to shine."
    },
    {
      "rating": "5/5",
      "review": "This fim is overall a perfect example of everything modern cinema can offer. With stunning visuals, still cutting-edge today, and a humurous performance by Shia LaBeouf, the first entry of the Transformers franchise is peak fiction."
    },
    {
      "rating": "3/5",
      "review": "It may not be the best film to come out, but it certainly had its moments and it was able to work in an unexplainable way. If you want to watch a movie with lots of action, stupid yet hilarious things, and everything you expect in a Bay film, this is it. If you want to look for a movie that has a well-written story or something actually fun to watch, then you might want to watch something else. But everyone I know seems to love this film, so if you want to watch it, you can go right ahead, for me it passed the time, but hey, at least it's better than most of its sequels."
    },
    {
      "rating": "5/5",
      "review": "Great Kick-Ass Start To The Franchise and Shia LaBeouf is incredible in this and the chemistry between them is great! The CGI is amazing for 2007 which puts a lot of Movies nowadays to shame and Michael Bay is the GOAT director and Bumblebee & Optimus Prime are my favourite Autobots."
    },
    {
      "rating": "5/5",
      "review": "Better than average script, good enough for the kids and adults, great action, escapism , Great crash bang wallop film."
    },
    {
      "rating": "4/5",
      "review": "When I was a kid I thought transformers where boring, but now that I'm a teen, I like transformers more and more everyday, my friend is in love with transformers, so just like my friend who likes one piece, I wanted to be more familiar with my friends interest, so I gave this movie another go and it was funny and a blast with cool effects that are better then the newer movies that come out like Thor love and thunder, and all in all is a good movie!"
    },
    {
      "rating": "5/5",
      "review": "The theme arrival to earth"
    },
    {
      "rating": "5/5",
      "review": "This movie was incredible and the transformers had amazing designs this was my version of the 80s kids G1"
    },
    {
      "rating": "4/5",
      "review": "The movie is good very enjoyable to watch if your bored and don't know what to watch"
    },
    {
      "rating": "4/5",
      "review": "A movie to be rewatched for decades"
    },
    {
      "rating": "5/5",
      "review": "Ngl my favorite movie of all time. RIP JAZZ"
    },
    {
      "rating": "4/5",
      "review": "Even after watching this again 17 years later, this is still a fun and enjoyable film. The surround sound mixing, CGI and visual effects still hold up till this day."
    },
    {
      "rating": "3/5",
      "review": "3.25 stars. Initially thought this would be a pointless kids tale, but decided to try. I am delighted by this sci fi adventure."
    },
    {
      "rating": "0.5/5",
      "review": "Keep kids far away from this movie! (0 stars) There is a middle-aged (about 40) man who calls an underage child \"hot\" while looking at her up and down. It is absolutely disgusting. The producers of this movie adds in sick and perverted details and dialogue. The underage main characters talk sexually and inappropriately throughout the movie. Children should avoid this movie at all costs! Please be safe and ensure kids don't consume this type of content!"
    },
    {
      "rating": "3.5/5",
      "review": "This movie is my childhood. I remember on weekends, my parents would let me watch it. This movie holds a lot of personal value. But outside of that, it's an alright movie. The characters are sweet and endearing, the effects hold up to this day, and it's a great watch."
    },
    {
      "rating": "5/5",
      "review": "This movie is a fun watch & it's enjoyable too. 7.3/10"
    },
    {
      "rating": "4.5/5",
      "review": "I remember when this first hit theaters. Saw it 3 times and it still is a good movie. The critics are peasants. See it for yourself and make your own decision."
    },
    {
      "rating": "2.5/5",
      "review": "A fairly standard blockbuster with some nice set pieces."
    },
    {
      "rating": "5/5",
      "review": "Watched this movie when I was little still is good when I watched it"
    },
    {
      "rating": "5/5",
      "review": "Its having one of the best CGI to this date... Avatar CGI is nothing infront of this! + Optimus prime is the best!"
    },
    {
      "rating": "0.5/5",
      "review": "Transformers is a movie lacking any creative spark. It is just a mindless action spectacle and about as bad as a big budget movie can get. Saw the first one and that was it for me."
    },
    {
      "rating": "5/5",
      "review": "Definitely the best out of all Transformers movies. It set the bar relatively high, and the others just couldn't deliver the way this first one did. I was a kid when this movie came out. I was amazed at how amazing the special effects were. Still am. This movie has aged VERY well, and I suspect it'll remain that way for years to come."
    },
    {
      "rating": "5/5",
      "review": "Very nice movie. Cool action scenes, great CGI, good acting. I really enjoyed this classic."
    },
    {
      "rating": "4/5",
      "review": "Just re-watched this recently and it holds up well. The story is so-so, but the special effects and action are top-notch, even after 17 years since release date. If Michael Bay is good at one thing, it's action and \"high-octane\" fun. It's a silly movie but entertaining enough. And yes, I grew up with the Transformers toys and watched the cartoons, so I may be a bit biased."
    },
    {
      "rating": "4/5",
      "review": "Great fun, and an enjoyable watch!"
    },
    {
      "rating": "3.5/5",
      "review": "The CGI/special effects for 2007 especially were really well done and this is one of the better Michael Bay movies. Sure his directing gets to be a little over the top in some ways and the movie distracts itself with dumb humor. However, the awesome action, production, and Transformer fun outweighs any negatives in my opinion. I really should give this one a rewatch and if I like it less after that then so be it. When this came out when I was only in 4th/5th grade it was quite a spectacle and launched quite a big franchise filled with other impressive special effect accomplishments. Michael Bay deserves credit and had guts for taking on this project and for better or worse, I can't complain about what he did too much (until later installments since the negatives started to outweigh the good)."
    },
    {
      "rating": "5/5",
      "review": "The cgi is still the best to this day, say all you want about the characters models but they are really good."
    },
    {
      "rating": "4/5",
      "review": "This was a much better movie than the last three. The storyline and characters really emphasized the plot."
    },
    {
      "rating": "5/5",
      "review": "Action-packed speech explosions and Linkin park do I need to say anything else"
    },
    {
      "rating": "5/5",
      "review": "My name is Optimus Prime"
    },
    {
      "rating": "5/5",
      "review": "This movie was my Childhood and always will be"
    },
    {
      "rating": "4/5",
      "review": "The transformers from Micheal Bay was well fetched but It needs more nostalgic reading."
    },
    {
      "rating": "5/5",
      "review": "The best movie of the franchise. Perfection."
    },
    {
      "rating": "5/5",
      "review": "Perfect............."
    },
    {
      "rating": "4.5/5",
      "review": "This movie is a certified hood classic"
    },
    {
      "rating": "4.5/5",
      "review": "I have such a soft spot in my heart for this movie. The rest after this were, uh, not so great. But I could re-watch the original forever. Not afraid to say it."
    },
    {
      "rating": "4/5",
      "review": "Amazing CGI & Action for 2007. Main problem is just that the humans are kinda the main focus. I would've preferred a movie similar to that of the 1986 Transformers Movie. Great nonetheless."
    },
    {
      "rating": "5/5",
      "review": "Intense, hyper-stylized, and exciting all the way through, the original Transformers is an appropriately over-the-top action sci-fi movie with action sequences and visuals that still hold up today, and have never been matched by its sequels."
    },
    {
      "rating": "5/5",
      "review": "Maravilhoso. Com algumas pequenas falhas no roteiro. Mas maravilhoso !"
    },
    {
      "rating": "5/5",
      "review": "this movie was a big part of my childhood and is a definite must see, i recommend it to absolutely everyone"
    },
    {
      "rating": "4/5",
      "review": "If it wasn't for Transformers, we wouldn't have gotten a franchise. It is to blame for The Last Knight. Revenge of the Fallen, Dark of the Moon and Age of Extinction did surpass this film, didn't change how inferior they were to this. Thank Jesus we got Bumblebee and Rise of the Beasts. This film is still a classic"
    },
    {
      "rating": "5/5",
      "review": "Amazing ! Yes, the sequels aren't very good for the most part but this first movie is incredible !"
    },
    {
      "rating": "4/5",
      "review": "Transformers is one of those movies that I will always be passionate talking about because of how much I watched this movie as a kid. I dressed up as Bumblebee and Optimus back to back as a kid and so I might have some bias when it comes to this movie. Shia as Sam is probably in my Top 5 favorite leading characters within a movie, his chemistry with Megan Fox in these movies was so charming and I remember wanting a high school relationship just like them. Also the idea of getting a car and it turns into an alien robot was just so cool and badass to me as a kid and it still is to me today. One thing I can appreciate more that I'm older is how much this movie focuses on the military and government aspect as this movie does have that feel of an army movie which I felt like those scenes were so amazingly written as you understand what is happening and feel the threat within the movie. It's just so crazy to me how the writers took a simple premise and elevated it, and not just that but then somehow Michael Bay's execution on the direction he took. This movie also does have some of the cheesiness that is in Michael Bay films that I enjoy from him. I think Rise of the Beasts tried to lose the cheesiness and tried to ground the story which I felt didn't work as the cheesiness that Bay brings is what I think is best for these films as this movie isn't goofy and it has a more serious approach than the new movies but still keeping that cheesy style with the high school scenes and the small jokes here and there and the iconic score that is muscle memory to me. Overall, Transformers is one of my favorite movies of all time as it is action-packed, has a great cast with Shia and Megan, the story itself is also written well with an awesome execution by Michael Bay, and sticks to a serious tone while having some cheesiness to it. Transformers is an A-."
    },
    {
      "rating": "4/5",
      "review": "15 years later and this movie is still as awesome and entertaining the first time I watched it."
    },
    {
      "rating": "5/5",
      "review": "o m g s o g o o d a h h h h h h h h h h h h h h h h"
    },
    {
      "rating": "3.5/5",
      "review": "It's a nice family movie. It's funny, yet thought provoking. I recommend it."
    },
    {
      "rating": "5/5",
      "review": "Transformers 2007 still awesome till this day. If you're looking at the movie with basic plot with bigger, action and bigger budget. this is the movie"
    },
    {
      "rating": "3.5/5",
      "review": "It's alright. Not much to say. I like the fight scenes but the sequels and prequels of this movie were much better."
    },
    {
      "rating": "5/5",
      "review": "Great movie to watch with the family."
    },
    {
      "rating": "4/5",
      "review": "This movie has great novelty value and is great fun. The sequels are all worse - though Bumblebee is nice if you like him."
    },
    {
      "rating": "4.5/5",
      "review": "THIS is one of the best movies ever!"
    },
    {
      "rating": "3/5",
      "review": "I did enjoy a lot of this film but it's WAY too long. I tried not to be biased as I loved this film when it came out and I was younger but on a rewatch as an adult it's not as good as I remember"
    },
    {
      "rating": "4/5",
      "review": "Now: 8/10. 82/100. | As a Child: 8/10. 86/100"
    },
    {
      "rating": "4.5/5",
      "review": "Action-packed and fun-filled Michael Bay excels at action at a fast pace with underlying comedic cues which heavily influence the enjoyment of the audience. In this film, he shines his brightest. Based on the popular cartoon, the Transformers in the movie are big beyond the screen's size and the explosions and action are neck breaking. Shia LaBeouf's expressions of surprise and wonder are unique to this film and lacking in most of the others. Megan Fox does a fine job as well. The introduction to the robots is funny and the entirety of the film is at least amusing if not very engaging for the viewer. It's one of the better action films to come out, ever."
    },
    {
      "rating": "5/5",
      "review": "Honestly, This Is Actually not that bad, Pure nostalgic , Love it."
    },
    {
      "rating": "0.5/5",
      "review": "In my opinion the acting was horrible. The fights seemed to make up for it but the main characters were just awful. The whole plot too seemed very \"blocky\" like it had to end the way it did, the plot seemed very \"scripted\" if this makes sense. And the ending with the guy turning into iron man…. Just why? Smh"
    },
    {
      "rating": "4/5",
      "review": "Action, fast Car, fighting, guns, robots and a hot female lead role! What's not to like as a teenage boy."
    },
    {
      "rating": "4.5/5",
      "review": "Love it,but during the fight's the camera shakes so hard, that i even don't see what's happening"
    },
    {
      "rating": "3.5/5",
      "review": "A fun 2010s blockbuster that lacks good characters"
    },
    {
      "rating": "4.5/5",
      "review": "This movie is an amazing start to the live action Transformers movie franchise. One of the better films along with Bumblebee and Transformers: Rise of the Beasts. This one is still a classic. Transformers: Dark of the Moon, Transformers: Age of Extinction and Transformers: Revenge of the Fallen were not good nor bad because they had the best action. Transformers: The Last Knight was hyped but it damaged the franchise BIG TIME!"
    },
    {
      "rating": "5/5",
      "review": "Incredibly fun and entertaining movie with great effects. The buildup in the beginning to introduce Blackout was so perfect. This movie will always hold a special place in my heart as I saw it a couple of months before I joined the Air Force. I was nervous but this movie made me excited and pumped up (no, I wasn't going into the military thinking it was going to be a Transformers movie lol). I feel that the Transformers franchise gets way too much hate. Critics and others expecting masterful storytelling and character development. Come on. It's Transformers! Michael Bay said from the beginning this movie is geared towards teenage boys. This franchise isn't suppose to be some 'The Lord of the Rings'-type deal. There's explosions, tons of actions, military muscle, and a hero with his hot girlfriend. People need to spend less time analyzing and more time just watching and enjoying!"
    },
    {
      "rating": "3.5/5",
      "review": "Love this movie definitely worth the watch"
    },
    {
      "rating": "0.5/5",
      "review": "Michael Bay Ruined Transformers, none of his transformers movies are good"
    },
    {
      "rating": "3.5/5",
      "review": "Transformers introduces the iconic robots in disguise to the big screen, delivering exhilarating action and impressive visual effects, though the movie excessively focuses on the human characters."
    },
    {
      "rating": "3/5",
      "review": "Al netto di tutti i suoi enormi difetti, Transformers rimane un film divertente e da godere a cervello spento"
    },
    {
      "rating": "2.5/5",
      "review": "Apart from the sophisticated special effects, it's boring. The directing style is too childish and unsophisticated. Lots of very unnecessary dialogue and over the top slow motion effects."
    },
    {
      "rating": "4/5",
      "review": "I have enjoyed every movie in this series, some more than others. Can't believe a super reviewer here has the nerve to call it one of the worst movies ever made. Dude has clearly not seen one of the worst movies ever made before, and I can name a handful right off the top of my head, and Transformers isn't one of them. Oh let's name a few, shall we? Superhero Movie Disaster Movie Scary Movie 3 and the rest of the crappy sequels Meet the Spartans Every other end of the world/scary movie/teen movie parody. THOSE are some of the worst movies ever made. I'd hate to think what some of these people think are good movies...holy cow the standards are impossible."
    },
    {
      "rating": "5/5",
      "review": "A classic. Hard to believe that this movie is 16 years old, yet still looks great today with all the special effects."
    },
    {
      "rating": "4.5/5",
      "review": "Over 15 years old and this is one of Michael Bay’s most fun movies Everything you could imagine a summer popcorn flick is based on the 1980’s toy franchise/cartoon series Fans were of course worried about how Bay would adapt these action figures but he managed to make it entertaining as well as exciting for the kid in us all I remember seeing it with my sister Cara on July 4th Two alien races; the Autobots and Decepticons waged war on their planet Cybertron A cube called the All Spark was lost during the battle ending up on Earth Then we see that both alien races have hidden themselves as motor vehicles, helicopters etc. A young boy named Sam ends up with a yellow Camero called Bumblebee sending out a distress signal to call his Autobots allies led by Optimus Prime The Decepticons led by Megatron are after the All Spark to transform all human technology to take over the universe Sam and love interest, Michaela get stuck in the middle of the war along with soldiers and other government officials Sam and the humans will need to team up with the Autobots to save Earth and stop the Decepticons This was such a fun introduction to the franchise, my dad loved the opening sequence but felt the movie's length The animators did a fantastic job bringing the Autobots and the Decepticons to life, I was so afraid it wasn't gonna work Michael Bay still delivers the fun action and special effects yet the story is still very dumb next to the sex jokes and toilet humor and the blatant racism I was disappointed by all the human parts in the movie; dumb corny or downright annoying The story is ridiculous when you stop to think But Shia LaBeouf and Megan Fox did get their rises to fame and it was a big treat for fans for Peter Cullen to voice the original Optimus Prime from the 80s cartoon I love Steve Jablonsky's epic score and it made Linkin Park cool again It's a shame Shia faded into obscurity and Megan faced a lot of early 2000s misogyny but Hasbro still made a lot of money making toys and merchandise So glad they ended up making more movies introducing more Autobots and Decepticons as well as expanding the mythos"
    },
    {
      "rating": "3.5/5",
      "review": "Movie was really entertaining"
    },
    {
      "rating": "3.5/5",
      "review": "It could be a franchise that brings us films the line that we have never seen before But you can't help but feel Michael bay over throws his hand a bit to much Sometimes so much is going on you can't see what is going on The personalities of the auto bots is brilliant and the voice acting is on point The human characters do very well make you feel like the transformers are actually there and not a green screen The soundtrack dose a lot of the heavy lifting but some of the casting choices are questionable o say the least A good uplifting film but where can it go from here"
    },
    {
      "rating": "4/5",
      "review": "Over 15 years old and this is one of Michael Bay’s most fun movies Everything you could imagine a summer popcorn flick is based on the 1980’s toy franchise/cartoon series Fans were of course worried about how Bay would adapt these action figures but he managed to make it entertaining as well as exciting for the kid in us all I remember seeing it with my sister Cara on July 4th Two alien races; the Autobots and Decepticons waged war on their planet Cybertron A cube called the All Spark was lost during the battle ending up on Earth Then we see that both alien races have hidden themselves as motor vehicles, helicopters etc. A young boy named Sam ends up with a yellow Camero called Bumblebee sending out a distress signal to call his Autobots allies led by Optimus Prime The Decepticons led by Megatron are after the All Spark to transform all human technology to take over the universe Sam and love interest, Michaela get stuck in the middle of the war along with soldiers and other government officials Sam and the humans will need to team up with the Autobots to save Earth and stop the Decepticons This was such a fun introduction to the franchise, my dad loved the opening sequence but felt the movie's length The animators did a fantastic job bringing the Autobots and the Decepticons to life, I was so afraid it wasn't gonna work Michael Bay still delivers the fun action and special effects yet the story is still very dumb next to the sex jokes and toilet humor and the blatant racism I was disappointed by all the human parts in the movie; dumb corny or downright annoying The story is ridiculous when you stop to think But Shia LaBeouf and Megan Fox did get their rises to fame and it was a big treat for fans for Peter Cullen to voice the original Optimus Prime from the 80s cartoon I love Steve Jablonsky's epic score and it made Linkin Park cool again It's a shame Shia faded into obscurity and Megan faced a lot of early 2000s misogyny but Hasbro still made a lot of money making toys and merchandise So glad they ended up making more movies introducing more Autobots and Decepticons as well as expanding the mythos"
    },
    {
      "rating": "4.5/5",
      "review": "Great start to the transformers line. It's a non serious action film with great actors. Still great after so many years. Thats how you know its a classic."
    },
    {
      "rating": "5/5",
      "review": "One of my Favorite movies, it is exiting, and visually pleasing to the eye. You will love it."
    },
    {
      "rating": "4/5",
      "review": "its a Michael Bay movie"
    },
    {
      "rating": "5/5",
      "review": "I am not exaggerating when I say this is one of the most influential movies of my whole life. Seeing this in imax for the first time as a middle school student was the coolest experience of my life to that point and my introduction to my love of comic book style movies. The critics are morons; 10/10"
    },
    {
      "rating": "3.5/5",
      "review": "Se você ignorar a megalomania de Michael Bay, as piadocas sem graça alguma e a hipersexualização de Megan Fox, o filme até se sai bem. Um dos únicos da franquia a ter uma história coesa, apesar de absurda a ideia de robôs alienígenas. Porém, longo em demasia, com conflitos humanos desinteressantes."
    },
    {
      "rating": "3.5/5",
      "review": "The military aspects of the movie are pretty great while the parts with Sam are not. It's a fun, flawed movie."
    },
    {
      "rating": "3/5",
      "review": "I mean the Movie was not bad but The jokes were missing on me , but when I heard that there is a transformers Movie I was really excited for it ,I wouldn't say it was disappointing but I think as a opening Movie of a franchise it should be much better"
    },
    {
      "rating": "3.5/5",
      "review": "Mesmo com suas superficialidades, Transformers é cativante e divertido. Michael Bay pode ter seus defeitos como diretor, porém, sua assinatura é um diferencial enorme para este filme, pois o mesmo consegue adaptar e transmitir a essência dos personagens para algo mais sólido e realista, com novos visuais que agradam bastante aos olhos do grande público. Sua fotografia é variável, as vezes bonito e as vezes saturada demais, reflexo dos maneirismos do diretor, elenco é funcional e o núcleo do exército entendiante, no geral, é um longa divertido e bem executado."
    },
    {
      "rating": "5/5",
      "review": "Masterpiece of a movie! Milestone in movie history!"
    },
    {
      "rating": "4/5",
      "review": "Great film, great graphics, awesome and original."
    },
    {
      "rating": "2.5/5",
      "review": "An interesting take on the series as it's filled with action and emotion that could of been better without the laughable dialog and blurry scenes."
    },
    {
      "rating": "4/5",
      "review": "This is everything the rest of the franchise needed to strive to be. Is it corny? Sure, but that was also just the 2000's vibes. The robots are awesome and the plot is actually not horrible, which you almost expect from an adaptation of a franchise like this. Lots of fun!"
    },
    {
      "rating": "2.5/5",
      "review": "This movie has horrible screenwriting, but has amazing cgi and a great soundtrack. And the fight scenes just look like metal hitting and jumping on eachother"
    },
    {
      "rating": "5/5",
      "review": "For 2007 the cgi is amazing, also big robots kill eachother, absolute peak"
    },
    {
      "rating": "4/5",
      "review": "A classic movie from the 2000's. Shows what Transformers could have been. Great, cgi, a plot that was followable, fantastic music."
    },
    {
      "rating": "4.5/5",
      "review": "what a Great start to this awesome movie franchise. I love seeing massive robot action and michael Bay delivers it in a way that is awesome. the score from steve Jablonsky is one of the best scores ever and continues to be throughout all these movies. I have to say, Sam Witwicky is quite annoying at the beginning but he forms a great relationship with bumblebee who is very likeable and Megatron is a menacing and great villain. 9.0/10"
    },
    {
      "rating": "3/5",
      "review": "While the movie is well done in some parts, the transformers themselves look strange and the main character really doesn't have any story except trying to \"get the girl\". Overall this was a boring movie that didn't really make sense in some parts."
    },
    {
      "rating": "5/5",
      "review": "Spectacular movie on so many levels. The acting from Shia and the military personnel throughout the movie was top notch. The design of the autobots were also spectacular especially when considering this movie came out in 2007."
    },
    {
      "rating": "5/5",
      "review": "GOAT absolutely marvelous"
    },
    {
      "rating": "3.5/5",
      "review": "This movie was my introduction to the Transformers franchise when I was 5 years old and it is still easily the most re-watchable of the Quintilogy. As an adult now I can see the flaws but even despite that, it's good enough as a movie and as a nostalgia trip. CGI still holds up as some of the best I've seen, the Transformers themselves have decent enough character (Optimus and Bumblebee more than others) the Decepticons were legitimately threatening and didn't fall apart if you breathed on them wrong, and the soundtrack by Steve Jablonsky still gives me chills. Wish they put more love into the sequels but still a good time, Freedom is truly the right of all sentient beings."
    },
    {
      "rating": "5/5",
      "review": "By far one of the best transformer movies of all time."
    },
    {
      "rating": "0.5/5",
      "review": "I wish I could give this negative stars. Worst movie I have ever seen. Transformers is my favorite franchise and this is a joke I can’t believe they let this movie out. Whoever authorized this should be put in jail"
    },
    {
      "rating": "3.5/5",
      "review": "I like it. It's pretty funny. The story is eh the action is good. I recommend it."
    },
    {
      "rating": "0.5/5",
      "review": "It's about human supremacy and not about robots much"
    },
    {
      "rating": "4/5",
      "review": "Just came from an early screening of this and had no expectations. This movie is good. It’s fun, good action and the humans aren’t annoying. I actually liked Pete Davidson for once and the end of the movie will make you scream!!!!!👀. See this movie asap!!!!"
    },
    {
      "rating": "5/5",
      "review": "A great action packed movie! This movie offers the basics of the history of the Transformers for anyone who is new to the franchise, Michael Bay and the American military worked closely together to give the audience a taste of what would really happen if actual robotic aliens came to Earth"
    },
    {
      "rating": "5/5",
      "review": "Transformers 2007 was everything I really wanted in a science fiction film. It had great comedy, action, characters, and writing. It's actually the only Transformers movie that did not disappoint me in any way. That to be said, it still had its flaws, but so does every movie, so it's almost as close to perfection as a film can get. Sad to say it only got worse from here though."
    },
    {
      "rating": "5/5",
      "review": "Transformers is the quintessential summer blockbuster -- full of nonstop action, sly humor and eye-popping special effects that easily distance it from the rest of the crowded pack of big-budget must-sees."
    },
    {
      "rating": "5/5",
      "review": "I remember coming home from school in 2007 when it released and popping on the TV and this film was playing on one of the channels. The action, suspense, and scores are so amazing, It turned me into a lifelong fan. And loved all the movies they did afterwards. This series rocks."
    },
    {
      "rating": "4/5",
      "review": "Good movie. Just wish there was least human screen time"
    },
    {
      "rating": "3.5/5",
      "review": "plot is alright, amazing cgi and special effects but too much time with the human characters"
    },
    {
      "rating": "4/5",
      "review": "If you look past all the typical Michael bay shenanigans, it's a nice introduction into the franchise"
    },
    {
      "rating": "4/5",
      "review": "I really liked this movie when it first came out, but it ages poorly. Still it has the spark that made transformers movie franchise possible. The cgi was mind blowing back then, and the story of a boy and his car worked so well before devolving in cgi mess in the finale. My main complaint is a little more clarity in the battles would have been nice, and a better final battle between OP and Megatron."
    },
    {
      "rating": "4.5/5",
      "review": "A summer blockbuster filled with big explosions, fantastic CGI and a thoughtful story. Transformers rides on adrenaline and nostalgia, while also aging beautifully."
    },
    {
      "rating": "5/5",
      "review": "I mean come on you can't hate on a classic Movie that started the whole transformers saga This movie is Really really really good I actually really enjoyed the action acting was good R.I.P. jazz this movie was really entertaining it's got a lot comedy action and fun moments I watched this movie on repeat over and over again I'm giving this movie a 9/10 really Good fun action packed Movie for the whole family."
    },
    {
      "rating": "4.5/5",
      "review": "Great start to the franchise. A fun and packed action movie"
    },
    {
      "rating": "2.5/5",
      "review": "While it is the best film out of all of Michael Bay's transformers films, I still don't think I'd consider it good. Just okay. The movie is way too long for it's own good, with unnecessary subplots plastered everywhere that have nothing to do with the Transformers themselves. Could have easily cut a good 20-30 minutes of unnecessary scenes, and the story would have flowed much better. The acting is passable, but that's it. Best thing about the movie is the action, the action is really fun and awesome to look at. But aside from that, it's just a mindless popcorn flick, which isn't necessarily a bad thing, but could have been so much more."
    },
    {
      "rating": "4.5/5",
      "review": "Just a fun and action filled movie everyone will love!"
    },
    {
      "rating": "4/5",
      "review": "A beautiful sunset graces the country landscape. Shia LeBeouf and Megan Fox smack lips on the hood of a yellow camero as Optimus Prime gazes pensively into the sky. He sends a hopeful message to any surviving autobots scattered across the universe. The screen goes black and we're fed an audio feast of Linkin Parks \"What I've Done.\" An awesome ending, to an awesome movie! Look, I get it. This is not an oscar movie. There are no deep dives into the human condition, no erudite discussions on the meaning of existence, or what it means to truly love. This film knows what it is: giant alien robots fighting! And damn, does it deliver! Transformers comes from far distant past of 2007, when special effects really started getting good, and it impressively holds up. In fact, it looks far better than your average Marvel project from the last 5 years, though I can't ascertain as to why that would be the case. Maybe modern special effects artists are overworked, underpaid, or just getting lazy. Regardless, throughout two and half hour runtime, which breezed by, I found myself continuously asking how they made everything look so real. It's an unsung triumph in movie visual effects. Sam (Shia LaBeouf) buys his first car which turns out to be an alien robot named bumblebee from a wartorn world called Cybertron (I guess they have bumblebees on Cybertron, otherwise where did his name come from?). Him and Mikaela (Megan Fox), his highschool crush, embark on an adventure to help Bumblebee and the other Autobots find the Allspark, a magic cube that brings machines to life. They must find it before the Decepticons do, or the whole universe is doomed, I guess. The decepticons are led by Megatron, voiced by Hugo Weaving, who I guess needed a quick paycheck. I'm not sure why Micheal Bay felt the need to bring in a top-notch actor to say a few goofy lines into a microphone which would then be enhanced and distorted to the point where Weaving's voice would be unrecognizable. To each their own. This movie's strength lies in it's ability to make giant robots turn into various vehicles, and to do it plausibly. These are not lame automatons that fold their arms in, crouch down and suddenly become a car. When they transform, the camera is often moving thematically around their bodies so you get an up-close, personal experience. You can literally see each individual part, and there's thousands of them, moving to its correct location as the truck slowly turns into a thirty foot tall man. This action happens in the blink of an eye in some cases where the decepticon will jump ten feet into the air, transform into an attack helicopter and fly away, all without missing a beat or screwing with the physics needed to make it believable. The writing is on the level of a Saturday morning cartoon. Optimus Prime speaks boldly through motivational bumper stickers as he ask Sam if he will help them. Why they would want the help of a panicky teenage boy is beyond me. I know they need to get the glasses from him, but why don't they get the glasses, and tell Sam to kindly screw off since THEY HAVE A WAR TO FIGHT? The autobots are even nice enough to conceal themselves so that Sams parents don't see them while he searches for the glasses in his room. As if these highly advanced beings who are trying to save the universe would worry about remaining a secret from this random kids parents. Although, it does set up one the most hilarious scenes in the movie as they \"hide\" in Sams backyard. This movie is a master-class in visual effects and action sequences! One of the best I have yet to see to this day! It's a fun, loud, colorful romp with a lot of humor even a little bit of heart thrown in. A must see for action, and sci-fi fans!"
    },
    {
      "rating": "4.5/5",
      "review": "This movie is absolutely EPIC! I love all of the action and I love when Megatron dies."
    },
    {
      "rating": "5/5",
      "review": "Transformers 1 is just a great overall, well rounded movie. It's one of those movies that's got everything. 58 is outrageously low."
    },
    {
      "rating": "5/5",
      "review": "The greatest 02 hours: and 24 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this movie. One thing I always look out for in a movie is the emotional part of it. And Transformers definitely delivered. The Bumblebee and Sam relationship was really interesting, funny, and emotional. Which I liked. I know many people are divided on the updated designs for this movie, but I think the more realistic designs made the movie feel more real, and fit better with the more serious tone than the Gen 1 designs would've. Megatron is a great villain, and the decepticon/autobot rivalry is fun to watch. The movie is simplistic in its plot and story, but I found it didn't take away from the viewing experience at all. Although there didn't seem to be enough Transformers in a Transformers movie, which is ironic. Overall a great movie, and one I would recommend!"
    },
    {
      "rating": "4.5/5",
      "review": "The often bog down by its horrible sequels, transformers has some thing that its sequel films lack, wonder."
    },
    {
      "rating": "1.5/5",
      "review": "Emotionally devoid popcorn flick. Explosions and chases. Boring. Shia is entertaining, but hard to really care about because the focus isn't on the Transformers until the very end. Too long and too many different plot lines with people I didn't care about."
    },
    {
      "rating": "4/5",
      "review": "With fantastic CGI and epic action sequences, Transformers is an impressive blockbuster to watch, even though it does have some noticeable problems. Rating: 79% Action: 8/10 Comedy: 6/10 Horror: 2/10 Drama: 3/10 Suspense: 4/10"
    },
    {
      "rating": "4/5",
      "review": "Definitely the best film out of the Bayverse series. I must say it's a wonderful treat for people getting into the franchise and existing Transformers fans! PROS: -Outstanding VFX for 2007 standards, even the fact that it still looks awesome today, even looks in broad daylight and very realistic! -Awesome action scenes, both regarding humans and Autobots fighting the Decepticons, with some of my favorites are Prime vs Bonecrusher, Starscream destroying jets, and Prime vs Megatron. -Solid story, probably the most cohesive one considering the rest of the films get more messy. -Solid humor, some I actually enjoyed and find memorable. -Great human characters, for the most part they're actually good compared to other movies I've seen. -Transformer characters are awesome! Autobots are memorable, badass, and all have unique personalities. Decepticons are deadly, cool looking, and actually pose a threat. -Great soundtrack, with Linkin Park at the ending makes it one of the most banger endings I've seen. CONS: -Humor can be hit or miss to some. -Some of the parts relating to humans can be boring or unnecessary. -Though I don't I have an issue with it, some may find it too action packed and may find it hard to tell what's going on."
    },
    {
      "rating": "5/5",
      "review": "Voice Acting is perfect I love Peter Cullen's Optimus Prime voice. CGI it's perfect no explanation needed. Villain I love Megatron such a underrated villain so evil, and menacing. Writing is perfect no doubt. Story/plot literally 6 million years old and came to earth to seek shelter and a war follows them. Casting is perfect. Characters I love all the characters in this movie Optimus Prime, Ratchet, Ironhide, Bumblebee I haven't watched all of G1 but I liked Jazz but although he didn't make it to the end of the film he died in honor. Adventure, the adventure of the film was great, fantastic. Ending, the ending was super good and I love all of Prime's speeches at the end of every movie."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is so fun to re-watch. I grew up on this movie and while it isn't perfect, it is super enjoyable."
    },
    {
      "rating": "4/5",
      "review": "The acting starts out decent by Shia LaBeouf but as things progress he gets good. He has a lot of charm and energy that works over time. The supporting cast is good overall with the voice acting by Peter Cullen being incredible. Megan Fox gets better as things go throughout as she gets more character thankfully. Anthony Anderson is very good also. John Turturro feels out of place in this and is the only subpar character. The cinematography is very well done with the special effects being phenomenal on the autobots and decepticons. It isn't a overstatement to say these are some of the most groundbreaking and high quality effects post 2000 that are as good LOTR, Iron Man 1 and The Nolan Dark Knight movies. The action is over the top but really cool and a bit brainless at times. But the effects are so jaw dropping you don't mind the lack of substance. Also there is tons of product placement in this along with classic Michael Bay tropes. (Borderline Softcore Porn shots, oversaturation of explosions/destruction, juvenile humor) The camerawork is solid though with well framed shots and the color saturation helps make the effects blend in also. The music is solid but a bit on the generic side, though its used in the right places well to enhance the action. The editing is good but struggles at first to make the Military Soldiers stories, Sam's story and the U.S. Govt feel like a unified story and jumps around a lot setting it up at first but once the Transformers appear it really comes together well. The pacing is very well done also with the only complaint sometimes the action goes on a bit too long like the final fight which is very well done but runs a bit too long to show off the effects and explosions. This does a great job making you believe a farfetched story. You can feel there is a love behind the source material and the care telling it. Anyone who is a fan of the show, any actors in this, watched this in 2007 as a 15 year old boy and wants to relive their childhood, or Michael Bay will like this."
    },
    {
      "rating": "3/5",
      "review": "All sci-fi and no drama, Michael Bay's Transformers is a perfect example of an exhilarating action movie with absolutely no character development whatsoever."
    },
    {
      "rating": "4.5/5",
      "review": "this is my childhood and the perfect example for an epic blockboster"
    },
    {
      "rating": "3.5/5",
      "review": "Overall, I had a great time watching the movie and was quite satisfied. It was far from ideal, but I am prepared to overlook the shortcomings. I really just wanted to have fun, and that's all I got out of the movie."
    },
    {
      "rating": "3.5/5",
      "review": "Honestly? This one was OK. Had some really cool scenes. But BOY, it got worse from here."
    },
    {
      "rating": "5/5",
      "review": "This movie was the best I love it so much when I was a kid"
    },
    {
      "rating": "3.5/5",
      "review": "Transformers (2007) is a generic and predictable big-action film, but embrace the corniness that is all over this film, it is pretty enjoyable."
    },
    {
      "rating": "4/5",
      "review": "I just pure dumb fun with cool effects and action."
    },
    {
      "rating": "4.5/5",
      "review": "Transformers are the best popcorn flicks I've ever seen, well, the first 3 are anyway... The human characters can be annoying at times but not to the point I hate the first 3 movies. The action scenes with the Transformers are complex and utter eye candy."
    },
    {
      "rating": "4.5/5",
      "review": "Awesome movie. Acting isn’t amazing but really cool effects and fun story"
    },
    {
      "rating": "4.5/5",
      "review": "Nice film. Great CGI. A little overacting done by Shia LaBeouf."
    },
    {
      "rating": "2.5/5",
      "review": "Meh. If you're up for some action-packed laughs, this might do it for you. But as with all other Bay movies, take it with a grain of salt, and a f#%klot of explosions!"
    },
    {
      "rating": "2.5/5",
      "review": "While it is a fun and entertaining experience it's not a good movie it's a movie for people who love transformers or who want to know who they are the film try's to tell almost two different stories and does not do it well"
    },
    {
      "rating": "5/5",
      "review": "The best visual effects ever done in a movie!"
    },
    {
      "rating": "3.5/5",
      "review": "Isn’t just overlong with brainless action, like the sequels. There’s plenty of heart and laughs and you’ll ship Shia Lebouf and Megan Fox"
    },
    {
      "rating": "2/5",
      "review": "An alien supercomputer robot crashes at the South Pole in the 1930s. The US contains it and modern tech is based on studying it. Yet Megatron wants to use the All Cube to transform that relatively primitive human tech to \"take over the universe\". Make it make sense. The effects are the only redeemable quality of the movie. How are there 5 of these?"
    },
    {
      "rating": "4/5",
      "review": "Transformers (2007) An Underappreciated Masterpiece There are many debates in the modern age surrounding which film franchises have the best visual effects and CGI. Too often the debate centers around Marvel and DC, with some Star Wars and Avatar mixed in. Too little does the incredible film Transformers come into the equation. While some people say that the plot of the first movie in this now 7 film collection is bland, I personally think it is an interesting take on the classic franchise from the 80s. It takes a governmental conspiracy route, taking the main character Sam Witwicky on an unsuspecting journey into an intergalactic war between alien races with some governmental cover ups thrown in. The casting for this movie was an excellent choice, and while the lead roles of Shia LeBouf and Megan Fox certainly don't look 17 as they are supposed to (they were 20 and 21 at the time), they do an excellent job of portraying the socially awkward high school boy, and the popular attractive girl that they represent. The voice acting of Peter Cullen as Optimus Prime is frankly incredible, and he has created an instantly recognizable voice. The soundtrack for this movie is also amazing. Composed by Steve Jablonky, the main title theme and the popular theme \"Arrival to Earth\" are both beautiful and instantly recognizable among audiences, having created an iconic sound for the movie. The soundtrack for the movie also features songs like \"What I've Done\" by Linkin Park, creating a wonderful background track for audiences to appreciate. Even if you are someone who agrees that the plot for Transformers (2007) is shallow, it is impossible to deny that the action sequences are some of the best ever portrayed in cinema. Director Michael Bay is a master of intense and engaging visuals, and in Transformers, the large budget allowed him and his team to go above and beyond. The choreography of the fight scenes, coupled with the impressive visual and practical effects, make for incredibly realistic yet intense fight scenes between the characters, leading to a massively engaging watch experience. The visual effects themselves are outright marvelous. Each transformer has hundreds of moving parts that had to be animated and rendered to achieve a cohesive transformation and interaction with the environment. The fact that this movie came out in 2007, yet has robots that look completely real staggers me. While watching Transformers for the first time in 5 years last week, I was expecting to see a couple of uncanny scenes, or scenes where the robots seem out of place, especially since that has become the modern standard with movies such as recent marvel movies. But no. While watching, there was not a single scene that seemed unnatural. Every scene of this now 15 year old movie looks like real life, and for that I have to wonder: Why does barely anyone consider Transformers to be one of the greatest visual effects achievements in cinema history?"
    },
    {
      "rating": "5/5",
      "review": "Esta pelicula es increible, aunque es lenta al principio y tenemos que esperar casi 1 hora de pelicula para ver a los autobots eso no le quita el hecho de que esta pelicula puede ser muy disfrutable en familia"
    },
    {
      "rating": "3.5/5",
      "review": "Good, but a bit long."
    },
    {
      "rating": "4.5/5",
      "review": "Transformers was my Childhood Blockbuster that's really Mind-blowing. This is one of my favorite movies that's holds up very well."
    },
    {
      "rating": "3/5",
      "review": "Although the plot is a bit thin at times and many characters feels underdeveloped, this movie is benefited from having mindblowing action sequences, immensely impressive special effects and many worthwile moments."
    },
    {
      "rating": "5/5",
      "review": "This movie is amazing"
    },
    {
      "rating": "5/5",
      "review": "Amazing movie one of the best sci fi family films ever made since et the extra terrestrial wich it rivals it's like director Michael bay wanted to be like the next Spielberg and he succeeded just right this is a very good summer blockbuster and one of the best ones out there Amazing movie one of the best sci fi family films ever made since et the extra terrestrial wich it rivals it's like director Michael bay wanted to be like the next Spielberg and he succeeded just right this is a very good summer blockbuster and one of the best ones out there it looked like it was even trying to compete for Oscar glory and on my eyes it succeeds this film has some of the best voice acting and special effects you can imagine the transformer robots looked awesome and megatron is a solid antagonist and Optimus prime is very brave here and is caring and the relationship between bumblebee and Shia labeoufs Sam witwicky is terrific they have phenomenal chemistry and it showed how much caring to Sam bumblebee is and the deceptions are intimidating starscream is arguably my favorite deception and he is just bada$$ in this movie I love the scenes with him fighting in it it was awesome transformers is an amazing blockbuster and one of the best movies of 2007 an all time classic 10/10"
    },
    {
      "rating": "3.5/5",
      "review": "Filme legal pra caralho, o roteiro é legal, o elenco é muito bom e deixa o fiome melhor do que já é, gostei do Shia labeouf como o personagem principal, o filme tem excelentes cenas de ação, gostei da megan fox como coadjuvante no filme e desse romance como o shia, gostei muito dos efeitos especiais, gostei bastante da luta entre os autobots vs decpeticons, e no final do filme teve a música foda what i've done do Linkin Park, com tudo isso, eu recomendo muito esse filme vale muito a pena assistir."
    },
    {
      "rating": "4/5",
      "review": "\"Transformers,\" though incredibly stupid at some parts, is extremely entertaining, with some of the best CGI to date and some of the best action sequences in any movie. Might just be a guilty pleasure of mine (and nostalgia might play a part in this review too), but I really liked this one. There are obviously plenty of flaws, but it's just a stupidly fun movie that you can turn your brain off to."
    },
    {
      "rating": "1.5/5",
      "review": "Tecnicamente e Visualmente Bem Feito e só. Apesar de também possuir bons momentos e Uma Ótima Trilha sonora. no fim não valem apena pois pensa em um filme que parece Durar 24 horas de tão chato! Personagens Desinteressantes que não nos estimula a querer acompanhá-los. Humor extremamente sem graça assim como o romance. Ambos os elementos encheram o meu saco e tornaram esse filme quase uma tortura. Diálogos sofríveis de brega. Um filme bem Machista em alguns raros momentos. E além de tudo isso ainda é intensamente inconsistente, Genérico e Forçado. Transformers é o primeiro filme do Michael Bay que assisto e simplesmente não gostei. 4/10"
    },
    {
      "rating": "0.5/5",
      "review": "Unoriginal, CGI filled, stupid and just really stupid"
    },
    {
      "rating": "5/5",
      "review": "\"Autobots, Roll out!\""
    },
    {
      "rating": "5/5",
      "review": "The greatest 02 hours: and 24 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Unoriginal, CGI filled, stupid and just really stupid"
    },
    {
      "rating": "4.5/5",
      "review": "Não é pra fazer sentido, não é pra ter coerência. É PRA TER ROBOZÃO LUTANDO E CARRO FODA!! Filmaço! \"Autobots, roll out!\""
    },
    {
      "rating": "4/5",
      "review": "Good movie. Fresh entry. Not the greatest story but watchable and good visuals and special effects"
    },
    {
      "rating": "5/5",
      "review": "The first film in the franchise that most people hate, many diehard Transformer fans including myself adore this underrated piece of art. 10/10"
    },
    {
      "rating": "2/5",
      "review": "I did like the film, the only thing is this film isn't meant for kids at all, I found it very adult, with some jokes and weird things. I love the Transformers franchise. But this movie was a bad start, I mean they got bumblebees' story wrong. I mean I wouldn't let 5 years old watch it but I mean 13 and up is good. The film is good just too many adult jokes in the film. Megan Fox is a big issue. The movie made Megan Fox's character act like a..."
    },
    {
      "rating": "0.5/5",
      "review": "Found myself constantly eyerolling to this piece of garbage, what a way to ruin a franchise."
    },
    {
      "rating": "4/5",
      "review": "This movie I really enjoyed but some jokes are bad but it is a good Michael Bay summer movies."
    },
    {
      "rating": "3.5/5",
      "review": "Um ótimo filme para assistir. Efeitos Visuais muito bem feitos e uma trilha sonora muito marcante. Os personagens são divididos entre humanos e robôs. Na parte dos humanos, os personagens são interessantes, um destaque para Sam, Mikaela e Lenox que são personagens carismáticos. Infelizmente a que mais sofre com isso é Mikaela que aqui é reduzida a personagem bonita e só. Mas claro que o que realmente interessa nesse filme são os Robôs, e aqui são o ponto mais alto do filme. Um CGI muito bonito e carismáticos, mais que os humanos. Transformers infelizmente sofre de duas coisas: Subtramas e humanos. São duas horas e vinte, cheio de tensão entre o governo, militares e transformers. Os humanos aqui recebem mais destaque que os próprios transformers. No fim, é um ótimo filme, com um CGI bonito, mas que infelizmente peca muito na parte humana."
    },
    {
      "rating": "4/5",
      "review": "I'll give this movie an 8/10 because even though it's not a perfect transformers movie, I would prefer this movie over those terrible sequels and not only that, this movie did a decent job at introducing the characters, and had a good story."
    },
    {
      "rating": "3/5",
      "review": "story itself is good and believable and visual effects are outstanding for its time ( REVIEW WRITTEN 2022). BUT CAMERA SHAKES IN MAJOR SCENES THAT RUINS THE IMMERSION! Also voice actors was spot on like peter cullen (voice of optimus prime) Shia LaBeouf, tyrese gibson, josh duhamel... and stunning megan fox"
    },
    {
      "rating": "2.5/5",
      "review": "This movie sucks. I mean really. The actors didn't even try. The story is also garbage. Lots of clichés and nonsense stuff. The CGI also sucks. Everything about this movie is horrendously bad. My god. I was excited to explore the Transformers saga before watching this. Now I want to burn all of the movies."
    },
    {
      "rating": "2/5",
      "review": "los fans de Transformers y los fans de godzilla deben estar deacuerdo en algo LOS HUMANOS VALEN PICO en primer lugar la introducción es impactante, se nos da un monologo sobre el mcguffin de esta historia en un plano espacial que nos deja intrigados e interesado, el diseño de los autobots es complejo, detallado y con colores vivos que contrastan en las escenas nocturnas, talvez demasiado pero bueno en general. en contraste los decepticons tienen colores oscuros y una apariencia amenazante, el problema con esto es que cuando la escena no tiene la suficiente iluminación solo veo una mancha negra. pasando a lo demás TODO ESTA MAL asen un intento de interesarnos por los humanos pero es irritante pasar de un robot gigante matando militares a un imbécil intentando gustarle a la Megan Fox, la trama se ase lenta y cuanto descongelan a megatron se acelera de golpe. nos introducen personajes que luego no van a importar y serán olvidados , literal el equipo de los autobots es Optimus prime, bumblebee y los otros dos. esos imbéciles solo están para que el Optimus se aviente frases chidas, el clímax final es decepcionante tiene muchos ángulos de cama que cambian demasiado rápido, en general la edición de la película es terrible, además los personaje son lentísimos, se tardan años en llegar a pegar un golpe. llega a aburrir y si quieres verla que sea en un domingo en la tarde cuando no aya nada mejor que ver 3/10"
    },
    {
      "rating": "5/5",
      "review": "LOL, the worst movie based on the action figures!!!!!!!!!! It shouldn't have made too much box office US Dollars!!!!!!!!!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "I really like these movies"
    },
    {
      "rating": "4/5",
      "review": "A movie about a yellow bug and a metal Dorito that hate each other."
    },
    {
      "rating": "0.5/5",
      "review": "I thought hands down worst of the transformers series."
    },
    {
      "rating": "4.5/5",
      "review": "This is one of my favorite comedies ever, not action, comedy. I am constantly cracking up every time I watch this. Don't take this movie too seriously, go in expecting some goofy laughs and you'll really enjoy it."
    },
    {
      "rating": "4/5",
      "review": "I can say I'm biased, but I absolutely love this movie. The first half is very slow but when everything ramps up, you can't help but get giddy. Unless you're boring or embarrassed to like action movies, you'll like this movie. Some things don't make sense, but this movie is awesome. The effects especially were well crafted and make the robots themselves pretty believable in the Grand scheme."
    },
    {
      "rating": "2/5",
      "review": "A lot of people and machines rushing around getting excited, a lot of damage happening, impressive visual effects, lots of noise chaos destruction and action, but lack of interesting story. Lack of clarity in whatever conflict was happening, which went on so long it became uninteresting and then tedious. It had the same effect as a firework display: noisy and colourful but not much useful content."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible looking Transformers and very weak character development."
    },
    {
      "rating": "5/5",
      "review": "Great live action movie of Transformers. First time watching this and it was great. 5/5."
    },
    {
      "rating": "5/5",
      "review": "Great action set pieces & great cast the robots look awesome"
    },
    {
      "rating": "4/5",
      "review": "It's Michael Bay, so don't expect heart wrenching moments here, but it is still a thrill ride from the beginning to end"
    },
    {
      "rating": "5/5",
      "review": "sooo good. forgot how much i liked this movie (i remember watching it on tv when i was little). wish megan fox had more screen time though."
    },
    {
      "rating": "5/5",
      "review": "👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍🌟🌟🌟🌟🌟"
    },
    {
      "rating": "1.5/5",
      "review": "I had high hopes for the first transformers movie, it seemed to be the only decent one besides bumblebee based on the reviews. But Michael Bay's need for out of place awkward and strange banter seep in to the film and make you feel uncomfortable at times. There were no proper payoffs, certain things were mentioned and not seen again. It didn't have a lot of why I like transformers, distinct character personalities that are complex and fun. It had some interesting observations about human beings, and I'll admit it was cool seeing the live action iterations of different autobots. But Transformers was a disappointment."
    },
    {
      "rating": "4.5/5",
      "review": "As a kid I didn't know that Transformers is a set of toys. I only used to think that it is an anime series. The first time I learnt about the movies was when one of my friends got a Nexus tablet to school and played this movie when there was no teacher in the class. I really liked the opening scenes and decided that at some point I will watch this movie. Little did I know that the opportunity will come 8 years later when the lockdown would happen. I watched it and enjoyed it very much. Transformers is exactly what I wanted to watch when I used to see the terrible anime. I didn't like Optimus Prime very much back then but in this movie I understood why he is so important to the franchise and now I am a huge fan of Optimus Prime. There were so many other Transformers whose names I got to learn as I watched this full staff I used to see this movie in parts on TV and I used to think that Bumblebee was Hotshot. After watching this movie I was feeling like replacing the the logo of my car with the Transformers logo. All the Transformers movies have very good CGI, cinematography, choreography and colour grading. What the other movies lack in, however, is a good story and acting. This movie has all of that. I really wish all the other Transformers movies were also like this. Here I cared about Sam, the army guys and of course, Mikaela (°\"U\"°). This is one of the only two Transformers movies which actually has a good plot (the other doing bumblebee). If the future Transformers movies had built up on what this movie created they could have actually been very awesome. But instead they focused more on creating a bigger universe with more cars and more merch to sell rather than on character development. I can often come back to watch this movie because of the cool cars and fight scenes, without having any of the cringe the future movies had."
    },
    {
      "rating": "5/5",
      "review": "In my opinion the best movie about Transformers. The action and the music is great. The only bad thing is that Optimus prime appears until the middle of the movie"
    },
    {
      "rating": "5/5",
      "review": "This film is a true gem that is sometimes neglected owing to its numerous sequels. Unlike the following several, this one has legendary humor. Along with the 1986 film, this is an outstanding masterpiece. Unlike some of the subsequent films, this one features some well-written human characters that are both interesting and entertaining. The photography is superb and the film appears to be really stylish. The narrative revolves on a teenage boy and his car works surprisingly well and feels like many of the more classic Steven Spielberg films such as Jurassic Park or E.T. The dialogue is really good and Glen is very relatable. I think that the way they portray the Decepticons in this movie as absolute hulking unstoppable beasts that you need to work together to defeat was really cool. The designs for the transformers are menacing and aesthetically pleasing. All in all there's a lot more than meets the eye to this film!"
    },
    {
      "rating": "4/5",
      "review": "Here at Rotten I had said that Transformers 3 was the best in the saga, but that's because I didn't remember the 1, although the Transformers script is not spectacular, the special effects are incredible and the fun is constant, it's a SUPER fun movie and fits perfectly with a comedy of his. In a few years this movie will be a classic maybe. (8/10)"
    },
    {
      "rating": "2/5",
      "review": "first in a series of transformer movies that not accurate portrayal of cartoon but instead seems like advertisement for military with explosions but no story, maybe the story blew up in one of the first explosions"
    },
    {
      "rating": "4/5",
      "review": "Basically the only good one of these movies."
    },
    {
      "rating": "4/5",
      "review": "Even though this is Michael bays first take on for the transformers movies and we all know how it crashed and burn with its sequels but this one isn't bad. Yea a Michael bay that isn't bad now that's an accomplished and what I can say about it's pretty good dear I say it it's great but it's flaws are obviously like the human characters for one are annoying and dumb except for a few like Simmons and the general and also the transformers and there effects I like it so yea I think this movie is great. Is it as great as the 86 and bumblebee? No but it's still on the list of good transformer movies"
    },
    {
      "rating": "3/5",
      "review": "This movie is not the greatest but it was really fun to watch and i loved the action, in my opinion this movie is good to watch when your bored."
    },
    {
      "rating": "0.5/5",
      "review": "This film was over an hour long commercial. The scene with all of the Ford vehicles driving through a winding mountain path was indiscernible from a Ford commercial, and it was planned that way. It's like they started with the product placement and worked backwards to a terrible script. I didn't just want my money back, I wanted my time back."
    },
    {
      "rating": "2/5",
      "review": "This is just another example for style over substance for me, which is more then what I can say for the rest of these terrible movies (excluding Bumblebee of course). The action isn't that bad (despite having too many explosions for my taste), the story isn't as bad as I remember (which isn't saying a lot), and the actual robots can still be fun to watch (which would be the only reasons I would watch the sequels, Bumblebee being a stand-out). Where this movie loses all the points for a good movie is all the humans. OMG are they stupid af. Shia Lebouf is the only one that I actually liked, and if that's the case, you know they're bad (pre \"Peanut Butter Falcon\" Shia, let's not forget). Yeah, Megan Fox and Anthony Anderson are very annoying, especially Anderson, who is just yelling a lot. Fox isn't as bad, but she just there for eye candy for the pubescent boys watching. Wow, I didn't think I would have that much to talk about with this one. Just...try to drive as far away from this one as possible."
    },
    {
      "rating": "3.5/5",
      "review": "Honestly, this movie doesn't have the best storytelling but this is still very fun to watch and they killed off jazz to early"
    },
    {
      "rating": "4.5/5",
      "review": "great cgi, great score, great plot, great acting. This film includes many greats, it definitely is missing a few things here and there that could make it better but over all it is very good. giving a more modern design look for the transformers made the film look so nice and the fight scenes were very big and explosive."
    },
    {
      "rating": "5/5",
      "review": "One of the best milestone and turning point films ever since Star Wars 1977"
    },
    {
      "rating": "0.5/5",
      "review": "The mechanics were amazing. But Shia LeBeouf was not --- he ruined it for us. Gotta go with the negativity of the professional reviewers. Saw this on TV 5-2021"
    },
    {
      "rating": "5/5",
      "review": "This movie right here started my childhood is a young boy. I always loved transformers. I am more of a new era transformers fan than the old transformers like the 1986 one."
    },
    {
      "rating": "2.5/5",
      "review": "While the visuals are incredible, the same cannot be said about the plot or characters."
    },
    {
      "rating": "4.5/5",
      "review": "I'm in LOVE with this genre! I've been getting into these lately, and they have to be my favourite movie series yet."
    },
    {
      "rating": "2.5/5",
      "review": "Starts rather slow, just to continue telling not a very good story, with no interesting characters and cringy humour. On the good side, the visual effects are top notch."
    },
    {
      "rating": "5/5",
      "review": "The movie that made me fall in love with Transformers. One of my favorite movies since my childhood. Absolutely love it with all its flaws and imperfections"
    },
    {
      "rating": "5/5",
      "review": "My absolute favourite movie!"
    },
    {
      "rating": "4/5",
      "review": "8.0/10. I find the Michael Bay Transformers Movies to be extremely underrated. I love the action of these films, the scores and the CGI."
    },
    {
      "rating": "4.5/5",
      "review": "Muitooo boom mlhr filme so com uns pontos baixos"
    },
    {
      "rating": "4/5",
      "review": "What can I say, after being a fan of Transformers since I was ten years old I was sold on this Movie. The CG and Acting made in this movie was believable enough for me and still keeps me coming back to it. Its 2021 and it's still Michael Bays best Transformer film he has made to date."
    },
    {
      "rating": "4/5",
      "review": "Michael Bay dà vita ad un nuovo franchise ad altissimo budget e ad altissimi contenuti spettacolari. Transformers diverte e affianca alla potenza visiva anche una sceneggiatura assolutamente interessante nonostante il genere. Il cast guidato da Laboeuf è di alto livello e permette al regista di eccedere in qualche patriottismo al limite dell'imbarazzante; comunque marchio di fabbrica."
    },
    {
      "rating": "3/5",
      "review": "My childhood insulted but I'd still rather have this then no Transformers action at all."
    },
    {
      "rating": "3/5",
      "review": "It was fine. Weird story choices but mindless entertainment nothing more."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie, me and my family always watch it together! I love the action, the storyline, and the romance."
    },
    {
      "rating": "4.5/5",
      "review": "The most underrated movie of all time. Perfect CGI, great and memorable characters, awesome story. Wouldn't want it any other way."
    },
    {
      "rating": "5/5",
      "review": "Cool cars, comedy, Megan fox and killer robots. 5 stars!"
    },
    {
      "rating": "5/5",
      "review": "Always has been an underrated masterpiece. Say what you will about the sequels, or Michael Bay in general, I hope that someday, people recognize this movie's greatness. This is what the 2017 Power Rangers movie could have been."
    },
    {
      "rating": "4/5",
      "review": "I loved transformers when I was a kid and to see the movie like this, its a thousand times better."
    },
    {
      "rating": "5/5",
      "review": "I actually like the first original 1 movie was really good. This should be canon. 🎥👍🙂"
    },
    {
      "rating": "4/5",
      "review": "Aside from dialogue here and there that didn’t make sense, the spectacular visual effects and very entertaining fight sequences Transformers is worth the watch and blu-ray buy."
    },
    {
      "rating": "3/5",
      "review": "Good visual, not the best story wise"
    },
    {
      "rating": "3/5",
      "review": "This is the only one of these films I've seen. It passed the time and the special effects seemed reasonable. The action was fair. But this film lacks much characterisation and is abit of a mess. It's a meh film at best."
    },
    {
      "rating": "4/5",
      "review": "This movie was different. Probably the simplest and the best from the Transformers series. The rest don't live up to its success."
    },
    {
      "rating": "3/5",
      "review": "I remember where I watched the end of this movie while playing Linkin park music, it was a good time, as much as I don't understand much of what's going on in the action scenes, the CGI is still impressive today and the feature film has characters quite charismatic."
    },
    {
      "rating": "2.5/5",
      "review": "Several thousand years ago, the planet Cybertron was consumed by a civil war between the two Transformer factions, the Autobots led by Optimus Prime and the Decepticons led by Megatron. Optimus jettisoned the Allspark, a mystical artifact that brings life to the planet and non-biological forms, into space, but Megatron pursued it in spaceship form. Megatron crashed onto Earth, landing in the Arctic Circle and froze, and was discovered in 1895 by explorer Captain Archibald Witwicky. Witwicky inadvertently activated Megatron's navigational system, which etched the Allspark's coordinates into his glasses. The glasses eventually end up in the possession of his great-great-grandson Sam Witwicky (Shia LaBeouf). In the present, a Decepticon named Blackout attacks and destroys a United States military base in Qatar in a failed attempt to hack the military network to find information on Project Iceman (a classified project linked to Megatron's whereabouts) and the AllSpark. A surviving team of Army Rangers led by Captain William Lennox (Josh Duhamel) escape across the desert, pursued by Blackout's drone Scorponok. They fight Scorponok off, aided by aerial reinforcements, and travel home with Scorponok's stinger, discovering sabot rounds damaged its armor. At the Pentagon, Secretary of Defense John Keller leads the investigation into the attack. Data analyst Maggie Madsen catches another Decepticon, Frenzy, hacking into the military network while onboard Air Force One. While the hack is thwarted, Frenzy downloads files on Archibald's glasses, tracking down Sam with Barricade, disguised as a Saleen S281 police car. Maggie makes a copy of the audio signal made during the hacking attempt and goes to her hacker friend Glen Whitmann to decode the signal, but they are promptly arrested by the FBI for having classified information. Meanwhile, Sam buys his first car, a rusting 1976 Chevrolet Camaro, but discovers it has a life of its own. Sam and his high school crush Mikaela Banes (Megan Fox) are rescued from Barricade and Frenzy by the Camaro, who turns out to be the Autobot scout Bumblebee, who has to communicate through his car radio due to being mute. Bumblebee later scans a 2006 Camaro and transforms into a duplicate of it. Bumblebee takes Sam and Mikaela to meet Optimus Prime, Jazz, Ironhide, and Ratchet. Optimus explains that if Megatron gains the AllSpark, he will transform Earth's machinery into a new army and exterminate mankind. Sam, Mikaela, and the Autobots travel to Sam's house to retrieve the glasses, but they are captured by agents of Sector Seven, a top-secret paramilitary government branch which was founded by seven people, led by Agent Seymour Simmons. The Autobots stop the agents but they call for backup, who take Sam, Mikaela, and Bumblebee into custody, though Optimus obtains the glasses and uses them to locate the Allspark... Rotten Tomatoes critical consensus reads, \"While believable characters are hard to come by in Transformers, the effects are staggering and the action is exhilarating.\" IGN's Todd Gilchrist called it Bay's best film, and \"one of the few instances where it's OK to enjoy something for being smart and dumb at the same time, mostly because it's undeniably also a whole lot of fun\". The Advertiser's Sean Fewster found the visual effects so seamless that \"you may come to believe the studio somehow engineered artificial intelligence\". The Denver Post's Lisa Kennedy praised the depiction of the robots as having \"a believably rendered scale and intimacy\", and ABC presenter Margaret Pomeranz was surprised \"that a complete newcomer to the Transformers phenomenon like myself became involved in the fate of these mega-machines\". Ain't It Cool News's Drew McWeeny felt most of the cast grounded the story, and that \"it has a real sense of wonder, one of the things that's missing from so much of the big CGI light shows released these days\". Author Peter David found it ludicrous fun, and said that \"[Bay] manages to hold on to his audience's suspension of disbelief long enough for us to segue into some truly spectacular battle scenes\". Roger Ebert gave the film a positive review, giving it 3 stars out of a possible 4, writing: \"It's goofy fun with a lot of stuff that blows up real good, and it has the grace not only to realize how preposterous it is, but to make that into an asset.\" Despite the praise for the visual effects, there was division over the human storylines. The Hollywood Reporter's Kirk Honeycutt liked \"how a teen plotline gets tied in to the end of the world\", while Empire's Ian Nathan praised Shia LaBeouf as \"a smart, natural comedian, [who] levels the bluntness of this toy story with an ironic bluster\". Ain't It Cool News founder Harry Knowles felt Bay's style conflicted with Spielberg's, arguing the military story only served as a distraction from Sam. James Berardinelli hated the film as he did not connect with the characters in-between the action, which he found tedious. Los Angeles Times' Kenneth Turan found the humans \"oddly lifeless, doing little besides marking time until those big toys fill the screen\", while ComingSoon.net's Joshua Starnes felt the Transformers were \"completely believable, right up to the moment they open their mouths to talk, when they revert to bad cartoon characters\". Daily Herald's Matt Arado was annoyed that \"the Transformers [are] little more than supporting players\", and felt the middle act was sluggish. CNN's Tom Charity questioned the idea of a film based on a toy, and felt it would \"buzz its youthful demographic [...] but leave the rest of us wondering if Hollywood could possibly aim lower\". \"Transformers\" received mixed reviews from critics and audiences. It became the 28th highest-grossing film of all-time at the time of its release and was the fifth highest-grossing film of 2007, grossing $709 million worldwide, with an estimated 46 million tickets sold in the US. The film won four awards from the Visual Effects Society and was nominated for three Academy Awards, for Best Sound Editing, Best Sound Mixing, and Best Visual Effects. LaBeouf's performance was praised by Empire, and Cullen's reprisal of Optimus Prime from the 1980s television series was well received by fans. The film was followed by four sequels, Revenge of the Fallen (2009), Dark of the Moon (2011), Age of Extinction (2014), and The Last Knight (2017), as well as a spin-off titled Bumblebee in 2018. \"Transformers\" is a bit silly and a too loud Michael Bay production based on the classic Transformers toys from Hasbro. It´s a lot of bang for the bucks, but this is not my type of film."
    },
    {
      "rating": "3/5",
      "review": "Transformers is a style over substance movie, although calling it a bad film may be a stretch. From a writing standpoint, it offers barley anything meaningful or even that interesting. The story is clunky, overstuffed, and all over the place. The initial plot of a teenager finding a car that turns into a robot that is engaged in a war with other robots is already enough. But there are also other subplots, like the cliché romantic subplot, and another subplot with these (hackers?). The characters are also very uninteresting. All of them are one-dimensional and nothing about them stands out all that much. The acting is mostly hit & miss. For example, Shia LaBeouf does a good job, however Megan Fox doesn't. This is a film that is purely saved by its effects. While the visuals are far from perfect, with some annoying shaky cam and a bland look, the effects themselves, both CG and practical, are really good, and seriously impressive for 2007. The same can be said for the sound design, immersing the audience into the film even more. Both those things combined give some flawed but fun action scenes. Transformers is fun. If your in the mood to watch some mindless action, then this isn't the worse choice."
    },
    {
      "rating": "3/5",
      "review": "Fun to watch and passes most of the time."
    },
    {
      "rating": "3.5/5",
      "review": "It's an action movie with robot-aliens that turn into cars. Bumblebee owns my heart."
    },
    {
      "rating": "5/5",
      "review": "transformers is very awesome is my other transformers favorite movie"
    },
    {
      "rating": "3.5/5",
      "review": "The first film to the franchise that began my love for the craft of movies still holds up. Still one of the best of the franchise!"
    },
    {
      "rating": "4.5/5",
      "review": "I love this franchise!!!"
    },
    {
      "rating": "1.5/5",
      "review": "Completely lost interest by the 90 minute mark."
    },
    {
      "rating": "4/5",
      "review": "Not much more to it than meets the eye, but damn it, there’s a good thematic element and is otherwise entertaining."
    },
    {
      "rating": "3.5/5",
      "review": "Pretty interesting and very entertaining and very enjoyable lots of action"
    },
    {
      "rating": "3/5",
      "review": "Big, dumb, and mildly entertaining. It is all down hill from here."
    },
    {
      "rating": "4/5",
      "review": "Really action packed and good. Also funny"
    },
    {
      "rating": "3.5/5",
      "review": "This is the best Transformers movie. At least the best Michael Bay Transformers movie. The action scenes were fun, the characters weren't as bad. I didn't find any of the characters annoying like I do in the other movies. The plot is kind of dumb at times. And the Decepticons show up way to late so you don't really know much about them. But overall the movie was entertaining but the plot can be hard to follow at times but overall a good movie."
    },
    {
      "rating": "4.5/5",
      "review": "The movie's great. It reminded me even to this day of how great the movie was. The CGI in this movie is top tier back in 2007. Music themes in this movie is perhaps the charms to those amazing scenes. Plus, there's a lot of fight scenes that makes the movie more fun and interesting to watch. Not to mention, cars in this movie is what I loved the most. The 1980s Camaro SS is my favourite car in the movie. (Also my favourite character, Bumblebee, in the franchise)"
    },
    {
      "rating": "3/5",
      "review": "This movie is very good to watch... but this big blockbuster movie gets quite boring after a lot of times watching it! The sci-fi images are excellent and I loved the sci-fi images. the action was quite intense but I enjoyed it. This may be a poor sci-fi movie, but it will always charm me with it's sci-fi images! I give this 75% Rotten Tomatoes!"
    },
    {
      "rating": "4/5",
      "review": "Its a good movie for these cartoon robots but time went slow for me and wish the movie went a but faster but the movie is still watchable recommend this movie"
    },
    {
      "rating": "4/5",
      "review": "Michael Bay is not one of the best directors in Hollywood but this is one of his better movies. Shia LaBeouf's Sam Witwicky is the standout human character in this film though Josh Duhamel and John Turturro are not bad in their respective roles. Peter Cullen returning as Optimus Prime from the 80's animated series was brilliant decision by Bay and Hugo Weaving was a menacing Megatron. Steve Jablonsky's music score and the films action are both amazing as well. The downside to this would less military and government involvement and more screen time for the Transformers particularly with Megatron and the Decepticons."
    },
    {
      "rating": "3.5/5",
      "review": "Say what you want about Michael Bay and his Transformers but this movie is a really fun ride. The acting isn't the best and the comedy comes off too raunchy and unfitting at times but the this was a fun movie to watch in the summer of 2007 and still is. To me the CGI in this movie helped pave the way of CGI used today. Could be why it was nominated for an Oscar. I know CGI has been around for a good amount of time before this movie but has any of it been this good."
    },
    {
      "rating": "5/5",
      "review": "Yes I'm one of those people who love these movies they are a great escape. Not everything needs to be deep and have some sought of meaning. I fine the people who go into detail as to why these movies are trash are the kind of people who take everything way too seriously. Just lay back and watch it enjoy it and all your troubles will go out the window that is what makes movies magical."
    },
    {
      "rating": "4/5",
      "review": "5 Stars just for my nostalgia of the movie"
    },
    {
      "rating": "4.5/5",
      "review": "Transformers is a movie surrounded by a lot of action, adventure and that despite its simple plot manages to catch the viewer and that serves to introduce these characters into live action."
    },
    {
      "rating": "1/5",
      "review": "Upped from 0.5 stars because Megan Fox is in this movie. I would describe the plot but there isn't one."
    },
    {
      "rating": "5/5",
      "review": "Totally Awesome!!! I love watching Transformers a lot."
    },
    {
      "rating": "2/5",
      "review": "Whooo!!! TRANSFORMERS is so over-the-top and off-the-cuff it's practically flamboyant. How can you not love it!?"
    },
    {
      "rating": "3.5/5",
      "review": "A great soundtrack along with an action-packed movie with awesome dialogue."
    },
    {
      "rating": "4/5",
      "review": "This movies pretty good and not as bad as people say. I love it and I think it's the best transformers movie going by story. Live action transformer movie that is. It's action packed with nice CGI that is not even a little bit dated as mild characters and it's fun as hell"
    },
    {
      "rating": "3.5/5",
      "review": "I know it features shallow characters, a bloated plot, and bad writing. Yet I still find a lot to enjoy about this movie in a cheesy way. It can be a good time if you turn your brain off."
    },
    {
      "rating": "0.5/5",
      "review": "How do you manage to mess up transformers???? These are robots turning into cars and planes. Disgusting!!!! Shameful to call this garbage TRANSFORMERS. Can’t tell good from bad guys. Optimus is a pu.... blah Things that for sure should kill, doesn’t even scratch"
    },
    {
      "rating": "2.5/5",
      "review": "watching this second file made me sad and anxious about the franchise"
    },
    {
      "rating": "2.5/5",
      "review": "One of those rare Michael Bay films that's actually passable. \"Transformers\" has a nice Spielberg-est story behind it, but it's overwhelmed by Bay's non-stop action and childish humor. At least, the visual effects were impressive. The film would have been much better if it didn't have so many subplots, which they shift their focus away from the actual Transformers themselves."
    },
    {
      "rating": "3.5/5",
      "review": "A visual and technical marvel with some iffy acting and dialogue, enjoyable despite its flaws."
    },
    {
      "rating": "2.5/5",
      "review": "It's probably the second best in the series, succeeding Bumblebee. It serves its purpose to engage audiences with VFX-driven action all the way but the lack of clarity and characters we can connect with puts it a step lower than your typical summer blockbuster."
    },
    {
      "rating": "4/5",
      "review": "Awesome and new at the time of its release"
    },
    {
      "rating": "5/5",
      "review": "This Transformers movie was awesome. Shia LaBeouf, Megan Fox, Josh Duhamel, and the rest of the cast did a fantastic job in this movie. The plot to the movie was very good and it was awesome throughout. The action scenes were incredible and the special effects were amazing as well. This is a definite must see. Check it out."
    },
    {
      "rating": "4/5",
      "review": "Although it is a Michael Bay movie, the film ends up being quite hilarious, memorable and interesting. Guilty pleasure alert!"
    },
    {
      "rating": "3.5/5",
      "review": "Only good Transformer movie plot wise. Action was impeccable too."
    },
    {
      "rating": "3.5/5",
      "review": "It was good action plus sci-fi drama must watched because visualization good"
    },
    {
      "rating": "5/5",
      "review": "My favorite Transformers movie"
    },
    {
      "rating": "4.5/5",
      "review": "I love this movie so much it was awesome transformers fan forever"
    },
    {
      "rating": "4/5",
      "review": "This movie is absolutely amazing. From building the characters to the action sequences, this film entertains and leaves a mark on the audience. The movie is able to grasp the relationship between alien and machine. However, the awkward humor in this film doesn't allow it to be a five star movie."
    },
    {
      "rating": "4.5/5",
      "review": "Micheal Bay dont deserve the hate for this series."
    },
    {
      "rating": "4/5",
      "review": "When optimus plugs ebay next level"
    },
    {
      "rating": "2/5",
      "review": "The special effects are the only impressive part of this movie, although Megan Fox's performance and Shia LaBeouf's script are both impressively bad. There is nothing particularly notable about any other aspect of this movie. Overall, Transformers proves that outstanding special effects are not an alternative to a good story."
    },
    {
      "rating": "3/5",
      "review": "I liked this movie even though it has many flaws."
    },
    {
      "rating": "2.5/5",
      "review": "Transformers is ok. It has a lot of awesome shots and Memorable moments, But the acting is very stiff at times and some of the dialogue is pretty bad. But other than the many flaws its fun."
    },
    {
      "rating": "3.5/5",
      "review": "Was a good movie. CGI, action scenes and voice performances were nice it's just that certain scenes didn't appeal to me."
    },
    {
      "rating": "3/5",
      "review": "Okay, and after this bayformer it's getting worse"
    },
    {
      "rating": "5/5",
      "review": "I love it I think it's a pretty great film"
    },
    {
      "rating": "5/5",
      "review": "Transformers 2007 Best of Movie, Soundtrack Ever"
    },
    {
      "rating": "3.5/5",
      "review": "listen, i LOOOVED transformers when i was like 7-8 years old, but now i just think its pretty weird. Still really good CGI!"
    },
    {
      "rating": "1.5/5",
      "review": "Micheal Bay's Transformers is an unholy mess"
    },
    {
      "rating": "4/5",
      "review": "the movie is not so bad but it could be better i'm not here to suck the movie because this and critics work more like first movie i don't think its so good"
    },
    {
      "rating": "4/5",
      "review": "para mi la pelicula tiene buenos efectos , buenos chistes y buenos personajes,lo que no me gusto es que los transformers aparecen pocos y todos los autobots aparecen en la mitad de la peli , las explociones aqui son mas controladas,yo le doy un 8.0"
    },
    {
      "rating": "2.5/5",
      "review": "A little disappointing. Convoluted plot with a pretty plain cast, Shia LaBeouf being the only standout. The film goes on for too long, it felt endless at a few points. As you'd expect, the special effects are outstanding - the only starring part of 'Transformers'."
    },
    {
      "rating": "3.5/5",
      "review": "Although the plot is a bit thin at times and many characters feels underdeveloped, this movie is benefited from having mindblowing action sequences, immensely impressive special effects and many worthwile moments."
    },
    {
      "rating": "5/5",
      "review": "It is a good movie and the others look good."
    },
    {
      "rating": "3/5",
      "review": "it's okey ... weak character set and nothing else than an interesting plot ... there are some cool fight scenes but most of the movie is just comedy and love story ..."
    },
    {
      "rating": "1/5",
      "review": "If you like Michael Bay movies stop reading this review and go watch the movie, you'll love it. I hated this movie. Every time the main character opened his mouth I hated him more. Not a good trait in your hero, who was not a Transformer. The first time I tried to watch this movie I walked out before I ever saw a robot. Then I got trapped on a plane and saw the whole thing. It did not get better. The action scenes are a blurry mess of blender parts half covered with explosions."
    },
    {
      "rating": "3.5/5",
      "review": "Let's be honest, this was the best we were ever going to get out of a Michael Bay Transformers film."
    },
    {
      "rating": "0.5/5",
      "review": "The only good thing about this movie is the special effects, nothing else."
    },
    {
      "rating": "5/5",
      "review": "Say what you like about the franchise, but the first movie hit it right out of the park. The music what magnificent and the cues all hit at the right times. An amazing movie all the way around!"
    },
    {
      "rating": "5/5",
      "review": "Absolutely thrilling! I've loved this film on so many levels, from the interesting character portrayals to the blood pumping action."
    },
    {
      "rating": "1.5/5",
      "review": "i always forget the name of the hottie. thats, why i google it all the time. this movie is just crap. you watch this 15 min on, than you switch to porn"
    },
    {
      "rating": "5/5",
      "review": "This is my favorite transformers movie"
    },
    {
      "rating": "3.5/5",
      "review": "The best of the Michael Bay Transformers films. Since it actually has heart and makes you root for the heroes. The sequels are just if you want to show off your surround sound for almost 3 hrs."
    },
    {
      "rating": "0.5/5",
      "review": "Oh dear God! I only managed to get through this by battering my tongue flat with a meat tenderizer. Maybe it's just an age thing - I'm over six and outside the target bracket."
    },
    {
      "rating": "3/5",
      "review": "Transformers has impressive effects even if the characters are appalling. It's got great voice roles too."
    },
    {
      "rating": "3.5/5",
      "review": "Good movie that seems to somehow makes my inner child come out."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie, AND the action"
    },
    {
      "rating": "4/5",
      "review": "We don't need multiple storylines for Transformers, but it's the cast and voice work, and special effects that satisfy us!"
    },
    {
      "rating": "4/5",
      "review": "Some people may not like the live action movie franchise but hey, it got people talking about Transformers again and this one is by far the best in Michael Bay's run."
    },
    {
      "rating": "4.5/5",
      "review": "Transformers is a good action film, the robots look amazing, and the plot is ok, it has also an excellent visual effects, the transformers are introduced correctly, the Decepticons not so good, but it's a good film."
    },
    {
      "rating": "5/5",
      "review": "The Best Transformers movie, better than the 4th and 5th one for sure."
    },
    {
      "rating": "5/5",
      "review": "One of my favorite movies of all time"
    },
    {
      "rating": "3.5/5",
      "review": "Transformers was a great Movie experience."
    },
    {
      "rating": "5/5",
      "review": "those movies are fun"
    },
    {
      "rating": "2.5/5",
      "review": "5.0/10 — \"Poor\"/\"Inferior\"/\"Amateurish\""
    },
    {
      "rating": "0.5/5",
      "review": "It is clear by watching this movie that Micheal Bay doesn't understand The Transformers. I had to watch an entire HOUR of Shia LaBeouf and Megan Fox being annoying before I could even see Optimus Prime and as a fan of the 80s cartoon that is insulting to me."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining action sequences. Good plot. Shia LaBeouf was great in this film."
    },
    {
      "rating": "5/5",
      "review": "Optimus u saved live of us live instead saving urs"
    },
    {
      "rating": "4.5/5",
      "review": "It has its flunks and Micheal Bay, but the simple plot makes a great fun film worth watching over and over again."
    },
    {
      "rating": "4/5",
      "review": "Good movie despite being made by a not so favorable director."
    },
    {
      "rating": "5/5",
      "review": "The best of the series, the action is amazing. Part of my childhood and I was not disappointed"
    },
    {
      "rating": "4/5",
      "review": "This film was good it was a little boring at times but it was the first installment but I like it this film gets a B"
    },
    {
      "rating": "4.5/5",
      "review": "The best Michael Bay movie ever. I loved this movie as a kid and to this day. 4.5/5"
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst films I've ever wasted my time on."
    },
    {
      "rating": "3/5",
      "review": "Out of all of the Transfromers movies this one is definitely the best so far"
    },
    {
      "rating": "5/5",
      "review": "megan fox is too sexie"
    },
    {
      "rating": "4.5/5",
      "review": "This movie is excellent. It has some amazing action and visuals, and the soundtrack is pure artistry. The Autobots looked badass as fuck, as they did in all the other movies, and the backstory was awesome. I liked Shia LaBeouf in this. Could his character have been better, yeah, but whatever. Also, Megan Fox was fucking HOT in this movie, despite not being that great as an actress. But, overall, great movie. Not as good as dark of the moon in my opinion"
    },
    {
      "rating": "4/5",
      "review": "A \"critically underrated\" modern classic. The epitome of what modern blockbusters were in the early 2000's (Yes, even before the MCU). Powered by energetic action sequences with one of the most emotional and majestic soundtrack ever created, Transformers might be Michael Bay's \"Finest Hour\"!"
    },
    {
      "rating": "2/5",
      "review": "It's probably the second best in the series, succeeding Bumblebee. It serves its purpose to engage audiences with VFX-driven action all the way but the lack of clarity and characters we can connect with puts it a step lower than your typical summer blockbuster."
    },
    {
      "rating": "0.5/5",
      "review": "The movie was okay in and of itself, but a terrible and shameful thing to do to the franchise."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is decent, i think the problems are the sequels."
    },
    {
      "rating": "5/5",
      "review": "its awsome movie its good i liked this movie"
    },
    {
      "rating": "4/5",
      "review": "Cool visuals, a decent piece of storytelling, and some funny dialogue here and there. This is as far as a Michael Bay film can get, and it is about the only good one."
    },
    {
      "rating": "3.5/5",
      "review": "The only Transformers that Bay seemed to care for"
    },
    {
      "rating": "2.5/5",
      "review": "Probably the first time I saw this film I had no idea what it meant and just looked impressed while looking at the CGI characters while looking for a logical background for the explosive, destructive and very conspicuous action scenes, which sway from a cut there, a cut here. Nowadays with a lot more sense of things and a high critical sense for films, I can see that the first installment of this future blockbuster franchise is not as bad as everything else, here we see a beautiful parallel for the arrival of robots on earth accompanied by the vision of a teenager who, however dull he may seem at first, still manages to be pleasant and taken seriously when he needs to. The film besides the incredible special effects that will always be a subject to come up when talking about this franchise in general, the film still manages to bring some good moments of humor, however much the action scenes may leave a little to be desired when comes to boredom, they are still exciting and offer good fun. That is, as far as it is far from perfect, at least it is assistable and fun at times, unlike other films."
    },
    {
      "rating": "4.5/5",
      "review": "Rewatching this at home, I always have a blast and never understood the hate that it got. Except for from long time Transformers fans. But still an instant classic!"
    },
    {
      "rating": "5/5",
      "review": "The one movie that started it all."
    },
    {
      "rating": "5/5",
      "review": "this was my childhood movie, i love it. transformers will always be dear to me"
    },
    {
      "rating": "3.5/5",
      "review": "Kids will love it, but adults will think it is silly and dumb"
    },
    {
      "rating": "4/5",
      "review": "Its sets up with the strange most impossible thing ever encoded glasses but ultimitly makes a good transformers movie"
    },
    {
      "rating": "4/5",
      "review": "Update. I often switch this with the score of age of extinction since that's my guilty pleasure while this is the only other good one besides bumblebee. However, there's a lot of effort put into this film and a fair amount of legacy that traced after it."
    },
    {
      "rating": "2/5",
      "review": "As much as people look back at Micheal Bay's first Transformers film fondly I can't help but feel it has not aged well. The characters are just as annoying as people complained about in the later films, the action is annoying, and the titular characters are given not nearly enough screen time to help us forgot the human ones."
    },
    {
      "rating": "3/5",
      "review": "Watching this film is like being a little kid again. Just the idea of robots beating each other up still puts a smile on my face. However, the film falls short in a lot of areas in terms of character development, pacing, editing and just all around story. Micheal Bay made a movie that you can turn on in the background and do other stuff. Shia Labouf is still as funny as always."
    },
    {
      "rating": "5/5",
      "review": "this is a good film dont deserve 57%"
    },
    {
      "rating": "5/5",
      "review": "Lots of action and fighting scenes. Story line was a bit weak, but Michael Bag has transformed the classic transformerâ(TM)s tv show into a great movie. Enjoy with your friends, family, or by yourself. You wonâ(TM)t be disappointed."
    },
    {
      "rating": "5/5",
      "review": "Greatest movie of all time first one I watched at the age of 6 and think it is great"
    },
    {
      "rating": "4/5",
      "review": "Don't listen to the critics Michael Bay did a fantastic job. 88%"
    },
    {
      "rating": "3.5/5",
      "review": "If you have grown up with it, there is not much other to say than: ''legendary''. Great performance from LaBeouf. Megan Fox also does a pretty fine job. Not perfect in the end, but has many great moments to it."
    },
    {
      "rating": "3/5",
      "review": "A good start on a franchise's first time in the live action genre. With many exhilarating action scenes that have you at the edge of your seat you would think this would be a great movie, however at times the story can feel very bloated and many scenes could've been removed while keeping the story cohesive."
    },
    {
      "rating": "3/5",
      "review": "It's mediocre, but it's not unwatchable like Fallen or the Last Knight!"
    },
    {
      "rating": "4/5",
      "review": "I'm pretty sure this is one of the well made summer block buster movies. There are some moments that actually impressive, emotional, memorable and satisfiying. The action is exhilarating, great cgi, and there are lots of good aspects in this film. The story line is pretty decent. It's simple, but effective. Personally i think this is the best transformers film so far, and better than the bumblebee movie. (But don't get me wrong, bumblebee is my second favorite tf movie. I also enjoyed the bumblebee. As a lot of people saying, bumblebee movie has more emotion, character development, and depth. Yeah it's true. At least some few characters in the first movie also worked, but it wasn't as much as the bumblebee. I totally agree. But plot of the bumblebee isn't totally unique. It is exactly same as other several movies and family movie cliches i've already seen. And has lots of plot holes and lack of action scenes more than the first movie2007.) Overall, people liked it, and i also enjoyed it. it's definetely 'enjoyable movie' for sure whatever the michael bay haters say. My score would be 7.9/10"
    },
    {
      "rating": "4/5",
      "review": "Not as bad as it's very poor sequels, Transformers takes a fun Bay flick and adds some heart to the mix"
    },
    {
      "rating": "4.5/5",
      "review": "The only good transformer movie. I loved transformers as a kid and thought the cartoon movie was much better. Take out the drunk Shia, and this would have been a much better movie."
    },
    {
      "rating": "4/5",
      "review": "Transformers is fun and the special effects are just great. With an understandable plot, transformers starts the franchise to a heroic great start"
    },
    {
      "rating": "3/5",
      "review": "Perfectly serviciable. And that's about it."
    },
    {
      "rating": "5/5",
      "review": "Great movie to watch."
    },
    {
      "rating": "1.5/5",
      "review": "The film would have been so much better without a certain leading man in it. And his co-star set the precedent of the leading women in Transformer films only being there for their looks and a shot of their rear ends."
    },
    {
      "rating": "5/5",
      "review": "This right here is my god damn childhood. I love it and I'm really happy that it's got a great score for audience and Bumblebee is doing well. But why is it that the average rating for critics is 5.8/10 and yet it has a rotten scoring?"
    },
    {
      "rating": "5/5",
      "review": "an amazing film to watch just outstanding action and the designs are amazing."
    },
    {
      "rating": "3/5",
      "review": "Pretty good but you know I was hoping for more battles"
    },
    {
      "rating": "5/5",
      "review": "i just watched bumblebee this is a tiny bit better but it makes sense why megatron wasent in the battle because he was in the hoover dam so this makes sense and maybe transformers 7 is not cancelled and we will see unicron in action!"
    },
    {
      "rating": "4/5",
      "review": "Transformers is overall a well done and fun film. The main reason I like this movie and other like this movie, is because of the action. The action is so exhilerating. The main reason for it is because of the believable special effects. They are groundbreaking, and are extremely realistic. One problem that people find with the movie is that the action is over the top, even though that is what makes the movie entertaining. Apparently, people say that the characters are uncompelling. It is not like the characters are compelling or uncompelling. They are just characters. They do not hurt or help the movie as a whole. The movie is not for the whole family. Anyone who is a kid, tween, or younger teen will enjoy it. There really is not much to say about the movie except great action, outstanding special effects, and an overall fun movie."
    },
    {
      "rating": "0.5/5",
      "review": "Didn't watch it ,don't care"
    },
    {
      "rating": "5/5",
      "review": "just amazing 5 stars"
    },
    {
      "rating": "4/5",
      "review": "Transformers (2007) was my childhood it was outstanding to me that someone could make this movie but as I grew older I could see that this film wasn’t great it was still good but not great. First of the first half of the movie had no action all that held it up was Shia Labouf’s performance and character with some funny jokes. I did not like the sector 7 stuff it just felt cheesy to me and not good, Megan Fox was to me ok she wasn’t great but she didn’t hold the movie down so that was fine. All the transformers were pretty good Optimus Prime was really great so was bumblebee, I also liked Iron Hide and Rachet and jazz. Megaton was good but he wasn’t in the movie very long and neither was star scream but over all I love this movie it does have issues but I don’t care. I’m ganna give Transformers (2007) a ( A-)"
    },
    {
      "rating": "5/5",
      "review": "the action was good also when optimus prime vs megatron first face off was EPIC!!!"
    },
    {
      "rating": "5/5",
      "review": "HOW CAN CRITCS GIVE IT A 57% ARE THEY FEELING OKAY IT IS AMAZING"
    },
    {
      "rating": "3.5/5",
      "review": "Despite being \"antagonistic\" to blockbusters action films, it makes up for a stimulating action with visually extraordinary special effects to highlight the discontent of an incoherent script or superficially charismatic characters."
    },
    {
      "rating": "5/5",
      "review": "this is a great transformers film i like the second the best"
    },
    {
      "rating": "3.5/5",
      "review": "The human characters are all generally a bit cheesy, and several are particularly poorly thought out and written. The characters of the Transformers themselves can also be a bit lacking and not particularly well-developed, but I'm not sure all of that matters. This is the ORIGINAL Transformers movie, and perhaps now we take the big explosions and overblown action for granted, seeing as a long line of inferior sequels have been churned out, but this was still the first, and it is by far the best. No matter how poor the writing is, the visuals are truly masterful, and the action/special effects will still take your breath away. By no means is this film the Citizen Kane of our generation, but it will be remembered for its' technical innovation, and I would still recommend it despite all of the negatives."
    },
    {
      "rating": "1/5",
      "review": "This film was terrible."
    },
    {
      "rating": "3.5/5",
      "review": "It's pretty mindless, but all I have to do is turn off my brain to enjoy it."
    },
    {
      "rating": "5/5",
      "review": "The best of the series by far, 'Transformers' is boasted easily by the charisma of Shia LaBeouf and the ravishing effects known only by Michael Bay standards. Fun to watch and experience."
    },
    {
      "rating": "4/5",
      "review": "Seeing transformers on the big screen is amazing and the first time hearing Optimus Primes voice gave me chills. Michael Bay does a fantastic job with special effects but his story telling .... terrible."
    },
    {
      "rating": "4/5",
      "review": "I've been a fan of Transformers for a long time, and this film was great."
    },
    {
      "rating": "3.5/5",
      "review": "Still the only decent live-action Transformers film. The Transformers sequels are all bad. As a Transformers movie, it sucks, but as a movie in general, it's decent. One of Michael Bay's few good movies. It's packed with fun and cool action scenes. The story is somewhat coherent enough, but I still wish the Autobots and Decepticons got a lot more screentime. The humans kept hogging up the screentime. Rating: 5.8/10"
    },
    {
      "rating": "5/5",
      "review": "best story in the franchise cant top it off its to good"
    },
    {
      "rating": "5/5",
      "review": "action scenes and the origins is the best parts"
    },
    {
      "rating": "4/5",
      "review": "An 80s toyline is given a slick Noughties makeover in this action-packed spectacle from Michael Bay. The Transformers themselves are imposing and impressive, even if their designs are overcomplicated, and it's a thrill to see them transforming and rolling out. The film has heart too, despite a sometimes hyperactive performance from breakout star Shia LaBeouf."
    },
    {
      "rating": "2.5/5",
      "review": "A mindlessly macho and mentally muddled car commercial. Fortunately the RiffTrax commentary drowned out the ear-piercing explosions and brain-numbing screenplay."
    },
    {
      "rating": "4/5",
      "review": "A fun, great action movie filled with awesomeness! So many epic shots in this movie with the score."
    },
    {
      "rating": "3.5/5",
      "review": "Exciting for the first movie"
    },
    {
      "rating": "1/5",
      "review": "Bay ruined my childhood. I hate you, Michael Bay. You have no sense of the character of Optimus Prime. He was asian cinema's kung fu master. He could only be beaten by subterfuge or poison. The 1980s animated movie knew that. You didn't. I hate you."
    },
    {
      "rating": "5/5",
      "review": "I thought it was a great movie and WHY ARE PEOPLE HATING THIS"
    },
    {
      "rating": "4/5",
      "review": "one of my favorite action movies"
    },
    {
      "rating": "5/5",
      "review": "the best transformers movie 2007"
    },
    {
      "rating": "5/5",
      "review": "I saw this three times in the first 5 days, was blown away, every screening people were standing clapping at the end. Yes, major plot holes, but a fun movie I can always watch."
    },
    {
      "rating": "4.5/5",
      "review": "A movie which I loved with a great protagonist and some funny robots. I do not know why but I like this mess."
    },
    {
      "rating": "2/5",
      "review": "A complete mess and a stupid movie !"
    },
    {
      "rating": "3/5",
      "review": "A good movie but could do better. 62%"
    },
    {
      "rating": "4.5/5",
      "review": "I consider this to be one of the Best Sci Fi Action films ever made. it had some of the Greatest Visual Effects that will Forever hold up, it had a very Intimidating Villain, and it introduced the world to one of the Greatest Heroes in Film History. Optimus Prime! truly a masterpiece to be seen."
    },
    {
      "rating": "2.5/5",
      "review": "Not my favorite movie to watch but it’s some what good"
    },
    {
      "rating": "5/5",
      "review": "This movie is the reason why I like transformers I love how bay brought characters back from g1. I also love how the movie was set up, it wasn't just all about the transformers it was kinda spit in to two. The beginning of the movie was amazing I just love Optimus prime's voice, the soundtrack was spot on to the tone of this movie they chose the right guy to do the soundtrack for this movie ;)"
    },
    {
      "rating": "2.5/5",
      "review": "This was groundbreaking in 2007 and impressive and it shows. The characters, the plot, the childish humor, the transformers lack of character and their exposition filled dialogue are all bad."
    },
    {
      "rating": "4/5",
      "review": "A fun action movie, with Peter Cullen's notable character fighting off decepticons, and Steve Jablosky's masterful score is what makes this movie worth your time."
    },
    {
      "rating": "1/5",
      "review": "Confusing and kind of weird. Transformers has tons of action but besides that, it's a really cheesy film."
    },
    {
      "rating": "3.5/5",
      "review": "Teen buys a robot car, and fucks his crush"
    },
    {
      "rating": "3/5",
      "review": "Good decent start to the franchise but downhill all the way. Shia is annoying as hell. Only bumblebee saves the film."
    },
    {
      "rating": "4/5",
      "review": "8/10 Transformers has the stupid, nostalgic fun that it's successors will never be able to fully capture."
    },
    {
      "rating": "4.5/5",
      "review": "I personally love this movie, caused me to collect transformers!"
    },
    {
      "rating": "5/5",
      "review": "Such a great movie!! Great action, great characters, and great story. everyone in this movie was great. Love it so much. Really great adventure everyone should enjoy."
    },
    {
      "rating": "4.5/5",
      "review": "Transformers is a fun and an badass film to watch. I liked the action scenes and Optimus Prme was perfect in this film. Its an awesome movie"
    },
    {
      "rating": "5/5",
      "review": "i absolutely loved this movie!! The action was spectacular!!"
    },
    {
      "rating": "3/5",
      "review": "It's okay, and occasionally entertaining, but, overall, Transformers could do better."
    },
    {
      "rating": "5/5",
      "review": "Where it all started and where it should have ended. The first one was by far the best of the bunch, personally I enjoyed seeing a couple of my favourite autobots on the big screen, it was loaded with action, so much so that it was hard to follow at points. I just wish there was more transformers and less humans."
    },
    {
      "rating": "5/5",
      "review": "What needs to be said. They did it. Perfect story, great acting and amazing imagery. Just spend a little more time with the 'bots."
    },
    {
      "rating": "5/5",
      "review": "best transformers movie"
    },
    {
      "rating": "5/5",
      "review": "OK lets get to it Transformers 2007 was a masterpiece, I loved it as a kid, I was impressed with the visual effects, music and action and it had some funny moments, this was great film, but then came the garbage sequels that made this one a distant memory"
    },
    {
      "rating": "5/5",
      "review": "OK lets get to it Transformers 2007 was a masterpiece, I loved it as a kid, I was impressed with the visual effects, music and action and it had some funny moments, this was great film, but then came the garbage sequels that made this one a distant memory"
    },
    {
      "rating": "5/5",
      "review": "bumblebee vs barricade good megatron vs optimus even better"
    },
    {
      "rating": "5/5",
      "review": "the best out of the 5 i dont care what people say about it"
    },
    {
      "rating": "1/5",
      "review": "Before the Transformers franchise became a punchline, i can recall audiences loving the first installment with over-exuberance. I can't say that i was one of them. This was an obnoxiously loud, over-the-top extravaganza from none other than Michael Bay. Of course, you get all the typical Michael Bay signatures; plenty of explosions, a number of slow-mo shots, a sexy female actress, and a palette of sharp colors. Not to mention, there was an over indulgence of CGI action to overload one's senses into hyperdrive. It tries to do way more than the standard action thriller, but ends up containing too many empty calories with zero nutritional value."
    },
    {
      "rating": "3/5",
      "review": "Despite being predictable in the script, it's still a fun film to watch. But, the downside is this. Shia Labeouf is really annoying as an insecure high schooler. I'm going to be honest. I was like that too, but I wasn't as big of an idiot as LeBeouf."
    },
    {
      "rating": "1/5",
      "review": "Not my favorite too hard to understand. I would rather watch something else"
    },
    {
      "rating": "5/5",
      "review": "the best and always will be the best in the series"
    },
    {
      "rating": "4.5/5",
      "review": "The only transformers film from the franchise that does the characters true justice, the action are unquestionably breath taking but Michael Bay always seem to focus on the VFX rather than the screenplay."
    },
    {
      "rating": "3/5",
      "review": "For the first live action transformer movie this is passable. A lot of unnecessary jokes and characters. If you want to watch a decent transformers movie watch the 1980s version."
    },
    {
      "rating": "3.5/5",
      "review": "A fun movie brought down by immature jokes and a lot of filler."
    },
    {
      "rating": "4/5",
      "review": "An excellent introduction to the Transformers [film] universe"
    },
    {
      "rating": "4.5/5",
      "review": "Childhood! Actually a good movie!"
    },
    {
      "rating": "0.5/5",
      "review": "OMG this is a terrible, awful, very bad movie!"
    },
    {
      "rating": "5/5",
      "review": "Best movie of all time!"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible movies! Blurry action scenes full of constant noise and explosions! Hated the special effects too."
    },
    {
      "rating": "1.5/5",
      "review": "Great action scenes and phenomenal CGI... and that's it. Under decent storyline, unrealistic actions, and cliche actors. Everything else explains itself."
    },
    {
      "rating": "3.5/5",
      "review": "This movie was fun but it focused way too much on the humans and was actually kind of boring from time to time."
    },
    {
      "rating": "4/5",
      "review": "Even with some eye-rolling humor, everything thing else is really fun to watch."
    },
    {
      "rating": "2.5/5",
      "review": "Essentially a 2 hour General Motors commercial. Shameless product placement, mediocre storyline, and overuse of explosions. Kudos to the animation crew for the great visual effects though."
    },
    {
      "rating": "5/5",
      "review": "One of the best movies ever made, Michael Bay is getting some of the kids and adults love the actions of supercharged robots from outer space. Everybody deserves to watch this movie!!!!"
    },
    {
      "rating": "5/5",
      "review": "One of the greatest movies ever"
    },
    {
      "rating": "2/5",
      "review": "Stupid, emotionally bland, and uninteresting movie. Transformers is the best movie in a terrible franchise. The visuals and action are mind blowing though."
    },
    {
      "rating": "4/5",
      "review": "Too bad the sequels dont come anywhere close to this one"
    },
    {
      "rating": "5/5",
      "review": "Perfect movie and will always be a classic in my books. 5/5"
    },
    {
      "rating": "3/5",
      "review": "This isn't a total disaster but it's also not great. The special effects are great and the film does have an effective spectacle but the characters are so flat you can barely see them and the humor just comes off as awkward most of the time. Laughs are present and cool action scenes are to be found but it's nothing more once that wears off."
    },
    {
      "rating": "1/5",
      "review": "Michael bay takes a fun cartoon series we all loved and takes a bigger dump on them then when George Lucas ruined Star Wars with the prequels"
    },
    {
      "rating": "5/5",
      "review": "It was Amazing and Fabulous"
    },
    {
      "rating": "4.5/5",
      "review": "This movie is highly entertaining and interesting the way it's set up. It is well done and I would suggest this movie to teenagers. Although Sam's parents were extremely annoying it was an excellent film."
    },
    {
      "rating": "4/5",
      "review": "I kinda like the first one! It's just hard to get through bay's directing trademarks, like racial stereotyping, glutinous effects, and of course, overused symbols of patriotism"
    },
    {
      "rating": "5/5",
      "review": "My favourite transformer is Optimus prime. the acting makes me laugh, the action scenes are awesome"
    },
    {
      "rating": "4.5/5",
      "review": "It was Awesome also why couldn't this be at least 85 rotten tomatoes. Michael Bay did an amazing job!"
    },
    {
      "rating": "3/5",
      "review": "The ultimate example of a cinematic guilty pleasure. It's also the only Transformers film that gave a damn about being fun."
    },
    {
      "rating": "4.5/5",
      "review": "Love Transformers. Great movie, action, funny, witty, and story. Definitely my favorite and best of the franchises movies."
    },
    {
      "rating": "4/5",
      "review": "This movie is just great. Even though there are some nitpicking with this movie, all in all, the original Bayformers installment is just great. It may not be the best as the 1986 movie, but the movie is still great."
    }
  ]
}