[
  {
    "rating": "5/5",
    "review": "Until the moment the last sentient being on this planet succumbs to entropy, Star Wars, and specially A New Hope, will be discussed with great praise, and it only requires half-a-brain to see why: special effects that functionally never age; a great humor; some of the most iconic characters to ever be shown in the silver screen; very well written world-building; all in great and everlasting science-fantasy bundle that serves as a homage and reimagining to the other, also great and everlasting cinematic and literary stories of samurais, cowboys, and science. What more could you ask for?"
  },
  {
    "rating": "4/5",
    "review": "From the moment the iconic opening crawl bursts onto the screen, accompanied by John Williams' majestic fanfare, you're instantly transported to a galaxy far, far away. A New Hope isn't just a movie; it's an experience, a mythic adventure that ignites the imagination and resonates across generations. George Lucas masterfully crafts a timeless tale of good versus evil, set against a backdrop of breathtaking planetary landscapes and thrilling space battles. We're introduced to Luke Skywalker, a seemingly ordinary farm boy yearning for something more, who is thrust into an extraordinary destiny. Mark Hamill imbues Luke with a relatable innocence and burgeoning heroism that makes his journey utterly captivating. Alongside him, we encounter the roguish charm of Han Solo, brilliantly portrayed by Harrison Ford, and the unwavering spirit of Princess Leia, brought to life with strength and wit by Carrie Fisher. Their dynamic, filled with playful banter and underlying affection, forms the heart of the film. And who could forget the delightful droid duo, R2-D2 and C-3PO, whose comedic bickering provides much-needed levity amidst the galactic conflict? The film's visual effects, groundbreaking for their time, still hold a certain charm. The dogfights between X-wings and TIE fighters are exhilarating, and the sheer scale of the Death Star is awe-inspiring. But beyond the spectacle, A New Hope succeeds because of its compelling story and well-developed characters. It taps into universal themes of hope, courage, and the power of belief. The Force, a mystical energy field that binds the galaxy together, adds a layer of wonder and spirituality to the narrative. Obi-Wan Kenobi, the wise Jedi Master played with gravitas by Alec Guinness, serves as a mentor figure, guiding Luke on his path and introducing us to this fascinating concept. A New Hope isn't a perfect film, perhaps a little rough around the edges in places, but its imperfections only add to its enduring appeal. It feels genuine, a passionate creation that sparked a cultural phenomenon. It's a film you can revisit time and time again and still feel the thrill of that first viewing. It's more than just a science fiction movie; it's a fairy tale in space, a testament to the power of storytelling, and a reminder that even in the darkest of times, a new hope can always emerge. It's a cinematic masterpiece that continues to inspire and entertain, and its legacy will undoubtedly endure for generations to come."
  },
  {
    "rating": "4.5/5",
    "review": "“Star Wars: A New Hope” is a timeless classic that revolutionized science fiction with its groundbreaking visual effects and unforgettable score. For its time, the film pushed the boundaries of cinematic storytelling, launching the legendary careers of actors like Mark Hamill and Harrison Ford. More than just a space adventure, it’s a masterpiece anchored in the powerful theme of hope—reminding viewers that even in the darkest times, light can break through."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing effects and fight scenes for such an old movie."
  },
  {
    "rating": "4/5",
    "review": "Random List Of Things Noticed On A First Rewatch In Ages, As Part Of Chronological Rewatch: 1) It's perfectly paced. 2) No one understands the assignment better than Harrison Ford. 3) A surprising amount of talk in languages other than English is untranslated. 4) C3-PO is somewhat annoying, but not in a Jar Jar Binks kind of way 5) There's no Yoda. Huh. 6) Luke Skywalker is quite an annoying teenager in the first act. 7) It still looks pretty good. 8) Obi-Wan's death is just odd. 9) Luke's Uncle is a bit of a d*ick. 10) Luke's Aunt is barely given any dialogue worthy of noticing. 11) Rogue One is a touch better"
  },
  {
    "rating": "5/5",
    "review": "awsome movie never gets old no matter how many times you watch it star stunning"
  },
  {
    "rating": "4/5",
    "review": "Good but I've watched it so much it's beginning to get a little boring"
  },
  {
    "rating": "5/5",
    "review": "The first Star Wars film and it’s my third favorite"
  },
  {
    "rating": "5/5",
    "review": "I just love this film. This is the one that started it all. Truly wish Disney would take notes. Just a fantastic adventure!"
  },
  {
    "rating": "3.5/5",
    "review": "Revolutionary at the time and created a great universe with great characters. Feels a bit dated now though."
  },
  {
    "rating": "5/5",
    "review": "An all time classic that changed the world forever."
  },
  {
    "rating": "5/5",
    "review": "the film had the idea in the veins of The Kirbyverse."
  },
  {
    "rating": "4/5",
    "review": "The original, which our family went to see together. I loved Han Solo even tho' he's shallow. Harrison Ford did it well. In the end, I bought the DVD prequels and the first three, plus the two following that. Great stories, with something for everyone. Unlike many viewers I loved Jaja Binks!"
  },
  {
    "rating": "4.5/5",
    "review": "🍿 Una Buena Pelicula de un tiempo diferente una historia sencilla de entender que vale pena ver esta obra de los 70's recomendable."
  },
  {
    "rating": "5/5",
    "review": "Esse filme é um exemplo da mágica do cinema"
  },
  {
    "rating": "2/5",
    "review": "From zero to hero, typically ‼️🙄🥱🥱🥱 🥱 🥱 🥱 The only plus is that Jabba is a wonderful human being 🤩🤩 Cheers from Poland 🇵🇱😘"
  },
  {
    "rating": "5/5",
    "review": "For me, and I stress, for me, this is the greatest movie made. From when I first saw it as an 8 year old to watching an original trilogy marathon with my daughter's, it means more to me than any other. From the good vs evil to laser guns to lightsabers, it's perfect."
  },
  {
    "rating": "5/5",
    "review": "What can be said that hasn't been said already? Star Wars is a pinnacle of sci-fi filmmaking. The groundbreaking visuals still look good nearly 50 years later, and its iconic characters and locations never cease to endear. Perhaps there will never be another film that defines cinema or a generation quite like Star Wars."
  },
  {
    "rating": "5/5",
    "review": "STAR WARS was the name of the movie my father took me to go see in the summer of 1977 when I was 7 years old, not \"A New Hope\"! A new hope will be that Lucas will change the name of this most awesome film back to what it was originally called. STAR WARS defined the end of the 1970s. It made us feel good about the future and gave of hope. It truly brightened what we thought about what the future would be."
  },
  {
    "rating": "3/5",
    "review": "It's kinda amazing that this movie launched everything that Star Wars has become. I give it a lot of slack as a product of its time but it really is a little bit terrible. There are way better stories in the franchise."
  },
  {
    "rating": "3.5/5",
    "review": "Kind of a slow burn and the worst lightsaber fight between to old geezers, but the chemistry of the stars is great, the story is interesting (before you learn the backstory and expanded universe). It was made in the 70s so the effects are hit and miss, but DO NOT forego the authentic New Hope movie for the re-released version with a nightmare CG Jabba and Dewbacks walking in front of the camera.... Good movie though"
  },
  {
    "rating": "5/5",
    "review": "This movie blew my 5 year old mind when it came out in 1977. Star Wars is my favorite movie of all time and nothing else comes close."
  },
  {
    "rating": "5/5",
    "review": "One of my favorite Star Wars movies"
  },
  {
    "rating": "4/5",
    "review": "The brutal theme of the movie is brilliant and an empire rules over the galaxy 's potray is great and it could be confusing if you're watching 3 to 4 so watch Rogue One to be simplified and Han Solo is my favourite character is the whole Saga ."
  },
  {
    "rating": "4/5",
    "review": "A lot less drama compared to Rogue One, which was nice. For a movie made in 1977 it puts some movies today to shame with its cinematography."
  },
  {
    "rating": "4.5/5",
    "review": "This was the movie that started the whole Star Wars franchise. It was uniqe, and it certanily was entertaining. This movie, along with the rest of the original trilogy, is peak cinema. The original trilogy has the three best movies in sci-fi history. This is a classic that future generations should continue to watch. But you must watch the original version!!!"
  },
  {
    "rating": "5/5",
    "review": "The movie that defines sci-fi for a generation and for generations to come. Made legends out of George Lucas and Harrison Ford among others. Was great to see this epic for the first time at the tender age of 13 - couldn't have been a better age to inspire wonder!"
  },
  {
    "rating": "4/5",
    "review": "In this classic sci-fi film that launched a franchise, Luke Skywalker joins forces with Obi-Wan and the Rebellion to rescue Princess Leia from Darth Vader. Their team includes Han Solo, a Wookiee, and two droids."
  },
  {
    "rating": "4/5",
    "review": "For its time this movie is out of this world its a slower movie yes but great build up for the later movies awesome moments iconic characters great movie I would rate it 87%"
  },
  {
    "rating": "5/5",
    "review": "The one that started it all. In a galaxy far far away...."
  },
  {
    "rating": "5/5",
    "review": "About the best film ever made. The best film on the series of sequel/prequels, pipping Empire into second place. The biggest film ever on release to an unsuspecting public, and deserving of the rewards it has reaped. People have forgotten what a truly amazing film this was on release, and how it changed our culture. This film gets everything right, from the cast, set design and ship design, costume design, sound effects and music. The plot and editing move the incredible story along at great speed. The world building is superb, with no time spent showing how good the sets are. The environment is there to support the story only. A truly breathtaking experience, the like we will never see again. A 10 out of 10 film."
  },
  {
    "rating": "4.5/5",
    "review": "The start of the Star Wars phenomenon, a classic Sci-Fi space fantasy that introduced us to the Force and light sabers. Lucas created a fantastic world, only thing holding it back from a five is the dialogue. George is a master at creating characters, spaceships, monsters, and new worlds but should leave the dialogue to someone else."
  },
  {
    "rating": "5/5",
    "review": "This is a perfect film."
  },
  {
    "rating": "4.5/5",
    "review": "Esse filme é excelente, e começa a maior saga da história do cinema"
  },
  {
    "rating": "5/5",
    "review": "This is a perfect movie I have no real criticisms."
  },
  {
    "rating": "5/5",
    "review": "This film ignited my love for Star Wars and Science Fiction in general. I will always love what this movie did for the space-age genre, and I would go so far as to say it is one of the greatest science fiction movies of all time."
  },
  {
    "rating": "5/5",
    "review": "The best Star Wars movie. The final fight is very good"
  },
  {
    "rating": "1/5",
    "review": "NO GAPER BINGZOID. NO PETER IGLO. NO JINKY MINUS. NO BONDO REEMS."
  },
  {
    "rating": "5/5",
    "review": "A classic for a reason. One of the best sci-fi and fantasy movies of all time."
  },
  {
    "rating": "5/5",
    "review": "🌀COLLECTION RATING 97%"
  },
  {
    "rating": "4.5/5",
    "review": "The original and classic star wars"
  },
  {
    "rating": "4.5/5",
    "review": "George Lucas' movie about a droid's exciting adventure with his partner C-3P0. Simple yet amazing at the same time."
  },
  {
    "rating": "4/5",
    "review": "I'm not sure most people can appreciate the simple beauty of this movie now that Star Wars is such a major franchise, but this whacky story of a space wizard, a farmer boy, a princess, an outlaw, and robots has such genuine charm that anyone looking for a good time cannot help but enjoy it. Star Wars never again returned to this level of complete story-telling purity. The acting is off at times, but I now consider it to be among the film's quirks."
  },
  {
    "rating": "4.5/5",
    "review": "Lucas had limited decisions and had an edge, he made a great start to a good trilogy."
  },
  {
    "rating": "4.5/5",
    "review": "Está muy bien echa la historia los efectos todo está bien echo"
  },
  {
    "rating": "5/5",
    "review": "This movie was amazing with its visual effects and was such a fun sci fi good time. Definitely took you to another place and time. May the force be with you"
  },
  {
    "rating": "5/5",
    "review": "One of the best sci fi movies ever made!!!!"
  },
  {
    "rating": "4/5",
    "review": "This movie is a sci-fi classic, with incredible acting by Alec Guinness's Obi-Wan, Mark Hamill's Luke Skywalker, Carrie Fisher's Princess Leia, and Harrison Ford's Han Solo; paired with the voice of James Earl Jones as Darth Vader. My only criticism is the horrid writing that plagues the movie."
  },
  {
    "rating": "4.5/5",
    "review": "The iconic and legendary first steps of a once titanic franchise (before the Dark Times, before the Disney Empire). An introduction to unforgettable characters, the revolutionary SFX that hadn't been seen in filmmaking prior, and our first sight of arguably the most memorable fictional weapon known to man: the Lightsaber. A must see for any fan of sci-fi fiction."
  },
  {
    "rating": "5/5",
    "review": "Well paced character development, ground breaking SFX with ILM, & a great story turned this relatively modest budget film into a cultural phenomenon. I saw it 5 times in 1977 as a 10 year old & have watched it quite a few times since then. The key to success is that the audience can sympathize & understand the characters & the plot keeps the audience invested in the outcome. Millions of people were entranced by the Death Star, Lightsabres, The Force, Luke, Han, Leia, Obi-wan, Darth Vader, R2D2, & C3PO. This is the film that started it all - it's almost unbelievable. Did I mention the score yet? John Williams, second to none."
  },
  {
    "rating": "4.5/5",
    "review": "Yes. This is a classic. Yes."
  },
  {
    "rating": "5/5",
    "review": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "3.5/5",
    "review": "A good film - a little slow at times but it's got good visuals for it's time and a fun and enjoyable plot. The characters are well written and it perfectly introduces people to the universe of Star Wars."
  },
  {
    "rating": "5/5",
    "review": "Absolute classic Star Wars movie at all time. This was the best until Disney got its hands on it!"
  },
  {
    "rating": "4.5/5",
    "review": "A timeless classic that inspired countless generations."
  },
  {
    "rating": "5/5",
    "review": "The original \"Star Wars\" is not only an exciting and charming space opera adventure, but one of the most influential and innovative science fiction movies of all time."
  },
  {
    "rating": "5/5",
    "review": "One of my favorite movies. The original trilogy is the best. The special effects are great. Very talented actors. Nice costumes. Awesome world building. Fantastic music. A wonderful director."
  },
  {
    "rating": "5/5",
    "review": "One of the best movie i've seen in my life"
  },
  {
    "rating": "5/5",
    "review": "One of the best films of all time"
  },
  {
    "rating": "4/5",
    "review": "This Movie is so good! But it’s so basic compared to the other films in the series."
  },
  {
    "rating": "5/5",
    "review": "One of the all time best movies. What a way to start a franchise. Even though this movie is more than 50 years old the visuals stilll hold up great, and the use of \"The Hero's Journey\" is amazing. The characters are fun to follow, and the adventure is amazing."
  },
  {
    "rating": "5/5",
    "review": "I love this film and even the graffics ."
  },
  {
    "rating": "5/5",
    "review": "The film that started it all. 'Star Wars'. (1977) A truly amazing classic story. I love it. It was always have a forever place in me. Thank you George Lucas!"
  },
  {
    "rating": "5/5",
    "review": "A game changer for movie history! Definitely a must watch. I love this movie, it's oddly relaxing and overall just a classic, amazing movie."
  },
  {
    "rating": "5/5",
    "review": "Das Schauspiel ist großartig.Die Charaktere sind echt toll geschrieben.Das ist ein so toller und unterhaltsamer Film.Die Kostüme sind echt toll gemacht.Die Action ist sehr gut gemacht.Star Wars ist ein extrem guter Film.Ein Film der ein eigenes Genre erfand(glaube ich).Star Wars ist einer der Einflussreichsten Filme allerzeiten.Für mich ein Film den man gesehen haben muss. 10/10"
  },
  {
    "rating": "4.5/5",
    "review": "Soundtrack: Explosive"
  },
  {
    "rating": "5/5",
    "review": "Absolute masterpiece. A revolution to Sci-Fi cinema and the movie that started a massive franchise. Of course it has aged, but the dialogs and acting are so iconic and the originality is not beaten to this day. Even if you are not a fan, this is a must-watch movie before you die."
  },
  {
    "rating": "3.5/5",
    "review": "Direção: Ok Atuação: Ok Roteiro: Ok Caracterização: Bom Soundtrack: Bom"
  },
  {
    "rating": "5/5",
    "review": "This paved the way for many Sci-Fi films yet to come."
  },
  {
    "rating": "5/5",
    "review": "Star Wars: Episode IV - A New Hope is the definitive sci-fi movie. It is an amazing adventure between good vs evil that started a legendary franchise — until Disney ruined Star Wars. And absolute banger of a film."
  },
  {
    "rating": "5/5",
    "review": "excelente película, aunque no sería lo mismo sin las secuelas y Precuelas, logra mantenerse por si sola y tiene una creativa combinación entre ciencia ficción y política más buenas actuaciones, una película inigualable."
  },
  {
    "rating": "0.5/5",
    "review": "Poor writing and effects are boring. Story is good but can’t get over the hokeyness of it. Seems a joke"
  },
  {
    "rating": "4.5/5",
    "review": "Great one, probably the best sci-fi movie of the 70s. Great special effects for the time."
  },
  {
    "rating": "5/5",
    "review": "Such a classic. Easily the best Sci fi movie from the 70s."
  },
  {
    "rating": "5/5",
    "review": "This film changed the game big time for Science Fiction. Thanks to its unique antagonists, protagonists and setting will go down as one of the most iconic films in history."
  },
  {
    "rating": "5/5",
    "review": "A Wonderful Introduction to the amazing universe of Star Wars, and the beginning of the movement of Sci-Fi Action films. Everything from the Stage Design, Sound Design, Costume's is highly impressive. As well as well put together action scene's Hamill, Ford, Fisher, and Guiness lead the movie effortlessly, and never apologize for it. Solid A+"
  },
  {
    "rating": "5/5",
    "review": "Una storia galattica, fantascienza alle stelle, una trama al di fuori della dignità che merita e uno scontro finale che è rimasto nella sua storia. 10/10"
  },
  {
    "rating": "5/5",
    "review": "Great story and character development a must see."
  },
  {
    "rating": "5/5",
    "review": "This is the best film I ever saw ! Not really for the image but for the atmosphere and the beautiful scenario and music it’s just magic 🥰 everybody need to see this film ! (Sorry for bad English)"
  },
  {
    "rating": "5/5",
    "review": "What is there left to say about this movie? Just saw it in the cinema for the first time in years. Definitely the best way to appreciate this absolute game changing sci fi classic."
  },
  {
    "rating": "5/5",
    "review": "Uma obra de arte, eu nunca havia assistido à essa franquia, mas de início já gostei, o vilão é ótimo, imponente, poderoso, os protagonista são ótimos, o Luke é sensacional no filme, Obi wan também, aquela luta então entre o mesmo e o Vader e de arrepiar, repleto de ação, tem comédia, personagens carismáticos e uma ótima trilha sonora, recomendo de mais a todos esse filme que é simplesmente magnífico!"
  },
  {
    "rating": "3.5/5",
    "review": "It's good science fiction!The acting is fine, the script, simple, the scenario, ok, but it works!"
  },
  {
    "rating": "4.5/5",
    "review": "not my favorite star wars movie, but an amazing start. 9/10"
  },
  {
    "rating": "5/5",
    "review": "I was born in 1977 so did not have the chance to see A New Hope in theaters. This movie was made with love and passion from the director, to the cast, to the last crew member. The story that started the biggest franchise of all time and made millions of kids dream of a galaxy far far away! Even if you are not a Star Wars fan this is a movie that you must see and enjoy the plot, characters, and visual effects that change the movie industry."
  },
  {
    "rating": "5/5",
    "review": "Saw it in the theaters in 1977, I was 3. Shaped my childhood. Loved the SNES games released in the early 90s. Rediscovered my love for Star Wars in 1995 when my sister gave me a semi-joke Christmas gift of a bunch of the new Hasbro figures. What new fans will never understand about original fans is we watched the story develop, we ate any crumb available until the next movie, and then licked our fingers. We weren't riding on a road, we were in the backseat of the construction vehicles that paved the road."
  },
  {
    "rating": "5/5",
    "review": "The original series will never be topped on the sci-fi realm!"
  },
  {
    "rating": "5/5",
    "review": "Can't wait for the sequel!"
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies of all time!"
  },
  {
    "rating": "4/5",
    "review": "One of the greatest examples of the \"Hero's Journey\" ever."
  },
  {
    "rating": "4/5",
    "review": "NOT BAD BUTSOME PARTS ARE SLOW LIKE REALLY SLOW BUT STILL A GOOD MOVIES BUT THE SEQUELS OF THE ORIGINAL TRILOGY ARE BETTER"
  },
  {
    "rating": "5/5",
    "review": "Genre defining masterpiece"
  },
  {
    "rating": "5/5",
    "review": "The things this movie did for cinema might never be matched. Thank you George Lucas🙏🏼"
  },
  {
    "rating": "5/5",
    "review": "man, this movie is amazing, George Lucas is a pure genius this is my favorite movie, the cast is amazing THIS MOVIE IS PERFECT"
  },
  {
    "rating": "5/5",
    "review": "No bars, just an undying classic."
  },
  {
    "rating": "4.5/5",
    "review": "The classic! Star wars the last hope or Star Wars the original title is one of the icons of Hollywood! The history is perfect and the actores ares vere good!"
  },
  {
    "rating": "5/5",
    "review": "The best of star wars"
  },
  {
    "rating": "5/5",
    "review": "The best science fiction film ever made!!! It's clear space and action goes well, a must watch!!"
  },
  {
    "rating": "4/5",
    "review": "A great overall film. This was the film that started it all. That in itself captures the audience as so much has stemmed from thus very film. A New Hope works very well as it is clear no sequel was ever intended as the film works as a stand alone production. For the time, the effects are really good and the story is unique and imaginative."
  },
  {
    "rating": "5/5",
    "review": "I dont even have to explain why this is so good. It was way ahead of its time when it comes to CGI."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing movie, great visuals expertly done. Truly revolutionary in the way it tells a story. Still pretty cheesy though."
  },
  {
    "rating": "5/5",
    "review": "I can see that it was inspired from Frank Herbert's Dune. But a brilliant adaptation. Although acting by Mark Hamill was the only down side."
  },
  {
    "rating": "5/5",
    "review": "All time classic. Amazing vision creating an entire universe that is still going strong in 2020. Feel good action, ground breaking special effects, lovely characters and a perfect villain."
  },
  {
    "rating": "5/5",
    "review": "The one that started it all, this has everything a space movie should be."
  },
  {
    "rating": "5/5",
    "review": "The sci-fi aesthetic means that it’s timeless and will be remembered as an all-time best."
  },
  {
    "rating": "5/5",
    "review": "What can be said... one of the all time greatest films ever made - combining several genres into on space setting. Simple, clever, classic."
  },
  {
    "rating": "5/5",
    "review": "A movie that has been able to transport both kids and adults to a Galaxy far far away. It is a movie I can always watch. A classic tale about good versus evil. This first installment can be watched just by itself, but be careful you might just be sure to sucked into the galaxy far far away."
  },
  {
    "rating": "5/5",
    "review": "Star wars a new hope is a masterpiece. The movie that started it all. There's not much I can say the very first Star Wars movie that hasn't already been said. With that I will just say again it is a must watch."
  },
  {
    "rating": "5/5",
    "review": "This movie did not only change the movie industry, nay, it changed the world we live on, this beautiful magnificent masterpiece is most likely the greatest film to have been devised in the history of our planet, maybe even the greatest piece of art."
  },
  {
    "rating": "4.5/5",
    "review": "At the time it was groundbreaking but what kept me watching it over 100 times is John Williams soundtrack. I will put it on at night before going to bed just to be thrilled by the music. I would've given this a five star but seeing as Mark Hamill is a total cuck now I had to takeoff half a star."
  },
  {
    "rating": "5/5",
    "review": "The movie that changed the industry forever"
  },
  {
    "rating": "5/5",
    "review": "It changed the world what else is there to know."
  },
  {
    "rating": "4.5/5",
    "review": "How Star Wars started. Incredible, must watch movie if you have not seen it."
  },
  {
    "rating": "4/5",
    "review": "Great story I mean it’s the start of the hero’s journey."
  },
  {
    "rating": "5/5",
    "review": "The greatest film of all time, apart from its sequel (The Empire Strikes Back) which somehow is even better."
  },
  {
    "rating": "5/5",
    "review": "A real treasure with George Lucas creating a unique and ground breaking science fiction saga. Superb characters, action, amazing special effects and some iconic dialogue. Incredible imagination at its best. I have watched multiple times and it towers above anything coming out of Disney Star Wars."
  },
  {
    "rating": "4.5/5",
    "review": "A childhood favourite that still gets played today. Along with The Empire Strikes Back a true classic. World class leading special effects with a heart warming story as well as creating an entire universe. Kudos George Lucas. Pity Disney Star Wars is so average."
  },
  {
    "rating": "5/5",
    "review": "Awesome show, changed me totally...."
  },
  {
    "rating": "3/5",
    "review": "not bad i hope the prequels r better"
  },
  {
    "rating": "4.5/5",
    "review": "A classic film, redefining the meaning of the Space/Oprah genre. Effects, writing, acting and directing are just so on point. A must watch"
  },
  {
    "rating": "5/5",
    "review": "What a wonderful, original story about twins that are powerful in the force, that get separated and eventually find each other. This movie trilogy has been the most rewatched series of my life."
  },
  {
    "rating": "5/5",
    "review": "The OG. Started the ultimate franchise and fan base, only to be obliterated by Disney decades later."
  },
  {
    "rating": "5/5",
    "review": "The original seed that spawned a universe. Doesn't get much better than this. Generations of families have, do and will continue to love the OT"
  },
  {
    "rating": "5/5",
    "review": "Best movie of all time - no better example of the reluctant hero."
  },
  {
    "rating": "3/5",
    "review": "Mark’s acting a little wooden, Carrie fisher and Harrison ford shine, the start of the legendary journey."
  },
  {
    "rating": "4/5",
    "review": "The original trilogy had a simple, yet good, plot about good and evil. Personally I like the prequels more for their plot, however the execution was better in the original trilogy, excluding the effects and fights, which could use a makeover."
  },
  {
    "rating": "5/5",
    "review": "My favorite movie of all time. The tone and imagination is off the charts awesome. And the special effects are still mind blowing!"
  },
  {
    "rating": "5/5",
    "review": "Just allround amazing. Got this movie around 7 years old and I was glued to the TV, even I didnt speak English at the time."
  },
  {
    "rating": "5/5",
    "review": "Perfect movie! For me the best of them all."
  },
  {
    "rating": "5/5",
    "review": "Excelente película, el mejor inicio de la saga y franquicia de películas de star wars."
  },
  {
    "rating": "5/5",
    "review": "We all had Hope. Now we have nothing but despair."
  },
  {
    "rating": "5/5",
    "review": "This is an amazing movie can’t recommend this enough"
  },
  {
    "rating": "5/5",
    "review": "A classic from beginning to end. Epic score. (At The time) amazing visuals, that still hold up to awesome for today, even without the \"updated cgi\"."
  },
  {
    "rating": "5/5",
    "review": "I don't know what I can say about this movie, it created the most successful series in the history of movies, a marvelous piece of work is what it is"
  },
  {
    "rating": "5/5",
    "review": "Life long fan of this movie. Music, visuals and story are so entertaining."
  },
  {
    "rating": "5/5",
    "review": "I watched this in the theater when it fist came out and writing a review 47 yrs later. Yes, the dialogue is awful & plot holes, from a certain point of view, are numerous, but, this is a must see for any simple, good vs evil, \"outer space\" movie that started a life style. This review is only for the oddly named Episode IV but, IMO, every movie after the original has been more & more silly such that I gave up at some point on SW."
  },
  {
    "rating": "5/5",
    "review": "The Force is strong with this one."
  },
  {
    "rating": "5/5",
    "review": "An absolute masterpiece 10/10"
  },
  {
    "rating": "5/5",
    "review": "The REAL Star wars. By George Lucas"
  },
  {
    "rating": "5/5",
    "review": "Good entry into Star Wars as this movie started the whole franchise by showing Darth Vader for the first time, Princess Leia being captured, Obi-Wan Kenobi and Luke Skywalker meeting for the first time, and even other moments like Luke destroying the Death Star, and even Obi-Wan's sacrifice."
  },
  {
    "rating": "4.5/5",
    "review": "9.5 out of 10! Cinema classic, not a fan of the special edition..."
  },
  {
    "rating": "5/5",
    "review": "As a young boy I became an instant Diehard fan. A masterpiece in Sci-Fi movie history, only out done by the squeal Empire Strikes Back. This movie changed how movies are watched with people watching it over and over again during its 1977 release."
  },
  {
    "rating": "5/5",
    "review": "Revolutionary for its time. An all-time classic of cinematography."
  },
  {
    "rating": "5/5",
    "review": "Una auténtica obra maestra en la historia del Séptimo arte, una película atemporal."
  },
  {
    "rating": "4.5/5",
    "review": "A classic. Changed cinema in so many ways and influenced generations of fans. Timeless."
  },
  {
    "rating": "5/5",
    "review": "Classic. Storytelling and plot development done correctly."
  },
  {
    "rating": "5/5",
    "review": "Outstanding movie. Well made, great acting, solid plot, revolutionary special effects, outstanding film editing."
  },
  {
    "rating": "5/5",
    "review": "The force will be with you always."
  },
  {
    "rating": "5/5",
    "review": "This is a classic film that everybody in their life must view once. There is nothing this film does wrong. Absolute classic!"
  },
  {
    "rating": "4.5/5",
    "review": "The one that started it all. The one ahead of its time. The one that changed a generation of kids. Nothing bad to say about this movie."
  },
  {
    "rating": "5/5",
    "review": "This and The Empire Strikes Back are the best in the series. Accept no substitutions!"
  },
  {
    "rating": "4.5/5",
    "review": "This iconic film kicked off the incredible Star Wars franchise, and I can see why, with it's incredible cast and characters, not to mention incredibly cutting edge special effects considering that it was 1977. A great movie and a classic to be sure."
  },
  {
    "rating": "4.5/5",
    "review": "90% It was an amazing movie"
  },
  {
    "rating": "5/5",
    "review": "I love it a really good movie"
  },
  {
    "rating": "4.5/5",
    "review": "One of the best introductions to one of the best cinematic universes ever created. While pacing is slower than the rest of the trilogy, it’s still a wonderful film."
  },
  {
    "rating": "5/5",
    "review": "I mean what is there to say about a movie that started the geek nerd generation into sci-fi and movies. This movie was the reason people got into acting and directing. Hearing James Earl Jones voice as Vader, the John Williams score. The Death Star trench scene. Easily the best sci Fi movie ever made even though The Empire Strikes Back is the best Star Wars movie in the original trilogy. 10/10 EPIC FANTASTIC."
  },
  {
    "rating": "5/5",
    "review": "The Greatest Movie ever made, Thankyou George Lucas !!!"
  },
  {
    "rating": "5/5",
    "review": "What a good movie i really enjoyed this movie a lot the acting was good what a blast from start to finish The road to the acolyte"
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films of all-time."
  },
  {
    "rating": "5/5",
    "review": "Stunning visuals and an inspiring story from the creator George Lucas. This film changed cinema on how we see films today."
  },
  {
    "rating": "5/5",
    "review": "The original Star Wars is one of my favourite films of all time and is generally considered as one of the best films ever made. The special effects in this film make it easy to see why it was so groundbreaking and technologically advanced for 1977, ILM does a brilliant job on capturing the feel of a sci-fi epic and they capture the Star Wars galaxy perfectly. The acting is also quite good for actors who were new to acting, Alec Guinness' performance as Obi-Wan is the only Star Wars performance to be nominated, though I can see why, he isn't the best actor in the series. This film is certainly the most agreeable in the series and is one that you have to see in the cinema to get a full Star Wars '77 experience. 9.7/10."
  },
  {
    "rating": "4.5/5",
    "review": "Iconic and nostalgic. This is a great intro to the STAR WARS franchise showing you an aray of species, planets, ships, cultures and chracters. The Mos Eisly bar scene is great and the STAR WARS jazz can't be replicated. It is a bit slow but thats to be expected from a first movie."
  },
  {
    "rating": "4.5/5",
    "review": "not really a big Star Wars fan but I still really enjoy watching this one. to be honest this is the only one I go back to some times."
  },
  {
    "rating": "5/5",
    "review": "Certified hood classic"
  },
  {
    "rating": "4/5",
    "review": "Great film! You care about the characters from the start. The second half of the movie picks up in pace and keeps you wanting more."
  },
  {
    "rating": "3.5/5",
    "review": "If we are being honest this movie is mainly good because of the universe it created for us all."
  },
  {
    "rating": "4.5/5",
    "review": "It's a classic!"
  },
  {
    "rating": "5/5",
    "review": "Brilliant film, doesn’t get old!"
  },
  {
    "rating": "3.5/5",
    "review": "Still the only Star Wars movie I’ve seen and it was cool I guess"
  },
  {
    "rating": "5/5",
    "review": "he Star Wars movies are the best movie franchise ever made hands down! You will laugh and cry and some times at the same time with strong messages for humanity!"
  },
  {
    "rating": "5/5",
    "review": "this is the movie that started it all WOW first of all the effects are good for there time 1977 and they have a cool villain and cool hero"
  },
  {
    "rating": "5/5",
    "review": "2nd best movie of all time"
  },
  {
    "rating": "5/5",
    "review": "An absolutely revolutionary and fun movie, with an awesome cast of characters and a vast world to be discovered"
  },
  {
    "rating": "4.5/5",
    "review": "The movie that started it all. The very first Star Wars movie is an absolute classic and one of the most iconic movies of all time. This movie was so far ahead of it's time! It has some of the best characters in cinema history, such as Luke Skywalker, Han Solo, Leia Organa, Darth Vader, C-3PO and R2-D2, it has a great plot, which is to destroy the Death Star that the Galactic Empire has built and is just an overall great movie. In my opinion, the 2nd best Star Wars movie of all time. Overall, this movie is fantastic and demonstrates that you don't need to look great to be a great movie. 4.5/5"
  },
  {
    "rating": "4.5/5",
    "review": "🍅 9.8/10 The start to one of the best trilogy ever in my opinions isn't the best but this is a damn good movie. I I owe my childhood to this film. This is one of the earliest memories of film. Grade A"
  },
  {
    "rating": "4/5",
    "review": "Der Beginn einer der besten Filmtrilogien"
  },
  {
    "rating": "5/5",
    "review": "Of the films I'd give five stars to, this one is among the weakest. But that's me splitting hairs. The original Star Wars still does enough to earn this score: A full roster of cool characters. Extraordinary special effects for the time period. This pic is extremely rewatchable, and will always be a pure cinematic spectacle."
  },
  {
    "rating": "3.5/5",
    "review": "Would not recommend to Tiffany. That's for sure. Movie is pretty old and you can kind of tell XD. Vader fighting Obi Wan looks like two old guys hitting each other with their walking sticks. Pretty unskibidi. Best character overall hands down is ..... C3PO of course. Taaban. No contest. He is the best. Second place R2D2. R2D2 locked in. I wish I could choke people out like Darth Vader thats pretty cool I especially have one person in mind that I would absolutely love to use that move on. I think Luke Skywalker needs more training lessons a tad more training hes kinda noob right neow."
  },
  {
    "rating": "4/5",
    "review": "The first Star Wars movie moves quickly yet is very easy to follow. There is a lot of creativity on display here, the creatures, vehicles, and even the locations have unique characteristics. John Williams's score elevates this movie to its iconic status even if George Lucas' directing leaves room for improvement."
  },
  {
    "rating": "3.5/5",
    "review": "The one that started it all it is a good movie and is part of the original trilogy can't really criticize it so just go watch it it's good."
  },
  {
    "rating": "5/5",
    "review": "A Game Changing movie. Yes some of the dialogue is cheesy and some of the acting isn't fantastic but this movie stopped the World. Some of the greatest Sci-Fi characters ever created all in 1 film. The special effects still stand-up to this day."
  },
  {
    "rating": "3.5/5",
    "review": "this is the most iconic movie of all time, and with all that being said I think it is overrated, but well written and amazing cinematography. I might not like it, but it still doesn't remove the title of most iconic movie ever. The acting is precise, and it delivers the most iconic lines of all time."
  },
  {
    "rating": "2/5",
    "review": "its very boring and over rated"
  },
  {
    "rating": "4.5/5",
    "review": "It was pretty good! Good story, the characters were likeable Amazing quality!"
  },
  {
    "rating": "4.5/5",
    "review": "An amazing iconic movie and the great beginning of Darth Vader, the best villain of all. 9/10. -1 for the quirky lines. Altogether this movie is great."
  },
  {
    "rating": "4/5",
    "review": "It has its flaws, predictable at times with the occasional cheesy dialogue, but there's no denying the film of its enduring impact on pop-culture, a cultural phenomenon, rather, with special effects groundbreaking in its time, iconic characters for decades to come, and a timeless theme of good versus evil."
  },
  {
    "rating": "4.5/5",
    "review": "\"Star Wars\" is the definition of a classic."
  },
  {
    "rating": "5/5",
    "review": "A great standalone movie as well as a great beginning to its trilogy. The effects are date but fun to watch and the movie has a clear story to tell. Honestly amazed this came out in 1977, it feels ahead of its time."
  },
  {
    "rating": "3.5/5",
    "review": "i know everyone like it but me, i'm not it's really too long for what it is, it's good i supposed but not for me"
  },
  {
    "rating": "5/5",
    "review": "Star Wars is my favorite franchise of all time! And this is probably my favorite of the classic trilogy! The beginning scene, the \"who shot first?\" scene, the Leia rescue, and the Death Star run are my favorite moments from the movie. George Lucas has certainly created a fantastic and innovative cinematic universe full of amazing actors, characters, vehicles, scenes, and music!"
  },
  {
    "rating": "5/5",
    "review": "The second best film of all time"
  },
  {
    "rating": "4.5/5",
    "review": "The beginning of the whole saga. Has some flaws but is one of the mos iconic movies of all time."
  },
  {
    "rating": "5/5",
    "review": "it is super good you need to see it"
  },
  {
    "rating": "5/5",
    "review": "The laser sword fight is pathetic. Besides that, though, this movie changed the film industry. It did so through its hero's journey storytelling, special effects and blockbuster nature."
  },
  {
    "rating": "4.5/5",
    "review": "A true classic. Nuff said."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films of all time should be in everyone's top 50 movies of all time."
  },
  {
    "rating": "5/5",
    "review": "Despite being the oldest SW movie, it has aged shockingly well over the course of nearly fifty years. Thanks in no small part to Lucas's special editions. Still top two even now."
  },
  {
    "rating": "5/5",
    "review": "At 4 years old in 1977, I remember a little bit about Star Wars at that age, but mostly being in a line that wrapped around a theater that had just one screen, in the heat of the summer in Arizona. I know my dad told me I loved it and I became obsessed with it as a kid (well I still am). Whenever it was released in the theaters in the '70s, '80s, and 97's special editions, I tried to see it when possible. Space, aliens, action, spaceships, and DRIODS. I remember R2D2 was and still is my favorite character from the first Star Wars. I even had an R2D2 cake my mom had made for me at 5 years. This movie, besides Empire, is my all-time favorite movie. It has non-stop action and the story, many may figure it to be predictable, but it's the way it is presented. But, to me it is Perfect. Ford, Hamill, and Fisher are the greatest trio. George Lucas' Star Wars revolutionized the world during this time and it still has stood the test of time. My favorite part of the movie (which is pretty the whole movie) is hard to pick but the final battle on the death star does it for me. I have seen this movie so many times, I can pretty much quote it line for line, and even more geeky I can follow the soundtrack to the movie without watching out. Now many fans out there prefer the original cut of this movie but I prefer and love all the changes that George made. This doesn't mean I do love the original cut, but it just makes and enhances this movie's experience. It did not change the plot or characters but pretty much improved the action and SFX."
  },
  {
    "rating": "5/5",
    "review": "Star Wars Episode IV: A New Hope will always be one of the greatest in cinematic history. From the moment the opening crawl begins, we're transported to a galaxy filled with excitement and adventure. George Lucas provided ground-breaking direction with this one film that launched an empire of a franchise. Mark Hamill, Carrie Fisher, and Harrison Ford bring their characters to life with our badass Jedi prodigy and iconic space princess. The special effects, though groundbreaking for their time, still hold up remarkably well, forever immersing us in a galaxy far, far away. And of course, John Williams' beautiful score is the perfect companion to every epic moment. Decades later, \"A New Hope\" remains a cherished classic that never fails to captivate my attention."
  },
  {
    "rating": "5/5",
    "review": "A great movie and my 2nd favorite in trilogy, a great sci-fi film, and the start of a everlasting saga"
  },
  {
    "rating": "2/5",
    "review": "overrated AF, maybe good at the boomer age, now dont make no sense, doesnt alling with the plot, fights dont make any sense according to their power hierarchy. Why THE DEATH STAR gets one tapped? Thought its the ULTIMATE WEAPON OF THE DARK SIDE"
  },
  {
    "rating": "5/5",
    "review": "A timeless classic. This movie is beloved by so many for a reason, it was extremely innovative at the time and sets up the rest of the Star Wars universe perfectly just as George Lucas intended. This movie is a must watch."
  },
  {
    "rating": "5/5",
    "review": "10/10 movie classic the story is so good and I think I know why they started with episode 4 first and if I'm right then that makes the sequel trilogy much better then people think"
  },
  {
    "rating": "5/5",
    "review": "The first two Star Wars films are as good as they get."
  },
  {
    "rating": "5/5",
    "review": "Filmaço! Obra-prima do cinema mundial, um clássico, já nasce um clássico, apenas assistam."
  },
  {
    "rating": "4.5/5",
    "review": "A great movie about the triumph of the human spirit."
  },
  {
    "rating": "5/5",
    "review": "George Lucas has a great imagination in story telling! Anyone new to Star Wars should start with this one since it's the OG. Great cast and special effects that will remain memorable for generations to come."
  },
  {
    "rating": "5/5",
    "review": "If you watch only one Star Wars movie, A New Hope should be the one. This is a quintessential movie for science fiction fans, and it won 11 Oscars from the 1978 Academy Awards. It's a simple, timeless story that embraces familiar archetypes such as the restless farm boy who longs for adventure, the salty pirate smuggler who's only out for his own greed, the wizened sorcerer with a mysterious past, the determined princess of a kingdom in distress; the dark knight that serves a shadowy and tyrannical overlord. Though it may sound cliché, this space saga subverted all expectations in the best way when it was released. Star Wars became a standard throughout industry-wide film making innovation that resulted in a boom of new effects in both sound and visual aspects of film production. That in itself deserves more, but 5 stars is the limit, so I'm giving this flick the highest rating I can. I still think of Star Wars: A New Hope as the very beginning of a whole new kind of movie. Lucas (with his Light & Magic) had a vision that lit up the whole art of film!!"
  },
  {
    "rating": "4.5/5",
    "review": "I thought this movie was great. It had everything not boring great characters. Love Darth Vader the Stormtroopers are cool. just a great great movie."
  },
  {
    "rating": "5/5",
    "review": "No wonder this is a masterpiece in its own right... I believe Science fiction was redifinied back in 1969 when 2001 came out, then again with Star Wars, because it remains the first saga ever to become a franchise and George Lucas was a pioneer for that, presenting us the possibilities of inventing very iconic characters and a captivating yet simple but very original space story that has never had any movie rival to beat its creativity. And also, the way a 60s-70s movie is made compared to the later decades, is just unbeatable and truly inspirational..."
  },
  {
    "rating": "5/5",
    "review": "If it wasn't for this movie, there would be no such thing as Star Wars, one of the most influential and stunning movie franchises of all time. Case closed."
  },
  {
    "rating": "4/5",
    "review": "Truly is a masterpiece of a lifetime"
  },
  {
    "rating": "5/5",
    "review": "Ever since I was 4 years old or younger, I always loved this movie! I would say this is my favorite movie of all time. Episode 4 is just really good!"
  },
  {
    "rating": "5/5",
    "review": "If you don't like that, we won't be friends."
  },
  {
    "rating": "5/5",
    "review": "Just the best begining a a new era in sci fi. A classic"
  },
  {
    "rating": "5/5",
    "review": "A timeless cinematic masterpiece that embarks on the classic hero's journey, captivating audiences with it's epic tale of rebellion against the tyrannical Galactic Empire. George Lucas skillfully weaves a narrative that not only explores the battle between good and evil but also delves into themes of spiritualism. It's influential impact extends beyond the screen, leaving an undisputable mark on popular culture and shaping the way we perceive the hero's journey in storytelling. This film holds a special place in my heart, having been a source of inspiration during my youth."
  },
  {
    "rating": "4.5/5",
    "review": "absolute legendary movie! still holds up to this day and is a classic that is still amazing to this day"
  },
  {
    "rating": "4/5",
    "review": "A true mark of excellence is experienced when you finish watching, fueled by the tremendous hype surrounding this franchise, and it truly lives up to expectations. Another noteworthy aspect is its brilliance, particularly considering the era in which it was created, showcasing incredible characters, visuals, and innovative ideas. The minor caveat is that at times, it becomes clear that there was more to be shown and done, but technology simply didn't exist to facilitate that. This might be a drawback for those lacking patience for the simpler dialogues of old films, but undoubtedly, it remains a classic!"
  },
  {
    "rating": "5/5",
    "review": "Absolute classic!!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Almost perfect, especially for the time it was made, awesome characters, visuals and ideas presented. The minor issue is that sometimes it's clear there was more to be shown and done, but technology just didn't exist to make it."
  },
  {
    "rating": "4/5",
    "review": "Really Good Star Wars movie. I kind of like it more than Revenge of the Sith."
  },
  {
    "rating": "5/5",
    "review": "My all time top childhood movie."
  },
  {
    "rating": "4.5/5",
    "review": "Released in 1977, George Lucas' Star Wars was an instant megahit earning itself a lot more than its $11M budget, to say the least, spawning one of the biggest movie franchises of all time which is still going strong to this day, albeit under new management. In the vein of the old Buck Rogers and Flash Gordon serials, Star Wars is a space adventure following young farmer Luke Skywalker's (Mark Hamill) epic journey as he joins the Rebels to take down the evil Empire and their new world-ending weapon: the Death Star. With the help of the mysterious Ben Kenobi (Alec Guinness), tough guy smuggler Han Solo (Harrison Ford), his pal Chewbacca (Peter Mayhew), Princess Leia of the planet Alderaan (Carrie Fisher) and two faithful droids, they set out to use the Death Star plans to destroy it once and for all. Lucas' film begins in somewhat humble fashion as we spend a good amount of time with droids C-3P0 (Anthony Daniels) and R2-D2 (Kenny Baker) on a desert planet before encountering Luke Skywalker who soon becomes informed of the princess' capture by the villainous Grand Moff Tarkin (Peter Cushing) and Darth Vader (voiced by James Earle Jones). Star Wars proceeds to deliver a jaw-dropping spectacle with elements of classic westerns, swashbucklers and samurai films thrown in. The result is a type of cheesy sci-fi space opera that many had tried to create prior for the big screen, without much success, as Star Wars also worked brilliantly as a mainstream modern action blockbuster. This loving homage to the science-fiction serials of the 1930's is packed with charm thanks to the likable cast (Harrison Ford steals the show as Han Solo) and the sheer imagination flagrant on the screen. The sets are hugely impressive, the special effects are groundbreaking and make this wild tale look as convincing as possible. The whole thing is complemented by John Williams' unforgettable score that sets the tone perfectly. There are some pacing issues; the desert and pre-war scenes are a bit of a snooze; but the film will win you over by the end. The impact of Star Wars on cinema and culture in general has, obviously, been huge and it all began with a film that aims high without any pretension, only aiming to be the most entertaining and creative movie that it could be. The Special Edition hurts this one quite a bit so, if you somehow can find the original version, that's your best bet. Iconic."
  },
  {
    "rating": "5/5",
    "review": "The BEST movie I've ever watched in my entire life!!🔥❤️ This movie made my life and left me happiest memories! I wish I could see more these kind of movies nowadays! Y'all have no idea how much I love this movie.😭"
  },
  {
    "rating": "5/5",
    "review": "If you have Parents that were Kids in the 1970s, then you have parents that were lucky enough to have seen this Sci-Fi blockbuster, the one that started it all, the one that has awakened Hollywood's interest in Science Fiction Storytelling, but Star Wars was very Awesome, and will almost never be Topped. It's Original, Action-Packed and wonderfully acted... 10.5/10"
  },
  {
    "rating": "5/5",
    "review": "One of the best movies ever made and the most memorable, theatrical experience I remember as a child!"
  },
  {
    "rating": "5/5",
    "review": "I grew up with the prequel trilogy but it was THIS OG trilogy installment that got me into star wars. I love how everything starts, from Farm boy to Jedi. The story telling was done very well, just enough mystery at times to keep it interesting. Sad to see how the Disney Sequel trilogy ruined Star Wars."
  },
  {
    "rating": "5/5",
    "review": "I just want to put my shizzle in Princess Leia's hair bun!"
  },
  {
    "rating": "4/5",
    "review": "The first Star Wars film sets the stage for modern space operas. With a well-chosen cast, groundbreaking graphics for its time and a whole universe at its feet, this is one not to be missed. While it is predictable, this is a classic film that everyone with access to should see."
  },
  {
    "rating": "5/5",
    "review": "Formative, both for cinema and for me."
  },
  {
    "rating": "4/5",
    "review": "When you're feeling nostalgic for old school blockbusters, put this on as relaxing background noise."
  },
  {
    "rating": "5/5",
    "review": "A film so iconic and so ahead of its time, films 45 years later are still catching up. To open a galaxy of possibilities and wonders like this, its value to film is priceless."
  },
  {
    "rating": "5/5",
    "review": "The movie the started it all. Star Wars: Episode IV - A New hope, is without a doubt one of the most influential movies of all time."
  },
  {
    "rating": "4/5",
    "review": "The movie that started it all.... YEEP!!!"
  },
  {
    "rating": "5/5",
    "review": "Star Wars: A New Hope (1977) is an action-packed film written and directed by George Lucas. The story is set a long time ago in a galaxy far far away where the galaxy is ruled by the tyrannical Galactic Empire. The story revolves around the Rebel Alliance stealing the architectural plans of the Empire's new deadly space station otherwise known as the \"Death Star\" under the command of the sinister imperial leader Darth Vader. When the Rebel leader, Princess Leia is captured by the Empire, Luke Skywalker acquires the stolen architectural plans and sets out to rescue her whilst learning the metaphysical power known as \"The Force\" from Jedi Master Obi-Wan Kenobi. I was extremely impressed by the film as a whole. The graphic and soundtrack remains a classic among the filming industry, despite being released almost 50 years ago. The film adds a slight touch of comical scenes and phrases that made the whole film itself more lively. It is truly a timeless masterpiece that doesn't seem to age. This film always deserves a place in my heart as one of the best films ever made. I highly recommend this to everybody that enjoys science-fiction and action."
  },
  {
    "rating": "5/5",
    "review": "Its a classic! AFter a rewatch it celitified my opinion thats its one of the best sci fi films ever."
  },
  {
    "rating": "4.5/5",
    "review": "What should i say a timeless masterpiece"
  },
  {
    "rating": "5/5",
    "review": "The Star Wars nostalgia is real! Every time I watch this original trilogy I cry with how much joy it brings to me and other Star Wars Fans who grew up with the franchise!"
  },
  {
    "rating": "1/5",
    "review": "George Lucas' attempt to take on a world of this magnitude clearly does not pan out the way that he wants it to, which is shown throughout this movie, because Star Wars: A New Hope acts as a would-be franchise starter, but the \"good\" of the movie that you might be able to find (maybe with a magnifying glass) is let down by inconsistencies, lazy storytelling, and a plot riddled with holes that make for gigantic gaps in the story that barrel it down, George Lucas made an attempt to make a sci-fi world to capture the audience's attention- but his attempt was feeble and does not play out. In conclusion, George Lucas, shut up, take a seat at the kid writer's table, and go let the people who can actually think up of a world this big and keep it fresh- along with keeping the details in their heads so one section is different from the other. George Lucas, in full conclusion, shut the hell up, go away, and let the people GOOD at writing do this so we don't have to make room for your crap."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing ! Truly a classic that needs to be seen. This is the start to such a rich and beautiful universe ! Thank you for this, George Lucas !"
  },
  {
    "rating": "5/5",
    "review": "Welcome to the galaxy, it starts here, not anywhere else."
  },
  {
    "rating": "5/5",
    "review": "One of my favorite movies of the greatest year ever 1977! George Lucas was and IS a cinematic genius! Creating memorable characters and compelling stories!"
  },
  {
    "rating": "4.5/5",
    "review": "This is the first movie to come out ever in the Star Wars franchise. For it's time it still holds up way better than some of the movies we get now. The casting is always gonna be top notch and George Lucas made a perfect script for the movie."
  },
  {
    "rating": "5/5",
    "review": "Greatest introduction to a trilogy of all time. Must watch."
  },
  {
    "rating": "5/5",
    "review": "Star Wars is a masterpiece. I love all the characters and the villains. I especially love John Williams music. Its one of my favorite films of all time and I highly recommend this movie."
  },
  {
    "rating": "2.5/5",
    "review": "As a star wars fan this first movie is tbh mediocre. The characters have no emotions, Luke has hi reaction to his aunt and uncle dying and we never see Leia grieve that her entire home planet and everything she knew has been blown to pieces. The special effects are ground breaking for its time and so e of them still hold up. Over all the movie is really beautiful, the compositions especially. The designs and world building is of course stellar and genius. Bit as a movie overall, the story is simplistic to say the least and the characters are flat."
  },
  {
    "rating": "5/5",
    "review": "When you really consider all the variables that had to fall into place for this to not only be great but endure the test of time the movie feels all the more remarkable. The nostalgia Lucas was trying to capture with this series feels it's purest here . . . a big, grandiose, space opera that never stops being entertaining."
  },
  {
    "rating": "4/5",
    "review": "A New Hope has aged the worst of the original trilogy by far, but the story, characters, and the universe it introduces it what really makes the film great. The film is clearly not the best Star Wars movie, or even in the top 3, but there is so much this movie introduces that you just have to give it credit for."
  },
  {
    "rating": "5/5",
    "review": "Possibly the greatest movie of a time! Luke, Han and Leia started it all. This was THE movie."
  },
  {
    "rating": "5/5",
    "review": "Fico pensando na época , como esse filme deve ter sido bem aceito. Que filme gostoso de assistir !"
  },
  {
    "rating": "4/5",
    "review": "it was a very fun movie overall, this is the first one i watched, and its better that way(unless you watch rogue one first). idc about acting or anything its all good. the binary sunset is my favorite scene in any movie. John williams did so much to make this movie greater than it already was. a great movie but not as good as some of the others in the saga."
  },
  {
    "rating": "5/5",
    "review": "Changed cinema forever."
  },
  {
    "rating": "4/5",
    "review": "Starwars began with a timeless story. The surprisingly relatable human themes explored in A New Hope will never be forgotten."
  },
  {
    "rating": "4.5/5",
    "review": "Filme incrível! É um começo incrível para esta franquia e dá-nos tudo o que precisamos de saber sobre Star Wars."
  },
  {
    "rating": "4.5/5",
    "review": "I mean, it's just so good. This movie was sooooooo far ahead of its time. For a project that aims to be this complex in 1977, the movie looked so clean. I'd normally expect weird camera cuts and poor editing, but this movie didn't have that. The characters are so fun, and I love how it kicks off the original trilogy. Such a classic!"
  },
  {
    "rating": "5/5",
    "review": "I hate giving just one or five stars because I just like it or dislike it, but this is one of the few exceptions that 4.5 isn't good enough for."
  },
  {
    "rating": "5/5",
    "review": "Movie: The Movie (I'm basically saying this movie was the stepping stone for plot structure)"
  },
  {
    "rating": "5/5",
    "review": "the citizen kane of science fiction"
  },
  {
    "rating": "4.5/5",
    "review": "The true start of modern film-making. One of the first movies i ever watched and still great today. 9.1/10"
  },
  {
    "rating": "4.5/5",
    "review": "Looking past the clunky dialogue and acting, A New Hope is a groundbreaking masterpiece of genuinely fantastic special effects and characters so beloved they will live long in the hearts of STAR WARS fans for a long, long time in a galaxy far, far away."
  },
  {
    "rating": "4.5/5",
    "review": "This is an extremely well made movie, from a technical standpoint. Acting is suspect in parts but at over two hours the story still moves without an ounce of fat."
  },
  {
    "rating": "5/5",
    "review": "Amazing one of the best movies ever"
  },
  {
    "rating": "5/5",
    "review": "The one that started it all has to get 5 stars. This movie revolutionized special effects. It raised the bar to a degree the rest of Hollywood basically had to up their game which gave us some excellent entertainment for the next 30 years. I still have a dvd of the original cut and whilst it is a bit grainy, the explosive effects are still better than the modernised versions. Still holds its own even against new movies, a true classic."
  },
  {
    "rating": "5/5",
    "review": "One of the best science fiction films ever."
  },
  {
    "rating": "4/5",
    "review": "A Great Movie, visuals were ahead of its time, but this movie could have been better"
  },
  {
    "rating": "4.5/5",
    "review": "This movie is an all-time classic. It still holds up pretty well to this day too. A New Hope will always be a fun watch."
  },
  {
    "rating": "4.5/5",
    "review": "A New Hope introduces audiences to a galaxy far, far away, blending timeless mythology, groundbreaking special effects, and memorable characters to create an iconic and revolutionary sci-fi adventure."
  },
  {
    "rating": "3.5/5",
    "review": "Doesn't really hold up unlike the rest of the history"
  },
  {
    "rating": "3.5/5",
    "review": "Star Wars 4 da inizio ad una delle saghe più amate del cinema, con personaggi iconici ed un universo ampio e molto interessante"
  },
  {
    "rating": "4.5/5",
    "review": "For me it's the trash compactor."
  },
  {
    "rating": "5/5",
    "review": "The film starts of an intriguing series. It began with the struggle against the empire and suspenseful battle scenes. the evil empire destroyed Luke's family and he learned the mystic power that assisted the conventional rebels."
  },
  {
    "rating": "5/5",
    "review": "I once saw this when I was bored and now it's one of my favorite movies. It has held up very well for a movie made in 1977 and I love it."
  },
  {
    "rating": "5/5",
    "review": "The beginning of the best film. Franchise in history. 1-6 is all there is."
  },
  {
    "rating": "4.5/5",
    "review": "I think this film is great. It's stood the test of time well and it caters for almost all ages"
  },
  {
    "rating": "4.5/5",
    "review": "A brilliantly ambitious introduction to a legendary saga brought to life by George Lucas's imaginative construction of a space world, John Williams's crowd-pleasing score and stellar visuals akin to those in Kubrick's 2001: a space odyssey"
  },
  {
    "rating": "4.5/5",
    "review": "While the graphics don't hold up today, this groundbreaking film kickstarted the franchise and changed sci-fi forever."
  },
  {
    "rating": "4/5",
    "review": "It's a wonderfully crafted movie with spectacular music, lovable characters, and memorable scenes. My major complain is the very unrealistic gunfights which is also the problem in the other movies."
  },
  {
    "rating": "4.5/5",
    "review": "The most memorable star wars movie because of it being the first and top 3 star wars movies."
  },
  {
    "rating": "4.5/5",
    "review": "Do I really need to write anything?"
  },
  {
    "rating": "4.5/5",
    "review": "This film was awesome, the acting and the characters were just so amazing!"
  },
  {
    "rating": "5/5",
    "review": "This is one of the greatest and most influential movies of all time. While on the surface just another classic 70s sci-fi movie, it introduced an entire new mythology into our popular culture. If I could time travel, I would go back to 1977 and watch this movie in the theater (More realistically, I would like to see the unaltered original trilogy on Disney plus)."
  },
  {
    "rating": "4/5",
    "review": "Star Wars IV: A New Hope is an amazing classic movie. I watched this movie yesterday, so it is fresh in my mind. Although this is my least favorite original Star Wars movie, Star Wars IV is really interesting ( besides the end), and all movies are SUPPOSED to be interesting, but some are not. After 46 years this film still holds up. What a good movie. I give this original sci-fi movie a 78%."
  },
  {
    "rating": "5/5",
    "review": "The Best Movie Ever! I saw it in the movie theater as an 8 year old in 1977. It has always been a big part of my life. I have an emotional connection to the action figures I played with and still have to this day. Han Solo was always my favorite character, and I Love Stormtroopers."
  },
  {
    "rating": "5/5",
    "review": "What is there to say about this movie that hasn’t been said? This movie is a goddamn masterpiece"
  },
  {
    "rating": "4/5",
    "review": "This is pretty good I like this star wars film"
  },
  {
    "rating": "5/5",
    "review": "This movie is PERFECT! That's all I have to say cause it's perfect."
  },
  {
    "rating": "2/5",
    "review": "I didn't like A New Hope. It was really boring"
  },
  {
    "rating": "5/5",
    "review": "A classic and a good way to add another jedi to the franchise"
  },
  {
    "rating": "5/5",
    "review": "A classic. The movie that started it all. The imagination to create a whole universe, from it's characters to creatures, it's enviroments to planets was like nothing ever committed to celluloid at the time. Must see."
  },
  {
    "rating": "4/5",
    "review": "This movie was an incredible start to a now gargantuan franchise. It has stood the test of time well, and proves a stronger entry still than movies produced decades later with obscene budgets. This movie shines best in terms of world-building, for a movie about aliens this movie has a lot of very human protagonists. This is where the fun truly starts for Star Wars fans."
  },
  {
    "rating": "5/5",
    "review": "A film with significant influence. A film that has revolutionized filmmaking. A film that all people can enjoy. All of this wouldn't have been possible if it wasn't for Mr. Lucas' brilliant and artistic mind. Star Wars: Episode IV A New Hope is a fun roller-coaster ride from the beginning to end."
  },
  {
    "rating": "4/5",
    "review": "Features outdated Vishal effects and still a solid movie the cast is great the battle of yavin is the best part"
  },
  {
    "rating": "3.5/5",
    "review": "Some scenes are boring but movie is amazing"
  },
  {
    "rating": "5/5",
    "review": "A beloved classic from my childhood."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie even today. The CGI was one of the best back in the 70's and it still doesn't look half bad today. I highly recommend watching this movie if you've never watched it before."
  },
  {
    "rating": "5/5",
    "review": "Genial, maravillosa, fantástica, irrepetible... la amo."
  },
  {
    "rating": "4.5/5",
    "review": "Over 45 years old and is still the most successful science-fiction franchise in cinema history The project that put George Lucas on the map and catapulted a multi-billion dollar empire Made $1.5 billion and $775 million globally even when no one expected it to blow up in amazing ways Taking inspiration from the old black and white adventure serials it takes place in a galaxy far far away filled with many planets filled with amazing alien creatures, otherworldly technology, advanced weapons, and space opera politics and drama A ruling dictatorship called the Empire rules all freethinking worlds led by Darth Vader and the Jedi Knights who protected the stars have been eliminated An opposing group called the Rebel Alliance has formed to hopefully restore peace and stability; their leader Princess Leia has managed to sneak secret layout plans of the Empire's deadliest weapon the Death Star which can destroy whole planets Her two droids R2-D2 and C-3PO have it and land on the desert planet Tattooine, home of farmer Luke Skywalker who dreams of leaving to fight the Empire He also runs into exiled, disgraced Jedi knight Obi-Wan Kenobi Luke later leaves home with the droids and Obi-Wan with smuggler Han Solo and partner Chewbacca From then on they all rescue Leia from the Empire's clutches and form an attack to take down their biggest weapon The acting can be hokey and some of these line readings are awkward but it was a throwback to those old action-adventure serials even Flash Gordon Ultimately this made Mark Hamill, Carrie Fisher, and Harrison Ford household names It's amazing that George Lucas managed to get the movie made despite the many issues plaguing production from bad weather conditions to props failing to running low on funds Glad to see where the fascination of this franchise started setting the bar for original science-fiction and summer blockbusters to come No idea it would make so much money and spawn tons of merchandise from comics, toys, video games, novels, clothing, cosplaying, and cementing itself in the pop culture forever It's even analyzed in film classes The themes present in the Star Wars movies have long-lasting relevance too From the political disputes in the galaxy that resemble the state of the U.S. today to the importance of hope and courage and the age-old battle of good and evil Who knew a series about laser swords, aliens, robots, flying ships, and conflicting political ideologies could become so big?"
  },
  {
    "rating": "5/5",
    "review": "❣️💝💌💌💖💌💌💖💗💌💗💝💞💞💗💝💌💌💓💝💌💝💌💝💞💌💗💝💞💝💗💌💌💝💗💗💝💌💗💝💌💝💗💌💞💌💝💗💝💗💞💌💝💗💌💞💌💞💗💝💗💝💞💌💌💗💝💌💝💌💟💗💝💟💝💗💟💝💌💗💝💌💝💟💝💟💝💗💟💝💟💝💗💝💟💟💝💗💞💌💝💗💌💌💝💗💌💌💝💌💝💗💌💝💗💝💓💌💌💝💌💝💗💟💝💟💝💗💝💟💗💟💝💟💗💟💝💗💟💗💝💟💝💗💝💟💝💗💟💟💝💗💗💟💝💟💗💝💗💟💗💝💟💝💗💟💟❣️💖💝💗"
  },
  {
    "rating": "5/5",
    "review": "Whan i was 4 years old my dad took me to see this in the movies back in 1977 and this is in my top 10 movies of all time and all of the star wars movie are really good and my older son likes the star wars movies but my younger son does not like them."
  },
  {
    "rating": "5/5",
    "review": "Change the cinema forever"
  },
  {
    "rating": "5/5",
    "review": "This is an essential watch. It starts the whole series and is a critical part of modern day pop culture. Definitely the first movies made in the 70s and 80s are worth watching. Don't bother with any others."
  },
  {
    "rating": "5/5",
    "review": "calssic movie perfect from begining to end. started the greatest movie franchise ever(well unstill disney bought it) My the force be with you all."
  },
  {
    "rating": "5/5",
    "review": "A very good story of farmhands, space cowboys and princesses"
  },
  {
    "rating": "5/5",
    "review": "Hyvä alku trilogialle, suosittelen"
  },
  {
    "rating": "5/5",
    "review": "The greatest 02 hours: and 01 minute ever!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "a great start of an amazing franchise"
  },
  {
    "rating": "5/5",
    "review": "Brilliant movie with awesome plot, great action, great visuals, great ideas that changed films nowadays"
  },
  {
    "rating": "5/5",
    "review": "what started it all, a true masterpiece"
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films ever made!"
  },
  {
    "rating": "4.5/5",
    "review": "The first step in the most enduring and highest grossing franchise in movie history, it established all the modern sci-fi cinematography canons we enjoy today, still resulting unsurpassed. The depiction of an ‘used future' (developed again shortly thereafter by Ridley Scott's \"Alien\"), the outstanding artisan model and visual techniques, the original world in which the story has been immersed with its distinctive costumes and its balance between fable and comic book, are the main ingredients of a pop culture phenomenon that has origin in no less than genius intuitions. The movie's major concept tied to a stark contrast of ‘good against evil' and the quite predictable consequences of most of the characters' choices and plot turns may be simplistic, but also look universal, while the story is dotted with narrative shortcuts that over time have been forgiven on account of the status achieved by the movie. This first episode is also the least academic of the saga and has a depth and a sense of adventure that the following instalments haven't maintained. The Luke's character is at his most lively (that's before the acquired Jedi-awareness), Han Solo is at his most cynical and impertinent (the romance with Leia goes full throttle not before the second release), Alec Guinness as Obi-Wan Kenobi assures a powerful presence and Darth Vader is employed in a more subtle, less extensive and by that more threatening way, avoiding that mannered, so much bigger than life, representation of him displayed in the next episodes. The film editing also results more engaging in this first movie, specially the aerial battles enjoy more of that rock'n'roll pace that will influence later releases such as \"Top Gun\", while in the subsequent episodes of the saga the battles look much more polished."
  },
  {
    "rating": "4/5",
    "review": "The beginning of modern cinema arrives as Star Wars creates instantly likable characters and an engaging world in the most effective and simple way possible, with masterful voice work from James Earl Jones standing above the rest."
  },
  {
    "rating": "4.5/5",
    "review": "Star Wars is one of the most influential movies of all time and it's an all around fun movie from beginning to end. Yes, some aspects of this movie don't hold up to todays standards but it does a fairly good job overall. George Lucas was able to crest a world that was able to capture the fascination of many generations. The world-building is great and you just want to keep learning more about this world. The Jedi and lightsabers are so intriguing. I couldn't imagine the excitement of seeing this movie for the first in 1977. There are just so many iconic moments littered throughout this movie. It's actually incredible to see the stories they were able to make from this movie. One of the best stories ever told and probably the most influential movie of all time."
  },
  {
    "rating": "3/5",
    "review": "#4 best star wars movie I watched(I only watched episodes 1,2,4,5 and 6)"
  },
  {
    "rating": "4/5",
    "review": "The one that started it all. Solid film from start to finish. Great characters and an engaging universe."
  },
  {
    "rating": "5/5",
    "review": "Probably my favourite Star Wars movie, a masterpiece."
  },
  {
    "rating": "5/5",
    "review": "Excelente película, no solo es buena por como es como película, sino por todo lo que hizo por el mundo del cine. Teniendo en cuenta que en la década de los 70 nadie apostaba por la ciencia ficción o nadie lo tocaba porque era una ruina, aparece George Lucas y tras arriesgarse le dio como resultado una obra maestra. Ya hablando de la película, esta sienta las bases de un universo demasiado grande y contándonos una historia que en un futuro iba a ser extendida contando muchas cosas que ocurrieron antes de esta. Nos presenta a los personajes que se volverían las principales caras de la saga como por ejemplo Luke, Leia, Han solo, R2-D2, C3-PO, Chewbacca, Ben Kenobi, etc., y por el lado de los villanos nos presenta al que para mi es el mejor villano de todo el cine, Darth Vader, quien desde el primer momento en pantalla genera miedo y te das cuenta del gran peso del personaje en la cinta. Algo que no recordaba mucho es el poder que tiene Tarkin, siendo hasta superior a Vader y teniéndolo a el como su ayudante/secuaz. Las actuaciones creo que están muy bien, todos encajan perfectamente en los papeles y tiene actores de renombre como Mark Hamill, Harrison Ford, Carrie Fisher, Alec Guinness, David Prowse, etc. Algo que destacar es la banda sonora de John Williams, quien hizo una de las mejores bandas sonoras de la historia del cine con una gran cantidad de temas excelentes. En cuanto a los efectos prácticos, creo que para la época estaban bastante bien logrados, sin embargo algo que no me gusto fueron las cosas agregadas por CGI en las ediciones que se hicieron décadas después del estreno, siento que no quedan para nada en la cinta. El ritmo de la película es algo que puede llegar a cansar a algunas personas, ya que es una de las películas de Star Wars mas lentas, con muy poca acción y con bastante dialogo y un ritmo lento. La poca acción presente en la película me gusto, siento que esta bastante bien para la época y mucho mas no se podía hacer, ya que por ejemplo el duelo entre Obi Wan y Darth Vader es bastante lento y tosco comparado a otros duelos de la saga pero creo que no esta nada mal. Hay que decir que la película tiene errores y algunas conveniencias pero a mi parecer no son errores tan negativos como para bajar su puntuación final. En conclusión, una de las películas que cambiaron el mundo del cine por todo lo que significo y una cinta con una historia, personajes, banda sonora, efectos, etc. brillantes en su mayoría, siendo el inicio de una de mis sagas favoritas y la que sentó las bases para todo lo que se venia para esta maravillosa y enorme franquicia. Muy recomendada."
  },
  {
    "rating": "5/5",
    "review": "STAR WARS: EPISODE IV -- A NEW HOPE is the amazing beginning of the classic franchise itself Star Wars, it's a lot of fun with some of the most likable characters possible!"
  },
  {
    "rating": "4/5",
    "review": "He literally did it in 1977."
  },
  {
    "rating": "5/5",
    "review": "The one that started it all. STAR WARS: A NEW HOPE paved the way for one of the greatest movie franchises in history, and it continues to be a legendary classic to this day."
  },
  {
    "rating": "2.5/5",
    "review": "I appreciate this movie for kickstarting the Star Wars Saga and Mythos... Beyond that, I think the acting was subpar and the writing was rough (to say the least). I think the story was poorly thought out with very little thought for future projects. It was entertaining enough to watch, but lets not confuse nostalgia with quality."
  },
  {
    "rating": "4/5",
    "review": "The movie that started it all. Though it didn't age the best and the story is slow, it still begins a beloved franchise in great style and that in itself deserves a watch. Rating: 79%"
  },
  {
    "rating": "5/5",
    "review": "The beginning of Star Wars Saga. Great film, amazing special effects and script."
  },
  {
    "rating": "4/5",
    "review": "I would have loved to see this for the first time during its theatrical release. It must have felt like magic. So many characters are established here that will go on to define a 6-film long story."
  },
  {
    "rating": "5/5",
    "review": "Without a doubt this is one of the greatest Star Wars movies ever made mostly because it gives birth to Star Wars and starts off the Star Wars story. So I watched all the SW movies in 2022 and for the movie being made over 30 years ago I was amazed by everything. Action, although this movie is from over 30 years ago it was amazing I really love it obviously it wasn't perfect but lets remember it was made over 30 years ago and they tried really hard to make it awesome and they did. Acting, the acting is perfect without question the acting is perfect Mark Hamill, Harrison Ford, Carrie Fisher, Alec Guinness, they all made an perfect job. CGI, although the movie was made in the 70s CGI was barely a thing because there was no CGI back in the 60s but SW nailed it with the CGI and I don't know how they made it so perfect for the 70s. Villain, without a doubt Vader is one of the greatest villain of all time a lot of villains across all franchises are great but Vader is in top 3 in my opinion. Writing is perfect the writers did a very perfect job and they should be very proud of their work for this movie. Story is perfect because like I said before this movie is perfect because it starts off the Star Wars story. Casting is beyond perfect no explanation needed I can not imagine anyone else playing Luke Skywalker other than Mark Hamill. Characters are 10/10 all of them. Adventure is perfect because it just is you watch the movie you know what I'm talking about. Mystery I think that the mystery is great because I started watching the original trilogy with no idea about what I was gonna watch but it was mysterious and it always let me wonder what happened next. Ending, the ending was amazing I love the final fight so amazing how they did it definitely has to be one of the great SW endings of all time. However one thing I didn't like is the Obi-Wan died I watch SW in order and I grew to love Obi-Wan and all the other Jedi but Obi-Wan is my most favorite character in SW history and it really pained me to see him die."
  },
  {
    "rating": "4.5/5",
    "review": "The best movie saga, and its beginning is excellent."
  },
  {
    "rating": "5/5",
    "review": "Creative original, effects were amazing for the time. Story is a classic."
  },
  {
    "rating": "4.5/5",
    "review": "The movie that started it all, when Star Wars was actually a big thing."
  },
  {
    "rating": "5/5",
    "review": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD good 🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻"
  },
  {
    "rating": "4.5/5",
    "review": "This movie was a revolutionary film that changed cinema at MINIMUM. The effect on the world was so gigantic, that it still is a thriving series today! This film has some pretty ok graphics, considering the time, and was very enjoyable. It has a compelling plot, lots of great action, and amazing character building, and the scale of the whole thing seemed unreal. And this is only the first movie. This movie keeps you wondering what will happen next and what things will be able to unfold over time. Easily one of the best Star Wars films of all time. Great work, George Lucas."
  },
  {
    "rating": "4/5",
    "review": "What can I say other then a classic. It starts/continues the universe really well. Depending on the order you watch the movies. The characters are all perfect. Old obi won steals the show han and Leia and Luke are just written and acted perfectly."
  },
  {
    "rating": "5/5",
    "review": "What could I possibly add that hasn't already been said about this film. George Lucas created something truly special with this one. Drawing from various sources of inspiration, he came up with one of the most important films in history. It's inspired filmmakers and regular people alike to see more than what was deemed possible, from their larger than life world, their sense of excitement and adventure, the memorable characters and the camaraderie they shared, the valuable life lessons learned and the desire to escape to a galaxy far, far away. Thank you George Lucas, I really mean that."
  },
  {
    "rating": "5/5",
    "review": "one of the best movies ever. I love Luke's character in this film and how they started his hero's journey. I love Han's arc of going from being a loner to being a hero, and I like Leia's character in this film. George used the stereotypical structure of the hero's journey to tell a really compelling story, with great world-building even only in this movie and the narrative is tight. Vader is a super cool villain and I like how Luke and him don't even fight, making it feel like this movie having a sequel feel like it makes perfect sense."
  },
  {
    "rating": "5/5",
    "review": "An instant classic that will be remembered for centuries. This movie changed the way we watch film and will always be remembered as the introduction to one of the greatest franchises of all time."
  },
  {
    "rating": "5/5",
    "review": "Star Wars truly encompasses the meaning of an epic space opera; you will find sci-fi, love, loyalty, power, innocence, heroism, friendship and so much more in this movie. From presenting one of the greatest villains in the history of art, to redefining how relatable space travel and technology can be, Star Wars introduced concepts, ideas and techniques that have influenced countless of following productions. Science fiction and fantasy wouldn't be as it is nowadays without this phenomenon!"
  },
  {
    "rating": "5/5",
    "review": "An epic classic. So nostalgic and it's how it all started"
  },
  {
    "rating": "5/5",
    "review": "Remains a classic undimmed after almost half a century. (Despecialised version)"
  },
  {
    "rating": "5/5",
    "review": "The movie that started it all. A new hope has everything. Great story, humor and great acting."
  },
  {
    "rating": "5/5",
    "review": "It's a classic and everyone has seen it. I saw this first at two or three."
  },
  {
    "rating": "5/5",
    "review": "Excellent introduction to the Star Wars universe"
  },
  {
    "rating": "5/5",
    "review": "Star Wars A New Hope is a truly amazing film. From the opening scene that draws you in with the amazing soundtrack and great special effects. Right after the credits roll we are immediately introduced to a few of the main characters Darth Vader (Aniken Skywalker), Princes leia, Luke Skywalker, and R2D2. Although one could say this is only a good versus evil story Star Wars is set apart with the element of sci-fi set in space, even when compared to modern day movies this movie's graphics and editing can hold its own. Even watching this movie 40+ years later the only thing that you can tell is different is the camera quality… and hair styles. This movie produced some of the most memorable scenes in movie history but the one I think that is the most memorable is one of the first scenes of Darth Vader coming onto the rebel ship to kidnap the princes and to get the location of the main rebel base. Now we cannot go any further in this piece without talking about this truly historic soundtrack. There are not many words that can really comprehend how amazing, uplifting, and as tense as this is. Almost all of the soundtrack used in the original Star Wars is being conducted in orchestras around the world. The next great thing about this movie is the setting, from desert climates to lush green forests it truly looked like all of the scenes were shot on different planets. Yet another thing I want to highlight is the fact that this sci fi film does not just have humins in it, it has many different species of aliens with their own unique languages. Another great thing about the effects are the spaceships that everyone is zooming around in. For a 70s era movie what do you expect to see when you think of a spaceship well you are probably thinking something of low quality and not good looking, well that is simply not true the spaceships are very vivid and look very possibly real from a theater perspective. My point being like earlier this is further evidence that you should not shy away from the movie just because it is from the 1970s. -Ben Kerstein"
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films ever made. A movie that took over the imaginations of a generation. I was 11 when this came out and I fell in love with it and the original trilogy as a whole. Well worth the watch."
  },
  {
    "rating": "5/5",
    "review": "Jeff Barnes 1/12/23 Star Wars a New Hope Review Star Wars a New Hope is about a teenager named Luke Skywalker who goes on a journey to save the galaxy from the shattering space station know as the death star. Luke also goes on a journey to rescue a princess name Leia from the evil Darth Vader. Star Wars a New Hope changed the way films were made forever. It revived the genre of science fiction. Star Trek had defined it or turn it into a phenomenon. The film also has philosophy, religion, inquisitiveness, and colorful characters who are relatable. Star Wars a New Hope made films and science fiction more fascinating with its special effects such as with hovering vehicles, plenty of wars involving lasers hence the title of the film being Star Wars and having many iconic elements such as a weapon known as the lightsaber. Star Wars a New Hope makes us think. It teaches us that we can achieve anything or help ourselves if we have enough faith or as the wizard, Obi Wan Kenobi, teaches the Force. The Force is a special power or privilege that only certain people known as Jedi possess. Star Wars a New Hope has colorful characters that are relatable, particularly Luke Skywalker. In the film Luke wants to go away to the academy which means a lot to him. It's like going away to college and being independent. Obi Wan Kenobi is relatable because he reminds us of having more wisdom as we get older. Star Wars a New Hope is a must see with its many wonderful elements such as: intriguing characters, special effects, philosophy, and many more."
  },
  {
    "rating": "5/5",
    "review": "one of the best star wars movie ever and is you must see"
  },
  {
    "rating": "5/5",
    "review": "The original and the best…"
  },
  {
    "rating": "4.5/5",
    "review": "It's iconic for a reason. It's a bit cliche and dated now but it's still a great watch."
  },
  {
    "rating": "5/5",
    "review": "this movie created a univers"
  },
  {
    "rating": "4.5/5",
    "review": "Such an amazing film. Amazing cast and great story"
  },
  {
    "rating": "4/5",
    "review": "The movie that started it all was an instant success and it shows by everything that came after it."
  },
  {
    "rating": "5/5",
    "review": "Best Movie Of All Time."
  },
  {
    "rating": "5/5",
    "review": "Inspired a generation of kids and film makers alike. A timeless classic."
  },
  {
    "rating": "5/5",
    "review": "A what a classic! Became such a fan I would later Subject myself to the complete crap they put out today. You suck disney"
  },
  {
    "rating": "5/5",
    "review": "This is a movie that revolutionized cinema in so many ways. This is my 5th favorite film of all time and one of the best blockbusters that ever were. Lucas had so many problems shooting this movie but look at what it turned into, an absolute spectacle that dazzled millions! The 40 second binary sunset scene alone is an example of pure art and beauty put on screen, along with so many other parts. This is also such a fun movie with fun characters and the Universe this created all the way back in the 70s is still being expanded on to this day. I've loved it ever since I was in 3rd grade and will continue to until the very end of my life. What else can I say that has not been said about Star Wars??"
  },
  {
    "rating": "4/5",
    "review": "Such a classic. Beautiful way to start one of the biggest most in comic franchises."
  },
  {
    "rating": "4.5/5",
    "review": "The Movie that started it all endlessly rewatchable 9/10"
  },
  {
    "rating": "4.5/5",
    "review": "An amazing starter film to a good franchise."
  },
  {
    "rating": "5/5",
    "review": "An endearing classic and one that remains one of, if not the greatest, science fiction film of all time! Combining fantasy with science fiction and the adventure that comes with them, Star Wars is a part of film history now and forever more. With a cast of likable characters, danger and a battle for the fate of the galaxy, \"Star Wars: Episode IV- A New Hope\" (1977) set the standard for the series as well as the big budget films of today. Watching in amazing High Definition sweetens the nostalgia I have for the films, altering aside, and really takes me back to my childhood. Any film that you adore as both a child and adult and remains an amazing feat of film really shows its legacy! A masterpiece of film and one that was influenced by several different films including Akira Kurosawa's \"The Hidden Fortress\" (1958) and \"Yojimbo\" (1961), John Ford's \"The Searchers\" (1956) and the original Flash Gordon serials. The film currently stands at #13 on AFI's Top 100"
  },
  {
    "rating": "4.5/5",
    "review": "I'm a big fan of this film. It has some amazing actors such as Mark Hamill and Carrie Fisher, and I love the plot and script of the film. The music for the movie was spectacular, and it makes it even better when knowing that the music they use for the Star Wars movies made today was first made in 1977. I don't give it a 5 star though because even though it is a great movie, there are some parts of the movie that don't connect with some of the other movies and it makes it confusing sometimes."
  },
  {
    "rating": "5/5",
    "review": "The movie that started it all! The Death Star Trench Run will live on as one of the greatest action sequences of all time!"
  },
  {
    "rating": "4/5",
    "review": "Its a classic, when you think of starwars youll usually think of this or rots. Even though it is the least action packed movie in the saga, it has some of the best action moments"
  },
  {
    "rating": "4.5/5",
    "review": "Star Wars: Episode IV- A New Hope began this legendary Sci-fi franchise in a spectacular way, by blending in long-lasting effects with good setting and audio, creating a flawless movie inhabited by iconic characters, terrific storyline and some of the most memorable moments and locations to ever brace the big screen."
  },
  {
    "rating": "4/5",
    "review": "exciting film with decent CGI for the time and a great cast to follow,"
  },
  {
    "rating": "5/5",
    "review": "My personal favorite star wars movie top 5 of all time"
  },
  {
    "rating": "4.5/5",
    "review": "The beginning of a life. Thank you George."
  },
  {
    "rating": "4.5/5",
    "review": "Possibly the greatest Star Wars film ever produced, if not the greatest film ever. Anyone who enjoys science fiction should have seen this fantastic film (or any who enjoy cinema). Harrison Ford and Alec Guinness in particular stand out among the excellent cast. This film is a masterpiece that never gets old. Among George Lucas's best pieces (followed close by the Raider of The Lost Ark). The Star Wars Universe is expansive, magnificent, and full of options, therefore this film truly marks the start of the greatest film franchise of all time. Even if several of the scenes felt avant-garde at the time they were released in theatres, the public nonetheless praised them highly."
  },
  {
    "rating": "5/5",
    "review": "I couldn't have asked for anything more. Star Wars: A New Hope had it all. If I had to sum it up in one word, superlative would be my answer. I saw the film for the first time three months ago and loved it, and since then I have watched all the Star Wars movies. I was disappointed with the prequels (Attack of the Clones was my least favourite), but this, Return of the Jedi and Empire Strikes Back were perfection. I have to say that the film looks absolutely amazing even after thirty plus years, with highly imaginative sets and dazzling special effects. And the action sequences were superbly choreographed and brisk, the Death Star climax was a knockout. The music by John Williams is absolutely outstanding, by far one of his more exciting and rousing scores. The story is fast-paced, intelligent and has an essence of sophistication, and the screenplay is sharp and decisive. And the performances were flawless. In the prequels I had problems relating to some of the performers, namely Hayden Christensen as Anakin. Here, all the actors played their parts with superlative skill. Alec Guiness, one fine actor and will be sorely missed was a standout, likewise with Peter Cushing and Harrison Ford(hilarious here). Carrie Fisher was a fine Princess Leia, spunky, beautiful and sexy, and Mark Hamill was a completely likable Luke. And the villain Darth Vader, without doubt one of the best and in-depth villains in cinematic history, and James Earl Jones's deep booming voice was perfect for the character. All in all, a definite sci-fi classic, that blew me away. 10/10 Bethany Cox"
  },
  {
    "rating": "5/5",
    "review": "Um dos melhores filmes de ficção científica de todos os tempos."
  },
  {
    "rating": "5/5",
    "review": "Best of Movies/TV Series Collection"
  },
  {
    "rating": "4.5/5",
    "review": "Masterpiece yet not perfect."
  },
  {
    "rating": "5/5",
    "review": "Amazing space fantasy favorite!"
  },
  {
    "rating": "5/5",
    "review": "SciFi fantasy adventure at it's very best. Pure class."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies of all time, and years later, I find that had it been left to lucas, it would have been a story about a dirt farmer. As they say, a movie lives or dies on the cutting room floor. His wife really polished this into the epic space adventure we all enjoyed (and the prequels would have been so much better had she edited them!!)."
  },
  {
    "rating": "5/5",
    "review": "The 2nd best Star Wars in my book. One of the best stories of all time."
  },
  {
    "rating": "5/5",
    "review": "This movie uses the classic hero's journey and yet still feels unique even by today Standards the works building is outmatched and is the main reason people fell in love with this franchise and the characters are well written and well acted. If you are interested in watching StarWars I recommend you start here not just because it was the first released but because it's Universaly beloved and one of the best written StarWars products out there"
  },
  {
    "rating": "5/5",
    "review": "The movie that started it all. Star Wars. If it weren't for this movie, then we wouldn't have Star Wars, the greatest thing ever created. This movie in particular shows how creative George Lucas can be. Fighter jets in space, flying through a massive trench lined with massive guns to fire a missile into a small exhaust port and destroy a moon-sized space station capable of destroying an entire planet. Nothing of that scale had ever been seen before 1977. It may not have the best duels in Star Wars, or the best story in Star Wars, but hands down, the Death Star Trench Run has to be the greatest space battle of all time. On the other hand, Obi-Wan's sacrifice didn't seem as meaningful until 1999 when we saw Obi-Wan again in the prequel trilogy. And this movie is only made better by Rogue One (2016)."
  },
  {
    "rating": "5/5",
    "review": "As a young boy back in the day, I really did not know what to expect from this movie and quite frankly the world did not know anything of what was to come. It was the first and maybe the only movie that left the audience spellbound from start to finish and then for decades after. I will not say too much because others have already said it, however, for you youngsters out there do try the first movie 1978 as it really was unforgettable."
  },
  {
    "rating": "5/5",
    "review": "A must see movie one of the best of all time changed the history 10/10"
  },
  {
    "rating": "5/5",
    "review": "My Favorite Movie of All Time. Loveable characters, incredible action and special effects that don't look dated at all, amazing score, one amazing adventure you'll never forget! The ending is my favorite ending to a movie all time. Incredible White Knuckle Action and Phenomenal Acting. I credit this movie with making me fall in love with movies and as a 7 Year old kid blowing my imagination away and all these years later whenever I watch this I truly feel like I'm a little kid again who is being taken away to a galaxy far far away."
  },
  {
    "rating": "5/5",
    "review": "Good story, extraordinary storytelling, great characters and amazing world building as well as music worthy of playing at any concert."
  },
  {
    "rating": "2/5",
    "review": "Beginning was slow spending too much time with the droids. Only picked up until much later. Acting was below average most scenes. The lightsaber battle between Obi-Wan and Vader had me laughing out loud, and not in a good way. Sound effects and music were great, however I felt the music didn't fit the tone of certain scenes playing. Han is the best part of the movie."
  },
  {
    "rating": "0.5/5",
    "review": "A truly TERRIBLE film. The script - drivel; the plot - utter nonsense; the acting - pathetic; the whole thing was boring and awful."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest sci-fi movies of all time. If you haven't watched it yet, please do!"
  },
  {
    "rating": "4.5/5",
    "review": "Watching this again right after all the prequel movie's actually made me appreciate some of those inputs a great deal more, in light of specific elements of backstory made reference to in this movie. Not a whole lot of retconning going on actually, in the newer movies, in reflection upon re-watching this one. Following a much darker period in the prequels, this does seem a little on the light side, though there are moments of comedy in the prequel elements. It does actually hold up remarkably well, even all the visual effects. I watched the somewhat post-prequel updated or specialized version, rather than the original or de specialized edition, and aside from a couple of slightly shoddy new effects, and old ones, it's remarkably good. I do wish that the prequel's had been a little lighter, especially in the recent Obi Wan series, with Obi Wan's character, given he's not a particularly serious individual in this movie - rather relaxed in my estimation. The only real misgiving I have about this movie comes from a particular light saber battle, which I do wonder if the prequels lent themselves towards undermining, inadvertently, given they're better equipped to pull those related visuals off. Anyway, this is fun, well written, well acted, looks great (despite being quite an old sci-fi movie), and in my estimation would potentially even hold up with consideration to younger audiences that may inevitably drift into this in the wake of the prequels, other series pieces, and more recent franchise sequels."
  },
  {
    "rating": "5/5",
    "review": "must watch, and i would recomend as one of the first movies to watch, so it'll seem like it holds."
  },
  {
    "rating": "4.5/5",
    "review": "My rating for the film is a 9.2/10"
  },
  {
    "rating": "4.5/5",
    "review": "Good old-fashioned Star Wars. I miss movies like these, now a days we have sore excuses for movies called the sequel trilogy. Told an original story that was unique and interesting. Had great characters and action. Special effects were groundbreaking. Love this movie."
  },
  {
    "rating": "5/5",
    "review": "Easily one of the greatest movies of all time. If only it could have remained unnumbered, and untampered, for its own merits tower over every other entry to the star wars saga. With the exception of The Empire Strikes Back of course."
  },
  {
    "rating": "5/5",
    "review": "An instant classic that inspired millions. And the start of one of the most iconic franchises in the world."
  },
  {
    "rating": "4.5/5",
    "review": "Ahhh, OG Star Wars, what's not to love! Nothin much to say here. Good performances, good visuals for the time, and just good ol galactic fun!"
  },
  {
    "rating": "5/5",
    "review": "I watch this movie everyday. One of my all time favorites."
  },
  {
    "rating": "5/5",
    "review": "Top 3 Star Wars movie"
  },
  {
    "rating": "5/5",
    "review": "If you like movies and movie history you will love this sci-fi adventure. George Lucas did not just make a really good movie but made something which changed cinema. Superhero movies and franchises would not exist if this film was not made. This is one of the greatest movies ever made."
  },
  {
    "rating": "5/5",
    "review": "Third best Star Wars movie in my opinion and one of the best movies of all time. Story is very entertaining and the characters are good. Also the show is non stop fun from the begging to the end."
  },
  {
    "rating": "5/5",
    "review": "This movie was revolutionary for its time. The practical effect are awesome. All of the performances are legendary. The story is classic. The journey and concepts are fun and creative. If you haven't seen A New Hope you are missing out on a masterpiece of a movie."
  },
  {
    "rating": "4.5/5",
    "review": "Now, After seeing episodes 1-3 I was so relieved from the reputation these movies got so I was ready for something good, but what I got was even better. I love this movie so much and can't believe it took me this many years to finally experience it."
  },
  {
    "rating": "5/5",
    "review": "My favorite movie of all time. I saw this when I was 10 years old in the movie theaters and loved it. I think that the special effects are great, a good simple story. Of course this started the whole Star Wars franchise."
  },
  {
    "rating": "5/5",
    "review": "It's classic Star Wars, what more can I say. Just a nice simple story set in a galaxy far far away"
  },
  {
    "rating": "4.5/5",
    "review": "Yeah, this is better than CATS."
  },
  {
    "rating": "3.5/5",
    "review": "Some parts were boring but overall good movie"
  },
  {
    "rating": "4/5",
    "review": "Great, but age shows… Final Rating- 8.12/10"
  },
  {
    "rating": "5/5",
    "review": "Here's my Review Rated: PG Release Date: A New Hope: May 25, 1977 The Empire Strikes Back: May 21 1980 Return of the Jedi: May 25 1983 Storyline: A New Hope: After Princess Leia, the leader of the Rebel Alliance, is held hostage by (main villain) Darth Vader, (main heroes) Luke and Han Solo must free her and destroy the powerful weapon created by the Galactic Empire. The Empire Strikes Back: (main villain) Darth Vader is adamant about turning (main hero) Luke Skywalker to the dark side. Master Yoda trains Luke to become a Jedi Knight while his friends try to fend off the Imperial fleet. Return of the Jedi: (main hero) Luke Skywalker attempts to bring (main villain) Darth Vader back to the light side of the Force. At the same time, the rebels hatch a plan to destroy the second Death Star. -The directors George Lucas, Irvin Kershiner and Richard McQuarmand did an amazing job. George also directs \"American Graffiti\" and \"THX-1138\". Irvin also directs \"Robocop 2\". They're awesome The actors Mark Hamill (plays as Luke Skywalker), Harrison Ford (as Han Solo), Carrie Fisher (as Princess Leia) and James Earl Jones (voiced as Darth Vader) are so awesome in the trilogy. They did fantastic It's a Live-Action one It's Action packed, Science-Fiction and Fantasy Movie My favourite Scene is the Space Battle bits and Lightsaber fights I've watched it on DVD, cinemas and Disney+ I saw it with my family I love this trilogy because these are really awesome, I started to watch this trilogy when I was 10 years old after it came out on DVD. My favourite characters are Darth Vader, Luke Skywalker, Princess Leia, Han Solo, Chewbacca, C-3PO and R2D2 I love the Lightsaber fight scenes I love the Space Battle scenes because it's Heart-Pounding I love the Characters because they're awesome The costumes are so cool The composer John Williams is really great The sound effects are really cool The special effects are really awesome A New Hope: 10/10 The Empire Strikes Back: 10/10 Return of the Jedi: 10/10 Total: 10/10"
  },
  {
    "rating": "3.5/5",
    "review": "The movie hasn't aged perfectly well but it still is really something special."
  },
  {
    "rating": "4.5/5",
    "review": "starts slow but works out eventually"
  },
  {
    "rating": "5/5",
    "review": "This still holds up after 45 years. Enough said"
  },
  {
    "rating": "4/5",
    "review": "Did not expect a movie from the 70's to have better CGI than a lot of films today. Love the humor. it's definitely more enjoyable now that I've matured"
  },
  {
    "rating": "5/5",
    "review": "The original is still the best."
  },
  {
    "rating": "5/5",
    "review": "Star Wars (1977) is a perfect movie not in head, but in heart."
  },
  {
    "rating": "5/5",
    "review": "Just splendid! Fantastically written and the actors are just so good."
  },
  {
    "rating": "5/5",
    "review": "Much better than any of the others. If one would only stop to take it in, and truly appreciate it for what it really is."
  },
  {
    "rating": "5/5",
    "review": "The ultimate classic. Featuring a cool and creative world. Very cool and creative characters and darth Vader for a fact is the best villain in cinema history. However the new cgi effects in the city is very distracting and pointless.But this movie still deserves an A+"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie, the visuals are taken to the next level 45 years ago. Today, this movie still ages well from the 1970s. Great characters and the plot was kind of easy to interpret. Definitely a must watch, if it's your first time watching the Star Wars movies, I strongly recommend watching \"A New Hope\" first before the prequels."
  },
  {
    "rating": "5/5",
    "review": "A movie that created an era, taking a look at it now it's still a fresh take on a space odyssey would recommend everyone watch this masterpiece"
  },
  {
    "rating": "1.5/5",
    "review": "In this movie you want to explore anything other than the things shown on-screen. Great world, boring story"
  },
  {
    "rating": "5/5",
    "review": "My all time favorite movie"
  },
  {
    "rating": "5/5",
    "review": "When this movie came out I probably crapped my pants. I wasn't quite two yet..."
  },
  {
    "rating": "5/5",
    "review": "Even with its flaws, this is still unquestionably one of the finest sci-fi movies ever made. An entree into what has become an immense canon full of beloved characters and places, A New Hope started it all and should be rightly respected as the starting point for everything that Star Wars has come to mean and be. A great movie with stunning visuals, awesome practical effects and just enough lore to sink its hooks into you."
  },
  {
    "rating": "5/5",
    "review": "\"Star Wars\" or as it is now more commonly known \"Star Wars: A New Hope\" follows Luke Skywalker as he finds himself joining forces with Obi-Wan Kenobi to save Princess Leia from the empire. This is a great movie, I remember watching this a lot as a kid and being absolutely in love with how creative and fun the world of Star Wars is. George Lucas is a creative genius, every aspect of this film is well done. Han Solo is one of my favourite Star Wars characters, Harrison Ford does an amazing job of playing a jerk. That's what Han Solo starts as a jerk, but you love him none the less because of how funny and Bada** he is. Mark Hamill is really good as Luke Skywalker, one scene I always think of when I think of Luke is the scene where he is gazing at the two suns of Tatooine. The mix of cinematography and John Williams score is incredible. John Williams score is one of the most iconic ever made. To this day if you play one of his songs it will be identified as a Star Wars theme. Finally Darth Vader. Darth Vader is one of the greatest villains in cinematic history. Right from the beginning when he walks into that hallway you know how much of a menace this guy is. This film is phenomenal and I love it every time I see it. With loads of fun characters and a immersive world Star Wars is a blast. 10/10"
  },
  {
    "rating": "5/5",
    "review": "Funny and original!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Start watch Star Wars from this masterpiece!"
  },
  {
    "rating": "5/5",
    "review": "It started it all. Kenobi comes out on the 27th"
  },
  {
    "rating": "5/5",
    "review": "Led by the vision of George Lucas, Star Wars: A New Hope is a huge stepping stone for science fiction."
  },
  {
    "rating": "4/5",
    "review": "Classic storytelling in a new light."
  },
  {
    "rating": "5/5",
    "review": "This was a great movie. 👍"
  },
  {
    "rating": "4/5",
    "review": "It's cool, it has a cool vibe, which was basically a western cowboy movie but in space, which I liked. However, this was made in the 70's so there was really cheesy acting, action, and set up, which is no one's fault at all, but it does hold it back because it's hard to watch at some parts. But the action was cheesy but in some ways it kind of made it better and the action was good, but also cheesy. However, the story is pretty solid which definitely boosts it more."
  },
  {
    "rating": "5/5",
    "review": "Despite the fact that this film is so old, it is still one of the best films ever. It is a perfect start to the original trilogy and introduces lots of new characters who are extremely likeable (this is something the sequel trilogy couldn't do). You cannot miss this film!"
  },
  {
    "rating": "4.5/5",
    "review": "You go back to where you have been good. With a compelling and adventurous story. Star Wars IV: A New Hope had what it took to be a six-time Oscar-winning film and the highest-grossing film of the time"
  },
  {
    "rating": "3.5/5",
    "review": "The first in one of the most incredible franchises in the world, it's a good start to an even better trilogy."
  },
  {
    "rating": "5/5",
    "review": "It dethroned Dark Knight as my #1, I can't believe it. This movie has incredible writing and was revolutionary for the time. The performances were great, and the action was great. Everything was great. This is what every movie should strive to be."
  },
  {
    "rating": "4.5/5",
    "review": "This movie has astonishing visual effects for the late ‘70s! And it's got that atmosphere… I just love it!"
  },
  {
    "rating": "5/5",
    "review": "first and absoulte classic star wars movie, ahead of its time"
  },
  {
    "rating": "5/5",
    "review": "George Lucas does the impossible by creating a story that not only gives the audience an action packed movie. But a series that will forever be remembered through each generation."
  },
  {
    "rating": "5/5",
    "review": "The film that started it all. A new hope has gripping cinematography and a compelling story for the ages. A must see for any film fanatic and great for families!"
  },
  {
    "rating": "5/5",
    "review": "Can’t do justice with a review in 2022 that hasn’t already been said. A film that changed and influenced generations and my childhood. I have a room dedicated to Star Wars collectibles…enough said."
  },
  {
    "rating": "4.5/5",
    "review": "One of the best science fiction movies. A linear screenplay with intriguing characters. The montage of the movie is amazing."
  },
  {
    "rating": "4.5/5",
    "review": "Still one of the greatest blockbusters and hero journeys around"
  },
  {
    "rating": "5/5",
    "review": "\"Star Wars: Episode IV - A New Hope\" is an ambitious, action packed, and entertaining watch, that changed film forever thanks to its great effects and large scale."
  },
  {
    "rating": "5/5",
    "review": "Star wars 4 is one of the best Star Wars film. It is the 2nd most fun in a Star Wars movie."
  },
  {
    "rating": "2.5/5",
    "review": "I used to think it was great this movie. It has aged badly."
  },
  {
    "rating": "4.5/5",
    "review": "It's the first Star Wars film and while it's not the best in terms of plot, it tells the simplest story, introduces a handful of amazing characters and John Williams creates one of his best soundtracks."
  },
  {
    "rating": "5/5",
    "review": "Where it all began, a chapter that was supposed to be a B-movie and that turned into one of the immortal and iconic sagas in the history of cinema, I was a child when my father took me to the cinema to see Star Wars and I didn't even go there. I wanted to go, I left the cinema very happy and even today reviewing these repurposed films brings me back, in 70 to see these scenes, this photograph and this type of concept was revolutionary and still today many appreciate it, perfect"
  },
  {
    "rating": "5/5",
    "review": "Movie literally changed Hollywood and approach to movie making. Was way ahead of it's time when released. Has everything you would want in a movie. Forget all the stuff that comes later with the prequels, sequels, TV shows, etc.... This movie excels even as a stand alone. You can't help walking away from this and not feeling great."
  },
  {
    "rating": "5/5",
    "review": "Star Wars is undoubtedly a great franchise, and revisiting the first movie is magical and nostalgic. The pacing in the first moments of the film is great, because of how we are introduced to so much yet it is not overwhelming. Besides this, the movie provides the audience with a fun adventure through space with an iconic soundtrack. Some of the acting, dialogue, and editing can be iffy sometimes, but all in all, this is a fantastic movie. 10/10"
  },
  {
    "rating": "5/5",
    "review": "such of a perfect classic"
  },
  {
    "rating": "4.5/5",
    "review": "\"OO TEEENII\" - A jawa."
  },
  {
    "rating": "5/5",
    "review": "Star Wars: Episode 4 – A New Hope is an amazing coming of age story, with a wonderful David and Goliath theme/good and evil vibe. The movie opens with this hot girl Leia, played by Carrie Fisher cruising with her friends to the movies. When her ride stalls out, this very alpha male frat boy, Darth Vader, voiced by James Earl Jones, picks her and her friends up in his muscle car. Meanwhile we are introduced to Luke Skywalker played by Mark Hamill. He's stuck living on a rural farm with his aunt and uncle. He goes to the city for concerts, and to shop for records as often as he can, and dreams of being the lead singer of his own garage band, but his chores around the farm occupy most of his time. A chance encounter with a bassist C3PO, played by Anthony Daniels, and a drummer R2D2, who break down on the road near Luke's family farm becomes the nucleus of his band which will soon be known as Luke Skywalker and the Rebel Alliance. The trio now have everything they need for their garage band except a kick-ass guitarist. Leia starts dating Darth, and becomes his heavy metal band's number one groupie. Darth's group, The First Galactic Empire, already have a record deal, and are competing in the Mos Eisley Battle of the Bands (named Star Wars, A New Hope) that happens every year at the end of harvest season. Darth and the First Galactic Empire have all the best sound guys, amps, instruments, and sound boards. They are the marquee act of Palpatine Records, and the label is determined make sure Darth and his band crush all comers at the upcoming battle of the bands. Luke, and his fledgling band the Rebel Alliance meet a washed-up record producer, Ben Kenobi, played by Alec Guinness, who has a small home studio. He sees the promise of Luke's plucky garage trio, and soon hooks them up with the kick-ass guitarist they've been looking for, Han Solo, played by fresh face Harrison Ford. Han has a sweet '76 Chevy van with bubble tinted teardrop porthole windows and Cragar five spoke rims, which he lovingly calls the Millennium Falcon. Han's best friend, local weed dealer Chew Bacca, played by Peter Mahew, comes on as sound guy/roadie/driver. Ben gets the band into the battle of the bands, while refining their sound. Tragedy strikes Luke's family, and Darth's jealously over C3PO and R2D2 joining the Rebel Alliance over the First Galactic Empire exasperate matters. Leia gets fed up with Darth's intense dark vibe, and the grindy blues feel of The First Galactic Empire's music. She starts dating Luke, but there isn't really any chemistry, but Leia and Han immediately realize they have something special. Also, Luke Skywalker and the Rebel Alliance have become a pretty tight four piece by this point, smashing out some pretty raw surf inspired garage tunes. Unfortunately, if they are going to win Star Wars, A New Hope, they will have to do it without Ben, who dies tragically before he can see his protégé fulfill his rock star destiny. The stage is set for a battle of the bands, and it's clear Luke and Darth's bands will be the finalists. The First Galactic Empire play their three-song set first, and finish with their dark grinding heavy metal anthem \"Death Star.\" Luke and the Rebel Alliance crescendo up during their three-song set to their inspirational protest ballad \"Suck My Proton Torpedo,\" and literally blow Darth and \"Death Star\" away. The judges award the prize money to Luke and the Rebel Alliance, and the crowd response to the Rebel Alliance dwarfs response for Darth's band. The name of the contest, \"A New Hope,\" takes on a prophetic meaning as Luke and the Rebel Alliance appear poised to conquer the music world. Near the end, we see Darth recover his composure, hinting at a possible sequel. Perhaps Darth will try to reform the First Galactic Empire, or strike out on a bitter campaign of revenge. Maybe he will attempt to utilize Luke's musical talents for his own purposes. We'll have wait and see what relative Hollywood newcomer, and Star Wars creator, George Lucas, has in mind for the future of the franchise."
  },
  {
    "rating": "5/5",
    "review": "Groundbreaking and an intro to some of the most iconic characters in History."
  },
  {
    "rating": "5/5",
    "review": "This movie is awesome."
  },
  {
    "rating": "5/5",
    "review": "What can I say that hasn't been said a million times before?"
  },
  {
    "rating": "5/5",
    "review": "It's a simple space adventure for children, but somehow also one of the best films of all time."
  },
  {
    "rating": "5/5",
    "review": "Despite almost 50 years after its release, the film is very enjoyable to watch, with a very good plot and very good characters"
  },
  {
    "rating": "4.5/5",
    "review": "loads of fun and very interesting"
  },
  {
    "rating": "5/5",
    "review": "Inicia-se desta forma a Jornada do Herói, um conto épico, transcendido no universo de Star Wars, uma mistura dos famosos filmes italianos a respeito do faroeste, mesclando com os lendários filmes samurais e, claro, com um toque cyberpunk. Assim temos uma das mais famosas sagas do cinema."
  },
  {
    "rating": "4.5/5",
    "review": "A classic! What can I say that someone else hasn't already written?"
  },
  {
    "rating": "4.5/5",
    "review": "Other than a couple dull sequences and dated special effects (particularly the final sequence), there's not much you can negatively about this thrill ride of a movie. It's fast-paced (most of the time), exciting, full of tension, humor, and 20th century style self empowerment. I highly recommend this to anyone that likes a good vs. evil story."
  },
  {
    "rating": "5/5",
    "review": "My favourite movie franchise of all time. This came out the year I was born, so I never got to see it in cinemas until the Special Additions came out. This was the start of a massive universe of characters, ships, planets, and possibilities. After Disney's stumble at the beginning, they have since created an ever growing galaxy of stories to keep even the most steadfast OG fan pleased with at least something from the new material. I myself love it all...even Solo wasn't as bad as was publicized. 10/10"
  },
  {
    "rating": "3.5/5",
    "review": "It was the og Star Wars movie. A classic. Unfortunately I wasn't alive when this first came out so I don't like it solely because of nostalgia."
  },
  {
    "rating": "5/5",
    "review": "A must see. Watch the original version before special edition."
  },
  {
    "rating": "4.5/5",
    "review": "I have always been someone who when choosing a Star Wars movie will always go with something from the prequels. While I know they aren't the best of films I love the characters and from my memory the original trilogy just wasn't that great to me. I've been putting it off for years but now I am finally going to rewatch the original trilogy as the last viewing I had was roughly seven years ago. After watching the new Book of Boba Fett I was inspired to watch this trilogy and its first entry impressed me on a lot of levels. The first being the visuals; while they are dated, especially the laser blasts the film looks futuristic and the different species, envirmentents, lore, and architecture does not take the time to be explained or welcomed into the audience's knowledge. Instead the direction they take is more invasive and in your face. Events and terms of the Star Wars universe are dropped into casual conversation without any explanation making you feel like you're viewing the story rather than being told the story. Right off the bat it succeeds at something the prequels largely fails at in making exposition flow more naturally. It allows its audience to assume the obvious without having to explain it and it makes you feel like it doesn't have time to waste. Its pacing is another successful element. We spend just enough time with each main character and put them in the correct circumstances to form some kind of bond that will later grow into a great friendship. We go from location to location meeting new characters just as we come to understand and explore the last. Allowing us to be acquainted with their traits, desires, and motivations. Its presentation of information is perfect for the consumption of even the most general of audiences. The story is a crowd pleasing tale that takes each main character's arc and pays it off in the third act in a pleasing way. Obi Wan inspired Luke and educated him on his legacy to send him along on his destiny fulfilling his purpose. R2 finds Obi Wan and delivers the plans back to Leia while helping her escape her captivity. Leia's plan succeeds and she is able to get the plans back to the rebellion to plan an attack on the death star. Luke wishes to leave his farm life and become a pilot but when he loses his Aunt and Uncle he chooses to follow his destiny and learn the force to become a great warrior like his father causing him to wish to help the rebellion. Han wants money and behaves in a greedy way but in the end proves he has humanity in him and because of Leia's plan and Hans' help Luke is able to destroy the death star with the help of R2. Because all the arcs and motivations go hand and hand the story pays off in the most satisfying way possible. The final thing the film succeeds at is the stakes and danger in the third act. We don't want to see the empire win and we see so many characters die we don't know who could be next. Although it's obvious Luke is going to destroy the death star and not die, we don't want the other pilots to die. Unfortunately they all do and I give the movie credit for that because this is a war and the empire is clearly better equipped. Because of how invested I was in the character of Biggs who is mentioned at the beginning of the film I was sad to see him die and so distracted that when Han showed up and saved the day I didn't expect it somehow. Because of this the emotional payoff worked much better than maybe it should have. But the film has some flaws I would like to address that holds it back from the full five stars. Number one the amount of characters that die that are close to the main characters is crazy and that's fine but the way it's handled is what I find poor. Uncle Owen and Aunt Beru are essentially Luke's Mom and Dad and Luke sees their burning bodies and displays distress but realistically he should have been devastated screaming and crying or angry. He is mostly sheltered living on Tatooine in a small farm and clearly isn't exposed to much violence as he is later shown to be disturbed by Obi Wan cutting off an alien's arm in a bar. He is portrayed as naive. So why then does he kinda shrug it off and instead focus on becoming like his dad. It just doesn't feel natural. Even less natural is when Leia's entire planet is destroyed, her home, her family, her friends. Everything and everyone she has ever known and she kinda just whines and begs them not to. No devastation or emotional reaction. The next time we see her she is doing a playboy pose in her cell. The lack of humanity is disturbing. Even later when we watch Biggs get blown away Luke kind of makes a stone face. It makes sense that he would return his focus to the task at hand but it would have been more emotionally satisfying to have him say some words of sentiment and have some kind of funeral for all the fallen soldiers or something. But the happy ending with the ceremony and celebration leaves us with a note of triumph and it is pleasing but it doesn't really emphasize the cost of fighting this war. Overall the film had memorable characters, a complete and compelling story filled with danger and emotion and an impressive spectacle of visuals and word building. It is an obvious classic completely expertly crafted from its story to its beautiful and iconic soundtrack."
  },
  {
    "rating": "5/5",
    "review": "Along with Empire, this movie (the original cut) is an all time classic. Great performances, a perfect flow of information, and fun action sequences make this a great movie."
  },
  {
    "rating": "4/5",
    "review": "Admittedly there are sections that are a bit slow and awkwardly paced. Still, this movie somehow stands the test of time in terms of special effects and relevance."
  },
  {
    "rating": "5/5",
    "review": "I LOVED IT, ONE OF THE 2ND BEST STAR WARS MOVIES BEHIND THE EMPIRE STRIKES BACK. Must watch for any Sci fi fan or sw fan. 😀"
  },
  {
    "rating": "4.5/5",
    "review": "Star Wars revolutionised the Sci-Fi/Fantasy genre. Unlike anything seen before."
  },
  {
    "rating": "3.5/5",
    "review": "There isn't anything exceptionally good about this movie, but also nothing exceptionally bad about it. It's just an average movie. I know a lot of people would disagree with me though."
  },
  {
    "rating": "5/5",
    "review": "If you haven't seen this movie, what are you doing?! Go see it!"
  },
  {
    "rating": "4.5/5",
    "review": "This is one of the films that has become sewn into the very fabric of our popular culture. Yet, every day new kids are born who have never seen it. Watched through the lens of a young child, some of the scarier moments suddenly become more striking. Darth Vader is one of the great film villains for a reason, he's a frightening figure who engages in some very real moments of violence. With the continued prominence of the Saar Wars story through animated series, video games, and toys, it may be tempting to introduce films to children when they are too young to handle these more intense moments. But if kids are old enough to handle them, then it's likely that A New Hope will blow their minds. It remains an enduring classic for the same reasons it made such an explosive impression back in 1977. It's full of pulse pounding action lifted straight from the classic 1930s film serials, it's got humor and character, and the story guides you effortlessly into a completely original universe full of strange creatures and amazing sights. It's easy to be cynical about Star Wars given the billions of dollars it's earned selling everything from DVDs to toothbrushes but returning to the original film with fresh eyes will remind you just how remarkable it was, and continues to be."
  },
  {
    "rating": "2/5",
    "review": "I know this is the original Star Wars and introduces us to the world of Star Wars but this movie does not pass the test of time. Along with Mark Hamill's awful acting, the CGI is terrible and the action/lightsaber scenes are a snooze fest."
  },
  {
    "rating": "4.5/5",
    "review": "A fantastic sci-fi, fantasy movie Star Wars is certainly one of the easiest movies in the genre to digest. This may be due to its simple and straightforward plot, easily defined lines between good and evil, with characters that you want to root for. A total cotton candy movie but that's still one very enjoyable carnival treat. The only ding I have to give is the dated look of some of the sequences especially the final action scene. A lot has been said about this movie so I'll leave it at this: watch this movie if for no other reason than to see what all the fuss is about. You'll at least appreciate the Star Wars culture and you may become a fan yourself."
  },
  {
    "rating": "3.5/5",
    "review": "It's the OG Star Wars.... Need I say more?"
  },
  {
    "rating": "5/5",
    "review": "I only give 5 stars to the original. Han shoots first."
  },
  {
    "rating": "4.5/5",
    "review": "A unique and influential film that still continues to affect the world today, \"A New Hope\" remains one of the strongest \"Star Wars\" films to this day, providing insanely iconic scenes, lines, and characters that many people who haven't even seen the movie can recognize. The acting is done very well, and the worldbuilding is one of the best. This film also perfectly sets up the rest of the saga, introducing new characters and places while still leaving room for tons more to be added. The story and plot does begin to slow down after the second act finished, though it quickly picks up again during the attack on the Death Star. Overall, just a great film that continues to remain a timeless classic."
  },
  {
    "rating": "0.5/5",
    "review": "nonsense as a movie, good for some young children. Full of religious philosophy and characters taken directly from the main religions, not a problem, just an observation"
  },
  {
    "rating": "4/5",
    "review": "Great movie for the time. What they did was unbelievable. Scoring the movie now, it drops a bit. Not a lot of action is some areas where it drags a bit, but great film."
  },
  {
    "rating": "4.5/5",
    "review": "Molto molto molto bello"
  },
  {
    "rating": "5/5",
    "review": "Literally how can you not enjoy this space opera of a movie. Basically a western in space?! The characters, the different worlds and species all woven together for a timeless movie that we as an audience had never seen before. Growing up watching this over and over again as a child and play acting the characters are cherished memories. John William's scores still bring goosebumps. And the scene with Luke watching the binary sunsets with that one score always gets me."
  },
  {
    "rating": "5/5",
    "review": "10/10 great movie and a start to a good franchise."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies ever made. Not the CGI editions. I am a proud owner of the ORIGINAL original trilogy. Anyway, go watch it if you haven't already."
  },
  {
    "rating": "5/5",
    "review": "Possibly the greatest, most iconic, and most influential blockbuster of all time."
  },
  {
    "rating": "5/5",
    "review": "This is the debut film of my favorite movie franchise. The CGI is the worst part of the first trilogy. If the trilogy was released today's CGI style, I'll give the trilogy a 17/10. Now, it's a 14/10."
  },
  {
    "rating": "5/5",
    "review": "WOW! where do I start with this movie? This movie- when there was action, had me out of my seat the whole time! and when there were character moments and storytelling, it was touching. I can't stress how much I love this movie, It's a shame that when I saw this the first time I was so young, and I couldn't appreciate it fully at first, but I do now!!"
  },
  {
    "rating": "5/5",
    "review": "George Lucas isn't quite the most creative person in the history of Hollywood, but he was creative in the exact right way at the exact right time, inventing not only a unique fusion of genres (that proved way more successful than even he could have imagined) but a new type of special effects approach (moving the camera around an object, rather than the opposite like everyone else). The original Star Wars represents the pinnacle of a simple story with a hidden depth when examined closer. The world is well realized, the villains incredibly intimidating and memorable, what is and is-not possible is well established quickly, and it largely plays out as a feel-good movie with a few moments of genuine tension or drama. Mix in good performances, likable characters, awesome action sequences and some of the best audio (both music and sound effects) of any movie, and you've got a movie that has, and will forever, stand the test of time."
  },
  {
    "rating": "4/5",
    "review": "Simple story, but great movie, and of course an absolute classic"
  },
  {
    "rating": "4/5",
    "review": "What made Hollywood and gave the foundation to the sci-fingenre. Star Wars. A simple story about galatic governments, smugglers, space wizards, space ships and robots. This idea of film sounded absolutely insane in 1977. But for George Lucas it was a story, his story. That he believe was worth telling. All these years later, it sure did pay off. Not only is the film simple to follow, but the characters are likeable, then set pieces and score are fantastic. It's all great and is a solid film. I highly recommend any film goer to gives this a shot, and see what the hype is all about."
  },
  {
    "rating": "5/5",
    "review": "[⭐️96%] Instantly viewers fell in love with the Star Wars universe thanks to A New Hope's (1977) fantastic immediate world building, all done in a natural way thanks to a great plot which takes the characters to necessary places for events to play out. All of the development for the Galaxy, force and many other aspects is done in a very efficient way which allows the viewer to be excited for an expanding galaxy and hence why the franchise still runs over 40 years after this film. Given the year it was made, 1997, this movie has some very impressive special effects, better than some you see nowadays in 2021. Despite limited screen time, Darth Vader immediately established himself as a legendary villain thanks to his menacing presence and his ability to steal every scene he is in. You couldn't ask for a better introduction to one of the most influential franchises of all time."
  },
  {
    "rating": "3.5/5",
    "review": "\"Star Wars\" is the kind of film which have some of magic between the production and the final material. A must-see. 7/10"
  },
  {
    "rating": "5/5",
    "review": "Yeah, this is just classic Star Wars in every sense of the word. In one sense, it's surprising that this is the first Star Wars Project as it feels like we are really starting right in the middle of things. They are already name-dropping the Clone Wars and the Senate when it will be literal decades before we really know what was truly going. So in one sense, it's kind of a risk to start right in the middle of things without loads of backstop, but it 100% works. It's probably the easiest movie to jump into as well which is probably why it worked. The introduction to our classic heroes is just really done, as well as seeing Obi-Wan and Darth Vader in light of their larger story. And finally, this is a movie that I feel has only gotten better thanks to everything else that we have gotten since. Especially after watching both seasons of Andor and Rogue One, everything in this movie feels like it has so much weight and you understand the stakes more in light of all the hardships, trials, and sacrifices that led to this moment and how significant this moment now is."
  },
  {
    "rating": "5/5",
    "review": "one of the best next to SOLO a star wars story"
  },
  {
    "rating": "5/5",
    "review": "A legendary ambitious start to the ever-expanding star wars saga, George Lucas opened our eyes to new possibilities of blockbuster filmmaking and things have never been the same since audiences have seen that opening crawl for the first time. Starting in the middle of the story(Episode IV) It is a thrilling adventure of young farmboy Luke Skywalker who with the help of old Jedi master obi-wan Kenobi follows his hero's journey and begins learning the ways of the force and become a Jedi himself as he and hotshot smuggler Han solo along with wookie Chewbacca(captain and co-pilot of the Millennium Falcon), work together with the companionable droid duo of R2-D2 and C-3PO to rescue princess leia, and help the Rebel Alliance in their fight to restore freedom and justice to the Galaxy as they go up against menacing Darth Vader and his waves of imperial storm troopers. The story is a perfect morality tale as good goes up against evil and it feeds people's hunger for adventure, thrills ,and comedy. This 1977 film is a classic and with the story, John William's brilliant musical scores and the huge leaps that it takes with special effects and other filmmaking techniques(which were many building blocks towards even better techniques for modern filmmaking) this film will live on in people's hearts and minds for generations but don't take my word for it, go out there and see it for yourself!!! no longer will you have to fear about not knowing what the force is or what a wookie is or even how many languages C-3P0 can speak, this film is the perfect first steps into a larger world! May the force be with you,Always!"
  },
  {
    "rating": "4/5",
    "review": "No Yoda so this is the highest it's getting."
  },
  {
    "rating": "5/5",
    "review": "Still remember the day I first time I saw this movie. Utter brilliant . Great cast special effects."
  },
  {
    "rating": "4/5",
    "review": "The best film of the original trilogy. This movie has many loveable characters and iconic moments, it's all round a great watch and very entertaining."
  },
  {
    "rating": "5/5",
    "review": "This Is One Of My All Time Favorite Movies, back then when this movie came out they only had to check off one thing fun. But with the new movies it's all horrible writing and boring Popcorn entertainment. But I know people won't agree that this is the best star wars movie but to me it is. If you love movies then you need to watch Star Wars now, get your butt on the couch and watch some fun filled Sci-Fi Fun."
  },
  {
    "rating": "4/5",
    "review": "Good movie and original"
  },
  {
    "rating": "4.5/5",
    "review": "Great Movie its puts you out of your chair all the way."
  },
  {
    "rating": "4/5",
    "review": "This amazing movie is what kicked off one of the most famous and beloved sagas of all time and although the pacing of this movie wasn't fantastic, this movie is still one of the best in the star wars franchise."
  },
  {
    "rating": "5/5",
    "review": "Nothing I can say that hasn't already been said. This is my favorite movie of all time."
  },
  {
    "rating": "4.5/5",
    "review": "classic movie with the iconic 4 of Han Solo, Luke Skywalker, Princess Leia and Chewie"
  },
  {
    "rating": "5/5",
    "review": "It changed movies forever!"
  },
  {
    "rating": "5/5",
    "review": "Creative, innovative and some charming simple characters. Perfect movie experience."
  },
  {
    "rating": "4/5",
    "review": "Luke is incredibly whiny. It's tough to take. Still too much of an overall fan to give this any lower of a score."
  },
  {
    "rating": "5/5",
    "review": "A timeless classic, thats all to say..."
  },
  {
    "rating": "5/5",
    "review": "Perfection, that is all"
  },
  {
    "rating": "2/5",
    "review": "Boring, kinda overrated."
  }
]