{
  "movie_name": "The Accountant 2",
  "reviews": [
    {
      "rating": "5/5",
      "review": "If you liked the the 1st one, you will not be disappointed by the 2nd one. Hopefully it will lead into a 3rd."
    },
    {
      "rating": "5/5",
      "review": "I'm buying it as soon as it comes out"
    },
    {
      "rating": "4/5",
      "review": "If there was 1 thing that the 1st movie didn't had was more moments between ben and jon. Who would have knew they make a pair a good brother's if they were given enough screen time. A mixture of action, comedy, despair. Lots of comedic moments between the 2. Wroth a watch"
    },
    {
      "rating": "4/5",
      "review": "The basic story was really good."
    },
    {
      "rating": "5/5",
      "review": "Loved this movie, its even better than the first."
    },
    {
      "rating": "5/5",
      "review": "The chemistry between the two actors is so good. I hope they both get together again in a third movie. Maybe another action movie"
    },
    {
      "rating": "5/5",
      "review": "Fantastic. Better than the first one and I really liked the original."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie . Decent plot with lots of action. Enjoyable."
    },
    {
      "rating": "5/5",
      "review": "Loved it, just as action packed and humorous as the first one."
    },
    {
      "rating": "5/5",
      "review": "Must see!! Commentary, brotherly banter between them is so funny! Really enjoyed this! The action is gripping and intense!"
    },
    {
      "rating": "5/5",
      "review": "Better than the first, which was also great! Acting is superb, storyline both gutsy and tender-hearted, and best fight scene ever at the end. Affleck developed the role."
    },
    {
      "rating": "3.5/5",
      "review": "Good action, sentimental ending. Not as good as the original."
    },
    {
      "rating": "3/5",
      "review": "This is an action movie. Plot is confusing and not really anything other than a reason to have a lot of guns & explosions going off. Nothing like the first Accountant. Like action, you’ll like it. Like plot, you’ll be disappointed."
    },
    {
      "rating": "2/5",
      "review": "The story had no continuity and half of it didnt make sense."
    },
    {
      "rating": "1.5/5",
      "review": "kinda ruined the characters"
    },
    {
      "rating": "2/5",
      "review": "Eh. It was okay and a good excuse to eat a ridiculous amount of popcorn."
    },
    {
      "rating": "4/5",
      "review": "enjoyed the brothers. The movie has som funny parts."
    },
    {
      "rating": "5/5",
      "review": "Very well done movie. Lots of action and gun play with some fighting."
    },
    {
      "rating": "5/5",
      "review": "This was a great movie!"
    },
    {
      "rating": "5/5",
      "review": "Action packed, a must see!"
    },
    {
      "rating": "4.5/5",
      "review": "Another great romp at the movies!"
    },
    {
      "rating": "5/5",
      "review": "Absolutely worth the wait. Ben and Jon have a great chemistry and fingers crossed this franchise continues!"
    },
    {
      "rating": "5/5",
      "review": "Great movie for what it is, 5 stars based on the genre Better acting than you would expect."
    },
    {
      "rating": "4.5/5",
      "review": "I loved the continuation of the original story. There was lots of amazing non-stop action, and a great cast, especially portraying autism so well. I was totally entertained."
    },
    {
      "rating": "5/5",
      "review": "This movie did not disappoint. It has action combined with an excellent storyline. Its been a long time since Ive enjoyed watching a movie. You wont regret watching this summer blockbuster."
    },
    {
      "rating": "5/5",
      "review": "Exciting action really good movie."
    },
    {
      "rating": "4/5",
      "review": "Great sequel. A little slow at times but it was a great movie."
    },
    {
      "rating": "5/5",
      "review": "I enjoyed it very much it was a good combo of action and comedy"
    },
    {
      "rating": "4/5",
      "review": "Do not expect the same style as the first movie. This has a story nothing like the previous adventure. Braxton returns and is a highlight of the movie. The action was good enough to leave you wanting more action."
    },
    {
      "rating": "4/5",
      "review": "More entertaining than first."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Better than the 1st one!!"
    },
    {
      "rating": "3/5",
      "review": "Not bad but needs more accounting and guns."
    },
    {
      "rating": "4/5",
      "review": "It had serious comedic parts. The IT parts were awesome"
    },
    {
      "rating": "5/5",
      "review": "Decent story line. The brothers interactions nailed it."
    },
    {
      "rating": "5/5",
      "review": "Liked multi layered plot great cinematography"
    },
    {
      "rating": "5/5",
      "review": "Wonderful action and comrade among the actors"
    },
    {
      "rating": "4.5/5",
      "review": "Action packed.. comedic timing on point. Nice movie!!!"
    },
    {
      "rating": "4.5/5",
      "review": "It was a terrible story about human trafficking. Which is very real today. But I like the outcome and the 2 men who saved them. It was not very bloody but was very real."
    },
    {
      "rating": "5/5",
      "review": "Was so much better than I was expecting. I found it to be well written, interesting plot, great characters and wonderful relationship between the two brothers with a good amount of humor along the way."
    },
    {
      "rating": "1.5/5",
      "review": "We hated this movie. It was slow moving, had very little action, and the actors spoke about rediscuss unrelated things. We walked out before the movie ended. Elliot S and Diana S"
    },
    {
      "rating": "5/5",
      "review": "Movie was very good and had plenty of action scenes as well as a good story line."
    },
    {
      "rating": "5/5",
      "review": "If you liked the first one you should like this too. A bit of comedy mixed into this one with all of the action of the last one. I enjoyed it a bit more than the first."
    },
    {
      "rating": "1/5",
      "review": "It was too violence and profanity which is NOT needed or enjoyed"
    },
    {
      "rating": "5/5",
      "review": "Funny and action packed! Just as good as the first one if not better!"
    },
    {
      "rating": "3.5/5",
      "review": "Shifting its focus more squarely onto Ben Affleck and Jon Bernthal, The Accountant 2 changes the tone and style of the original — trading in its distinct suspense angle for more commercially popular elements. While the sequel ups the entertainment factor, it loses a bit of the original’s unique flavor in the process."
    },
    {
      "rating": "4/5",
      "review": "Good movie but not as good as the original. Some really good moments and scenes and ALL actors did an excellent job in their roles. Some technology in use seems a little unbelievable and Marybeth Medinas origins from the first flick would probably disqualify her from the position she holds in this film. But, all-in-all my wife and I enjoyed the movie."
    },
    {
      "rating": "5/5",
      "review": "Great sequel but not at all like the first version."
    },
    {
      "rating": "5/5",
      "review": "Did not disappoint! This one was better than the first and that’s says a lot! Great job!"
    },
    {
      "rating": "2/5",
      "review": "Movie had meaning but it was so slow."
    },
    {
      "rating": "5/5",
      "review": "If you liked the first Accountant movie The Accountant 2 is a must see!"
    },
    {
      "rating": "4/5",
      "review": "Missed Anna Kendrick in this sequel .Hope she is back for number three."
    },
    {
      "rating": "4.5/5",
      "review": "Love Accountant 2 ... nicely written and good follow on the Accountant 1 and hope to see Accountant 3 in the future."
    },
    {
      "rating": "1.5/5",
      "review": "Didn’t compare to intrigue of Accountant 1"
    },
    {
      "rating": "5/5",
      "review": "Great sequel with more emphasis on the brothers relationship"
    },
    {
      "rating": "5/5",
      "review": "Never a dull moment with its combination of action and humor!"
    },
    {
      "rating": "5/5",
      "review": "Nailed it! I loved the first one, but this sequel actually tops it. Everything: acting, directing, story, script, cinematography...was absolutely on point. Ben Affleck and Jon Bernthal are incredible together and funny as hell. With so many forgettable movies out there lately, this one is a standout. Trust me: The Accountant 2 is not to be missed!"
    },
    {
      "rating": "5/5",
      "review": "I loved this movie! It was the perfect sequel to the first. I love the dynamic between Affleck and Bernthals characters. There is a serious tone throughout the film and their brotherly quirks are the perfect relief. The ending was so good I left not wanting another sequel it was so perfect.❤️"
    },
    {
      "rating": "1/5",
      "review": "The story was rushed. \"It's been 8 years...\" was the brother's statement. The story pops up in LA, looks 3rd world, visits Mexico to save children and ends with them going camping. The comedic banter was there but not enough to get me to buy it. I loved The Accountant. Seen it in theaters, bought the DVD/Blu-ray, purchased the digital version, this was not that. This was the pilot for \"The Accountant- The Series\""
    },
    {
      "rating": "5/5",
      "review": "Great movie:, lots of action and humor"
    },
    {
      "rating": "5/5",
      "review": "Husband and I both really enjoyed it!"
    },
    {
      "rating": "5/5",
      "review": "The Movies was great. It was action packed and hilarious all at the same time."
    },
    {
      "rating": "5/5",
      "review": "It did not have the same great narrative as the first one but continued it's heart, fun and action. It's take on neuro-atypical may not be accurate but neither is daredevil. A neuro-divergent collection of heros, and one cat person😉"
    },
    {
      "rating": "5/5",
      "review": "Great movie!! Action and comedy. Best movie Ive seen in theaters in a while! Definitely would watch it again."
    },
    {
      "rating": "5/5",
      "review": "Finally!!! Excellent storyline! Love the actors! Please don’t make us wait another 8-9 years!!"
    },
    {
      "rating": "4/5",
      "review": "Some plot holes. Never heard understood why they were after the mother and son in the first place"
    },
    {
      "rating": "4/5",
      "review": "A Forrest Gump John Wick hybrid. It was good. Amusing moments, pace kept you in the story. Solid entertainment."
    },
    {
      "rating": "5/5",
      "review": "Very good movie! Enjoyed it immensely"
    },
    {
      "rating": "2.5/5",
      "review": "A little slow, not as good as the 1st."
    },
    {
      "rating": "5/5",
      "review": "Action, funny and at times sad but was awesome movie!!"
    },
    {
      "rating": "3/5",
      "review": "Meh - it was ok. Nothing like the first one."
    },
    {
      "rating": "5/5",
      "review": "Great movie. I would watch it again."
    },
    {
      "rating": "1.5/5",
      "review": "Dull. The action, plot, and special effects are all tired and boring. Oddly, the best part is the dialogue and the personal interaction between these two odd brothers. That would have made a good movie. But the plot (what was this movie about anyways?) and the lack of coherence drag this movie down. Make a buddy movie with these two? Great. But this movie is not it."
    },
    {
      "rating": "5/5",
      "review": "It was a very good movie, lots of action but also funny."
    },
    {
      "rating": "5/5",
      "review": "the acting and story line"
    },
    {
      "rating": "5/5",
      "review": "Good sequel to the original."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Such a great sequel"
    },
    {
      "rating": "5/5",
      "review": "Loved this movie! I thought it was better than the first."
    },
    {
      "rating": "4/5",
      "review": "We thought it was a better movie than expected and would recommend it. It's a little hard to follow at times.We will watch again."
    },
    {
      "rating": "4.5/5",
      "review": "Lots of action and brotherly love. Nice casting too."
    },
    {
      "rating": "5/5",
      "review": "The chemistry and dialogue between Affleck and Bernthal is spot on"
    },
    {
      "rating": "5/5",
      "review": "This is an absolutely outstanding movie with a great plot and engaging dialogue. However, the language was very strong, and at times, absolutely too much!!! But a really must see movie!!! Ben Affleck portrayed his character masterfully. Huge Kudos!!!"
    },
    {
      "rating": "5/5",
      "review": "It was a great continuation of the original story. I loved the interaction between brothers. Great action and funny, too."
    },
    {
      "rating": "1/5",
      "review": "Confusing story line and way too much violence."
    },
    {
      "rating": "5/5",
      "review": "I want to watch it again"
    },
    {
      "rating": "3.5/5",
      "review": "More comedy than the first one which is fun but takes some of the serious parts out of place and they just didn’t seem as good as the first one. The story line was a big drag on this film. It was like the main point was annoying it made enjoying the movie very hard."
    },
    {
      "rating": "4/5",
      "review": "Much more brother time and their relationship! Loved that side!"
    },
    {
      "rating": "5/5",
      "review": "If you linked the original you will like this one too. th action was good and I loved the evolution of the brothers relationship."
    },
    {
      "rating": "5/5",
      "review": "This movie was funny and action-filled in all the right places. It was a great plot and had the absolutely best actors for the roles! I truly hope there is another film!"
    },
    {
      "rating": "4/5",
      "review": "good character development between the brothers - lots of action and a few good twists - well worth seeing"
    },
    {
      "rating": "4/5",
      "review": "Enjoyed it. Good action, plot and acting. And was pretty funny in spots"
    },
    {
      "rating": "5/5",
      "review": "Loved it, funny and action packed."
    },
    {
      "rating": "4/5",
      "review": "Good but slow at times! Still very much worthy seeing!"
    },
    {
      "rating": "5/5",
      "review": "Great movie with great humor mixed in with the action. I also like how recent events like the border crisis and human trafficking is portrayed. Excellent movie."
    },
    {
      "rating": "5/5",
      "review": "Great story with endless action"
    },
    {
      "rating": "5/5",
      "review": "This movie did not disappoint. Lots of action and laughs.the storyline was good."
    },
    {
      "rating": "0.5/5",
      "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
    },
    {
      "rating": "5/5",
      "review": "Very few sequels live up to their original moviethis one delivered! Well worth the 2 hours. Well done for cast and crew."
    },
    {
      "rating": "5/5",
      "review": "Good movie had a few slow spots good action overall very worth while"
    },
    {
      "rating": "3/5",
      "review": "Solidly entertaining movie. Funnier than I thought it would be. Plot is kind of dumb and pretty thin but action scenes were good."
    },
    {
      "rating": "4/5",
      "review": "Finally watched the original on demand a week or two ago. Glad I got to see this one on the big screen. It seemed to have a better story and less violence, even though I am happy to say I was not the only one in the theatre laughing at some of the bits of violence. :)"
    },
    {
      "rating": "4/5",
      "review": "Great action movie, highly enjoyed."
    },
    {
      "rating": "5/5",
      "review": "Has it's funny parts and lots of action! VERY GOOD!"
    },
    {
      "rating": "2/5",
      "review": "CONTAINS SPOILERS: I love the first one. I couldn't wait for the second. I went to see it twice before writing this. Its not good. They omit a lot of the action that was in the first...maybe they wanted to save money on choreography or something but there were minimal fight scenes. The culmination of the bad guy and chick assassin that we waited for the whole movie to see...showed her follow him out of a door with a knife...that was it. Lame. Too much touchy-feely crap in this one that wasn't needed. There's an entire scene in the beginning where Chris is at a speed dating thing that made zero sense and was completely disjointed from the rest of the movie. The plot is confusing and hard to follow. Its better the second time because you already understand where they're going, but its difficult to follow the first time. Ultimately, this didn't compare with the first one. They made it more of a drama with precious few action scenes."
    },
    {
      "rating": "5/5",
      "review": "This movie was good. I was not sitting in the theater wondering when the movie would be over. It had some funny parts in it and some good action scenes. A nice continuation from the first movie. I did not leave the theater disappointed."
    },
    {
      "rating": "4/5",
      "review": "I just enjoyed the film. The brothers were fabulous together and some of the scenes quite funny. The violence is definitely there but then you know that if you saw Accountant 1."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is one of the best thriller action films of 2025, it always finds new ways to level up the stakes and plot twists to surprise your mind in ways you didn’t know was coming. It also shows the emotional brotherly connection Christian and Braxton have and how they reconcile. But I still can suggest some changes to the film: 1. There was no resolution between Wolff and Maybeth. If I were the director, I would have the characters have one last talk about justice and vigilantism.  2. Anaïs needs some more screen time and plot development. For example, she doesn’t even try to meet her son one last time. If I were Gavin O’ Connor, I would put this one last confrontation into the script so that the movie would be emotional. I would also have the assassin thank the brotherly duo for saving her son, and add how she kills Burke with an epic yet tense moment.  3. I would add an post-credits scene of Christian meeting the girl she met in the bar, and create an awkward yet hilarious date night with his brother secretly watching, while laughing. I would rate this a 7.2/10."
    },
    {
      "rating": "3/5",
      "review": "Can’t compare with the first movie. Very predictable."
    },
    {
      "rating": "4/5",
      "review": "Action packed and witty!"
    },
    {
      "rating": "2/5",
      "review": "Started out interesting, but got typical cheesy repetitive Bollywood low budget, action. Waste of 11. Wait for the stream release and pay 4 for the 48 hr rental and you have 2 hrs to waste."
    },
    {
      "rating": "3.5/5",
      "review": "Watched for the first time, last week. Reviewing, but will likely edit after a few watches... It's good. Same solid performances and action, with the same feel as the first film. However, there seems to be more character bonding and connection in this instalment. Not a bad thing, per se, but the story is slower as a result, and didn't deliver that 'punch' in the same way the first film did on my initial viewing"
    },
    {
      "rating": "2/5",
      "review": "The first one was so much better. 2 was a movie in search of a reason to be."
    },
    {
      "rating": "5/5",
      "review": "Action packed, I enjoyed this film in the theatre all by myself!"
    },
    {
      "rating": "1/5",
      "review": "Dont bother. Plot was sporadic and uninteresting."
    },
    {
      "rating": "5/5",
      "review": "Absolutely wonderfully entertaining movie funny Moving everything I loved it"
    },
    {
      "rating": "3/5",
      "review": "The storyline was so confusing and hard to follow. In addition, I found it to be very boring and oftentimes I could feel myself falling asleep."
    },
    {
      "rating": "5/5",
      "review": "This was a great movie! Perfect follow up to the first one."
    },
    {
      "rating": "3.5/5",
      "review": "The acting was good but the story was weak."
    },
    {
      "rating": "5/5",
      "review": "Humorous and action packed! Great movie!!"
    },
    {
      "rating": "5/5",
      "review": "Best movie this year"
    },
    {
      "rating": "5/5",
      "review": "This was a great movie by far the best. One I've seen in a long time."
    },
    {
      "rating": "5/5",
      "review": "Full of action better than part 1"
    },
    {
      "rating": "5/5",
      "review": "Loved it as much as I loved the first one if not more!!"
    },
    {
      "rating": "2.5/5",
      "review": "Ok for a sequel. The interaction between the brothers is the best part of the movie and I could have used more of it rather than another gratuitous killing."
    },
    {
      "rating": "4.5/5",
      "review": "I like the camaraderie between the two brothers"
    },
    {
      "rating": "5/5",
      "review": "It is a fun popcorn movie that feels like a buddy cop hit man movie. It is a fun Friday night movie"
    },
    {
      "rating": "4/5",
      "review": "Really enjoyed it. The storyline had the right amount of twists to keep your attention without confusion. Cant wait for 3"
    },
    {
      "rating": "5/5",
      "review": "Awesome movie! Lived up to the original and then some! Go see it!!!"
    },
    {
      "rating": "2/5",
      "review": "Too violent! Just a shoot them up movie. The best thing was the comedy between the brothers"
    },
    {
      "rating": "5/5",
      "review": "La película esta muy buena la calidad visual ni se diga la verdad vale la pena cada segundo verla los invito a verla no se decepcionará"
    },
    {
      "rating": "5/5",
      "review": "It was a great action movie with a great plot and some really fun scenes."
    },
    {
      "rating": "5/5",
      "review": "This account had more character than the first. Account 2 had more humor than the first. I enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "It was a great movie"
    },
    {
      "rating": "5/5",
      "review": "This movie was very entertaining and amazing."
    },
    {
      "rating": "4.5/5",
      "review": "Very fun lots of action"
    },
    {
      "rating": "5/5",
      "review": "This was so funny and awesome, definitely one of the best films of 2025 so far. The first movie was great and gave a great backstory to both Christian and Braxton but this movie was more enjoyable and more fun with better action sequences and better written characters. You do not need to see the first movie to watch this but if you want to understand most of the main characters I would definitely recommend watching the first one."
    },
    {
      "rating": "4/5",
      "review": "Lots of action and funny too!!"
    },
    {
      "rating": "5/5",
      "review": "Better than the first one!"
    },
    {
      "rating": "5/5",
      "review": "This film should have come many years ago. I really appreciated the dialogue between the two brothers, it felt authentic. The theme throughout the movie of them looking to connect with someone or something was a refreshing and comical surprise."
    },
    {
      "rating": "5/5",
      "review": "I like their unique synergy. it has me think of an old game called Army of Two."
    },
    {
      "rating": "5/5",
      "review": "Acting and action with humor"
    },
    {
      "rating": "4.5/5",
      "review": "I don't often day this.. But this maybe better than the first. Action packed, good sense of comedy."
    },
    {
      "rating": "5/5",
      "review": "Great entertaining movie."
    },
    {
      "rating": "5/5",
      "review": "Awesome. Hoping for #3 at some point"
    },
    {
      "rating": "5/5",
      "review": "The bro relationship"
    },
    {
      "rating": "5/5",
      "review": "Funny and violent. Brothers for life! Time with the cat! lol!"
    },
    {
      "rating": "5/5",
      "review": "Action, humor, deeper back-story development, explored complicated but committed relationship between brothers. Very well shot and solid plot."
    },
    {
      "rating": "2/5",
      "review": "The first movie was a pretty interesting concept and story looking at someone who not only learned to live with a challenge, but harnessed it into becoming a general badass. The Accountant 2 turned Ben Affleck's character into a Jason Bourne type person, who has the support of an army of neruodivergent children, hacking into surveillance systems and computers at a moments notice. The first movie Affleck was an actual accountant, in The Accountant 2 I think Affleck did his neurodivergent number thing once and that was while roughly interrogating someone on the fly. Outside of that he was just doing spy type stuff. It was just kind of another generic shoot-em-up movie cashing in on the name of a film that actually had an interesting concept. Affleck seemed more twitchy than autistic, but my favorite part might have been the Deputy Director of a Federal Agency freaking out while some children hack into the photos of a private citizen. Like it's 2025 and she's well up in the Federal Government, Snowden released the info on Federal surveillance of US citizens like 15 years ago. Grow up."
    },
    {
      "rating": "4/5",
      "review": "Liked the movie. Nice segway from first accountant to next one..The main action scene was very unbelieveable...like an old jackie chan movie...so many guys with guns coming out from everywhere...taking care of a prison for kids...really?"
    },
    {
      "rating": "4/5",
      "review": "Great story, maybe a little to much \"shoot em up\" in this one."
    },
    {
      "rating": "4/5",
      "review": "Loved this sequel so much. It’s difficult to improve on a great original movie but focusing on the brotherly relationship of these two characters is just what this story needed. Jon Bernthal’s energy translates across the whole film and his contrast with Ben Affleck’s character has a charm. Will definitely rewatch."
    },
    {
      "rating": "5/5",
      "review": "Funny and action packed! A must see."
    },
    {
      "rating": "5/5",
      "review": "Great story, acting and action."
    },
    {
      "rating": "5/5",
      "review": "Fantastic sequel! Really well done story line without a hard reach to make it relevant to the first movie. Highly recommended!"
    },
    {
      "rating": "5/5",
      "review": "What a delight. Reminds me of what movies used to be - entertainment. Great story, acting, action, and most of all humor. Was ready to watch it all over again the moment it ended."
    },
    {
      "rating": "0.5/5",
      "review": "Movie stunk compared to the first one. It was awful."
    },
    {
      "rating": "5/5",
      "review": "Great action movie a must see. Loved it."
    },
    {
      "rating": "3.5/5",
      "review": "This movie was great. I didn't like it as much as the first movie, but it was still captivating."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie. Followed the first one better than expected. I love how characters from the first one came back and had much more to do with the movie"
    },
    {
      "rating": "5/5",
      "review": "Thought this movie was fantastic!! Acting was brilliant and fast moving."
    },
    {
      "rating": "3/5",
      "review": "Decent. I enjoyed the movie, but I feel like the story could’ve flowed better. Still good though."
    },
    {
      "rating": "5/5",
      "review": "this movie was very enjoyable. it was very nice to see the brothers back together."
    },
    {
      "rating": "4.5/5",
      "review": "While I admit the lighter tone might not be to everyone's tastes, especially if they preferred the more consistently gritty tone of the original film, I ultimately thought that The Accountant 2 was a really good sequel. Good performances, well-directed moments of suspense and brutal action, amusing comedy whilst still knowing when to read the room and, now that the (admittedly obvious) twist from the first film is no longer an issue, enjoyable buddy comedy chemistry between Ben Affleck and Jon Bernthal. If I had a nickel for every time The Punisher was involved with both the film and TV Daredevils within the same calendar year, I'd have two nickels, which isn't a lot but it's weird that it happened twice. Not to mention a surprisingly heartwarming ending. Overall, a worthy sequel despite the likelihood of this film meeting the same fate as Furiosa of being a box-office bomb as a result of a nine-year gap between movies that caused any hype for a follow-up to fizzle out by the time it finally came out. Not that this has stopped the filmmakers for figuring out ideas for a third film."
    },
    {
      "rating": "4/5",
      "review": "Good movie. Hope they make another one"
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed it, I got some good laughs out of it."
    },
    {
      "rating": "4.5/5",
      "review": "Excellent funny and super entertaining loved it!"
    },
    {
      "rating": "5/5",
      "review": "Great Story. And Loved the Fight scenes!!!!!"
    },
    {
      "rating": "1.5/5",
      "review": "the action and story was interesting, but the main character was just dreadful."
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing. Jon Bernthal aka Shane was absolutely amazing. Ben plays the character so well"
    },
    {
      "rating": "5/5",
      "review": "I love how they let us see the brothers relationship and the action was great too. I also liked the way they shined a bigger light on Autism and helping us see through a different lense.’ And it’s just as good as the first one"
    },
    {
      "rating": "4/5",
      "review": "A tad longgood action - wild beginning and it came on strong at the end!"
    },
    {
      "rating": "4.5/5",
      "review": "The movie built up well, using the brother interaction, we got to view Braxton more in depth. Some very funny lines, and good interaction between the characters. The role of child trafficking was disturbing but understandable."
    },
    {
      "rating": "5/5",
      "review": "Enjoyed the movie as good as the original movie, The Accountant."
    },
    {
      "rating": "2.5/5",
      "review": "Little A-Teamish in its final action scene. More action packed than original. Surprised never showed the son reunite with mother at end."
    },
    {
      "rating": "4.5/5",
      "review": "Great story, great chemistry amongst the actors, if u liked the first u will definitely like the sequel"
    },
    {
      "rating": "5/5",
      "review": "awesome! ...not as good as the first one but still great...Ben is amazing as this character and the chemistry with Berthal is magic..would have loved to see Anna Kendrick back...bummer...would have been even better."
    },
    {
      "rating": "5/5",
      "review": "Great movie for a sequel."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Action packed and FUNNY!!"
    },
    {
      "rating": "5/5",
      "review": "Fast paced, good acting. Good storyline."
    },
    {
      "rating": "5/5",
      "review": "Action packed and a good story line ."
    },
    {
      "rating": "5/5",
      "review": "This sequel was everything we’ve waited for. It was filled with intrigue and action. There was great chemistry between the brothers which was not explored in the original movie. It was a much better perspective of the characters and the lives they’ve created for each other. Must see!"
    },
    {
      "rating": "3.5/5",
      "review": "I enjoyed this movie. I had fun with it. I think the first one is a better told story."
    },
    {
      "rating": "3/5",
      "review": "This was not a bad movie, it’s just My husband and I have a ratings system and well this movie is not what we call a theater movie. For example you want a theater movie to be a non stop ride of action and drama this was spotty. The character development was amazing between the brothers, it’s just that’s what we’d call a home movie."
    },
    {
      "rating": "5/5",
      "review": "Worth the wait great movie lots of action"
    },
    {
      "rating": "5/5",
      "review": "Great sequel. Action was good. Plot was great. Actors did a great job."
    },
    {
      "rating": "4/5",
      "review": "Good movie with some humor along the way."
    },
    {
      "rating": "5/5",
      "review": "I was not expecting to laugh as much as I did! I loved the first one, which had good humor too, but this sequel will have you slapping your knee. It has all the feels & a good amount of action of course. Cant wait for this to come out, I will be buying it!"
    },
    {
      "rating": "3.5/5",
      "review": "Ben Aflex is getting too old for these action movies. Otherwise a good movie."
    },
    {
      "rating": "5/5",
      "review": "Y’all. The (original) Accountant had no business being as good as it was! I had high hopes for #2 and did it deliver!! It is better than the first one. If you even sort of like the first one, WATCH THIS ONE!"
    },
    {
      "rating": "5/5",
      "review": "loved it, had references to first movie really showed progression through behavior and mental health I adored every second"
    },
    {
      "rating": "5/5",
      "review": "Great sequel, super funny and action packed!"
    },
    {
      "rating": "5/5",
      "review": "Had me on the edge of my seat in every action scene, just as good as the first one"
    },
    {
      "rating": "3.5/5",
      "review": "This was a fun movie going experience. Filled with laughs, action, and feel good moments. Your date will love this movie (trust me)."
    },
    {
      "rating": "5/5",
      "review": "Amazing tbh just as good if not better than the first one"
    },
    {
      "rating": "5/5",
      "review": "Excellent action scenes and humorous. It's definitely a must-see movie."
    },
    {
      "rating": "4/5",
      "review": "Solid movie, Ben and John are great together. There were definitely some weird moments and the plot was a little loose, bit I really enjoyed it. The audience got some good laughs, and we could all use a little humor these days. Solid sequel."
    },
    {
      "rating": "4.5/5",
      "review": "Funny. Plenty of action and a half decent story line."
    },
    {
      "rating": "5/5",
      "review": "Loved this even more than the first movie!! So good!!"
    },
    {
      "rating": "3.5/5",
      "review": "Good movie. Fun action sequences and enjoyed the character interactions. Drags quite a bit especially when trying to piece together the story puzzle, but overall a good time"
    },
    {
      "rating": "5/5",
      "review": "Definitely a great action packed, oddly funny sequel. Must see!"
    },
    {
      "rating": "5/5",
      "review": "I loved this movie! Ben Affleck really displays autism characteristics very well! I especially loved the banter between the brothers and the overall story!"
    },
    {
      "rating": "5/5",
      "review": "Loved it. Lots of action and good csring"
    },
    {
      "rating": "3/5",
      "review": "not as novel as the first"
    },
    {
      "rating": "5/5",
      "review": "Great story and action"
    },
    {
      "rating": "5/5",
      "review": "Excellent movie, loved the chemistry between Jon & Ben"
    },
    {
      "rating": "4/5",
      "review": "Decent plot Great character. Excellent sequel."
    },
    {
      "rating": "3/5",
      "review": "The first one was better. I thought the plot was a little lame and didnt make much sense. The dog/cat thing, the speed dating, the interaction between the brothers didnt cut it."
    },
    {
      "rating": "5/5",
      "review": "Love it great movie great action. I thought it was better than the first one."
    },
    {
      "rating": "5/5",
      "review": "Great plot and familiar actors from the original. Loved it!"
    },
    {
      "rating": "5/5",
      "review": "Action packed! Great ending!"
    },
    {
      "rating": "2.5/5",
      "review": "The Accountant 2 is nowhere near as good as the first movie. A great cast keeps this from being a bad movie for sure. We don't get to see a physical encounter between Justine and Ben's character, which would have been ideal. A little ridiculousness occurs with the kids helping Justine like they are all computer savants and Ray King's death scene was a little wonky also. Braxton was the most entertaining character this time around, Anais would come in second - she was a great addition and will hopefully appear in the 3rd movie with the return of Anna Kendrick."
    },
    {
      "rating": "5/5",
      "review": "We thoroughly enjoyed the movie. The focus wasn't so much about killing people as it was finding the family, especially the boy. It left you with a good feeling."
    },
    {
      "rating": "5/5",
      "review": "Very different from the first one, but still a lot of action!"
    },
    {
      "rating": "5/5",
      "review": "Lots of action. Ben Affleck was great."
    },
    {
      "rating": "5/5",
      "review": "Good plot. Fast moving. Lots of excitement."
    },
    {
      "rating": "3/5",
      "review": "Interesting and contemporary story with great acting. I am a fan of Ben Afflect, The second time around his character is a bit too much to endure through the film. His brother played by John B. was very good! The movie was slogging around too much. Hope the third installment does better."
    },
    {
      "rating": "4/5",
      "review": "Well made movie from start to finish. Gonna watch it again to iron out some of the details....pay attention!"
    },
    {
      "rating": "4.5/5",
      "review": "This was great. They maintained the characters from The Accountant. Had a bunch of twists and turns in it. And the movie was lot of fun and, in the end, satisfying."
    },
    {
      "rating": "5/5",
      "review": "Loved this movie, action, comedy and excellent graphic tees all in evidence."
    },
    {
      "rating": "5/5",
      "review": "Its a movie! Meant to be entertaining, not necessarily factual. We loved it despite the negative comments out there."
    },
    {
      "rating": "2.5/5",
      "review": "Well, what can I say!? When I saw the trailer I was afraid it would be a brutal war like shootout throughout the movie, but fortunately it wasn't. What it wasn't either was to be on par with the first edition. While pretty much nothing was predictable in the first movie, which made it captivating and cool, here in the second edition pretty much every development was clear from early on or coming up throughout to even the dumbest of movie goer. There were no surprises, except the fact that the boring, idiotic, childish chit-chat of two professional assassins throughout various endless scenes was uncalled for and completely ludicrous. And one key factor of the story, the kids of victims forced into prostitution and slavery, not being instantly clear to an accountant and assassin working for drug lords, is just plain stupid. The movie has its silly moments, which lighten up the flick. And while the action scenes are there, quite spread out throughout the 2 hours, all seem to be rather of B-movie quality. All in all it's watchable, but a very far cry from the original one. 5/10 points!"
    },
    {
      "rating": "4/5",
      "review": "A solid fun time, action was solid. The story was good. But what really drove the movie was the chemistry between Ben Affleck’s character Chris and John Bernthal’s Braxton. With some fun laughs and heartfelt moments turning this into a pretty dynamic Duo."
    },
    {
      "rating": "5/5",
      "review": "Loved it! There was a flow to the movie that kept you engaged and made you laugh."
    },
    {
      "rating": "4/5",
      "review": "Good action packed movie. The characters work well together and the humor is spot on. Can't wait for the next one!"
    },
    {
      "rating": "5/5",
      "review": "Great story line, awesome fight scenes, good cast!"
    },
    {
      "rating": "5/5",
      "review": "Well done acting from all the main characters. Great action scenes and a bit of humor inserted ."
    },
    {
      "rating": "5/5",
      "review": "Great follow up to The Accountant"
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed. If you liked the first one this one actually seemed better. Odd for a sequel I know! Acting was great, plot was more entertaining, overall an enjoyable couple hours."
    },
    {
      "rating": "4.5/5",
      "review": "Enjoyed it very much. Was better than first and had its funny parts. Definitely recommend seeing it."
    },
    {
      "rating": "5/5",
      "review": "An excellent action and a feel good movie."
    },
    {
      "rating": "5/5",
      "review": "love the dynamic of them, the buddy cop comedy feel mixed with the same level of action is perfect, and it was a satisfying character arc for the both of them"
    },
    {
      "rating": "5/5",
      "review": "Awesome movie. Didnt see Accountant before this, but will be watching it soon"
    },
    {
      "rating": "5/5",
      "review": "Great Movie! The action scenes were incredible and totally different from what I expected it is a must watch"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this movie with my family. it was amazing, kept my attention and longing for more."
    },
    {
      "rating": "5/5",
      "review": "Well written plot with a lot of action. Good story, easy to follow."
    },
    {
      "rating": "5/5",
      "review": "I LOVED this movie!!! The first one was great so I expected this one to be great as well and I wasn't disappointed! Great cast & storyline. I enjoyed the action and cinematography too. Definitely would recommend this movie!!! You won't regret it!"
    },
    {
      "rating": "5/5",
      "review": "What a great sequel! We thoroughly enjoyed it....hope 3 is in the works."
    },
    {
      "rating": "4/5",
      "review": "First 40 minutes is garbage build up, Ben Affleck has some strange forced accent that he didn't have in the first film, don't spend money on it, turn it on in the background on a streaming service that you already pay for while you're flicking your woman's bean in your own home."
    },
    {
      "rating": "5/5",
      "review": "We loved Accountant 2 and thought it was better than the first one. We laughed and was entertained the whole time."
    },
    {
      "rating": "5/5",
      "review": "Loved the story, loved the action, loved the 1st one & now the 2nd!"
    },
    {
      "rating": "4.5/5",
      "review": "Great movie. Action, Drama and Comedy."
    },
    {
      "rating": "5/5",
      "review": "You have to go watch this and don’t forget the popcorn."
    },
    {
      "rating": "5/5",
      "review": "Great action movie. This was my second time seeing the movie"
    },
    {
      "rating": "5/5",
      "review": "Loved it all the way through. I love the fact that Chris showed just a tad bit more personality. Has some great humor throughout."
    },
    {
      "rating": "5/5",
      "review": "Enjoyed this movie. Love it when the good guys win."
    },
    {
      "rating": "5/5",
      "review": "The movie was even better than the first one. Good plot and lots of action."
    },
    {
      "rating": "4/5",
      "review": "A little too many t words for us. We have not seen the first movie yet. I assume there were some foundations there that this sequel was built on, which would have been helpful. All in all, a good movie."
    },
    {
      "rating": "3.5/5",
      "review": "Definitely worth a watch. I admit I was late to the party in seeing the first movie, but I can see why a lot of people really enjoy it. This sequel is a very good crowd pleaser and I thought it was very entertaining. There is good brotherly chemistry between Ben Affleck and Jon Bernthal is very believable. The 2nd installment is definitely more comedic than the first movie, but I can understand the need to do so. Not sure if there will be more movies in this but count me interested in them."
    },
    {
      "rating": "5/5",
      "review": "Great actions and some timely laughs"
    },
    {
      "rating": "5/5",
      "review": "They didn't finish the movie with him and Braxton. Will there be another, 3"
    },
    {
      "rating": "5/5",
      "review": "Non stop action. And a touch sensitive."
    },
    {
      "rating": "4/5",
      "review": "A good movie. Maybe a little uneven, with one or two scenes running a bit long, or not hanging as tightly in the narrative, but these were outweighed by some great character development and some excellent action scenes. I would certainly vote for an Accountant 3"
    },
    {
      "rating": "5/5",
      "review": "Better than the first one"
    },
    {
      "rating": "4/5",
      "review": "Little silly from some parts but altogether I like it"
    },
    {
      "rating": "4.5/5",
      "review": "We enjoyed The Accountant I, so naturally we aaawanted to see the next release, The Accountant II. We enjoyed it!"
    },
    {
      "rating": "5/5",
      "review": "Loved everything about this movie! Story line action everything! Made the first movie even better"
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie probably more the the first one. Good story development, some well time startles and a good amount of humor. Affleck and Bernthal had great chemistry. Most enjoyable movie I’ve seen in a long time."
    },
    {
      "rating": "3.5/5",
      "review": "disliked how loud every scene was liked the actors"
    },
    {
      "rating": "4/5",
      "review": "similar to the first one, great action and some funny dialog. left you guessing some at the end. although I liked it."
    },
    {
      "rating": "5/5",
      "review": "Great storyline, excellent action and even some good humor."
    },
    {
      "rating": "5/5",
      "review": "Loved it, better then the first one"
    },
    {
      "rating": "5/5",
      "review": "It was action packed justice that made me laugh out loud."
    },
    {
      "rating": "4.5/5",
      "review": "The two brothers together made it extra special.Christian dancing and Braxton figthing were highlights. Using these exceptional children to tract and hunt was phenomenal. Rescuing the children and resettling them at the neueroscience center was so cool."
    },
    {
      "rating": "5/5",
      "review": "It was funny (dating event) and picked up where the 1st film left off. Great fight scenes too. Love the two brothers together."
    },
    {
      "rating": "5/5",
      "review": "Great movie! Awesome cast and great acting!! Lots of action!! I really enjoyed it."
    },
    {
      "rating": "4.5/5",
      "review": "Lots of action and multiple storylines and plots kept you on your toes"
    },
    {
      "rating": "0.5/5",
      "review": "Weak and slow and movie wasted time lingering in dead meaningless scenes like speed dating and brother in hotel’s rehearsing a convo about a dog purchase sleepy movie I rather sinners it brought me back to movies I had not been to movies I’m since pandemic but now I have screen accountant once a nd sinners twice"
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie I have sat through in years. Very poor writing, poor acting, story line that none of us could follow. Horrible movie"
    },
    {
      "rating": "4/5",
      "review": "The dark humor and brotherhood between the two main characters is dynamic. Good action, great story."
    },
    {
      "rating": "5/5",
      "review": "Absolutely loved this movie, loved the first one as well. I feel that Ben played the part very well and kept the autistic character believable. A lot of ah ha moments. Kinda hope they have a 3 in the works."
    },
    {
      "rating": "5/5",
      "review": "Great movie! Lots of action and a good plot :)"
    },
    {
      "rating": "5/5",
      "review": "It was so funny and had nonstop action from the begining. movie is better than the first. my wife even enjoyed it and she's not a big fan of those kinds of movie"
    },
    {
      "rating": "3/5",
      "review": "Had its moments. A little hokey, a little disjointed, but humorful"
    },
    {
      "rating": "4/5",
      "review": "Sense of humor was great and lack of romance"
    },
    {
      "rating": "5/5",
      "review": "Very good movie - well written."
    },
    {
      "rating": "4.5/5",
      "review": "Awesome performances, great drama, great laughs, unexpected moments! Loved it! Make more!"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Not just a rehash of the original. Paced well. didnt get bored. Enjoyed the story and the action."
    },
    {
      "rating": "4.5/5",
      "review": "Loved the Team up with the Brother was awesome. Love the fact they were working with the FBI and the Agent from the previous movie."
    },
    {
      "rating": "5/5",
      "review": "We loved the movie and went home to watch the first again! Accountant 2 brought everything together smoothly. It was highly entertaining- action packed, great lines from both brothers and never a dull moment."
    },
    {
      "rating": "5/5",
      "review": "It was great, a movie you can actually watch on more than 1 occasion. Did not slow down, action, humor, and suspense."
    },
    {
      "rating": "3.5/5",
      "review": "I was really looking forward to this one because The Accountant is one of my biggest surprise movie ever but this one was a bit of a let down but still a good movie! It's missing some action sequences big time, also lacking the many twists the first one had, some green screen scenes are bad (why would you use GS for a movie loke that in the first place) and also it's quite long for nothing really! On the positive side I really enjoy the chemistry with his brother, the Nerd tech crew is awesome, I enjoyed the use of Medina and the final fight scene is great! Overall it does not bring anything really new to the table other than the Nerd tech crew but still his a good action/thriller movie."
    },
    {
      "rating": "5/5",
      "review": "Action, followed the 1st movie character pattern, okay story line, would watch again."
    },
    {
      "rating": "5/5",
      "review": "Thoroughly enjoyed everything about the movie, but particularly the dynamic between Ben Affleck's Christian Wolfe and his brother Braxton played by Jon Bernthal. They are such brothers. Honestly felt like it was even better than the first one not because of the story so much as building on all the elements we loved in the first and growing them. If there is a third, I'll totally be there, but I have no problems waiting for the right story!"
    },
    {
      "rating": "4/5",
      "review": "Enjoyable story line, snappy dialog, good chemistry between Affleck and Bernthal."
    },
    {
      "rating": "5/5",
      "review": "The movie kept my attention the whole time. There was never a laspe of action."
    },
    {
      "rating": "4.5/5",
      "review": "This movie was excellent from start to finish! Great sequel!"
    },
    {
      "rating": "4/5",
      "review": "Amazing better than the first one"
    },
    {
      "rating": "4/5",
      "review": "How the movie made you to tie key components together."
    },
    {
      "rating": "3.5/5",
      "review": "Parts of the plot line are a little contrived but an enjoyable movie"
    },
    {
      "rating": "5/5",
      "review": "Great movie! Made want to re-watch the first so I can come back for seconds on this one."
    },
    {
      "rating": "4.5/5",
      "review": "Action packed, great chemistry between Affleck and Bernthal, love he still has his assistant and then some! Little long, could have shaved a few scenes, but overall, so fun, loved, loved!"
    },
    {
      "rating": "5/5",
      "review": "Great storyline and action packed. Cant wait to see it again."
    },
    {
      "rating": "4/5",
      "review": "Great movie to watch"
    },
    {
      "rating": "5/5",
      "review": "Better than the first movie. Fun and humorous"
    },
    {
      "rating": "3/5",
      "review": "Felt very much like a John wick comedy, very sporadic and poor pieced together. Plot was loose. As a fan of the first one and it being one of my favorites, I’m disappointed in this. Should’ve just left it as one movie."
    },
    {
      "rating": "4.5/5",
      "review": "Good action movie with some humor as well."
    },
    {
      "rating": "5/5",
      "review": "Loved the relationship build between the brother's. The line dancing scene. Lots of kick ass action."
    },
    {
      "rating": "5/5",
      "review": "Great acting—Affleck nails the role so well! As does his brother!!"
    },
    {
      "rating": "5/5",
      "review": "Movie was moving and well Made! Enjoyed it as much as the first one!"
    },
    {
      "rating": "4/5",
      "review": "Awesome movie just like the first Accountant. Too bad they killed off J.K Simmons early in the movie."
    },
    {
      "rating": "5/5",
      "review": "The plot, pacing, and stakes made this movie the best of 2025."
    },
    {
      "rating": "2/5",
      "review": "The actors did a good job, but I found it to be a little boring."
    },
    {
      "rating": "5/5",
      "review": "AMAZING! It was DEFINITELY funny, suspenseful & it delivered a beautiful wholesome lesson on the importance of loyalty, family & doing the right thing."
    },
    {
      "rating": "5/5",
      "review": "It had good action and humor."
    },
    {
      "rating": "2/5",
      "review": "Didn’t watch the original “The Accountant” but walked into this one. Writing this review on my phone midway because the movie is that uneventful and predictable. The plot development is hard to follow and really gradual. The complexity isn’t very well paced or explained. Ben Affleck’s acting is painfully unconvincing, the accent labored & forced (sort of like a bad Donald Trump accent). They should’ve casted someone else. Cynthia Addai-Robinson‘s character is also painfully bland and unremarkable. Some good action scenes & humor. Some pointless violence for drama’s sake. A lot of headshots. Really enjoyed the intro music, I wish they leaned more into the composition adding some flavor. Ok movie if you have nothing else to watch."
    },
    {
      "rating": "4/5",
      "review": "Tons more action than the first film! Taking off a star bc he doesn't do any math or puzzles or anything that all that made him who he was. It was just action, zero of him doing what makes him special, which is puzzles and numbers. Love the brotherly chemistry and comedy in this one."
    },
    {
      "rating": "1/5",
      "review": "This movie is garbage with no theme or coherent plot. I wrote a 6 paragraph review but there was an error so I'm not retyping it. Amazon ruins every IP they touch."
    },
    {
      "rating": "5/5",
      "review": "I loved it! Riveting and kept my attention throughout the entire movie! I am a Ben Affleck fan!!!"
    },
    {
      "rating": "5/5",
      "review": "Action packed!! Loved seeing the kids hack and find out things the FBI couldn’t. Also loved Cliff’s dry humor that we got to see while interacting with his brother. But due to the theater having the movie go out between the Unknown Assassin “killing” Mary Beth and Cliff & Braxton arguing before they went to Juarez, I feel like I missed some valuable information."
    },
    {
      "rating": "5/5",
      "review": "My family and I loved it. Action and comedy. Great cast."
    },
    {
      "rating": "5/5",
      "review": "One of those few movies where second movie is equally good and entertaining as first"
    },
    {
      "rating": "2/5",
      "review": "It was too much violence and the plot was lacking true complexity and story telling. I don’t know what the message really was, most of the story seemed not applicable"
    },
    {
      "rating": "3/5",
      "review": "Good story overall. A little hard to follow in places and more violent than it needed to be."
    },
    {
      "rating": "5/5",
      "review": "very entertaining. with a twist of humor"
    },
    {
      "rating": "4/5",
      "review": "Not quite as good as the first one, lots more action and humor but not as suspensful"
    },
    {
      "rating": "5/5",
      "review": "Just as good as the first one! Really enjoyed and several funny parts and of course action packed. Great mixture."
    },
    {
      "rating": "4/5",
      "review": "Good plot and entertaining."
    },
    {
      "rating": "5/5",
      "review": "excellent movie, highly recommend!"
    },
    {
      "rating": "5/5",
      "review": "Amazing movie, awesome how we got to see Chris and his brother working together"
    },
    {
      "rating": "5/5",
      "review": "the movie carried a good plot. Ben Affleck as in his last movie played the role very well. the ending was climatic and there were areas of humor through the movie very entertaining"
    },
    {
      "rating": "5/5",
      "review": "Great movie. I hope they make a 3rd movie."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie. Humorous full of action well written well acted."
    },
    {
      "rating": "4.5/5",
      "review": "Great action movie. Definitely a must see!"
    },
    {
      "rating": "5/5",
      "review": "Full of action and suspense. I like how the brothers wound up being good, close, and loving brothers at the end. Very cool how the autistic kids worked together to gather information to help people. Shows how talented and smart the kids are and an asset to the community"
    },
    {
      "rating": "5/5",
      "review": "Very good movie. Might be better than the original"
    },
    {
      "rating": "2/5",
      "review": "The movie was not well done. The plot was confusing and the characters and actors did not do a very good job Ben affleck was just not convincing as the accountant. I wasn’t entertained though there were some funny parts. There are better movies out there and this movie was overhyped."
    },
    {
      "rating": "5/5",
      "review": "This outstanding movie’s worth visiting the theater from a very long break. Streamed movies on TV have gone downhill. This is a topnotch action thriller movie and a very humorous brother dynamic that made it complete and so entertaining. Accountant 3 please"
    },
    {
      "rating": "5/5",
      "review": "Great follow up to the previous movie, moves along at a good pace, great mixing action with some comedy."
    },
    {
      "rating": "5/5",
      "review": "Great movie filled with a little bit of everything. Great plot, with a mix of action and good amount of comedy. Ben Affleck and John Bernthal have a nice chemistry on camera"
    },
    {
      "rating": "5/5",
      "review": "Better than the first one and the best movie of the year! Hilarious, action packed, and a great story line. This is a must-see on the silver screen and worthy of watching again. It's an adrenaline rush, a feel-good, and has all the components of a Hollywood blockbuster movie."
    },
    {
      "rating": "3.5/5",
      "review": "Liked the first one. This one is also good, kept me entertained, funny and has you cheering the underdog. Would pay for this one"
    },
    {
      "rating": "5/5",
      "review": "This was great. Thoroughly enjoyed it!!!"
    },
    {
      "rating": "5/5",
      "review": "This advances the story of The Accountant characters Chris and his brother Braxton. Action, gun play, intriguing plot, development of characters and you will get a few laughs. If you saw the previous film you’ll love this one. Left me wanting to see another movie in a year or 2."
    },
    {
      "rating": "2/5",
      "review": "Way off from the first one... Ben tried too hard to be autistic etc. Storyline was wack"
    },
    {
      "rating": "5/5",
      "review": "I believe it was better than the first one"
    },
    {
      "rating": "5/5",
      "review": "What a great action thriller suspense film - loved it!! Ben and Jon both amazing actors."
    },
    {
      "rating": "2/5",
      "review": "Not as good as the first one. It gets goofy and predictable in the last 30 minutes."
    },
    {
      "rating": "4/5",
      "review": "Lots of action and humor"
    },
    {
      "rating": "4/5",
      "review": "Lots of action, violence and humor. Not a great movie, but very it was entertaining."
    },
    {
      "rating": "5/5",
      "review": "Great action movie. I liked it!"
    },
    {
      "rating": "5/5",
      "review": "Just pure movie fun! Touching, funny and action packed."
    },
    {
      "rating": "5/5",
      "review": "Soooo much fun! Even better than the first one!"
    },
    {
      "rating": "5/5",
      "review": "I loved Accountant 2! Sooooooo good!"
    },
    {
      "rating": "5/5",
      "review": "followed first film but better."
    },
    {
      "rating": "4/5",
      "review": "Fun and action packed, good story!!"
    },
    {
      "rating": "5/5",
      "review": "If you’re a fan of The Accountant, it’s a must see. The story focuses more on the relationship of Chris and Braxton and there’s more action."
    },
    {
      "rating": "5/5",
      "review": "The Accountant 2 was just as good as the first movie, which normally doesnt happen. There was a good balance of drama and action. It was very entertaining and really good acting. A++"
    },
    {
      "rating": "5/5",
      "review": "Great Movie! Great plot, very relatable to our troubled world today."
    },
    {
      "rating": "5/5",
      "review": "liked the action, actors were awesome"
    },
    {
      "rating": "5/5",
      "review": "Excellent! Lots of action, great back story, some really hilarious parts, and great acting! Thoroughly enjoyed it!!!"
    },
    {
      "rating": "5/5",
      "review": "Die Fortsetzung steht dem Vorgänger in nichts nach. Die Geschichte hat einen sehr guten roten Faden, nach dem sich alles richtet. Auch das \"Upgrade\" mit seinem Bruder und somit auch logische Weiterentwicklung der Geschichte, macht Spass. Die Beiden liefern sich Streitereien, die entwaffnend lustig sind. Die Macken des Bruders sind Gleichwertig. Nun zu den intensiven Actionszenen, wie, teilweise aus Kriegsszenarios. Dies ist alles andere als B Action. Die Gefechte sind sehr gut Choreographiert. Es ist überraschend, nach teilweise mäßigen Kritiken. Hier wurde sich außerordentliche Mühe gegeben, das: Wenige gegen Viele Szenario, so überzeugend wie möglich zu gestalten. Das funktioniert. Ist sogar überzeugender, als John Wick. Absolute Empfehlung"
    },
    {
      "rating": "5/5",
      "review": "It was both funny and action-packed. Loved it!"
    },
    {
      "rating": "5/5",
      "review": "Great watch if you like action! A little humor too. Good synergy among the actors. Will watch again for sure"
    },
    {
      "rating": "1.5/5",
      "review": "Too long, too slow, not much of a story line. Accountant 1 much much better."
    },
    {
      "rating": "4/5",
      "review": "You have to see the first movie to follow the depth of the plot."
    },
    {
      "rating": "5/5",
      "review": "This movie was great maybe actually better than the first one"
    },
    {
      "rating": "5/5",
      "review": "Loved the movie! The dynamic between the brothers created several instances of brother rivalry throughout, and the comedic innuendo was great - you’ll laugh throughout. Action was great as well - top notch. There is reference about a family from Ecuador and the final scene takes place in Central America, so MAGA will blame Hollywood for evoking the “immigration debate” even though there is no reference to Geopolitics at all, as it’s not engrained in the plot. The plot is layered and complex and I will see it again when it comes out on TV - play close attention to the plot from the beginning or you may get lost at times. Another reason why folks may have liked the second less - this movie isn’t for stupid people…lol. The first movie was the “stage-setter” that provided context and this is a continuation - so I’m not sure it’s fair to compare the two. Again - loved this movie. 🤙"
    },
    {
      "rating": "5/5",
      "review": "it kept your attention to the end"
    },
    {
      "rating": "5/5",
      "review": "Better than the First one, funny as hell. Great comedy team, they are great."
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed the movie!"
    },
    {
      "rating": "5/5",
      "review": "It was a really good movie and kept you interested. It was not confusing. All around great movie."
    },
    {
      "rating": "5/5",
      "review": "If you enjoyed the first Accountant movie you will love this second Accountant. It explores the relationship between the two brothers and where they are now in life. That plus all the action makes this a great movie. Happy ending makes it a ten."
    },
    {
      "rating": "3/5",
      "review": "More violent than first movie No personal relationship except brother"
    },
    {
      "rating": "4/5",
      "review": "Great movie! Took a while to get to the good storyline and some slow/dragged out unnecessary scenes. Overall enjoyable:)"
    },
    {
      "rating": "4.5/5",
      "review": "Everything - it was even better than the first movie."
    },
    {
      "rating": "5/5",
      "review": "Funny, violent, exciting - all in the right combination."
    },
    {
      "rating": "5/5",
      "review": "Great how they tied everything together!"
    },
    {
      "rating": "5/5",
      "review": "I didn’t think I would like it more than the first one as sequels typically for me at least aren’t as good as the original but this one I believe I enjoyed more. Love the humor and a chemistry between the brothers! Hope there is an Accountant 3!"
    },
    {
      "rating": "5/5",
      "review": "Absolutely enjoyed the move thoroughly ! Better I thought than even the first Accountant. The acting, the characters, the relationships came together so believably well. The plot was strong & found myself really having to pay attention as to the names so I could relate them to each character. The humor here was perfect. I had myself many chuckles and for me that’s rare. Watching Chris & Brax acting as brothers was so realistic. As if they didn’t even have to“act”it out. Was just natural. I hope there is a #3 sequel. If the director/writer & main actors are still used then it will be an another great movie. I highly recommend seeing this movie but probably after you’ve made sure to see the original Accountant. 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟"
    },
    {
      "rating": "4/5",
      "review": "Very entertaining. Did not disappoint."
    },
    {
      "rating": "5/5",
      "review": "great acting,action and comedy."
    },
    {
      "rating": "4/5",
      "review": "Fun and enjoyable - great performances and funny! A few story issues that didn't make sense but overall fun!"
    },
    {
      "rating": "5/5",
      "review": "Action packed!! Did not disappoint! Just as good as the first one."
    },
    {
      "rating": "5/5",
      "review": "Doesn’t disappoint. Compliments 1st one. Could have tightened it up during sitting on top of the air stream scene & the hotel scene agonizing over calling the dog breeder. Those areas were slow, but time was gained in other scenes. Affleck nails his character, now more developed & mature."
    },
    {
      "rating": "4/5",
      "review": "If you liked the first one, you’ll like this one too."
    },
    {
      "rating": "5/5",
      "review": "Fast paced, action continued with story line"
    },
    {
      "rating": "5/5",
      "review": "Soooooo good! We loved every bit of it!"
    },
    {
      "rating": "4/5",
      "review": "Loved the brother interaction. Pretty good storyline, would see again!!"
    },
    {
      "rating": "4/5",
      "review": "There wasn’t a fully developed plot as the first one had. It was very entertaining though. When is it my turn to hold the cat?!?"
    },
    {
      "rating": "5/5",
      "review": "Loved this sequel!! Its got just enough humor with lots of action, along with the complexity of estranged brothers figuring each other out!"
    },
    {
      "rating": "4.5/5",
      "review": "Super entertaining. Great banter between the characters. Good payoff at the end"
    },
    {
      "rating": "5/5",
      "review": "Its was the perfect blend of humor and action. A great cast with genuine onscreen chemistry!"
    },
    {
      "rating": "4/5",
      "review": "Loved it. Action and comedy was great"
    },
    {
      "rating": "5/5",
      "review": "Excellent Movie!! Normally, a sequel is not as good as the original, but this one dispels that myth! A lot action, humor and jaw biting drama! With todays pricing, going to the movies can be costly, but would gladly pay to see this one on the big screen again and again! I highly recommend this movie as a MUST SEE in the theater!"
    },
    {
      "rating": "5/5",
      "review": "Better than the 1st one. Hysterical with tons of action."
    },
    {
      "rating": "3/5",
      "review": "Nothing unique or special about this movie. Overall, I would say it was average at best and wouldnt recommend friends to rush out and see it."
    },
    {
      "rating": "5/5",
      "review": "Thoroughly enjoyed, thought it was better than the first movie and great chemistry with Affleck and Bernthal."
    },
    {
      "rating": "4.5/5",
      "review": "Good continuation to the story. Bunch of gifted kids hacking predator drones was a little bit over the top though"
    },
    {
      "rating": "5/5",
      "review": "Huge fan of the first movie and this did not disappoint!!"
    },
    {
      "rating": "2.5/5",
      "review": "Too much talking and not enough Action"
    },
    {
      "rating": "5/5",
      "review": "I thought it was an entertaining movie. I would recommend it!"
    },
    {
      "rating": "5/5",
      "review": "Great story the actors were amazing it was serious, funny and sad . Was a good story with twists and turns. I would see it again"
    },
    {
      "rating": "5/5",
      "review": "Highly recommend seeing this movie!"
    },
    {
      "rating": "4.5/5",
      "review": "There was a good amount of action and intrigue, which kept my attention throughout the movie. It also had some funny elements. I enjoyed it."
    },
    {
      "rating": "4.5/5",
      "review": "A brothers bonding movie. With bang bang stuff too. The fight scene choreography was quite good."
    },
    {
      "rating": "5/5",
      "review": "Wasnt at all like the first movie. Very unexpected plot. Good pace. Well done. Looking forward to a 3rd."
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely terrible. Has nothing to do with the first one. This movie has too many characters, too much plot, \"twists\" that are unnecessary, and worst of all, it's just plain boring. My wife and I both looked at each other midway through thinking \"When is this going to end\""
    },
    {
      "rating": "5/5",
      "review": "Great!! The storyline was good and the brothers were good together!!"
    },
    {
      "rating": "5/5",
      "review": "Very enjoyable movie action packed fast paced."
    },
    {
      "rating": "1.5/5",
      "review": "Super cheesy. Childish plot"
    },
    {
      "rating": "5/5",
      "review": "Such a good movie! This one was funny and had action."
    },
    {
      "rating": "3/5",
      "review": "Not bad but not as good as the original."
    },
    {
      "rating": "5/5",
      "review": "Just the right amount of action and humor."
    },
    {
      "rating": "5/5",
      "review": "Youve got to see the first one to get the story line, but this movie is a must see if you liked the first one. A lot of violence, which Im not usually a fan of, but hey, its the bad guys getting offd!"
    },
    {
      "rating": "5/5",
      "review": "Enjoyable, a little draggy in parts, but what in life is not. Cant wait to see John Wick."
    },
    {
      "rating": "5/5",
      "review": "Great sequel to the original"
    },
    {
      "rating": "5/5",
      "review": "The story l line was positive. The acting was phenomenal. Just a nice movie about two brothers bonding."
    },
    {
      "rating": "5/5",
      "review": "So good! Plenty of plot to keep you guessing and entertained."
    },
    {
      "rating": "4/5",
      "review": "Its a fun movie, with very likeable characters, the dynamic between Ben Affleck character and his brother was a lot of fun."
    },
    {
      "rating": "5/5",
      "review": "it kept my interest the whole time."
    },
    {
      "rating": "4/5",
      "review": "Picked up right where it left off. Wouldve been cool if they brought the acted accountant Anna Kendrick back"
    },
    {
      "rating": "5/5",
      "review": "love the action, the seriousness along w/comedy in it."
    },
    {
      "rating": "3.5/5",
      "review": "Ben Afflecks voice sounded different. Kinda like Dustin Hoffman in Rain Man. Some scenes didn't make sense but overall the movie was entertaining"
    },
    {
      "rating": "5/5",
      "review": "Excellent movie and Ben Affleck was great in his role as were the other actirs"
    },
    {
      "rating": "4.5/5",
      "review": "Great action and humor - heartwarming story as well."
    },
    {
      "rating": "5/5",
      "review": "Lots of action and some humor"
    },
    {
      "rating": "5/5",
      "review": "Love the movie! It was better than the first. Loved the humor and the neurodiversity is well represented."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Lots of action"
    },
    {
      "rating": "5/5",
      "review": "Very entertaining. Great humor between the brothers. Loved Ben and John's performance. I loved how it followed the original Storylines. Definitely recommend seeing this one!"
    },
    {
      "rating": "4/5",
      "review": "Intriguing but the story line was difficult to follow. The acting was very good."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining sequel. The touch of humor was nice."
    },
    {
      "rating": "4/5",
      "review": "Fun movie! it's a different tone than the first one, a lot less emotional connection to the characters, but still a great fun action flick."
    },
    {
      "rating": "5/5",
      "review": "Number two was as good as the original. Rare."
    },
    {
      "rating": "4/5",
      "review": "Much better than the first.. the banter between the brothers was great."
    },
    {
      "rating": "5/5",
      "review": "Even better than the first one. Great story. Loved the action! Super fun and entertaining!!"
    },
    {
      "rating": "4/5",
      "review": "Good but not great. B+. Story was convoluted and fair fetched. Jon Bernthal was very good."
    },
    {
      "rating": "3.5/5",
      "review": "It was ok. The first one was better."
    },
    {
      "rating": "3.5/5",
      "review": "I always have low expectations of sequels but this was was better than expected. It could stand alone without the storyline of the original. I real lies lies the lite humor peppered throughout. The story was well done and the action was really good."
    },
    {
      "rating": "5/5",
      "review": "A nicely done sequel to the original"
    },
    {
      "rating": "4/5",
      "review": "if you liked the first one, you'll like this one!!"
    },
    {
      "rating": "5/5",
      "review": "Great story, excellent interplay between the brothers."
    },
    {
      "rating": "5/5",
      "review": "Exciting with a great story line"
    },
    {
      "rating": "5/5",
      "review": "GREAT MOVIE!! WE BOTH LOVE THE ACTION SCENES! Awesome & Something to make you think. Soo sad that people will kill children to hide their wrong indiscretionsjust sad that almost made me cry. Now what if no one was on to them? They would have gotten away with it smh smh."
    },
    {
      "rating": "4/5",
      "review": "Good story, good pace"
    },
    {
      "rating": "5/5",
      "review": "funny and the story was interesting. better than the first one!"
    },
    {
      "rating": "4/5",
      "review": "Excellent movie. Kept you engaged right from the first scene."
    },
    {
      "rating": "5/5",
      "review": "Loved ALL of it, the story, cast & chemistry!!!"
    },
    {
      "rating": "1.5/5",
      "review": "I like one better. It was hard to follow."
    },
    {
      "rating": "5/5",
      "review": "loved the depth of the story line, excellent exciting and funny segments too. fast moving and great acting by all!!"
    },
    {
      "rating": "4/5",
      "review": "I liked the character development and the plot. Contained necessary violence. Ben Affleck and his brother did an outstanding job and at the end you had the feeling that they could finally be friends. Line dancing scenes were great!"
    },
    {
      "rating": "5/5",
      "review": "Great combination of action and comedy!"
    },
    {
      "rating": "4/5",
      "review": "I wanted more debits and credits, but solid action."
    },
    {
      "rating": "5/5",
      "review": "The plot and acting is AMAZING! Cant wait for the 3rd"
    },
    {
      "rating": "5/5",
      "review": "If you liked the first one, this one is a must see, will look forward to the third!"
    },
    {
      "rating": "5/5",
      "review": "Loved!! Great action and love seeing more of the brothers interactions."
    },
    {
      "rating": "2.5/5",
      "review": "Fun action flick with a story line that is a bit hard to swallow. Not sure when the Accountant acquired a periodic accent and odd speech pattern. It’s as if Ben A. Watched Rainman between Account one and two to make his character seem more on the spectrum."
    },
    {
      "rating": "5/5",
      "review": "It was a great movie start to finish filled in the gaps of the last movie to this movie left nothing to the imagination was absolutely hilarious. John Bernthal may have opened up a new realm of acting much like Arnold Schwarzenegger when he did twins and kindergarten cop."
    },
    {
      "rating": "5/5",
      "review": "Better than the first one, it’s why you go to the movies!"
    },
    {
      "rating": "2/5",
      "review": "I liked the first film but this fell flat.. we're they trying to make a comedy here? Very strange film."
    },
    {
      "rating": "4/5",
      "review": "Enjoyed the first one and this was along the same vein. Nice to see the interplay between brothers."
    },
    {
      "rating": "5/5",
      "review": "It was greeted! Action, the right amount of comedy! Overall a great show"
    },
    {
      "rating": "3.5/5",
      "review": "More of the same and in this case that isn’t a bad thing."
    },
    {
      "rating": "5/5",
      "review": "Enjoyed watching this entertaining movie."
    },
    {
      "rating": "4/5",
      "review": "Believe it or not this movie is better than the first one. I definitely recommend seeing it."
    },
    {
      "rating": "4.5/5",
      "review": "Good action film as a continuation type sequel. The brothers have good chemistry with the story. Still a lot of shooting violence that I prefer to be scaled down."
    },
    {
      "rating": "5/5",
      "review": "Got started much quicker than the first one"
    },
    {
      "rating": "4.5/5",
      "review": "Great story! Great action! Best gory feel-good movie this yearWay to go Ben Affleck!"
    },
    {
      "rating": "5/5",
      "review": "Action packed movie with a great story line!"
    },
    {
      "rating": "5/5",
      "review": "I love this story and the characters as presented. Loved the first film, especially the locales in Illinois and JK Simmons is great!! Hope their working on The Accountant 3, got to be a trilogy!!!"
    },
    {
      "rating": "0.5/5",
      "review": "I created an account solely to share my disdain for this movie. Worst thing I’ve ever seen."
    },
    {
      "rating": "1.5/5",
      "review": "In this sequel to the 2016 action thriller \"The Accountant,\" the opening scene, thanks in large part to the performance of the great J.K. Simmons, is intriguing; unfortunately, it is all downhill from there. A dubious plot where no less than - get this! - a deputy director of FinCEN (Financial Crimes Enforcement Network) played by Cynthia Addai-Robinson appears to blow off all of her high-level responsibilities to personally pursue a case that normally would be relegated to the inbox of the LAPD, and in doing so brings in Christian Wolff (Ben Afleck), AKA \"The Accountant!\" This autistically compulsive genius, who's not afraid to break some bones, in turn recruits his shady brother, Braxton (Jon Bernthal) who genuinely enjoys inflicting physical pain, including shooting people. And while Braxton and brother Christian have a strained relationship, Braxton doesn't think twice about dropping everything at a moments notice and bolting Berlin to join his pain-in-the-ass autistic brother on the west coast. Unfortunately, the movie morphs into a bad crime-action version of \"Rain Man.\" Chrsitian & Braxton struggle to reconnect as they pursue the bad guys - a human trafficking mob and a shadowy female assassin; but no chemistry ever develops between the characters. Attempts at humor come off as lame. One of the biggest problems is Afleck is terribly miscast as the autistic Christian: he isn't interesting; just boring and bland. But I guess that can be said of most accountants (just kidding! :D )"
    },
    {
      "rating": "4/5",
      "review": "It's an Affleck & Berthal Classic. This pretty much fixes all the fundamental problems the first one had. Jumpy editing, very scattered weak script, wooden acting, and a very sloppy/shaky first half. All of that is gone here. Replaced with a focused script that is significantly stronger, better execution across the board and good chemistry between the two leads. It's like a quasi buddy cop mixed with a serious crime thriller. This has almost nothing to do with accounting or the crporate world at all. It's such a stark change of subject matter with the only recurring theme of mental health & autism. The pacing is really good here and everything else is solid. It does have problems with it can feel like two seperate films sometimes. The character development is well done and the moments of the two leads together are the strongest and best scenes but in the end it doesn't tie consistently with the crime/child rescue/drug cartel/Hitwoman plot. The Hitwoman is really cool and such an awesome idea. I wish it would've focused more on her sometimes. Such a cool character. The fights in this are just as good if not slightly better than the first also. This also is very much a crowd pleaser as well. So it wears multiple hats and can have trouble with tying it all together which gives it a slightly bloated feel. But the direction is pretty good here and the fact everything is much more consistent here helps so much and one can easily look past the flaws with this. Anyone who is a fan of the first, the director, any actors in this, or action/crime thrillers should check this out."
    },
    {
      "rating": "5/5",
      "review": "That was one of the most entertaining movies I have seen in a long time. Ben Affleck is a major talent. Jon Bernthal played a tremendous role across from Affleck. Action packed!"
    },
    {
      "rating": "5/5",
      "review": "Must watch. My wife and I thought it was hilarious and filled with action."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie and story. The angles and the action of the movie is just what it was expected."
    },
    {
      "rating": "5/5",
      "review": "Excellent film. Lots of action and comedy."
    },
    {
      "rating": "5/5",
      "review": "Awesome movie..just as good as the first one"
    },
    {
      "rating": "5/5",
      "review": "Great movie! Just like the first. Can’t wait for the next one."
    },
    {
      "rating": "5/5",
      "review": "Excellent, wanted more"
    },
    {
      "rating": "5/5",
      "review": "I loooved this movie and it absolutely mind blowing"
    },
    {
      "rating": "4/5",
      "review": "Great follow up the the original."
    },
    {
      "rating": "2/5",
      "review": "Loved the first, this sequel fell flat. Affleck turned in a half hearted, blunt force performance that failed to recreate the charm of his original character. The story was nonsensical, the characters flimsy, but worst of all for a movie like this - the big action finale had the brothers do a poor imitation of Rambo - standing out in the open, gunning down wave after wave of helpless bad guys while barely taking a scratch."
    },
    {
      "rating": "5/5",
      "review": "Great movie. I hope they make a 3!! Great action and story"
    },
    {
      "rating": "2.5/5",
      "review": "I should not have selected this movie. The violence and bloody imagery was too much for me. Also, I could not understand the plot. I could not understood who was whom. My mistake not a movie for a senior citizen."
    },
    {
      "rating": "5/5",
      "review": "Funny, full of action, endearing relationships with brothers and sister."
    },
    {
      "rating": "5/5",
      "review": "Movie did not disappoint. Action and some funny parts. Also liked the ending."
    },
    {
      "rating": "5/5",
      "review": "10 out of 10, can’t wait for number 3 🔥🔥🔥🔥🔥🔥"
    },
    {
      "rating": "4/5",
      "review": "Excellent as Accountants number one movie."
    },
    {
      "rating": "4/5",
      "review": "Yeah it was pretty good. Def not boring."
    },
    {
      "rating": "5/5",
      "review": "Great action movie, story line, funny as well. Hope they come out with another movie!!"
    },
    {
      "rating": "4.5/5",
      "review": "Thoroughly enjoyed The Accountant 2. It was fast paced from the get-go. A great combo of action intermixed with humor and a plot that kept you thinking. Ben Affleck did a great job."
    },
    {
      "rating": "4/5",
      "review": "Not as good as the first but like the characters. Glad Braxton has been fleshed out a little."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie . Liked the connection being shown with Chris and Braxton"
    },
    {
      "rating": "4/5",
      "review": "Language was a bit much, but the movie overall was good"
    },
    {
      "rating": "5/5",
      "review": "Excellent action movie. As good or better then the original."
    },
    {
      "rating": "5/5",
      "review": "The chemistry between the brothers eas awesome. and the intricacies of the plot was engaging and dynamic!"
    },
    {
      "rating": "5/5",
      "review": "This movie is the perfect mix of funny plus terror."
    },
    {
      "rating": "5/5",
      "review": "Action packed, humorous, had my attention from the beginning to end of movie and worth every dollar amount!"
    },
    {
      "rating": "4/5",
      "review": "Predictable ending and very gory. But the acting was outstanding"
    },
    {
      "rating": "5/5",
      "review": "It was a awesome movie truly it was"
    },
    {
      "rating": "2.5/5",
      "review": "The director tried too hard to capitalize on the characters personality traits that made them so likable in the first movie, developing them enough to create a discernible disconnect between the two movies. Tactically, a complete failure in the finale with an unrealistic frontal assault (highlighting the difference between past and present), including a rapid fire double-tap from a bolt action rifle. The shooter may not have missed, but the movie sure did."
    },
    {
      "rating": "3.5/5",
      "review": "Lots of excitement and action. I enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "It is a movie you must follow closely which I like."
    },
    {
      "rating": "5/5",
      "review": "So good, absolute crazy action so glad i saw it in theaters"
    },
    {
      "rating": "4.5/5",
      "review": "I enjoyed how Ben Affleck continued the strength of his character even moreso..very convincing. I enjoyed the humor between the brothers...both great performances."
    },
    {
      "rating": "2/5",
      "review": "Movie didn't have the same level of back story. Instead tried to play off violence alone."
    },
    {
      "rating": "5/5",
      "review": "I think this movie is better than part 1."
    },
    {
      "rating": "5/5",
      "review": "The Accountant 2 is back and better than ever! Ben Affleck and Jon Bernthal make a fantastic duo with great chemistry. The film is action-packed, emotional, and surprisingly funny (yes, theres dancing ). Dont miss it! Im already looking forward to Accountant 3!"
    },
    {
      "rating": "4.5/5",
      "review": "Great sequel to the original movie! Very good story!"
    },
    {
      "rating": "2/5",
      "review": "The casting was horrible. The woman goes from being hispanic to asian and the brother has no resemblance. Story line good. Action was great."
    },
    {
      "rating": "4/5",
      "review": "Surprisingly really enjoyed this movie. It’s a put your brain on sleep mode kind of movie but it was funny with good action and good chemistry between the 2 brothers"
    }
  ]
}