{
  "movie_name": "Drop",
  "reviews": [
    {
      "rating": "3.5/5",
      "review": "A fun, simple thriller with a decent enough twist for most audiences. If the trailer caught your attention, check it out"
    },
    {
      "rating": "3.5/5",
      "review": "This movie is laughably goofy; but it is still a fun watch!"
    },
    {
      "rating": "4/5",
      "review": "Drop provides a solid amount of suspense, especially given that pretty much the entire movie takes place in a single room. With a nice touch of modern technology, this thriller is well worth checking out."
    },
    {
      "rating": "4/5",
      "review": "Drop was entertaining. Kept a good pace. Well produced from the music, audio, filming, editing. Great acting for what this is. The main characters had real chemistry. The villian was sharp and annoying. The dialogue was believable. You know where it is heading but then there were little twists. Some said there was overacting but I think that is how it would seem if you were sitting in the position of the main characters. it was fitting. She was a mom having a surreal experience. Not sure you should see it in the theater. Stream it."
    },
    {
      "rating": "0.5/5",
      "review": "Only ever written a few film reviews before, but just felt I had to for this. Possibly the worse film I have ever watched through. Literally stand out bad. Bad acting, terrible suspense, naff script, beyond cheesy, terrible casting. It almost feels it must be so hard to get it this wrong. I’ve lost 90 minutes of my life but it was so bad I had to finish. We were laughing at the semi serious bits. And then the reviews - from critics of serious journals. I’ll remember it ok but for all the wrong reasons."
    },
    {
      "rating": "2/5",
      "review": "Good concept then it flopped"
    },
    {
      "rating": "3.5/5",
      "review": "There was a point where I got really, really, really angry with this movie. I was mad that there was no answer for the woman who is in the predicament."
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good thriller. Had quite a few twists and turns that were near impossible to peg down, it just could’ve been executed better. Good film overall, though."
    },
    {
      "rating": "2.5/5",
      "review": "Setup was really good and it turns into a cliche-fest after the climax. So much promise"
    },
    {
      "rating": "2/5",
      "review": "Honestly super weird and slow had potential but then it was just bad"
    },
    {
      "rating": "1/5",
      "review": "So, so, SO stupid. Like fingernails on chalkboard."
    },
    {
      "rating": "3.5/5",
      "review": "Keeps you on your toes the whole movie. I had low expectations, but it ended up being a fun watch."
    },
    {
      "rating": "1/5",
      "review": "Getting rescued by a lady isn't on any dudes romantic date bingo card"
    },
    {
      "rating": "1/5",
      "review": "Avoid if you are at all into decent movies!"
    },
    {
      "rating": "0.5/5",
      "review": "Painful to watch.. ..."
    },
    {
      "rating": "4/5",
      "review": "While Christopher Landon’s ‘Drop’ is not an instant classic, it ticks all the boxes of a suspenseful thriller that, like many of Blumhouse’s projects, carries enough ingenuity and tension to justify its feature length and provide a surely entertaining ride for its audience. Some creative choices don’t always fit, and the film fails to capitalise on some of its most successful junctures. Despite this, between the pieces that fit and the ones that don’t, ‘Drop’ keeps itself afloat as an effective mix of cautionary tale and whodunnit that the modern film era likely hasn’t seen the last of. It’s clear from the opening minutes that Landon recognises the necessity of realistic and relatable protagonists in order to fulfill the film's role as a warning against the petrifying realities that can unfold under the misuse of modern technology. The rising action and climax explore the increasing psychological torment of a mother facing the loss of her son while the falling action and resolution are a display of the lengths she will go to in order to save him. Meghann Fahy’s ability to balance this excursion of fear and rage with adolescent nervousness before a first date shows a talented acting range and ability to convey the magnitude of such a terrifying situation. This is matched by Brandon Skelnar’s charisma to importantly sell the impossible situation that the protagonists are sharing. The supporting characters are memorable at times, and encapsulate underlying themes presented by the writers, surrounding the struggles of online dating and chauvinism. Beyond this, these additions act merely as fuel to ravel up the mystery behind ‘Lets_Play’ and ultimately give ‘Drop’ the legs to cross the finish line. One of the film's less successful areas is it’s stylistic choices, especially surrounding the divulgence of Violet’s torment. While the use of close ups and dolly zooms is effective in capturing isolation and fear, this idea isn’t capitalised on and is ultimately drowned out by attempts to create an unnecessary edge for an already competent concept. These misfires come in the form of large message subtitles that feel more like a parade of visual effects that were invented too many years ago to impress than a pivotal or even fitting piece in the puzzle crafted by the writers. Another unfortunate component is the falling action of the film's plot. Throughout the opening and rising action Landon expertly handles both sensitive and affable topics with care, including themes of suicide and abuse as well as the awkward yet thrilling nuances of a first date. These displays of attention and regard are tethered by the unfeasable yet predictable ending that sees two unarmed and injured women take down a trained killer with help from a child and the power of will. While this resolution is satisfying to the virtuous audience member with an understandable emotional connection to the family, who are crafted into likeable protagonists, it’s an unrealistic portrayal of a home break in that deteriorates the admirable work of the director to set up a pragmatic environment for his love interests to blossom and his leading lady to portray true trepidation. Between the experience of Fahy and Skelner, the contemporary awareness of Jillian Jacob’s writing and the brittle yet ultimately adept direction of Christopher Landon, ‘Drop’ works as an effective thriller that draws suspense throughout. To audience members who look past the occasional declamatory techniques, and accept the happy ever after in turn of a conclusive cautionary tale, the film will surely entertain right up until the final Digi-Drop."
    },
    {
      "rating": "3.5/5",
      "review": "Very typical mystery thriller hostage scenario. Acting was ok, story was somewhat believable, and the ending was decent. Think the biggest downside was that the movie was rather predictable and though at times it strayed from expectations it was obvious who was involved. Lets just say me and my friend pegged the people involved immediately when they came on screen, and though there were some doubts, in the end sure enough we were right."
    },
    {
      "rating": "3.5/5",
      "review": "I barely when remember seeing this but I do remember having a fun time"
    },
    {
      "rating": "3.5/5",
      "review": "It was surprisingly good. Felt a bit low budget, could've been much better but I enjoyed the intensity anyhow. The cast was good, it was also a bit predictable but still exciting."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie Very entertaining. The twists throughout the film were great. Recommended. Excelente película y muy entretenida. Los giros de tuerca durante toda la película fueron lo mejor. Recomendada"
    },
    {
      "rating": "1.5/5",
      "review": "I knew this movie was over-advertised. I knew that it probably wasn't a good sign. I knew that the ratings told a different story. This movie has like two locations total and feels like a Netflix movie. No."
    },
    {
      "rating": "0.5/5",
      "review": "This hardly can be any worse and any more cliché."
    },
    {
      "rating": "5/5",
      "review": "Had me guessing the until the very end!"
    },
    {
      "rating": "1/5",
      "review": "So bad it wasn't even funny."
    },
    {
      "rating": "5/5",
      "review": "I love the PG-13 content."
    },
    {
      "rating": "2/5",
      "review": "Beginning was great.. the ending spoiled everything."
    },
    {
      "rating": "4/5",
      "review": "It was a amazing movie!"
    },
    {
      "rating": "1.5/5",
      "review": "Super Cheesy, bad acting, and a lot of dialogue. Realistically her date Henry would have walked out on her not far into the date. Henry shot in the abdomen pulls her back up from the broken window? Like come on..... Her Sister is shot in the shoulder and her first words to Violet are: \"How was your date?\" Cringe forced humour."
    },
    {
      "rating": "0.5/5",
      "review": "For ONCE write a female character that has a single brain cell. There were many many many many many obvious ways to get help and she took none of them. She could have told her date as soon as he said check the cameras, she could have singalled 9-1-1 with her fingers, she could have destroyed the cameras she found, she could have asked why he was doing this, used someone else's phone to text her sister. I could write a book with the obvious was she could have gotten out of this. Women aren't that dumb. But this writer is."
    },
    {
      "rating": "3/5",
      "review": "A good movie until the ending."
    },
    {
      "rating": "5/5",
      "review": "Entertaining. If you’re tired of searching for something to watch, it’ll fill that gap."
    },
    {
      "rating": "0.5/5",
      "review": "This is the worst movie I have ever started, I couldn't finish it, I don't understand how it has so many good reviews."
    },
    {
      "rating": "3.5/5",
      "review": "Drop is a film that delivers on its promise: showcasing a case of online persuasion aimed at committing crimes. The concept and execution are great, but it's not really my kind of movie. It spends over an hour just going back and forth with message exchanges while trying to develop secondary characters. In short, it's a good film, but not one I'd feel like watching again."
    },
    {
      "rating": "2/5",
      "review": "Suffers from sloppy pacing and ill-conceived attempts at humour at the wrong times, and the ending is pure pulp. Worth watching once but that's about it..."
    },
    {
      "rating": "3.5/5",
      "review": "I mean single mom trying to get out there and date That's cool although I if I was that guy I would have left a long time ago It was just too much craziness going on and weird stuff so yeah that would have been too much for me as a man bro got shot but hey he's getting a second date 🤣 This suspense was really good though but I kind of figured out who the guy was before the reveal but the way he died was insane the director did a great job with the whole premise it's kind of hard to keep people engaged you know a one setting type of movie so not bad honestly."
    },
    {
      "rating": "4/5",
      "review": "Very entertaining. Keeps you on the edge."
    },
    {
      "rating": "0.5/5",
      "review": "they should congratulate themselves for being the worst movie i’ve ever seen"
    },
    {
      "rating": "3/5",
      "review": "Nothing much new here, but taut and delivers, except for the shark jump throw-them-around-the-room-and-kick-them-18-times-when-they're-down action tropes, which lessen the movie considerably. With a bit of original action it would have been four stars."
    },
    {
      "rating": "4/5",
      "review": "This movie is definitely worth watching, though it is more of a nailbiter than a scary one. There are some elements of suspending reality for the sake of it being a movie, but not as bad as it could've been. The whole thing revolves around DigiDrop not Airdrop probably so Apple doesn't sue them, but they do talk about Airdrop in the movie. Anyway, it was interesting if not completely original, visually appealing, the acting was believable and there were few complaints. Not the deepest movie you'll ever see, but we knew that going into it. Would recommend!"
    },
    {
      "rating": "2/5",
      "review": "Okay, not a horrible movie…until the end. It’s like they didn’t know how to end it and were sitting around drinking shots and came up with something lame. Ruined it."
    },
    {
      "rating": "3.5/5",
      "review": "Drop is suspenseful and a super fun watch for film fans"
    },
    {
      "rating": "2/5",
      "review": "Such a pretty cast, but oof! This should have been a direct to the internet streamer."
    },
    {
      "rating": "5/5",
      "review": "It was a fun movie nothing more I can say and the acting was really good."
    },
    {
      "rating": "5/5",
      "review": "If you want suspense and then laugh until you cry this is the movie! Fantastic! 90s throwback"
    },
    {
      "rating": "1/5",
      "review": "The story and film are great ...until...you find out who dunnit, and then it turns into an absolutely ridiculous 1980's horror film, with special effects equivalent to Friday 13th."
    },
    {
      "rating": "2.5/5",
      "review": "How does this have such a high rating on RT it’s a really bad movie!? I will admit it makes you wanna stick around to see how it ends but other than that the actors all cringy bad. I think society is really lowering its standards on films."
    },
    {
      "rating": "2/5",
      "review": "Super dumb with enough holes in the plot to drive a Hummer through. The acting is fine, but it's hard to take this film seriously when the plot points are so ridiculous and illogical. It's a pretty dry season right now for films, and if I had other choices, I would have turned this one off."
    },
    {
      "rating": "3/5",
      "review": "With a watch! I enjoyed it."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible. Don't watch it."
    },
    {
      "rating": "4/5",
      "review": "This movie was a blast. Modern Hitchcockian thriller that mostly nailed it."
    },
    {
      "rating": "5/5",
      "review": "Strong but believable woman lead with a great lead actor to boot. Grabs you at once with the plot and does not let go until the credits."
    },
    {
      "rating": "0.5/5",
      "review": "It was good until it made me want to scratch my eyes out."
    },
    {
      "rating": "3/5",
      "review": "Entirely ok. The plot was more realistic than the possibility of someone staying on that date more than 10 minutes though"
    },
    {
      "rating": "5/5",
      "review": "Thrilling on the edge of my seat!"
    },
    {
      "rating": "5/5",
      "review": "Oh my gosh, so many scenes in this movie sender chills down my spine. Absolutely loved this movie, great underrated thriller."
    },
    {
      "rating": "3/5",
      "review": "Drop was fun just to sit back and watch. The idea of the movie was fun but a lot of the screens was kinda dumb and boring. And some things god you questioning how it happen."
    },
    {
      "rating": "4/5",
      "review": "Loved the movie! Characters were great! Great suspense. Had emotional scenes. Great thrills towards the end too! My favourite Horror/Thriller movie of 2025 so far!"
    },
    {
      "rating": "4.5/5",
      "review": "I liked the movie a lot. So much suspense and great acting. It kept me on the edge of my seat almost all through the movie."
    },
    {
      "rating": "2/5",
      "review": "Felt like I was watching a Lifetime thriller."
    },
    {
      "rating": "2/5",
      "review": "I'm sure some will like this movie. But, I would not call them cinephiles. It was ok, but the ending completely ruined it for me. I absolutely despise rom-com style endings. And, that's all this was... a rom-com disguised as a thriller."
    },
    {
      "rating": "5/5",
      "review": "Perfect run time. Compelling story. Well acted."
    },
    {
      "rating": "1/5",
      "review": "Truly atrocious. The plot is so absurd it insults all intelligence. . None of it is remotely believeable. It fails both as a comedy and thriller. A wretched waste of time. Avoid."
    },
    {
      "rating": "2.5/5",
      "review": "I laughed out loud several times. It's not a comedy, but it is very much unintentionally funny, so it has that going for it."
    },
    {
      "rating": "4/5",
      "review": "Keeps the suspense well the whole way through and keeps you guessing. Well acted, good script and a tense storyline make this a fantastic watch."
    },
    {
      "rating": "4/5",
      "review": "All hell brakes loose in the third act but overall very good"
    },
    {
      "rating": "2.5/5",
      "review": "Went in with no expectations. Wife wanted to check it out i say wait till it comes out to stream."
    },
    {
      "rating": "3/5",
      "review": "Ton of fun! Two leads were really good with great chemisrty"
    },
    {
      "rating": "4/5",
      "review": "Everyone's a suspect. Drop is a 2025 American thriller film directed by Christopher Landon 📱 An entertaining and classy game of cat and mouse, even if the ending is a little unrealistic and contrived… It’s very good! 😀 I’d definitely recommend it 👍🏼 Violet, a widowed mother on her first date in years, arrives at an upscale restaurant where she is relieved that her date, Henry, is more charming and handsome than she expected. But their chemistry begins to curdle as Violet begins being irritated and then terrorized by a series of anonymous drops to her phone."
    },
    {
      "rating": "4.5/5",
      "review": "A killer idea. A fun movie-even though really only 2 settings. It didn’t take away. The cast and plot were great!"
    },
    {
      "rating": "5/5",
      "review": "This was a very suspenseful movie and it kept you guessing all the time as to who the villain was but most of the action came toward the end of the movie which was a little disappointing but other than that it was pretty good I recommend you go and see it."
    },
    {
      "rating": "3/5",
      "review": "a bit annoying at times"
    },
    {
      "rating": "4/5",
      "review": "A very good edge of the seat movie. Had a very good time with it. It keeps you hooked till the end. It's kind of like Liam Neeson's 2014 movie Non Stop . Need to see more movies like these as I enjoy them a lot."
    },
    {
      "rating": "3.5/5",
      "review": "This crazy date movie was great. Meghann Fahy, Brandon Sklenar, Violett Beane, Reed Diamond, Gabrielle Ryan, and the rest of the cast did a great job in this movie. The plot of the movie was dramatic and thrilling. It's about following the rules in order to protect your family even if you have to kill someone. If you haven't seen this movie yet, check it out sometime. It's worth watching."
    },
    {
      "rating": "3.5/5",
      "review": "Predictable, but stylish and fun."
    },
    {
      "rating": "1/5",
      "review": "It's an insult to mention Hitchcock and this film in the same breath."
    },
    {
      "rating": "0.5/5",
      "review": "What can I say. TV melodrama at its very worst. Dull, badly edited opening, nonsense ending, cringe dialogue, and pathetic attempts at humour. Awful."
    },
    {
      "rating": "4/5",
      "review": "Quite suspenseful albeit everything took place almost in one resturant. Though there are a couple plotholes but excusable given the great thrill at the end."
    },
    {
      "rating": "2/5",
      "review": "Reminded me Wes Craven's Red eye but this one is just meh. First half is gripping but second half fumbles hard."
    },
    {
      "rating": "4/5",
      "review": "Bel film e buona recitazione. Non è stato male vedere questo film , il tempo è volato ed è carino da vedere con gli altri. Finale un po’ surreale ( per questo do 4/5) ma molto bello."
    },
    {
      "rating": "3/5",
      "review": "Decent movie but I feel like this concept has been done so many times before that it makes it super hard for any other movie like this, including this one to be interesting. The classic kidnap your family and you have to do something against your will or else they die kind of thing, I feel like certain parts of this movie were also dragged on but this was just an okay movie for me, not bad but not great either. 6/10"
    },
    {
      "rating": "1.5/5",
      "review": "It was ok. The ending needed a lot of work. The younger crowd will like it this"
    },
    {
      "rating": "5/5",
      "review": "I dont like horror films in general as the writing is campy and eye rolling. But this overall was well written plot, actions, and behaviors. Only complaint is in a restaurant of that high class dining. You would not have a server that level of cringy unprofessionalism be his \"first night.\" Outside of that and the weird hesitancy of the gunman. Solid film highly enjoyable"
    },
    {
      "rating": "5/5",
      "review": "Great plot twist! No slow moments at all"
    },
    {
      "rating": "4/5",
      "review": "the triller that keeps you guessing"
    },
    {
      "rating": "1.5/5",
      "review": "Really liked it until the last 10 minutes when it suddenly turns into yet another bad, lazily written action movie. It's literally like a Writers' Strike happened just before they finished the script, and couldn't be arsed when they returned. Don't waste your time."
    },
    {
      "rating": "1/5",
      "review": "This movie was lowkey horrid and exactly how I thought it would be like, the whole movie was bad ngl but the ending was even worse and felt like it was rushed. Would NEVER recommend this mid movie."
    },
    {
      "rating": "2/5",
      "review": "Was intriguing and different until the last quarter of a hour where they must have changed the director to the one that did the sharknado films would have been a 3 to 4 star if not for the last quarter of an hour."
    },
    {
      "rating": "1.5/5",
      "review": "Though inventive, the anxiety is mostly achieved by overstretching ideas, and the editing is a how-not-to course all of it's own."
    },
    {
      "rating": "4/5",
      "review": "There’s been similar things done but it still feels fresh. Entertaining and good acting."
    },
    {
      "rating": "4/5",
      "review": "Actually a pretty decent action movie. Suspenseful. Would recommend"
    },
    {
      "rating": "1.5/5",
      "review": "Everything was ok until the fake ending. Tell me, why does someone have to stand in front of a gun to save someone else? Hint: I've been watching the same movie for 50 years, the only constant is that it is American."
    },
    {
      "rating": "3.5/5",
      "review": "Entertaining. Meghann Fahy is not only absolutely stunning to look at but she’s a great actress too. The movie was fun. Will watch again"
    },
    {
      "rating": "0.5/5",
      "review": "i am starting to doubt rottentomato for being the movie having high scores. i mean, 1 random epi of family guy is 10x better than this time wasted movie."
    },
    {
      "rating": "1.5/5",
      "review": "Poor throughout. Terrible, ridiculously far fetched plot which aims for tension but it's more if a joke. At least it's under 90 minutes."
    },
    {
      "rating": "1/5",
      "review": "What? Why the high score. This movie is awful"
    },
    {
      "rating": "4/5",
      "review": "Yo soy un gran fanático de Freaky y Happy Death Day, y esta es una clara muestra de que Cristopher Landon se está superando a sí mismo, tiene visuales tan frescos que no podía evitar sentirme más inmerso cada vez más dentro de la película. La trama puede parecer algo simple, pero las decisiones hechas para llevar a cabo esta historia se me hicieron muy bien pensadas para darle una vuelta a este género. Y Meghann Fahy es increíble."
    },
    {
      "rating": "0.5/5",
      "review": "This is a really really bad movie where it can be sober with one solution TURN AIRDROP MODE OFF FOR EVERYONE!!!!!! There your movie is done. Also, props to her draw for staying around so much after she kept leaving. That must have been some damn good kiss she gave him."
    },
    {
      "rating": "4/5",
      "review": "Good movie. Lots of suspense and fun."
    },
    {
      "rating": "2.5/5",
      "review": "Red Eye did it so much better. Not a bad movie, but may have had more fun poking holes in it than watching it."
    },
    {
      "rating": "2/5",
      "review": "Fun if you can get passed how unbelievable the premise is."
    },
    {
      "rating": "0.5/5",
      "review": "I'm not sure what surprised me the most about this film, the sheer incompetence of being able to put together a compelling and somewhat believable story, or the fact that it got better critic reviews than the new snow white film. I went to see this film as it was on my list of films to watch if nothing else is in because I have a card that lets me watch as many films as I want for a certain amount per month. And honestly I wish I hadn't seen this film or given it the time of day. Now, could this film have been good as a concept? Sure. But does it fall flat on its face for being believable and actually putting forward any sense of suspense? Yes! Honestly the only time I got any sense of suspense was during the last part of the film where I actively groaned when she's in the hospital and gets another message. Why did I groan? Because I thought they were leaving it open for a sequel and thank the lord they didn't. There were also problems regarding some of the technical aspects with this film. How many times have Mythbusters shown you don't get sucked out of a window just because there's a pressure differential? Not that there would have been a pressure differential at that altitude, not to mention there was already a hole in the window allowing for the pressure to equalise. All I can hope for is this review helps to save others from this film that if I were able to give 0 stars I would."
    },
    {
      "rating": "5/5",
      "review": "Maybe I liked it because I had very low expectations, but Drop truly deserves 5 stars. It’s one of those films that keeps you glued to the screen until the very end. It doesn’t matter if some scenes are a bit too cheesy or others borderline cringe—somehow, it all works. A big round of applause for the soundtrack, which makes everything even more spectacular."
    },
    {
      "rating": "3/5",
      "review": "So Carry-On, but on a date. I don't want to bad mouth the child actor who played her son, but he probably should stay in school."
    },
    {
      "rating": "1/5",
      "review": "Probably one of the worst movies I’ve ever seen. Zero story. Full of inconsistencies and just plain stupid."
    },
    {
      "rating": "2.5/5",
      "review": "Unbelievably stupid storyline. Actors were amazing though."
    },
    {
      "rating": "3.5/5",
      "review": "It was fine but that's it. Fine. So predictable. The whole shot glass thing was dumb. IYKYK."
    },
    {
      "rating": "4/5",
      "review": "Suspensful and thrilling, one of the more good Blumhouse thrillers."
    },
    {
      "rating": "4/5",
      "review": "Veers into the ridiculous in the last twenty minutes, but otherwise a tight and fun little thriller."
    },
    {
      "rating": "4/5",
      "review": "Wow this movie had my mine going in circles. This really was a huge mystery. The acting, storyline, characters, and the villain was very good."
    },
    {
      "rating": "3/5",
      "review": "First time I've seen the very appealing actress Meghann Fahy , but she will need a better project than this to propel her to the next level of stardom, because DROP is more like a made-for-TV-movie than a real movie. Variations of this type of story have already been done. SPOILER: Can a shattered window in a skyscraper really cause the same kind of suction/air-pressure change that would occur in an airliner? This film also features one of the most annoying waiters in the history of cinema."
    },
    {
      "rating": "3.5/5",
      "review": "With remarkable performances and a tight script, Drop is a fresh return to the classic psychological and tense thrillers."
    },
    {
      "rating": "3.5/5",
      "review": "Drop (2025) is a taut, real-time thriller that blends technological paranoia with raw human emotion. During a seemingly innocent dinner date, Violet receives threatening Airdrop messages that force her into a tense game of survival to save her son and sister. The film thrives on its claustrophobic setting, sharp pacing, and natural dialogue, creating a gripping atmosphere without relying on gimmicks. Director's tight control over space and tension, complemented by polished cinematography and haunting music, keeps the audience on edge throughout. Megan Fahy delivers a compelling, layered performance, capturing both vulnerability and resilience. Despite a slightly underwhelming visual climax, Drop remains a smart, emotionally charged thriller that refreshes the genre with style and precision."
    },
    {
      "rating": "5/5",
      "review": "Brilliant. Most satisfying and suspenseful movie since Hitchcock. Fahey is clearly one of the best actors today. This film is so good I could watch it again."
    },
    {
      "rating": "4/5",
      "review": "Pretty good and the mystery of who was sending the messages was intriguing. Worth the time"
    },
    {
      "rating": "5/5",
      "review": "This was really good. Slow in some places but very suspenseful."
    },
    {
      "rating": "4/5",
      "review": "Although a few moments dragged on, it was suspenseful and had a satisfying finish."
    },
    {
      "rating": "4.5/5",
      "review": "Blumhouse movies never fail to impress. Love the blumhouse lineage of movies! I like the ending in particular for this movie a surprising twist that you dont always expect thats what you can expect from blumhouse. I would watch it again :)"
    },
    {
      "rating": "4/5",
      "review": "This movie might not be a horror movie but is still really intense, the middle of the movie might feel a little bit slow but the end will have you on the edge of your seat. Really good movie and not too complicated."
    },
    {
      "rating": "4/5",
      "review": "Entertaining. Kept me interested the entire time"
    },
    {
      "rating": "0.5/5",
      "review": "Omg I had written a very long review of this terrible, rotten movie and after clicking to post it, pop up said it couldn't be posted, try again. My long review disappeared. A brief summary - Don't watch this garbage movie. You've been warned."
    },
    {
      "rating": "2.5/5",
      "review": "It was a decent idea, but the follow-through was lacking. Could have been a lot better with a few slight changes. Although the camerawork and lighting were top notch, the movie was held back by mediocre acting by the lead actress and a cheesy, unrealistic climax. 'Drop' will leave you asking questions such as these: Q: Why do killers pause for three seconds each time they are about to shoot someone? A: To give someone enough time to sneak up from behind and save the day just in the nick of time! Q: Can a tablecloth support a full-grown human's weight while dangling from a skyscraper? A: Apparently, yes."
    },
    {
      "rating": "4/5",
      "review": "Great movie! Truly thrilling, intriguing, and some good small hints of laughter. Cannot recommend this movie enough, a must watch!"
    },
    {
      "rating": "0.5/5",
      "review": "Dreadful dreck. Terrible plot, terrible pulling of heart strings, totally unrealistic. Please miss"
    },
    {
      "rating": "0.5/5",
      "review": "Was decent background noise until the midpoint of the movie, then it became clear it was written by a woman. Couldn't wait for it to be over found myself skipping through already knowing what would happen next."
    },
    {
      "rating": "5/5",
      "review": "Movie Started with a unusual start. Then bam it took the hell off!!! Def Crazyyyyyyyy"
    },
    {
      "rating": "5/5",
      "review": "Suspenseful and compelling — really dug it."
    },
    {
      "rating": "2/5",
      "review": "Definitely was let down with the movie. It took way too long for the action to kick in and then it was over. Won't be seeing it again"
    },
    {
      "rating": "1.5/5",
      "review": "The lead actors are absolutely adorable and have great chemistry. Unfortunately, the movie itself is pretty bad. The plot is downright ludicrous 😄—nothing really makes sense if you stop to think about it. That said, it’s a very popcorny kind of movie. If you're looking for something fun and totally brainless for a date night, this could actually work. Just don’t go in expecting anything deep or coherent."
    },
    {
      "rating": "4/5",
      "review": "Film that kept me guessing but went a little OTT at the end.. Loved it overall"
    },
    {
      "rating": "5/5",
      "review": "Enthralling yet phenomenal."
    },
    {
      "rating": "2/5",
      "review": "do as i say or your baby dies. do exactly as i say or the bomb goes off. don't slow the bus down under 50 or you all DIE!!! answer this phone immediately or your mother gets murdered. pay the ransom or we set off the nuclear bombs in 40 cities. you make a sound and i'll kill errybody. you get the picture? only this time it includes cell technology and an up to date gov't evil premise. you could watch this."
    },
    {
      "rating": "3/5",
      "review": "Drop, Blumhouse's second major release of 2025, is leagues better than The Woman in the Yard—but still doesn't quite live up to the expectations set by powerhouse predecessors like The Black Phone or M3GAN (both of which, by the way, are getting sequels this year—praise be). My opinion (that you didn’t ask for): Stream it. But before I go any further... Spoiler warning: This review contains spoilers. If you’re spoiler-averse, hit up the two-minute spoiler-free version on my TikTok (@uninvited.reviewer) or Instagram (@uninvited_reviewer). You've been warned. Emmy nominee Meghann Fahy, breakout star of The White Lotus and The Perfect Couple, plays Violet—a widowed mom venturing out on her first date in years. She arrives at a swanky restaurant and is pleasantly surprised that her date, Henry (played by It Ends with Us’ Brandon Sklenar), is actually charming and handsome—two things dating apps rarely deliver. But the date takes a dark turn when Violet starts receiving anonymous, increasingly menacing drops to her phone. She’s told to say nothing and follow instructions—or the hooded figure on her home security camera will kill her young son and the sister babysitting him. Violet must obey every command… or everyone she loves dies. The final instruction? Kill Henry. Little bit of a mood killer. Here’s the thing that bugged me most: this is a good movie. It moves fast—100 minutes, not a second wasted. The characters are relatable, charming, and appropriately evil when called for. But watching it felt oddly familiar. Then it hit me: this is basically Red Eye (2005) with a modern tech twist. When I realized it, I almost threw my arms up Charlie Brown-style and yelled, “ARGH!” in the middle of the theater. Look, I love a sequel. But I don’t love recycling. At least not in movie plots. (Please do recycle your junk and help save the planet.) Fahy does a fantastic job as Violet, shifting convincingly between emotional vulnerability and sheer survival-mode rage as she’s forced to consider killing her date to save her family. The stakes are chilling, and the home surveillance angle is a terrifying reminder that even smart tech can’t outsmart a truly bad guy. Sklenar, as Henry, plays possibly the nicest, most patient man in cinematic history. As Violet’s behavior slides from charming to “Should I call a psychiatrist?” he sticks around, confused but supportive. Bless him. Honestly, Sklenar needs a hit to distract from the flaming rom-com wreckage that is It Ends With Us. (He and Jenny Slate were the only good parts of that movie, and I will die on that hill.) Unfortunately, while he gives another strong performance here, I’m not convinced this film will get the recognition he deserves. But let’s get back to the movie. The chemistry between Fahy and Sklenar carries this film far, and the casting overall is spot-on. One of the best production decisions? Setting most of the action in a restaurant 60-something floors above ground. The claustrophobic, high-stakes environment adds a ton of tension as Violet scrambles to figure out a way out of this nightmare. She’s a woman backed into a corner—and comes out swinging. Literally. She will kill to protect her family and Henry. In the third act, we finally meet the man behind the phone drops: Richard, played by Reed Diamond. It’s a refreshing twist, especially since so many thrillers opt to keep the antagonist in the shadows. Diamond’s brief but chilling performance is what ultimately bumps this movie from a “skip it” to a “stream it.” The supporting cast is also a highlight: Gabrielle Ryan plays bartender Cara, who quickly picks up that something’s wrong and has a fabulous “If your date sucks, I’ll help you escape” energy. Love a woman who’s got another woman’s back. Jeffery Self plays Matt, an acrophobic waiter working in a restaurant hundreds of feet in the air. He’s awkward, oblivious, and absolutely not who you want serving your table—but in the movie? Total scene-stealer. Final thoughts: The plot is familiar, maybe too familiar—but the strong performances from both leads and a solid supporting cast elevate Drop enough to make it a worthwhile watch. If you’re into suspense and don’t mind a touch of déjà vu, go ahead and stream it. Just maybe not on your first date. unwantedmoviereviews.com"
    },
    {
      "rating": "2.5/5",
      "review": "Comical third act ruined all tension"
    },
    {
      "rating": "5/5",
      "review": "I liked the suspense and the ending."
    },
    {
      "rating": "3/5",
      "review": "It seemed to drag on in a few places. Those moments were not frequent & overall, it was an enjoyable movie."
    },
    {
      "rating": "0.5/5",
      "review": "Cheesy, unrealistic, bad acting, a lot of SMH moments. Had potential, but ultimately failed."
    },
    {
      "rating": "3.5/5",
      "review": "It doesn't go overboard and is clear about its limitations, and with that in mind, its director embarks on a film that lives up to its promise quite well. A decent script that perfectly manages tension, which also takes the time to be a bit reflective about violence and abuse, but which also allows itself to find grace and humor in everyday touches that make it a film that doesn't seek to be too serious, but also not too simplistic. It's a journey that lives up to its director's promise, and with it, it delivers a pleasant pastime that is enjoyable from beginning to end, with a powerful protagonist and an atmosphere that fits perfectly to accentuate the tension. An entertaining, well-made and enjoyable film."
    },
    {
      "rating": "3/5",
      "review": "It was decent but I wouldnt watch it again"
    },
    {
      "rating": "4.5/5",
      "review": "the table cloth holding her up was not realistic"
    },
    {
      "rating": "2/5",
      "review": "blumhouse strikes again, this time in a blumrestaurant. its actually not that bad in any obvious way, but nothing really happens and the tension is lost on a stagnant plot."
    },
    {
      "rating": "0.5/5",
      "review": "BORING ASF would never go see again- absolute asscheeks!!! Literally a Netflix thriller"
    },
    {
      "rating": "4/5",
      "review": "If you’ve seen the trailers, it’s pretty much the movie you expect it to be. I enjoyed it."
    },
    {
      "rating": "1/5",
      "review": "I seriously don't know what movie everyone else watched to leave these high ratings. The movie progresses literally so slowly that you could watch it in double speed with no impact to the dialogue or delivery. Total snoozefest that keeps interrupting itself pointlessly. Save your time and choose a different movie."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie for a rainy afternoon. Good visuals, a little suspense, a couple of plot twists, happy ending."
    },
    {
      "rating": "5/5",
      "review": "Thats was a fun experience."
    },
    {
      "rating": "3/5",
      "review": "The movie started off a bit slow, wasn't bad to watch. Very predictable but wasn't terrible."
    },
    {
      "rating": "4.5/5",
      "review": "Drop is so much fun. Fahy and Sklenar have the chemistry needed to pull of such an outrageously fun concept. The waiter was too annoying to be comic relief and the only bad directorial choice in an otherwise unique thriller."
    },
    {
      "rating": "5/5",
      "review": "Keeps you on the edge of your seat!"
    },
    {
      "rating": "2/5",
      "review": "I'd say it's worth a watch...ish... it's a pretty basic, non-original story that has some twists but otherwise a pretty boring movie with predictable ending."
    },
    {
      "rating": "3/5",
      "review": "Una película decente, digamos que cumple pero se vuelve muy obvia la narrativa y quien es el principal sospechoso a mitad de película, he visto mejores sinceramente, pero por lo menos te entretiene."
    },
    {
      "rating": "3.5/5",
      "review": "Really fun movie. I liked how they keep you on the edge of your seat. Nice suspense and mystery. I thought the cast did a really good job. Enjoyed it."
    },
    {
      "rating": "4/5",
      "review": "A tight, tech-fueled thriller with Hitchcock vibes and meme-age paranoia. Meghann Fahy carries it like a pro. Silly? Sure. But sharp, stylish, and tense to the last ping."
    },
    {
      "rating": "3.5/5",
      "review": "This film is an example of how stellar, charismatic actors & crisp production values can elevate an imperfect script. There is one scene of riveting power where the magnificent Meghann Fahy has a raw, honest conversation which is reciprocated by her date. I was spellbound, mesmerized. Worthwhile exciting film."
    },
    {
      "rating": "5/5",
      "review": "Kept us all engaged !"
    },
    {
      "rating": "4/5",
      "review": "While \"TRAP\" Was CRAP, \"DROP\" Is Not A FLOP I Thoroughly Enjoyed My Experience With This Film. It Does A Fantastic Job Helping You To Understand The Main Character Right Out The Gate, And They Do A Great Job To Develop The Chemistry Between Her & Her Date, Making It Believable Both In Terms Of Them Together And Him Even Staying Despite Suspicious Behavior. The Cast Is Top-Notch & The Camera-Work Works In The Storytelling. The Restaurant Setting Is Absolutely Gorgeous. The Action In The Last Act Is Solid. The Actual \"Drop\" Element Is A Little Sketchy As Anyone Would Likely Just Block The Sender Right Away, But That's A Very Minor Critique . The Only Other One I Had Is Thrown Out After It's Explained Why The Peros Went About Their Plan This Way Rather Than A More Straight Forward Approach, Making It More Believable. The \"Who-Done-It\" Angle Is Solid While Giving You Just Enough Clues But Not Too Many. There Was A Point I Figured Out Who The Peros Was, But I Don't Hold That Against The Movie, I've Just Seen Tons Of These. There Are A Couple Extra Surprise Twists In The Final Act That I Really Enjoyed. Overall, A Solid Entertaining Tense Watch That I May Even Go See Again. I'd Grade This Between An \"A-\" & \"B+\". Between 8.8/10 & A 9/10."
    },
    {
      "rating": "5/5",
      "review": "I thought this was going to be scary so was reluctant to see it since I don’t like scary movies. My sister told me I had to see it and it did not disappoint. Very suspenseful movie. Loved it!!"
    },
    {
      "rating": "3/5",
      "review": "The plot is as full of holes as a sieve, but watchable all the same, mainly because of the two attractive protagonists."
    },
    {
      "rating": "3/5",
      "review": "It was slow and whole movie was pretty much in resturant."
    },
    {
      "rating": "5/5",
      "review": "The movie kept us guessing & the reveal of who was behind it was crazy"
    },
    {
      "rating": "4/5",
      "review": "Good one, gives what it says"
    },
    {
      "rating": "2.5/5",
      "review": "Too slow to start. And then too many drop messages and a likely ending with her drive back to house."
    },
    {
      "rating": "2/5",
      "review": "Good acting made the movie enjoyable for what it was…a popcorn filler. It was fine to pass the time, but that’s true extent of it"
    },
    {
      "rating": "3.5/5",
      "review": "Dragged a little in the beginning and I expected a little more to happen, but overall I enjoyed it in the end."
    },
    {
      "rating": "3.5/5",
      "review": "Was okay. Could’ve waited but it wasn’t terrible"
    },
    {
      "rating": "5/5",
      "review": "the movie keeps you guessing how the heroin will get out of the mess she is in."
    },
    {
      "rating": "2/5",
      "review": "I had a problem with the premise. The main character's (Meghann Fahy) response to most threatening incidents are not believable. She wouldn't do that!"
    },
    {
      "rating": "3/5",
      "review": "Funniest movie EVER."
    },
    {
      "rating": "2/5",
      "review": "Very drawn out. Started dozing off during the movie"
    },
    {
      "rating": "5/5",
      "review": "It was amazing I got scared a few times."
    },
    {
      "rating": "4/5",
      "review": "Good thriller with some interesting technology twists. Reminded me of other similar movies in the past. Some scenes were a bit preposterous and drawn out. Acting was pretty good. The waiter was funny but a little annoying at times. Good for a one time view for me."
    },
    {
      "rating": "3/5",
      "review": "An enjoyable enough film, grateful for 90 minute length. Good performances but for all the talent that work on these films the bleeding obvious in terms of plot is often overlooked. Why would the"
    },
    {
      "rating": "2/5",
      "review": "I can't help to think I've seen this all before. Probably because it was the same as the Jason Bateman movie \"Carry On\". Drop was entertaining enough, but the ending was ridiculous."
    },
    {
      "rating": "5/5",
      "review": "Kept catching me out. The clues were there. We loved in the end."
    },
    {
      "rating": "2/5",
      "review": "Very cheesy and predictable. One of the hardest movies to convince my husband to sit through in order to get our money's worth at the theater."
    },
    {
      "rating": "3/5",
      "review": "Entertaining if contrived as villains go about their work in the most convoluted way possible. A good looking film with some nice performances and genuine intrigue help overcome some cheesy dialogue and an improbable plot. It turned into Home Alone for the last few minutes with a preposterous showdown that caused some groans in the cinema and made it hard to concentrate on the flirtatious final scene."
    },
    {
      "rating": "4/5",
      "review": "Started off way too slow, but when the action picked up!!!!!! Nonstop!"
    },
    {
      "rating": "4/5",
      "review": "Definitely surprised me. I expected a lot of predictability and while there was some, there was actually a storyline that made sense."
    },
    {
      "rating": "2/5",
      "review": "If you want a movie with suspense and not much else. Something you can turn your brain off and just watch this is the one"
    },
    {
      "rating": "3.5/5",
      "review": "Edge of your seat watch, great movie!"
    },
    {
      "rating": "1.5/5",
      "review": "Well, what can I say?!!! The whole story is based on multiple, or should I say, endless ridiculous premises. For anybody who insists on watching it, stop reading here. After the typical light opening, and when it gets to the important part, any sane person would have just switched off the app, before even receiving the first really life threatening messages. But, back home, and remembering that only 18 months ago Hilda was a victim to a fake kidnapping over the phone, when she actually delivered all her jewelry to the criminals in the street, leaving her safe home at 5:30 in the morning, I realized that some folks might not be so clever to react in the correct manner from the first instant onwards. But then, when she shows the first messages to her date, a photographer for the Mayor (and later even someone way beyond this function), and he as well doesn't have the idea of blocking the app, the whole story becomes just dumb. There are soooo many things to complain about this flick, I could fill 5 pages. The worst being the window exploding as if the restaurant would be under pressure like an airplane cabin. Come on, this is beyond idiotic. +++ Not to waste more of my and your time here, it's not a complete bore, but there are surely 10.000 movies better to waste your time than with this one. 3/10!"
    },
    {
      "rating": "5/5",
      "review": "Incredible movie! Suspense all the way! Must see!"
    },
    {
      "rating": "3/5",
      "review": "Sometimes it takes a fancy date for you to realize the “boring dates” are exactly what you both wanted in the first place. Great camera work & use of screen space. Totally get she had to keep her phone on for her kid.. but maybe any kind of use of DND/turning off airdrops would have saved the night. Chalk it up as another 3 star blumhouse thriller."
    },
    {
      "rating": "4/5",
      "review": "If you just go to be entertained and not try to dissect the plot, you will enjoy this movie!"
    },
    {
      "rating": "4.5/5",
      "review": "Liked the unique storyline and guessing who was calling, but it could have used more humorous dialogue"
    },
    {
      "rating": "2.5/5",
      "review": "It can best be described as “iPhone Hitchcock.” a promising concept that allows for an entertaining guessing game in the first half, but the film entirely runs out of steam once the viewer runs out of suspects."
    },
    {
      "rating": "2.5/5",
      "review": "So was her husband dead the whole time or not? Was that her husband at the very end trying to kill everyone in the house? It was hard to tell because her husband, her date, the pianist, the waiter and the killer at the end all-looked-the-same. they all had the same dark brown hair and identical facial hair. It was bizarre. How did the child get his hands on semi automatic gun with the safety off? Was it left in the room and the killer had another? Or did his mom just have that floating around the house and he knew where it was? Why was the Sister straight out of a 70s Kids show? Why was the assassin so bad at his job? If she was a therapist, how was she able to prescribe sertraline, or any drug, to her patients? If the man knew he was poisoned with sertraline and/or fentanyl orally, why wouldn’t he just make himself throw up? BTW it takes a ridiculously long time to die of a sertraline overdose. This movie has been described as Hitchcock in, I don’t know why. Alfred Hitchcock would not have made mistakes like this. This is very made for TV and it’s just not as good as it could have been."
    },
    {
      "rating": "3.5/5",
      "review": "Very nice thriller, but breaks down very fast with an unbelievable ending and not in a good way. The dude from 1923 was cool and playing the same role."
    },
    {
      "rating": "2/5",
      "review": "Drop (2025) had a cool setup and looked great visually, but it just didnt stick the landing for me. The first part pulls you in—theres tension, mystery, and you feel like something big is coming—but then it kind of falls apart. The characters dont really go anywhere, and by the end, I felt like the story had more style than substance. Its not terrible, but it left me wanting a lot more than it gave."
    },
    {
      "rating": "3.5/5",
      "review": "The premise had me sweating from the beginning. I hate/love when the main character does everything \"right\" but can't get themselves out of the horror. I liked the final confrontations too(:"
    },
    {
      "rating": "1/5",
      "review": "This is a dreadful movie. The script is tragically weak and the plot Saran Wrap transparent. Relatively stilted RomCom acting from one dimensional characters. I did enjoy the use of technical plot twists, but nothing could save this movie."
    },
    {
      "rating": "5/5",
      "review": "Wow! Blumhouse does it again what a fantastic thriller"
    },
    {
      "rating": "5/5",
      "review": "Slick and totally entertaining. Lots of suspense and twists."
    },
    {
      "rating": "4/5",
      "review": "Good movie! Would’ve loved more plot but it was good for what it was"
    },
    {
      "rating": "4/5",
      "review": "A unique premise and a great suspenseful ride. I do think some of the oddness she puts this guy through on their first date would have seny a real person packing, but loved the tension of this one and once the climax hit it was an edge of your seat ride. I liked the camera angles and graphics for the texts as well. Really fun flick!"
    },
    {
      "rating": "4/5",
      "review": "A lot better than I expected. Violet was a character who would do the same things as I would if I were in this situation. Overall it was really brilliant."
    },
    {
      "rating": "5/5",
      "review": "Makes you scared to even use an Android. You connect with Violet instantly and just want her to be safe. Such a fun ride, perfectly aligned with that “dramatic and mysterious” vibe. This is cinema."
    },
    {
      "rating": "3.5/5",
      "review": "I love a good thriller movie! I think overall, the concept of the movie and the thrill of figuring out who in the venue was the bad guy was fun and kept the movie going. I did think the amount of times the female main character did things to ruin the date, and the guy still stayed, was a little unrealistic. So other than some plot holes and some really unrealistic scenes, the movie overall kept me engaged and I really didn't know who the bad guy was until the movie made it known. It is definitely worth a watch and a good movie overall. Probably doesn't have much re-watch value though. But I enjoyed it!"
    },
    {
      "rating": "3.5/5",
      "review": "'Drop' is a ridiculously fun thriller that is entirely sure of its own conceit."
    },
    {
      "rating": "5/5",
      "review": "it was overall, a good movie. I loved the twist at the end!"
    },
    {
      "rating": "5/5",
      "review": "Kept me on the edge of my seat without the gore"
    },
    {
      "rating": "1/5",
      "review": "The whole premise is awful, I blame myself for knowing it’s all about people using cell phones the entire time and not all the suspension of disbelief in the entire galaxy would make anyone think a situation even remotely similar could ever happen. It’s bad science fiction at best. At worst, spending your entire days watching people stare into their phones only to buy tickets to sit in a theater and watch a woman staring into her phone the entire movie is the height of dystopian irony. And it’s just plain boring. For a movie to really be effective as a thriller, the viewer has to be able to visualize a scenario where they could find themselves in that situation. And buy that it could really happen to them. Hitchcock was a master at this and why his movies are classics and precisely why nobody will even remember this movie was made in 4 years. Literally the worst and dumbest timeline to exist if you’re a fan of literature, the arts or cinema."
    },
    {
      "rating": "4/5",
      "review": "Fun suspenseful thriller. Shut your brain off for an hour and a half and enjoy the ride!"
    },
    {
      "rating": "3.5/5",
      "review": "Flawed but fun movie. Definitely worth a watch."
    },
    {
      "rating": "2.5/5",
      "review": "Totally ridiculous plot. Didn’t even try to make it somewhat believable."
    },
    {
      "rating": "3.5/5",
      "review": "Solid little thriller…enjoyed it"
    },
    {
      "rating": "0.5/5",
      "review": "This seems like a mix up. I expected something else. This could pass as a young adult thriller. Would also fit if it were made for TV, likely on the WB or something. Christopher Landon stunk it up. Unfortunate because I did like happy death day. Writers were trash. Michael Bay of all people was trash. Run time 1:35. I think it was around 15 minutes in I smelled something off. The rest of the time I felt like an idiot for being fooled. Positive attitude for the day gone. And it was a real exercise in patience & humility. It really seemed to insult my intelligence."
    },
    {
      "rating": "4/5",
      "review": "Keeps you riveted to to your seat!"
    },
    {
      "rating": "1/5",
      "review": "I cant believe people like this movie. One of the worst I've ever seen."
    },
    {
      "rating": "5/5",
      "review": "Great movie! I would definitely see again. I'm usually not up to seeing the same movie again unless it's really good. This one is worth the trip to the movies!"
    },
    {
      "rating": "5/5",
      "review": "Very very good! Much better than I expected. Held to the end!"
    },
    {
      "rating": "3.5/5",
      "review": "Incredibly silly plot and an over the top final act that calls for eye rolling, but an entertaining movie overall."
    },
    {
      "rating": "3.5/5",
      "review": "actually an unexpected great watch. loved the use of lighting and camera angles to explore this genre in a new way. some of the dialogue felt a bit out of place e.g random laughs that felt strange due to editing. however a really solid film, better than others i’ve seen this year!"
    },
    {
      "rating": "4.5/5",
      "review": "Very entertaining movie. We've seen some real duds lately, so this was a pleasant surprise. This keeps you in some suspense. You kind of feel for the characters & want to cheer for them. It really only has 2 locations - the restaurant & her house. Her backstory helps make this more believable. Good action. The hanging out the window & being pulled back in by a guy with a bullet wound?? Otherwise solid movie."
    },
    {
      "rating": "5/5",
      "review": "Intense! Loved every minute! Highly recommend to anyone who enjoys a good thrill!"
    },
    {
      "rating": "5/5",
      "review": "A fun couple hours at the theater! Great date movie!"
    },
    {
      "rating": "5/5",
      "review": "Great Movie!!!!!!!!! Great Thriller w/a Good Ending w/o giving away too much"
    },
    {
      "rating": "4/5",
      "review": "Liked the movie just felt like we knew too much from the previews"
    },
    {
      "rating": "5/5",
      "review": "I didn’t know what to expect with the movie mainly taking place in the restaurant, but they were able to build the tension at a fast enough pace that by the end, everyone in the theater was on the edge of their seats."
    },
    {
      "rating": "3/5",
      "review": "That def has to be the most craziest dates I ever seen in the movies. I enjoyed the cat and mouse story arch of this movie and who is sending memes to her phone while her sister and son is being held captive . They couldn't sit at the table longer than 5 min lol someone kept getting up. 7.2/10 it was good."
    },
    {
      "rating": "5/5",
      "review": "It was actually better than I thought it would be."
    },
    {
      "rating": "5/5",
      "review": "A must see movie. Excellent acting, amazing special effects & clever twists through the whole movie!"
    },
    {
      "rating": "5/5",
      "review": "The film is extremely suspenseful a psychological thriller that leaves you hanging on the edge of your seat!! The actors were amazing. The film is a who dunit that will keep you guessing until the very end and before you know the person who you least expect to steal the show does it in a blink of an eye! I wholeheartedly recommend this movie it's a must see if you like an alluring, intriguing mystery that will have you jumping out of your seat and watchout because if you aren't paying attention there is a possibility for drop 2?! Maybe I think the producers and directors want the audience to wait and see ???"
    },
    {
      "rating": "5/5",
      "review": "Much better than we thought it was going to be. Was not too over the top like some movies get. Liked the characters. Well done."
    },
    {
      "rating": "1/5",
      "review": "This movie takes domestic abuse to tell a cute little story that isn't well done at all. There is no warning before the movie or help information after."
    },
    {
      "rating": "4.5/5",
      "review": "The movie does keep you on your toes which I liked. It just took awhile to get to the action."
    },
    {
      "rating": "0.5/5",
      "review": "There are completely outrageous plots, and then there is this claptrap. I refer to it as “ Only for the Mindless “. Oh Blumhouse, how you have fallen"
    },
    {
      "rating": "1/5",
      "review": "I wish I could give this 0 stars. Omg. One thing crazier than the next. I’m shocked. So bad!"
    },
    {
      "rating": "5/5",
      "review": "It was awesome kept you on your seat edge guessing who was behind all of it."
    },
    {
      "rating": "3/5",
      "review": "A lackluster film — the plot felt unrealistic and hard to believe, with pacing that dragged at times. It had potential, but ultimately fell short."
    },
    {
      "rating": "3/5",
      "review": "Good time, no alcohol required"
    },
    {
      "rating": "4/5",
      "review": "Loved the way in which it was filmed with close-ups of the actors all the way through which heightened the suspense and tension. Great storyline, well acted, tense, but the waiter was hilarious and a great stress-reliever. Just wished they hadn't gone over the top in getting rid of the bad guys, but otherwise an excellent movie that I highly recommend."
    },
    {
      "rating": "5/5",
      "review": "Non stop edge of your seat, holding your breath thriller! Great actors! Palpable chemistry between two leads!"
    },
    {
      "rating": "4/5",
      "review": "Cool modern thriller. Great performances by all!"
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this totally originally plotted thriller can definitely recommend"
    },
    {
      "rating": "5/5",
      "review": "Omgggggggg! you never suspected a thing! Great job! On the edge of my seat!"
    },
    {
      "rating": "2.5/5",
      "review": "Same sort of concept as Carry-on on Netflix. Plenty of plot holes but watchable. The low budget shows with 90% of the movie being in a restaurant."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie . Very intense ."
    },
    {
      "rating": "1/5",
      "review": "Worse movie I watched this year. It was pretty decent until all of a sudden, nothing makes sense anymore, everything become increasingly cheesy and absurd and I force myself to keep watching until the end. Waste of time."
    },
    {
      "rating": "4/5",
      "review": "The plot was very different. Lots of suspense and guessing \"whodunit.\""
    },
    {
      "rating": "4/5",
      "review": "Started out strong, did not love the ending"
    },
    {
      "rating": "4.5/5",
      "review": "Never a dull moment. Great acting. Suspenseful. Also love the fact that they didn't need sex and vulgarity to make a great movie."
    },
    {
      "rating": "4/5",
      "review": "Movie was thrilling. Very interesting and good."
    },
    {
      "rating": "2/5",
      "review": "Only the end was good. Felt like the first hour dragged!"
    },
    {
      "rating": "5/5",
      "review": "Christopher Landon Directed A Perfect Thriller That Puts You On The Edge Of Your Seat That Leaves You Worrying About What's Going To Happen. Drop Blends Thriller With A Little Of Comedy And Romance That I Surely Agree Everyone That Likes Thrillers, Then This Is The Right Movie For You"
    },
    {
      "rating": "2/5",
      "review": "Not a good thriller, everything in this movie has pretty much been done better in other better movies. Nothing exciting or original here. No excuse for it being made. Skip it for sure"
    },
    {
      "rating": "0.5/5",
      "review": "This was so buns, id rather eat dirt while getting kicked in the head by a horse than watch it again. I want my money back lowk"
    },
    {
      "rating": "5/5",
      "review": "This was one of the most tense and thrilling movies I've seen this year"
    },
    {
      "rating": "5/5",
      "review": "Really well done. Fun movie."
    },
    {
      "rating": "3/5",
      "review": "Not bad but not as action-packed as expected from the previews. Also, the red herrings weren't super convincing and the ending was a bit predictable."
    },
    {
      "rating": "3.5/5",
      "review": "Enjoyable film which I would probably watch again if someone asked me to watch it with them. would have been 4 stars but there was one screen with the window which didn't make any sense. A good little twist to the film and the casting spot on"
    },
    {
      "rating": "1/5",
      "review": "The first half was so boring that I almost just got up and left the theater. The whole premise was utterly ridiculous. Then it became pure comedy. The best part (spoiler alert!) was when our heroine is hanging out the window of a gadzillion story building and our hero, after being shot point blank in the stomach, suddenly leaps to her rescue and grabs her hand just in time. I turned to my friend and we laughed hysterically. It just gets more ridiculous from there. The hired killer in the house carrying a huge silencer can’t seem to kill 2 small women and a 4yr old child. I dont know how this movie got any good reviews. I wish I had those 2 hours of my life back."
    },
    {
      "rating": "2/5",
      "review": "They spent over an hour setting the movie up in the worst way. It was so exhausting to watch. The action towards the end was good. Horrible writing. Wish I didnt pay to see it."
    },
    {
      "rating": "4/5",
      "review": "It was a pretty good movie. It was better than. I thought. It would be. It held. My attention all through the movie. I did not fall to sleep one time."
    },
    {
      "rating": "2/5",
      "review": "This one never rises above its name, plummeting in a free-fall of recycled scares and soggy storytelling that fails to leave even a ripple. It’s a thriller in theory only; in practice, this one-location horror lands with a whimper – a damp squib of suspense and purpose."
    },
    {
      "rating": "2/5",
      "review": "Too long and drawn out."
    },
    {
      "rating": "4.5/5",
      "review": "Did not prolong the movie."
    },
    {
      "rating": "3/5",
      "review": "Interesting premise, the acting was good during the whole restaurant scene between Henry and Violet. It kept you guessing as to who the bad guy was, but it got to be a bit drawn out and the ending seem to be too tidy and bordering on ridiculous especially when the sister gets shot, but somehow miraculously appears and makes a joke by saying how was your date -that was totally absurd and then lo and behold, They’re in the hospital together and everything is just hunky-dory after these people have been beaten and shot … seems like the ending was rushed and just tied together too neatly and not believable."
    },
    {
      "rating": "0.5/5",
      "review": "Possibly one of the worst movies ever"
    },
    {
      "rating": "5/5",
      "review": "Enjoyed the movie from beginning to the end. Had u on the edge of ur seat at times and a little over the top BUT it kept us guessing and glued to the screen! Very entertaining with a little humor here and there! Will watch again"
    },
    {
      "rating": "3/5",
      "review": "The trailer showed a little too much."
    },
    {
      "rating": "2.5/5",
      "review": "The plot was a tad unrealistic. Matt was the best part of the movie. If I overlook the silliness the plot, it was ok."
    },
    {
      "rating": "1/5",
      "review": "Boring i actually nodded off a few times"
    },
    {
      "rating": "3/5",
      "review": "It was a very anxiety-inducing movie. It was pretty predictable. Only one real twist. It kept my interest but wasn't anything too extraordinary."
    },
    {
      "rating": "5/5",
      "review": "Had me entertained from beginning to end"
    },
    {
      "rating": "5/5",
      "review": "On the edge of your seat"
    },
    {
      "rating": "5/5",
      "review": "Many twist to the plot."
    },
    {
      "rating": "3/5",
      "review": "Verrrrrry slow for first hour. All the action happens in just w0 min of the movie. Wraps up too neatly. Overall just too much talking not enough action."
    },
    {
      "rating": "4/5",
      "review": "I went in kinda blind and this movie was well worth the watch. It was engaging and I cared about the characters. Another good bottle film for the books."
    },
    {
      "rating": "0.5/5",
      "review": "Horrible boring slow and dumb movie premise"
    },
    {
      "rating": "2.5/5",
      "review": "The lead actors were good, but the plot was far-fetched. No way would that man not have walked out already!"
    },
    {
      "rating": "4.5/5",
      "review": "Great date night movie that kept me guessing longer than most films in this genre."
    },
    {
      "rating": "4/5",
      "review": "About what I expected. It kept my attention to the bitter end. You have to suspend belief a couple times and the ending was abrupt, but it was a good popcorn flick. People complaining about the location being in a restaurant or the trailer having all the exciting parts, are just being fickle. It’s a solid B+ movie."
    },
    {
      "rating": "0.5/5",
      "review": "The trailer is nothing close to the real movie, it make it seen very interesting but it's not."
    },
    {
      "rating": "4/5",
      "review": "While implausible, this was a rocket-fueled entertainment of non-stop action. A woman goes on a date with a photographer she meets through an app and then she begins receiving messages on her phone - during the date! - demanding that she takes certain actions or her child will be harmed. The film perfectly dovetails the terrifying messages coming through her phone with the action in a super-fancy restaurant overlooking the Chicago skyline. This is a thriller that incorporates up-to-the-minute trends in smartphones and dining while working in an exciting plot about political corruption seamlessly almost as an afterthought. It is a very well-made and twisty film."
    },
    {
      "rating": "4/5",
      "review": "This was a fun movie. It was different and the cast was fantastic. I really enjoyed this one from start to finish. Blumhouse never misses with their thrillers!"
    },
    {
      "rating": "3.5/5",
      "review": "A very good thriller with an excellent musical score to ramp up the tension and drama. Several twists and turns keep you guessing right up until the big reveal. The leads chemistry is excellent and all of the supporting casts quirky behavior makes everyone seems a little off giving you a very large suspect pool throughout the film. The constant buzzing and pinging of the phone is a little annoying during the film, especially for people already a little sick non-stop technology. A-"
    },
    {
      "rating": "3/5",
      "review": "entertaining no movie but see before."
    },
    {
      "rating": "0.5/5",
      "review": "Preposterous premise that gets increasingly ridiculous as it goes on, descending into a half-baked insult to the intelligence of the audience. You're better off watching anything else or doing anything else than this utter waste of time. Drivel. Absolute drivel."
    },
    {
      "rating": "1.5/5",
      "review": "This movie is entertaining enough until it gets into the third act when the holes in the plot and the ludicrous conclusion did cause me to actually laugh out loud."
    },
    {
      "rating": "0.5/5",
      "review": "Good plot premise to start, but highly unbelievable execution of plot throughout. Had a few funny lines which were enjoyable \"what's your poison\"? for example. People being stabbed in the heart and shot point blank in the chest and then still alive??? not for me. Enjoyed the main characters who did a good job acting in this film. Good cinematography. Your movie ticket money would be best spent on a different film. This is def a wait for Netflix or other."
    },
    {
      "rating": "3.5/5",
      "review": "Not a bad film although there is better. Plot was a bit different and enough twists and turns to keep you watching until the end!"
    },
    {
      "rating": "3/5",
      "review": "It's an action based 'feel good' movie, everything works out and it's not as exceptional"
    },
    {
      "rating": "2.5/5",
      "review": "This is a film I could have just as easily watched on TV. I didn't feel it was particularly creative or thought-provoking, though it was surely suspenseful and involved a novel, digital take on the stalking theme. The ending was another shoot 'em up, violent crescendo that I could easily have lived without."
    },
    {
      "rating": "3/5",
      "review": "The plot was too predictable."
    },
    {
      "rating": "3/5",
      "review": "Not that DROP was a great movie but I did like it better than I thought I would."
    },
    {
      "rating": "5/5",
      "review": "The movie was crazy and great!!"
    },
    {
      "rating": "0.5/5",
      "review": "This movie only deserves 1/2 a star because the lead actress it was just OK. I promise you this movie is so stupid. The acting is so bad that it’s laughable. The plot is so dumb I couldn’t handle it. I literally left early and I can’t believe anybody likes this movie. It has nothing to do with Hitchcock, whose movies were multidimensional and interesting. This was not. What an insult to Hitchcock."
    },
    {
      "rating": "5/5",
      "review": "Great movie filled with action"
    },
    {
      "rating": "5/5",
      "review": "Had me on the edge of my seat the whole time! My boyfriend and I loved it!"
    },
    {
      "rating": "0.5/5",
      "review": "It was very unrealistic and pulls you out of story a lot of the times. There’s basically no suspension of belief. Same thing with the movie Trap that came out last year. Things work out too perfectly. I didn’t like it"
    },
    {
      "rating": "5/5",
      "review": "Great buildup. So many twist and turns. Recommend!"
    },
    {
      "rating": "4/5",
      "review": "Interesting concept for a story. Original. Great ending."
    },
    {
      "rating": "5/5",
      "review": "The movie was great. it was a lot of suspense and a lot of trying to guess who was the person that was sending her the texts."
    },
    {
      "rating": "5/5",
      "review": "Great movie very suspenseful"
    },
    {
      "rating": "4/5",
      "review": "very good plot. didn't get overly ambitious liked it a lot"
    },
    {
      "rating": "4/5",
      "review": "I enjoyed this movie. It kept my attention and guessing who could it be. Yahtzee!"
    },
    {
      "rating": "5/5",
      "review": "Took my teenage daughter to see. On the edge of our seat the whole movie. Very well done!!"
    },
    {
      "rating": "3/5",
      "review": "Kind of boring. Just kept dragging on."
    },
    {
      "rating": "1.5/5",
      "review": "I am shocked by any good review of this movie. It’s so unbelievable and BORING. Most of it all takes place in a restaurant. No one on a first date that is this bad would stay. I wanted to walk out half way in. You could not care less about the characters. The best part of the movie was when it was over."
    },
    {
      "rating": "3.5/5",
      "review": "This movie never lost my attention and you were constantly left with the wonder of what was going to happen next. The lead actress was a good cast, although at times I am not sure you believed her behavior. Further, the lead actor is a good looking guy, but man they made him look like a slob. Is that how men look on a first date at a fancy restaurant with a beautiful woman these days?"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Really enjoyed it."
    },
    {
      "rating": "1.5/5",
      "review": "Cringe script, This movie makes no sense."
    },
    {
      "rating": "5/5",
      "review": "Kept you on the edge of your seat the whole time. Made for a great story. The writing is what sets this movie apart from others like it"
    },
    {
      "rating": "4/5",
      "review": "It was a cat and mouse game, then turned into a chess game! Good movie!"
    },
    {
      "rating": "3/5",
      "review": "If you’ve watched the trailer, you’ve watched all the highlights of this movie. It was not nearly as nail biting as I thought it would be and ended exactly as I expected. No twists or surprises really, plus some of the acting was pretty bad. It was like watching an updated version of “Scream”."
    },
    {
      "rating": "3/5",
      "review": "Fun Hitchcockian thriller even if very contrived. Reminded me of Red Eye."
    },
    {
      "rating": "4.5/5",
      "review": "We throughly enjoyed the movie Kept our attention and did not disappoint Would recommend this one"
    },
    {
      "rating": "1.5/5",
      "review": "We were bored. The previews looked good, but that was basically the whole movie ("
    },
    {
      "rating": "3.5/5",
      "review": "I thought the movie was great,I don’t have any complaints just improvements I feel that can be made to make the movie better. For starters they could have made the setting move, cause for most of the movie they are in the restaurant. And my last improvement/suggestion would be to not save all of the action for the end of the movie. Because there is not any action until the end of the movie. Besides those two things I really enjoyed the movie. And I totally would recommend."
    },
    {
      "rating": "5/5",
      "review": "Suspenseful, great, acting , great storyline"
    },
    {
      "rating": "4/5",
      "review": "Great movie with twists and turns. Great acting"
    },
    {
      "rating": "4.5/5",
      "review": "Stresses you out from start to finish but in a fun way!"
    },
    {
      "rating": "3/5",
      "review": "Fun, low stakes popcorn movie that doesn’t take itself too seriously."
    },
    {
      "rating": "5/5",
      "review": "What a well-crafted movie!!! \"Drop\" was intense with many twists and turns. The ending was a little much but finished off the over-all plot. A sure-fire bet to stay off your phone!!!"
    },
    {
      "rating": "4/5",
      "review": "The ride the movie took me on was worth the journey and my time. Loved it."
    },
    {
      "rating": "3/5",
      "review": "This was a fun crime thriller. The characters backstories were a little weak, but the constant tension throughout overcomes that."
    },
    {
      "rating": "5/5",
      "review": "suspense and plot twist"
    },
    {
      "rating": "2/5",
      "review": "Too cheesy and unbelievable."
    },
    {
      "rating": "2/5",
      "review": "It does a good job building up the suspense but then it’s almost like they just decided that’s it time to wrap it up and everything just ends far too conveniently. If your bored and this movie is streaming it’s worth a watch otherwise I’d avoid it at the cineplex."
    },
    {
      "rating": "4/5",
      "review": "good movie couldn't figure out the person who was massaging her."
    },
    {
      "rating": "5/5",
      "review": "Great movie! Loved the heroine! And Henry was great too!"
    },
    {
      "rating": "3/5",
      "review": "It held my interest and was an intense thriller. It was unbelievable in many aspects, but you had to suspend judgement and just go along for the ride. The acting was good, set was gorgeous, and gave you something to think about how social media could be used."
    },
    {
      "rating": "1/5",
      "review": "Terrible movie. So so boring, cheesy acting, awful dialogue. I was this close to walking out, but I wanted to get my money's worth. After that letdown of an ending, I wish I would have left"
    },
    {
      "rating": "2/5",
      "review": "What a disappointment, and a waste of good talent. It couldn't decide what it wanted to be so it ended up a salad of wrong ingredients. No funny, not scary and not dramatic.."
    },
    {
      "rating": "4/5",
      "review": "This is what I would call and awesomely bad movie. It was ridiculous yet a good time."
    },
    {
      "rating": "5/5",
      "review": "This movie was well done and worth watching."
    },
    {
      "rating": "3/5",
      "review": "Drop was ok, but very dragged out, fake, and predictable!!!"
    },
    {
      "rating": "4.5/5",
      "review": "Yes, if you want a little tension when it comes to blind dates, this movie will provide that for you and it the same type of of superior quality of Liam Neeson's films of Non-Stop and Commuter."
    },
    {
      "rating": "2/5",
      "review": "Could have been way better!!!"
    },
    {
      "rating": "3.5/5",
      "review": "It was exactly what I was thinking it would of been. Not terrible, but not oscar worthy. Very glad they didn't kill the sister."
    },
    {
      "rating": "3.5/5",
      "review": "More fun than I expected, glad I caught the Dolby early screening as it was my only chance to see in the format at my theatre"
    },
    {
      "rating": "5/5",
      "review": "kept you on the edge of your seats."
    },
    {
      "rating": "4/5",
      "review": "i really liked this movie! it kept me on the edge of my seat and the end made me so anxious i almost couldn't watch!"
    },
    {
      "rating": "5/5",
      "review": "Drop review I love opening intro and Dolby vision for the intro the Dolby vision is amazing and the camera angles in this movie is amazing I love suspenseful storyline movie I love characters setting Dolby atoms 5 star 10 out 10 star 100 out 100 star"
    },
    {
      "rating": "5/5",
      "review": "For its genre - I thought it was new, updated, and kept me in suspense. I thought the underline storylines were really good. I really enjoyed it. For some reason it reminded me of the suspense I felt when I first watched “Taken”"
    },
    {
      "rating": "3.5/5",
      "review": "Despite getting a little silly when the third-act shoe drops, Drop is a largely sleek and engaging concept thriller."
    },
    {
      "rating": "5/5",
      "review": "This was a great movie good suspense. I didn’t expect the bad guy lol"
    },
    {
      "rating": "3.5/5",
      "review": "SPOILERS. Much better than I anticipated. I thoroughly enjoyed this much more than I thought I was going to. The latest productions from Blumhouse / Jason Blum were so-so, at best. I think every actor on this film actually did a great job - except - the stereotypical bad guy assassin. How they thought that the hitman/assassin was such a bumbling idiot and can miss the opportunity to kill the sister when she's on the ground after throwing her, OR, at almost point blank range he somehow misses her heart and at the end she's still alive, standing and being sarcastic, ugh, why oh why is she still alive. 100% not realistic and I feel it really through the amazing rest of the film off. Also, I don't get how I really, really thought I saw the lead actress pour the poison into the shot glass, only to pour it into the antagonist's food later.... uh, what did I miss there. I don't really get that. other than than, a very, very good suspense thriller and we totally enjoyed the ride!"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is really bad. Our theater was definitely laughing during parts of the movie that were meant to be serious. It's so over the top and dumb that it might be one of those it's so bad it's good movies. Otherwise, avoid if you can."
    },
    {
      "rating": "4/5",
      "review": "Overall a very entertaining and suspenseful movie. It does move a little slow at times, but it was still well done and a good watch."
    },
    {
      "rating": "4/5",
      "review": "This movie has you looking all around as to who is the culprit messing with this woman (Meghann Fahy) while on a date. It is very suspenseful in that you start wondering how this woman is maintaining her composure while getting these death threatening texts. This movie gets better as it goes on, especially when the woman is tasked to do so many different scary things to her date. All in all, it was an ok movie, but it wasn't as fantastic as the previews showed. It actually had only one really scary moment and then it was over."
    },
    {
      "rating": "0.5/5",
      "review": "Very disappointed. Not sure how this movie received an 80% on rotten tomatoes. Interesting concept but executed very poorly."
    },
    {
      "rating": "3.5/5",
      "review": "A little slow to start with a strong finish."
    },
    {
      "rating": "5/5",
      "review": "Very good intense ending"
    },
    {
      "rating": "5/5",
      "review": "Solid movie throughout !"
    },
    {
      "rating": "3/5",
      "review": "Although this was meant to be a sit on the edge of your chair type of genre, it was predictable. I really could not understand why the lovely date remained with her as she proceeded to act like a loose cannon. The setting was nice, but I actually guessed the mastermind perpetrator in very beginning. Also, felt the script was quite a repetitive one that has been used too many times over the years. I knew it would be a happy ending because it was that type of film story. If you have not seen other films in this genre, see it - frankly, I was disappointed but the film was perhaps, one that I might re-see just to experience fit from a less knowledgeable viewpoint. It fely corny and truly was predictable."
    },
    {
      "rating": "4/5",
      "review": "Entertaining and fun! A little on the unrealistic side but thats typical for horror/thriller movies! I liked it overall!"
    },
    {
      "rating": "5/5",
      "review": "It was suspenseful from the start! It definitely kept me on the edge of my seat."
    },
    {
      "rating": "4.5/5",
      "review": "Very suspenseful! Great storyline and excellent chemistry among the actors. I watched this while my son and his friends saw Minecraft. Weren't many options at the same showtime but so glad I chose this one. Really enjoyed it! Definitely recommend seeing it in the theater."
    },
    {
      "rating": "5/5",
      "review": "Edge of your seat awesomeness, with some good moments of drama. Loved all of the actors’ performances!!"
    },
    {
      "rating": "4/5",
      "review": "Wes Craven's RED EYE meets GRAND PIANO: a fraught & thoroughly tense thriller."
    },
    {
      "rating": "1/5",
      "review": "This movie was horrible!"
    },
    {
      "rating": "5/5",
      "review": "It was soooo good, it kept me on the edge of my seat! Best movie I’ve seen this year so far. The cast was perfect and it was fun to try to figure out everything and who with the main character. Definitely recommend Drop! :)"
    },
    {
      "rating": "4/5",
      "review": "Silly plot, but a good time."
    },
    {
      "rating": "4/5",
      "review": "Drop was not disappointing The trailer had me ...why does she need to kill her date? Who is in her house? Who is texting her? I knew it was a low budget film. Set mostly in a high rise restaurant. But this kind of action thriller isn't made much anymore, I had to check it out. It has me guessing the whole time who it was texting her in the restaurant. Was it a worker? The waiter? The guy that bumped into her? The hostess? The answer was surprising. The motive was answered. The twist was fun. And the action in the house was predictable yet satisfying. Not the best ever made film. But a thriller non the less!!"
    },
    {
      "rating": "4.5/5",
      "review": "It was really good! Very entertaining. I would highly recommend this movie"
    },
    {
      "rating": "5/5",
      "review": "Good movie, suspense thriller in all sense, good camera use and good story."
    },
    {
      "rating": "5/5",
      "review": "awesome movie...has action,suspense,surprises and a lil comedy...highly recommend it"
    },
    {
      "rating": "5/5",
      "review": "Gripping, great acting"
    },
    {
      "rating": "4/5",
      "review": "Enjoyed it. It was fun trying to figure out who was sending the drops. Suspenseful and entertaining."
    },
    {
      "rating": "4/5",
      "review": "Very entertaining movie with twists and a solid ending. Worth a watch!!"
    },
    {
      "rating": "3.5/5",
      "review": "It was a good movie. The kids loved it. I wanted more than just the happy ending"
    },
    {
      "rating": "1/5",
      "review": "It was so cheesy and stupid. The ending is silly too. You can wait for the stream and save a few bucks."
    },
    {
      "rating": "4/5",
      "review": "This movie was pretty good with the story line ."
    },
    {
      "rating": "3/5",
      "review": "It’s not the worst and somewhat entertaining B thriller/action movie. I felt there were too many times it was slow and ending with toy truck makes zero sense in so many ways."
    },
    {
      "rating": "4/5",
      "review": "Very engaging and entertaining."
    },
    {
      "rating": "5/5",
      "review": "The Best Movie Ive Ever Watched."
    },
    {
      "rating": "4/5",
      "review": "It started off a little too slow but once the action started! It was great some unexpected moments definitely."
    },
    {
      "rating": "5/5",
      "review": "Nice to see a different type of movie!"
    },
    {
      "rating": "4/5",
      "review": "I like this movie. It was an interesting concept that I had not seen done before so I thought it was very original. I also like that they kept it to just about an hour and a half. I feel like two hours wouldve been too long and keeping this movie a little shorter was perfect. Kept me on the edge of my seat, but did not get bored."
    },
    {
      "rating": "1/5",
      "review": "This movie was absolutely terrible. It was unsuccessful in its attempt to be deep. The acting was hard to believe. Every attempt at comedy missed. I was ready to leave an hour in but decided to stick it out and regretted not leaving when I first wanted to. You’re not missing anything if you don’t see it."
    },
    {
      "rating": "5/5",
      "review": "drop? more like rise, up. my thumbs for this movie."
    },
    {
      "rating": "5/5",
      "review": "It was a fun movie. Good characters, good cinematography, quite enjoyable."
    },
    {
      "rating": "3.5/5",
      "review": "If you spend too much time asking why or how during Blumhouse's latest movie, \"Drop,\" you will not be able to enjoy it. This movie delivers what it promises, which is a fun and suspenseful thriller centered around AirDrop. The movie takes a bit to set the stage but after we have all of our suspects, the movie does a great job of keeping things moving in a singular setting. The movie does have some moments that make it feel like it is dragging its feet a bit, but the way it plays out and pays off makes the journey worthwhile. Overall, it is a silly thriller movie that is actually really well put together and kept me often on the edge of my seat and is an enjoyable movie to watch in the theater with other people."
    },
    {
      "rating": "1/5",
      "review": "Boring, predictable, and it’s not fun as some critics here suggest – just a random plain movie with nothing to offer."
    },
    {
      "rating": "1/5",
      "review": "Another one of those movies that I wasted my money on."
    },
    {
      "rating": "4.5/5",
      "review": "Very exciting. Hard to take a pee break lol"
    },
    {
      "rating": "5/5",
      "review": "Edge of your seat to the end"
    },
    {
      "rating": "5/5",
      "review": "Very entertaining! I enjoyed the whole who dunnit aspect."
    },
    {
      "rating": "2/5",
      "review": "Good parts and extremely cheesy parts"
    },
    {
      "rating": "2.5/5",
      "review": "I just don’t like how Blumhouse makes movies. Wish the script was more interested in the mystery instead of awkward date drama. The cast was on point though. If you like other Blumhouse movies like THE INVISIBLE WOMAN you’ll enjoy this."
    },
    {
      "rating": "1/5",
      "review": "The whole plot was undermined by the ending with the majority of the movie rendered pointless. Violet could have turned around and disobeyed the bad guys orders at minute one and the hurdles between her and her family’s safety would have been the exact same as they were after approximately 70 minutes of spycraft due to her inability to resist gloating. The ending of this movie ensured that it has the same effect as going tiktok for 90 minutes, entertainment but with no substantive message or correlation between events."
    },
    {
      "rating": "4.5/5",
      "review": "it was nice to watch a good movie without a lot of guns and car chases. Pretty good movie. I would recommend."
    },
    {
      "rating": "2/5",
      "review": "People next to us got up and left halfway through the movie. My husband said he wished he had also. Just the same thing over and over again for an hour and 45 minutes."
    },
    {
      "rating": "3/5",
      "review": "I also watched this film as well today lol. This does remind of movies like phonebooth or Red-eye. It wasn't terrible, it was alright for a suspenseful thriller especially in the 3rd act and the ending. I was definitely surprised by who was behind it."
    },
    {
      "rating": "4.5/5",
      "review": "Go see this one in the theater! It's great but it will not translate the same way at home particularly since there's so much text directly involved in the movie. Yes, you'll still be able to read it but it won't be the same at all. This is a far better movie than I had imagined it would be, but I took a chance and went to see it and I'm very glad I did! Meghann Fahy does a superb job as Violet and Brandon Skelnar is just as good. They make an excellent couple though it's their first date. The tension begins early in the movie and is relentless. It's one of those movies I really, really like because I wasn't able to figure out what was going to happen and who was behind it all until just before it became clear to the audience. Great twists and turns, great supporting cast too! The cinematography was really good and inventive. The scenes overlooking the city are simply gorgeous. Definitely go see this movie. I'm sure it will be a big hit when it streams but it deserves to be a big hit in the theaters. Go see it now. You'll be glad you did!"
    },
    {
      "rating": "4/5",
      "review": "Great movie, keeps you on the edge of your seat!"
    },
    {
      "rating": "4/5",
      "review": "fun ride, perfect first date movie 😁"
    },
    {
      "rating": "3.5/5",
      "review": "Fairly good film. Better then the trailer made it out to be but in no way is this an incredible film"
    },
    {
      "rating": "0.5/5",
      "review": "I hated this movie, but my wife found it entertaining. I think women were the target audience, I usually try and avoid movies like this but i saw the trailer and thought we should give it a try. Hated it. The writing hits with all the talent of a college student that majors in art and theatre. The writing makes no sense when you peel back the layers, at all, and it’s filled with contradictions and contrived plot points. The bad writing may be saved by decent acting, but the cast is small and the acting is terrible. The lead male has a face that can only be described as apathetic and bland. His facial hair covers most of his facial expressions. The leading female looks like they pulled a random woman off the street and said, just act out how you’d feel in this moment. It all feels so forced and awkward. Halfway through I wanted to leave the empty theatre, literally just me, my wife and two ladies sitting further down from us. They seemed to like the movie too. The best description of the movie would be this. If you’ve ever seen a movie on the Lifetime channel, this movie would be great there! It’s a chick flick through and through. If you’re an adult or middle aged woman I would recommend it, my wife and the two other women in the movie appeared to like this a lot. If you’re a red blooded male then please save your time and money. Watching a woman chose between her child and the new hot guy she likes is not the thrilling rollercoaster you’ve been led to believe. The worst part of this. The movie could have been better. But it just felt, lazy. It’s like, whenever there was a moment where they could have been thoughtful or deep, they just kept it simple and superficial. It’s like they told the audience, “turn off your brain and just imagine if you had to chose between your crush or your child.” And so the rest of the writing feels superficial because it’s really just there to drive home the dilemma. Why do they want to kill him? “Idk who cares, that’s not important, what’s important is that she has to chose between him or her child.” “Why did they choose her? Huh? Don’t worry about that it’s not important.” I liked Imaginary so, so much. And so when I saw Blumhouse put this out I was actually excited to see it. I guess I have to do more research into the movie instead of just watching based on their name alone. SPOILER ALERT: So many questions! When she’s driving home to stop the killer, why didn’t she call the cops or use someone else’s phone to call the cops? How did the villain not notice her pour poison on his Panna Cotta? Why didn’t he see the yellow oil-like poison on top of his panna cottage which is basically yogurt! It’s a very hard thing to miss! Using a random woman to kill a FBI informant is not the “non-alarm raising” subtle death the villains think it is. There are about 1000 better and more natural ways of killing skmeoen, that doesn’t involved roping in an unwilling and unpredictable accomplice, just under the guise that you thought she had killed someone before, which she hadn’t, which is exactly my point. Why does the killer drop his gun so dang much, every single act of touching this guy causes him to drop his gun and it’s infuriating. The writing is just terrible, this is not all of the nonsense in the movie, just the tip of the iceberg berg."
    },
    {
      "rating": "3.5/5",
      "review": "Nice lil movie to watch. I’d watch it again.."
    },
    {
      "rating": "5/5",
      "review": "This is one of the best movies I've watched in a while, it kept me on the edge of my seat from start to finish."
    },
    {
      "rating": "4/5",
      "review": "A little predictable but still very fun!"
    },
    {
      "rating": "3.5/5",
      "review": "Drop isn’t trying to reinvent the wheel—but it sure knows how to keep it spinning. Anchored by a tense premise and strong performances, Drop follows Violet, a widowed mother just trying to enjoy a first date at a chic restaurant. But her night quickly unravels into a high-stakes game of survival when a mysterious hooded figure begins sending threatening messages: kill your date, or your son and sister die. Most of the film takes place in one location—the restaurant—which surprisingly works in its favor. The confined setting amps up the suspense and forces viewers into detective mode, scanning every background character and suspicious glance. It’s a pressure cooker of paranoia, pulsing with tech-fueled tension and tight direction. The middle of the film drags slightly, and some of the final moments lean into the unbelievable. Still, it all pays off with a conclusion that—while not groundbreaking—makes sense and satisfies. The real power of Drop lies in its atmosphere and pacing. It may not be the most unpredictable thriller, but it’s certainly a gripping one. And yes, you’ll want to watch it again—not because you missed the twist, but because the clues were always there, hiding in plain sight."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie! The way it was filmed from the lighting to showing of text messages made you feel on edge like the character in the movie. Definitely recommend!"
    },
    {
      "rating": "5/5",
      "review": "WHAT A FUN MOVIE — IT WAS LIKE A ROLLERCOASTER RIDE FROM BEGINNING TO END — LOTS OF VERY TENSE MOMENTS WITH MANY TWISTS & TURNS — MEGHANN FAHY IS FANTASTIC — I HIGHLY RECOMMEND!!!"
    },
    {
      "rating": "3.5/5",
      "review": "suspenseful and exciting with a bit of cheesy fun"
    },
    {
      "rating": "4/5",
      "review": "Really enjoyed the cinematography! It was superb! It flowed with the suspenseful nature of the movie. It was definitely worth the trip to the movies."
    },
    {
      "rating": "4.5/5",
      "review": "Wooo Olivia and Sam! LOL"
    },
    {
      "rating": "4/5",
      "review": "It was entertaining. Suspenseful with a little levity"
    },
    {
      "rating": "3.5/5",
      "review": "Reminds me of Red Eye good movie"
    },
    {
      "rating": "3.5/5",
      "review": "Action, surprises and humor."
    },
    {
      "rating": "2/5",
      "review": "Formulaic story with bland and forgettable performances."
    },
    {
      "rating": "3/5",
      "review": "Tense, twisty, and totally addictive despite its flaws. Christopher Landon is back with another wild and clever thriller, and Drop might be his most intense ride yet. Known for giving us genre-benders like Happy Death Day and Freaky, Landon shifts gears a bit here, dialing up the suspense while still keeping that tight, character-driven storytelling he’s great at. The story follows Violet Gates (Meghann Fahy), a widowed mom trying to dip her toe back into dating. What starts off as a seemingly normal night out quickly spirals into a claustrophobic nightmare, she begins receiving creepy digital drops from an anonymous tormentor who’s holding her family hostage. From that point on, it’s a tense, cat-and-mouse game as Violet has to think on her feet while everyone around her becomes a potential threat. Brandon Sklenar brings a grounded charm to Henry, the date who turns out to be more tangled in the plot than expected. Violett Beane and Jeffery Self both shine in supporting roles, adding just enough personality to make the restaurant setting feel alive, and not just like a stage. What really works is how Drop balances its mystery and thriller elements with deeper emotional beats. Violet’s trauma, her guilt, her protectiveness—those threads give the film more than just surface thrills. And the final showdown at her house is a satisfying, nail-biting conclusion to everything that’s been building. This one’s definitely worth a watch, especially if you’re into thrillers that know how to keep you guessing without overcomplicating things. Four stars from me."
    },
    {
      "rating": "5/5",
      "review": "Wow! Absolutely brilliant filming here. Talent in every area of this movie. A must see that will impress. I smell award nominations left and right here. The audience was totally engaged and 180 degree turns throughout this movie that you never see coming. Loved it. A must see here!"
    },
    {
      "rating": "4/5",
      "review": "Suspenseful, with many twists and turns. I recommend it."
    },
    {
      "rating": "4/5",
      "review": "A little too predictable but it was exciting."
    },
    {
      "rating": "4/5",
      "review": "Good plot with a surprise ending…pleasantly pleased with the movie!!!"
    },
    {
      "rating": "3/5",
      "review": "It was ok not bad but not to overly intense like the trailer"
    },
    {
      "rating": "5/5",
      "review": "Really great suspense movie. You are watching and questioning who is involved.. it keeps you guessing. The last 20 minutes of the movie is intense with action! You have to pay attention from the beginning! The end makes you happy! I’m glad I saw it!"
    },
    {
      "rating": "4/5",
      "review": "It was suspenseful and entertaining. Not a lot of action until the end, but kept us guessing on who the bad guys were."
    },
    {
      "rating": "4/5",
      "review": "Very suspenseful trying to figure who was tormenting the woman and why. A surprise who the bad person with with a dramatic ending."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Definitely the loved the concept of guessing who the perpetrator was!!!"
    },
    {
      "rating": "5/5",
      "review": "Very good story. Kept you in suspense the whole time."
    },
    {
      "rating": "2.5/5",
      "review": "This had to potential to be an extraordinary film. The plot was good, but it was fairly rushed and the ending was so rushed that it just destroyed the entire ambience of the movie. It could’ve used another 20 minutes of ending. It did have its good moments, but it could’ve been so much better. I just wish they would’ve ended it a little bit more better.."
    },
    {
      "rating": "4/5",
      "review": "Good acting . Exciting . Kept you guessing . A lot of action . Was entertaining ."
    },
    {
      "rating": "3.5/5",
      "review": "Fun concept that was executed well enough. Not a bad action thriller."
    },
    {
      "rating": "5/5",
      "review": "Oooo it was good! So good i have seen it twice. There were a coupla oopsies but cant give em away bc theyd be spoilers so you’ll have to see for yourself."
    },
    {
      "rating": "4/5",
      "review": "I didnt expect much but was pleasantly surprised. Good story. Well acted."
    },
    {
      "rating": "4/5",
      "review": "Movie was fun. A little far-fetched, but good."
    },
    {
      "rating": "5/5",
      "review": "10/10 kept you guessing until the end!"
    },
    {
      "rating": "3.5/5",
      "review": "I thought it was good. Good acting & the idea of a picture drop based movie is very unique. A very suspenseful movie."
    },
    {
      "rating": "3/5",
      "review": "How do you make a full-length movie out of a simple concept. I give you Drop, a typical Blumhouse movie"
    },
    {
      "rating": "1/5",
      "review": "Cheesy. What a waste of time and"
    },
    {
      "rating": "3/5",
      "review": "Too predictive, I knew what was going to happen before it did. Actors were shot, knifed, smashed with objects and thrown across the room but kept coming back for more."
    },
    {
      "rating": "4.5/5",
      "review": "Slow to start or even hold your interest. That soon changed in the restaurant, which was the setting for most of the movie. Suspenseful plot for the bulk of the story... utilizing modern texting technology. Great ending twists... but may have been drawn out a little long. Very fine actorx."
    },
    {
      "rating": "2.5/5",
      "review": "This was right in the middle for me (neither good nor bad). It felt different than some of the other Blumhouse movies and focused more on the mystery aspect (as opposed to the horror). It did feel pretty predictable though. Overall a decent watch but nothing special."
    },
    {
      "rating": "3.5/5",
      "review": "Meaghann Fahy was great in the lead role. the upscale restaurant overlooking the city setting made for a visually pleasing backdrop to the controlled chaos."
    },
    {
      "rating": "3/5",
      "review": "A strong start that slowly fizzles into weirdness, and then a completely over-the-top, wacky ending, presumably to make up for us all getting a little bored by that point. It’s a shame; this could have been a great movie, but it’s plagued by plot holes and batshit logic across protagonists and villains alike. That being said, the leads do a great job with what they’re given. The colorful, Clue-esque cast of quirky but suspicious characters is fun and keeps the suspense and intrigue high. And the directing is actually pretty unique, if heavy-handed, in its use of lighting and space to create isolation and paranoia. It’s all very exciting, and then it just… drops (ha)."
    },
    {
      "rating": "3/5",
      "review": "Meghan Fahey gives a great performance in this movie. A highly improbable plot, but the pace kept me glued waiting to see how everything panned out. Good \"mental floss\" for this viewer watching the drama unfold, from the safety of my seat. 😊"
    },
    {
      "rating": "1/5",
      "review": "Trailer is misleading very minimal action it was quite and my girlfriend fell asleep. Not worth £10.40 or whatever I paid."
    },
    {
      "rating": "3/5",
      "review": "Trashy fun! Is it a good movie? Of course not, but it's not trying to be. It's entertaining and requires a gigantic suspension of disbelief, but if that's what you're in the mood for, it's a good time at the movies. I enjoyed it."
    },
    {
      "rating": "4/5",
      "review": "Kinda ridiculous, but fun. Feels like a pandemic movie in one room, one set. So many, why, how, what questions, but if you just suspend disbelief, it’s a fun popcorn movie."
    },
    {
      "rating": "2/5",
      "review": "\"Drop\" is best enjoyed with your analytical mind switched off. It is riddled with implausibility's and logical gaps, particularly regarding Violet’s phone security and the villain’s elaborate scheme. The final act in particular descends into near-cartoonish territory, with physics-defying stunts and melodramatic confrontations that strain credulity. It tries to deliver serious themes, such as domestic abuse and the lingering effects of trauma, but it often undercuts them with its own silliness. The result is a thriller that is more interested in delivering shocks and laughs than offering an exploration of its darker subject matter"
    },
    {
      "rating": "3.5/5",
      "review": "Blumhouse’s DROP pushes you to the edge of your seat at every turn while casually sneaking in relatable dating troupes that keep you comfortably entertained. Never a dull moment while layered with subtle mystery and terror, Drop is the most thrilling first date you’ll have this year!"
    },
    {
      "rating": "4/5",
      "review": "Great storyline and suspense and acting"
    },
    {
      "rating": "0.5/5",
      "review": "Megan Fahey is the worst female actor of all time.. Selenar is pretty terrible as well..."
    },
    {
      "rating": "4.5/5",
      "review": "This was an exciting suspenseful movie."
    },
    {
      "rating": "0.5/5",
      "review": "Horrible and laughabale. The audience was laughing throughout and this is not a comedy. Fahey was excellent though."
    },
    {
      "rating": "5/5",
      "review": "Loved this movie. I was jumping and kicking the seat in front of me. I am a bit dramatic, but thank god there was no one in front of me. The suspense and the thrill of this movie got me going. I was in a group of 4, and the other 3 really enjoyed the movie. Good job!"
    },
    {
      "rating": "5/5",
      "review": "Had a good plot. Kept you in suspense."
    },
    {
      "rating": "4.5/5",
      "review": "Solid thriller, theatre worthy experience. Film flys by as it’s paced very well. Bit cringe humour here and there, but not enough to ruin experience. Cinematography was excellent there’s a visual cue when focusing on characters which is one example of elevated storytelling. Good stuff. Director Christopher Landon incorporates serious themes very well woven into the story for an impactful watch. Meghann Fany and Brandon Skelnar (get this man a cape and cowl) have great chemistry, both carry the film extremely well."
    },
    {
      "rating": "0.5/5",
      "review": "I don't know how the writers or the cast could keep a straight face while filming a movie so ridiculous. The unintentional laughter is the only redeeming quality of this film."
    },
    {
      "rating": "4.5/5",
      "review": "this movie had me at the edge of my seat. The plot is definitely interesting."
    },
    {
      "rating": "3.5/5",
      "review": "In Drop, Christopher Landon delivers one of the most engaging and daring projects of his career. Using the actual functionality of airdrops - a file-sharing feature via bluetooth - as a starting point, the film throws us into a claustrophobic, distressing and surprisingly funny spiral, with a sense of urgency that holds our attention from the first few minutes to the end. The plot follows Violet, played by Meghann Fahy, during a romantic date in a restaurant that quickly turns into a nightmare. The character starts receiving spam via airdrop from an unknown sender, who appears to be physically close to her. The tension grows as she realizes that someone is watching her house in real time, and that her family is in danger if she doesn't follow threatening instructions. What was supposed to be an ordinary dinner party becomes an extreme surveillance experience, where the audience shares the same panic and paranoia as the protagonist. Landon draws from the same stylistic source as Death Congratulates You, especially in the balance between tension and comedy, but here the terror is more psychological and immediate. The restricted setting of the restaurant, a feature that could easily become tiresome, gains strength with direction that knows how to exploit every corner of the space. Every person around Violet becomes a potential threat. The presence of danger is constant, but invisible - and this makes the experience suffocating and fascinating at the same time. The script, written by Jillian Jacobs and Chris Roach, works cleverly by constructing small, seemingly banal interactions with customers and employees that later turn out to be fundamental to the unfolding of the narrative. The agile editing is a highlight. There's a dynamism that's rare in thrillers set in real time or in confined spaces, and Drop gets it right by never letting the pace drop. The tension is maintained with almost surgical efficiency, offering the viewer a journey of constant uncertainty. And even though the movie plays with the familiar “who's doing this to her?” formula, everything is handled with a naturalness that avoids easy shortcuts or artificial conveniences. The film also allows itself to explore denser themes, such as the trauma of abusive relationships, although this layer appears more as an emotional justification for the main character's motivations than as the center of the narrative. The idea is present, but it isn't explored in depth - which, in this case, doesn't weaken the film, since the focus is on the urgency of the present situation, and not on building a broader drama. Brandon Sklenar, as Violet's romantic partner, also holds his own well, serving both as support and as another piece in the machinery of mistrust created around the protagonist. The secondary cast fulfills their roles with functionality, and each figure introduced serves a purpose that is revealed later on, which demonstrates the script's care in putting together a puzzle where nothing is gratuitous. It's true that the third act loses some of the elegance with which the movie has been conducted. The revelation of the answers and the lead-up to the finale sound rushed and a little disjointed in pace and tone, which may annoy some viewers. Even so, it doesn't compromise the experience as a whole. The tension built up is so solid, and the identification with the protagonist so effective, that the emotional impact remains. The sense of urgency remains alive, even if the solutions presented at the end are more abrupt than ideal. Drop is a clear demonstration of Christopher Landon's ability to transform the ordinary into something extraordinary. A movie that takes a simple but thought-provoking concept and builds on it to create a suffocating, tense and engaging atmosphere. It's a work that manages to balance tension, discomfort and even hints of humor with remarkable confidence. In the end, it may not be perfect, but it's exactly the kind of movie that delivers what it promises: to keep you on the edge of your seat and make a simple cell phone notification a legitimate cause for paranoia."
    },
    {
      "rating": "5/5",
      "review": "By far an intense thriller of a movie. This has me at the edge of me seat and clenching the seat. It was just the best experiences I've ever felt"
    },
    {
      "rating": "2/5",
      "review": "I feel bad for the actors because they really tried to make this work but the third act was so ridiculous it was almost laughable. The premise was kind of our there to begin with but even with that suspension of belief as the movie progressed it just got harder and harder to stay in it. There was one decent headfake but overall this was not a great movie."
    },
    {
      "rating": "2.5/5",
      "review": "Suspenseful parts in the movie. Left out a lot of parts and lots of random scenes."
    },
    {
      "rating": "3.5/5",
      "review": "I enjoyed this a lot! Good suspense and well acted."
    },
    {
      "rating": "4.5/5",
      "review": "Good, fun movie for a date night!"
    },
    {
      "rating": "4.5/5",
      "review": "Suspenseful film. I enjoyed it"
    },
    {
      "rating": "3.5/5",
      "review": "This movie only works if the viewer is fully committed go getting on board AND staying on board with its premise. Although suspension of disbelief is require for all fiction stories, the strings holding the narrative of Drop are extremely thin and frail. The difficulties become even greater once the mastermind is revealed, not just who the person is but also why the person has targeted the protagonists. The mastermind must have attended the same Evil Scheme University as Lex Luthor from Batman v Superman because the mastermind's plan is absurdly complicated, could fail in over a dozen ways, and would have been easier if the villain did the job him/herself. Without offering spoilers, Drop is being compared to movies like Red Eye, Carry On, and Phone Booth because they are about masterminds coercing ordinary people into horrible situations. However, the protagonist in Drop isn't a person with special security or information access. She isn't someone that the villain targeted because of psychotic obsession. Instead, the protagonist is a woman that just happens to be on a first date with the mastermind's actual intended target. What if she had cancelled? What if her date had cancelled? What if her babysitter had cancelled? What if she dropped and damaged her phone prior to getting to the restaurant? What if she just plain turned off her phone? What if the cellphone service itself went down? (I've experience that a few times over the years.) Those are just a sample of the abundant ways the mastermind's plot would have crumbled. If the viewer can hold suspension of disbelief from start to finish, then Drop is a very entertaining, suspenseful, and surprising psychological thriller."
    },
    {
      "rating": "3.5/5",
      "review": "It was basically trying to figure out who was the mastermind of it all. It kept you guessing. Good flick."
    },
    {
      "rating": "4/5",
      "review": "suspenseful and a good plot. Could have been a little more not so predictable. very good acting."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed Drop because its comedic characters take the edge off and the music helps draw us in and provides great transitions. Drop is a thriller about a young widowed mother, Violet (Meghann Fahy) who goes on her first date in years with a nice man named Henry (Brandon Sklenar). She begins to receive airdrop messages, at first assuming they are a joke, until whoever is sending her them, begins threatening her son, Toby (Jacob Robinson) and her sister, Jen (Violett Beane). She begins to wonder who this mysterious sender is and whether it might be her date? I particularly enjoyed the storyline, the acting and the background music. Noteworthy are the comedic characters, which help lighten the mood and take the edge off this thriller. For example, Violet and Henry’s waiter, Matt (Jeffery Self) plays a comedic character. His jokes and ironic statements truly lighten the mood and he steals the show; he made me look forward to his next scene. Another humorous character is Violet’s sister, Jen, who plays the part of a teasing sister. She brings humor to the scary parts of the movie and her teasing makes it seem as if she and Violet are truly family. Meghann Fahy, as Violet, is incredibly well played. During the frightening scenes her face reads of fear and I really believed she was scared during those scenes. Drop has fantastic music that provides great transitions, adding suspense and excitement – and definitely made me hold on to my seat in anticipation. The soundtrack shifts from a scary scene to a calm scene, with smooth and unnoticeable transitions. The message of Drop is that, even when your situation is tough and it seems hopeless, never give up. Parents should be warned that there is cursing, strong violence, death, and hints of suicide. I give Drop 5 out of 5 stars and recommend it for ages 12 to 18 plus adults. It releases in theaters on April 11, 2025. By Charlotte L., KIDS FIRST!"
    },
    {
      "rating": "4/5",
      "review": "Enjoyable thriller. Good use of misdirection to keep the audience guessing, although many may say it was predictable."
    },
    {
      "rating": "4/5",
      "review": "I liked it, no crazy suspense to me tho. Guess it was mediocre thriller. But I’m no critic, I enjoyed it"
    },
    {
      "rating": "4/5",
      "review": "Very good mystery thriller. With surprise ending. Was worth going to see."
    },
    {
      "rating": "4.5/5",
      "review": "A very good mystery thriller. I had high hopes already from the director since he did Happy Death Day and this movie was great. They underused the dates character and also felt it was a little unrealistic but was a very good movie. The mystery with the ending is fantastic and tricks you in the beginning with the fake ending. Great movie in general to watch."
    },
    {
      "rating": "3.5/5",
      "review": "Drop is an enjoyable and approachable movie that offers a fun experience on multiple levels. It features a great pace, engaging characters, and outstanding acting that brings them to life. The film also includes some well-thought-out tactics that show respect for the material. This delightful balance makes it perfect for group outings, providing a fun night out with enough theatrical elements to justify a visit to the cinema. While Blumhouse excels in the genre, some of the suspense, thrills, and intensity are diminished by predictable storylines and less impactful climactic finishes. The trailers reveal much of the plot, leaving the challenge and intrigue in discovering who orchestrates the chaos."
    },
    {
      "rating": "2.5/5",
      "review": "Eh typical movie tbh"
    },
    {
      "rating": "5/5",
      "review": "Drop is a good movie"
    },
    {
      "rating": "5/5",
      "review": "Well done ! Keeps you guessing !"
    },
    {
      "rating": "2.5/5",
      "review": "Nothing thrilling or edge of your seat type movie tbh. Just a guessing game."
    },
    {
      "rating": "5/5",
      "review": "Twists and turns, intensity,"
    },
    {
      "rating": "2.5/5",
      "review": "Pretty good to start but some unbelievable things happened towards the end"
    },
    {
      "rating": "5/5",
      "review": "Loved it. Reminds me of the old thrillers back in the day. I think I had my hands in front of my mouth holding back a scream through most of the last half of the movie."
    },
    {
      "rating": "5/5",
      "review": "Awesome movie for the family to have fun."
    },
    {
      "rating": "2.5/5",
      "review": "Too long before she found the bad guy. Also not realistic for date to put up with all that!"
    },
    {
      "rating": "2/5",
      "review": "Very slow for a majority of the movie. The bulk of the action and details came at the very end and left you wanting more details and having plenty of questions"
    },
    {
      "rating": "5/5",
      "review": "A very well made movie with a lot of plot twist. A very on the edge of your seat movie."
    },
    {
      "rating": "3/5",
      "review": "A slow burn, but a satisfying conclusion, just as long as the viewer sets aside any semblance of realism. The whodunnit factor does keep the viewer guessing throughout the first hour."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie was a great thriller a lot of action was one of those movies were you have to think who's the bad guy the actors were really great .I would go see it again I would highly recommend this movie"
    },
    {
      "rating": "5/5",
      "review": "Muito bom do começo ao fim 🤩"
    },
    {
      "rating": "2.5/5",
      "review": "A bit too slow burner at the start considering the trailers and plot made it so obvious what was happening that it didn’t leave enough suspense. Instead I was impatient to try and get to an actual twist, when that finally happened it was a bit too obvious. A little bit of unrealistic action in the end saved it from being less stars."
    },
    {
      "rating": "5/5",
      "review": "Held my breath the whole time"
    },
    {
      "rating": "1.5/5",
      "review": "An avalanche of ridiculousness...."
    },
    {
      "rating": "4.5/5",
      "review": "Great Movie! Kept me guessing"
    },
    {
      "rating": "2/5",
      "review": "Fitfully entertaining but ultimately uninspired, Drop retreads ground better explored in Wes Cravens under-appreciated Red Eye. Meghann Fahy is engaging and sympathetic in the lead, but the movie leans too hard on twists that rarely are satisfying."
    },
    {
      "rating": "3/5",
      "review": "Don’t regret seeing it but I wished I would’ve waited til streaming slow beginning then rushed ending acting was good plot was a stretch descent movie but not something I would need to watch again"
    },
    {
      "rating": "5/5",
      "review": "Much better than I thought it would be! I loved the movie. My friend and I talked about the movie for about an hour after it was over, piecing together all the clues and understanding everything that happened! We had a fun discussion! The movie had top notch acting throughout with a tense storyline that paid off with a lot of action and a few funny lines in the final act. Glad I didn’t miss this one!!"
    },
    {
      "rating": "5/5",
      "review": "Love it, such a good film!!!"
    },
    {
      "rating": "4.5/5",
      "review": "A little cheesy but really fun movie. Really liked the ending."
    },
    {
      "rating": "4.5/5",
      "review": "I loved the movie. Kept me guessing as to who the villain in the restaurant was. The reason why they were going after her was kinda glossed over. in the end. Wish there was a little more time spent with the resolution of the mayor getting arrested and why they wanted Henry dead."
    },
    {
      "rating": "3.5/5",
      "review": "Really enjoyed this one tonight. Simple review would be that this movie is Red Eye (2005, Rachel McAdams and Cillian Murphy) re-done in a fine dining restaurant, and updated for the digital age. It's a fun, date night thriller (not horror) that's worth the watch. 7.6/10"
    },
    {
      "rating": "4.5/5",
      "review": "It's definitely one of the biggest surprises of 2025 when it comes to movies. This was amazing. It was almost perfect, but it was worth checking out. Christopher Landon has outdone himself with this one. With the direction, the camera work, the premise of it. Simplistic and works well form start to finish. So as simple as the plot goes, you have Meghann Fahy going on a date with Brandon Sklenar and suddenly, Violet, Meghann's character, starts getting these drops from this unknown user demanding that she does as she is told. One screw up and both her sister, played by Violett Beane, and her son, played by Jacob Robinson, get killed. First of all, as simple as the plot is, there are times that it does get predictable, but still feel that tense moment when it comes to these messages whether it's demanding Violet to do what she's told to what has happened if she doesn't listen. I was on the edge of my seat throughout most of the movie. It's also clever that you see the messages on screen to see what the mystery person is saying while working with the camera. Again, the camera work is one of the best parts of this film. Also, I have to admit that there are times that it does get formulaic, like when Henry, Brandon's character, says to Violet that he was about to leave until she convinces him to stay. It goes the same with the messages that Violet keeps getting. You do have to keep in mind that it's an intense moment when a guy with a gun hired by the person sending the drops is in your house where your sister and son are currently in. Now, there has been more backstory for both Violet and Henry, but I don't want to spoil too much. Let's just say that it really makes you want to root for these two to get together. I do see them having great chemistry as far as their acting goes. They were great. Wanna know who is also great? Jeffery Self as Matt, their waiter. I think him and the bartender, Cara, played by Gabrielle Ryan, also carried the movie with their acting, too. I won't spoil who the person is who is sending Violet these drops. I will say that they are a great kind of mastermind as they get their comeuppance near the end of the film. One last thing to talk about is the setting alone. For a plot so simple, the location works well when it comes to being in a restaurant. Having your first date after so long is great for being original. And yes, this is certainly a date movie worth checking out with your significant other. It is still a fun watch if you're single or aromatic like myself. Certainly one of those thrillers that I recommend checking out whether in theaters or when it hits streaming services. Plus, one of Blumhouses' better movies since they are usually hit or miss, if you ask me. With that said, I'm gonna give this film nine Matt cheering Violet and Henry on their first date out of ten. 9/10."
    },
    {
      "rating": "5/5",
      "review": "Far exceeded expectations. Suspenseful. Well written and acted. Everyone in my group loved it. Really glad I saw this in theaters."
    },
    {
      "rating": "4/5",
      "review": "Good movie but there are some plot holes and questions that I have but don't want to blow the movie for people..."
    },
    {
      "rating": "5/5",
      "review": "Really good thriller!! Very enjoyable for a first date movie"
    },
    {
      "rating": "1/5",
      "review": "Terrible storyline, very slow."
    },
    {
      "rating": "5/5",
      "review": "Great movie, start to finish."
    },
    {
      "rating": "5/5",
      "review": "Was a thriller and difficult to predict."
    },
    {
      "rating": "1.5/5",
      "review": "Worst movie I’ve see in a very long time. I am not sure why it has a great rating, or maybe I think I know why. Anyways bad horrible movie, all they do is talk smh"
    },
    {
      "rating": "5/5",
      "review": "The action come in the end but very good movie with suspense and make you think"
    },
    {
      "rating": "5/5",
      "review": "Great from start to finish"
    },
    {
      "rating": "3.5/5",
      "review": "It’s entertaining and acting was good. Not a movie Id Watch multiple times but still good"
    },
    {
      "rating": "5/5",
      "review": "My boyfriend and I enjoyed the movie very much! Liked all of the characters, the plot and the restaurant as location. Nothing to dislike except maybe the server - a bit too much and didnt really add to the movie. If I could rewrite, Violet would have been portrayed as a stronger (and still be pretty, good and kind) character and inflict more physical pain to the bad guys. After all, her son was in danger!"
    },
    {
      "rating": "5/5",
      "review": "On the edge of your seat type of movie"
    },
    {
      "rating": "3/5",
      "review": "It was entertaining and the leads did an adequate job."
    },
    {
      "rating": "5/5",
      "review": "Just breath taking and such amazing twists and turns in the movie."
    }
  ]
}