{
  "movie_name": "A Minecraft Movie",
  "reviews": [
    {
      "rating": "5/5",
      "review": "Great movie! Took my grandson but I thoroughly enjoyed it as well."
    },
    {
      "rating": "5/5",
      "review": "Super enjoyable for a family-friendly film! Took my 5 year old twins and they had a blast. I enjoyed the humor more than I thought it would. Definitely one of my top films of the year. We need more feel good movies!"
    },
    {
      "rating": "2.5/5",
      "review": "I found this to over acted and childish but suppose for the video game fans this is a highlight. No accounting for taste really"
    },
    {
      "rating": "3/5",
      "review": "Silly, Napoleon Dynamite-esque humor."
    },
    {
      "rating": "5/5",
      "review": "The movie is just how I would love it. If you played the game MineCraft then you would really associate with the movie! I was able to associate with everything and it was adventurous and entertaining!"
    },
    {
      "rating": "5/5",
      "review": "Fun, thrilling and fast paced movie, it will keep you entertained throughout Its run time. The humor is excellent and the comedic timing is just genius. It's a must watch in theaters."
    },
    {
      "rating": "3.5/5",
      "review": "I was never much into the game, so most of the references were lost on me. Regardless, the film was good family entertainment."
    },
    {
      "rating": "4/5",
      "review": "Funny movie. Kind of dumb in a lot of parts. If you grew up playing Minecraft and watching Minecraft YouTube it's got some fun references. Glad we saw it but could've waited till it came out on a streaming service"
    },
    {
      "rating": "1.5/5",
      "review": "The summary of my opinion would be bland and uninspired. There isn't much for a minecraft fans, and there is nothing there really if you're not a fan. The movie isn't good, but it isn't awful either, so it doesn't get ironically funny. It's bland, with a few funny moments. It seems like the director didn't really want to commit to the minecraft lore, so the minecraft world is more of a general context, but most things from the main storyline are actually not really minecraft related. The situations the heroes are in aren't really things that exist in minecraft and the way the heroes get out of the situation isn't either. There are many subplots that are really not executed well, they don't actually advance the story at all and they just resolve at a point in the 3rd act, because that's what is supposed to happen, but there is no actual build up towards that resolution. This, all in a movie that isn't that long and that could've used the time spent on the main storyline. The movie starts with a fair amount of exposition, that doesn't really serve the story at all. The full back story of Steve is entirely irrelevant in the movie. The bits that are relevant, are repeated later during the movie. So, yeah. I wouldn't recommend this. There is nothing much for a minecraft fan there. Mostly they mention things that are in minecraft (like red stone, elytra, etc.), but they don't really do anythign with it, and the world is a minecraft-like world, but that's it. It is a bit sad. These type of movies are never extraordinary, but I would say that it isn't that hard to make a good entertaining movie for the fans. The Super Mario movie (2023) is a good example. The story is average, but they commit to the Mario world, so it is fun for a Mario fan to watch. In this case, they managed to make a movie that I would say is worst for a minecraft fan (and that is saying a lot because I really think there is nothing there for a non-minecraft fan), because you are much more aware of what isn't there that could be and would make the story better. If you haven't seen it, don't bother. It's not worth it."
    },
    {
      "rating": "4/5",
      "review": "If youve played the game you will enjoy the movie."
    },
    {
      "rating": "2.5/5",
      "review": "Les filles ont aimé..."
    },
    {
      "rating": "1.5/5",
      "review": "I didn't like it it might be ok for like kids but teens and adults might not like it"
    },
    {
      "rating": "1.5/5",
      "review": "Jokes try very hard to land unsuccessfully. Logic doesn't make sense even within the scope of the game. Story lacks in thought. Minecraft concept and animations are good to earn a star."
    },
    {
      "rating": "0.5/5",
      "review": "The Video Game is 1 Trillion Times Better than this movie! Do not watch this movie! A massive disappointment..."
    },
    {
      "rating": "0.5/5",
      "review": "What a waste of time... Absolute trash... Don't watch it."
    },
    {
      "rating": "5/5",
      "review": "From the beginning to the very end the movie kept you interested. The pairing of Jack Black and Jason Momoa works. There seemed to be plenty of references to the game."
    },
    {
      "rating": "5/5",
      "review": "Danielle Brooks is hilarious!! Love her!!"
    },
    {
      "rating": "5/5",
      "review": "Absolute Cinema Me and \"the fellas\" enjoyed throwing pop corn at funny moments such as \"Chicken Jocky\""
    },
    {
      "rating": "5/5",
      "review": "My kids enjoyed it. Fun family movie"
    },
    {
      "rating": "4/5",
      "review": "I was kind of hesitant to see it, but it was my friend's choice. It turned out to be a pretty good movie. Very funny and entertaining!"
    },
    {
      "rating": "0.5/5",
      "review": "I couldnt believe how badly directed and created this movie was, we left half way through after spending crazy money to go. We were excited to see it previously its shameful it was created so bad."
    },
    {
      "rating": "5/5",
      "review": "I'll start with the fact that this is another super film adaptation of a popular game in the world, almost everything according to the canons of the game, graphics, battles and plot are at their best. First of all, this is a film for hardcore gamers. And so it is a wonderful, although more of a children's film, but a funny and cheerful film, I also recommend it to adults, after a hard day at work that's exactly what it is."
    },
    {
      "rating": "5/5",
      "review": "Better than some Super Mario movie. This is a real masterpiece."
    },
    {
      "rating": "1/5",
      "review": "The cineoplis they’re sucks"
    },
    {
      "rating": "4.5/5",
      "review": "wow it was so awesome, it inspired something in me to create something again and be more creative"
    },
    {
      "rating": "5/5",
      "review": "Movie was maybe a 7/10 but seeing this in theaters on release was a 10/10"
    },
    {
      "rating": "2.5/5",
      "review": "It's one of the most popular games currently available and maintains a large community among its most dedicated fans. That's why its leap to the big screen will be a huge commercial success and also a fun pastime to watch. The result is a decent movie, not a masterpiece, but quite entertaining and giving fans all the heart they needed. Directed by Jared Hess, it's a surprisingly well-made adaptation that, within the world it depicts, manages to be an adaptation that confronts us with a solid comedy, built with its own references, with that '80s touch and the absurd charm of those comedies from the early 2000s that, between the implausible and the human, gave you a refreshing moment in front of the screen. However, that's not enough to say that this adaptation is a completely well-rounded film, but it does have the advantage of being quite fun to watch and that keeps you connected to the screen at all times, spending a pleasant time with this group of characters. A big plus is the cast that has a good time on screen, especially Jason Momoa, who brings out his playful side, and Momoa's comic timing is particularly impeccable. Jack Black, meanwhile, is a great host who's impossible to hate and invites you to have a good time in this adventure called Minecraft. Parents will have more fun than expected with this film, while kids and Minecraft fans will be delighted to see their favorite game make its way to the big screen. That's the grand summary that defines the film. A great CGI work and a script that, despite being quite simple, presents us with a great lesson at the end. The director's indie side is a huge plus, giving the film its charm within the mainstream adaptation of this popular game. A fun movie that delivers on its own merits. It's not a great film, but it is a decent adaptation that ultimately delivers a simple, decent time-pass for those who aren't big fans of the video game, while for those who are, it's a moment they'll enjoy from beginning to end."
    },
    {
      "rating": "0.5/5",
      "review": "Cheesy and not worth the $."
    },
    {
      "rating": "4.5/5",
      "review": "The movie was great with awesome action comedy. And pretty solid voice actors"
    },
    {
      "rating": "3/5",
      "review": "It’s funny, however I think the movie is targeted more towards boys/males."
    },
    {
      "rating": "5/5",
      "review": "A fun and gory addition to the Final Destination series"
    },
    {
      "rating": "5/5",
      "review": "Chicken jocky, need I say more?"
    },
    {
      "rating": "0.5/5",
      "review": "i took my grandchildren to watch the minecraft motion picutre. the motion picture was not good, it was quite bad. my grandchildren: JEBEDIAH AND CORNELIUS. I LIKE TO NICKNAME HIM JEBBY AND CORNY. THEIR PARENTS DIED IN THE AZERBAIJAN AIRPLANE CRASH. AND THEY LIVE. WITH EM. I THINK THE MOTIOM PICUTRE WAS QUITE AFFECMO,VE TO PEOPLE WITH ATM. OVERALL I DIDN OT LIKE THE PRIOCE OF THE POCPORN. THNAK YOU FOR READING !!"
    },
    {
      "rating": "3/5",
      "review": "It was better than I thought it was going to be. My only complaint was that the theater is was shown it was unbearably hot. The lobby was nice and cool and the theater wouldnt turn the ac in in that room. Definitely the first time I was uncomfortably warm as opposed to being slightly cold."
    },
    {
      "rating": "2/5",
      "review": "Really wanted to like it. While there were some great references to the game, lots of missed opportunities and the story was a convoluted mess. Since Minecraft pretty much has no story, it was left wide open for a plot and they went the adolescent cringe route. Why is Steve portrayed as an overweight, grey bearded loud mouth? Ender Dragon? Just weird choices. It did well at the box office, but it wouldn't matter what they put in it, it was going to do well. That's how much Minecraft is loved. Just disappointed this is what we ended up with..."
    },
    {
      "rating": "5/5",
      "review": "Gabriel J. and Omar V. is a phenomenal Regal team member and Manager! I purchased tickets for matinee bc ofc they are cheaper but sadly missed the time! Gabriel was so professionally when I notified him of this, and then Omar switched our tickets to a later time and just charge the difference which was completely affordable, very pleased with my experience for my first time at any regal theater!"
    },
    {
      "rating": "1/5",
      "review": "Muito ruim, realmente horroroso, não é fiel ao jogo, não tem uma boa história própria, definitivamente não é um bom filme, tirando o CGI e os cenários que são maravilhosos"
    },
    {
      "rating": "5/5",
      "review": "kinda cheesy for adults but your kids will love it."
    },
    {
      "rating": "2/5",
      "review": "It is what it is. Kids liked it. Parents survive. Not my favorite"
    },
    {
      "rating": "1/5",
      "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
    },
    {
      "rating": "4/5",
      "review": "A really good movie, but it was kind of all over the place."
    },
    {
      "rating": "4/5",
      "review": "The story isn't really there, and the first five minutes were almost too cringey to bear. However, it's a movie for boys. As a gamer, it was fun to see the game mechanics played on screen, the homage to Techno was subtle yet powerful, and the movie made me laugh many times over. It's a simple movie. Nothing life changing, just pure entertainment. I removed one star because all those nay-sayers were right several times in predicting dialogue and how \"Uh, guys?!\" the vibes would be. I had higher hopes for the dialogue. Other than that though, I would see it again. Not to mention, the theater was full of little boys and their parents and to hear the literal squeals of glee the whole movie, and to hear them clap and scream for Chicken Jockey was awesome and I hope they all formed lasting memories."
    },
    {
      "rating": "3/5",
      "review": "Sometime boring but not Hard to watch"
    },
    {
      "rating": "4/5",
      "review": "Good. Except for all the songs. Definitely could do without."
    },
    {
      "rating": "2.5/5",
      "review": "Very bad movie but fun when your watching it with friends"
    },
    {
      "rating": "3/5",
      "review": "A Minecraft Movie Review: A Fun, Quirky Adventure The Good • Humor: The movie's humor is on point, with plenty of laugh-out-loud moments, especially when Jack Black and Jason Momoa are on screen together. Their chemistry is undeniable, making their scenes a joy to watch. • Visuals: The film's visuals are stunning, bringing the block-based world of Minecraft to life in a way that's both faithful to the source material and visually impressive. • Creativity: The movie celebrates creativity and self-expression, showcasing the importance of imagination and individuality. The Not-So-Good • Pacing: The pacing can be uneven at times, with some scenes feeling a bit disjointed from the rest of the story. • Plot Holes: Some plot points feel forced or underdeveloped, which can take away from the overall viewing experience. • Tone: The movie's tone can be inconsistent, veering wildly from slapstick comedy to action-adventure. Rating: 6.3/10"
    },
    {
      "rating": "5/5",
      "review": "LOL, 1 hour and 41 minutes of humor!!!!!!!!!!!!!!!!!!!!! Rated PG for Some Scary Images, Language, Suggestive/Rude Humor, and Violence/Action. Starring Jack Black (\"School of Rock\")!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "4/5",
      "review": "It was a good movie but not amazing. garret was dumb"
    },
    {
      "rating": "3/5",
      "review": "It’s not Citizen Kane. But it’s entertaining. From the get go you are put in front the fact that the film will be nothing but realistic. I totally understand the hype."
    },
    {
      "rating": "3.5/5",
      "review": "The Minecraft Movie is fun and full of amazing moments for fans of the game. It's coming to life with action, humor, and familiar game elements like creepers and crafting. (What I really appreciate is the tribute to Technoblade.) The story is simple to follow and not complex, but it also doesn't have many twists. It's more fun for kids and Minecraft enthusiasts than adults looking for something deep. Overall, it's a really good time just not amazing."
    },
    {
      "rating": "4/5",
      "review": "Good movie, very humorous and fun!"
    },
    {
      "rating": "0.5/5",
      "review": "Horrible movie. Tries too hard to be quirky and funny. Not even entertaining in a \"so bad it's good\" way."
    },
    {
      "rating": "3/5",
      "review": "They tried to make Jack Black to funny. Honestly think if they cast Steve as Anyone else this Movie would have been so much better. I like Jack Black but he ruined this movie for me, well not just him the writers for trying to make him funny and it just didn't work."
    },
    {
      "rating": "1/5",
      "review": "Painful to watch Poor acting and poorly written plot Would not recommend"
    },
    {
      "rating": "1.5/5",
      "review": "Jack Black works overtime to somehow bring joy and energy to an otherwise extremely confusing and cliche story. The cast, besides Black and Momoa, are given so very little to work with that they seem redundant. The boy playing the “main character” must be a producer’s son, he’s THAT forgettable. Of course, my 6 year old enjoyed it, but my teen who also plays Minecraft couldn’t stop cringing. And what year does it take place?! Why is everything 1980’s except their iPhones????"
    },
    {
      "rating": "2/5",
      "review": "I wish the five screenwriters who penned this had heeded the movie's theme about the limitless powers of the imagination... A missed opportunity, but there's enough visual spectacle (despite the endless explosions) and Jack Black's carrying on to make it watchable for kids and some cube headed adults."
    },
    {
      "rating": "4.5/5",
      "review": "It was chaotic and absolutely absurd and totally loved it. My kids really did like it. Fun and hilarious !"
    },
    {
      "rating": "5/5",
      "review": "Yes"
    },
    {
      "rating": "4/5",
      "review": "Took my 6 yr old nephew who said it was the best movie hes ever seen. Since hes into the game. For me, whose not into it, it was ok."
    },
    {
      "rating": "3/5",
      "review": "It was really goofy and pretty silly but not a bad way to pass the time with this movie. I just REALLY hope that Jack Black uses the money he made from this movie to buy a tread mill or join a gym. He REALLY REALLY needs it. Jason Mamoa is heading very quickly in that direction as well."
    },
    {
      "rating": "4/5",
      "review": "My daughter absolutely loved it, and that means everything to me!"
    },
    {
      "rating": "4/5",
      "review": "When I entered the cinema I had no expectations, since I had never played that game, but I really thought it was a very good and entertaining film, even the jokes they make were very good, I consider the film to be very well done."
    },
    {
      "rating": "5/5",
      "review": "Minecraft movie is fantastic!"
    },
    {
      "rating": "4/5",
      "review": "It's very entertaining with a good storyline."
    },
    {
      "rating": "0.5/5",
      "review": "It gave me a migraine."
    },
    {
      "rating": "5/5",
      "review": "Dying of laughter the entire time"
    },
    {
      "rating": "3/5",
      "review": "Dumb fun for kids what else did people want from a minecraft movie."
    },
    {
      "rating": "4/5",
      "review": "A Blockbuster Family Hit – Literally! 4 out of 5 stars I went in with low expectations and came out with pixelated joy. As a family who’s spent more hours in Minecraft than we’d care to admit (yes, even me – don’t judge), this movie hit the sweet spot: fun for the kids, surprisingly entertaining for the adults, and packed with just enough Minecraft spirit without feeling like a stretched-out YouTube tutorial. Jack Black is an absolute gem – chaotic in the best way – and Jason Momoa proves he can swing a pickaxe just as well as a trident. The rest of the cast? Surprisingly great chemistry, and they clearly had fun with it – which makes it all the more enjoyable to watch. This isn't a direct retelling of Minecraft gameplay (thankfully, no 3-hour tree punching montage), but rather a creative tribute to the world-building, adventure, and weirdness we all love about the game. Bottom line: the kids were glued to the screen, we laughed more than expected, and we all left the theater with that warm, blocky feeling. Would mine it again."
    },
    {
      "rating": "5/5",
      "review": "While A Minecraft Movie certainly has its faults, its target audience is going to eat it up. All of the children in my screening were having a blast, as are Black and Momoa in this movie. This movie was not made for me, and that is perfectly fine. But I can appreciate and understand that the people it was made for are going to love it."
    },
    {
      "rating": "2.5/5",
      "review": "Kids will like it but this is what happens when you focus group a movie to death. It will most definitely have a sequel since it’s raking in $$ but please God just let Jared Hess cook next time, and come up with a half decent storyline"
    },
    {
      "rating": "3/5",
      "review": "Not entertaining for kids"
    },
    {
      "rating": "3/5",
      "review": "Nothing great, but I mean what did you expect"
    },
    {
      "rating": "5/5",
      "review": "I went in knowing basically nothing about Minecraft, my little brother was a minecraft kid (he's pretty much grown up now) so I went to see it with him I loved it - I literally can't stop thinking about how happy this movie made me. It was silly, genuinely fun, and as someone who grew up in Chuglass, Idaho, I was overjoyed to see my hometown finally recognized in media."
    },
    {
      "rating": "5/5",
      "review": "Greatest movie of all time"
    },
    {
      "rating": "5/5",
      "review": "Had no expectations, was just taking my daughter and I loved it. So funny"
    },
    {
      "rating": "0.5/5",
      "review": "Multi dimensional screen with one dimension story"
    },
    {
      "rating": "5/5",
      "review": "Te voy hacer una corona mas grande"
    },
    {
      "rating": "5/5",
      "review": "My daughter loved this movie and would love to see it again and again!"
    },
    {
      "rating": "4.5/5",
      "review": "I think the big reason I liked this movie is just how it hit home. It was a movie about a game that many people grew up playing and they didn’t sacrifice that fact. The movie also had a fair share of actually funny jokes. The only issue with the movie is probably that they had a blandish storyline which was the worst thing ever but it wasn’t crazy good, and that they had Steve explaining things to much."
    },
    {
      "rating": "0.5/5",
      "review": "Disaster Movie, luckily for the studio this was aimed at kids, so many inaccuracies and the jokes fell flat, Jason Momoa was average at best and Jack Black tried to do something with it with his fun demeanor, but everything from the beginning to the end was awful and rushed. Please dont make that sequel thats scheduled to be released in 2028..."
    },
    {
      "rating": "4/5",
      "review": "You get entertainment while the kids have a blast."
    },
    {
      "rating": "0.5/5",
      "review": "This film Sucked, it was another soap mode made film, I didnt laugh one time, I thought it was just sick, to see 2 guys with their faces stuck into another mans butt as if it was funny."
    },
    {
      "rating": "4/5",
      "review": "Hilariously bad, but in a good way"
    },
    {
      "rating": "5/5",
      "review": "I walked into The Minecraft Movie expecting a fun, goofy little adventure. Something harmless and cute, maybe something that would make me smile once or twice and then fade from my memory like most video game adaptations tend to do. What I got instead was something wildly different—something that left me emotionally moved, artistically inspired, and genuinely changed. I’m not being dramatic when I say this movie shifted something inside me. It reminded me of what it means to create, to imagine, to heal. I didn’t just watch the movie—I felt it. First of all, let’s talk about the surprise that is the actual plot. I didn’t expect anything too deep, considering the source material, but the story manages to be both silly and sincere. Two siblings—Henry and Natalie—accidentally get sucked into the Minecraft world during a glitch while trying to escape their messy, grief-stricken real lives. There, they meet Garrett Garrison, played by Jason Momoa, a washed-up retro gaming legend who’s been hiding from his past. And of course, there’s Steve. Yes, that Steve. Voiced by Jack Black with his signature explosive energy and unexpected tenderness, Steve somehow became my favorite character in the entire thing. I don’t even like Steve in the game. He’s just a skin. But here? He’s a full-blown icon. Watching this mismatched team try to navigate biomes, mobs, and emotional baggage somehow works. It’s chaotic in the best way. There’s a running joke about crafting tables that never gets old, and a jaw-dropping mid-movie sequence where they have to outrun a horde of skeletons across a collapsing stronghold bridge made entirely of redstone-powered pistons. Visually, the whole film is stunning. The animation doesn’t just mimic Minecraft—it elevates it. There’s something surprisingly beautiful about seeing a cube-shaped world rendered with so much love and attention to detail. Every block has texture. Every lighting choice feels intentional. Watching a pixelated sunrise over an in-game savanna biome actually made me gasp. Like… why was that so emotional? But here’s where it gets personal. There’s a scene—somewhere in the second act—where the characters are camped out near a lava flow in the Nether, and they’re talking about how, in Minecraft, when everything breaks, you can just start over. You can rebuild. Respawn. Try again. I didn’t think much of it at the time. It was a quiet little moment tucked between louder scenes. But something about that idea stuck with me. After the movie, I kept thinking about it. About how life doesn’t always give you clean respawns, but how the spirit of starting over—that idea of taking what you’ve got, even if it’s nothing but dirt and wood, and building a life—is so powerful. I went home and opened Minecraft for the first time in, what, four years? My old world was still there. My messy, half-finished castle. My abandoned railway system. I looked at it with fresh eyes. Not as something I’d failed to complete, but something I could continue. I started mining again. Not for anything in particular—just for the joy of it. Just because I could. That’s what this movie did to me. It made me want to create again. And I haven’t even talked enough about the humor. The comedy in this movie is weird and delightful. There’s a zombie pigman band. There’s a group of villagers that worship a giant carrot statue. At one point, Garrett accidentally crafts 300 wooden hoes instead of a sword, and he just commits to using them in battle like twin nunchucks. And somehow, the movie makes fun of itself without ever becoming mean. It knows Minecraft is ridiculous. That’s what makes it special. And the movie never tries to make it something it’s not. It embraces the absurdity while anchoring it in real, heartfelt emotion. There are also some unexpected moments of brilliance from the supporting cast. Jennifer Coolidge plays a high-strung vice principal who gets stuck in a cave with a bunch of silverfish and decides to go full survival mode. She builds a mushroom-based empire and becomes a kind of in-game guru. I cannot explain how or why this works. It just does. Her line delivery? Impeccable. Her plot arc? Weirdly empowering. But at the core of the movie is a beating heart that I didn’t anticipate. A story about people—real and pixelated—learning how to connect, how to forgive, how to keep moving even when things fall apart. Minecraft, in its purest form, is about building something out of nothing. It’s about digging down deep, finding what’s buried, and making it your own. That metaphor lands hard in this movie. Maybe harder than I was ready for. I left the theater smiling like an idiot. Not because it was perfect—it wasn’t. Some jokes went on a little too long. Some character arcs could’ve used more development. But it didn’t matter. I loved it. Fully. Unironically. Because it made me feel something real. Joy. Nostalgia. Creativity. Hope. So yeah. Five stars. No hesitation. This movie reminded me what it felt like to be a kid again, discovering Minecraft for the first time. It reminded me how powerful a little blocky world can be. How much heart can exist inside a grid of squares. And most of all, it reminded me that even in the messiest, most uncertain parts of life, we can still build something beautiful. Even if it’s just out of dirt."
    },
    {
      "rating": "4/5",
      "review": "Went in with low expectations. The movie was far more fun than anticipated. Take the children in your life... you will have fun."
    },
    {
      "rating": "5/5",
      "review": "The Movie is a desert for anybody who played the games"
    },
    {
      "rating": "1/5",
      "review": "I'm confused. There were so many tropes in this movie, it's embarrassing. Who wrote this? A 10-year old? Terrible film. Absolutely terrible. Don't waste your time."
    },
    {
      "rating": "4.5/5",
      "review": "i liked it. it was good"
    },
    {
      "rating": "2.5/5",
      "review": "This film wasn't amazing yet again it was dreadful, it's really a fifty-fifty. However, I must say that it does not tickle my fancy; but that's just me."
    },
    {
      "rating": "3/5",
      "review": "La verdad nosé pero no megusta"
    },
    {
      "rating": "5/5",
      "review": "Loved it! Can’t wait for a sequel"
    },
    {
      "rating": "5/5",
      "review": "Minecraft movie this best movie"
    },
    {
      "rating": "0.5/5",
      "review": "It takes a game you love, shits all over it and then force-feeds the result of that to you for over an hour while trying to make every line a meme that can go viral."
    },
    {
      "rating": "4/5",
      "review": "For a videogame and kids movie, it was good. The visuals and storyline kept me entertained. I wish there were a few more Jack Black rock power ballads. I don't know if the girl and boy can sing, but something quieter could have been written for them, as well. However, the villains/bad guys might be too scary for little children; for example, the skeletons riding on top of giant tarantulas were terrifying !"
    },
    {
      "rating": "5/5",
      "review": "This movie was awesome! I have never play minecraft game before but heard it a lot of times but when I saw the movie it was fun and enjoying journey."
    },
    {
      "rating": "5/5",
      "review": "absolute peak, watched it with my friend twice, he cant stop quoting the movie out of sheer love for it. its the best movie in creation and he seems to agree with this too."
    },
    {
      "rating": "4/5",
      "review": "As a gamer here i though the movie was really funny and worth to watch, in the start i tought it as a lot of cgi but in the curse of the movie that felling disapeared, if they do another movie please try to hide the cgi the best you guys can."
    },
    {
      "rating": "0.5/5",
      "review": "One of the hideous products in years"
    },
    {
      "rating": "4/5",
      "review": "La película da en la nostalgia ya que incorpora elementos de las primeras personas que se han incorporado al mundo así mismo, el hacer referencia a la leyenda que es uno de los youtubers más importantes del universo del juego. Al mencionar que es una leyenda ese es una gran detalle."
    },
    {
      "rating": "4/5",
      "review": "It's Stupid as hell, but just as funny...Did I say it was stupid?"
    },
    {
      "rating": "5/5",
      "review": "This movie is an instant cult-classic. It's so hilariously bad that it's actually GOOD. The memes. Oh god, the memes that'll be mined from this movie (no pun intended.) Go in expecting absolutely nothing and enjoy the mine cart ride. You'll be laughing your ass off from start to finish."
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this , really fun movie"
    },
    {
      "rating": "1/5",
      "review": "This movie was really bad. Some scenes with Jason Momoa and Jack Black felt really violating to watch. It's not just a bad movie, but a bad adaptation of the Minecraft video game. The scene with the chicken jockey character was epic, but I don't understand why everyone started screaming, crying, and throwing things."
    },
    {
      "rating": "2/5",
      "review": "Very kiddy and not funny"
    },
    {
      "rating": "2/5",
      "review": "One can only take so much of Jack Black being over the top and Jason Momoa acting like an idiot. For a movie based on a game built around creativity, it sure lacked it."
    },
    {
      "rating": "5/5",
      "review": "my daughter and I have a great time, movie is not perfect but is fun a lot of the jokes are actually funny and good action"
    },
    {
      "rating": "0.5/5",
      "review": "It is an insult to children, that this is what studios think they want. I have played minecraft since 1.14. This is not minecraft. This is brain-rot in long-form."
    },
    {
      "rating": "3.5/5",
      "review": "I love this song!!😆😆❤️❤️👏🏻👏🏻 🎵🎶La-la-la-lava, ch-ch-ch-chickenSteve's Lava Chicken, yeah, it's tasty as hellOoh, mamacita, now you're ringin' the bellCrispy and juicy, now you're havin' a snackOoh, super spicy, it's a lava attack🎶🎵"
    },
    {
      "rating": "4/5",
      "review": "My boys absolutely loved the Minecraft movie! If your kids play Minecraft, it's a must-watch."
    },
    {
      "rating": "5/5",
      "review": "I loved the scene where Garrett and Steve explored each others bodies."
    },
    {
      "rating": "3/5",
      "review": "It wasn't the worst movie, but not the best either. It had its funny moments, but I didn't just burst out laughing so hard it hurt either. So I think a 3 star is fair if not generous."
    },
    {
      "rating": "5/5",
      "review": "kids are SO happy - tip the staff if u throw popcorn to celebrate"
    },
    {
      "rating": "4/5",
      "review": "ABSOLUTE CINEMA 🙌🏼"
    },
    {
      "rating": "0.5/5",
      "review": "This hurts to write since this is my favorite game of all time. Terrible writing and direction. It felt like a half-put together plot mashed in with random Minecraft elements. Hard to sit through due to how boring it was. Disgusting to even call this a Minecraft movie."
    },
    {
      "rating": "5/5",
      "review": "My boys absolutely loved the Minecraft movie! If your kids play Minecraft, it's a must-watch. The film brings the game’s world to life with clever use of characters and the classic blocky look. Surprisingly fun for adults too—well done, creative, and visually cool. Great family movie!"
    },
    {
      "rating": "3.5/5",
      "review": "If your not familiar with the source material or haven't seen a video game movie ever before than this should'nt be the first you ever see. But if you have it is an entertaining time. It's never boring, filled with life, stupidity, and action. It really doesn't have anything clever, thought provoking, or any deep character development though. It makes sense and the things in the world are consistent. It does assume you've played the game and only explains the bare minimum which to Black's credit he does a great job at. He never sounds like a souless NPC just explaining plot he does it with an understanding of what he's saying and sounds like a actual person. Everyone else isn't bad. Momoa would be second in this and the kids are alright enough but probably the weakest things. Coolidge and her sidegag plot is so pointless and could've been cut completely. The special effects and set design are pretty good actually and there is a lot of practical set design which was suprising and makes it so they can do more with the camerawork. I appreciated that. Yes there will be tons of moments that go over your head here but it makes sense on a barebone story level. If your a fan of any actors in this or the game give this a shot. But if not,, see some other video game movies or play the game first before. Defintely can see this being a Millenial/Gen Z \"Rocky Horror Picture Show\" type of flick for years to come."
    },
    {
      "rating": "5/5",
      "review": "Even though the movie had a bit of backlash for not being \"Minecraft\", it was literally MINECRAFT and I loved every second of it because atleast references were put in."
    },
    {
      "rating": "4/5",
      "review": "A fun and adventurous movie! Full of laughs and excitement!"
    },
    {
      "rating": "5/5",
      "review": "You knew this movie will be quirky with this cast and it works. It’s reminiscent of time spent playing the game, doing crazy things for the thrills. If you don’t like this movie, it’s probably a you problem. You’re missing the Easter Eggs and have likely rarely if ever played the game. For those who haven’t, there’s still plenty to appreciate as several nuances are brought over from other film franchises."
    },
    {
      "rating": "5/5",
      "review": "My kids love this movie so much"
    },
    {
      "rating": "2.5/5",
      "review": "Woth watching if you are bored and want to watch a mediocre funny movie."
    },
    {
      "rating": "5/5",
      "review": "It's a good movie to see in family"
    },
    {
      "rating": "0.5/5",
      "review": "Good actors but lacks character development and relation. Jokes don’t land and one of the “bad guys” acts nice and it just doesn’t fit. I’ve never left a movie theater early until today. It was boring."
    },
    {
      "rating": "5/5",
      "review": "THIS THE BEST FILM EVER MADE IF THERE WAS A 69,000,000,000 STAR I WOULD PUT IT THERE"
    },
    {
      "rating": "5/5",
      "review": "They could have toned down Jason Momoa's character a bit, but overall a good and funny movie."
    },
    {
      "rating": "5/5",
      "review": "We didnt have high expectations, but we were pleasantly surprised! Both the adults and kids were cracking up the entire movie. Super entertaining!"
    },
    {
      "rating": "3/5",
      "review": "The movie is funny and fun to watch, it's nostalgic. But I feel like the film lacked a lot of emotion. It's so funny that it forgets to make the viewer emotional."
    },
    {
      "rating": "5/5",
      "review": "My son and I went on Mother's Day. He loved it. It was a cute movie for parents too!"
    },
    {
      "rating": "3/5",
      "review": "A Minecraft Movie celebrates creativity and friendship, but it is for kids. Adults can find a few jokes funny, but A Minecraft Movie focuses on younger audience because of the games. Also, people who haven’t played the games or kept up with the pop culture of this game won’t understand a few refrences and parts of the movie."
    },
    {
      "rating": "3.5/5",
      "review": "Kids had fun, I took a few naps."
    },
    {
      "rating": "5/5",
      "review": "Its perfect for kids and even has some moments in there to keep adults interested and laughing, now the only thing you must know is it is pretty cheesy and you have to like that sort of comedy to laugh, was a great movie for myself and family!!"
    },
    {
      "rating": "3/5",
      "review": "Fun for the kids but felt super loud & chaotic"
    },
    {
      "rating": "3.5/5",
      "review": "Ok, so I went with a group of friends, only four of us went to go see it, so that made it a lot funnier (Maybe I'm a bit bias because I got to sit next to the girl I have a crush on). It's not a movie that you watch by yourself to take seriously, like the game. It's a movie you watch with fellow Minecrafter's to make fun of it. I loved going to see it with my friends and I would do it again."
    },
    {
      "rating": "1/5",
      "review": "I wanted to like this movie because I love Jack Black and Jason Momoa. But it was so disjointed and I had a hard time figuring out why I should care about what was happening. My kid loved it, but thats the only nice thing I can say about it."
    },
    {
      "rating": "3/5",
      "review": "The kids enjoyed the fight scenes and the Lava Chicken song. As the parent, we dislike the suggestive content. Overall good movie."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible in all aspects. Terrible acting. Terrible story. Just Terrible. Ugh. I hated the entire movie."
    },
    {
      "rating": "4.5/5",
      "review": "“CHICKEN JOCKEY‼️🗣️🔥🐔”"
    },
    {
      "rating": "3.5/5",
      "review": "We enjoyed the movie a lot.my daughter plays Minecraft and enjoyed all the things from the game"
    },
    {
      "rating": "5/5",
      "review": "Loved It! Chicken Lava!!!"
    },
    {
      "rating": "3/5",
      "review": "It was all go go go and no down time to enjoy it. It was a lot to follow, my kid fell asleep."
    },
    {
      "rating": "4/5",
      "review": "Better than expected."
    },
    {
      "rating": "5/5",
      "review": "Movie was great and kid friendly , my daughter loved it ."
    },
    {
      "rating": "5/5",
      "review": "Loved every minute of it. Casting was perfect. Ideas were spot on. I did not think it would be possible to make a great movie out of this game. How wrong I was."
    },
    {
      "rating": "0.5/5",
      "review": "I have never sat through a film and felt so much nothing before. I'd heard bad reviews but still went to the cinema with an open mind, hoping to enjoy a film with my kids. Found myself staring at the floor lights that guide you to the exit just to take a break from the tedium. Even \"chicken jockey!\" landed flat. Cannot understand why, what or how anyone is finding anything to enjoy about this film."
    },
    {
      "rating": "5/5",
      "review": "I just love jack black in anything, he is a great actor"
    },
    {
      "rating": "5/5",
      "review": "It was an interesting and cool movie. The ending was super good! (8 year old son)"
    },
    {
      "rating": "1/5",
      "review": "Only for kids. And, AMC Menlo Park food at your seat only works if you order when you buy the tickets. Dumb! imho."
    },
    {
      "rating": "5/5",
      "review": "I like very much, is so funny..."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible movie. Had to force myself to stay awake. I could hear my husband snoring, it was so boring."
    },
    {
      "rating": "4/5",
      "review": "Entertaining and goofy"
    },
    {
      "rating": "1/5",
      "review": "My daughter didnt get to watch the whole movie I tried canceling to just get it the next day but I wasnt able to"
    },
    {
      "rating": "4/5",
      "review": "This movie was harmless fun."
    },
    {
      "rating": "5/5",
      "review": "Movie was beyond epic! Jack Black always makes movies instant classics!"
    },
    {
      "rating": "5/5",
      "review": "So much references!"
    },
    {
      "rating": "3.5/5",
      "review": "It turned out so-so even taking into account that the scriptwriter changed quite often. I remember the animated series would have been better. Rating 6.3/10"
    },
    {
      "rating": "3.5/5",
      "review": "From the POV of a person who grew up playing Minecraft and is really knowledgeable in internet culture, this movie was so good. If you go into the movies and don't take it seriously at all, I swear you will leave the theatre with a smile on your face. If you go in expecting some really good plot and stuff like that, this isn't for you."
    },
    {
      "rating": "5/5",
      "review": "CHICKEN JOCKEY!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "Non-sense you can follow! I love it!!"
    },
    {
      "rating": "5/5",
      "review": "It was the PERFECT movie to share with my son on Mother’s Day 2025!"
    },
    {
      "rating": "4/5",
      "review": "For what it is, it is very entertaining. Cheesy moments, but it is a bit of a comedy based on an action packed kids game where sheep are pink and square, villagers are passive and square, and special knowledge is required to mine or craft anything. So one would expect some cheesy moments, right? All the game references were completely understood by kids who play the game. Be sure to stay until the very last credit is shown."
    },
    {
      "rating": "1/5",
      "review": "A bit flat. There is kind of a story but it is disjointed. Not worth the expense of a cinema trip. Wait for it to appear on TV so you don't have to watch it."
    },
    {
      "rating": "1/5",
      "review": "Unwatchable in my opinion"
    },
    {
      "rating": "0.5/5",
      "review": "trash, horrible don’t waste ur time and money"
    },
    {
      "rating": "5/5",
      "review": "chicken jockey was a overhyped scene jack black had a great time with this movie just wish it was animated rather then it being live action"
    },
    {
      "rating": "2.5/5",
      "review": "Any stars it got is because the kids loved it. My husband and I were not impressed. Jack Black came through with more original songs but that was the only benefit to having him in the film."
    },
    {
      "rating": "1/5",
      "review": "so silly the kids fell asleep."
    },
    {
      "rating": "4/5",
      "review": "The action never stops! So random but quite entertaining."
    },
    {
      "rating": "4/5",
      "review": "Genuinely super funny and exciting movie, very nostalgic too!"
    },
    {
      "rating": "5/5",
      "review": "Everything about the movie was so cool"
    },
    {
      "rating": "4/5",
      "review": "Loved the jokes in the movie."
    },
    {
      "rating": "5/5",
      "review": "Loved how the movie captured the concept that ones creativity, comes from one’s own imagination. Imagination is limitless."
    },
    {
      "rating": "5/5",
      "review": "A mi nio le encant por l fuimos toda la familia l es sper fan de minecraft excelente pelcula mucha accin"
    },
    {
      "rating": "2/5",
      "review": "it's an ok kids movie."
    },
    {
      "rating": "3/5",
      "review": "It's a dumb funny and of movie. The humor is very on the nose and self-deprecating in many places. If you're in the mood for a silly movie, it's a good cheap thrill."
    },
    {
      "rating": "5/5",
      "review": "Comical...kids loved it."
    },
    {
      "rating": "5/5",
      "review": "I had no expectations for the movie. It just looked fun. It far exceeded expectations. Jack black and Jason momoa were amazing together and the music was so entertaining. We literally laughed til we cried.."
    },
    {
      "rating": "4/5",
      "review": "Saw Minecraft as a family myself, my wife and 12 year old daughter and we all thoroughly enjoyed it, especially my daughter who is just Minecraft crazy, and wants a sequel as soon as possible."
    },
    {
      "rating": "1/5",
      "review": "Im not a child. This was a childs movie. It was dumb."
    },
    {
      "rating": "4/5",
      "review": "My grandson who is 8 yrs old loved it! Also, the whole audience were singing along to the songs."
    },
    {
      "rating": "2/5",
      "review": "Movie was pretty bad. I love Jack Black and I love Momoa-but the movie was like watching a sped up commercial. It was all way too fast and storyline was meh. My son was so disappointed. Mario Bros was like that too. It’s like the movie makers are trying to wow kids with bright colors and everything run through fast. They could have made this movie really awesome."
    },
    {
      "rating": "5/5",
      "review": "Great movie took the kids to see and I loved it"
    },
    {
      "rating": "4.5/5",
      "review": "It is a good movie I watched it in theaters and it was good and i rate it 8/10 but the memes were a 10/10"
    },
    {
      "rating": "4/5",
      "review": "I enjoyed it very much. Just some of the adult humor was not appropriate. Otherwise loved it."
    },
    {
      "rating": "5/5",
      "review": "My son loved this movie so glad Minecraft came out with a movie for Minecraft lovers and finantics"
    },
    {
      "rating": "4/5",
      "review": "I thought this was a fun movie, with a lot of laughs, and every actor was likeable. This was a good escape, and I was not confused or bored at all. I knew very little about Minecraft, but my kid is a huge fan. They enjoyed, I enjoyed it, and you'll enjoy it. Garbage Man was my highlight."
    },
    {
      "rating": "4/5",
      "review": "The crowd didn't get into it. (No throwing popcorn for \"chicken jockey\")"
    },
    {
      "rating": "5/5",
      "review": "Insane and makes no sense, but great and funny!"
    },
    {
      "rating": "5/5",
      "review": "Very well done and entertaining!"
    },
    {
      "rating": "5/5",
      "review": "took my son for his birthday. he loved it! thought it was cute myself"
    },
    {
      "rating": "5/5",
      "review": "It's a good movie but when Steve says: CHICKEN JOCKEY it got to bid"
    },
    {
      "rating": "1/5",
      "review": "A very silly and childish movie with filler characters and very forgettable, full of jokes for little kids. It's a bad movie and doesn't deserve any success."
    },
    {
      "rating": "4/5",
      "review": "I have never seen it before"
    },
    {
      "rating": "4/5",
      "review": "My teenagers loved the movie. Laughed so hard. Worth seeing!"
    },
    {
      "rating": "0.5/5",
      "review": "Literally terrible. I know its a kids movie about a video game, but it was the worst movie Ive ever seen."
    },
    {
      "rating": "5/5",
      "review": "I thought the movie was very entertaining and funny to both the adults and children in our group."
    },
    {
      "rating": "0.5/5",
      "review": "Unless you play the game, you’re totally lost through the whole movie and they try to make a successful movie like Mario Brothers and they didn’t even come close"
    },
    {
      "rating": "5/5",
      "review": "Fun, Fun, and more fun. absolutely silly and enjoyable."
    },
    {
      "rating": "5/5",
      "review": "Took my kids to see it..I know absolutely nothing about Minecraft but Jason Mamoa and Jack Black were hilarious!! I loved this movie and will watch it again when its streaming."
    },
    {
      "rating": "5/5",
      "review": "Great movie for kids and kids at heart."
    },
    {
      "rating": "4/5",
      "review": "Surprisingly really good!"
    },
    {
      "rating": "4.5/5",
      "review": "I think it is a very good movie."
    },
    {
      "rating": "5/5",
      "review": "Chicken jockey was the best part bro"
    },
    {
      "rating": "4/5",
      "review": "Fun for all ages, even if you know nothing about Minecraft."
    },
    {
      "rating": "0.5/5",
      "review": "This was possibly the worst movie I've ever seen"
    },
    {
      "rating": "0.5/5",
      "review": "This movie gave me trauma and I will likely have PTSD and will speak on in during therapy next week."
    },
    {
      "rating": "3/5",
      "review": "A couple of funny moments, Jack Black is great in this. The promotional doesn't overplay what the movie is, it's just a silly movie."
    },
    {
      "rating": "4.5/5",
      "review": "I thought the movie was better than I expected with the fun story line and comedy and obviously Jack Black playing Steve I had a great time watching with friends would recommend!"
    },
    {
      "rating": "1/5",
      "review": "It was torturous to sit through, and I like almost everyone in it. It still was awful. The effects, and this show is ALL effects, may have been designed to mimic the game, but just came off looking really cheap. My daughter thought it was funny. So there was that."
    },
    {
      "rating": "5/5",
      "review": "Greatest movie of our generation. If you like jack black you’re gonna love this movie. Bro just understands our tism"
    },
    {
      "rating": "5/5",
      "review": "A brilliant and funny movie that perfectly brings the game of Minecraft into reality, along with the awesome and funny duo of Jack Black and Jason Momoa makes it even more brilliant!"
    },
    {
      "rating": "4.5/5",
      "review": "Mi niño interior fue muy feliz en esta hermosa experiencia de Minecraft en la pantalla grande, son ligeros detalles que tal vez pudieron ser mejores, pero muy buena película."
    },
    {
      "rating": "3/5",
      "review": "It was your typical kids good guys/villians, but funny with music that was cute (My grands already knew the words.)"
    },
    {
      "rating": "2.5/5",
      "review": "Minecraft: O Filme, Não é tão ruim assim, Mas ele conta uma história muito infantilizada, Oque não é ruim, Portanto poderiam ter abordado isso de uma forma totalmente diferente, O filme não consegue nos conectar com nenhum dos personagens, A não ser o próprio Steve, O filme é até que bonito visualmente, Mas tá muito longe de ter deixado eu(pelo menos), contente com o resultado final, Minecraft é um filme que usa da desculpa de ser feito voltado as criança para poder fazer as coisas de uma forma MUITO simples."
    },
    {
      "rating": "0.5/5",
      "review": "This is loosely written CGI Brianrot. Fun is not merely enough of an excuse."
    },
    {
      "rating": "5/5",
      "review": "The movie is literally so stupid but it's atleast better then wtv tf snowhite was.i love this with all my will"
    },
    {
      "rating": "4/5",
      "review": "super entertaining, kids laughed, I laughed."
    },
    {
      "rating": "3/5",
      "review": "ok movie,not much plot but still fun."
    },
    {
      "rating": "4.5/5",
      "review": "If you turn your head off and prepare yourself for the nonsense you are about to see you will have the time of your life!"
    },
    {
      "rating": "1/5",
      "review": "Watched it in a completely empty theater and it was trash. I was going in expecting a dumb movie but that I would be dying laughing, BUT NO!!! It wasn’t funny!!! No at all!!! My friends and I were begging for potty humor by the end!! The only scene that was mildly funny ended up being extremely uncomfortable 😳 They have a scene that implies a lot with two guys on top of each other. At first it was funny but then it was just sexual 💀 DONT WATCH!!! Also it makes me sad that they made jack black seem gay… seen him in other movies and it just didn’t fit his character"
    },
    {
      "rating": "5/5",
      "review": "Great movie, loved it! Kids loved it. Don’t let the lower critic scores deter you from seeing this movie. It was original, funny, and the acting was fantastic. I think instead of the buffoon critics who ranked it in the 40 percentiles should be replaced with kid critics."
    },
    {
      "rating": "5/5",
      "review": "Absolute must see. 10/10"
    },
    {
      "rating": "3.5/5",
      "review": "Well...there is a reason why this film isn't called THE Minecraft Movie. It's not meant to be a definitive statement on an iconic video game, it's just meant to be a silly family-friendly romp that revolves around the Minecraft IP. A promotion from \"A\" to \"The\" is likely to be done in a potential sequel, and this film's success clearly indicates that such a thing is in the cards for Warner Bros. There's not a lot of meaningful character development and the emotional scenes tend to fall flat when you remember that this film is set over the course of barely a single day, and isn't operating under 24-style tension with only two characters having a meaningful connection to each other. It's basically an inferior version of the Jumanji reboot-quels without the gimmick of those films. Nevertheless, there's still fun to be had in A Minecraft Movie with well-rendered CGI, Jack Black and Jason Momoa hamming it up (though the latter does end up at times feeling like a rehash of Uncle Rico from Napoleon Dynamite), a couple of amusing gags, a fun \"Mad Max: Fury Road\"-style chase scene and a feeling that the filmmakers were trying to be respectful to Minecraft fans. There's a reason why the Technoblade tribute is considered a signature scene, at least one unrelated to the memes, anyway. Shame it comes off as random for people locked out of the loop. At least put an \"In Memoriam\" in the end credits for some context. Also, this Minecraft film sure likes to murder characters onscreen, doesn't it? Never thought the guy who directed the funny Jack Black luchador movie had it in him to go about \"unaliving\" some of the flora and fauna of Minecraft. It's almost as if it's based off of a survival game or something. A clichéd but still reasonably popcorn-friendly video game movie which isn't on the same level as the Super Mario Bros. or Sonic movies, but isn't trying to be like them either. It can certainly take pride in being called \"The Rocky Horror Picture Show of video game movies\"...that quote had better be on the back of the DVD & Blu-ray cases."
    },
    {
      "rating": "3/5",
      "review": "It's what it needs to be, an entertaining, goofy movie. My daughter, who is a big Minecraft fan loved it."
    },
    {
      "rating": "2/5",
      "review": "Generic, not funny and very predictable"
    },
    {
      "rating": "5/5",
      "review": "Fun popcorn movie with my daughter who loved it and the cameos from Streamers she knew."
    },
    {
      "rating": "1/5",
      "review": "The whole movie felt like a joke and not like a minecraft movie at all. Fans deserve better other than this peice of garbage. The story vibe and music was horrible the only thing they did right was how Minecraft looks. The cast sucks too. Nice that technoblade and dandtm where there tho…"
    },
    {
      "rating": "2.5/5",
      "review": "It was pretty good, but the CGI was not well textured, and the acting wasn't the best. The rest of the movie was good, the funny scenes, the iconic scenes, and the story itself. Wouldn't really recommend, but it isn't bad."
    },
    {
      "rating": "3/5",
      "review": "Not bad, a popcorn flick"
    },
    {
      "rating": "2/5",
      "review": "Solía ser fanática de Minecraft, así que considero que puedo criticarla. Honestamente, no me gustó, fue entretenida por momentos pero en general me pareció bastante ridícula y sin sentido, no simpatice con ninguno de los personajes, la trama la encuentro floja. Lo único bueno que considero yo son los guiños al videojuego y el post-crédito final."
    },
    {
      "rating": "5/5",
      "review": "everything was fantastic"
    },
    {
      "rating": "2/5",
      "review": "Jack black carried it, cgi wasn't good and alot of the acting wasn't good either, minecraft should've never gotten a movie"
    },
    {
      "rating": "4/5",
      "review": "The movie is honest from the very beginning sequence of the film as to what tone is intended with it and what it wants to communicate. And it does a good job maintaining that tone and message throughout the movie. As long as you understand what it is you're watching, you know this isn't a flick that takes itself serious, it's meant to be fun, it's meant to provide nostalgia for Minecraft fans, it offers a slight message encouraging creativity, but it doesn't shove it down your throat, I saw no political undertones to press anybody's buttons, it's just meant to be a bucket of buttery popcorn fun and easy amusement with the spouse and kids, something people of every walk of life can connect over, which is needed. The character development isn't very in-depth and it isn't meant to be, however, Danielle Brooks as Dawn provided a very motherly presence, especially to Emma's character, Natalie. Emma is an okay actress, she mostly looks surprised every time I see her on screen, but she did a decent job portraying a sister with a very tragic and important task of looking after her younger brother as an unfortunately placed parental figure. And I did find myself caring about the character. Sebastian as Henry, played a kid who coped with his loss with creativity, which he found in this new world that opened up to him. Of course, Jack Black is Jack Black. Nothing much more to say about his performance. Jason Mamoa, he did a decent job playing a down on his luck quasi-celebrity, known for video game exploits and trying to survive off of a dying business. Nothing deep to be said about his character, I mean... I guess his story arch was that he needed a friend? *Shrug* There were no seat-gripping climactic moments. There were no real stakes other than Natalie's protective duty over Henry, and I wasn't exactly biting my nails on that one either. It was just a silly romp in video game nostalgia, in a colorful and quirky kind of CGI world, with a cast of outcasts you didn't mind spending time with. It also had some very faint Napoleon Dynamite vibes, in my honest opinion, which, isn't a good or bad thing. Four stars seems reasonable."
    },
    {
      "rating": "4/5",
      "review": "Some people going hate on this movie but it’s a fun entertaining movie. I recommend this movie for laughs and a fun time"
    },
    {
      "rating": "3/5",
      "review": "The movie knows its silly, so it has fun with it. If you go in as a kid or for the memes you will enjoy it. It felt like a fever dream and I think without Jack Black it would have been a flop."
    },
    {
      "rating": "5/5",
      "review": "We went in thinking this film would be simply a time-passer. But, it turned into a fun and funny romp... full of awesome CGI graphics. Momoa out-funnies even Black. Nice cast overall. Lots of audience clapping at the end. 👏 👍 😁"
    },
    {
      "rating": "3/5",
      "review": "To me it wasn't all that. Had some laugh yes but it was corny."
    },
    {
      "rating": "4.5/5",
      "review": "Life changing message and very well done adaptation!!!"
    },
    {
      "rating": "5/5",
      "review": "Myself & my children loved it! Jack Black - Legend.. La La Lava Chicken !! 🐔 🔥"
    },
    {
      "rating": "5/5",
      "review": "CHICKEN JOCKEY! WATER BUCKET… RELEASE!"
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing beyond what words could describe as i absolutely loved this movie, and I can't wait to get it when it comes out soon."
    },
    {
      "rating": "1.5/5",
      "review": "This movie is unwatchable, people said chicken jockey and i got rained on by popcorn, but other than that aside, my only thing that i love is jack black and jason momoa. Why is this movie so unwatchable, i literally held my head when they david or dan, THE KID WHO IS IN THE RED HOODIE shows up. why does he keep showing up all the time, this actor sucks. Flint and STEEEEEL ChIIIIIcken JockEYYYYYY I AM STEEEEEEEEEEEEEEVE"
    },
    {
      "rating": "2.5/5",
      "review": "Filme bobinho para garotada. Vale a pena levar o filho que gosta do jogo."
    },
    {
      "rating": "5/5",
      "review": "Jack Black & Jason Momoa bring an epic & wholesome experience together on the big screen. This movie was truly amazing & funny, great for a family friendly film!"
    },
    {
      "rating": "3.5/5",
      "review": "as a minecraft player, this movie was ok, it was not as good as it could have been, the story felt rushed and really bland, some parts were very cool and cinematic but the rest of it kinda was a drag"
    },
    {
      "rating": "5/5",
      "review": "Such a cute movie!!!"
    },
    {
      "rating": "0.5/5",
      "review": "So dumb n Jason momoa really has really went down hill"
    },
    {
      "rating": "4/5",
      "review": "Good movie. My son and I enjoyed it."
    },
    {
      "rating": "3.5/5",
      "review": "It was very cool. Not the best but it did what it needed to do."
    },
    {
      "rating": "5/5",
      "review": "Great movie! Even though it had a few corny parts. All in all, it was very enjoyable! 😁"
    },
    {
      "rating": "4/5",
      "review": "It's good for younger players but doesn't have the same appeal for older players. And also the theater can get kinda crazy."
    },
    {
      "rating": "2/5",
      "review": "Terrible effects, dogshit writing, but above all my biggest problem was how that kid killed that Enderman so easily by just blindly swinging"
    },
    {
      "rating": "4/5",
      "review": "Chicken jockey! Fun movie. Movie."
    },
    {
      "rating": "5/5",
      "review": "This was the perfect 🎬 movie❗️The cast meshed well, the storyline was smooth, the graphics were 💯, and the songs 🎵 ⁉️🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽❗️ Way to go❗️❗️"
    },
    {
      "rating": "1.5/5",
      "review": "I was tempted to turn it off within the first 45mins then again 20 minutes later but decided to keep going, was glad for it to finish:"
    },
    {
      "rating": "2/5",
      "review": "“A Minecraft Movie” is absolutely absurd and has no substance to speak of, but owns it and doesn’t try to be anything more."
    },
    {
      "rating": "3/5",
      "review": "Everyone wants to sue me when I hit them with my Jeep Grand Cherokee."
    },
    {
      "rating": "5/5",
      "review": "I like it because the songs and the lil cute animals and I don't like it I love it"
    },
    {
      "rating": "5/5",
      "review": "greatest movie oat"
    },
    {
      "rating": "5/5",
      "review": "Jason Momoa- you want me to fight the chicken *Zombie falls in the chicken* Jack Black- Chicken Jockey *Cinema Goes ballistic"
    },
    {
      "rating": "2/5",
      "review": "It was undoubtedly an entertaining watch, but not because it was well written, nor was the plot very engaging. It was definitely fun for meme culture and the 'so good it's bad' crowd."
    },
    {
      "rating": "3.5/5",
      "review": "If you've played minecraft, it's worth a watch. If you've never played minecraft, don't bother."
    },
    {
      "rating": "5/5",
      "review": "I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!! I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!! I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!! I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!! I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!! I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!! I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!! I loved it when Jack Black said chicken jockey and then the crew chicken jockeyed all over the place. PEAK MOVIE!! CHICKEN JOCKEY!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "Minecraft is an upbeat, mild-mannered film with a relevant take-home message. It should appeal to younger children and have adults chuckling aloud. No need to know how to play Minecraft to enjoy Jack Black singing (Steves Lava Chicken is sublime), Jennifer Coolidge finding ditsy love, and Jason Momoa wearing pink as only he can. Whats not to like?"
    },
    {
      "rating": "5/5",
      "review": "Enjoy it for what it is. Men acting like children, having fun, being over the top and making kids laugh. Loved it for what it was! My 5 year old was smiling and laughing throughout the movie!"
    },
    {
      "rating": "2/5",
      "review": "There are some obvious criticisms. The Intro feels like the creators assume we've never played Minecraft and felt dull and uncaptivating. It made the rest of the movie incredible by comparison. Yet the whole movie was mildly funny, mildly interesting, kinda heart warming. It was just okay. If other people never meme'd it, I don't think any part of the movie would have stood out."
    },
    {
      "rating": "2.5/5",
      "review": "Maybe I'm to old but I was at a lost for what was happening in the movie. Had great moments that my kids loved but other then that a lack luster story that most would forget by the end of it."
    },
    {
      "rating": "5/5",
      "review": "Full of entertainment for the entire family. kids laughed the whole movie."
    },
    {
      "rating": "5/5",
      "review": "Funny! Great time with the kids"
    },
    {
      "rating": "5/5",
      "review": "I love it so amazing"
    },
    {
      "rating": "3/5",
      "review": "My kids grew up playing this game with me. Creating worlds in creative mode and then starting from scratch in survival mode. It was fun to see this in the theater with them for sure. They are now 20 and 12. I say all of that to say this... I feel like they missed a huge opportunity here to actually build some character development and make them all survive in survival mode for a while. I guess it's a bit Jumanji, but for a movie based on a game, that's what I wanted to see. Now, it's not fair to judge the movie based on just what I wanted to see, so I'll give this 3 out of 5 stars. Fun for what it was, but a bit let down."
    },
    {
      "rating": "4/5",
      "review": "My 8 year old loved the movie! Definitely a one time fun watch for kids who love Minecraft"
    },
    {
      "rating": "5/5",
      "review": "I have to be honest I’m pretty much a no fan of this but the fact that the movie was a good movie and the movie was a great movie to watch this is my 2nd favorite movie ever non Disney. Jack black was the best in it and the best in this movie."
    },
    {
      "rating": "4/5",
      "review": "More of a meme related movie if you ask me, lol. I enjoyed watching it in theaters and hearing everyone say the memes out loud all together, but the movie itself wasn’t good. The CGI was definitely impressive and the jokes landed very well, and the nostalgia factor really hit when the old in-game music would play."
    },
    {
      "rating": "5/5",
      "review": "is a fun video-game based on movie its better than any other movie"
    },
    {
      "rating": "5/5",
      "review": "If you grew up playing minecraft, or played it close to when it started, you would greatly appreciate this movie. It has refrences to different beloved youtubers, and has iconic music from the game. It has a great plot and someone from any ages will like it."
    },
    {
      "rating": "4.5/5",
      "review": "Fan service to the fullest. However, I am not a die hard Minecraft fan, but I did enjoy the movie very much and I had the great experience of witnessing how die hard fans enjoyed it, indeed! Looking forward to purchasing it , adding it to my own collection, and watching sequels!"
    },
    {
      "rating": "4/5",
      "review": "I found it original, something different from the usual... but for such a long-awaited film, it was missing something more!"
    },
    {
      "rating": "4/5",
      "review": "The movie was very fun and the cgi was good, but I wish some of the characters (Natalie and Henry) were focused on more. I recommend this movie."
    },
    {
      "rating": "5/5",
      "review": "muito bom usar ele incrvel as histrias esto todas completas no esto pulando partes e no tem e muito bom."
    },
    {
      "rating": "1/5",
      "review": "Achei o filme fraco, a parte mais legal é quando o jack black canta stev’s Lava chicken , aliás a música é um chiclete fica na sua cabeça"
    },
    {
      "rating": "3/5",
      "review": "I love Jack Black!!! Not a big fan of the video game minecrafct, but the movie was good."
    },
    {
      "rating": "5/5",
      "review": "A great film that entertains the whole family. It's the definition of sizzlean!"
    },
    {
      "rating": "5/5",
      "review": "It was the best movie ever"
    },
    {
      "rating": "5/5",
      "review": "Ridiculous movie. My thrall and I loved it."
    },
    {
      "rating": "5/5",
      "review": "As a stressed out mom of 4, I took my kids on a last minute thought to get out of the house, and I'm so glad I did! Jack Black did such an amazing job of being theatrical and over the top, I couldn't help but appreciate the effort he's putting in for the kids watching this. His banter with Jason Momoa was just ridiculous, and I found myself laughing sometimes more than my kids, which was such a good feeling. The overall message of the movie was positive as well! I believe if you can walk away from a movie feeling good inside, it's a win! And me and my girls definitely walked out happier and feeling more energized than when we first walked in. Highly recommend if you want to take a break, laugh at the silly things, enjoy colorful worlds, and appreciate the creativity."
    },
    {
      "rating": "4.5/5",
      "review": "Unique and original!"
    },
    {
      "rating": "2.5/5",
      "review": "Great cast great story line, the only problem I had with it was some of the picture quality in some areas of the film it looks very budget, you can see the outlines of the characters and the wolf suddenly changed colour from pink to grey when going into the mine from the real world, when the potato factory mascot fell down the whole thing looked like it was on a tight budget. Other than that it's a funny good movie."
    },
    {
      "rating": "2.5/5",
      "review": "Well my name is Steve so I kinda have to like it but in all seriousness, kids will definitely enjoy this but possibly not adults!"
    },
    {
      "rating": "4.5/5",
      "review": "THE Movie was pretty nice, nice theatre too, not any crazy stuff but definetly and AMAZING expierience. Would reccomend. The only reason this isn't five stars is because the plot of the movie is pretty dull"
    },
    {
      "rating": "5/5",
      "review": "Had a great time with the family. Kids laughed all the way through. Fun times!"
    },
    {
      "rating": "4/5",
      "review": "Good for the kids who are into Minecraft"
    },
    {
      "rating": "5/5",
      "review": "the Minecraft movie was an amazing film. I watched it with my older sister and younger brother and they both agree that it was great. The elytra scene was definitely my favorite. It was a very good movie I would see it again if I had the money."
    },
    {
      "rating": "1/5",
      "review": "The good stuff was anything that had to do with the game. The characters, story and actors were all terrible. Had high hopes. Sadly, it sucked."
    },
    {
      "rating": "4/5",
      "review": "Fairly funny movie just wish there was less inappropriate stuff like the guys grabbing each other's butts and making butt jokes. Besides that it was pretty good."
    },
    {
      "rating": "3/5",
      "review": "A lot of the movie is set outside of the over world. The lore is missing also which is a shame."
    },
    {
      "rating": "2.5/5",
      "review": "It was entertaining, had some great scenes but overall I felt it was a popularity contest - the approach - how many cool things about minecraft can we stuff into the movie. It had a rushed storyline that was often hard to follow - so yes, we got pandas, zombies on chickens and all that stuff pilled in, but no real fun story to follow."
    },
    {
      "rating": "4.5/5",
      "review": "Carried grandson for his 11th birthday and he thoroughly enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "Laughed the entire movie. Loved how they included a lot from the game. Amazing way for parents to understand why their kids enjoy the game so much and to remind them to let their kids be creative."
    },
    {
      "rating": "4/5",
      "review": "Overall, it was a good movie. It had some laughs and the storyline was ok. Would have liked to know why and how the mother died and also a back story of the brother and sister. I would watch it again."
    },
    {
      "rating": "5/5",
      "review": "This is my new favourite movie. A flawless adaption of my favourite video game containing my favourite actors and a lot of wonderful characters. Henry was my favourite character, he was my age, and he had the same interests as me. Jack Black does a great impression of Steve. I was alongside everyone else yelling out Chicken Jockey. The plot is perfect."
    },
    {
      "rating": "5/5",
      "review": "The feet t vs the animaniacs movie is scheduled for release in 2025 on Nickelodeon and Paramount Plus get ready to watch the movie on Nickelodeon"
    },
    {
      "rating": "1/5",
      "review": "Father here. Kids loved it. But it was so bad, struggled to stay awake."
    },
    {
      "rating": "5/5",
      "review": "kids input. loved how it follows the game. dislike that it introduced new bosses not in the current version game. p.s. loved the mojang intro. overall loved the movie and energy."
    },
    {
      "rating": "2.5/5",
      "review": "It’s not the quality, it’s the experience. Bring friends and enjoy"
    },
    {
      "rating": "4/5",
      "review": "fans of the game will love it. fans of jack black or jason momoa will as well"
    },
    {
      "rating": "4/5",
      "review": "Was funnier than I thought it would be....I really enjoyed with the family"
    },
    {
      "rating": "4/5",
      "review": "The most insane, unhinged comedy film I've seen since The Cat In The Hat (2003). A Minecraft Movie is my new favorite drunk movie. This was my third viewing of the film."
    },
    {
      "rating": "1/5",
      "review": "Never felt engaged or laughed at any of the jokes, or felt empathy. predictable story. Wish I could get the time back. Took 2 of my grandsons (4 and 6), they lost interest about 30 mins in. It was a slog."
    },
    {
      "rating": "5/5",
      "review": "Its a must see movie! Very funny for adults and kids watch until the credits finish! Part 2 can't wait!"
    },
    {
      "rating": "2/5",
      "review": "I feel the females in the storyline didn't matter and wasn't cohesive with the overall plot of the movie. It was also some of the worst acting from Jack Black & Jason MaMoa that I have ever seen it was as if they didn't know how to act for this movie like when the dub voice over in a foreign film is so off from the original that it's just not natural at all."
    },
    {
      "rating": "4.5/5",
      "review": "Kids loved it.. I liked it."
    },
    {
      "rating": "5/5",
      "review": "Funny— we actually laughed out loud. Very enjoyable"
    },
    {
      "rating": "5/5",
      "review": "Funny as hell. The Lava Chicken song is hilarious."
    },
    {
      "rating": "4/5",
      "review": "I liked Dennis but I hated chungus"
    },
    {
      "rating": "4/5",
      "review": "Actually pretty fun if you go with friends, the story is a bit cheesy but fun altogether. A good laugh after and during the movie! Definitely go watch with a friend group or two"
    },
    {
      "rating": "2.5/5",
      "review": "There is an effort shown in the movie, but the movie's progression and lack of world-building lead this movie to feel like the movie could've done better, as the setting has limitless potential where the potential of being in a Minecraft world is not fully realized. It's a good movie, but not great."
    },
    {
      "rating": "4.5/5",
      "review": "It was hilarious. More adult oriented than kid"
    },
    {
      "rating": "5/5",
      "review": "I gave it a 5 because i enjoyed watching the movie with my 11 yo son, and he loved the movie. He knew exactly what was going on and what all those gaming hints meant. I am giving my son a voice on this review platform, because i think they should also have input on what they enjoy, even if it doesn't align with adult expectations."
    },
    {
      "rating": "4/5",
      "review": "Overall it was a funny movie, I enjoyed watching it, there were a few things from the game that was not in the movie, like dying and respawning! They could have added a few things in my opinion but I still liked it!"
    },
    {
      "rating": "1/5",
      "review": "As my son was saying...it was so bad you couldn't stop watching. I would have left if I couldn't stop laughing at just how bad the script was."
    },
    {
      "rating": "2.5/5",
      "review": "Maybe I was too old for this movie. My grandsons liked it. I thought there was too many cheesy, over sexualized, and unnecessary comments."
    },
    {
      "rating": "5/5",
      "review": "I really liked the movie"
    },
    {
      "rating": "4.5/5",
      "review": "it was fun to watch for somebody even 62 years old because of the references to when I was a kid."
    },
    {
      "rating": "3.5/5",
      "review": "It's a fun movie not a good movie. I think 3.5 is fair it's fun and a good experience everyone should have but they're not missing out if they dont watch it."
    },
    {
      "rating": "5/5",
      "review": "My kids loved the movie. Its a must see for Minecraft lovers."
    },
    {
      "rating": "5/5",
      "review": "IT IS THE BEST MOVIE OF THE YEAR!!!"
    },
    {
      "rating": "5/5",
      "review": "My 8 year old loved it! My 4 year old was afraid during parts of it. As a parent who has no idea how to play the game, I thought the movie was funny and entertaining."
    },
    {
      "rating": "3.5/5",
      "review": "Good nothing spectacular"
    },
    {
      "rating": "5/5",
      "review": "Though its a kids movie , this film is highly entertaining for adults as well! Highly recommend!"
    },
    {
      "rating": "2.5/5",
      "review": "When I got out of the cinema, there was nothing important left of the film in my mind, I couldn't even judge and talk of the movie with my friend, it was a silence... The humour is pretty good, though some of it is very repetitive and only works once. But a good kid movie shouldn't only rely on the fun, and instead have also a good story to tell, which is not the case: I didn't feel any moral attention for the group or sense of danger with the vilan. The biggest missed point in my opinion is the fact that the movie doesn't give me a will to explore the world (irl and minecraft) because the set and background feel to fake, and not close to the game's atmosphere. Jack black saves the film from being just annoying. It's not a bad movie !"
    },
    {
      "rating": "2/5",
      "review": "It’s so bad, it’s kinda good. I recommend it if you’re gonna watch with family and/or friends. But if you’re on your own, don’t even bother XD"
    },
    {
      "rating": "4/5",
      "review": "It was great for the children."
    },
    {
      "rating": "4/5",
      "review": "Kids had a blast. Good flick. Jack Black and Jason Mamoa where funny."
    },
    {
      "rating": "2/5",
      "review": "Looked good that was it!"
    },
    {
      "rating": "4.5/5",
      "review": "I took my grandkids and we all loved it, so much fun. I cant under why anyone would not like it , better than all the stupid violent movies. At least there was one movie I could take the kids to.:"
    },
    {
      "rating": "5/5",
      "review": "It was entertaining., funny and just so cool!"
    },
    {
      "rating": "3.5/5",
      "review": "I loved it, very creative, very funny and energetic. But I had a few problems with the streaming and I don't know of its just me or what. But for example, the sorceress piglin, sometimes she talked but her mouth animation wasn't working. Or like how I could see the green screen behind Steve. But overall, this was an amazing stuff y'know! 😁🧏🏻‍♂️"
    },
    {
      "rating": "5/5",
      "review": "The movie was very entertaining and fun! We just wished it went on a little longer, it was a bit short."
    },
    {
      "rating": "5/5",
      "review": "Anything with Jack Black is an instant classic! Great movie for the entire family no matter the age."
    },
    {
      "rating": "5/5",
      "review": "mulher pelada e emma myers linda cheirosa gostosa pelada pelada pelada pelada pelada pelada pelada pelada e Jack Black está muito preto"
    },
    {
      "rating": "3.5/5",
      "review": "O filme muito bom porm ele curto e a histria no muito envolvente, mas j que sou um grande fan do jogo gostei do filme, o filme bem fiel ao jogo mas um filme com o publico alvo sendo crianas"
    },
    {
      "rating": "5/5",
      "review": "The kids thought it was funny, and the action and animation was awesome."
    },
    {
      "rating": "1/5",
      "review": "Thought is was pretty violent for a kids movie. Not that great of a story line. Not what I expected"
    },
    {
      "rating": "5/5",
      "review": "Really awesome!! My son loved it!"
    },
    {
      "rating": "5/5",
      "review": "CHICKEN JOCKEY 🔥🗣️🗣️🔥🗣️🗣️🔥🔥🔥"
    },
    {
      "rating": "5/5",
      "review": "amazing. I love Jack black"
    },
    {
      "rating": "5/5",
      "review": "Not a waist of my time. Good show. Recommended."
    },
    {
      "rating": "4.5/5",
      "review": "yo soy un gran fanático de minecraft y la pelicula no decepciono a mi gusto. en mi opinión la peli se me hiso corta, las escenas de pelea me gustan bastante y la comedia es tan ridícula que me estallaba de la risa las dos veces que la fui a ver al cine. el personaje de aquaman sin lugar a dudas es el mejor personaje de la pelicula, Emma Myers hiso una buena actuación interpretando a Nathalie, el niño se me hiso un gran personaje, Steve junto con aquaman fueron los mejores personajes y la mujer de los animales es un personaje innecesario pero carismático. el diseño de los mobs esta bastante bien para ser la primer peli de minecraft, las armas se ven muy bien y los fondos y los bloques para mi estuvieron muy bien hechos. en conclusión, la pelicula de minecraft en mi opinión es increíble, muy divertida, llena de canciones graciosas y pegadisas, los efectos se ven bastante bien, los personajes son bastante carismáticos y es una pelicula con mucho corazon calificación: 9.5/10"
    },
    {
      "rating": "3/5",
      "review": "I honestly expected more, the start of it was a horrible back story"
    },
    {
      "rating": "2.5/5",
      "review": "The first act felt like watching a completely different movie after the opening scene, and this movie would’ve been better if it was animated and had better writing and storytelling."
    },
    {
      "rating": "5/5",
      "review": "I actually really enjoyed the movie!!"
    },
    {
      "rating": "4/5",
      "review": "I think that sometimes to much happened at once and that the movie was written very fast, like it takes you directly to the action with no long story in-between, so that made it an enjoyable watch and overall I actually pretty much enjoyed the movie, always loved the game so it was petty cool seeing it get turned into a movie, some jokes also were pretty funny as well to be fair."
    },
    {
      "rating": "5/5",
      "review": "funny and fun movie with the kids ."
    },
    {
      "rating": "4/5",
      "review": "Was an enjoyable fantasy movie for the whole family."
    },
    {
      "rating": "5/5",
      "review": "I thought I wasn’t going to enjoy the movie, I was only going because of my kids but Jason Mamoa and Jack Black did a fantastic job! The movie was hilarious and I enjoyed every bit of it."
    },
    {
      "rating": "5/5",
      "review": "It was funny and fun! My grandson love it because he love Minecraft he was laughing and having fun thank you so much bye!"
    },
    {
      "rating": "3.5/5",
      "review": "Just saw it with the kids. Movies with funny villians and idiot sidekicks are always worth the watch to me. Steve, in that hilarious Jack Black way, clearly explains throughout the movie how we got here, what we're up against, and what needs to be done to defeat the bad guys and get back home. This is important if you have no clue what Minecraft is, much less how to play it. Not movie of the year, but well worth a watch."
    },
    {
      "rating": "1.5/5",
      "review": "What a disappointment, I went in expecting it to be for kids but to be a solid movie none the less. It's just sad and what a waste of potential. I hope I never have to watch this movie again."
    },
    {
      "rating": "3.5/5",
      "review": "I’ve never played the game so my opinion is strictly about seeing a movie. I thought it was cute and I would see it again at home."
    },
    {
      "rating": "4/5",
      "review": "It's was good. My son enjoyed it"
    },
    {
      "rating": "5/5",
      "review": "I know it's for kids but it's so nice 👍"
    },
    {
      "rating": "4/5",
      "review": "Do not believe what the 'professional' critics tell u. This movie was enjoyable and I am not even a fan of Minecraft. It was good."
    },
    {
      "rating": "2/5",
      "review": "It wasn't bad. But it also wasn't great. There were definitely giggles related to how they brought Minecraft to life. But overall the movie was pretty forgettable."
    },
    {
      "rating": "5/5",
      "review": "My son absolutely LOVED it!"
    },
    {
      "rating": "2/5",
      "review": "Could have been good, but no ideas shown in the movie are ever fleshed out, and if you’re watching this on your own, it is very boring. The enjoyment of this movie depends entirely on the crowd you’re watching this with."
    },
    {
      "rating": "3.5/5",
      "review": "Isn't a great film but is very fun especially when it was in cinemas on opening day."
    },
    {
      "rating": "5/5",
      "review": "Cute story, kids loved it, Jack Black makes everything fun."
    },
    {
      "rating": "5/5",
      "review": "Very fun and good natured. Fighting went on a little long And would have loved more songs but we really enjoyed!"
    },
    {
      "rating": "1/5",
      "review": "Although you can get a great laugh out of it, “A Minecraft Movie” is a joyride of absolute torture. To sit through this film is like trying to drive a car without any wheels. There is no story, no lesson, it’s pointless. I’m a Minecraft fan, I’ve played the game so much as a kid, and this, this is not it. I love Jack Black and Jason Mamoa, but this isn’t their movie. 2/10 (1.5/5) would not recommend"
    },
    {
      "rating": "2/5",
      "review": "Cute but not for me personally. Jack black looked like he had a blast though"
    },
    {
      "rating": "4.5/5",
      "review": "This movie had a special scene when they are in the village and there's a pig that has crown on its head and I was screaming tecnobalde"
    },
    {
      "rating": "5/5",
      "review": "So entertaining and hilarious ! Definitely go see it"
    },
    {
      "rating": "5/5",
      "review": "First of all sooo stupid it was haliarious!! Great family movie, the whole audience applauded at the end, including myself. Definitely go see with your kids!"
    },
    {
      "rating": "4/5",
      "review": "Movie was a fun ride all the way through. Not every joke hits, but the ones that do have you cracking up like crazy. As an adult that occasionally played the video game, it was interesting to see the Minecraft world brought to the big screen. Story was predictable but was entertaining as it was being told. Jack Black plays his stereotypical Jack Black character as he does in all his other movies, and it works here perfectly. Can’t wait to see what the rest of this movie franchise has in store in the future."
    },
    {
      "rating": "5/5",
      "review": "It was very funny, had great animation and crowd was into which made it very enjoyable"
    },
    {
      "rating": "5/5",
      "review": "I've never played Minecraft, yet the film deeply moved me. With its clear plot, exquisite visuals, and thought-provoking themes, it delivers a truly enjoyable experience. What impressed me most was the characters' growth. While grappling with ordinary struggles, they unlock creativity and imagination, give each other support and warmth, and ultimately find self-worth through their quest to save the Overworld. Their nuanced emotional expressions resonate powerfully — especially for Minecraft fans. And I guess that Steve's return to reality affirms that our world needs creativity; it can rekindle the courage to face life's challenges."
    },
    {
      "rating": "5/5",
      "review": "Great watch for kids and parents."
    },
    {
      "rating": "5/5",
      "review": "Jack Black has cemented himself as the greatest actor of all time. A must watch for all moviegoers!"
    },
    {
      "rating": "4.5/5",
      "review": "I did not know what to expect walking in with my 10 year-old daughter. Super fun, creative, entertaining and light hearted movie. I enjoyed it very much. My daughter loved it."
    },
    {
      "rating": "2.5/5",
      "review": "It was not the best movie not the worst movie the upside of it is kids would really like it because it’s Minecraft related. The downside is the CGI just really bad and it makes it obvious that it’s just doesn’t pull you in. Overall my opinion is 3 1/2 stars."
    },
    {
      "rating": "4.5/5",
      "review": "I like everything about it it was funny I recommend you guys to watch it!!"
    },
    {
      "rating": "5/5",
      "review": "Me and my children really enjoyed this 100% recommended movie."
    },
    {
      "rating": "1/5",
      "review": "I started looking at my watch by the time they got to the overworld, and it didn't get better from there Nonsensical and annoying story No likeable characters present among the protagonists The only mildly entertaining bits were the internet memes and references shoved in. Otherwise completely unwatchable"
    },
    {
      "rating": "3/5",
      "review": "Humor was annoying but my kid liked it so, I gave it 3 stars."
    },
    {
      "rating": "5/5",
      "review": "It was a good movie and funny The kids loved it"
    },
    {
      "rating": "4/5",
      "review": "Great movie., true to the Minecraft world. Storyline moves along at a nice pace and doesn't stagnate. Full of funny parts that had the adults and children in the theatre laughing."
    },
    {
      "rating": "5/5",
      "review": "As a video gamer, I love Minecraft. But I was hesitant to see this movie cuz I didn’t think it was going to be good. Turns out it was better than I thought. 7/10 rating. I thought the story was really good. Jack Black and Jason Momoa are hilarious. My only negativity is the way they solved the problem. I thought it was a tad rushed and could have explained the bad guys more. But other than that great movie."
    },
    {
      "rating": "5/5",
      "review": "La mejor pelcula los crticos son unos pendejos"
    },
    {
      "rating": "2.5/5",
      "review": "While \"A Minecraft Movie\" wasn’t for me, its over-the-top absurdity and ridiculousness may be exactly what some viewers are looking for. It’s undeniably dumb fun, a film best enjoyed with expectations dialed down and your brain switched off. In a time as chaotic and tumultuous as now, that sort of escapism has its place. You'll likely walk away disappointed if you expect anything remotely serious or coherent. But if you embrace it on its own terms, it offers a bizarre and oddly endearing experience. Frankly, I wouldn’t be surprised if it earns a cult following and draws comparisons to Tommy Wiseau’s \"The Room\" in the future."
    },
    {
      "rating": "4.5/5",
      "review": "I thought the movie was not only really good but also really funny!"
    },
    {
      "rating": "0.5/5",
      "review": "UnBEARable Jack Black nonsense. Can we be done with him yet Hollywood?? If youre under 30 & have any familiarity with the IP source material you probably instantly cringed when you heard who was being cast to play Steve. And to no one's surprise here we are with this wreck of a movie... DOA. Sure, little kids will love it. But any adults will be staring at their watch and finding reasons to leave the theater and walk around."
    },
    {
      "rating": "5/5",
      "review": "Kids love it. I liked it. Fun time with the kiddos."
    },
    {
      "rating": "5/5",
      "review": "I took my five year old kid. He enjoy the movie a lot as he is an avid player. He is actually teaching how to play so I got a lot of the game gags. My wife didn't had so much fun but seeing our kid laugh and get excited with all of the stuff happening in the movie was totally worth it."
    },
    {
      "rating": "5/5",
      "review": "My brother and I loved it ❤️"
    },
    {
      "rating": "3/5",
      "review": "We took our 5 year old grandson & he loved it! Us grandparents thought it was the worst movie we have ever seen!"
    },
    {
      "rating": "5/5",
      "review": "Watched this with my 7 yr old-it was hilarious, we loved it"
    },
    {
      "rating": "2/5",
      "review": "Es un cague de risa pero solo por lo ridícula que puede llegar a ser (Y no en el buen sentido)."
    },
    {
      "rating": "4.5/5",
      "review": "Although this movie had almost no character development or a coherent plot, IT WAS PEAK!!! The memes were incredible, everyone was hilarious (especially Jack Black and Jason Mamoa), and I would definitely recommend it for fans of the game!"
    },
    {
      "rating": "5/5",
      "review": "the movie was good the memes and CHICKEN JOKEY"
    },
    {
      "rating": "5/5",
      "review": "I had my doubts that the movie would be about people, but I loved this movie every second, not only for the memes but for its good story, very entertaining to watch. 190% recommended."
    },
    {
      "rating": "3/5",
      "review": "Fun, entertaining, nostalgic and a certified meme-factory. Jack Black indeed stands out even if he is nowhere similar to Steve. But my GOODNESS, how much this movie actually triggers my childhood dreams so BAD. First time ever, war is visualized in Minecraft and it is on the big screen! Even if it isn't close to perfect, at least it's bad in a way that it is actually enjoyable at the end of the day."
    },
    {
      "rating": "3.5/5",
      "review": "Such a fun family movie. I took my daughter and grandparents to see this and we had a great time! I think Jason Mamoa and Jack Black were the best part of the film and they carried it, the rest of the cast did their job well within the role given to them. Made me want to play Minecraft with my kid again. I give Minecraft a solid 3.5/5 due to entertainment value. Doesn’t standout as an amazing film but it is very entertaining and funny and a family night movie with re-watchability."
    },
    {
      "rating": "3.5/5",
      "review": "This was a fun movie, definitely some brain rot and dumb humor but it was hilarious and enjoyable."
    },
    {
      "rating": "1.5/5",
      "review": "This movie did not live up to it's hype. I mean like it's so childish and they are like literally talking about poop and it was meant to be a movie for every one but this is to childish. I'd understand if the movie was based on like child stories but this is a movie about the biggest game in the world. I didn’t like this at all. Shame on the makers"
    },
    {
      "rating": "4/5",
      "review": "speak chicken jockey"
    },
    {
      "rating": "5/5",
      "review": "Absolute cinema ngl and its also chaotic with the chicken jockey part at my theater"
    },
    {
      "rating": "1.5/5",
      "review": "Definitely wouldn’t watch again. Everyone was talking about how funny it was but 99% of the funny parts were shown in the marketing and the only comedic factor was that it was Jack Black reading the line. Really uninteresting and a major waste of potential"
    },
    {
      "rating": "5/5",
      "review": "The most fun Ive had the movies in ages.. I thought Id hate it. My kids dragged me there. They were right."
    },
    {
      "rating": "2/5",
      "review": "We took my Minecraft obsessed 7 year old to see it, and even he was bored before the end. There was so much potential, but I feel like Jack Black and Jason Mamoa ruined this movie for me. I've enjoyed both actors in different projects, but this one just didn't work for me with them in it."
    },
    {
      "rating": "3/5",
      "review": "It's a movie made for kids, it takes liberties with the world of minecraft making it feel more like a modded world than the real minecraft. Jack Black is playing Jack Black in a Steve costume. The other actors are Ok. Writing is uninspired, the story threads are very predictable and it's hard to take the challenges and group dynamics at face value. Overall, I'd wait till it's free or watch the unfinished leaked version"
    },
    {
      "rating": "5/5",
      "review": "Es una pelicula divertida y graciosa para ver un almuerzo y reír, con demasiadas referencias al juego y una carta de amor para el videojuego."
    },
    {
      "rating": "0.5/5",
      "review": "Maybe a 2/10 if I'm being generous. Funny as hell, and I know many people who love it, but we can all agree it's objectively terrible."
    },
    {
      "rating": "4.5/5",
      "review": "A very fun and charming family film. Fans of the game are sure to enjoy even if it's not super deep. Jack Black 100% steals the show. Overall 9/10."
    },
    {
      "rating": "1/5",
      "review": "Terrible acting. Boring. Not interesting. One of the worst movies I have ever seen."
    },
    {
      "rating": "5/5",
      "review": "Such an amazing movie - laughs, excitement, surprise, action and more all in 1 great movie. A must see more than once. LOVE IT LOVE IT LOVE IT"
    },
    {
      "rating": "5/5",
      "review": "So funny. The kids LOVED 3D!!!"
    },
    {
      "rating": "5/5",
      "review": "I like when I was like chicken jockey"
    },
    {
      "rating": "4/5",
      "review": "Great enjoyable movie that is full of memorable and funny moments. On a story level, there wasn't much working for it, but on a basic level, the story is decent. The visuals were a ton better than I was hoping and the references were amazing. JACK BLACK CARIES THE FILM."
    },
    {
      "rating": "4/5",
      "review": "Very funny and enjoyable. I like the setting and the storyline, but at some parts it can be a tad bit corny."
    },
    {
      "rating": "0.5/5",
      "review": "The movie was fine but there's an Internet trend happening where kids are supposed to be as unpleasant as possible during the movie. I didn't know this beforehand and only learned about it after a horrible movie viewing experience with many rude middle schoolers (I assume) yelling things at the screen throughout the movie. don't see this in theaters"
    },
    {
      "rating": "5/5",
      "review": "Even though it's a kids movie!! loved it as an adult!!"
    },
    {
      "rating": "3.5/5",
      "review": "CHICKEN JOCKEY!!!!!! (its ok, if you want to have fun, see it, but if your want a good story, its not for you)"
    },
    {
      "rating": "5/5",
      "review": "I.... am meeve"
    },
    {
      "rating": "5/5",
      "review": "I’ve never played Minecraft. I took my daughters who do. And it was awesome. The audience was interacting with the film. Very entertaining."
    },
    {
      "rating": "1/5",
      "review": "Felt like I was in a fever dream. Weird"
    },
    {
      "rating": "5/5",
      "review": "Amazing cast! Amazing script, it was soo much fun and super funny! Though there were implications with editing, but it doesn't really matter"
    },
    {
      "rating": "4/5",
      "review": "Very funny. Love jack black and the sound track was great. A little intense at moments for kiddos under 10 in my opinion."
    },
    {
      "rating": "4/5",
      "review": "What do I have to say about 'A Minecraft Movie'? There are 3 kinds of people that book tickets to see this film: 1. You're intrigued by the fact theaters are covered in pocorn after the (in)famous Chicken Jockey, 2. You're nostalgic for the original game and decide to give the movie a go, 3. You're a big nerd and are there to freak out over all the references. And honestly, I fit in in all three categories. I grew up with both playing the Minecraft game and watching YouTube series about/set in the game, but as a movie nerd I'm also intrigued by the cultural phenonimal the movie turned into. It was bound to happen. I was legit nervous to what audience I would meet in the theater. Turns out it were just some 18-year olds and parents with their kids. There were maybe 4 people reacting to Chicken Jockey, including myself. On the other hand, that gave me the opportunity to make up a legit judgement of this movie. And it is a lot of fun! Don't expect the plot to be anything great, it's still aimed at kids after all. But they manage to explore the Overworld and everything that makes it so iconic, though they also take their creative liberties which only enhances the movie. Jack Black as Steve is just so fun, like what you expect him to be based on the trailers and his previous roles, that's what you'll get. For me the personal standout was Danielle Brooks, who was so hilarious in this movie, and I really hope this movie will launch off a promising career for Sebastian Eugene Hansen. Emma Myers also did good, Jason Momoa also caused for some laughs, but also could take this movie to its hysterical heights. The Piglins made for surprisingly good villains, especially with the inevitable sequel rumoured to be already in the making in sight, which would make for a better stage for the Ender Dragon as the main villain. What truely blew me away was the CGI. At very little moments you 'saw' the green screen, the CGI of the Overworld was very convincing 99% of the time. Overall it's just a fun simple movie to tune out for some time, with the love for the game and the fandom being evident to those who have as big of a love for the game as the people who 'crafted' this movie!"
    },
    {
      "rating": "0.5/5",
      "review": "I usually love a Jack Black movie but I refuse to watch this film on principle alone, I have seen clips of YOU THE AUDIENCE carrying on during the movie, YOU THE AUDIENCE drive cinema staff up a wall and it's YOU THE AUDIENCE that is the reason I will not give this film my money or my time."
    },
    {
      "rating": "3.5/5",
      "review": "Likeable, silly. A fun watch, and not particularly complex— but entertaining cast and plot."
    },
    {
      "rating": "5/5",
      "review": "Why they make me fat yo"
    },
    {
      "rating": "3.5/5",
      "review": "CHICKEN JOCKEY - steve"
    },
    {
      "rating": "4.5/5",
      "review": "Very good and the chicken jockey scene a lot of popcorn"
    },
    {
      "rating": "3/5",
      "review": "Fun, stupid movie for kids."
    },
    {
      "rating": "2/5",
      "review": "Funny jokes not much substance outside of that, little plot and character development. Very fast paced."
    },
    {
      "rating": "5/5",
      "review": "Absolutamente cine, habiéndome criado con Minecraft entiendo que no todo en la película tiene sentido como en el juego. Pero si referencias y mucho cariño a los tiempos en los que eramos niños dentro de Minecraft."
    },
    {
      "rating": "1/5",
      "review": "It's probably the worst movie I've ever spent money on..."
    },
    {
      "rating": "3/5",
      "review": "sorry.. love Jack Black and Jason M but they were the highlight of this movie , thank gawd."
    },
    {
      "rating": "5/5",
      "review": "This movie was very good and I love it!!! Theres signs that there will be a second movie too. Like when Steve went to Alexs house. And also we cant forget out the gender dragon! Hes not out of the question yet!"
    },
    {
      "rating": "1.5/5",
      "review": "Jack Black & my kids were the only reasons I saw this. I enjoyed watching my kids watch this, but would not opt to see it again."
    },
    {
      "rating": "4.5/5",
      "review": "Con la nueva moda que las adaptaciones de Sonic The Hedgehog, Super Mario Bros y Five Nights At Freddy's han desatado, era cuestión de tiempo para que Minecraft fuera el siguiente videojuego popular en ser adaptado a la gran pantalla. Era algo que ya se tenía planeado desde los 2010 cuando el videojuego era bastante popular entre los niños y en parte se debe a que varios youtubers hicieron que Minecraft ganara cada vez más popularidad. Es por eso que la película dejo que algunos youtubers famosos tuvieran la oportunidad de aparecer teniendo cameos. A pesar de los años que tardaron en materializar la idea al fin lo consiguieron. Aunque en un principio Shawn Levy iba a estar a cargo tras haber hecho un excelente trabajo con Deadpool & Wolverine, al final decidieron que Jared Hess estuviera al mando. No fue una mala elección, ya que este director se inició en el cine con la película de culto Napoleon Dynamite y luego paso a trabajar con Jack Black en Nacho Libre. Aunque las películas y series que produjo después no tuvieron tanto reconocimiento como sus primeros dos largometrajes, A Minecraft Movie termino siendo su nuevo trabajo mejor valorado. Adaptar el mundo de Minecraft a una película de acción viva no parecía algo probable dado que el mundo de Minecraft era más fácil de adaptar a una película animada. Pero gracias a los efectos digitales lograron materializar el mundo del juego a algo bastante real. Siguieron el ejemplo de Detective Pikachu y Sonic The Hedgehog al usar un arte hiperrealista para poder hacer que los personajes de Minecraft parezcan seres de carne y hueso. No se puede negar que el CGI es asombroso y ha logrado materializar el mundo de Minecraft de una manera inimaginable. En lo visual la película es un excelente retrato del mundo de Minecraft y ha logrado mantener el espíritu del mundo del juego. Al principio se pensaba que la película haría lo mismo que las secuelas de Jumanji. Se esperaba que fuera una historia sobre jugadores siendo transportados al videojuego de Minecraft, pero decidieron convertir el mundo de Minecraft en una especie de dimensión paralela en la que los personajes del mundo real se aventuran tras descubrir el orbe. Las adaptaciones de Super Mario Bros hicieron lo mismo al convertir el mágico mundo de los juegos de Mario en una dimensión paralela para darle coherencia al viaje de los personajes humanos a un mundo bastante irreal. Minecraft siguió ese mismo camino y fue una idea que funciono bastante bien. El mundo de Minecraft en los videojuegos no tiene una lógica exacta porque es un mundo muy irreal y la película pudo mantener eso al convertir ese mundo en una dimensión que desafía la visión que tenemos sobre la realidad. En ese aspecto, la película es una digna adaptación del universo del juego. Lo que ha dividido a la crítica, a los fanáticos del juego y a los eruditos del cine es que la película carece de un buen y desarrollo de personajes. Eso se debe a que la película le da prioridad a su tono humorístico y caricaturesco. La película no busca una lógica porque el mundo del videojuego tampoco tiene una lógica al ser un mundo irreal. La película lo que hace es más bien ser una caricatura que busca divertir y lo consigue. De principio a fin la película se siente como un dibujo animado y utiliza un humor que se basa en los dibujos animados sin aferrarse a la lógica. Las caricaturas estilo Looney Tunes, Ren & Stimpy o The Amazing World Of Gumball no suelen contar mayormente con un guion profundo o un buen desarrollo de personajes. Su único enfoque es narrar una historia alocada aferrada al humor absurdo y surrealista con el fin de que sean divertidas. A Minecraft Movie hace lo mismo y solo da breve información sobre quienes son los personajes para tener una breve idea sobre sus motivaciones. Steve es alguien que soñaba ser un minero y un aventurero. Garrett es un gamer talentoso que está en la ruina y desea salir de su situación. Al principio, solo piensa en los diamantes que lo ayudaran a salir de su situación, pero pronto se irá preocupando más por sus compañeros. Henry es un joven con un gran talento para crear, pero se siente menospreciado. Natalie intenta tomar un rol maternal para cuidar de Henry y aunque la película no da detalles sobre que sucedió con la madre de ambos hermanos, se puede deducir que ambos están marcados por algo trágico que sucedió. La película no explora el trasfondo de estos personajes, pero se entiende que la mayoría son personas que en el mundo real son menospreciadas, pero que en el mundo de Minecraft se vuelven unos héroes. Eso hace que los personajes sean identificables para los fanáticos del videojuego porque hay que recordar que los niños que jugaban Minecraft solían sufrir de bravuconeo. Eran niños que se sentían menospreciados y el videojuego era su lugar seguro. Así es como la película logra conectar con aquellos que jugaron con el juego en su niñez. El carisma y el humor de Jack Black es otro punto a favor que hace de la película una divertida experiencia. Si bien la película no posee un buen guion o un desarrollo de personajes, existen películas que han logrado demostrar que a veces no se necesita un buen guion o personaje bien desarrollados para hacer una buena película. Eso siempre es opcional y depende el tipo de película que se esté creando. A Minecraft Movie tiene agujeros de guion y algunas fallas que pasan desapercibidas porque la divertida experiencia que brinda hace que esos fallos no sean importantes. La película es una caricatura que no busca tener un sentido o una lógica porque no lo necesita. La reacción extremadamente positiva que ha generado en los fanáticos del juego ha sido comparado con el fenómeno que han provocado películas de culto como The Rocky Horror Picture Show y The Room. A Minecraft Movie no se diferencia de esos casos porque tiene un irresistible encanto. El guion y la falta de desarrollo de personajes ha hecho que sea catalogada como una mala película y paso lo mismo con la película de Five Nights At Freddy's. Pero en el mundo del cine de serie B existen películas malas que se han ganado el cariño del público haciendo que se ganen un estatus de culto. Películas como Basket Case, The Toxic Avenger, Troll 2, Robot Monster o Plan 9 From Outer Space tienen muchos fallos, pero tienen un encanto que a veces no se encuentran en las películas de mayor prestigio. La perfección no existe realmente, es solo algo subjetivo y la perfección de esas películas yacen en sus imperfecciones. Eso prueba que a veces las malas películas son mejores que las buenas películas y por eso muchas películas de serie B se convirtieron en obras de culto. La película de Five Nights At Freddy's tuvo el suficiente mérito para convertirse en una nueva película de culto. El caso de A Minecraft Movie no es diferente porque esta película tiene el encanto y la esencia que tienen muchas obras de culto del cine de serie B. En conclusion, A Minecraft Movie es una divertida película que no invierte tiempo en un buen guion ni en desarrollo de personajes. Sacrifica todo eso para brindar la divertida experiencia que promete ser y logra ser la adaptación que el videojuego se merecía. Sin importar lo ilógica o lo incoherente que luzca, su encanto es lo que la ha convertido en una obra de culto al instante. Mi calificación final para esta película es un 9/10."
    },
    {
      "rating": "5/5",
      "review": "Lava chicken. It’s a lava attack!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "very funny and entertaining"
    },
    {
      "rating": "2.5/5",
      "review": "Why couldn't they include ALL features of Minecraft? I wanted to see the warden, the trial chambers, the ender dragon, the blazes. This fell short of my expectations by around a few percent."
    },
    {
      "rating": "3.5/5",
      "review": "A surprising box office hit that very few saw coming—does Minecraft live up to… well, anything? My opinion (that you didn’t ask for): We all need a bit of absolutely chaotic fun every now and then, and this movie delivered it in a way that (very pleasantly) surprised me. If you have kids who love the game—or if you’re a fan yourself—you’ll probably have a great time (there was a whole group of people dressed as Steve when my nephews went to see it). It’s definitely a screen. If you have no idea what the game is but need a break from checking the balance of your 401(k), I recommend streaming it. Before I go any further... Spoiler warning: This review contains spoilers. If you're spoiler-averse, check out the two-minute spoiler-free version on my TikTok (@uninvited.reviewe) or Instagram (@uninvited_reviewer). I wasn’t expecting much from this movie. But I’m thrilled to say I got more than I ever anticipated. Turns out, when you throw Jack Black, Jason Momoa, Jennifer Coolidge, Danielle Brooks (a quickly rising star recently seen in Wednesday, A Good Girl’s Guide to Murder, and set to appear in The Angry Birds Movie 3), and newcomer Sebastian Hansen into a project based on a video game with no real storyline... you get a little bit of genius, a whole lot of ridiculousness, and some genuinely laugh-out-loud moments. Surprised? Yeah, me too. That doesn’t mean it’s a good movie, per se. Does it have substance? No. Style? Not really. But does it care? Absolutely not. And that level of self-awareness—knowing exactly what it is (a blatant money grab)—actually works in its favor. Because rather than being weighed down by the high expectations (and bloated budgets) of other video-game-to-movie flops— cough Tomb Raider (2018) Warcraft Assassin’s Creed Mortal Kombat (Feel free to hit me up with any I’m missing) cough— —it just chooses to be fun. Or, in the wise words of my nephew: “It was stupid, but funny, so I didn’t care.” Take the opening, for example. The movie kicks off with a seven-minute monologue by Jack Black—something that would usually bore me to tears (movie plots should be seen, not told, thank you very much). But I was completely drawn in by Jack Black’s total Jack Black-ness. Not many actors can base an entire character on their own personality and get away with it. But not every actor is Jack Black, and he was totally let off the leash for this one. Next, we meet Jason Momoa’s character, Garrett \"The Garbage Man\" Garrison—a (very) former video game champion who refuses to give up on his childhood dreams. His refusal to grow up is endearing in a wild, chaotic kind of way. His chemistry with Jack Black is what really anchors the movie. They flirt with going way over the top more times than I can count, but somehow always manage to reel it back in just enough. Danielle Brooks and Sebastian Hansen play Natalie and Henry, two siblings who move to Chuglass, Idaho—a town whose mascot is a potato named Chuggy (memorably and quickly destroyed by Henry in one of the funnier early moments). They’re joined by Dawn, their eccentric real estate agent-slash-mobile-zoo-owner, rounding out the core cast. At just 101 minutes, this movie doesn’t spend time on much of anything other than providing a sandbox for Black and Momoa to play around in. The plot jumps all over the place with no real rhyme or reason—but if you walked into Minecraft expecting coherent structure or emotional depth, you might have missed the memo. Final Thoughts: This movie lacks deeper meaning, substance, or a traditional narrative arc. But it’s fun. It’s funny. And it’s ludicrous enough to keep both kids and adults entertained. Think of it as cinematic junk food: no nutrition, but man, it hits the spot. unwantedmoviereviews.com"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this movie it was incredible and I’m a adult"
    },
    {
      "rating": "5/5",
      "review": "Peak movie. Best theater experience I’ve ever had🔥"
    },
    {
      "rating": "5/5",
      "review": "Laughed more then expected, cant wait for part 2!"
    },
    {
      "rating": "4/5",
      "review": "kids loved it and that was the point"
    },
    {
      "rating": "4.5/5",
      "review": "This movie is actually pretty good but any character that isn’t Jason momoa or Jack Black is boring"
    },
    {
      "rating": "2/5",
      "review": "Some of the humor was enjoyable as an adult, but most of it was a little too inappropriate for our six-year-old. I also felt it was a little more scary at times, had I known this before taking our son I probably would have either not taken him or done a daytime showing instead of an evening showing."
    },
    {
      "rating": "5/5",
      "review": "for a live action they killed it"
    },
    {
      "rating": "3/5",
      "review": "This actually wasn’t that bad and the memes like “CHICKEN JOCKEY” and others were pretty cool. The theater was somewhat calm and yeah it was pretty fine for me, though it has aspects of Minecraft the the original game doesn’t have :/"
    },
    {
      "rating": "3/5",
      "review": "It's a good family movie, but it was kind of all over the place."
    },
    {
      "rating": "5/5",
      "review": "Honestly, it's a meme fest as people have been saying, but it's also well and truly a Jared Hess movie, and luckily I'm a massive fan of his other movies, so it was fun spotting all the multiple references from tater tots to fantasy novels. One thing I was kinda worried about; was Jack Black going to be TOO Jack Black, if ya know what I mean, but, wow, I dunno, Jack Black was fantastic as Steve! All the other cast were great too, felt like they all had a good time making this movie, and I had a great time watching it with my boys! They LOVED it. Can't wait for the sequel with Alex!"
    },
    {
      "rating": "4.5/5",
      "review": "Exceded my family's expectations by miles"
    },
    {
      "rating": "5/5",
      "review": "CHICKEN JOCKEY!!!!!!!🏇"
    },
    {
      "rating": "2.5/5",
      "review": "Chicken Jockey!!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "First movie i have watched with my kids in years and it was worse then I could ever try and describe. If you just a normal parent trying to avoid the ideological, political agendas being spewed into this world, avoid this one. It is 140 minutes of torture."
    },
    {
      "rating": "4/5",
      "review": "Didn’t expect to belly laugh nearly so much. Just what I needed, especially in 3D."
    },
    {
      "rating": "3.5/5",
      "review": "Jared Hess' filmmaking talents are finally given the blockbuster treatment, in a surprisingly never-dull, and at-times gut-bustingly hilarious, adaptation of a game I've never been a fan of. The premise may be another Jumanji with Jack Black, but it's still a kid-friendly good time. Shame it's got one of Jason Momoa's lowest roles, though."
    },
    {
      "rating": "5/5",
      "review": "Great movie for the family and funny."
    },
    {
      "rating": "5/5",
      "review": "Lots of fun! Jack Black and Jason Momoa are awesome together! The whole thing was entertaining from start to finish!"
    },
    {
      "rating": "0.5/5",
      "review": "only good for five year olds, and even then, this is shameful. how can people enjoy this unironically"
    },
    {
      "rating": "5/5",
      "review": "Loved it! Garrett was my favorite character and I loved the Zero to hero song and Steve’s lava chicken"
    },
    {
      "rating": "1.5/5",
      "review": "Quem gosta do game vai querer ver, mas o enredo e os personagens são decepcionantes! Espero que façam o segundo filme com os dois personagens originais, mais fiel ao game e com o Ender Dragon como vilão!"
    },
    {
      "rating": "3/5",
      "review": "It was funny, dont go in expecting a crazy plot and just have fun with it."
    },
    {
      "rating": "5/5",
      "review": "Está película es una película dirigida por un estudio llamado Warner Bros, no solo es una película de un juego, es una película que abre tu imaginación, me encanta esta película es una excelente película, maravillosa y sorprendente. La película ideal para ver en familia."
    },
    {
      "rating": "3.5/5",
      "review": "Started off very random, and the crowd was very engaged in the movie the entire time, with both screaming and clapping throughout.. It was corky in its own way, had a laugh and was good for both the kids as well as adults."
    },
    {
      "rating": "2/5",
      "review": "Too stupid for words, I didnt care for the two characters the main male character characters either their character characters were awful"
    },
    {
      "rating": "2/5",
      "review": "It just wasn't the best. A lot of them felt forced into the humor. I felt like the only good character was Garbage man without his I wouldn't have liked the movie at all. Lacks story, the animation was kind of annoying and weird design and it the jokes weren't very funny in my opinion. Just lacked I suppose, there were funny scenes but not even enough to make up for the part that felt forced and the scenes lacking."
    },
    {
      "rating": "1.5/5",
      "review": "I have played Minecraft. I adore Jack Black. Danielle Brooks and Jason Momoa are fun in almost any movie. Emma Myers is adorable. This movie is dumb as rocks despite what should be a stacked comedy cast and an easy canvas for jokes. Where is the comedy? Where are the jokes? Obviously in a different part of the overworld."
    },
    {
      "rating": "5/5",
      "review": "Such a wild ride, as we knew it would be, but the memory catchers for the kids watching are priceless."
    },
    {
      "rating": "4.5/5",
      "review": "I thought it was a very well made and well acted film. It was a bit strange as it morphed into a vampire film. This might really put some people off, but I think the quality of the film itself was worth it."
    },
    {
      "rating": "5/5",
      "review": "It was a blast I love it"
    },
    {
      "rating": "1/5",
      "review": "Having watched my kid absorb anything Minecraft for the last several years, I was really disappointed in some missed opportunities. It just seemed more of a Jack Black show-off. Of course my kid loved it, but I was bored to tears."
    },
    {
      "rating": "3/5",
      "review": "I'm not in the demographic this movie is for, but it was okay. Black & Momoa carry this movie despite it's unoriginal (surprising considering the game is all about creativity) and rather mundane story. ps: my son loved it."
    },
    {
      "rating": "4.5/5",
      "review": "Its good for my opinion, the mobs,villagers and the story though they didn't add the ender dragon the vfx and CGI are realistic. I recommend watch this movie with your family."
    },
    {
      "rating": "5/5",
      "review": "Very FUN movie! Highly recommend seeing in a theater with children!"
    },
    {
      "rating": "5/5",
      "review": "Super cute movie! Not disappointed at all. Very heartwarming. Lots of puns and innuendos. Great adult and kid humor!"
    },
    {
      "rating": "5/5",
      "review": "I'm still reeling from the cinematic experience that is the Minecraft movie. As a die-hard fan of the game, I was both excited and apprehensive about how the filmmakers would translate the beloved franchise to the big screen. But let me tell you, they absolutely nailed it! From the opening scene, I was transported to the blocky, pixelated world I know and love, Jack Black being the perfect transport. The visuals were stunning, perfectly capturing the game's unique aesthetic. The characters, environments, and creatures all looked exactly as I imagined them. The attention to detail was impressive, from the textures to the animations. The story was engaging, action-packed, and full of surprises. The filmmakers cleverly wove together elements from various game modes, creating a narrative that felt both authentic and fresh. The characters' motivations and relationships were well-developed, making it easy to become invested in their journey. The casting was spot-on, with each actor bringing their respective character to life with enthusiasm and charm. The dialogue was witty, humorous, and often nostalgic for fans of the game. I found myself laughing out loud at several moments, and the references to Minecraft lore had me grinning from ear to ear. The action scenes were intense, thrilling, and visually stunning. The special effects were seamless, making it impossible to distinguish between what's CGI and what's real. The pacing was well-balanced, with a perfect blend of quiet moments and explosive set pieces. What truly impressed me, however, was the film's faithfulness to the game's spirit. The movie captured the essence of Minecraft's creativity, exploration, and survival mechanics, making it a love letter to fans of the game. The filmmakers clearly understood what makes Minecraft special and incorporated those elements seamlessly into the story. If I have any criticisms, it's that the movie sometimes felt a bit rushed. Some plot points could have been fleshed out more, and certain characters felt slightly underdeveloped. However, these minor quibbles didn't detract from my overall enjoyment. The Minecraft movie is a must-see for fans of the game and newcomers alike. It's an adventure-filled, visually stunning, and heartwarming film that will leave you feeling uplifted and eager for more. The filmmakers have set the bar high for franchise movies, and I'm already counting down the days until the sequel. In short, the Minecraft movie is a masterpiece. It's a testament to the power of creativity, imagination, and the enduring appeal of the Minecraft universe. If you're a fan of action, adventure, fantasy, or Minecraft itself, do yourself a favor and get tickets ASAP. Trust me, you won't regret it! Rating: 5/5 stars Recommendation: Don't miss this movie if you enjoy: - Action-adventure films - Fantasy worlds - Video game adaptations - Family-friendly content - Nostalgic references Post-credits scene: Yes, there is one, and it's worth sticking around for!"
    },
    {
      "rating": "5/5",
      "review": "JACK BLACK's song is too good"
    },
    {
      "rating": "5/5",
      "review": "It was so stupid. That was the point. I laughed a lot. Our theater was energetic to the right amount. 9/10"
    },
    {
      "rating": "3.5/5",
      "review": "Took the kids to see it and they really enjoyed it. I was laughing the most though with all the adult humour in it. Jack Black & Jason Momoa were hilarious together. There wasn’t much story building or reasoning behind it all, but it was fun to watch."
    },
    {
      "rating": "4/5",
      "review": "Entertaining, better than expected.. worth one watch"
    },
    {
      "rating": "0.5/5",
      "review": "This movie was nothing but cringe and barely follows the actual game. I cant understand how the script and story went through so many levels of approval and was made and this is what they came up with. I dont recommend"
    },
    {
      "rating": "3/5",
      "review": "Jack Black was awesome. Story a little silly"
    },
    {
      "rating": "1.5/5",
      "review": "The blending of live-action and special effects/CGI was honestly awful to look at, and the writing was just dumb and corny at times. It was fun to an extent, but something as legendary as Minecraft deserves more than just dumb fun. This should've been fully animated - in fact it should've been the next Oscar for Best Animated Feature nominee akin to Puss in Boots: The Last Wish and Nimona. But no. All they care about is the precious 5-10 year old audience and not their parents - plenty of older kids and adults love Minecraft, and deserve a movie for them just as much as the kids."
    },
    {
      "rating": "5/5",
      "review": "This is the best movie ever hands down, movie of the century"
    },
    {
      "rating": "5/5",
      "review": "Saw this twice over several days with different grandkids. They all loved it!!"
    },
    {
      "rating": "5/5",
      "review": "Corny but funny movie. Loved all the video game references, definitely made me want to go back and play again."
    },
    {
      "rating": "1.5/5",
      "review": "To be fair right off the bat, I can see where this mess will entertain 10-year-olds. Don't get me wrong, I enjoy a lot of movies geared towards them, like Pixar films. I didn't enjoy this one. I was hoping to actually be surprised, but Mamoa was seemingly lost, perhaps embarrassed while Jack Black played the annoying protagonist that hazards to explain EVERYTHING happening for us non-gamers. For this, I blame the writers for not trusting their audience. There were a couple of very funny lines and deliveries, which is why it gets a rating at all from me. However, there were far more cringe inducing lines which is why I didn't give it more. Poor Emma Myers needs to reconsider her agent. She is so much better than this."
    },
    {
      "rating": "5/5",
      "review": "I really recommend watching this movie. It was really great. (CHICKEN JOCKEY 🐓🐓🐓🐓🐔🐔🐔🧟‍♂️🧟‍♂️)"
    },
    {
      "rating": "4.5/5",
      "review": "It’s a kids movie. They liked it and so did I. Nothing special just a fun movie."
    },
    {
      "rating": "5/5",
      "review": "Funny and entertaining.. I wasn't expecting it to be a movie I would like but it was pretty great.bJack Black was as funny as always and Jason Mamoa portrayed his character perfectly! Highly recommend...and Yes mons you will live it as much as them."
    },
    {
      "rating": "4/5",
      "review": "Honestly, A Minecraft Movie really surprised me in a good way. I walked into the theater thinking it would just be for kids, but I walked out feeling like I had just been part of a great adventure. I loved how the movie shows the importance of building, protecting, and creating your own space — kind of like putting up a fence in real life to take care of what matters most. The animation is beautiful, especially the scenes with the pandas, which are pure joy. Jason Momoa and Jack Black bring a ton of energy and humor, and even though some parts feel a little rushed, overall the movie keeps a fun and engaging pace. Its a love letter to anyone who ever got lost for hours building in Minecraft. You dont have to be a huge fan to enjoy it, but if youve ever loved the idea of creating and defending your own world, this movie will hit you right in the heart."
    },
    {
      "rating": "5/5",
      "review": "The kids loved it and we enjoyed it more!!!"
    },
    {
      "rating": "1.5/5",
      "review": "A few cheap laughs and Jack Black and Jason Mamoa having so much fun being idiotic are the only redeeming things in this movie. Even my friend's middle school agreed son was disappointed."
    },
    {
      "rating": "5/5",
      "review": "Best movie ever!!!!!!!! Whoooooo!!!!!! Must see for sure! CHICKEN JOCKEY!!!!!"
    },
    {
      "rating": "5/5",
      "review": "I organized a private showing with a bunch of college students and I must say, that is the ideal way and demographic to see this movie! It's fine for children, but college students, who grew up with all the history and know all the references will appreciate it the most. It doesn't take itself seriously and leans into the memes. If you didn't like it, it's probably because you're not in this demographic."
    }
  ]
}