{
  "movie_name": "The Order",
  "reviews": [
    {
      "rating": "3.5/5",
      "review": "Loosely based on a White Supremest leader and how he was taken down by law enforcement."
    },
    {
      "rating": "0.5/5",
      "review": "****ing kick my *** for watching failure come from this movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Poorly sensationalized version of \"based on a true story\". Deserves zero stars."
    },
    {
      "rating": "4/5",
      "review": "Excellent film on a subject that seems to slip through so many eras. White power has always been around and some take it to the extreme. This is a true story and one that should be told. The acting was top notch, the beauty of the land shines through crystal clear and I enjoyed it very much."
    },
    {
      "rating": "4/5",
      "review": "Gripping atory. Amazing cast. Worth the watch."
    },
    {
      "rating": "3.5/5",
      "review": "Excellent acting, but the story sputters and goes on too long. I'm usually advocating for series to be movies, but in this case, this would've been more effective as a limited series."
    },
    {
      "rating": "5/5",
      "review": "Justin Kurzel did a magnificent job here. Jude Law fits his role perfectly, as does rest of cast. Real straight forward, tell it as it is, no nonsense movie. Gritty, amazing discipline and more than enough action. This is one very solid movie"
    },
    {
      "rating": "1.5/5",
      "review": "pretty boring…. felt like a movie to watch on an airplane when you can’t find anything else"
    },
    {
      "rating": "2/5",
      "review": "Ending made me regret watching the entire thing"
    },
    {
      "rating": "4/5",
      "review": "Worth watching, one of the best movies this year"
    },
    {
      "rating": "2.5/5",
      "review": "Well-acted, classy, fairly boring and formulaic. The specifics of the criminals and the confrontations with them are slightly novel, and the fact it's based on a true story adds interest, but overall if you've seen any gritty police movies where a world-weary veteran allies with a young, idealistic cop with a family for a dangerous investigation, you've basically seen this movie and will know what's coming."
    },
    {
      "rating": "4/5",
      "review": "A movie most people didn’t know about but what a hidden gem. Direction and acting is brilliant and the story keeps you locked in. Watch it!!!"
    },
    {
      "rating": "4/5",
      "review": "Terrifying to know this was based on true events."
    },
    {
      "rating": "3/5",
      "review": "You know what’s gonna happen from beginning to end this movie‘s been done before"
    },
    {
      "rating": "4.5/5",
      "review": "Thriller sólido, intenso y viceral."
    },
    {
      "rating": "3/5",
      "review": "I enjoyed this film. But there are others in its class that are way better. #Red State #American History X"
    },
    {
      "rating": "2/5",
      "review": "Not great. I already forgot what this movie was about."
    },
    {
      "rating": "5/5",
      "review": "Well written, acted, and storyline. So important. Watch this movie!"
    },
    {
      "rating": "3/5",
      "review": "eh it was alright, maybe I was not in the right mood for it. just felt a bit disjointed, the pacing was off. nicholas hoults american accent was pretty decent though. over all very mid"
    },
    {
      "rating": "4/5",
      "review": "The Order is a solid law enforcement thriller, featuring exceptional performances by Jude Law and Nicholas Hoult.  Although I had issues with the movie’s pacing and focus, the view it provides of the world of white separatism is as gripping as it is troubling.  Recommended. detroitcineaste"
    },
    {
      "rating": "4/5",
      "review": "Jude Law is superb in this film. You would never know he is British by his voice in this role. Set back in the day, but the issue is still relevant today. A great movie."
    },
    {
      "rating": "0.5/5",
      "review": "Really enjoyed the film up until the end credits decided to throw in a ridiculous and intellectually lazy connection between the Oklahoma City bombing and January 6th. One was a meticulously planned terrorist attack directly inspired by The Turner Diaries—the other was a chaotic riot with no concrete ties to that book beyond vague ideological hand-waving. Trying to link the two like they’re parallel events is a stupid grasp for straws and totally undermines the seriousness of the real historical connection. Don’t insult the audience’s intelligence with this kind of nonsense."
    },
    {
      "rating": "4.5/5",
      "review": "Purée... Waw. Visuellement le film est incroyable, la colorimétrie est dingue, les plans sont vraiment sympas, le film est sobre mais tellement bien réalisé. Le parti prit de ne pas mettre énormément de musique (petits filets de suspenses de temps en temps) ça ajoute quelque chose de prenant. Basé sur une histoire vraie mais réalisé et scénarisé à la perfection, franchement chapeau !"
    },
    {
      "rating": "2/5",
      "review": "Its name is MAGA now."
    },
    {
      "rating": "3.5/5",
      "review": "Solid engaging film, great acting bit a little slow in places. Definitely not action packed, feels a lot like an 80s movie."
    },
    {
      "rating": "4/5",
      "review": "The Order is an interesting movie with a stellar performance from Jude Law. The characters are layered and interesting, but they don't really have arcs. None of them are perfect, even the protagonists. Jamie has heart, but he is not the best at his job and Terry can't really handle that. On the other hand he is good at his job, but isn't with people. This makes it very realistic and believable since it's based on true events. The cinematography is beautiful, the colours are gorgeous, while being realistic. I love when colours look in movies exactly as in real life and they're still beautiful. The pacing isn't perfect, but it's good enough to keep interest. The best part about this film is Jude Law. His acting performance is absolutely stunning. It felt like it was given by Christian Bale. The Order has great cinematography and a stellar performance from Jude Law."
    },
    {
      "rating": "3/5",
      "review": "It delivers exactly what it needs to - nothing more, nothing less. There's no unnecessary spectacle or artistic ambition; it simply tells the story as it is. The cast is above average, with solid performances all around, and Jude Law once again proves why he's such a reliable actor. Whenever the script gave him the chance to dig deeper into his character, he delivered phenomenally, adding weight to moments that might have otherwise felt flat. His presence elevates the film, even when the story itself doesn't take many creative risks. The script stays true to the real events (I guess), though it doesn't bring much creativity to the storytelling. It follows the facts without adding any deeper artistic or critical layers, which is as expected from a film in this genre. This isn't a film meant to challeng perspectives or serve as a statement - it's a straightforward recounting of events. And in that sense, it does what it sets out to do."
    },
    {
      "rating": "2/5",
      "review": "Good film that couldn’t stop itself from “going there” at the end. Such a shame."
    },
    {
      "rating": "4.5/5",
      "review": "A triumph of cinematic excellence. Jude Law's exceptional performance breathes life into his character, making it a compelling centerpiece. The breathtaking cinematography and meticulously crafted settings create an immersive visual journey that lingers in the mind. Additionally, the film's pacing is impeccably balanced, maintaining an engaging rhythm throughout. The Order is a masterclass in storytelling and visual brilliance."
    },
    {
      "rating": "4/5",
      "review": "Jude Law is a class act and squares up nicely against Hoult's almost equally well played bad guy. If you like crime thrillers then this is a decent one. Dramatic mountain locations are a visual bonus."
    },
    {
      "rating": "1.5/5",
      "review": "This would have been a four-star movie, except for the fact, that in the end credits, the director and producers said that the book featured in the film which inspired the terrorists, was also integral to the “January 6 insurrection.” To be clear, there was no insurrection on January 6. That has been proven. Know the definition of the word before slathering your political views into such a fine movie. Shameful."
    },
    {
      "rating": "5/5",
      "review": "Fantastic film with a great cast and great acting, I throughly enjoyed it."
    },
    {
      "rating": "3.5/5",
      "review": "It is a good film. At the beginning I thought I would really like it. For some reason my interest started fading."
    },
    {
      "rating": "5/5",
      "review": "A very straight forward and entertaining to watch movie. Nude Law and Nicholas Hoult have captivating performances. Interesting story I wasn’t aware of."
    },
    {
      "rating": "4/5",
      "review": "A slow burn that leads to a fantastic final stand-off, all while using history to give a warning about our future if we're not careful."
    },
    {
      "rating": "4/5",
      "review": "A Sicario / Ozark type of film, involving FBI agents. The fact that it's based on a true events from the 1980's makes it all the more chilling and, of course, the story resonates with the current political climate. Excellent performances from the entire cast."
    },
    {
      "rating": "3/5",
      "review": "Well done but forgettable. I'll watch it again next year and say \"well this looks familiar.\""
    },
    {
      "rating": "3.5/5",
      "review": "All good actors. Keeps your attention all the way. Based on a true story which adds more juice to it, however no more than 3.5 stars."
    },
    {
      "rating": "5/5",
      "review": "Very enjoyable movie. Great performances from Law and Hoult. The parallels between the two main character is very interesting and shows two separate paths of obsession that lead to the same outcome of unfulfillment."
    },
    {
      "rating": "2.5/5",
      "review": "No idea how this got such high review marks. I think it's partly due to Law's commanding performance and also because most films these days try to be too clever and imaginative, yet end up falling flat. Overall, it's watchable but nothing original in terms of story - FBI agent gets called in about a dangerous gang, and he teams up with local officer to bring them down etc. Btw, look out for what it steals from the Deer Hunter."
    },
    {
      "rating": "2/5",
      "review": "its ok its overate as hell"
    },
    {
      "rating": "4.5/5",
      "review": "Great flick for those who love the genre. Tasteful use of historical details and real facts. Has something to say without actually saying it. A good reflection on societal and personal worldviews."
    },
    {
      "rating": "1.5/5",
      "review": "Became a yawnfest. Acted ok but just bored me."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie. Well written and directed."
    },
    {
      "rating": "4.5/5",
      "review": "Nicely made, performance from the actors & not tricking the audience with much non sense, it's straight to the core of the matter. Only downside i can find is Jude Law walking thru flames like there are not there. Nice AI flames but still top quality movie :)"
    },
    {
      "rating": "5/5",
      "review": "We've been recommending this movie to many! Great plot, strong acting. Kept us engaged the entire time. Highly recommend."
    },
    {
      "rating": "5/5",
      "review": "Very good movie bsed on true events. Jude Law plays an FBI agent trying to track a white supremace group know as The Order. They rob banks to fund the cause which is revolution resulting in the overthrow of the government. Nicholas Hoult is very good at playing Bob Matthews the leader of the group. With lots of ation and supense and very good acting and story."
    },
    {
      "rating": "2/5",
      "review": "it looks nice but it's very boring"
    },
    {
      "rating": "2/5",
      "review": "I’m convinced the ratings are being gamed. This movie is ok. Its not a 90% masterpiece, its just not. Jude’s accent is a bit distracting, the woman detective is entirely unbelievable and not sure why her role was even cast, it makes me wonder. My guess is if you watch and love MSNBC and Rachael Maddow, you’ll really love this movie because it hits every note. It’s more message than movie. It’s one long relentless message spelled out in excruciating detail. Just don’t pay for it, wait till its free."
    },
    {
      "rating": "3.5/5",
      "review": "Hoult's character should have had a visibly cruel death on screen. Need to do that to vile characters to avoid glorifying them. Great other than that miss, but not a groundbreaking film by any stretch of the imagination"
    },
    {
      "rating": "5/5",
      "review": "Well scripted, acting was great, cinematic masterpiece. Must watch."
    },
    {
      "rating": "2.5/5",
      "review": "Completely over rated. Watcable, but only when you're half dead after a big night out. Jude is ok. Dialogue is tiresome and the finale is terrible. Set design is pretty sweet but it all feels rather fake. No idea how it's rated so highly. I'm either blind or intellectually impaired."
    },
    {
      "rating": "5/5",
      "review": "Well acted, well staged, moved along at a realistic pace."
    },
    {
      "rating": "0.5/5",
      "review": "Not a bad movie. Not a lot in the plot. Definitely not as good as the rating on here is. But a pretty good movie. But if you want to laugh really hard, wait until the end when they try to link it to the “January 6th insurrection”"
    },
    {
      "rating": "2/5",
      "review": "Why bother hating the bad guys when the lead character good guy is a juvenile ass?"
    },
    {
      "rating": "5/5",
      "review": "the plot was all over the plae its supposed to be about this guy whos on a quest to uncover some secrt order but it was more confusing than a fish out of wter flashbacks and cryptic symbls kept popping up and by the end it felt like a map and compass were needed to find the way back to the storylne so while i was watching i couldnt help but think about my ex cassidy i mean talk about tangled up and confusing wed plan a simpl day out and it would turn into a scavenger hunt across the city shed make everything ten times more complicated than it needed to be one minute she was all sweet and fun and the next she was like a storm clod rolling in watching the order felt like being in one of our old unpredictable dates just a whirlwind of chaos with no clear direction and dont even get me started on how shed brood about the smallest things much like alex in this flick ugh memries the characters were a real mixed bag too the main guy alex was about as charismatic as a wet soc he had that brooding mysterious vibe but lets be real enough brooding heroes have already been seen alex was more like a stale loaf of bread than a fiery hero and the villains cardboard cutouts with better plots to take over the wrld have been seen the bad guys in this flick were cartoonishly evil but not in a fun way they were trying too hard you know visualy the movie wasnt half bad they had some pretty nifty effects and set designs kind of like really going all out for halloween but pretty pictures alone dont make a good movie they tried to layer on the dark gothic atmosphere but it felt like dressing"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible!!! so so so so so slow! I find anything that the \"critics\" like I generally dont.. but the high audience score had me intrigued. Nope! crappy.."
    },
    {
      "rating": "4.5/5",
      "review": "A stoic Jude Law opposite a monstrous Nicholas Hoult. The Order held my attention from start to finish with its rich Americana visual imagery and hypnotic score."
    },
    {
      "rating": "4.5/5",
      "review": "Jude law is unrecognizable in this film, his accent completely gone. I'm always amazed when UK actors do that. The movie was well done, acting and everything was great. I love where it was filmed, so watching the familiar background was entertaining as well."
    },
    {
      "rating": "4/5",
      "review": "An incredibly tense 1980s domestic terrorism story portrayed by Justin Kertzel. Law and Hoult with fantastic performances in this old-fashioned thriller."
    },
    {
      "rating": "5/5",
      "review": "Well written and acted, with some really interesting performances from Law and especially Hoult. I absolutely loved the relentless \"Peckinpah vibe\", and it's very intelligent in working on a part of history and narrative that is lacerating and often hidden by contemporary America."
    },
    {
      "rating": "3.5/5",
      "review": "Jude Law and Nicholas Hoult are both great. Good, solid movie."
    },
    {
      "rating": "4/5",
      "review": "Jude Law on top form."
    },
    {
      "rating": "3.5/5",
      "review": "Jude is the \"Law\" and makes this history lesson seem very timely."
    },
    {
      "rating": "1.5/5",
      "review": "Liked the movie until the end tying it to Jan 6th."
    },
    {
      "rating": "4/5",
      "review": "The story line was gripping even as it dealt with some disturbing themes. Jude Law put on a class act."
    },
    {
      "rating": "4/5",
      "review": "Very good film with good performances from Law and Hoult. Didn’t know anything about this story until now ."
    },
    {
      "rating": "4/5",
      "review": "Slow burn with excellent acting."
    },
    {
      "rating": "5/5",
      "review": "Great movie. The acting was superb."
    },
    {
      "rating": "2/5",
      "review": "Weak character development"
    },
    {
      "rating": "5/5",
      "review": "This movie needs to be seen by everyone, especially considering the overwhelming, public re-emergence of so many hate groups (i.e., “white supremacists”). This country is vastly regressing in how minorities are viewed and treated. “The Order” made me very angry at first, but then I became extremely saddened by what I was watching because it is happening right now, even though the movie takes place in the early 1980s. What’s really scary is that it is based on true events."
    },
    {
      "rating": "4/5",
      "review": "Efficient true crime drama with a superlative Jude Law performance."
    },
    {
      "rating": "1.5/5",
      "review": "It’s so boring. I can’t fathom how so many people found this movie to be so entertaining."
    },
    {
      "rating": "5/5",
      "review": "Amazing performances. Great dissemination of an alarming movement. Intense."
    },
    {
      "rating": "4/5",
      "review": "The Order tells a true story of Neo-Nazism in the 1980s. I've watched a few of these boys club tales of late whether it's Conclave, The Bikeriders or The Order you can guarantee putting a bunch of men together who harbour ludicrous beliefs which in turn lead to dubious 'rules to live by' will end up with catastrophic outcomes. Invariably communities, families and any innocents who dare oppose these self imposed rules will have to deal with their consequences. It seems that every movie currently has Nicholas Hoult in and it further appears you can guarantee a level of quality with each appearance. Jude Law also puts in an admirable shift with his portrayal of the jaded FBI agent, even his accent is believable. Well worth a watch, it did get make me angry at times but that's a testament to the quality of storytelling on display here."
    },
    {
      "rating": "4.5/5",
      "review": "The Cinematography is just beautiful. Those sweeping scenes of Jude Law driving through the landscape are breathtaking. An incredible cast overall, but the three male leads, Jude Law, Nicholas Hoult and Tye Sheridan all show why they are some of the best actors out there at the moment."
    },
    {
      "rating": "0.5/5",
      "review": "What were the critic thinking?!s"
    },
    {
      "rating": "5/5",
      "review": "Very engaging story, worryingly relevant to the current political climate in the USA. Great performances all round, really well paced and shot. Why aren't there more films like this? Would have flown under the radar but for RT."
    },
    {
      "rating": "4/5",
      "review": "Strong acting, writing and direction make this one a solid film."
    },
    {
      "rating": "4/5",
      "review": "Jude Law's acting was great. Story was interesting, ending was not satisfying. Tye Sheridan was a great secondary character and in some ways the best parts of this movie. I would say if you are interested in the history, its worth it's rating, I just particularly didn't think it was as good as a 90% movie ought to be."
    },
    {
      "rating": "5/5",
      "review": "Amazing actor performances. Jude Law great in his role. Nicholas Hoult UNREAL really plays a beliverble twisted pycho well. Take a bow. Give it a watch!!"
    },
    {
      "rating": "3.5/5",
      "review": "Very well filmed, and nice to watch, but the ending linking the January 6 United States Capitol attack to the Turner diaries is just a fallacy of guilt by association."
    },
    {
      "rating": "4/5",
      "review": "Mikey’s Movie Review: The Order (2024) Directed by Australian helmer Justin Kurzel (Nitram), written by Zach Baylin (King Richard) and based on a true account, Amazon’s latest police thriller is a solid, good old-fashioned actioner. Occasionally gripping and thematically, somewhat timely. Set in 1983, Jude Law stars as Veteran FBI agent Terry Husk who after a heart operation and estranged from his wife and daughter, moves to Idaho looking for an easier caseload. After previously working on intense investigations of the Ku Klux Klan and La Cosa Nostra, he soon begins investigating the actions of a splinter group of the Aryan Nations. An organisation (inspired by The Turner Diaries*) who could be involved in a series of robberies, murder, counterfeit and are possibly planning an attack on the federal government. Law is a perfect fit for Husk. Grizzled and broken but determined. Further proof he remains a frequently underused and underrated actor, and given the right material excells. Once again Nicholas Hoult (as the charismatic leader of The Order Bob Matthews) displays his exceptional range. With 4 completely different films in 2024 alone - The Garfield Movie, Nosferatu, The Order and Juror#2 he has to be the most interesting, varied and in demand actor currently working in Hollywood. The supporting cast (especially Jurnee Smollett) is solid too, but if anything we have seen this kind of film many times before. Kurzel brings nothing new to the table in the delivery, apart from a breathless pace. While cinematographer Adam Arkapaw (Macbeth) ensures it looks great without being showy. The execution is simple but effective allowing the drama to play out and the films two main protagonists to shine. Overall an intense, chilling, thought-provoking ride worthy of your time. Mikey’s Movie Rating: 4/5* *The Turner Diaries is one of the most controversial and influential works in shaping white nationalism. It has inspired numerous hate crimes and acts of terrorism, including; the Oklahoma City bombing (1995), the London nail bombings (1999) and the mob riot / attempted coup of the White House in 2021…"
    },
    {
      "rating": "4/5",
      "review": "(CASTELLANO) The Order (La Hermandad Silenciosa) ofrece un viaje tenso y bien ejecutado por los oscuros rincones del extremismo estadounidense en los años 80. La película destaca no solo por su ritmo trepidante y sus secuencias de acción bien construidas, sino también por el trasfondo político que resuena inquietantemente en la actualidad. Aunque Jude Law y Nicholas Hoult se reparten el protagonismo, es Law quien aporta una fuerza magnética a su papel, haciendo que cada escena en la que aparece cobre intensidad. La dirección de Justin Kurzel consigue mantener la tensión de principio a fin. Su habilidad para crear atmósferas opresivas y para rodar escenas de violencia con realismo convierte este thriller en algo más que una simple película de persecuciones y tiroteos. Sin embargo, aunque la trama mantiene el interés, a veces cae en clichés del género, lo que le resta originalidad. A pesar de estos altibajos, The Order logra mantenerse firme como un relato potente sobre los peligros del fanatismo. No solo entretiene, sino que también invita a reflexionar sobre cómo estos movimientos extremistas del pasado siguen teniendo eco en el presente. Es una película que, sin grandes artificios, deja huella y consigue enganchar al espectador hasta el último minuto. (ENGLISH) The Order takes viewers on a tense, well-executed journey through the dark corners of American extremism in the 1980s. The film stands out not only for its fast-paced rhythm and well-crafted action sequences but also for its political backdrop, which resonates disturbingly with current events. While Jude Law and Nicholas Hoult share the spotlight, it's Law who brings a magnetic presence to his role, adding intensity to every scene he's in. Justin Kurzel’s direction keeps the tension high from start to finish. His ability to create oppressive atmospheres and film violence with stark realism elevates this thriller beyond a simple tale of chases and shootouts. However, while the plot remains engaging, it occasionally falls into genre clichés, which slightly undermines its originality. Despite these minor flaws, The Order holds strong as a powerful narrative about the dangers of fanaticism. It doesn’t just entertain—it prompts reflection on how extremist movements from the past continue to echo in the present. Without relying on flashy tricks, this is a film that leaves a mark and keeps viewers hooked until the very last minute."
    },
    {
      "rating": "5/5",
      "review": "A great narrative that uses historical events from the 80s as a basis for a work of fiction that sadly reflects today's American society. An exceptional film by Justin Kurzel and Zach Baylin, based on the incredible work of Kevin Flynn and Gary Gerhardt. It definitely deserves your attention in 2025."
    },
    {
      "rating": "0.5/5",
      "review": "Full blown written association at the end of the movie claiming this film’s atrocities are tied with Jan 6, tells you all you need to know about this joke of a film. Hard pass."
    },
    {
      "rating": "5/5",
      "review": "There's not been better explemplifying of the idea that overly familiar tropes, story beats, character archs etc can continue to impact when done well. I was deeply involved with this deceptively well nuanced story. The performances were excellent; everything was spot on. It's also a brilliant throw back to a period of film making that I thought was utterly dead. No comprising here. Just real characters, realised brilliantly through excellent performances, and an attention to period authenticity that is rarely seen. Additionally, a complete refusal to white wash the scene with PC anachronism, seriously elevates the material too."
    },
    {
      "rating": "4/5",
      "review": "The Order is a gripping crime thriller with strong performances from Jude Law and Nicholas Hoult. The story is intense and thought-provoking, shedding light on a dark part of history. While it feels more suited for streaming than theaters, it’s still an engaging watch"
    },
    {
      "rating": "3/5",
      "review": "Hoult didn't seem convincing in his character. Law was the perfect 70s FBI agent. He looked and felt so worn down, and that mustache was on point. Interesting film, slow at times but watch worthy."
    },
    {
      "rating": "4/5",
      "review": "Enjoyable film, beautifully shot and would certainly recommend watching on the big screen if you get a chance. Lead performances, in particular Law, are excellent."
    },
    {
      "rating": "4/5",
      "review": "Dice que es basada en hechos reales y la verdad es que esta buen bien escrita. Todo lo que ocurre de principio a fin es muy interesante y te mantiene enganchado. La fotografía es deleitable."
    },
    {
      "rating": "5/5",
      "review": "I saw this at the cinema and on Prime - good on the large and small screen. Excellent performances by Jude Law, Nicholas Hoult, Alison Oliver and Tye Sheridan. I was terrified after watching the film - that this event happened in 1983, that the USA is seemingly ungovernable because of the size of the country, and that people can set up these religions and organisations that influence and control ppl."
    },
    {
      "rating": "3.5/5",
      "review": "A solid movie, Quite straightforward narrative wise with a slightly underwhelming ending(but it happened in real life so I get it) but what sold the film for me was how good Jude Law and Nicholas Hoult where, brilliant performances of men on other ends of the moral spectrum plus it's a lovely film to look at"
    },
    {
      "rating": "4.5/5",
      "review": "I had never even heard of this film until I had seen a trailer to it while scrolling through on-demand videos and it intrigued me. I have seen Nicholas Hoult and Jude Law in many movies and always give good performances and this was no different, especially how indistinguishable Law made his accent. Tye Sheridan was also giving a good performance for a supporting actor. The story itself is pretty entertaining being based off true events and the movie keeps you very interested and invested in the plot. I would definitely give this a watch as many movies in the previous few years I have not found riveting or been curious solely off the trailer. Few movies do that and this is one of them."
    },
    {
      "rating": "3.5/5",
      "review": "The Order makes its point through its story. It does not use pushed emotions, flashbacks or even history to make us understand the form. The story itself teaches and shows. It does more than it says. However, as strong the story and the characters, it does lack cohesiveness and quality articulation to create something great. What it does do, is something good, it reminds of how horrifying the Klan and its factions were/are. I enjoyed it thoroughly with action, meaning and performance but the action was more prominent than the lesson intended."
    },
    {
      "rating": "4.5/5",
      "review": "Such a good movie. Ending wasn’t perfect but the acting and the story overall were to die for."
    },
    {
      "rating": "5/5",
      "review": "One of the best films I had the privilege to watch in 2024. Jude Law was quite frankly, sensational and nearly stole the entire show.. but Nicolas Hoult was also nothing to blink at either… this movie tells of an Aryan Brotherhood-Terrorist Group run by Robert Mathews back in the 1980s. From Seattle, WA, to Idaho, to Denver, CO… they run rampid, robbing banks and armored trucks, and also delve into murder In hopes to gather enough money to complete their Ultimate Goal: Upend the United States Government, in which they viewed was massively flawed and run by the “Zionist Organization Government.” It really gives a new meaning of “there aint nothing more dangerous than a fool with a cause..”"
    },
    {
      "rating": "2/5",
      "review": "I went and read the wikipedia of the actual guy this is about and his story is utterly typical in its criminality. He was not a mastermind as the movie fictionalizes, but merely your run of the mill low tier criminal. In the end, as is very common, he was snitched on by his own people, and they all left him to die -- which he did -- in, again, a run of the mill shootout with the FBI. Justin Kurzel has done some good stuff but his film is pure fiction and really didn't need to be made, we have plenty of crime thrillers."
    },
    {
      "rating": "0.5/5",
      "review": "Really bad, choppy story with bad acting."
    },
    {
      "rating": "5/5",
      "review": "Edge of the seat movie without a minute of boredom for me, got through it in one sitting which is more than I can say for a lot of movies these days. Jude Law was absolutely amazing as the flawed FBI officer bent on justice and scarred from his past. Hoult always awesome too. It looks great with the wardrobe and look of the period. A stand out is the Jed Kurzel score, thumping and ads the mood and tension of the movie. Highly Recommended."
    },
    {
      "rating": "3/5",
      "review": "This was slow and static. The white supremecists come out on top as more disciplined and organized and driven. The divorced alcoholic FBI agent looks like a bumbling fool. This should have been a TV movie."
    },
    {
      "rating": "5/5",
      "review": "Excellent film! Jude Law is always good so that was no surprise, but Nicholas Hoult was outstanding in this film. Movie grabbed me from the start and had me hooked till the very end. The music really gave it a dark, eerie feeling to it and I loved the backdrop and scenery shots they gave Jude Law’s character out in the wooded areas."
    },
    {
      "rating": "2/5",
      "review": "Poor directed by. Boring."
    },
    {
      "rating": "5/5",
      "review": "So relevant. Stand up to the fascists who have achieved control."
    },
    {
      "rating": "3.5/5",
      "review": "It starts as a 10/10 movie with a terrifying atmosphere, but it shies away from delving deeper into the subject it aims to explore. The real problem lies in the increasingly rushed pace from the middle to the end of the film. It feels like someone driving a motorcycle for the first time, going all in on the accelerator without even being properly seated. That said, it’s still a good movie. It had the potential to be a 10/10, but the rushed pacing and lack of critical depth, combined with a loss of atmosphere as it accelerates, make it fall short in a harsh way."
    },
    {
      "rating": "3/5",
      "review": "It was OK until the end when some idiot claimed their was an insurrection in 2021. It will be nice when producers keep their personal bias out of entertainment."
    },
    {
      "rating": "2/5",
      "review": "Poor story telling of a true story."
    },
    {
      "rating": "4/5",
      "review": "Overall the movie is well done, the acting is a little quirky in spots. Has a little bit of low budget feel. Based on a true story, and a story everyone needs to be aware of regarding the Turner Diaries"
    },
    {
      "rating": "4/5",
      "review": "Jude Law performed masterfully and the rest of the cast followed suit. Solid film that didn’t need the last screen read before rolling credits."
    },
    {
      "rating": "4/5",
      "review": "🍅 8.6/10 The music is amazing I wasn’t expecting them to cook on that. This is my most anticipated movie of the year and I really liked it. My big complaint is I didn’t want it to end I want it to be 3 hours long 😔 I was locked in. The climax was honestly beautiful like some of the shots in here are just gorgeous especially at the end. This is a really great thriller would definitely recommend."
    },
    {
      "rating": "2/5",
      "review": "I was really excited to see this movie. I am a fan of Jude Law, and the synopsis sounded like it was my cup of tea. however, I found it incredibly disappointing. Jude Law was unconvincing as the troubled cop, and the film seemed to drag on. I almost never stop watching before the end, but I left my wife watching while I took the dog out. Very overrated in my opinion."
    },
    {
      "rating": "3.5/5",
      "review": "Good solid movie. Only negative was that I didn’t feel Nicholas holt was right for his role. Too young looking."
    },
    {
      "rating": "4.5/5",
      "review": "One of the best films based on true events, Jude acts beautifully and brilliantly, loving his acting as always."
    },
    {
      "rating": "3.5/5",
      "review": "Well directed with amazing performances from the entire cast, with Hoult being a standout in his ability to portray a quiet evil lurking beneath a peaceful loving facade. Doesn't offer up much of anything new in the genre, but it is a good solid film."
    },
    {
      "rating": "4/5",
      "review": "This is a great movie, Jude Law is almost unrecognizable. Just the ending could have been resolved better."
    },
    {
      "rating": "1/5",
      "review": "I had hopes that this film would contain characters developed enough to care about and a plot interesting enough to invest in. Neither hope was fulfilled. It was a movie full of potential that only disappointed. The actors did their best. It’s too bad the writers didn’t."
    },
    {
      "rating": "4/5",
      "review": "The movie itself was done what really seemed to perfection. Great action. Intense all throughout. Soundtrack really elevated every moment. Did a great job of pacing as well, never really seemed to drag. Though at the very end the movie loses all credibility as it tries to pushes a fictional narrative that has been thrown about to push forward an agenda has no place here. Seeing as it’s based about a group of people who tried to push fictional narrative to advance their agenda, it completely takes away from the credibility of the filmmakers. In all though, worth watching, just don’t mess with reading the fictional title cards at end."
    },
    {
      "rating": "4/5",
      "review": "Very engaging film with a solid performance by Jude Law . Not a hint of his being British in his speaking. So nice to see something original now and then."
    },
    {
      "rating": "5/5",
      "review": "It starts off slow, but it is based on a true story so that's forgivable, plus when it gets cooking it's a wild ride from that point on. Jude Law gives an epic performance that feels out of his wheelhouse but in a good way. Nicholas Hoult feels miscast, but he does deliver a good performance. He just never feels quite right for the part, but it doesn't bring the film down at all. Above all this film feels very well crafted and sacrifices in order to be true to the feel it should have. There are no grandstanding performances here, nor is it trying to be an action packed blockbuster, but what it does it does perfectly. It's a nuanced look at true crime that delivers a tone and vibe that could only be pulled off in a grounded and understated way. Truly a film that cared more about being true to itself than wowing audiences and it works better because of it."
    },
    {
      "rating": "4/5",
      "review": "A well crafted and well acted throwback to procedural thrillers and the plot is still relevant to todays issues. Not much in here is shocking or innovative, unless you count the dozens of times Jude law washes his face and hair with river water. Location shooting outside in the mountains of the American west has always and will always be a cheat good for visuals."
    },
    {
      "rating": "4.5/5",
      "review": "I want, I need, and I demand more movies like this (hyperbolic). This reminds me of Taylor Sheridans frontier flicks, Denis Villeneuves Sicario, some of those 80s-90s Harrison Ford action thrillers, and political action thrillers of the 70s. It's elevated action. Real stories that happen to have action in it. And those are the types of action flicks I enjoy the most, which is crazy to say because some things in these movies aren't enjoyable or pleasing, but that's how us screwballs are. The realism, and real life isn't always great, so in stories like these, it doesn't feel like we are lied to when we feel bad for seeing bad stuff. Jude Law is redonculosly incredible in this. He has a scene in a car where he scolds Tye Sheridan, and he punches the window which cracks it. It seemed to actually be real, and I wonder if it was improv. Either way, not just Jude who performs brilliantly, they all do. The music is perfect for the flick, and really sets the tone. Some great music from 2024 movies. Thank you!!!!"
    },
    {
      "rating": "4/5",
      "review": "A tense, atmospheric, and gripping slow-burn that makes up for its plodding pace with solid performances. Jude Law shines opposite Nicholas Hoult, who rises up to match the brilliance of Law’s acting. The two carry the movie’s narrative, giving an otherwise drama-focused film a compelling edge."
    },
    {
      "rating": "4/5",
      "review": "Great acting and a good grip on how white nationalist groups function and speak. The structure ending feeling so lacking it is hard to feel satisfied and undermines an otherwise great movie,"
    },
    {
      "rating": "4.5/5",
      "review": "One of the best movies I saw in 2024. An enticing crime drama where the stakes are high. Jude Laws best performance. Similar story architecture to Heat or The Town, but a hair more dramatically oriented than action. Still for as many people that called it a slow burn, the pace is excellent. I will be purchasing to support. Rewatchable."
    },
    {
      "rating": "4/5",
      "review": "O M G *JUDE LAW*. WOW!!"
    },
    {
      "rating": "3/5",
      "review": "It looks great but the story lacks suspense or real bite. Jude Law is always incredible but casting Hoult as the supreme baddie ... he's way too boyish and charming ... not at all menacing - if you want a powerhouse of a Kurtzel film checkout Snowtown ... that had punch."
    },
    {
      "rating": "4.5/5",
      "review": "Jude Law was fantastic … film was gritty and believable"
    },
    {
      "rating": "4/5",
      "review": "Kurzel’s The Order is a violent, gritty, but enjoyable crime thriller with an always impeccable Jude Law as FBI detective Terry Husk. Nicholas Hoult is equally compelling. The Order gives a chilling, intense look into the criminal workings of a domestic terror group. It is one of the best crime thrillers I’ve seen in a long time. That’s saying a lot. I highly recommend it."
    },
    {
      "rating": "4.5/5",
      "review": "A modern day western. Instead of red faced villains, red-neck nationalists, amazing cast led by the one and only Jude Law, kudos!"
    },
    {
      "rating": "1.5/5",
      "review": "The poor ending to what was an otherwise a good movie was possibly due to it trying to keep to the true life events."
    },
    {
      "rating": "2/5",
      "review": "I didn't quite understand what was so good about this movie. I wasn't impressed by the acting or the not so original plot. It was more like a below average Netflix movie if you ask me."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie, Jude Law is perfect for this role!"
    },
    {
      "rating": "2/5",
      "review": "Not sure what everyone's raving about, Sure, Jude Law is a good actor but that doesn't make this a good film. We aren't told why his character transferred to the middle of nowhere, but we are told (tastelessly) that relaxing in the Great Outdoors requires killing wildlife of the Great Outdoors. Events that did not happen are inserted but the actual has been left out. Law enforcement investigation is middling at best, Jude and his trusty band are more in danger of harming themselves than others, and there's no in-depth look at the extremist groups involved. In short, a glib power point presentation that relies solely on the star power of its lead actor."
    },
    {
      "rating": "4/5",
      "review": "Cinematography was excellent. The story was clear. Characters were believable. The pace of the story was good. A true story told without to much verbal and physical violence. Recommended."
    },
    {
      "rating": "5/5",
      "review": "One of the best films of 2024. Riveting, compelling and mirrors present day America in too many ways. Jude Law, Tye Sheridan and the rest of the cast are at the top of their game."
    },
    {
      "rating": "5/5",
      "review": "This is possible the best film of 2024 that's has somehow slipped under the radar. Both Jude law and Nicolas hoults performances are outstanding and out matched."
    },
    {
      "rating": "4/5",
      "review": "Good cast, well acted, pretty close to real life event. My only dissappointment is production had no clue what cda / hayden lake look like geographic wise. They filmed it in Canada and had north ID looking like barren treeless area. Wrong."
    },
    {
      "rating": "0.5/5",
      "review": "More of the agenda to make the white man the new boogie man, trying to talk about the past and fit it into this crazy world we live in as a distraction of what's really going on in this world. All the bad guys now days have to be white to be politically correct which is actually the farthest from reality!"
    },
    {
      "rating": "4/5",
      "review": "Good movie. Great performances from Jude Law and Nicholas Hoult. The title card at the end somehow trying tie the events of the movie to January 6 was laughably cringe."
    },
    {
      "rating": "4.5/5",
      "review": "Masterpiece under all aspects, cast, atmosphere, story everything been superb."
    },
    {
      "rating": "4/5",
      "review": "Unlikely suspenseful thriller well directed but Finnes steals the show with his master acting class. Highly recommended."
    },
    {
      "rating": "4.5/5",
      "review": "Very decent thriller. It gave me True Detective vibes."
    },
    {
      "rating": "2.5/5",
      "review": "A so-so thriller; well acted but with little tension and not a great deal else to recommend it."
    },
    {
      "rating": "3.5/5",
      "review": "It was OK. Nothing special about it, however Jude Law was pretty good."
    },
    {
      "rating": "4/5",
      "review": "Interesting that the wooden house didn't burn quickly or someone walked into a burning building and didn't suffer from smoke inhalation."
    },
    {
      "rating": "5/5",
      "review": "Very good! Jude Law is a great actor and this film was no exception. The end was thought provoking."
    },
    {
      "rating": "4/5",
      "review": "Excellent movie, excellent acting by Jude Law especially. Very scary societally. Highly recommended. Movie keeps on on the edge of your seat the whole time."
    },
    {
      "rating": "3.5/5",
      "review": "It's the only decent film I've seen in 2024. I really recommend it"
    },
    {
      "rating": "3/5",
      "review": "It was okay, but not really the cat and mouse game the movie tries to make it. It was small group of dangerous men carrying out public violent crimes over a short period of time. There was no mystery to any of it. Just the police taking a long time to catch them. I didn't finish."
    },
    {
      "rating": "4/5",
      "review": "I am very glad to see Jude Law in such a role. It is good that this actor is developing and giving different images. In general, the film is formulaic, but it was shot well and the casting is excellent. It is interesting to watch once."
    },
    {
      "rating": "4.5/5",
      "review": "Good movie. Quiet tension, interesting but ordinary characters, good dose of realism. Well worth a look."
    },
    {
      "rating": "1/5",
      "review": "This could’ve have been such a great movie! Until the end when some reason January 6 2021 was used as a “reference” on when these practices are still used. For those who are confused - the was orchestrated by OUR FBI. Funny to see this come full circle. Disgusting."
    },
    {
      "rating": "3.5/5",
      "review": "Jude Law's presence made this movie pretty good to watch. It was refreshing to see a movie where he was different, whether it be not having the British accent, and having the appearance of an older, yet experienced cop. He wasn't acting as if he wanted to show off, but present the story as authentic as possible. The execution of the real life events were clear and nonetheless a passing grade. Nicholas Hoult also did a decent job in the film, bringing this real life character to life. Although violence is a topic sensitive to present in films, it nevertheless reflects the complexities the old times had to the modern days."
    },
    {
      "rating": "5/5",
      "review": "This is a first class movie and an excellent example of quality film making. It has a very timely and believable story that gets you thinking 'yes this could happen'. The acting is also first rate with the very likeable Jude Law really showing his ability, but all the actors are very, very solid. Hats off to the director of photography who brings us some absolutely stunning scenes. Lighting and mood settings are perfect. The director shoots from brilliant angles and overall the camera work is exceptional. This film must, must be in line for a host of awards. It really is a quality production. A must see movie."
    },
    {
      "rating": "2/5",
      "review": "It starts well enough (Kurzel captures a fitting bleakness for the landscape and characters) but eventually the whole thing devolves into a parade of cop movie cliches which is likely the result of the law enforcement characters being mostly invented. A real disappointment."
    },
    {
      "rating": "5/5",
      "review": "The fact that this movie left MAGA morons butt hurt is reason enough to give it five stars. Grow up, idiots."
    },
    {
      "rating": "3.5/5",
      "review": "Definitely worth the time. Solid performances throughout and well paced. Law and Hoult are great."
    },
    {
      "rating": "3.5/5",
      "review": "'The Order' is a compelling throwback thriller that captivates with its intense action sequences and strong performances."
    },
    {
      "rating": "3.5/5",
      "review": "An interesting and worthwhile look back as we are about to explore the world under a president whose last act of office previously inspired a near revolution based on the same heightened irrationality of fear and misplaced patriotism. This feels a little too real regarding the United States moving into dangerous times."
    },
    {
      "rating": "4/5",
      "review": "Great watch. Acting and story makes it a very entertaining watch."
    },
    {
      "rating": "4/5",
      "review": "This is an acting bonanza. Law, Hoult and the entire cast are exceptional. Jude has never been more stretched as the somewhat clumsy but determined FBI agent. Nicholas is outstanding; mesmerizing, sexy, hateful and charismatically evil. I did not find this film timely as a politics of the moment story and I wish people would give the ‘parallel to today white supremest storyline a rest’. People who like crime thrillers no matter where they sit will enjoy this gut wrenching film. This is a good cop bad adversary story not unlike Sicario as the FBI attempts to undo a faction of hate monger bank robbers in the 80s. A few glaring holes in the story were unfortunate ( Law can somehow without an issue to his eyes or breathing enter a smoke filled active five alarm fire. But otherwise a fine fine thriller."
    },
    {
      "rating": "4.5/5",
      "review": "This was a good action movie based on a true story, which I really enjoyed. It kept my interest through the entire movie. It was very well written and easy to follow."
    },
    {
      "rating": "5/5",
      "review": "Loved it! The cast, the story, the cinematography is great."
    },
    {
      "rating": "4/5",
      "review": "Was skeptical at first but it was a good watch"
    },
    {
      "rating": "2.5/5",
      "review": "It was a good movie but you know what? The constant background calling of \"hun\" and heavy breathing posing as a score was one of the most irritating things I've ever heard in films."
    },
    {
      "rating": "5/5",
      "review": "I liked real life stories liked this one. It was interesting to see how things unfolded in 1984 related to this Terrorist group. I learned quite of few things. It was a good movie to watch."
    },
    {
      "rating": "3/5",
      "review": "It was ok but forgettable. The final commentary lines comparing Jan 6th to the Oklahoma City bombing is laughable and ridiculous. 168 innocent people died in OK City."
    },
    {
      "rating": "1.5/5",
      "review": "The movie was dull and lacked any originality. Jude Law's performance felt half-hearted and uninspired, you could say he phoned it in. The script failed to impress, with unnecessary personal dramas that ultimately go nowhere. The finale was intended to be a dramatic standoff reminiscent of Waco, but it came off as foolish."
    },
    {
      "rating": "4/5",
      "review": "Good movie that became more Hollywoodized as it came to a conclusion, which is a shame because the subtlety is done so well and there are some great moments. Nic Hoult is incredible. Jude Law is quite good but, like the movie, his character can overrely on pure intensity when the real energy is in the quiet simmer, like that haunting scene in the car where he describes his regrets."
    },
    {
      "rating": "1/5",
      "review": "This two-hour disaster is impossible to sit through, even if you try to overlook its absurdity. Like Far Cry 5, the plot is atrocious, leaving you desperately reaching for the fast-forward button until it mercifully ends."
    },
    {
      "rating": "5/5",
      "review": "Stellar directing, cinematography, acting. Jude Law and Nicolas Hoult were superb. One of the best films of 2024."
    },
    {
      "rating": "3.5/5",
      "review": "Good pace and tension. Held my interest. Jude Law excellent."
    },
    {
      "rating": "5/5",
      "review": "Worth all the stars!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Does the movie sound like an antisemitism show?"
    },
    {
      "rating": "4/5",
      "review": "Setting aside why anyone would make or watch a film about a minor crime spree from 40 years ago, it was well made, kept the tension nicely, and was mostly well acted. Jude Law's character seems a bit whitewashed, perhaps the real guy was involved in the film."
    },
    {
      "rating": "5/5",
      "review": "Intriguing, grips your attention the entire movie, scenery was breathtaking, Jude Law was amazing"
    },
    {
      "rating": "5/5",
      "review": "Psychological thriller, very good movie. Even the ending made sense and had you thinking."
    },
    {
      "rating": "5/5",
      "review": "Solid movie with good storytelling and action to support what was a highly charged event in history."
    },
    {
      "rating": "4.5/5",
      "review": "Scary to think of how easily this brainthink can form into evil. Action packed, not a dull moment, even in the quiet scenes."
    },
    {
      "rating": "4.5/5",
      "review": "Amazing acting, script, and the ability to draw you into the tense and dark nature of the crimes.. the reviewers zoning in on \"insurrection\" and giving it one star are not basing their review on the movie but their cultist views,.. disregard and def see this film"
    },
    {
      "rating": "4.5/5",
      "review": "Disturbing scenes and subject matter, but great sounds bring the viewer in close. Dogs barking, children crying, wind in the eaves of a house, buzzing fluorescent lights, car engines, draw a clear path right up close to the action. The actors all do a great job making us believe they are really living through the action and taking it hard. Jude Law's voice is lower, gravelly, and American, adding grit to his expressions. The kids from Divergent do a great job, as does Jurnee Smollet playing the hard-edged, no-nonsense FBI part. The music is odd, sometimes disjointed, but only to add moods during the action. Not for the faint, but an important look at the mid-eighties racial and crime tensions."
    },
    {
      "rating": "1/5",
      "review": "I liked it until the movie was over and the very last sentence mentioned the “insurrection” on January 6, 2021. I totally disagree with that sentence. It was NOT an “insurrection”. I ended up becoming very angry and immediately left the theater."
    },
    {
      "rating": "3.5/5",
      "review": "Good acting. Shows Jude Law not a pretty face anymore, but a good , decent actor. And Nicholas Hoult is a rising star."
    },
    {
      "rating": "4/5",
      "review": "Highly suspenseful and well acted movie."
    },
    {
      "rating": "5/5",
      "review": "One of the best movies of the year, stellar cast, a very important lessen and story here as well. highly recommend."
    },
    {
      "rating": "4.5/5",
      "review": "Loved the movie. Didn’t appreciate the message at end that compares this event to Jan 6, 2021. That is very disrespectful to all the Patriots. No one did anything of this kind. Shouldn’t have made this movie political. Wrong message. Sad"
    },
    {
      "rating": "4.5/5",
      "review": "Fun, engaging movie with a great pace. It almost felt like watching Point Break if you replaced Bodhi with Timothy McVeigh."
    },
    {
      "rating": "4.5/5",
      "review": "Movies based on actual events can sometimes leave out a lot. I felt this movie did a great job of the actual events timeline so didn't feel I missed anything about the real life scenario. Compelling performances by the cast - Tye Sheridan and Nicholas Hoult stand out in my opinion. Good drama."
    },
    {
      "rating": "0.5/5",
      "review": "Very slow movie...ended up leaving after about 30min."
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this movie. I’m surprised it is playing in limited theatres. Acting was very good and the story based on real life events flowed seamlessly. Am going to take my kids and their papa who is from the area portrayed in the movie. I would recommend this movie."
    },
    {
      "rating": "4/5",
      "review": "Great movie about a very disturbing part of society ."
    },
    {
      "rating": "5/5",
      "review": "It has been quite awhile since a movie impressed me with such shear bleakness. The tone, the setting, the acting, the subject matter and the sound completely enveloped me into the story. This movie was so well put together and so well executed I don't see how it can't win awards in at least one of several categories. We need more of these types of movies/stories and they will be very well appreciated by some ... thank you!"
    },
    {
      "rating": "4/5",
      "review": "Interesting movie based on a true story. Shows a disturbing layer of the United States that is important to acknowledge and bring to an end."
    },
    {
      "rating": "4/5",
      "review": "Overall, a solid movie. There were some Hollywood clichs that knocked it down a little bit, but this is a worthwhile use of your time."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Love true stories."
    },
    {
      "rating": "4.5/5",
      "review": "The film seems timely and important and Jude Law gives a nuanced but powerful performance."
    },
    {
      "rating": "3.5/5",
      "review": "Jude Law gives a convincing full performance"
    },
    {
      "rating": "4/5",
      "review": "It's crazy how the film mirrors today. What happens? Jude Law does a great job of being law. Enforcement officers that you can really be on the side of the one who plays the antagonist.Did a fantastic job of being a great actor and the movie leads you at your seat.But also discussed it at the same time"
    },
    {
      "rating": "3/5",
      "review": "Steady fact based story. J Law and Tye Sheridan against Houghts intense intellectual antagonist are well balanced. Horrific how history keeps repeating itself!!"
    },
    {
      "rating": "5/5",
      "review": "Superb!! A must see. All the characters were great and well acted. It put me right back in the 80s. I loved this film very much. Can’t recommend it enough."
    },
    {
      "rating": "4/5",
      "review": "Excellent acting , very well done . Nice to see something that is not a remake or a superhero for a change.. movies have become boring and numbing and this one had depth , great story and strong acting .. Highly recommend it"
    },
    {
      "rating": "5/5",
      "review": "A throwback to how good movies are made. Definitely a must see."
    },
    {
      "rating": "5/5",
      "review": "Great movie!! Way better than most movies nowadays"
    },
    {
      "rating": "5/5",
      "review": "Jude was amazing 🤩 Loved the movie even though it is a sad party of history 40’years later it still happening"
    },
    {
      "rating": "4/5",
      "review": "This might be my favorite Jude Law performance. I appreciated the use of silence in the most expressive moments of the film."
    },
    {
      "rating": "4.5/5",
      "review": "Good watch, lots of suspense and excitement throughout with a cops' vs robbers' plotline. Lots of amazing acting all around from the various cast members. Very immersive."
    },
    {
      "rating": "4.5/5",
      "review": "Dr not disappoint. Jude Law was great."
    },
    {
      "rating": "4/5",
      "review": "Interesting true story I wasn't familiar with from the early 80's. Good acting. Enjoyed the movie!"
    },
    {
      "rating": "1/5",
      "review": "The ending of the movie ruined the whole thing. In particular the ending commentary."
    },
    {
      "rating": "2.5/5",
      "review": "Interesting with good acting but could have missed it ."
    },
    {
      "rating": "4/5",
      "review": "The movie was good. I thought that Jude Law did a wonderful job! The fact that the movie was based on a true story, is a bonus!"
    },
    {
      "rating": "5/5",
      "review": "Appreciated this film…Jude Law did a fantastic job!"
    },
    {
      "rating": "4.5/5",
      "review": "Well written story line, good actors and settings. I enjoyed the movie"
    },
    {
      "rating": "5/5",
      "review": "Great film about a real life event. Top notch."
    },
    {
      "rating": "3.5/5",
      "review": "The movie was good and I was based on a coalition forming in America that tried to gain power in America. And they had their own thoughts and belief system regarding what they feel was important and they use bank robberies to gain money and then they find their organization. You can call a call or a criminal organization, but thats pretty much the type of organization that can form at any time in the government. Movie had good action the dialogue. Good story good actors. Everything was pretty much good you know I can have any complaints even the ending was kind of dramatic so definitely worth a watch."
    },
    {
      "rating": "5/5",
      "review": "Excellent crime thriller with a terrific cast and even better performances."
    },
    {
      "rating": "1/5",
      "review": "Bad! Left in middle of movie."
    },
    {
      "rating": "5/5",
      "review": "Phenomenal Movie, I loved Jude Law’s performance."
    },
    {
      "rating": "5/5",
      "review": "I didn’t know Jude Law could play. This movie is even more important in the era we live in! A must-watch! Just try to a voice AMC Empire 25 in Times Square. Dirty chairs and very uncomfortable."
    },
    {
      "rating": "5/5",
      "review": "Powerful storytelling of historic events, somewhat frighteningly apropos to recent development across the country"
    },
    {
      "rating": "5/5",
      "review": "Excellent film. Well-written great performances gritty and realistic."
    },
    {
      "rating": "5/5",
      "review": "great acting. Interesting ride to explore the pathetic White Nationalist that still exist today in their twisted minds."
    },
    {
      "rating": "4.5/5",
      "review": "Sooooo...that was a great movie! Jude Law and Nicholas Hoult are amazing, and even though the movie paces itself, I felt like I was on the edge of my seat the entire time."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie. Very watchable, beautiful cinematography, strong performances, and a thought provoking ending."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie, love the fact its based on a true story as well."
    },
    {
      "rating": "5/5",
      "review": "Very good portrayal of real-life events in the early 1980's. The acting was very good, and the storyline moves right along. No dull moments in this movie."
    },
    {
      "rating": "1.5/5",
      "review": "Very slow movie not recommended. Just watch the trailer and be happy."
    },
    {
      "rating": "4/5",
      "review": "I hadn't heard of this happening before in 1983 to 1984.. These were sick people. And I don't believe this movement had anything to do with Jan 6 from just a few years ago.. That is a stretch for some 40 years later. Someone has an agenda. Just make movies that are interesting."
    },
    {
      "rating": "3.5/5",
      "review": "Chilling tale of the inner working of a faction of the white Aryan nation in the 1980's but poignant today with the hate groups organizing within our country. Jude Law is exceptional and Nicholas Hoult is outstanding. A serious and thought provoking movie: hopefully an Academy Award nominee."
    },
    {
      "rating": "5/5",
      "review": "Brilliant thriller about an all too real and present threat to the United States. Phenomenal direction, pacing, cinematography, a master class in storytelling and filmmaking."
    },
    {
      "rating": "3/5",
      "review": "3 out of 5 just because they make it political at the end and engaging in the same brainwashing and lies they portray in the movie."
    },
    {
      "rating": "1.5/5",
      "review": "Sorry, wanted to like it, but couldn't, cuz too much of it, including the spoken dialog, was unclear. I remember the Alan Berg murder when it happened, way back in '84 or so. Deserved a better movie. Lots of action, tho, lots of running and chasing and shooting and violence. And if they eliminated all the F'n F-BOMBS, which came at a rate of often 2 or 3 a sentence, the movie would have been a lot shorter, which would have been a great improvement. And the star, hey, Jude Law looked quite scruffy, but in very good shape. Saw it when it came out, at 'lerton AMC"
    },
    {
      "rating": "4/5",
      "review": "The acting was superb, the story line flowed at a great pace that held our interest throughout. Wasn't happy with so fowl language."
    },
    {
      "rating": "4/5",
      "review": "Very cool flick. Super scary because we know the groups exist. Well done."
    },
    {
      "rating": "2/5",
      "review": "Films based on true stories always interest me. Read some favorable reviews so we saw it today. Some pretty good chase scenes but other than that... boring."
    },
    {
      "rating": "4.5/5",
      "review": "Suspenseful and very well acted."
    },
    {
      "rating": "3/5",
      "review": "The movie was very good but a little long"
    },
    {
      "rating": "4/5",
      "review": "Time went by quickly and the story was well represented ! All actors were believable and did a great job !"
    },
    {
      "rating": "4.5/5",
      "review": "Jude Law does an amazing job in this story that happens in PNW"
    },
    {
      "rating": "4.5/5",
      "review": "This is an excellent film about what we are experiencing in trump's world of violence and hate. From these events in this film to Ruby Ridge, to Oklahoma City, and January 6th. This film is a violent depiction of the madness that comes from the hatred of self and the \"others\". Sadly the inmates are currently running the asylum."
    },
    {
      "rating": "4/5",
      "review": "Good movie. Story was told well"
    },
    {
      "rating": "4/5",
      "review": "Not groundbreaking but a fine showcase for fantastic acting and assured directing complete with some stylish visual flair"
    },
    {
      "rating": "2/5",
      "review": "Pretty boring overall and not nearly as well-written or engaging as writers think."
    },
    {
      "rating": "5/5",
      "review": "Very realistic. Intense. Jude Law should be up for an Academy award nomination."
    },
    {
      "rating": "4/5",
      "review": "This film is intriguing, intense, beautiful cinematography, superbly acted, and just a solid film to watch. Jude Law and Nicolas Hoult should be talked about for acting nominations based on this film for me. This might be Law’s best performance in some time for me. Loved it!"
    },
    {
      "rating": "4/5",
      "review": "Interesting movie. I didn’t know much about the background with the supremest group creating trouble in the northwest. The filming and story carried very well for me. I thought Jude Law did a great acting job as an FBI agent. I would watch this film again."
    },
    {
      "rating": "5/5",
      "review": "Two hours of Non-stop action. Very well written and sets were perfect for the period"
    },
    {
      "rating": "4/5",
      "review": "A crime caper where guys grit their teeth and you look at the setting of Washington State. Jude Law goes Gene Hackman in Mississippi Burning mode."
    },
    {
      "rating": "5/5",
      "review": "a very well made movie!"
    },
    {
      "rating": "5/5",
      "review": "a true story about real people."
    },
    {
      "rating": "4/5",
      "review": "Loved it! Great acting and story. We need more movies like this."
    },
    {
      "rating": "4/5",
      "review": "Lots of action. Learned about the Airian Brothers' operations. Lots of f-bombs."
    },
    {
      "rating": "4/5",
      "review": "The information was very detailed . And I had never heard about this book which was in the movie . Good acting and action"
    },
    {
      "rating": "3.5/5",
      "review": "we found the movie to be well done but not entertaining."
    },
    {
      "rating": "5/5",
      "review": "\"The Order\" is definitely one of those films that lingers in your mind long after the credits roll. Its intense and thought-provoking nature can be quite unsettling, but that's also what makes it so powerful and memorable. I found it compelling despite its disturbing elements. Got any other movies or shows youve watched recently that stood out to you? Or anything else on your mind you'd like to chat about?"
    },
    {
      "rating": "5/5",
      "review": "Justin Kurzel's tense police procedural feels like a throwback to classic Michael Mann films from the 80's and 90's with its straightforward single-mindedness buoyed by stellar performances across the board. Random Mexican Movie Reviews Full Review https://flicksfan.blogspot.com/2024/12/movie-review-order.html"
    },
    {
      "rating": "5/5",
      "review": "This is a superb film start to finish. Must see."
    },
    {
      "rating": "2/5",
      "review": "This movie in my opinion is very confusing and very insulting to the FBI. I left with a feeling that a movie based on a true event is asking us to question the facts again. It makes the bad look good and questions the good which I do not like. I am a big g fan of the historic Godfather series for syndicate crime movies. To me with real stories good and bad should be clearly defined by movies. The families are happier and better united by the criminals and the FBI has overworked fumbling want to be heros that fail their families. Was this the message? Criminals still loose maybe in two years the FBI will find them is announced at that end. Really that leaves me feeling safe, not really. Needs a rewrite in my opinion."
    },
    {
      "rating": "5/5",
      "review": "The best film of the year, Jude Law & Nicholas Hoult are a tour de force"
    },
    {
      "rating": "4/5",
      "review": "\"The Order\": The Deep Interweaving of the Supernatural and Humanity In the field of supernatural-themed film and television, \"The Order\" has attracted the attention of numerous audiences with its unique narrative style and rich thematic connotations. This series skillfully combines the mysterious world of magic with the complex struggles of humanity, presenting the audience with a thrilling fantasy picture. In terms of plot structure, \"The Order\" has constructed a vast and meticulous magic system, and the story unfolds around the ancient secret society \"The Order\". The experiences of the protagonist, Jack Morton, serve as the gateway for the audience to enter this mysterious world. He joined the society in order to uncover the truth about his father's death, but in the process, he gradually revealed a series of even more astonishing secrets. The development of the plot is full of twists and surprises. Each episode is like piecing together a jigsaw puzzle, gradually assembling the huge conspiracy hidden behind the entire magic world. This narrative method of progressing layer by layer keeps the audience highly curious and eager to follow the protagonist to explore deeply. In terms of character creation, the series performs excellently. The character of Jack Morton is particularly eye-catching. He is not a perfect hero in the traditional sense but a figure full of contradictions and struggles. He wavers between the pursuit of justice and the craving for magical power, and this inner conflict makes his image more three-dimensional and realistic. The other supporting characters also have their own characteristics. Whether it's the mysterious mentors, the club members with diverse personalities, or the villainous forces, they all have distinct personality traits and complex motives. The interactions and conflicts among them constitute an important driving force for the plot, demonstrating the diverse reactions of humanity in the face of supernatural forces. In terms of visual effects, \"The Order\" brings a visual feast to the audience. The casting of magic spells, the presentation of mysterious creatures, and the construction of various fantasy scenes are all extremely exquisite and realistic. The magical battle scenes in the series are intense and exciting, and the use of light and shadow effects is just right, enhancing the atmosphere and visual impact of the battles. For example, the spells of different magic factions each have unique visual identities. The heat of fire magic, the coldness of ice magic, and the eeriness of the mysterious mind-control magic are vividly displayed through special effects, making the audience feel as if they are in that fantasy and dangerous world of magic. However, this series is not perfect. In terms of the rhythm of the plot, the progress of some plots is slightly sluggish. Especially in the development process of some characters' emotional lines, too much foreshadowing and detours may make the audience impatient. In addition, as the plot deepens, the complex magic settings and numerous character relationships may confuse some viewers, which affects the viewing experience to some extent. Overall, \"The Order\" occupies a place in supernatural-themed film and television series with its wonderful plot, profound theme, excellent character creation, and shocking visual effects. Despite having some shortcomings, it still successfully attracts the emotional investment of the audience and triggers people's in-depth thinking about supernatural phenomena and the essence of humanity. For audiences who love fantasy and suspense themes, this series is undoubtedly a fantasy journey worthy of in-depth exploration. While it showcases the charm of magic, it also allows us to see the vulnerability and tenacity of humanity in the face of mysterious forces, as well as the difficult process of constantly making choices between darkness and light.I usually use these two sites for more free movies and short dramas.If you have a better website, please recommend it to me. Thank you https://omnishort.com/？utm_source=rottentomatoes https://nightgod.tv/？utm_source=rottentomatoes"
    },
    {
      "rating": "5/5",
      "review": "One of the film's greatest strengths is its profound exploration of morality and faith. Joseph's investigation forces him to confront his understanding of morality and his doubts about religious belief. By depicting the secret religious organization known as \"The Order,\" the film delves into the complex relationship between power and faith. The power of religion can be both intangible and oppressive, and at the heart of the film's central dilemma, faith comes into intense conflict with human moral judgment, leaving the audience with ample space for deep reflection.I usually use these two sites for more free movies and short dramas.If you have a better website, please recommend it to me. Thank you https://omnishort.com/？utm_source=rottentomatoes https://nightgod.tv/？utm_source=rottentomatoes"
    },
    {
      "rating": "4/5",
      "review": "Good drama/thriller. Kept my attention the whole 2 hours. It is not action packed but there weren't any big lulls. The action scenes are short but intense. The main characters are interesting and well acted. Very strange that this movie is not getting more attention."
    },
    {
      "rating": "5/5",
      "review": "Thrilling. Riveting. So very well acted. This is the type of film that stay with you long after you've left the theater."
    },
    {
      "rating": "5/5",
      "review": "Unbelievable. Great Cinematography. Amazing film."
    },
    {
      "rating": "5/5",
      "review": "Haven’t felt this intense in the theater for a while. Amazing cast and wonderful story."
    },
    {
      "rating": "5/5",
      "review": "Excellent period piece that has a modern resonance."
    },
    {
      "rating": "4.5/5",
      "review": "Good movie. Too bad we don’t make more movies like this."
    },
    {
      "rating": "0.5/5",
      "review": "The worst movie I've seen in theaters, and that says alot. They just don't make films anymore, the studios are so lazy they could care less about quality. Here they have a chance to tell an actual interesting story and they completely ruined that opportunity. I feel like a film school student could have made a movie about the order and it would have been slightly more interesting. This was absolutely boring the Allan Berg assassination was so unclimactic blink and you would have missed it. I can't believe I'm saying this but the brotherhood of murder that was made in 1999 was actually better. A loosely-based movie and I say that in parentheses called betrayed with Tom berenger that was a masterpiece compared to this. Do yourself a favor save your 20 and go to the bar."
    },
    {
      "rating": "4/5",
      "review": "it was a decent movie but more like a Netflix or Prime movie than a theater production. Nothing to rave about, but nothing to complain much about. Probably better choice to see at the theaters."
    },
    {
      "rating": "5/5",
      "review": "I enjoyed watching this movie , it felt like a late 70’s early 80’s real life movie ✨👍✨"
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely horrible this entire picture is unwatchable boring to the point I left in the middle of it stupid dialogue amateur delivery the worst you could ever imagine in any movie that you have ever seen. I know it's 2024 I know it will be bad I just didn't think it would be that bad rest in peace motion pictures"
    },
    {
      "rating": "5/5",
      "review": "Absolute thriller like that Texas A&M football!!!"
    },
    {
      "rating": "3/5",
      "review": "It was a good movie. Worth the watch of you're an avid movie go'er. Strong actors and performances for sure."
    },
    {
      "rating": "4/5",
      "review": "This was great movie, hand me on the edge of my seat for most of it, Beast actor and Jude Law were very good and so was smollett girl , didnt know this was real but whoa... definitely recommend it"
    },
    {
      "rating": "2/5",
      "review": "This crime movie was alright. Jude Law, Nicholas Hoult, Tye Sheridan, Jurnee Smollett, and the rest of the cast did a decent job in this movie. This true story about the Aryan Nation committing crimes for their plan to run the country was dramatic, intense, and tragic. It's about being obsessed with power and trying to create a corrupt world in that person's image. If you haven't seen this movie yet, don't waste your time. It's not worth it."
    },
    {
      "rating": "5/5",
      "review": "Thrilling, edge of your seat movie. Jude Law should get an Oscar for his performance."
    },
    {
      "rating": "4/5",
      "review": "Ive read the book, The Silent Brotherhood by Kevin Flynn, and was surprised the movie did a good job at telling this story. A must see!"
    },
    {
      "rating": "3/5",
      "review": "It was a great back of the theatre play on my phone movie. Nobody was disturbed during the process of this flick."
    },
    {
      "rating": "3/5",
      "review": "it was very interesting"
    },
    {
      "rating": "4/5",
      "review": "Based on a true story."
    },
    {
      "rating": "5/5",
      "review": "Bold filmmaking, tragically relevant issues."
    },
    {
      "rating": "5/5",
      "review": "It was a great story. This is a must see movie."
    },
    {
      "rating": "3.5/5",
      "review": "If you're looking for a good crime/thriller film then I recommend that you definitely consider this movie. This based on a true story film is nothing short of amazing. All actors display amazing performances to bring this stellar story to life."
    },
    {
      "rating": "2.5/5",
      "review": "Good acting but for me it was slow and uninteresting. Jude Law is good."
    },
    {
      "rating": "5/5",
      "review": "Great movie! Very intense with strong performances by everyone."
    },
    {
      "rating": "5/5",
      "review": "Acting was incredible, great movie!"
    },
    {
      "rating": "1.5/5",
      "review": "The acting and filmmaking techniques were impressive but the story was trying way too hard to be relevant. It felt like it was written by a committee."
    },
    {
      "rating": "5/5",
      "review": "It was one of the best exciting thrillers I have ever seen. Jude Law and Nicolas Hoult were amazing as they always are. It's nice to see that they are still making good quality movies that keep you awake and not bored. Wicked cannot compare with this top notch movie. Loved it and want to go back and see it again."
    },
    {
      "rating": "4/5",
      "review": "\"The Order\" is a skillfully crafted and delicately unsettling thriller that delivers justice to its conventional narrative. Like most slow-burn movies, this film's pacing and subdued approach will likely test the patience of those eager for another fast-paced action thrill ride. Fortunately, regarding the talents in front of and behind the scenes, \"The Order\" proves that a slow-burn thriller can be as riveting as an ordinary action spectacle, even the ones based on real-life events. With its solid cast, good direction, decent script, and stellar cinematography, the movie is another piece of fact-based cinema that properly sheds light on one of America's darker histories."
    },
    {
      "rating": "4/5",
      "review": "It was well done, but a bit darker in theme that Id expected. The description in the app left out some key parts."
    },
    {
      "rating": "5/5",
      "review": "Inspired the most violent thoughts I’ve ever had that have been directed at Nicholas Holt."
    },
    {
      "rating": "5/5",
      "review": "Outstanding in every respect. Edge of your seat intense thriller."
    },
    {
      "rating": "4.5/5",
      "review": "No fluff, no melodrama, no jokes. Just real people put in tough and dangerous situations. Doesn't hurt that the movie looks beautiful. Jude law knocked it out of the park. Would've liked Tye Sheridan's character to have a bigger role. Thought his dynamic with Law's character was great. Didn't always buy Hoult. Something about him didn't look or sound the part. In the same vein of movie such as Hell or High Water, Wind River, Blue Ruin, The Dry, Mystery Road"
    },
    {
      "rating": "5/5",
      "review": "It's a really slow burn cop thriller. It's worth every penny I paid to see it in the theater."
    },
    {
      "rating": "1/5",
      "review": "I found this movie had a purpose , telling an important story,but at the same time it’s just way too boring? Waaaay tooo boring and pointless... You will wish you had ur time AND money back, trust me.."
    },
    {
      "rating": "5/5",
      "review": "Wonderfully acted and suspenseful"
    },
    {
      "rating": "3.5/5",
      "review": "Solid story and acting but could not decide whether it wanted to be full drama or full biopic 7/10"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Loved the story and Jude Law was amazing"
    },
    {
      "rating": "5/5",
      "review": "More than held my attention through the entire movie. Riveting drama full of action. One one the best movies I’ll seen in a while. Cinematography was outstanding."
    },
    {
      "rating": "5/5",
      "review": "Wow a movie to resonate the soul of the country"
    },
    {
      "rating": "5/5",
      "review": "Great historical thriller!"
    },
    {
      "rating": "4/5",
      "review": "Jude Law’s performance was chilling. Compelling look into a disgusting piece of our country’s story."
    },
    {
      "rating": "5/5",
      "review": "Old school movie making greatness. Throw back to quality dramas."
    },
    {
      "rating": "3/5",
      "review": "Based on true events and taking place between Idaho and Washington in 1983-84, FBI agent Terry Husk (Jude Law) begins to see a pattern of a string of crimes he believes are linked and the work of a white nationalist group called The Order, lead by Bob Mathews (Nicholas Hoult). From there, Husk focuses his investigation on this group and attempts to stop their future attempts, which he believes include 6 steps from a book entitled THE TURNER DIARIES. The story alone intrigued me enough to check it out. Add in both Law & Hoult, how could you go wrong? I'll tell you. Other than an opening scene bank robbery, the film slithers along at a sluggish pace. The script, and director Justin Kurzel, do a poor job maintaining the cat-and-mouse game between Husk and Mathews. In addition, Hoult plays Mathews as a puppy dog. He, and the entire film, are watered down and he's not believable as this character but rather sticks out as a sore thumb. Which somewhat pains me to say as I am a fan of his work and he's shown he's got acting chops in the past, but just not here. May be worth a single view but go in with managed expectations."
    },
    {
      "rating": "4/5",
      "review": "Enjoyable interesting story (based on real events), good acting, action kept you engaged."
    },
    {
      "rating": "4/5",
      "review": "Interesting true story.....\"The Order\" lacked some unifying elements to make it really great. Enjoyed Nickolas Hoult being a bad guy. Characters needed to be more fully developed."
    },
    {
      "rating": "3.5/5",
      "review": "A little slow but very well acted. Action scenes were great, but if you're looking for an action movie, this isn't the one. Still worth seeing tho."
    },
    {
      "rating": "5/5",
      "review": "This is a very good movie!! I like that it's a true story!! Good acting!!"
    },
    {
      "rating": "4/5",
      "review": "Good movie. I wasn’t sure what to expect but it ended up being interesting and it was based off of a true story. It’s an important movie to watch in today’s day and age relating to domestic terrorism. Recommend."
    },
    {
      "rating": "5/5",
      "review": "Great thriller. I had no idea this was a true story. It's definitely worth going to theaters."
    },
    {
      "rating": "5/5",
      "review": "Brutal. But well played. And shows real bad guys."
    },
    {
      "rating": "4/5",
      "review": "Wow. I didn't know what this was about prior to seeing it. Based on actual events, I learned a lot about the history of the fringe political thinking and where we are now, the Actual play books the upcoming administration is using. It was intense and I flinched & covered my eyes more than a few times. I think you'll like it. You'll learn something. And you'll probably leave saying what I did, just Wow. Check it out."
    },
    {
      "rating": "5/5",
      "review": "This movie was so good I didn't want it too end. One of the best movies I have seen in the last 10 years."
    },
    {
      "rating": "5/5",
      "review": "Movie shows what happened but was not taught widely."
    },
    {
      "rating": "5/5",
      "review": "The Order is a very powerful and eye-opening movie. I can't stop thinking about it. It is a gripping thriller from beginning to end. The performances are all outstanding as is the attention to detail. Although based on a true story, I had never heard of this group or the events and was thoroughly fascinated."
    },
    {
      "rating": "0.5/5",
      "review": "On its own a very average time you won’t get back. Further ruined in the end with a shameless Orwellian attempt to tie together a group of white power terrorists/bank robbers from the 80’s with, of all people, those at the capital supporting free and fair elections on January 6 who we all know now were set up by Federal officers in plain clothes who instigated a riot and the Capital police who waved them inside to be attacked, beaten and killed."
    },
    {
      "rating": "5/5",
      "review": "Incredible movie. The actors were so good! I cant believe this was a true story. Perfect blend of true crime and thriller."
    },
    {
      "rating": "4.5/5",
      "review": "Loved the movie -- had not heard about this in the 80's but a very telling evergreen story that unfortunately is still relevant today. A great thriller and great acting. Wish there was less foul language but overall excellent."
    },
    {
      "rating": "5/5",
      "review": "Great performances by Jude and Hoult. Such a thrilling ride. I cant believe this was based on true events."
    },
    {
      "rating": "1/5",
      "review": "This movie is a waist of time, stupid and outdated"
    },
    {
      "rating": "5/5",
      "review": "It was a gripping crime thriller that left you on the edge of your seat. It was also very very disturbing."
    },
    {
      "rating": "4.5/5",
      "review": "Very well done movie. Great actors and a true story that was captivating and eye opening."
    }
  ]
}