{
  "movie_name": "Heart Eyes",
  "reviews": [
    {
      "rating": "3.5/5",
      "review": "If you liked Scream, you'll like this one. It was refreshing to see Jordana Brewster play someone other than Mia Toretto for once"
    },
    {
      "rating": "3/5",
      "review": "Overall fun horror movie. Movie does get lost a bit with longer monologues and confused genres. I am not sure what kind of horror movie it is trying to be. Is it a slasher? Comedic? Meta/referential? Tries to be a lot without being entirely successful in some. If it tried to stick to a couple sub genres and focused on those; I think the movie would be more successful. Does pull out a pretty good half twist. Overall just a nice laid back horror movie to enjoy at home."
    },
    {
      "rating": "1/5",
      "review": "The cineoplis theatre is terrible"
    },
    {
      "rating": "4.5/5",
      "review": "Can't even hate. They did try to act like \"Saw\" in the beginning, but that is okay."
    },
    {
      "rating": "3.5/5",
      "review": "Not a huge fan of the serial killer horror film but this was surprisingly enjoyable. Part horror, part rom-com, and part mystery, this film has something for almost everyone."
    },
    {
      "rating": "1/5",
      "review": "The humor wasn't there, but not for lack of effort."
    },
    {
      "rating": "3/5",
      "review": "This horror movie was pretty good. Olivia Holt, Mason Gooding, Jordana Brewster, Yoson An, Gigi Zumbado, Devon Sawa, and the rest of the cast did a good job in this movie. The plot of the movie was bizarre and insane. It's about a psycho killing couples on Valentine's Day. If you haven't seen this movie yet, you might like it if you into these kinds of movies, but if not then don't watch it."
    },
    {
      "rating": "5/5",
      "review": "THIS WAS AMAZING it traps horror and comedy into one movie. The actors were awesome. 100% recommended"
    },
    {
      "rating": "4/5",
      "review": "Not bad for a thriller/comedy ✌🏾"
    },
    {
      "rating": "0.5/5",
      "review": "Super super corny, mid acting, trying too hard to be funny it's just cringe. Unoriginal and boring."
    },
    {
      "rating": "1/5",
      "review": "The film made it painfully obvious when it wanted the audience to laugh, relying heavily on tired, overused gimmicks. It aimed for camp but missed the mark completely, resulting in forced humor that just didn’t land. As for the horror aspect there was none!"
    },
    {
      "rating": "0.5/5",
      "review": "Can't recommend it, so I'm told. Trust me, that's the version you want."
    },
    {
      "rating": "4/5",
      "review": "A sweet rom-com with a splash of gore. 80s horror vibes."
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely atrocious. Not sure how it was gotten good reviews. No plot, not scary, no character development a complete waste of time for a movie I was excited and hopefully for. If I could rate it lower I would."
    },
    {
      "rating": "4/5",
      "review": "Heart Eyes is a love letter to both the rom-com and slasher genres. It has a handful of creative kills and loads of dark comedy. Both leads are likable and you can’t help but root for them to fall in love, while dodging the Heart Eyes Killer. Even though Heart Eyes doesn’t reinvent the slasher formula, it does have lots of fun turning the rom-com formula on its head. Whether it’s Valentine’s Day or just another Friday night, Heart Eyes is the perfect date flick. You might even watch it twice!"
    },
    {
      "rating": "5/5",
      "review": "Banger I hardly know her"
    },
    {
      "rating": "1/5",
      "review": "So in the beginning the killer was kinda cool, he seemed like he had a cool arsenal and everything, it's super corny, and the jokes don't really hit at all. The plot twist in the end wasn't expected but it kinda ruins the movie for me, it was a super stupid, and pointless ending. It's a super freaky weird movie and I honestly wouldn't recommend it. Horrible slasher"
    },
    {
      "rating": "5/5",
      "review": "SUPER FUN WATCH!!! slasher/romcom is not something id usually like but it is so funny, and scary and gory and cute and i loved every bit of it. the kills were amazing for all you gore fans."
    },
    {
      "rating": "1.5/5",
      "review": "I didn't expect much going in, and I was still disappointed."
    },
    {
      "rating": "4/5",
      "review": "I'm not a romance guy at all and this movie still did it for me. I was a sad loser and watched it by myself on valentine's day and I have 0 regrets. I enjoyed the violence and gore. Though I was able to pretty much figure out the ending, some aspects caught me off guard. Overall I'd recommend this movie."
    },
    {
      "rating": "5/5",
      "review": "If you like the Scream franchise, you'll probably like this. If you liked the Happy Death Day movies, you'll definitely like this. If you liked The Batman, you'll probably think the villain is the riddler, but that's okay. It works."
    },
    {
      "rating": "1/5",
      "review": "It's probably quite captivating if one-dimensional characters firing off clichéd quips happens to be your thing."
    },
    {
      "rating": "0.5/5",
      "review": "The WORST move I’ve EVER seen ts pmo gurt icl ts pmo sybau💔💔🫩"
    },
    {
      "rating": "2/5",
      "review": "Basically the cousin to Thanksgiving...the intentionally over-the-top sloppy valentines day slasher does not work great. Olivia Holt's perfectly believable and charming, but the lack of mystery and mystique of the killer is noticeable. With zero background and motivation, it's a lot like a statue's chasing 2 people, and that's about it. Also, the big reveal? Falls flat."
    },
    {
      "rating": "4/5",
      "review": "The movie is good, it's interesting to watch and has good deaths, but the plot twist is predictable. The romance in the movie is amazing and the development too."
    },
    {
      "rating": "1.5/5",
      "review": "OMG it was so mid. It's okay I guess if you're looking for a movie just to watch, not to actually care about or get invested in. It was so predictable, it's not even funny. The gore was bad, and the storyline and characters were really mid :/ I expected better from a modern movie to be honest, and it's not bad enough to the point where it's laughable either. cough cough mY BLOODY VALENTINE WANNABE jk"
    },
    {
      "rating": "1/5",
      "review": "It was bad. Like, BAD. I dont know if I can give 0 stars but I went with 1 because I'm new here and just had to write the 'review '."
    },
    {
      "rating": "3.5/5",
      "review": "I liked it. Perfectly campy. Catches your attention immediately."
    },
    {
      "rating": "3/5",
      "review": "Not horrible but no real thrills or scares. A little to fun and not creepy enoigh. Also as soon as I saw the killer I thought bingo!"
    },
    {
      "rating": "2/5",
      "review": "4.5/5 and 83% - are you kidding!! While some nice kills - wine press anyone? - the 2 main characters made me want them killed off ASAP - annoying, cloying and absurd. Made the movie almost impossible to watch."
    },
    {
      "rating": "4/5",
      "review": "As a horror lover, the trailer didn’t inspire much faith in me. I was pleasantly surprised by this film. A parody of early 2000’s romance with a slasher twist, this film is campy, fun, and well executed. The two leads have great chemistry, the story keeps you intrigued the entire time, and the slasher action is up to par. It has the bones of a cult classic, and in the end, I’m glad I gave it a chance."
    },
    {
      "rating": "2/5",
      "review": "Try to be slasher and romcom at the same time. Good effort but not executing well enough. 1 time watch and not that entertaining"
    },
    {
      "rating": "1/5",
      "review": "Horrible Horrible writing and directing... acting was like something out of a high-school play."
    },
    {
      "rating": "1.5/5",
      "review": "I love slashers. I hated this. It sucked. That’s all."
    },
    {
      "rating": "1/5",
      "review": "Anyone who rated this movie more than a 1 out of 10 should be shot. I’d give up electricity for a year if it meant I could forget that I ever watched this. Literally everything is terrible in this."
    },
    {
      "rating": "3.5/5",
      "review": "Was a pretty enjoyable watch"
    },
    {
      "rating": "1/5",
      "review": "The story was unoriginal and beyond corny. It was all around just bad. I would never recommend or rewatch."
    },
    {
      "rating": "3.5/5",
      "review": "Rating: 7/10. 70/100"
    },
    {
      "rating": "4.5/5",
      "review": "Hilarious dark comedy kills and creative new plot"
    },
    {
      "rating": "5/5",
      "review": "Awesome movie i liked the chemistry between olvia holt and Mason Gooding there were both great in the movie. The kills were kill the twist was cool I loved the movie. And aka olvia holt is hot."
    },
    {
      "rating": "3.5/5",
      "review": "Funny horror movie with tongue in cheek poke at relationships"
    },
    {
      "rating": "2.5/5",
      "review": "The main 2 characters were anoying and slow. The killing was decent. If you go into the movie not expecting good acting or a good story then you will like it. I personally think it should of been more killing instead of the weired romance. But it was for sure fun."
    },
    {
      "rating": "4/5",
      "review": "It's a winning mix of horror, romance, and comedy. There was no slow build up. The good stuff starts in the first 10 minutes."
    },
    {
      "rating": "3.5/5",
      "review": "A nice surprise! Cupids arrows are a little sharper in Heart Eyes than they have been in recent romantic slashers."
    },
    {
      "rating": "3.5/5",
      "review": "Fun and campy, Heart eyes is a fun watch for slasher fans"
    },
    {
      "rating": "4.5/5",
      "review": "This was funny and terrifyingly good at the same time. The kills were fantastic and the big reveal at the end a little predictable but still a great addition to the valentines day collection. Tim Treakle"
    },
    {
      "rating": "3/5",
      "review": "It's... fine?... far from terrible. Very, very difficult to make a slasher that doesn't seem exactly like any other slasher, and making this one cutsie and comedic doesn't get there here."
    },
    {
      "rating": "0.5/5",
      "review": "Its terrible to watch"
    },
    {
      "rating": "5/5",
      "review": "Great Valentines slasher! Such a ride with snacks!"
    },
    {
      "rating": "2/5",
      "review": "Not as bad as morbius. Corny and predictable"
    },
    {
      "rating": "3/5",
      "review": "Okish and one time watch"
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this movie. It was a nice take on a horror-comedy storyline. The acting was good and the plot twist was unexpected. Definitely recommend for a classic Valentine slasher film!"
    },
    {
      "rating": "1/5",
      "review": "Absolutely hated this movie. It wasn't scary like the Scream movies. Big disappointment. The comedy was too over the top as well as some of the scenes. How does someone just show up in your closet? And the police scene was so mundane n predictable. I was so hoping the movie would turn around but it never did. Im a BIG horror fan - I guess I didn't get the movie. Not sure how it got such high ratings."
    },
    {
      "rating": "4/5",
      "review": "Enjoyable throwback to slashers of old."
    },
    {
      "rating": "3/5",
      "review": "Heart Eyes is bloody and sometimes funny, Olivia Holt and Mason Gooding are a really nice pair and the cast overall is quite nice, but the movie feels unbalanced, the story is not really flowing, off course its a tale told for the 1000th time but it could still have something on his own...which it doesn't have. Especially the revealing of the killer(s) is quite underwhelming, a build up to a really surprising reveal would have made the whole thing more interesting, but You know it a while before the finale and it does not make much sense. Josh Rubin made Werevolves Within, which I like very much, I would recommend, to watch this one instead. Still Heart Eyes is entertaining enough for a nice movie night."
    },
    {
      "rating": "3.5/5",
      "review": "Thoroughly enjoyed this slasher with a dash of love"
    },
    {
      "rating": "4/5",
      "review": "Movie was over all great except for a few corny scenes I thought killed the horror aspect of this genre."
    },
    {
      "rating": "3/5",
      "review": "Heart eyes is a rom-com with a predictable plot, awesome kill scenes, but if it ditched the comedy and went dark, it would've been a solid slasher flick. Sadly, it failed to deliver a strong storyline and the cheesy jokes were a major turnoff. The kills were a cool mix of Saw, Voorhees, and Terrifier, but the comedy fell flat, like a bad Freaky Friday and Happy Death Day mashup."
    },
    {
      "rating": "5/5",
      "review": "Nice refreshing slasher movie"
    },
    {
      "rating": "5/5",
      "review": "Love mason gooding and Oliva holt performance"
    },
    {
      "rating": "1/5",
      "review": "Heart Eyes attempts to merge romantic comedy with slasher horror, but the result is a muddled mess that fails to deliver on either genre. The film stumbles through its narrative, relying on tired tropes, weak character development, and a jarring tonal imbalance. Its self-aware humor falls flat, its romance lacks spark, and its horror elements fail to terrify."
    },
    {
      "rating": "1.5/5",
      "review": "A romantic comedy with a couple of decent kill scenes. Not for me"
    },
    {
      "rating": "5/5",
      "review": "Heart Eyes is one of the best movies this year, for lots of reasons. With Josh Ruben at the helm as director of this new slasher masterpiece everything falls perfectly into place and for me this one does not disappoint. Everyone will definitely get their time and money’s worth. Anyone who says otherwise must not be a true horror fan. I love the special effects, the acting, the directing, the script and the storyline. The cinematography is shot very neatly and when we see through the POV through Heart Eyes at times it reminds me of a homage of Michael Myers from Halloween, which to me is an amazing shout out from the horror classics that came before it. This is one horror film that is not to be missed."
    },
    {
      "rating": "4.5/5",
      "review": "Definatly a great movie to watch on valentines day"
    },
    {
      "rating": "3/5",
      "review": "Ingenious intersection of rom-com and slasher."
    },
    {
      "rating": "3.5/5",
      "review": "Heart Eyes is the first of its kind as a rom-com slasher, and thanks to its well-executed horror elements and innovative kills, its genre conventions are easy to overlook. Playing on familiar tropes, the movie is predictable. Nevertheless, it's a modern holiday slasher that's mighty fun."
    },
    {
      "rating": "0.5/5",
      "review": "I like bad horror movies, but this one is beyond dumb. Bad story, cringe dialogue, terrible ending that's barely worth sticking around for. Don't waste your time."
    },
    {
      "rating": "3.5/5",
      "review": "A young not-a-couple-yet couple (Olivia Holt, Mason Gooding) get targeted by a serial killer that attacks every Valentine's Day. Clever and gory but familiar mashup film. I, personally, found the humor aspect underwhelming. The film is a mixed bag but overall an enjoyable romp."
    },
    {
      "rating": "5/5",
      "review": "Great valentines horror movie! Not so tense the whole time which is a big perk in my part so you can at least breathe a few times throughout the movie. The rom-com affect wasn’t too much but just enough to make it a great addition to the movie"
    },
    {
      "rating": "5/5",
      "review": "I Love it it’s a Good movie I will watch it again"
    },
    {
      "rating": "1/5",
      "review": "It tried to be the Terrifier"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed 'Heart Eyes'! 😍 I think Olivia Holt and Mason Gooding did really well together as costars and I genuinely laughed at some of their argument scenes. 😂 And I of course recognized Mason Gooding as Chad from Scream, so I had to check this out. My experience was even better because I saw this movie in theaters on actual Valentine's Day, 2025. This movie is very fitting for Valentine's Day theme! 🌹💗"
    },
    {
      "rating": "5/5",
      "review": "I watched last night it was so good it kind of like the movie thanksgiving which i also enjoyed Please watch it i just got it on dvd i loved it again"
    },
    {
      "rating": "5/5",
      "review": "Perfectly balanced mash-up of a campy seasonal Hallmark movie romance and a gory slasher flick. It also had some of the realest character reactions to being faced with a slasher that I think I've seen. Absolutely hilarious and well executed."
    },
    {
      "rating": "5/5",
      "review": "Gory, funny and romantic, what else do you need in these troubled times? Probably, you'll believe in a thing called love again after have watched this flick"
    },
    {
      "rating": "5/5",
      "review": "Great movie!!! It was definitely a thriller and plot twist👍"
    },
    {
      "rating": "3.5/5",
      "review": "Started off questionable but it got better. By the end I was rooting for the main characters and clapped when it was over"
    },
    {
      "rating": "4/5",
      "review": "No está nada mal la verdad, mejor de lo que se esperaba."
    },
    {
      "rating": "3/5",
      "review": "trailer is a trick of horror, but the story is a love story."
    },
    {
      "rating": "0.5/5",
      "review": "Bad as hell, boring, expected events, not worthing all the excitement :)!"
    },
    {
      "rating": "5/5",
      "review": "Honestly loved it Funny ngl a little cringy but cool plot twist. Watch it"
    },
    {
      "rating": "5/5",
      "review": "Was not scary whatsoever but it was a funny romantic slasher movie. I do highly recommend this movie because it was amazing but do not get ur hopes up in the horror genre."
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved everything about this movie!! Nothing like a slasher horror movie to celebrate valentines day!!"
    },
    {
      "rating": "4.5/5",
      "review": "Where do i start, the movie does start out a little cheese but it goes all in on the valentines day carnage! The design of the killer is fenominal, and the two main leads are a treat for the heart. If you're looking for a decently scary, but gory valentines day film with a killer twist, definitely check this one out!"
    },
    {
      "rating": "3.5/5",
      "review": "Heart Eyes dares to ask the question no one ever thought to ask: What if Scream was a romantic comedy? This clever and unexpected blend of slasher thrills and rom-com charm delivers a unique twist on both genres, resulting in a surprisingly fun and quirky watch. At its core, Heart Eyes plays with the conventions of both genres, combining the suspense and tension of a traditional slasher with the warmth and lightheartedness of a rom-com. The film thrives on its playful, self-aware tone, offering up moments of genuine horror alongside equally genuine (and sometimes surprisingly sweet) romantic gestures. There's something incredibly refreshing about watching a killer chase scene quickly followed by a heartfelt, awkward first date. While the film clearly doesn't take itself too seriously, the seamless integration of humor and horror is a testament to its clever writing and direction. It doesn't forget the thrills that fans of the slasher genre crave, but it also invites viewers to laugh, swoon, and even cringe at the same time. Ultimately, Heart Eyes is a surprisingly enjoyable watch. It's a movie that both slasher fans and rom-com lovers can enjoy, and one that keeps you guessing with every twist, turn, and unexpected punchline. By the time the credits roll, you'll find yourself wondering if this offbeat combination might just be the future of both genres."
    },
    {
      "rating": "3/5",
      "review": "It’s a slasher film with decent action, alright gore and a story that couldn’t light a match, very “mid” ."
    },
    {
      "rating": "1.5/5",
      "review": "another stupid thing. Didn't surprise me or make me happy."
    },
    {
      "rating": "5/5",
      "review": "Best Horror Rom-Com movie so far! I enjoyed watching! If y'all grew up watching Disney’s Kickin it, y’all should watch movie this because Olivia Holt nailed her role in this movie very well!"
    },
    {
      "rating": "4/5",
      "review": "Fun New-Adged Slasher."
    },
    {
      "rating": "5/5",
      "review": "Chef's kiss! Everything that I missed since the Scary Movie franchise in a comedy movie is brought to the audience at the movie theaters and at home. You feel a part of the history developing between these two characters. The chemistry is there. The talent is there. Everything in it's right place. Congratulations for the crew involved in this project and I am looking forward for the sequel. It's gonna be f***** great!"
    },
    {
      "rating": "2.5/5",
      "review": "If anything the rom-com moments are good if you are a fan of those, and the kills are worth it. Other than that anyone who has seen a slasher before or the SCREAM movies, then you can already predict who the killer or killers are halfway through the movie."
    },
    {
      "rating": "5/5",
      "review": "Its worth the watch if u like comdey and slasher this is for you"
    },
    {
      "rating": "4/5",
      "review": "Who knew a film can so gracefully blend a gory slasher with a genuinely sweet romance. Heart Eyes takes familiar tropes and themes from polar opposite genres and bashes them together to create a dark tone with a genuine heart and spirit. Unlike some lesser slashers, these characters and their relationship are given time to become something the audience cares about and wants to see overcome the evil they are faced with. The slasher villain itself, while not as memorable as its main victims, has some great creative kills and a genuinely scary design that all relate to the holiday the film is set around. Only flaws would be this is another of those modern comedies that's just not funny. But that does not distract from the pacing and excitement the rest of the film brings. Great to see something stand against My Bloody Valentine for your Valentines Day choice."
    },
    {
      "rating": "1/5",
      "review": "This movie is a mess I can’t believe I almost paid $19.99 to rent it at home thank god I decided to stream it for free instead lol. The first hour is a painful attempt at a rom com but even that is tedious and boring. The breaking news segments are so low budget it makes the film feel cheap. The fighting scenes are okay but few and far between. There’s wayyyy too much time spent on character development for the two main characters but it’s a waste of time because you don’t learn anything about them and those scenes run for like 15 minutes when they could be 5 minutes."
    },
    {
      "rating": "4/5",
      "review": "I'll admit that I didn't have high expectations for this film but my expectations exceeded what I thought possible for heart eyes. It was smart, funny, scary, exciting and the two leads has great chemistry together. It was a fun slasher experience."
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing! It kept me on the edge of my seat the whole time! I did not expect the twist in the end! This may become the next scream, can’t wait to see if there will be another one!!!"
    },
    {
      "rating": "1/5",
      "review": "Skip if you're a horror fan. Into slashers? Then you might enjoy Heart Eyes. Emphasis \"might\". Slaughtering couples is a hallmark of slasher films, I'm surprised there haven't been more pairings of the genre with Valentine's day. This is what you get here. It's as if someone came up with the idea, and then a movie was slapped together with scotch tape. There's nothing new here, not even decent kills. Ok, maybe one decent kill at the end. The movie is intentionally cheesy, but there's just too much of it. Kinda like when you order loaded nachos because you're a fan of cheese, and then you get a plate of chips swimming in cheese. I wanted to stop watching 20 minutes into the movie, but the movie recieved praise from some of my favorite movie critics. So I forced myself to continue watching.... I no longer follow said critics. Horror fans, run! Run and do not look back! And for the love of the invisble man in the clouds, try not to trip and fall..."
    },
    {
      "rating": "2.5/5",
      "review": "For a film that is about murdering lovers on Valentine's Day, there is still somehow way too many cliched and hamfisted romantic scenes in here."
    },
    {
      "rating": "3.5/5",
      "review": "Is good but not scary I want more blood exemplar scream 6 is so good I loved scream jump scares is so good . I wnat heart eyes 2 more kill and blood Thanks"
    },
    {
      "rating": "2/5",
      "review": "Heart Eyes has the makings of a really cool modern slasher character. The killer's design is pretty cool, and the concept of killing couples on Valentine's Day is a novel idea. The movie even starts off well with some creative kills. However, the movie goes downhill from there. It turns into an incredibly corny romcom—the dialogue is sappy, and the characters feel cartoonish. The movie then whiplashes between romance and horror, as if suddenly remembering there's a killer on the loose. At one point, in the middle of a chase, the characters start opening up to each other—which was definitely not the time. Meanwhile, the killer becomes increasingly incompetent, failing to take out the main characters. The comedy doesn't land, the romance is bland, but the kills are at least enjoyable. Just don't go into this expecting a full-on slasher horror movie."
    },
    {
      "rating": "0.5/5",
      "review": "Just another horror film in an over saturated horror film market"
    },
    {
      "rating": "5/5",
      "review": "One of the best holiday themed horror movies ever. Top tier film not a single complaint about it. There’s something for rom com fans and for gore fans. it’s the best of both worlds"
    },
    {
      "rating": "4.5/5",
      "review": "Honestly, I loved it! It was the perfect balance of romcom and slasher♥️🔪"
    },
    {
      "rating": "4.5/5",
      "review": "MY Name is CulinaryJoey. I went to see this Movie in AMC in West Chester Ohio with brother. This is my first review his Heart Eyes movie to make sure their recipes of this film went well. Mason and Olivia Holt did fantastic job and I glad Mason Gooding doing owned Lead outside of Jenna and Melissa Shadow. I been excited this and I jump up my seats all when Heart Eyes begin killing couples and chasing against Mason and Olivia characters since I was kid and Terrifer 3 one . It's Comedy horror type of stuffs Heart Eyes reveal it's twisted two-three people doing as Heart Eyes Killer 😍 for me It's would be one person and main lady would been master mind. It's very very good movie that make me Happy. I hope they make Sequel and I hope the director cast TNA Joe Hendry as Heroic Heart Eyes take on Clover Eyes potential played by Barry Keoghan similar to Terminator 2."
    },
    {
      "rating": "2.5/5",
      "review": "It's not a bad movie but it could be better. We didn't see much of the killer and he/she was horrible at it. Always missing and dumb af. We need a good slasher where the killer is actually good at what he does and is not boring."
    },
    {
      "rating": "3.5/5",
      "review": "It can be as goofy as it is gory. However what works for Heart Eyes is how it also has Romantic Comedy cliches. It is clever how it is a Romantic Comedy with a killer. That might be a first. Even the puke scene made me laugh more than it turned me off. Since I usually hate puke scenes in movies. Though I did wonder how the leads can keep flirting with their lives in danger."
    },
    {
      "rating": "5/5",
      "review": "Interesting, unusual plot, dynamic development of events, unpredictable ending."
    },
    {
      "rating": "5/5",
      "review": "i loved the movie so much! it had such a twist at the end I didn't see it coming"
    },
    {
      "rating": "4/5",
      "review": "More Comedy than horror,but definitely still the funniest film I've seen so far this Year."
    },
    {
      "rating": "5/5",
      "review": "the movie was good i loved it so much its about nerdy,smart and slasher movie."
    },
    {
      "rating": "3.5/5",
      "review": "The horror genre continues to enjoy its good times, and Heart Eyes joins the list of fun and fulfilling titles worth enjoying and having a good time. It's a slasher with references and original ideas that make for a good time in front of the screen. It features two fun and charismatic protagonists and a charming villain who I'm sure I'll want to keep watching, causing new bloody deaths for lovers."
    },
    {
      "rating": "2.5/5",
      "review": "Had some good elements but execution was uneven and ending was ridiculous."
    },
    {
      "rating": "3/5",
      "review": "It starts off okay, you think its going to be a typical slasher film with some slight satire to it, but they try way too hard with the satire and the plot it pulls you out of it a bit. The ending itself was horrible to the point I don't want to even mention anything about it. The concept of the killer itself and some of the gore is cool enough to make it an \"okay\" film, I just wish they put more effort into actually writing a story and a plot instead of a generic romance theme that made zero sense."
    },
    {
      "rating": "1.5/5",
      "review": "Great premise and a brilliant opening kill but ultimately falls flat due to shoddy writing and a kill count of pointless extras who you don’t care about. Reminded me a lot of that Rebel Wilson film where she bangs her head and wakes up in a romantic comedy - but that weirdly was better than this. I’m a big horror fan and for me, apart from the amazing chemistry between the two leads was flat, frustrating and lacking in any originality. I’m sure the pitch was great to the studio it just never stuck its landing."
    },
    {
      "rating": "3/5",
      "review": "A \"not-so-terrifying\" horror movie disguised as a rom-com."
    },
    {
      "rating": "5/5",
      "review": "Finalmente voltaram com a farofada dos anos 2000!!! Simplesmente perfeito."
    },
    {
      "rating": "0.5/5",
      "review": "It was a retarted ass movie. It’s just another scream with some comedic scenes"
    },
    {
      "rating": "4/5",
      "review": "Good movie laughed and enjoyed it"
    },
    {
      "rating": "3/5",
      "review": "I wasn’t sure what to expect when I started Heart Eyes, but I have to say—this one really took me by surprise. It’s not every day you find a horror film that mixes romance, dystopia, and creature horror into one cohesive experience, but somehow, this movie pulls it off. It’s eerie, emotional, and, dare I say, even kind of beautiful in its own twisted way. The film takes place in a world overrun by terrifying, otherworldly creatures that hunt humans based on their emotions. Most people live in fear, suppressing their feelings to avoid detection. But then there’s Luna, a mysterious young woman who seems completely immune to the creatures. She’s fearless, expressive, and—against all logic—happy. When she crosses paths with Rico, a survivor who has spent years burying his emotions just to stay alive, his world turns upside down. What really worked for me was how well the movie balanced its horror and emotional core. Sure, the monsters are horrifying—designed with unsettling, almost alien-like features that make every encounter nerve-wracking. But at the same time, the heart of the movie is Rico and Luna’s dynamic. Their chemistry feels natural, and watching Rico slowly break out of his self-imposed emotional prison was genuinely touching. There’s something haunting about the idea of a world where love and joy could literally get you killed, but Heart Eyes leans into that in a way that feels fresh. Visually, the film is stunning. The cinematography captures the bleakness of the post-apocalyptic world, but Luna’s presence brings an almost dreamlike contrast to it. The color palette shifts subtly as the story unfolds, mirroring Rico’s transformation. It’s one of those small details that makes the film feel more intentional and well-crafted than your average survival horror. Now, it’s not perfect. The pacing in the second act drags a little, and there are a couple of plot points that feel underdeveloped. I also wish we got a little more backstory on the creatures and how Luna’s immunity works. But at the same time, leaving some things unexplained adds to the mystery, so I didn’t mind too much. By the time the credits rolled, I realized Heart Eyes had left more of an emotional impact on me than I expected. It’s rare to find a horror film that genuinely makes you feel something beyond fear, but this one does. If you’re looking for a different kind of dystopian thriller—one that blends horror, love, and a little bit of hope—this is definitely worth a watch."
    },
    {
      "rating": "3/5",
      "review": "was ok, funny in parts Would not rave about it to friends"
    },
    {
      "rating": "4/5",
      "review": "You know what I didn’t expect anything amazing from this one but I rather enjoyed it! Gory kills with a lot of humour in there too. It worked well. The only thing I didn’t really like was the killers at the end being all weird… and i found somewhat predictable who the killer was.. one of them anyway I knew from the beginning."
    },
    {
      "rating": "1/5",
      "review": "Painfully cheesy slasher movie. The movie pinballed back and forth between trying to be funny and trying to be scary, and just couldn't pick a lane. Dialogue was terrible and not as funny as the writers think it was."
    },
    {
      "rating": "4.5/5",
      "review": "One of the best horror movies this year! A perfect mix of a room com and being a horror movie at the same time, I had a lot of fun with this"
    },
    {
      "rating": "2/5",
      "review": "Kinda fun. But nothing I would watch again."
    },
    {
      "rating": "2.5/5",
      "review": "Middle of the road holiday slasher. Worth it if you like 80’s horror and slasher movies."
    },
    {
      "rating": "4/5",
      "review": "Hahahaha hobs and Shaw like the movie i laughed a lot very funny an horror comedy"
    },
    {
      "rating": "4/5",
      "review": "I loved this movie. Idk how Sony does it but they know how to make a great holiday themed slasher horror they made thanksgiving that was brilliant movie and now a valentines day horror film absolute cinema. The kills were gory the only thing that holds this movie bk from being great is I really wanted more heart eyes and I wasn't a fan of the killer reveal."
    },
    {
      "rating": "5/5",
      "review": "Literally no complaints at all for one originality of entering a new sub category to the genre of slashes or romcom/it was not on my bingo card, but I enjoyed it the romance of them trying to find love with each other was there the killing was Pitch Perfect each execution was beautiful and the twist and a reveal was everything I needed to be because I was hoping it was gonna be a little bit more cheesy, but it wasn’t but all the cheesy moments in the movie knew it was cheesy and I appreciate it"
    },
    {
      "rating": "5/5",
      "review": "I had FUN, just FUN, when was the last time you just sat back and enjoyed a movie? I felt like I was watching SCREAM with a dash of every ROM COM you can think of, the result? FUN."
    },
    {
      "rating": "5/5",
      "review": "Loved the movie! So much action going on with all the killing. Also the personalities on these characters are great, it added character."
    },
    {
      "rating": "3.5/5",
      "review": "Well balanced combination of slasher gore and rom com. It was a thrill ride with a little something for everyone and even had a poetic theme of love in the mist of all the insanity. Definitely worth a watch."
    },
    {
      "rating": "4/5",
      "review": "This was fun good and funny this give me that scream and happy death day vibe the story was on point the plot twist I wasn’t even expecting to see but the bloody & horror was on point there was 1 jump scared that it but I give it a rating 8.7/10"
    },
    {
      "rating": "3.5/5",
      "review": "Good horrific definitely worth the watch"
    },
    {
      "rating": "0.5/5",
      "review": "This movie gets worse as you watch it. I fell asleep the first time. So I tried again and it was just as bad. Don't waste your time unless you just want to hate watch. Everything is explained at the end for plot movement. Very poor writing."
    },
    {
      "rating": "4.5/5",
      "review": "Through the passionate performances of Olivia Holt and Mason Gooding, Heart Eyes injects a dose of 2000s-style romantic humor as a classic, bloody slasher horror emerges and transforms the whole mess into a well-made, humorous and, above all, directed horror comedy. A great job by Josh Ruben."
    },
    {
      "rating": "3/5",
      "review": "Decent cheesy thriller, I liked it."
    },
    {
      "rating": "3.5/5",
      "review": "Expected to hate this, but pleasently surprised. Likeable leads & a mixture of blood, romance & comedy, so what's not to like? A horror that doesn't take itself to seriously."
    },
    {
      "rating": "3.5/5",
      "review": "It was surprisingly fresh. I enjoyed the romantic comedy aspect as well as the slasher bits. I even liked the twist. It was a fun watch but I doubt I'll watch it again."
    },
    {
      "rating": "0.5/5",
      "review": "Horrible, overwhelming levels of cringe. It is like they were going for a Scream atmosphere and missed every requirement. I turned it off partway through."
    },
    {
      "rating": "5/5",
      "review": "Love this. Devon Sawa, you're a star!"
    },
    {
      "rating": "3/5",
      "review": "Fun, goofy, near parody, horror movie. Just ridiculous at every turn. Cheesy lines. Predictable plot. Everyone is a caricature of a horror character. But…fun enough to stream for free."
    },
    {
      "rating": "3/5",
      "review": "Rom-com Slasher flick. Entertaining."
    },
    {
      "rating": "1/5",
      "review": "We lasted about 45 minutes. I don't know what this movie was trying to be and it didn't work on any level. Was it trying to be a Romcom? Too cheesy. Comedy? Not funny. Horror? Not scary. It was a complete waste of time and I didn't want to waste another 45 minutes to see the end credits."
    },
    {
      "rating": "4/5",
      "review": "It was a 10 on the cheesy meter which isn't really a bad thing 😅"
    },
    {
      "rating": "4.5/5",
      "review": "This one is totally a fun movie!!!"
    },
    {
      "rating": "1/5",
      "review": "Biggest waste of 1 hours and 32 minutes. Cringiest story i have seen this year and it only started, one moment they’re getting slaughtered and the next they are having full time romance like come on. I was bored from the beginning and the romance/slasher cliche was the worst. Dont waste your time watching this movie."
    },
    {
      "rating": "0.5/5",
      "review": "I'm not agreeing with the high ratings. The weekend this movie came out, my boyfriend and I watched this movie first and Love Hurts right after. Heart Eyes had the worst acting I've seen in awhile. It was absolutely cheesy, worse than a romantic comedy. It was supposed to be a horror movie. I should have been cringing at the bloody deaths in the movie but instead I was cringing at the writing and the poor delivery from the actors. I recommend Love Hurts over this movie by far. It was more entertaining."
    },
    {
      "rating": "0.5/5",
      "review": "Just plain stupid movie critics calling this the next scream franchise is just a perfect reason why I never listen to them totally ridiculous"
    },
    {
      "rating": "3.5/5",
      "review": "Lots of blood and gore, but somehow the comedic effect won over!"
    },
    {
      "rating": "0.5/5",
      "review": "Sucks Nuts. I’d be pissed if I wasted money to see this in theatres. Homegirl spent the whole movie trying to survive a serial killer, kills the guy and she goes home & is trippin about a guy she met THAT MORNING. IDIOT. 81% who tf watched this the whole community of Loserville?? My gosh."
    },
    {
      "rating": "5/5",
      "review": "Very good film one of the best scream like films I have seen."
    },
    {
      "rating": "3.5/5",
      "review": "It did stereotypical cheesy rom-rom/slasher really good."
    },
    {
      "rating": "4/5",
      "review": "A mixture of pop culture horror references, a couple of unexpected twists, and an interesting concept makes Heart Eyes a work of art that we haven't seen for years"
    },
    {
      "rating": "1.5/5",
      "review": "Waste of my time and money."
    },
    {
      "rating": "4/5",
      "review": "Great movie! I loved that they focus on more comedy than suspense"
    },
    {
      "rating": "4.5/5",
      "review": "Goofy slasher movie but pretty good kills and great humor. Actually felt Interested in the love story too."
    },
    {
      "rating": "0.5/5",
      "review": "I’ll give it a .5 for the soundtrack. This movie screams I’m a simp pandering to gen z. The fact that this movie has high ratings on here makes me want to give up on life. I’m so disappointed that I had to make this account."
    },
    {
      "rating": "4/5",
      "review": "It was a good movie I really liked it, I also liked the humor."
    },
    {
      "rating": "4.5/5",
      "review": "I really loved this movie! It was the perfect combination of slasher, comedy, and cheesy romance. This one really shouldn’t be as good as it is, but some how it really worked for me. I found myself tensing up at the scary moments, laughing with the jokes, and mostly rolling my eyes when the love story got cheesy. The only thing I did not like about it was that it did not set itself up well for a second movie which shows just how much I liked it. I want another!"
    },
    {
      "rating": "3/5",
      "review": "No couple is safe. Heart Eyes is a 2025 American romantic comedy slasher film directed by Josh Ruben 🔪 Not bad, but not my favourite either 😉 It’s ok, but I feel mixed about this one 😉 I’d recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼 When the \"Heart Eyes Killer\" strikes Seattle, a pair of co-workers pulling overtime on Valentine's Day are mistaken for a couple by the elusive couple-hunting killer. Now, they must spend the most romantic night of the year running for their lives."
    },
    {
      "rating": "1.5/5",
      "review": "One of the worst movies of the year. I cannot believe so many critics and audience gave so many rave reviews? I almost fell asleep during the end fight scene. Totally predictable at every turn and I literally told my gf who the killers were during the police station scene lol A realistic audience rating would be more like 40%, not 77%."
    },
    {
      "rating": "1/5",
      "review": "Horrible boring movie. Acting was like an after school special. Don't waste ur time."
    },
    {
      "rating": "3/5",
      "review": "Not really sure how Heart Eyes smashes the cheese with the jump scares, but it's gory fun - way more than I expected."
    },
    {
      "rating": "4/5",
      "review": "A fun romp through the deadly daisies! Some very cute moments and funny acting. I enjoyed this movie with some TJ’s movie popcorn and my sense of humor 🍿 (and my partner, but don’t tell Heart Eyes!) ♥️👀"
    },
    {
      "rating": "5/5",
      "review": "Better than expected. All 3 of us laughed throughout. Very Scream-like."
    },
    {
      "rating": "3/5",
      "review": "No one is going to watch a Valentine's Day-themed slasher expecting it to be a masterpiece, right? This script has so many holes that it could be called a net, but it gets points for being fun and not taking itself too seriously. With a little disbelief, you can enjoy a film that is unoriginal but competent in what it sets out to do. The gore scenes are creative and fans of the genre will appreciate the effort."
    },
    {
      "rating": "3.5/5",
      "review": "As a big fan of slasher movies I obviously had a lot fun, good and creative kills, cheesy moments, solid characters and subtle red herrings, but unfortunately a lot missed opportunities when it comes to the killers themselves. There's definitely better slashers movies out there that are more rewatchable. Still worth watching if you're into slasher movies."
    },
    {
      "rating": "2/5",
      "review": "Good movie, felt like they copied off of the movie scream though"
    },
    {
      "rating": "3/5",
      "review": "Short and sharp. Olivia Holt was great, however this is a dime a dozen slasher film with a valentines day twist, and a little more romance injected into the film. Gory, however quickly forgettable to be honest."
    },
    {
      "rating": "3.5/5",
      "review": "Even if it doesn't work the whole time, a valiant attempt at trying something slightly original by crossing rom-com and slasher movies. It's certainly worth a look."
    },
    {
      "rating": "3.5/5",
      "review": "If a dumb fun slasher with cheesy one-liners and silly over-the-top kills is what you want, well then that’s what you’re gonna get 🤷‍♂️ Heart eyes feels verrry similar to thanksgiving (2023), — another over-the-top holiday themed slasher from the same studio, if you’re unaware — so if you enjoyed that film, this’ll please you justtt as much👌!! I’d say more but that first sentence literally sums it up: it’s a dumb fun slasher with cheesy one-liners and silly over-the-top kills. My rotten tomatoes score: 72/100 🍅, worth a watch!!"
    },
    {
      "rating": "2/5",
      "review": "'Heart Eyes' is a mildly fun slasher rom com that wastes its potential premise."
    },
    {
      "rating": "4/5",
      "review": "Heart Eyes is a surprisingly touching, funny and scary horror-comedy mashup a well-acted, well-made and thoroughly entertaining throwback to the genres it celebrates.  Recommended. detroitcineaste"
    },
    {
      "rating": "1/5",
      "review": "People clearly watched something I didn't."
    },
    {
      "rating": "3.5/5",
      "review": "Super dumb, mediocre acting, shark jumps, cheap jump scares, what's not to love? Or like, anyway. It's better than The Substance, that's for sure."
    },
    {
      "rating": "3/5",
      "review": "Heart Eyes is surprisingly pretty fun and actually a really clever way to cross a rom-com with a slasher movie! It’s a small little movie that feels familiar and is pretty cliche/corny but also flips the script in some ways which I enjoyed! While I wasn’t fully blown away by the film, I found the chemistry between Olivia Holt and Mason Gooding to be great! It’s a cheesy romantic comedy with a side of Scream/Friday the 13th! If you like the Happy Death Day films you’ll like this! Lots of fun to be had!"
    },
    {
      "rating": "4.5/5",
      "review": "Awesome and fun movie. I have to say they're really making slasher movies great these days, compared to the plotless mindless nonstop killing 80s slashers. This movie is right up there with other modern slasher gems like Time Cut and Totally Killer, the same type of fun, entertaining slasher flicks."
    },
    {
      "rating": "5/5",
      "review": "Movie was great it wasn’t a bad film it was really good"
    },
    {
      "rating": "3/5",
      "review": "Not a huge fan of gore or jumpscares but it definitely has funny moments. Would see again."
    },
    {
      "rating": "1.5/5",
      "review": "Cheesy and puerile."
    },
    {
      "rating": "3/5",
      "review": "It was ok... the pacing was abit all over the place and the ending was just so underwhelming. Also predictable."
    },
    {
      "rating": "4/5",
      "review": "Hilarious! Pacing was a bit off with a mediocre ending but who cares it was really a fun time"
    },
    {
      "rating": "2.5/5",
      "review": "They mashed genres well. Movie is better than similar works come out in recen years. I also enjoyed leads being smart and brave. Their chemistry was sweet despite all the blood."
    },
    {
      "rating": "3/5",
      "review": "Painful at times, but a solid slasher. Supposedly based in Seattle, but did a terrible job of actually making it feel like Seattle."
    },
    {
      "rating": "3/5",
      "review": "Heart Eyes is the kind of film that ties itself to a specific holiday with the hopes of becoming some kind of yearly tradition, in this case for couples who want to spend their Valentine’s Day constantly looking over their shoulder. Modern slasher films always seem to be trying their best to pay homage or even outright reference the classics in the genre, but do it in a way that feels and ‘clever’ and ‘self-aware’. As a result, movies like Heart Eyes have no idea whether they want to embrace the tropes of the genre or subvert them, and instead just do whatever seems best at the time. I liked how the killing sequences were directed, with the action being exciting, visceral and, probably most importantly, comprehensible, and to top it off they’re gory without being gratuitous. The script is an aggravating collection of modern day speak, with character dialogue that sounds like it came straight out of a social media comment section, and the twists and turns are mostly ludicrous and/or blatantly signposted. There’s one they avoided that I genuinely give them credit for, since other films of this kind would jump on it without hesitation. Ultimately, Heart Eyes doesn’t represent another step in the slasher genre, and it can never really decide which tone its going for, lurching back and forth like its several different films awkwardly merged into one. But it doesn’t drag, doesn’t insult our intelligence too much and is at least willing to create characters we might actually care about. I’d prefer if they left it as a standalone, but I’m not expecting any miracles in that regard."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is terrible. The “twist” ending makes zero sense and has no continuity to it. The acting is awful. The story has potential but it’s completely wasted. It’s trying to be a rom-com with horror sprinkled in at times. I have lost all faith in Rotten Tomatoes for this to have a 80/78 review."
    },
    {
      "rating": "2/5",
      "review": "Starts interesting. Ends stupid."
    },
    {
      "rating": "3.5/5",
      "review": "A competent slasher that makes good use of the Valentines Day theme. It moves at a good pace and has adequate twists and turns. It could some more creative kills throughout to really lean into the genre, but it has enough to check the boxes."
    },
    {
      "rating": "4/5",
      "review": "Good plot, entertaining, Tense situation, thrilling, and scary, was happy with the fight scenes And I really enjoyed it."
    },
    {
      "rating": "3.5/5",
      "review": "Started slow but Punched its way past predictable to very engaging. Worth the time"
    },
    {
      "rating": "0.5/5",
      "review": "So cringeworthy...hwak thuhh!! Ruined my night totally."
    },
    {
      "rating": "0.5/5",
      "review": "Just ultra cheesy and predictable"
    },
    {
      "rating": "4/5",
      "review": "Slasher Comedy & Romcom Parodie welche gekonnt mit der Erwartungshaltung von Beiden spielt und die Balance den ganzen Film lang halten kann. Ein \"Date\" wird eine Hetzjagd durch die Nacht. Die Kills sind kreativ und heftig. Der Humor zündet. Logik kann/ muss man natürlich vernachlässigen. Dass alles nicht allzu ernst gemeint ist, merkt man schnell. Der Film ist irgendwo zwischen Thanksgiving und Scream einzusiedeln. Die Schauspieler machen ihre Sache gut. Die Atmosphäre ist stimmig. Ein neues Horror Franchise wäre somit geboren. Durchaus ist auch der Kampf zwischen Paraphilie und der romantischen Liebe zeitgemäss. Sehenswert"
    },
    {
      "rating": "4/5",
      "review": "A fun blend of rom com and slasher."
    },
    {
      "rating": "3.5/5",
      "review": "As somebody who has never been to a Horror film in a theater before, I must say that I was happy to have seen \"Heart Eyes\". The movie kept me shaking and guessing during multiple scenes that's what I think a Horror flick SHOULD do. There were many grotesque moments of fear and violence throughout the movie, but it paired well with the notion of hopelessness that some of us have when Valentine's Day rolls around. Good movie, all in all. Don't know if I'll watch it again, but I'd recommend seeing it at least once."
    },
    {
      "rating": "0.5/5",
      "review": "Usual crap horror not scary."
    },
    {
      "rating": "0.5/5",
      "review": "A cheap replica of Scream."
    },
    {
      "rating": "3.5/5",
      "review": "Thought the movie was a good mix of funny and killing. It had you wondering who the killer was for sure."
    },
    {
      "rating": "2.5/5",
      "review": "Heart Eyes or Sleepy Eyes ??"
    },
    {
      "rating": "3/5",
      "review": "Fairly typical slasher movie. Good acting and chemistry between the two leads. A false ending leads to the third act and the final reveal, which was...meh. (But the slaughter is top-notch.) I predict a sequel, which I probably won't see."
    },
    {
      "rating": "2.5/5",
      "review": "I always love a well-funded slasher. I'd say this one tried too hard to be 'relevant' and 'funny' and should have paid more attention to the 'plot'."
    },
    {
      "rating": "5/5",
      "review": "It was awesome! Very original!"
    },
    {
      "rating": "3.5/5",
      "review": "Silly and unsurprising but a fun watch."
    },
    {
      "rating": "5/5",
      "review": "I loved it. It satisfied me and entertained me."
    },
    {
      "rating": "4.5/5",
      "review": "I liked the concept of a man killing happy couples on valentine’s day a lot. However, I felt like the ending was made after the rest of the movie because it wasn’t as satisfying as I would have hoped. Overall, though, it was funny and a really good slasher with fantastic chase scenes."
    },
    {
      "rating": "2.5/5",
      "review": "plot was flat… no climax honestly… it sucked"
    },
    {
      "rating": "4/5",
      "review": "It had the old style horror movie feel and I loved it! Something different, great cast and I could happily watch it again."
    },
    {
      "rating": "1/5",
      "review": "Giving “episode”. The twist rlly doesn’t work too well and the only thing it kind of has going for it is the gore if you’re into that."
    },
    {
      "rating": "5/5",
      "review": "Lots of Blood!!!!! When you think it's a corny horror movie it's not at all!!! Very scary and it had me jumping and talking through the whole movie!!! I'm very sorry!!! A great movie and horror and love story as well!!! Hope we get a Part 2, looking forward to another one better and bloody 3 Loved this movie"
    },
    {
      "rating": "5/5",
      "review": "I am not a big fan of horror movies. However the way they blended horror and romcom was amazing I laughed a few times"
    },
    {
      "rating": "4.5/5",
      "review": "Brilliant mixture of hardcore slasher (great gory kills!) and Rom-Com both done with humor nicely written and acted!!"
    },
    {
      "rating": "0.5/5",
      "review": "This movie was so bad...its a cliche mixed with some comedy. movie could've been so much better, genuinely felt like it was written by first time writers."
    },
    {
      "rating": "1.5/5",
      "review": "At first I thought it was going to be a banger…. Then the nonsense kicked in and it ruined the movie kinda like joker 2 but joker was better in my opinion"
    },
    {
      "rating": "3.5/5",
      "review": "Great movie I didn’t like the ending killer didn’t make much sense also not a very good motive but solid movie"
    },
    {
      "rating": "4/5",
      "review": "Great movies for couples and if you’re down for a good laugh and so good quality slasher"
    },
    {
      "rating": "4/5",
      "review": "A fresh take on a holiday slasher film, Heart eyes delivers the premise of a cheesy rom-com and 80’’s style slasher that we have come to love. This movie provided plenty of laughs and gory kills and is a refreshing new adaptation on a tale old as time"
    },
    {
      "rating": "5/5",
      "review": "Awesome! Perfect thriller with romance I’m there too!"
    },
    {
      "rating": "5/5",
      "review": "I went in with low expectations and was completely surprised how GOOD this is !!! The two leads have great chemistry and the mix of gore and comedy was well balanced and executed. Cannot wait for the SEQUEL."
    },
    {
      "rating": "3.5/5",
      "review": "Telegraphs some plot twists, but on the whole delivers fairly well as both a romcom and a slasher, and the mashup is novel."
    },
    {
      "rating": "4/5",
      "review": "A fun horror movie rom com combo"
    },
    {
      "rating": "3.5/5",
      "review": "Worth a watch. It wasn't as great as I was expecting but I still enjoyed it. Great cinematography & visuals."
    },
    {
      "rating": "4/5",
      "review": "Fun and cheesy horror flick. The music was cute and perfect for what you knew was going to happen. HEK was a good villain!"
    },
    {
      "rating": "3/5",
      "review": "The death scenes were creative. But a few too many cringey and cheesy scenes"
    },
    {
      "rating": "4/5",
      "review": "Phenomenal, comedic yet scary and never takes itself too seriously. Even though the stakes are high and so is the drama, Heart Eyes is definitely leading in horror in 2025."
    },
    {
      "rating": "4.5/5",
      "review": "Something about this film just scratches the right itch. Whether it's the realistic dialogue and chemistry between all of the characters, or the no nonsense thought processes these characters go through rather than the dumb horror stereotypes, this is a great change of pace for the horror genre will keeping with the bloody gore of a classic slasher."
    },
    {
      "rating": "2/5",
      "review": "Movies that try to be both cute and scary end up being neither."
    },
    {
      "rating": "3/5",
      "review": "It was a typical slasher movie."
    },
    {
      "rating": "5/5",
      "review": "It was action from the start all way through, and diffently a plot twist love it will see it again"
    },
    {
      "rating": "0.5/5",
      "review": "I want my money back"
    },
    {
      "rating": "4/5",
      "review": "Heart Eyes was a blast. They blended horror and humor quite well, which brings back what we used to love about slasher films in the past. The excitement of the horror of this one is a good birth of a new horror icon."
    },
    {
      "rating": "5/5",
      "review": "Signed in just to leave this review. Go see this film. The people who are disliking it don’t get it. It’s very tongue in cheek on the whole rom com and slasher genre. I did not know that coming in, I thought this would be a slasher film. I understood the concept relatively early into the film that this would not be that and was going to be something else. While being a gore galore slasher, it makes fun of the cliches that come with rom-coms and the worst end of the horror genre. If you are a fan of Cabin in the Woods, you’ll enjoy this. Don’t take this film too seriously, go into it to have fun. You won’t regret it."
    },
    {
      "rating": "5/5",
      "review": "a familiar genre with surprising subversions played by actors authentically inhabiting their roles. cinematography, sound design, song choices all impel the story forward. best seen on the big screen."
    },
    {
      "rating": "5/5",
      "review": "Amazing kills and funny"
    },
    {
      "rating": "4/5",
      "review": "Literally a romantic comedy slasher film. Totally unique and pulls it off. There’s like 4 or 5 kills in the first 5-6 minutes. Loved it."
    },
    {
      "rating": "4/5",
      "review": "Excellent take on blending romcom and slasher genres together."
    },
    {
      "rating": "5/5",
      "review": "Didn't pay attention to the plot I was too busy Jerking off to Olivia Holt."
    },
    {
      "rating": "0.5/5",
      "review": "78% AUDIENCE SCORE???? myself along with 5 random other groups of people walked out before the first hour. Quite literally the cringiest dialogue I’ve ever bared witness too. It was on pace for my worst movie of all time, but to each their own I guess."
    },
    {
      "rating": "0.5/5",
      "review": "Heart Eyes was horrible. Contemplated walking out and getting my money back through the majority of the film. Wasn't scary, wasn't funny, wasn't original, wasn't believable, wasn't much of anything. Couldn't wait for it to be over with. Terrible waste of time."
    },
    {
      "rating": "2/5",
      "review": "Super cliche in so many ways."
    },
    {
      "rating": "1/5",
      "review": "Bad plot, not scary, maybe Id watch if it was on Tubi for free very disapoonted cheezy but gory"
    },
    {
      "rating": "5/5",
      "review": "Thought it was good and funny"
    },
    {
      "rating": "4.5/5",
      "review": "A fun movie for adults and teens. It had a touch of comedy as well as horror. I would definitely watch again!"
    },
    {
      "rating": "4/5",
      "review": "Heart Eyes had plenty of twists and turns which was pleasantly surprising. Had sprinkled in elements of the classic slasher film Scream which I really enjoyed. This movie was highly entertaining and I for sure recommend!"
    },
    {
      "rating": "4/5",
      "review": "Equal parts quirky romcom + campy thriller horror gory. Definitely rewatchable!"
    },
    {
      "rating": "4/5",
      "review": "the movie was good for what it was. not scary at all and it had several comic reliefs. maybe it could be called a rom-scar......lol"
    },
    {
      "rating": "4.5/5",
      "review": "It was not your typical horror movie. It was a mix of horror, comedy, and romance. I loved it and thought it was perfect for Valentines. Also being born and raised in Seattle I did love that the movie was set in Seattle."
    },
    {
      "rating": "5/5",
      "review": "I liked everything about this movie. 10/10 would recommend"
    },
    {
      "rating": "3.5/5",
      "review": "Didn’t expect the movie to be good but it was fun and funny. There was some gory blood scenes but the director did a good job to keep the movie theme. Recommend for sure!"
    },
    {
      "rating": "2/5",
      "review": "A few jump scares with LOTS of meaningful dialogue during all the wrong moments. The conversation in the van?!? Really?!"
    },
    {
      "rating": "3.5/5",
      "review": "Decent slasher movie. Moved along ok, fairly predictable with a couple twists. Little mid-credit scene teasing at a possible sequel that probably wont be made."
    },
    {
      "rating": "4/5",
      "review": "Sooo good 10/10 wasn’t scary but had a few scenes that made me jump. And it was soo funny throughout the movie"
    },
    {
      "rating": "5/5",
      "review": "This was very hilarious. I haven't laughed this much for a movie (out in public) in a long time! I'm usually quite reserved when watching in a movie theater. It had just the right mix of gore, cheesy-rom-com moments and purposely awkward times."
    },
    {
      "rating": "1.5/5",
      "review": "It’s a slasher so I’m not expecting Pulitzer Prize writing, but the story can at least make sense. Twist ending that just doesn’t land. Cringey dialog. About 6 people walked out of our theater before the end and honestly I can’t blame them. Very surprised by the positive reviews it’s receiving. Wouldn’t recommend."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie. Action from beginning to end!"
    },
    {
      "rating": "5/5",
      "review": "Hilarious. Best of rom-com and slasher films"
    },
    {
      "rating": "5/5",
      "review": "Good old fashion slasher movie. Lots of gore but good story line"
    },
    {
      "rating": "3/5",
      "review": "The opening scene was solid, and set up the tone of the flick. The 10 minutes or so which followed weren't all too good due to it having those tropes the movie eventually makes fun of, and it is slightly on the nose for comedic purpose, but then again.. it's also 10 minutes of rom-com tropes. But once we slice away at the first \"date\" with a good monologue by Olivia Holt which matures the movie beyond spoof comedy, things get interesting, and the movie only gets more, and more interesting, and better after that. It ended up being a whole lot of fun. Very similar to Scream in how it's structured, and its surprising use of physical comedy (lost art), but the flick uses the element of spoof comedy in a different way since it mainly makes fun of rom-coms through the lens of a horror movie. Which isn't something you see everyday. It is a love-letter to those rom-coms while making fun of it, which was fun. Thank you!"
    },
    {
      "rating": "1/5",
      "review": "no plot. was not impressed by the movie at all."
    },
    {
      "rating": "2.5/5",
      "review": "1 of the better rom-com/horror films of the past few years, the 2 leads come off believable as a couple. With that said, the story is very predictable and you can probably guess who the killer is within the 2nd act."
    },
    {
      "rating": "5/5",
      "review": "I was a good move quite funny"
    },
    {
      "rating": "4.5/5",
      "review": "Gore galore but it was funny"
    },
    {
      "rating": "1.5/5",
      "review": "So bad honestly it was hard to watch"
    },
    {
      "rating": "3.5/5",
      "review": "A weird mashup of horror and rom-com that somehow manages to be equal parts both. It's enjoyable as a slasher especially if you're looking for something different."
    },
    {
      "rating": "5/5",
      "review": "Classic slasher flick with a modern romcom twist. Non-stop action from beginning to end which I appreciate."
    },
    {
      "rating": "4/5",
      "review": "The modern day scream. Let's hope we get more slasher movies like this one!"
    },
    {
      "rating": "2/5",
      "review": "Seems like they lost creativity from the middle to the end. Still a good slasher , if you love slasher films"
    },
    {
      "rating": "2.5/5",
      "review": "Plot didn't make sense, the cop couldn't have been a cop in Seattle and killing people in Philly. It just was a well thought out script."
    },
    {
      "rating": "0.5/5",
      "review": "If there was a 0 star rating thats what this movie would deserve. Can’t recall the last time I fell asleep at the movies. The worst movie I’ve seen in a very long time. Certified ratings are a joke these days. Folks rating movies specially this one either need to be fired or change career fields."
    },
    {
      "rating": "5/5",
      "review": "Funny , not too gory, we loved it. We will watch it again"
    },
    {
      "rating": "2.5/5",
      "review": "It was a fun way to kill an hour and a half, the main two characters were fairly well written and well-acted but everyone else is pretty bland and forgettable to where even the movie forgets about them. The killer's personality was a bit inconsistent as the first half they are a silent stalker like they're use to and then all of a sudden they have a voice changer voice like Ghostface. Not at all a bad movie, but nothing mindblowing."
    },
    {
      "rating": "5/5",
      "review": "Classic slasher vibes, very funny, the gore was killer. Overall a great movie and a fun theater experience!"
    },
    {
      "rating": "3/5",
      "review": "A romantic comedy horror film that boldly embraces the blend of gore and laughter! I anticipated a Valentine's Day classic akin to \"My Bloody Valentine,\" characterized by its darker themes and chilling suspense. However, this movie takes an unexpected turn, leaning more toward lighthearted humor and playful whimsy. I found myself genuinely enjoying the comedic elements sprinkled throughout, as the unlikely romance blossomed amidst the chaos of a relentless killer. The juxtaposition of love and horror added a unique charm, making for an entertaining experience that kept my husband and I both chuckling and on the edge of my seat."
    },
    {
      "rating": "3/5",
      "review": "I liked that it was a funny slasher movie"
    },
    {
      "rating": "5/5",
      "review": "So much fun. I was laughing the entire time & the jump scares were so good. Must watch."
    },
    {
      "rating": "3.5/5",
      "review": "8.5/10 not a bad movie. Corny, funny, and worth a watch if you have nothing better to do. Overall, I would recommend watching it."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie. Great Plot. Awesome cast."
    },
    {
      "rating": "5/5",
      "review": "It was definitely a thriller..a lot of killing and bloodshed"
    },
    {
      "rating": "5/5",
      "review": "Great little movie. Fun, romantic, and just an overall feel good movie that pays heed to some of the classic slasher films, but does so in a fun way."
    },
    {
      "rating": "5/5",
      "review": "Best movie Ive seen this year"
    },
    {
      "rating": "1/5",
      "review": "it was corny the only part I liked was the couple falling in love"
    },
    {
      "rating": "4/5",
      "review": "The whole movie is a around great one it’s has a little bit of everything in it and it keeps you entertained"
    },
    {
      "rating": "3/5",
      "review": "Ok for the funny gore-ror genre."
    },
    {
      "rating": "4.5/5",
      "review": "Fun plot and I liked the campy, jokiness during the movie"
    },
    {
      "rating": "3.5/5",
      "review": "Clever Scream-like movie."
    },
    {
      "rating": "3.5/5",
      "review": "Something to do and watch! Honestly it felt like watching 5 different movie themes but again it does keep you watching!"
    },
    {
      "rating": "4/5",
      "review": "I’ll watch it again later sometime."
    },
    {
      "rating": "4/5",
      "review": "The movie was whitty, not scary but it did make me jump a few times. Typical bad guy story line. We did laugh a few times too. Very well rounded. But we agreed that the title was pretty stupid"
    },
    {
      "rating": "4/5",
      "review": "loved it. super funny, violent, & gorey - i also loved 'Thanksgiving'; i hope they continue making one of these for every holiday, lol."
    },
    {
      "rating": "3.5/5",
      "review": "When Harry Meets Sally meets My Bloody Valentine. Enough said!"
    },
    {
      "rating": "4/5",
      "review": "Funny, gory, romantic 😍🩸🔪🍿🥤"
    },
    {
      "rating": "5/5",
      "review": "My first slasher rom com. Hilarious. I really enjoyed it. But understand this is a rom com/slasher"
    },
    {
      "rating": "4/5",
      "review": "One of the better slasher films to come out over the last 15 years."
    },
    {
      "rating": "5/5",
      "review": "Loved it. My new favorite romance. Whoever’s idea it was is a genius to make a comedy horror romance. Kind of gave Urban Legend vibes a little too"
    },
    {
      "rating": "4/5",
      "review": "Great story...definitely a slasher movie!"
    },
    {
      "rating": "2/5",
      "review": "Just like the others. Not very good"
    },
    {
      "rating": "5/5",
      "review": "Super good movie, a fantastic blend of romance comedy and horror movie. If you wanna laugh and see a bunch of blood, watch this."
    },
    {
      "rating": "5/5",
      "review": "Now that's entertainment. I busted out laughing at least three times. And the ending left my heart feeling warm rather than twisted like most horror movies."
    },
    {
      "rating": "5/5",
      "review": "Very well detailed movie , great character development and always keeps you invested and entertained"
    },
    {
      "rating": "5/5",
      "review": "Just watched Heart Eyes and, oh boy - that was epic! The film draws your attention straight away with an intense and gory chase scene. ( which btw will occur multiple times throughout the film as you would expect from a slasher.) This work has plenty of fun references to other films, like “Hobbs and Shaw”, etc. They’ve managed to create a good synergy between comedy and horror elements, which often leads to a “corny baloney”, however in this movie it wasn’t the case at all. All jokes were pertinent and brilliantly diluted the atmosphere and tension in the film. Moreover, I was surprised with the quality and originality of some murders. When you, horror fans, thought that you’ve seen it all, believe me, Heart Eyes got something up its sleeve. The story itself whirls around two work “not mates”, which makes you root for them to end-up together and have the happy end, however in horror films, that’s not always the case… Overall, brilliant horror film, which will make your loved ones ponder, if it’s a good idea to be a couple on Valentines Day after all. To those who love Scream franchise - this one was made for you."
    },
    {
      "rating": "4/5",
      "review": "This movie is fast paced and has some really funny comedy mixed in to the horror which is well appreciated. Good fun movie for a date night."
    },
    {
      "rating": "0.5/5",
      "review": "The best part of this movie was when it ended. Maybe it’s my own fault for agreeing to see a both a Valentines Day & Horror movie mixed into one.. What did I expect. In a nutshell, 2 hours of my life I’ll never get back and wish I’d put towards staying at home and jumping on the PS5. Firstly, possibly the longest a movie has ever taken to get going. For what’s advertised as an 18 rated slasher movie, in-between the god-awful acting and trying to keep myself awake, I seriously almost considered getting up and walking out, until about three quarters of the way through it finally picked up. Even so, it’s a shame even the limited action/horror/slasher scenes were just as bland & cringey as the love story parts... Yuck. Secondly, plot holes, plot holes, plot holes…. Yes all horror movies have them, but in my opinion both the director and whoever greenlit this movie should have been the slasher’s first victim just as punishment for the sloppiness and lack of care in making the movie. Need I say more. Lastly, Jordana Brewster (Mia Toretto from Fast & Furious franchise) must be seriously desperate for cash for agreeing to be in this movie. …It’s a shame even her role in the movie couldn’t save it."
    },
    {
      "rating": "4.5/5",
      "review": "Just saw it and loved it! Not perfect by any means (few movies are) but enjoyed Its mix of bloody horror and self deprecating humour. I hope this starts a renewed trend for horror movies like this as horror has become a little too depressing, especially as a escape from the horrors of real life."
    },
    {
      "rating": "2/5",
      "review": "Cheesy. This movie fails at every attempt at humor. I thought I was seeing a horror movie. I was wrong."
    },
    {
      "rating": "3/5",
      "review": "It's stupid (and meant to be) and silly. Humor and gore! Good times and my kinda movie. The two leads are both good and have great chemistry. It's a poor man's \"Scream\" but fun nonetheless."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie, humor was great loved the acting overall super happy with it!"
    },
    {
      "rating": "0.5/5",
      "review": "Not funny, not scary, not romantic, has no plot, no real characters, and absolutely no redeeming qualities whatsoever. It doesn't even have a remotely good twist, and it throws away any semblance of tension with some unfunny romantic one liner EVERY SINGLE SCENE. It's genuinely difficult to make a movie this bad, it's as if they actively removed everything and anything that made the first draft good. Please do not waste your time, this movie sucks."
    },
    {
      "rating": "5/5",
      "review": "Great fun film. Perfect movie for Valentine’s Day 😜"
    },
    {
      "rating": "5/5",
      "review": "We need more slasher movies like this. Thank you."
    },
    {
      "rating": "5/5",
      "review": "Its a rom com disguised as a slasher movie. Had a blast the whole movie. Would definitely watch it again."
    },
    {
      "rating": "5/5",
      "review": "Perfect combination of romcom and slasher that I didn’t know I needed."
    },
    {
      "rating": "4/5",
      "review": "Some good jumps/scares throughout the movie and a good plot twist, I didn’t see coming. Even though it was a horror film, it also had great comedic timing. I enjoyed it!"
    },
    {
      "rating": "3.5/5",
      "review": "For a Valentine’s Day Slasher, I think this is a surprisingly fun flick. The villain has a cool design, the movie has cool kills, a good cast, and a good story. The main character making dumb decisions throughout the story, and the 3rd act, being kinda clunky are what holds it back a bit for me. But I had fun with it nonetheless. Definitely a recommendation for me if you’re in the mood for a fun new slasher movie"
    },
    {
      "rating": "4.5/5",
      "review": "So much fun. Great couples slasher movie"
    },
    {
      "rating": "5/5",
      "review": "Litterally the best horror movie of 2025. So thrilling, Amazing casting, Incredible cold open, and unbelievable twists"
    },
    {
      "rating": "5/5",
      "review": "Comedy, Horror & Romance all at the same time, my husband and I really enjoyed watching it."
    },
    {
      "rating": "5/5",
      "review": "Action was perfectly spaced, story line was good, and just enough blood."
    },
    {
      "rating": "3.5/5",
      "review": "The trailers sold me on this movie, but I also went into it hoping the best parts weren't in the trailer. They're not! This was a really fun slasher, that's also a great romantic comedy. The performances were fun, the \"will they won't they\" tension between our main leads was great. This film can easily transition from a flirty scene to an all out horror chase through the house, and it does it very well. The kills and gore were really good, and I enjoyed the gimmick and look of Heart Eyes. I will say, the 3rd act reveal (think Scream) lost me a bit with the dialogue and overdoing it. Just a little goofy in spots, but the gore came around to save it by the end. Worth watching on the big screen for a matinee or discount price."
    },
    {
      "rating": "5/5",
      "review": "Good movie. Horror slasher with comedy. Its good,"
    },
    {
      "rating": "3.5/5",
      "review": "Super funny while being a thriller!"
    },
    {
      "rating": "4.5/5",
      "review": "Heart Eyes - 9/10. This felt like if Scream, 21 Jump Street, and a traditional romcom were blended together. Heart Eyes was a blast and a lot of fun. I just love when films just have fun with their respective premises. Not every movie needs a deep message or a thought provoking metaphor to its purpose. Sometimes, just simple fun is what the viewer needs! Surprisingly, this was a lot more meta and cheesier than I originally thought it would be. There’s a lot of cheese and silliness in this film, and it doesn’t take itself seriously for the most part. Sure, the big reveal is where it kinda shifts into more serious mode, but otherwise the dialogue and atmosphere is very banter like and very easy going. You got a cast that seems to be having a blast here, and everyone is just having tons of fun as they go along the ride. I liked Holt and Gooding’s chemistry here, and they both have a funny “enemies” to lovers dynamic here. It’s also pretty funny how they have to try convincing the killer that they are not a couple, as they’re being pursued to their doom. I’m surprised that there hasn’t been a slasher flick of this kind which involves a killer specifically only targeting couples (and that too during Valentines Day). You feel like because the vibe is so light, you’re able to take the proceedings in a lot more of a chill manner and you can just watch this for the sake of trying to see a fun and good slasher flick. Though I wouldn’t say its on the same level as a Scream or Halloween film, it’s definitely an entertaining flick which might end up garnering a cult following for the years to come. Great movie and great fun!"
    },
    {
      "rating": "4/5",
      "review": "It was campy,funny, the action and horror really pull through, overall really glad I watch it, didn’t expect it to be as good as it was"
    },
    {
      "rating": "4/5",
      "review": "It’s a good jump fright.."
    },
    {
      "rating": "3.5/5",
      "review": "Nothing to immediately jump on the phone about and tell people to go and see but it was still really enjoyable. Mixed a hallmark romance (with some of the questionable acting) with a scream style horror pretty well."
    },
    {
      "rating": "1/5",
      "review": "Not sure what others saw that I didn't but this movie was a waste of my time. It attempted to be a Scream-clone with it's mixture of slasher and comedy but failed to make it work. Cheesy and corny. Do not waste your time."
    },
    {
      "rating": "4/5",
      "review": "If you are a slasher fan especially from the late 90s to early 200os or fan of the scream movie you will enjoy this movie. Jason Goding is so likeable in this movie your hoping he was not the killer. Laughs throughout."
    },
    {
      "rating": "4.5/5",
      "review": "It’s like a slasher jumped into a really cheesy rom com from the 90s and started murdering everyone."
    },
    {
      "rating": "5/5",
      "review": "it is badshit insane"
    },
    {
      "rating": "5/5",
      "review": "One of the best movie in while"
    },
    {
      "rating": "4/5",
      "review": "It’s very rare for a slasher film to be actually be good and have high ratings, and heart eyes is one of those. The chase scenes are creative and fun, they’re tuns of good kills, and the action is suspenseful. The story is good and the movie doesn’t take itself too seriously. When you walk out of the theater you will be pleased with this movie."
    },
    {
      "rating": "1.5/5",
      "review": "Storylines for horror movies usually aren't A1, but this was hard to get through. The opening plot makes zero sense and the ending is mediocre at best. Most jokes are centered around gen alpha humor and fall flat. The first jump scare was the only redeeming quality of this film."
    },
    {
      "rating": "3/5",
      "review": "it's fine, has interesting characters, and has a decent storyline. Pretty gore filled, but that's natural in a slasher movie. It's pretty campy and has a lot of comedic scenes, but overall, it was nice."
    },
    {
      "rating": "3.5/5",
      "review": "More funny than scary"
    },
    {
      "rating": "5/5",
      "review": "such a great movie 🎬"
    },
    {
      "rating": "0.5/5",
      "review": "Most drawn out movie of the year, and not for the benefit of a soul."
    },
    {
      "rating": "5/5",
      "review": "Great film with even better action and humor"
    },
    {
      "rating": "2.5/5",
      "review": "More funny than scary ."
    },
    {
      "rating": "4/5",
      "review": "Funny to turn off your mind to and just get a quick laughs and some jump scares."
    },
    {
      "rating": "5/5",
      "review": "Perfect combination of horror and comedy"
    },
    {
      "rating": "5/5",
      "review": "9.5/10 future horror icon"
    },
    {
      "rating": "5/5",
      "review": "Fun times! Not your typical slasher. Plenty of laughs, thrills and jump scares."
    },
    {
      "rating": "1/5",
      "review": "This movie was a waste of an hour and a half of my life. It was not even remotely close to funny with cheesy weird jokes. The ending made no sense and added no benefit whatsoever. Don’t waste your time"
    },
    {
      "rating": "1/5",
      "review": "Boring, cheesy, not funny, predictable, etc. I’d give it zero star if I could."
    },
    {
      "rating": "5/5",
      "review": "Very good from stressed to finish"
    },
    {
      "rating": "0.5/5",
      "review": "I do not understand how this movie received such a high rating. It was predictable, corny, and way longer than it needed to be. There are other films that received much lower ratings and were significantly better. I would only recommend this if you have absolutely nothing else to watch."
    },
    {
      "rating": "2/5",
      "review": "Blood and gore overreach and inexplicable and unbelievable scenes."
    },
    {
      "rating": "3.5/5",
      "review": "Fun but pretty predictable."
    },
    {
      "rating": "3.5/5",
      "review": "It was interesting, funny and bloody. It wasn't filmed in Seattle !!"
    },
    {
      "rating": "4.5/5",
      "review": "Great movie but very gory"
    },
    {
      "rating": "4/5",
      "review": "Cute horror/love movie"
    },
    {
      "rating": "5/5",
      "review": "One of the best horror/slasher films I’ve seen in a long time."
    },
    {
      "rating": "3/5",
      "review": "This movie has a great plot just poorly executed. I wish they would’ve spent more time making it into a thriller since that is where majority of the potential was for this movie. The couple did not seem like they had much chemistry, maybe spend more time making them compatible. I give the overall idea a 3 the movie was a 1 at best. Additionally, the comedy portion of this movie was slim to none. This should not be allowed to be a comedy considering there were like 4 jokes."
    },
    {
      "rating": "4/5",
      "review": "Pretty Funny , I enjoyed this Valentine themed slasher / Comedy"
    },
    {
      "rating": "2.5/5",
      "review": "Totally a rental. So typical and seems like a remake of a lot of other movies like this. No real twists or surprise’s"
    },
    {
      "rating": "1/5",
      "review": "Bad. Real bad, what the heck was that!"
    },
    {
      "rating": "3/5",
      "review": "i thought it was pretty funny, the gore was good but i just wish it was more scary. the plot twist was weird asf"
    },
    {
      "rating": "4/5",
      "review": "It was a fun time. A good mix or comedy with horror elements and a dash of ROM com. The leads had great chemistry."
    },
    {
      "rating": "2/5",
      "review": "You didn't expect this to be good, but it's even worse than you thought. Everything in it is from \"Slasher Movie Writing for Dummies,\" from the weak romantic characters to the goofy killer to the many predictable bloodbaths. It makes an inadvertent argument in favor of responsible gun ownership."
    },
    {
      "rating": "4/5",
      "review": "This HORROR/COMEDY is very good. I love the kills. The comedy was on point. GO SEE!!!!"
    },
    {
      "rating": "4.5/5",
      "review": "Great, Funny there is gore and a plot twist"
    },
    {
      "rating": "5/5",
      "review": "I was pleasantly surprised by this movie. It was a decent slasher, it had a good amount of comedy and romance. It's usually hard to merge those in a movie but Heart Eyes did it"
    },
    {
      "rating": "1/5",
      "review": "It felt like if Hallmark made a horror movie with so many plot holes in it."
    },
    {
      "rating": "1/5",
      "review": "Easily one of the worst and laziest films around right now. This supposed horror-comedy isnt remotely funny at any point, isn't scary and has only one vaugely fun kill which you can see in full in the trailer."
    },
    {
      "rating": "5/5",
      "review": "13/10 absolutely great film. Slasher, with the times. Lots of action and gore, some good laughs."
    },
    {
      "rating": "5/5",
      "review": "What an actual great movie loved everything about it the horror and comedic elements, love it"
    },
    {
      "rating": "4/5",
      "review": "Watched this with my girlfriend and we both really enjoyed it, best movie weve seen this year so far."
    },
    {
      "rating": "3/5",
      "review": "First, Heart Eyes is not a bad movie but neither is it good. There is some predictably in it. When you have a movie that combine two genre it needs to be balance. X amount of horror mixed with X amount of rom com. This film forgets what it wants to be and when it remembers its usually at a wrong time. Without giving away anything why is a therapy session happening while they are getting hunted down at the drive in. And really you fall in love with someone you just met less than 8 hours ago. \"STALKER\" In the end the movies ok but it's one where you can skip the theater and wait for streaming."
    },
    {
      "rating": "5/5",
      "review": "Super good. Must see so funny/scary so good! and a mystery. It’s like scream"
    },
    {
      "rating": "4/5",
      "review": "It’s A (Good) Hallmark Valentine’s Day meets a Horrific Slasher Bloodfest. With a Pinch of Comedy. Only wish the Ending was a bit different."
    },
    {
      "rating": "5/5",
      "review": "This movie delivered! 100% rom-com + 100% horror. Loved it!"
    },
    {
      "rating": "3.5/5",
      "review": "I really enjoyed this slasher. The tone was horror/comedy along the lines of Cabin in the Woods. The leads did a great job carrying the film. Mason Gooding is a handsome leading man with a lot of charm. Where the movie fell flat was towards the end with a couple of monologs that went on too long. At the point the tone became cheesie. Overall it was good watch."
    },
    {
      "rating": "0.5/5",
      "review": "The movie is so boring, I leffes before it finished it was so boring, so much talking in the beginning, it was just so boring"
    },
    {
      "rating": "2/5",
      "review": "If you like scream type of slasher you might enjoy this. It was more of a romance with a slasher story around it. Really lagged the first half after an encouraging start. Needed more kills throughout less romance. Surprisingly gory ending almost made up for it, just not enough creative kills and less rom-com storyline."
    },
    {
      "rating": "4.5/5",
      "review": "Cheesy, jumpy and honestly a really decent flowing plot. The gore was INCREDIBLE. Highly recommend. Do not bring children."
    },
    {
      "rating": "5/5",
      "review": "It was good made me jump a couple times good movie but maybe a better story line would be better and CGI"
    },
    {
      "rating": "3/5",
      "review": "It was pretty cheesy."
    },
    {
      "rating": "4/5",
      "review": "Romance Horror and Funny, along with some plot twists"
    },
    {
      "rating": "4/5",
      "review": "The movie can be a little confusing at times but it's so much fun. if you liked the scream series of films or just like your slashers to be a little campy this is for you!"
    },
    {
      "rating": "5/5",
      "review": "Hilarious and a great slasher"
    },
    {
      "rating": "5/5",
      "review": "Great modern comedy slasher with fun gore and banter"
    },
    {
      "rating": "3.5/5",
      "review": "Ending was a bummer, but a funny spoof of slasher films. Certainly no Scream. At least it's not a Marvel movie."
    },
    {
      "rating": "2/5",
      "review": "Started out as a good movie. How did they know where the girl live at. That part made the movie bad. The killer was already in her house, but how did he know what apartment she lived in?"
    },
    {
      "rating": "3/5",
      "review": "Heart Eyes delivers a refreshing twist on the Valentine’s Day slasher genre, blending romance and horror with surprising flair. Olivia Holt and Mason Gooding’s chemistry anchors the film, making their dynamic enjoyable even as the tension rises. The kills are fun and gory, hitting the right notes for slasher fans. However, the film struggles to balance its comedic moments with the chilling atmosphere. While the rom-com elements add charm early on, the humor becomes a bit too heavy later, occasionally undermining the threat and ruining some of the tension. The comedy feels out of place at times, leaving the audience unsure whether they should laugh or be on edge. The big reveal near the end, which could have been a game-changer, felt underwhelming, leaving me hoping for a more satisfying payoff. Despite these missteps, Heart Eyes remains an entertaining ride. It offers a nostalgic throwback to the early 2000s slasher era but fails to fully capitalize on its potential. Still, if you're in the mood for a fun, gory date-night flick with a bit of humor, this one is worth a watch."
    },
    {
      "rating": "4/5",
      "review": "I like original idea movies props to them for that a Valentine killer going across the world not caring who sees them take people out ,this dose a really good job with suspense I'm happy to have enjoyed my time with this It's a one & done I like that not every movie needs sequel after sequel!"
    },
    {
      "rating": "5/5",
      "review": "Absolutly loved this movie! The perfect Valentines horror movie, kept me and my boyfriend on our toes the whole movie while also providing goof laughs"
    },
    {
      "rating": "3/5",
      "review": "In terms of slasher film blood & gore, it delivered but the reveal was so stupid. Plus that woman's absurd \"Southern\" accent (in Seattle no less) was completely unnecessary. I did appreciate the rom-com references those were funny."
    },
    {
      "rating": "4.5/5",
      "review": "Definitely a good movie I was confused when it was listed in the comedy genre but I see now it had a lot of funny moments and the scenes were gruesome just like I like them. Would love to see it again"
    },
    {
      "rating": "0.5/5",
      "review": "Predictable plot, basic production. Just another slasher, nothing special."
    },
    {
      "rating": "4.5/5",
      "review": "Subtexto afiado e inteligente,combinado a uma excelente comédia romântica e muito terror visceral."
    },
    {
      "rating": "5/5",
      "review": "Honestly a great thriller rom-com mash up!"
    },
    {
      "rating": "3.5/5",
      "review": "I had zero expectations for this movie yet somehow found myself invested in the main protagonists and laughing at the silly twists and turns throughout. As expected the movie was gory and contained plenty of creative and nasty deaths. The serial killer had a great vibe and was definiitely menacimg. Sound editing helped sell that too. There was way more comedy then I was expecting and the main actors had solid chemistry onscreen. The ending was surprisingly fresh and didn't fall too far into clich territory. There is a funny payoff with a prop introduced in the first scene too. Lastly of you're patient, there is a mid-credits stinger that wraps up things nicely."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible plot, paid $60 for this. Cant believe this :,("
    },
    {
      "rating": "4/5",
      "review": "I loved the actors. It was funny, scary and it kept me interested."
    },
    {
      "rating": "0.5/5",
      "review": "The plot was terrible the ending may have been the worst I have ever seen if they wanted to make a movie like this why not just make another scream they have all the same actors anyway also why was the ex boyfriend in it so much builds up hes character and then nothing happens would not recommend"
    },
    {
      "rating": "4/5",
      "review": "Great slasher movie, loved the romance. Partner says definitely needs a part 2!"
    },
    {
      "rating": "4.5/5",
      "review": "As funny as it is gory, this movie delivers a wholehearted story with a nice little twist on the killer(s). Great acting, the story drew my wife and I in and gave us some jumps and laughs along the way. Don't want to spoil a good movie, but I highly recommend to take your hunny to watch this! Heart eyes is the perfect blend Rom/com/horror!"
    },
    {
      "rating": "4/5",
      "review": "A fun time. A really fun ride"
    },
    {
      "rating": "5/5",
      "review": "I’m a horror movie lover and what I loved most about this movie was the characters had great chemistry, we got classic horror movie fundamentals, and a satisfying resolution. I would love to see this because a franchise."
    },
    {
      "rating": "3/5",
      "review": "It's one of those films that goes out of its way to be deliberately smaltzy and kinda works. A few laughs, some suspense, horror. What's not to like? ......quite a few things but let's not take things too seriously"
    },
    {
      "rating": "4/5",
      "review": "Had some great jump in your seat moments but didn’t like the ending of who the suspects turned out to be, kind of irrelevant."
    },
    {
      "rating": "3/5",
      "review": "Decent watch but don’t expect the best ending lol, literally in theaters I said “there’s more?”"
    },
    {
      "rating": "2.5/5",
      "review": "I enjoyed the comedy aspect of this movie very funny with some love mixed in but not as scary as i would’ve liked.. overall this movie was Ok"
    },
    {
      "rating": "3.5/5",
      "review": "I’m surprised at all the one star reviews, this movie has a lot of good laughs, jump scares, and it’s also a romantic comedy. No it won’t be nominated for any Academy Awards with the acting but it kept me entertained."
    },
    {
      "rating": "1/5",
      "review": "Just plain bad. Feels like a Freeform movie with gore. Uninteresting killer, no story or motivation, fairly obvious killer reveal not to mention that the most interesting kill is spoiled in the trailer. Most of the cast has appeared in significantly better horror(ish) films and are wasted here, especially Sawa. Watch those instead."
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this movie. It was fun, humorous and gory just the way I like it. It was definitely better than I had anticipated."
    },
    {
      "rating": "5/5",
      "review": "Great movie!! Suspense on point!! UNPREDICTABLE MUST WATCH!!!"
    },
    {
      "rating": "4/5",
      "review": "Really enjoyed this movie. Lots of laughs."
    },
    {
      "rating": "3.5/5",
      "review": "Fun rom com that is also a slasher! Great date night movie"
    },
    {
      "rating": "5/5",
      "review": "I LIKED THE PLOT TWIST AT THE END"
    },
    {
      "rating": "5/5",
      "review": "A great film all around"
    },
    {
      "rating": "0.5/5",
      "review": "Movie was lame. Do not waste your money. Theres the cheesy funny movies that are done correctly. This was not one of them."
    },
    {
      "rating": "3.5/5",
      "review": "Good fun. Slasher and comedy"
    },
    {
      "rating": "3/5",
      "review": "more fun than scary, very predicable. OK movie would I watch it again no."
    },
    {
      "rating": "5/5",
      "review": "The movie was so great that the suspense of who was under the mask the chills thrills suspense horrors action super suspense . Gotta wait after the movie next time cause imma see these GREAT MOVUES AGAIN"
    },
    {
      "rating": "4/5",
      "review": "Great film, not what I expected, funny and gory. Loved the film references"
    },
    {
      "rating": "5/5",
      "review": "This is a slasher rom com. If you love both these genres then this is the movie for you. If you’re only a fan of one of these genres then this might be mid at best. And if you like neither of these genres then the direction of this movie will completely fly over your head. There’s a lot of tropes and references in this movie that people that haven’t experienced these genres would not get. You can tell by the five stars which camp I fall under. I personally think it did an amazing job of combining the campy-ness of a slasher with the cringe-ness of a rom com."
    },
    {
      "rating": "5/5",
      "review": "Wow really great film ngl"
    },
    {
      "rating": "1/5",
      "review": "It was confusing and it really did have potential just don’t think about seeing it with your parents a date would be better some sexual scenes"
    },
    {
      "rating": "1.5/5",
      "review": "I'm pretty disappointed with myself for how much liked this movie that was quite bad. For being a crisp 90 minutes, the movie somehoW really lost the plot well before it even entered the final act. I was baffled by many of the story choices, how terrible some of the lines were, and ultimately where everything was headed. That being said, ya know, I'm such a sucker for some brutal kills inner mixed between some great laughs. The violence is BRUTAL at times! laughed more than I should be willing to admit. Mason Gooding has such a winning charisma and love seeing him in any and everything. A horror comedy is the quickest way to my heart (lol) and Heart Eyes fits the formula. Parts of the writing team have made some of my favorite horror comedies of late but this one is probably the worst. All that said, what a fun time!"
    },
    {
      "rating": "2.5/5",
      "review": "Not bad but definitely not good- fun watch with friends. Good gore!"
    },
    {
      "rating": "3/5",
      "review": "I came for a slasher movie and saw a rom-com with a little gore mixed in"
    },
    {
      "rating": "5/5",
      "review": "PERFECT BALANCE BETWEEN CORNY FUNNY AND THRILLER LOL MUST SEE"
    },
    {
      "rating": "4/5",
      "review": "Unserious suspenseful funny type beat"
    },
    {
      "rating": "4/5",
      "review": "great, fun, horror flick. funny moments, brutal kills, overall a great film"
    },
    {
      "rating": "3.5/5",
      "review": "Perfect horror movie for women!! Overall though.. was done well."
    },
    {
      "rating": "5/5",
      "review": "It gave meet cute mixed with every slasher ever and it works"
    },
    {
      "rating": "1/5",
      "review": "Boring. Had potential, then the makers fumbled. Better luck next time."
    },
    {
      "rating": "3.5/5",
      "review": "Just came from watching this movie and I'll admit, it is cheesy but its actually entertaining. If you're going to watch this film just go with an open mind and don't take it too seriously. You have a few jump scares but the gore is all there. My only complaint is the killers and how they were revealed, otherwise, its a fun movie, great mix between rom-com and slasher."
    },
    {
      "rating": "3/5",
      "review": "Good humor. Cast was good. Didn't scream scary."
    },
    {
      "rating": "5/5",
      "review": "Good chemistry between the main leads, funny , good jump scares , good gory parts not too gory. Best thriller rom com movie to see. Would go see it again."
    },
    {
      "rating": "5/5",
      "review": "Romantic comedy slasher film 🔥🔥🔥 This move was way more fun than I expected. Saw it with two girls I went on a date with we had a blast! The goat Devon Sawa is in it too. Also, there is a post credits scene. Stick around! LoL"
    },
    {
      "rating": "0.5/5",
      "review": "Continues the trend of slasher/romcom movies. Why does hokeywood think it is ok to blend the genres? Comedy movies should not have Gore and bloodshed."
    },
    {
      "rating": "4/5",
      "review": "Definitely a different kind of Valentines Days movie, but still a romantic movie (of sorts). The was really entertaining, with sharp humor, funny moments, inventive and gory killings and a very likable cast (well-acted). Love the idea behind the movie and even though I am not a fan of slasher movies, this was one of the best that I have ever seen."
    },
    {
      "rating": "5/5",
      "review": "Fun movie with a lot of action. If you enjoy movies with creative murders, then worth seeing"
    },
    {
      "rating": "5/5",
      "review": "I would like my money back it was bad"
    },
    {
      "rating": "3.5/5",
      "review": "Heart Eyes is a delightful film that boldly blends horror with comedy, creating a unique Valentine’s Day-themed spectacle. The comedy, pace, and outrageous mix are the standout features, perfectly attuned to modern trends to keep viewers captivated. While it embraces corny elements, this playfulness works in its favor as it humorously critiques the Thriller genre. The opening scene exemplifies this, presenting a horror opera and a mystery that intrigues and entertains. Despite some inconsistent execution, which occasionally detracts from the film’s creativity, the overall experience is enjoyable and fun. The movie delivers a series of ludicrous laughs, making it a worthwhile cinematic adventure worth seeing."
    },
    {
      "rating": "4/5",
      "review": "A great mix of rom com and slasher"
    },
    {
      "rating": "1.5/5",
      "review": "Tries to be Scream, it fails. The self-aware horror comedy genre is getting lazy I remember when critics actually critiqued films instead of writing these \"bought and paid for\" reviews from the studios. You critics are soft."
    },
    {
      "rating": "1/5",
      "review": "Too terrible to even mention"
    },
    {
      "rating": "4/5",
      "review": "Oh this one is fun! We forgave any plot holes(one or two there) because the chemistry between the cast is priceless and gives the movie such a great flow. Quite a typical slasher flick, but a well executed one with enough giggles to keep the viewer engaged."
    },
    {
      "rating": "1/5",
      "review": "Although the movie had some jump scares and was mixed with a bit of comedy, it started off confusing and was just like every other mediocre scary movie. More creativity could have been added to the backstory."
    },
    {
      "rating": "4/5",
      "review": "Opening scene was done so well! I loved the humor in this film. I'm not a gore person and yet I really enjoyed this movie. Olivia Holt is very engaging. You root for her the whole time. This movie doesn't take itself seriously and that's its charm."
    },
    {
      "rating": "0.5/5",
      "review": "This is the worst movie I have seen in ages. I love horror films but the cringe dialogue and lack of any plot made it impossible to enjoy this. I almost walked out. Let’s hope there isn’t a sequel. If there is I won’t be seeing it!"
    },
    {
      "rating": "4/5",
      "review": "It was fun and had action and some romance. It started off great until the killer was revealed. Totally not what I expected. But overall good movie. There was also a bit of comedy in there. Would not recommend for kids."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie !!!!! Perfect combination of horror, comedy, and romance. Absolute must see!!!!"
    },
    {
      "rating": "5/5",
      "review": "Check your expectations and enjoy it for what it is. Super cute, funny, and cheesy."
    },
    {
      "rating": "4/5",
      "review": "A horror movie with a weird comedy twist. Not bad and very different."
    },
    {
      "rating": "5/5",
      "review": "My new favorite movie! Love it so much will watch it every valentine day. F anyone who hates this film."
    },
    {
      "rating": "3.5/5",
      "review": "It was good a bit slow at first but funny and entertaining I liked I would say go watch it"
    },
    {
      "rating": "5/5",
      "review": "Super cheesy and dramatic, but I loved it. Had some really funny moments, and Id definitely watch it again. The acting wasnt great, but that just made it better."
    },
    {
      "rating": "1/5",
      "review": "Just a bad movie overall. Save your money"
    },
    {
      "rating": "5/5",
      "review": "Best vday movie ever…it’s romantic scary and funny…the couple is so cute didn’t realize he is Cuba gooding son so hot! Not a true horror movie but that’s what’ made it great and everyone in the theater was boo’d up for vday! Most def recommend for date night♥️"
    },
    {
      "rating": "5/5",
      "review": "I Like The Who Movie . Love The Twist At The End."
    },
    {
      "rating": "1/5",
      "review": "Worst movie I’ve seen in my entire life"
    },
    {
      "rating": "3/5",
      "review": "it was good and some parts were funny"
    },
    {
      "rating": "3/5",
      "review": "This movie was kind of stupid, but it made up for it because it was funny. It was one of those bad movies that is technically bad but it’s kind of funny because it’s so bad so it’s still entertaining. I didn’t regret seeing it, but it was definitely silly."
    },
    {
      "rating": "5/5",
      "review": "Its a nice love letter to other slashers. Specifically scream. Really curious to see if they can keep momentum on any potential sequel. Some cheesey lines but who doesnt like a little bit of cheese with some wine for Valentines Day"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed everything about this movie"
    },
    {
      "rating": "4/5",
      "review": "comedy was good and the gore was decent ... went in thinking it would be horrible .. but it kept me focused"
    },
    {
      "rating": "4/5",
      "review": "It was good for what it was. It didn’t try hard. It’s just a cheesy rom comedy horror attempt."
    },
    {
      "rating": "4/5",
      "review": "I just got back from the theater. I really liked the film. I recommend going to go watch it if you haven't already. Both main protagonists have great chemistry. I actually cared about both of them and that usually isn't the case in a lot of movies today. For example, I didn't care one bit for both main characters in The Strangers: Chapter One. The movie has some funny moments that made me chuckle but the movie also has some great gory scenes. The Heart Eyes killer is very violent with his kills and reminds me of Jason from Friday the 13th, the way he moves and uses a machete. This definitely could be the start of a new franchise in horror. I give it a 8/10. I also see the Heart Eyes mask selling like crazy in Halloween😆"
    },
    {
      "rating": "5/5",
      "review": "it's good, outstanding comedic timing, and a great watch with friends."
    },
    {
      "rating": "4.5/5",
      "review": "I loved the movie ! It was gorey while still being entertaining . I would totally watch again."
    },
    {
      "rating": "5/5",
      "review": "Heart Eyes was an amazing movie. It had everything that a good slasher movie should have with added romance and comedy. Don’t understand why people gave it negative reviews because to me, it was outstanding."
    },
    {
      "rating": "5/5",
      "review": "Such a fun watch! Definitely recommend if you like cheesy horror movies. It’s a lot of the same kills that you’ve probably seen before, but they put such a fun twist. Could NOT contain my laughter 😂"
    },
    {
      "rating": "5/5",
      "review": "Loved the plot twist and the acting, lots of killings"
    },
    {
      "rating": "4/5",
      "review": "A great date night movie."
    },
    {
      "rating": "5/5",
      "review": "I really loved this movie! I’m a fan of slashers in general and having a Valentine’s themed one was nice. The comedy in the movie is great, too."
    },
    {
      "rating": "3/5",
      "review": "Kind of cheesy, but not bad. As expected for a Valentine’s Day horror. The Villains were kind of lame, but it was still an ok movie."
    },
    {
      "rating": "2/5",
      "review": "The new slasher films, are a bit too goofy for my taste. I'm always expecting the same feel of Scream 1-3 and I Know What You Did Last Summer."
    },
    {
      "rating": "4/5",
      "review": "Fun slasher love story! Perfect for V-Day❣️"
    },
    {
      "rating": "1/5",
      "review": "Wow, that was really bad! That may be the dumbest plot and weakest \"motive\" I've ever seen in a horror movie! Not scary, not funny and not at all clever! Don't waste your time or money. Don't trust the ratings unless your mindless and think every movie is good. No way these are authentic critics. Must be getting paid by the studio to leave positive reviews."
    },
    {
      "rating": "5/5",
      "review": "It was funny, cheesy and bloody!!!! I loved it!!!"
    },
    {
      "rating": "5/5",
      "review": "MY FAV MOVIE YET, I love the mix of rom com and horror"
    },
    {
      "rating": "2.5/5",
      "review": "If you’re over 35, you’ve seen this movie 200 times already"
    },
    {
      "rating": "3/5",
      "review": "Kind of cheesy, but not bad. As expected for a Valentine’s Day horror."
    },
    {
      "rating": "5/5",
      "review": "I LOVE this movie it’s funny and scary gore too💘"
    },
    {
      "rating": "3/5",
      "review": "I felt more comedy than horror. I was expecting something different like more scary and serious."
    },
    {
      "rating": "3/5",
      "review": "Really seemed to be the next Scream series, with A LOT of the use of the F word. Should've waited till it was on cable"
    },
    {
      "rating": "4/5",
      "review": "Loved the mix of Rom-Com with thriller . Definitely was a good movie ."
    },
    {
      "rating": "5/5",
      "review": "Ignore the hokey poster with the glowing heart eyes that suggested the movie was cheezy rather than scary (thankfully, the eyes only lit up for one brief scene). It is actually a combo romance and serial killer movie that works surprisingly well on both levels. A perfect couples movie! Sharp dialogue, good acting, and real chemistry between the two leads equals a great date night out!"
    },
    {
      "rating": "5/5",
      "review": "A good Rom-Com horror movie. Just what Cupid didn't order."
    },
    {
      "rating": "3.5/5",
      "review": "Was better than expected"
    },
    {
      "rating": "5/5",
      "review": "AMAZING, Best Date Ever❤️"
    },
    {
      "rating": "4.5/5",
      "review": "Loved it despite the corny love story built in but that actually made it funny as well as scary. Hoping this becomes a new horror franchise."
    },
    {
      "rating": "4/5",
      "review": "seriously funny, hallmark movie with ALLthe blood."
    },
    {
      "rating": "0.5/5",
      "review": "Corny and not scary at all"
    },
    {
      "rating": "3/5",
      "review": "similar to the scream franchise."
    },
    {
      "rating": "4/5",
      "review": "Had a great classical feel to it. The kills were awesome. Plot was simple and the twists are perfect"
    },
    {
      "rating": "4/5",
      "review": "I did not know it was gonna be a romantic comedy horror, so it was a nice surprise. Reminded me of the scream movies but with comedy. Would definitely watch again."
    },
    {
      "rating": "0.5/5",
      "review": "Kept hearing reviews that this was a good movie and I can’t for the life of me understand why. Even my 12 year old thought the movie was ridiculous."
    },
    {
      "rating": "4/5",
      "review": "This Romance horror slasher flick Blends in Halloween with Valentine's Day holiday seasons. I saw it on Valentine's Day single but still had a great time it adds a little bit of Comedy to keep the theater laughing at multiple points at the theater but also other reviews are not talking about the storyline it's actually pretty good and shows where dating can go when you've been hurt so many times and the brutal kills are memorable with blood purging at the screen haha"
    },
    {
      "rating": "1/5",
      "review": "This movie was a waste of time."
    },
    {
      "rating": "3.5/5",
      "review": "I'm a fan of romcom, my husband is a fan of slash horror, this movie brings the best of both worlds. I thought this was a fun movie to watch. I liked the chemistry, and thought it was funny and endearing in some moments."
    },
    {
      "rating": "5/5",
      "review": "Bloody, gory, funny and even cute."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was so disappointing and terrible and not even scary why the hell is this R rated.. Cause the Dildo scene and sex jokes? oh please give me a break I could’ve watched this on disney channel"
    },
    {
      "rating": "3/5",
      "review": "Good Valentine’s Day movie, good laughs , but not as scary as I would’ve liked ."
    },
    {
      "rating": "5/5",
      "review": "It was funny, suspenseful and overall a good movie had lots of jokes like a horror comedy. Should definitely go watch"
    },
    {
      "rating": "5/5",
      "review": "It was both comedy and horror. All the actors played a great role and it was fun to watch"
    },
    {
      "rating": "0.5/5",
      "review": "Horrible plot line. The killers can kill someone a mile away until he went after the “couple” and then he couldn’t get them no matter how close he was."
    },
    {
      "rating": "5/5",
      "review": "Horror meets rom-com a little corny at times but overall I loved it! great kills"
    }
  ]
}