[
  {
    "rating": "4.5/5",
    "review": "Great chemistry among the leads, and a villain arc that has to be one of the most emotionally profound of the MCU films."
  },
  {
    "rating": "4/5",
    "review": "Unless you're a die-hard fan, you won't recognize these characters, but what you will recognize is people dealing with trauma. I deeply enjoyed this film as a long-time Marvel fan along with my wife (who has zero knowledge of this stuff) because the themes are relatable. Each character deals with grief, irrelevance, regret, disappointment, and loss in a way that resonates with the audience. I read some really harsh reviews, but I actually enjoyed the film a lot more than I thought I would. It's not a perfect film, by any means. However, it does keep a really tight grip on the plot and doesn't muddy the waters too much with the ensemble cast, instead (wisely) choosing to focus on the three main leads. Their arcs are compelling, emotional, and real. I do wish that some of the characters had more time to bond and that some of the plot devices weren't so obvious (such as visible countdown timers for traps and easily located bomb power supplies), but they don't detract from the emotional beats. I liked that they take their name from Yelena's childhood team, the \"Thunderbolts,\" a soccer team that \"never won a game.\" Phrasing is important -- it's not that they're losers, it's just that they've never won. To date, each character is dealing with 'victories' that are either morally gray or pyrrhic, so they all feel like underachievers. As underdogs, it's hard not to root for them."
  },
  {
    "rating": "4.5/5",
    "review": "Best human touch hero movie"
  },
  {
    "rating": "5/5",
    "review": "This was so funnnn to watch but still a marvel heroe movie em n general"
  },
  {
    "rating": "1/5",
    "review": "Why did it exist? Oh my goodness, what happened to Marvel?! Who is gonna see the new avengers who r actually boring and cringy d-vengers?! The jokes r cringy and the fighting scenes r completely mediocre. Not single one character is likeable and charismatic! Again, what happened to Marvel?!"
  },
  {
    "rating": "5/5",
    "review": "Thunderbolts* has an amazing way of uniting heroes that have made many mistakes to show them that they are not defined by their pasts and that they can always start over and be better people. This movie is basically a mental health awareness movie."
  },
  {
    "rating": "5/5",
    "review": "Absolute masterpiece, keeps the original marvel charm while also keeping it emotional and yet it is funny without removing the main feeling of the action"
  },
  {
    "rating": "4.5/5",
    "review": "The movie was a roller coaster. It gives you a really emotional ride comparable to the real world."
  },
  {
    "rating": "5/5",
    "review": "Not what I was expecting... Yet I'd say a much more edgier, I liked it"
  },
  {
    "rating": "3.5/5",
    "review": "Really good plot Some action Good to see"
  },
  {
    "rating": "5/5",
    "review": "this is putting marvel movies in the right direction"
  },
  {
    "rating": "4/5",
    "review": "Taskmaster taken out way too soon. Could have been Rated R hit."
  },
  {
    "rating": "5/5",
    "review": "Best marvel movie in a long while! Worth every second"
  },
  {
    "rating": "4/5",
    "review": "I missed Olga Kurylenko. Not enough Bucky. It was Yelena and Alexi's movie."
  },
  {
    "rating": "4/5",
    "review": "I thought this was a lot of fun, had a surprising amount of heart, and included important setup references for the upcoming Fantastic Four and Avengers movies."
  },
  {
    "rating": "5/5",
    "review": "loved it! it is a fun ride 😃 well done ✅"
  },
  {
    "rating": "5/5",
    "review": "Pleasant surprise! Unexpected indeed! Great fulfilling superhero movie with heart!"
  },
  {
    "rating": "4/5",
    "review": "I liked the action and how whenever they went into the void we got a deeper background on what they had to went through"
  },
  {
    "rating": "5/5",
    "review": "Amazing, entertaining high octane fun!"
  },
  {
    "rating": "5/5",
    "review": "One of the best Marvel movies!! The story line was so interesting and the chemistry between all the characters was amazing. It had tear jerker moments, fantastic marvel fight sequences and it was hilarious."
  },
  {
    "rating": "5/5",
    "review": "What was not to love! Marvel with heart is always 5 stars"
  },
  {
    "rating": "4/5",
    "review": "The build-up until the climax was pretty well put together. However, once that climax started, the movie was quite entertaining!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was crap. Fingers crossed for Fantastic Four."
  },
  {
    "rating": "5/5",
    "review": "Unexpectedly funny, and deals with mental health in a thoughtful way. Highly recommend this film."
  },
  {
    "rating": "4.5/5",
    "review": "Better than I expected"
  },
  {
    "rating": "1/5",
    "review": "what did i just watch?"
  },
  {
    "rating": "5/5",
    "review": "This is the 3rd time my daughter and I watched it! Thunderbolts is a fulfilled movie with classic Marvel action and humor. Just go, have a good time!"
  },
  {
    "rating": "2.5/5",
    "review": "Lots of character development, and storytelling, but action scenes seemed far and few between and the ending seemed a bit rushed. Built up as \"The best Marvel movie of all time.\" But I probably would not have it in my top 10 in the MCU even."
  },
  {
    "rating": "4/5",
    "review": "could do without all the stupid swearing and foul language. not everyone is a hethen."
  },
  {
    "rating": "5/5",
    "review": "There’s nothing to dislike.. Great movie."
  },
  {
    "rating": "3/5",
    "review": "The antagonist was kind of weak, Bob. He felt kind of like a cross between Inception and some low-end troubled villain who is misunderstood. And so he has all of the powers and is better than everyone, like even better than Thanos? Even the writers seemed to laugh at it in the movie when BSentry says, so I am better than a god...Overall I liked the Thunderbolts team but the naming of them as the New Avengers felt kind of unusual. Like what about Hulk, Ant Man, Spiderman, Dr Strange...Are they out? What about Captain Marvel, or Thor? Overall it was fine, better than the new Captain America but not a favorite."
  },
  {
    "rating": "5/5",
    "review": "I like the fact that it showed people they are not alone"
  },
  {
    "rating": "1/5",
    "review": "Needed more action and better and exciting storyline"
  },
  {
    "rating": "1/5",
    "review": "Loved David Harbour, otherwise very confusing and hard to understand what was going on."
  },
  {
    "rating": "5/5",
    "review": "Marvels never fails!! Movie was funny, full of action and did not disappoint."
  },
  {
    "rating": "1.5/5",
    "review": "First, I have to admit I am not a fan of most Marvel movies (However, I do love Guardians of the Galaxy 1 and Deadpool). Thunderbolts got great reviews so I decided to check it out. However, I was disappointed in this movie. The overall plot was just so inane. One bright spot was Florence Pugh's performance--she was great."
  },
  {
    "rating": "5/5",
    "review": "I loved the movie, the story line was great, we havent had a good marvel movie in awhile but this one I loved and it was just incredible"
  },
  {
    "rating": "3/5",
    "review": "The whole talk about depression was just boring to me"
  },
  {
    "rating": "4.5/5",
    "review": "Amazing. Best superhero movie of all time."
  },
  {
    "rating": "3/5",
    "review": "It was good movie overall ending was kinda stupid."
  },
  {
    "rating": "5/5",
    "review": "MUST SEE!! This has to be one of the best Marvel Movies yet. There was action, drama, so much comedy! It’s a must see! Finally some good movies are coming out. Great cast! Awesome visual effects!! So great to watch! Thank you!"
  },
  {
    "rating": "4.5/5",
    "review": "There was just the right amount of action, drama and some comedy sprinkled in. Enjoyed the movie from beginning to end."
  },
  {
    "rating": "5/5",
    "review": "The first Marvel movie in a while that took advantage of the fact the all the characters had been introduced before. We already knew them and so we already cared about them. Then they put them in a situation we can all relate to. Feeling alone and like no one really cares. Also made me laugh and tear up multiple times. Any movie that does that is very good in my book."
  },
  {
    "rating": "5/5",
    "review": "Movie was very entertaining! Good action and humor!"
  },
  {
    "rating": "4.5/5",
    "review": "Good fun enjoyable movie."
  },
  {
    "rating": "3.5/5",
    "review": "Very solid film, good entry for the MCU"
  },
  {
    "rating": "2/5",
    "review": "The Movie was very underwhelming!"
  },
  {
    "rating": "3.5/5",
    "review": "The film is in many ways similar to Guardians of the Galaxy or Suicide Squad. It was entertaining, funny, and had some interesting twists. However, the movie felt like it didn’t dig deep enough. Into the characters, into the “villain”, into the story, into the darkness that the characters are feeling. There is the foundation of a great movie, but they just didn’t spend enough time giving it an impact. The focus on regrets and loneliness is too shallow to make the audience feel the characters’ pain."
  },
  {
    "rating": "0.5/5",
    "review": "NOPE. NOPE. NOPE. NOPE. Total disappointment. Marvel HAS to do better. I wonder if its because of Disney? Im not sure but Thinderbolts aint it."
  },
  {
    "rating": "4.5/5",
    "review": "Moments of levity, action, and interesting characters made the movie good. What I disliked was that Bob's superpower seemed to be depression which kind of gave a depressing theme to the movie. Never thought I would see clinical depression used as a superpower is Prozac the Kryptonite? Other than that we liked it."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is as absolute trash"
  },
  {
    "rating": "5/5",
    "review": "Beautifully done, great message"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie, it was funny, awesome, Incredible, and taught us what life is after those depressing times, and it's okay, also it was entertaining. 100/10 go see it."
  },
  {
    "rating": "5/5",
    "review": "I was not going to see this in theaters but one of my friends who saw it said it was worth it. I really enjoyed it even though the only character I really liked going into the movie was Bucky. At the end I like all of the characters more now and story and the action was actually really cool. Not sure if I liked it so much because of how disappointing a lot of stuff has been recently from marvel and it was a breath of fresh air. Or if it’s actually good on its own. I feel like if this released before endgame it would be lower tier but because it’s after endgame it’s definitely the best one other than Spider-Man no way home."
  },
  {
    "rating": "1.5/5",
    "review": "Unsurprisingly an F tier cast of characters and a D tier script yield mediocre results."
  },
  {
    "rating": "5/5",
    "review": "great movie I see potential with this so long as they dont do to much in the future movies"
  },
  {
    "rating": "5/5",
    "review": "Serious, sad, funny, deep, entertaining. What else you can ask for a movie? 9/10 I’m my book."
  },
  {
    "rating": "5/5",
    "review": "Amazing!!!!! Powerful messages! Didnt expect it to be this good!"
  },
  {
    "rating": "5/5",
    "review": "Best Movie this year"
  },
  {
    "rating": "5/5",
    "review": "loved it! It was a movie about battling mental health that used super heroes to explore and delve into it. Great metaphors. So much better than I expected."
  },
  {
    "rating": "3.5/5",
    "review": "Great film, worth the watch !!"
  },
  {
    "rating": "3.5/5",
    "review": "I thought it was entertaining. At times a bit sappy, but as far as marvel movies go, it's been a while since one has been worth the time to watch it, and this one was."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie. Even if you don't know Marvel, you would still like this movie. Looks awesome in 3D IMAX too."
  },
  {
    "rating": "4.5/5",
    "review": "Good movie! Would watch it again"
  },
  {
    "rating": "4.5/5",
    "review": "Amazing movie. Had one complaint but it was a personal preference. Great experience in the movie theater."
  },
  {
    "rating": "2/5",
    "review": "I love a good Marvel movie. When I saw the cast was excited to see it. Ummm...I'm not sure where the high ratings are coming from. Mediocre at best. Cheesy and kind of boring. I really wanted it to be good but no..."
  },
  {
    "rating": "3.5/5",
    "review": "It’s worth a watch. One of the better ones since Infinity War. I’d say they’re definitely losing their touch on the end credit scenes though. Hopefully we’ll get to see a good Planet Hulk/World War Hulk film now."
  },
  {
    "rating": "5/5",
    "review": "Be sure to watch The Falcon and the Winter Soldier on Disney + before hand. Another great MCU movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Loved the humor and action, kept me on my toes the whole movie"
  },
  {
    "rating": "5/5",
    "review": "Amazing action pack film! will see it again"
  },
  {
    "rating": "4/5",
    "review": "A good feeling story of redemption, courage, and getting up off the mat. A little corny but we could use a little of that these days."
  },
  {
    "rating": "3.5/5",
    "review": "I'm often a super hero movie skeptic. The worst super hero movies wind up being the all powerful hero versus the indestructible villain gallavanting through a city causing massive destruction amounting to nothing. Thunderbolts* felt like the antithesis of this. Every one of the characters was very human and very flawed. None -- even the powerful villain, was indestructible. And much of the movie actually focused on the very real issue of mental health. Multiple of the characters were grappling with mental health making them feel all that more real and human. On top of this, the writing was pretty humorous. Florence Pugh and David Harbour had the best characters, constantly throwing out witty one liners. And Julia Louis-Dreyfus was surprisingly good as Tulsi Gabbard -- I mean the evil CIA director. I never remember any of the broader plot lines from the Marvel universe and there were definitely a lot of references back to things that happened that I no longer remember from past movies. But it never felt like it mattered that I didn't remember. Overall it was a well put together, humorous movie that seemed to have a much more meaningful point than many vacuous superhero movies."
  },
  {
    "rating": "4.5/5",
    "review": "I like it because it's my birthday."
  },
  {
    "rating": "4/5",
    "review": "It was filled with action and had a great story about real life"
  },
  {
    "rating": "4/5",
    "review": "Good character building, entertaining story."
  },
  {
    "rating": "5/5",
    "review": "Fun & full of heart!"
  },
  {
    "rating": "4/5",
    "review": "Thunderbolts is a strong, surprisingly grounded entry in the MCU that reminds us just how good Marvel can be when it actually leans into character, humor, and tight storytelling. With a cast of familiar faces and morally gray heroes, the film strikes a great balance between gritty action and sharp wit. The acting is consistently solid across the board, with returning characters like Yelena Belova and Bucky Barnes stealing scenes with both emotional depth and comedic timing. The chemistry between the team is believable, messy, and entertaining—just what you’d want from a group of reluctant allies. The writing is smart and refreshingly character-driven, with enough humor to keep things light without undercutting the stakes. Action sequences are punchy, well-choreographed, and serve the story rather than overwhelm it. Thunderbolts may not reinvent the genre, but it doesn't need to. It's a reminder that Marvel still knows how to deliver a fun, engaging, and well-made superhero movie when it stays focused. A solid win that earns its place in the lineup."
  },
  {
    "rating": "4/5",
    "review": "It was an excellent film showcasing the Marvel sidekicks' collaborative efforts."
  },
  {
    "rating": "2/5",
    "review": "Tbh sentry story is one of the best stories in the comics and they changed it into some bullshit why would they change a masterpiece story"
  },
  {
    "rating": "5/5",
    "review": "Didn't think I'd enjoy it considering the characters but it was very entertaining. Great story and intro to Bob."
  },
  {
    "rating": "2.5/5",
    "review": "Movie was slow,and kind of \" choppy\". Story wasn't good. Not alot of action. Sentry character was lame. Not the worst Marvel movie but it's close,in my view. VERY DISAPPOINTED in this. Was looking forward to seeing this movie since the first trailer"
  },
  {
    "rating": "4.5/5",
    "review": "It was a good watchinawgile from Marvel."
  },
  {
    "rating": "4/5",
    "review": "Good starting point for rebirth of the Avengers with some comedy thrown in"
  },
  {
    "rating": "0.5/5",
    "review": "Whack !!! Why can’t anybody make any good movies anymore??? Does every movie have to be so corny!!!"
  },
  {
    "rating": "5/5",
    "review": "great character development, great story and set up for doomsday is amazing 👏"
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed it as a good movie, not just a good Marvel movie. The writing and acting were so solid I felt like I could have watched a whole extra act it was a self-contained story that left me excited to see more from this group of characters."
  },
  {
    "rating": "5/5",
    "review": "Everyone’s performance in this movie was great. Feel like marvel has returned with this movie."
  },
  {
    "rating": "5/5",
    "review": "the best Marvel movie I have watched in a while. The acting was great, and the new team was awesome 👌"
  },
  {
    "rating": "5/5",
    "review": "It was a great movie"
  },
  {
    "rating": "5/5",
    "review": "Feel like the old MCU"
  },
  {
    "rating": "5/5",
    "review": "Great fun, well paced Marvel movie."
  },
  {
    "rating": "5/5",
    "review": "Best marvel movie in awhile . Just go watch it"
  },
  {
    "rating": "5/5",
    "review": "It was a really fantastic and very well done Marvel live-action movie. It had very well done cinematography, really sensational performances, really incredible characters, really cool special effects, really astonishing action, really phenomenal humor, really great drama, really extraordinary music, really magnificent costumes and a really fascinating story. In my opinion, I think it’s one of the best Marvel movies of 2025. I extremely recommend this film to Marvel fans of all ages."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I’ve ever seen! Don’t waste your money. My husband and grandkids all agree with me. It was boring as anything and it seemed the writer was filling it in with one ridiculous fight after another. Plot didn’t exist either!"
  },
  {
    "rating": "4/5",
    "review": "It was a great film. Emotional and story driven. Great cast. You can see and feel the chemistry of the team. Definitely recommend watching it."
  },
  {
    "rating": "5/5",
    "review": "I’d go see it a hundred times (just like Sinners) if I had 15 bucks to shell out everyday of the week! Definitely got action, some moments to tug at your heart strings and some great laughs!"
  },
  {
    "rating": "3/5",
    "review": "ok not bad for using less popular charas. I enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "Best Marvel movie ever! Fantastic character development, writing, acting and action"
  },
  {
    "rating": "5/5",
    "review": "A very creative way to introduce a new group of super heroes Not trying to build off of the Avengers we have grown to love over the years, but created an original and wonderful storyline for the new Marvel superheroes."
  },
  {
    "rating": "5/5",
    "review": "I Loved this film!!! If I could give it more stars I would. The story line was so well developed. Marvel did a great job in developing the characters into 2025. They all seem to work very well together and felt very comfortable. I can’t say enough about the visual effects were some of the best I’ve ever seen. Great job Marvel ! I loved this film. Looking forward to watching them develop into the future Avengers."
  }
]