[
  {
    "rating": "4/5",
    "review": "Starts little slow, but was very sweet. I love Vince Vaughn and he was wonderful. Slight tears of joy at the end."
  },
  {
    "rating": "5/5",
    "review": "Felt emotional and happy at the same time. Bravo!"
  },
  {
    "rating": "3.5/5",
    "review": "A truly heartfelt look into the family-oriented nature of Italian culture as well as the processing of grief. This film reenforces the important reality that our elders can still engage with the world around them and overcome the isolation and uselessness that, sadly, many often feel. Vince Vaughn does an impeccable job taking on a more serious role while still maintaining nuances of his cheerful personality, all without leaning too heavily on his comedic performance experiences. Susan Sarandon also adds a comical but meaningful role supporting and creating strong, confident female figures for all to love. This feel-good movie is definitely worth the watch. With that said, there are elements that feel glossed over in the plot, unrealistic at times, that detract from its technical value as a film. Great family movie but nothing worth cinematic praise."
  },
  {
    "rating": "4/5",
    "review": "Nonnas is one of those rare feel-good movies that leaves you smiling long after the credits roll. I really appreciated how it celebrates starting fresh at any age and shows that life’s most rewarding chapters can begin later than expected. The fact that it’s based on a true story made it all the more heartwarming and inspiring. The performances were sincere and well-executed, and the whole cast brought a real sense of warmth and authenticity to the screen. It’s a comforting, uplifting watch — highly recommended if you’re looking for something that blends heart, humor, and hope."
  },
  {
    "rating": "5/5",
    "review": "Inspiring and feel good movie. I love it!"
  },
  {
    "rating": "2/5",
    "review": "Not offensive in any way, but boring, predictable and unoriginal, just like a Hallmark movie. Also, full of stereotypes and following the Hollywood narrative of Italy and Italian culture. Good film for escapist purposes. On the plus side, there’s Susan Sarandon in it, who’s very vocal about the Palestinian Holocaust."
  },
  {
    "rating": "0.5/5",
    "review": "Movie Review: The Nonnas ★☆☆☆☆ The Nonnas is a painful watch from start to finish. There’s zero chemistry between the characters, making every interaction feel forced and awkward. The acting is wooden at best—more like a high school play than a professional production. Whatever charm the film was aiming for gets completely lost in the cringe-worthy delivery and disjointed scenes. Save yourself the time—this one’s a hard watch."
  },
  {
    "rating": "4.5/5",
    "review": "LOVED! Listen we aren't breaking new ground or winning Oscars, but if you are looking for a warm and engaging movie to watch with all generations this is it! We loved the characters and the story. You will be entertained. Well done & has all the feels 🇮🇹"
  },
  {
    "rating": "5/5",
    "review": "ABSOLUTELY BEAUTIFUL HEART FELT MOVIE A MUST SEE IT HAD ME MAD AND CRYING AT TIMES . LOVE LOVE LOVEDDDDDDDDDDDDDDDDD IT!!!"
  },
  {
    "rating": "4/5",
    "review": "Hermosa . Para ver en familia. Reír y llorar. Excelentes actuaciones. Guión original.. una historia muy bien contada"
  },
  {
    "rating": "5/5",
    "review": "Outstanding film!! No violence or foul language. Just a great story of the love of family, hopes, and dreams. Recommend this as a must see for everyone. 🎥😎🎞️"
  },
  {
    "rating": "5/5",
    "review": "What an outstanding film! No violence or foul language. Just a wonderful story about the love of family, dreams, and hopes. Recommend this as a must see for everyone.🎥😎🎞️"
  },
  {
    "rating": "2.5/5",
    "review": "Sweet story but poorly executed. A terrific cast is wasted on a maudlin script and amateurish direction. Every moment is expected. It feels like it was written by AI. What should have been heartfelt is instead flat."
  },
  {
    "rating": "3.5/5",
    "review": "Good value of humour and great concept for movie based on real life restaurant. Just a little too predictable rom-com and storyline like any other Hollywood movie but overall, great story to share!"
  },
  {
    "rating": "4/5",
    "review": "Exceptionally sweet and wrapped neatly with incredible performances all around, Nonnas tastes exactly like it looks: a warm hug from home."
  },
  {
    "rating": "5/5",
    "review": "Nonnas is a deeply moving film that envelops viewers in warmth, much like a comforting embrace from a beloved grandmother. The movie draws inspiration from the true story of Joe Scaravella, portrayed with sincerity by Vince Vaughn. After the loss of his mother, Joe seeks solace and purpose by opening Enoteca Maria, a Staten Island restaurant staffed entirely by Italian grandmothers—or \"nonnas\"—each bringing their unique culinary traditions to the table. The ensemble cast delivers performances that resonate with authenticity and heart: Vince Vaughn as Joe Scaravella: Embodies a man navigating grief, channeling his love into a venture that honors his family's legacy. Susan Sarandon as Gia: Portrays a spirited nonna whose passion for cooking is matched only by her zest for life. Lorraine Bracco as Roberta: Delivers a nuanced performance as a nonna whose dishes are infused with deep-rooted traditions. Talia Shire as Teresa: Brings warmth and wisdom, capturing the essence of a matriarch who sees cooking as an act of love. Brenda Vaccaro as Antonella: Offers a delightful blend of humor and heart, portraying a nonna whose stories are as rich as her recipes. Linda Cardellini as Olivia: Plays Joe's high school crush, adding layers of romantic tension and personal growth to the narrative. Joe Manganiello as Bruno: Acts as Joe's steadfast friend and contractor, providing both comic relief and unwavering support. The film is a tapestry of intergenerational relationships, cultural heritage, and the healing power of food. Each scene is imbued with emotion, from the clatter of pots in the kitchen to the shared laughter around the dinner table. The nonnas' interactions—sometimes clashing, often heartwarming—highlight the beauty of diverse traditions coming together. Nonnas doesn't just tell a story; it invites viewers into a world where love is measured in ladles of sauce and memories are baked into every loaf of bread. It's a cinematic experience that leaves the heart full and the spirit uplifted. Rating: 9/10 – A heartfelt homage to family, tradition, and the universal language of food."
  },
  {
    "rating": "1.5/5",
    "review": "This movie is just dragging for me and I'm a grandmother. Maybe because I'm 0 Italian, spaghetti and meatballs maybe 2 times a month, couldn't relate to it at all. Good to see all the older actresses. I was looking forward to watching it because of all the positive comments."
  },
  {
    "rating": "4/5",
    "review": "Warm, touching movie, and even though it's predictable, the all-star cast is worth their weight in gold. I don't know if it's the incredible acting of Brenda Vacarro, Susan Sarandon, Talia Shire and Lorraine Bracco, but they ooze love, acerbic wit and the down-home familiarity of their characters."
  },
  {
    "rating": "5/5",
    "review": "This movie is a testament to women we never see on screen, who are the backbone of so much of American culture. I have no Italian family, but after watching this movie, I feel like so many rifts in our culture would lessen if we all had more Nonnas in our lives. This is a lovely, feel-good movie that feels so warm. Just go watch it. It will lift your soul and feel like a hug with a spicy Italian edge you will love."
  },
  {
    "rating": "1.5/5",
    "review": "This coulda been better; the actors are there; at least a couple hundred years+ experience. But the writing is leaden, the plot uuum simplistic, and the main character is so one dimensional that we never find out in the entire movie if he has a life other than his mom. It's sad to see such a waste. But... if you want a heavy dose of schmaltz, leavened with a nod at Italian cooking, and plot developments that are signaled in neon, then far be it for me to rescue your two hours of your life."
  },
  {
    "rating": "2.5/5",
    "review": "A good story that was ruined by the Hallmark style of film making. It felt like a Hollywood caricature of New York Italians. Were there no talented real New York actors who \"get\" the culture? The Sopranos cast local actors who could portray the real New York italian culture and attitude. The actors here didn't come close. And a restaurant movie that barely shows the food? Fuggettaboutit!"
  },
  {
    "rating": "5/5",
    "review": "First off, the negative reviews make no sense - Story about \"nonna's\" cooking is unbelievable? IT'S BASED ON A TRUE STORY lol. Anyways, it is not \"really\" a comedy. A guy who lacks ambition finds a purpose. Another negative - Does Vince play the part well? I think so, though at first I wasn't sure until I analyzed the background. He is not a native born Italian and does not pronounce the words he knows with the correct accent, but in the film, probably only his grandparents spoke it. I'm Italian and am amazed at how many in similar households do not remember the language, but remember nonna's cooking. THIS is what the movie is about. I though casting Susan Sarandon as a grandmother was extremely far fetched until I googled her real age - she looks FANTASTIC, and her character - a hair dresser who is into fashion - turns out perfectly cast. Overall, a film that make you feel good."
  },
  {
    "rating": "4/5",
    "review": "The fact that this film is based on a true story is bound to arouse the viewer's interest. Without being an extraordinary work, the result fulfils what is expected, especially the regional dishes that can be appreciated."
  },
  {
    "rating": "1.5/5",
    "review": "Vince Vaughn was so miscast. He looks late 50s and there is nothing wrong with that but he is playing mid ish 40s and he can't pull if off! (he's actually 55). I found it so distracting. And whoever heard of a community of Italians with not one kid between them except in stories told by the Nonnas in that incongruous scene in the hair salon? Weird. Definitely Hallmark or Lifetime channel vibes. Meh AND it was bored."
  },
  {
    "rating": "4/5",
    "review": "Feel good movie. Very refreshing. All actors have done justice to their role. Vince Vaughn has done a calm character role which you typically done expect from him. By end of it, I felt like I wanted to start a restaurant."
  },
  {
    "rating": "4/5",
    "review": "A feel good movie with a great message about the importance of family traditions centered around food. Great to see the cast of older actresses and see their acting talent."
  },
  {
    "rating": "2/5",
    "review": "It's a Lifetime movie."
  },
  {
    "rating": "5/5",
    "review": "Worth the investment in the slow character development of the first 30 minutes or so. A movie for most of the family and certainly one virtually everyone with a family can relate to. It is such a treat to see so many talented actors and actresses from both today and yesteryear combined in this heartwarming feel good movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Beautifully warm, charming, and life-affirming. - It'll make you miss your granny's cooking."
  },
  {
    "rating": "5/5",
    "review": "I watched it with my family and it was so good.IT is heart warming, has some romance , and is perfect if you just wanna chill and watch a movie."
  },
  {
    "rating": "2.5/5",
    "review": "I grew up in the same neighborhood in Brooklyn at the same time. Although I liked the story, Vince Vaughn was unconvincing as a guy from that neighborhood. His performance detracted from th authenticity of the story. I wanted to like it but ultimately I found it mildly amusing."
  },
  {
    "rating": "5/5",
    "review": "A beautiful movie about a sons love for his Italian mother. Tim Treakle"
  },
  {
    "rating": "5/5",
    "review": "....and I'm not even Italian!"
  },
  {
    "rating": "5/5",
    "review": "What an awesome, heartfelt, enjoyable story/movie. No forced social/political stance storyline, like every show/movie seems to try and work in now. Just a nice nostalgic, family/friendship connection , forget about the world and enjoy a great feel good movie. Something everyone will like."
  },
  {
    "rating": "4.5/5",
    "review": "Comfort food turned TV."
  },
  {
    "rating": "5/5",
    "review": "What an absolute treasure! Being of Italian origin myself and having my own Nona, I am living in this movie. Joey is the kind of Italian child who was fortunate enough to have the kind of love and values family provides. If you’re an Italian you know what you know. I’m so glad this movie came to be. Its treasured messages should touch everyone who has the opportunity to witness it. Now I’m the Nona and I am so grateful for stories like this to be shared… even if for only the length of the film you’re lucky enough to feel… you’ll know. Thank you to everyone who worked to bring this story to life and to all the wonderful actors who gave of themselves to share."
  },
  {
    "rating": "5/5",
    "review": "This film felt very heartfelt in both the script and the performances. I greatly enjoyed the chemistry among the cast and the sweet nature of the story."
  },
  {
    "rating": "1/5",
    "review": "I thought it would be a good movie but it wasn't that good. It was really boring."
  },
  {
    "rating": "1/5",
    "review": "I love Vince Vaughn, I love this idea and I really wanted to love this movie, but i didn't. It was just too corny, and the stories of the \"nonnas\" were too contrived to be believable, and so were the \"problems\" with the inspectors - too silly for anyone who has any knowledge of construction. I would have said that it was an ok time waster, except that they deliberately put in an story in order to take a shot at the Catholic Church - and it wasn't even true ,in a movie that was based on a true story. No \"nonna\" left the convent to cook in that restaurant. So boring and stupid. Why bother to change the story for the sole purpose of degrading Catholics? When is Hollywood going to grow up? \"Bigotry is so wrong\" - unless it's against Catholics. Give me a break! Turn off your brain and watch the movie if you want - but don't say I didn't warn you!"
  },
  {
    "rating": "3/5",
    "review": "Moderately entertaining, tries too hard sometimes. And pretty difficult to watch anything with Susan Sarandon."
  },
  {
    "rating": "5/5",
    "review": "This is the first movie I’ve watched in a long time that I can say was fantastic. Very wholesome and just a feel good flick. Being based on a true story makes it that much better. Definitely recommend."
  },
  {
    "rating": "2.5/5",
    "review": "Eh. Was waiting for something heartfelt with comedy mixed in. It was neither. Kinda boring."
  },
  {
    "rating": "1/5",
    "review": "Confused and cliched. Handed a fantastic story and the writers squashed the life out if it. Then the actors managed to make the whole thing a watery, overcooked zucchini!"
  },
  {
    "rating": "5/5",
    "review": "As italian I felt our philosofy of food in this movie. Here in Italy food is lifestyle, love and, of course, friends and family. When I was a child, i ate bread and “ragù” sunday morning just like Joy. A real pleasure watching it"
  },
  {
    "rating": "3.5/5",
    "review": "'Nonnas' is a heartwarming and entertaining comedy drama that acts as a beautiful tribute to love, loss, and the power of food."
  },
  {
    "rating": "5/5",
    "review": "The minute the movie started, i knew it was going to be great. I saw myself as Joey surrounded by good people and good food. What a sweet movie. It had the perfect amount of laughter (which you did not know was coming) which made it even funnier! The sentimental moments were impactful as well as the inspirational parts of the movie. Grab you friends, and family and take a break from it all- Watch Nonnas!"
  },
  {
    "rating": "0.5/5",
    "review": "I enjoyed it up until the scene of the former nun talking about Lesbianism. Not suitable for a Catholic or wider Christian audience."
  },
  {
    "rating": "3.5/5",
    "review": "Very very cute. A man's dream to build a restaurant with nonna's as cooks. Why? Family. Home. Best recipes. Love. Of course, I love Italian food...so that gained an extra 1/2 star."
  },
  {
    "rating": "5/5",
    "review": "This is one of the most heartfelt films I’ve ever seen. This movie understands that grief doesn’t have a timeline. I miss my mom and dad so much and watching this made me remember every funny, beautiful thing about them. My parents used to argue because when it was my dad’s night to cook, he’d open a can of cream of asparagus soup, throw in a few actual asparagus spears, and call it dinner. And my mom, she always used at least two pots and pans, no matter what she was making. She was so much like Lorraine Bracco in this movie. Strong, funny, no-nonsen,but with the biggest heart. Thank you for making something that felt this personal."
  },
  {
    "rating": "5/5",
    "review": "I loved perks of being a wallflower and wonder, so I was excited when I saw Stephen Chbosky had a new movie. I was even more excited because it was about Italian grandmothers. I watched it on Mother’s Day with my mom, my Grammy, and my four aunts. We laughed so hard and we cried more than one time. There are a few movies I could watch with my Grammy. And even fewer that make us hug each other afterwards. This film did all that. You have to watch it. You will love it. Apparently it was written by Stephen’s wife. I looked her up on IMDB. She’s done some quality stuff. Now I will look forward to everything she writes."
  },
  {
    "rating": "1/5",
    "review": "This is like a Hallmark movie only the acting, writing and plot development aren't as good. What an embarrassment for everybody involved in this pulp. The only thing funny about it is Vince Vaughn's constant happy face and demeanor."
  },
  {
    "rating": "3/5",
    "review": "It's one of those movies that'll make you wanna hug your family. Such a good movie with a good message."
  },
  {
    "rating": "3/5",
    "review": "I’m sorry but…who’s writing these reviews and thinking, “This deserves a high review. A masterpiece.”? It’s okay at best. Have you ever been in a kitchen? It’s chaos!! Idk. I just feel like it’s a “feel good” piece and they miss the marks on a lot of things"
  },
  {
    "rating": "5/5",
    "review": "I felt it was a great movie-- hit all the legitimate points of what a truly great movie should be. These greats are few and far between these days--A MUST SEE!"
  },
  {
    "rating": "5/5",
    "review": "Made an account just to write this review, what a beautiful movie that captures the essence of the Italian American spirit. My family came from Italy and settled in Philadelphia. That being said, this was incredibly nostalgic for me and felt truly authentic. I was happily surprised that it's based on a true story as well. Bravo to everyone involved! Another Vince Vaughn movie that does not disappoint!"
  },
  {
    "rating": "5/5",
    "review": "A perfect movie about growing up Italian and missing the love language of the food prepared by those who love you. I laughed, I cried, I miss my Noni's cooking."
  },
  {
    "rating": "4/5",
    "review": "I was emotionally engaged & entertained, I would recommend it, and I would watch it again with somebody. That's why I'm giving it 4 stars. I took the pilgrimage to Staten Island to eat there. It's a short walk from the ferry. It's a small and intimate space. You can watch the nonnas cooking. There is a special quality about eating at Enoteca Maria. The movie captured some of that for me."
  },
  {
    "rating": "5/5",
    "review": "I loved everything about this movie! It's the first time I've ever liked a character played by Vince Vaughn. The entire cast was exceptionally charming. We need more feel good movies like this one."
  },
  {
    "rating": "5/5",
    "review": "Finally, a movie you can watch with everyone in your family. With all the negativity going on in our country today, Nonnas was right on time! It was sweet, sentimental and just made me feel good inside. There isn't anything currently out there that captured the beauty of family, food and real friendship like Nonnas. Make time to watch this-You will not regret it!"
  },
  {
    "rating": "3/5",
    "review": "I love the cast and they were all great as usual. The ladies really made me laugh! Vince was great as well and he was the main reason I decided to give this movie a try. Unfortunately, it was a little slow for me, but it was a nice story. I’m not sure why they didn’t call the restaurant “Nonnas”, it just had a better ring to it! I was really surprised at the end of the movie when they said it was based off of a true story. I wanted to give it more stars, but it’s just another love story, and made for a woman audience."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed this movie from the beginning to the end. It was funny, sad, inspirational-Everything about it was something i could relate to. Honestly, it filled my heart..will be watching again tonight."
  },
  {
    "rating": "5/5",
    "review": "Nonnas is an extremely well written and perfectly cast gem of a movie. It will make you laugh and cry and will also make you very hungry. I loved everything about it and know this will become a family favorite to be watched year after year."
  },
  {
    "rating": "5/5",
    "review": "Simples, singelo e ao mesmo tempo uma história que fica na sua cabeça para sempre"
  },
  {
    "rating": "5/5",
    "review": "Nonnas is a heartwarming gem that left me smiling through tears and craving a plate of homemade pasta. This 2025 comedy-drama, streaming on Netflix, is a love letter to family, heritage, and the messy, beautiful bonds that hold us together. Directed by Stephen Chbosky, the film follows Joe (Vince Vaughn), a guy in over his head when his Brooklyn pizzeria is taken over by a trio of feisty Italian grandmothers—played with irresistible charm by Brenda Vaccaro, Linda Cardellini, and Talia Shire. These nonnas don’t just sling dough; they dish out life lessons, sharp wit, and enough love to mend a broken heart. The story is simple but soulful: Joe, grappling with grief and a failing business, finds unexpected salvation in the nonnas’ old-school recipes and unfiltered wisdom. What could’ve been a cliché culture-clash comedy soars thanks to the cast’s chemistry and a script that knows when to lean into humor and when to tug at your heartstrings. The nonnas steal every scene, their banter as spicy as their marinara, but Vaughn’s understated vulnerability grounds the film, making Joe’s redemption arc genuinely moving. Cardellini’s dual role as a nonna and Joe’s sister adds layers of warmth, while Shire’s quiet strength is pure magic. The Brooklyn setting feels alive, with cozy visuals and a soundtrack of Italian classics that wrap you like a warm hug. The film celebrates Italian-American culture without caricature, weaving in themes of tradition and resilience that hit home no matter your background. At 104 minutes, it’s perfectly paced, leaving you full but not overstuffed. Nonnas is the cinematic equivalent of Sunday dinner at grandma’s—comforting, joyful, and unforgettable. Five stars for a movie that reminds us love and good food can fix almost anything."
  },
  {
    "rating": "4.5/5",
    "review": "I laughed, I cried, and can’t stop talking about this movie. Absolutely loved it."
  },
  {
    "rating": "5/5",
    "review": "I grew up in a similar environment with my Cuban family and slowly as age comes by, all of the representation of this movie has dissipated. Nonnas made me feel like I was 10 years old watching my grandmother and my aunties cook it up, while everyone is just having a marvelous time. This film is full of heart and soul. For those who may find that it repeats its points too many times, keep in mind, its not always easy to keep a positive mindset and the reminder of family, tradition, and the impact that it can have on others serves as fuel to keep us going when things are not looking up! Amazing amazingly♥️"
  },
  {
    "rating": "5/5",
    "review": "This film had me crying thinking of my mom who passed away last year and laughing at all the stuff she would find funny. Brenda Vaccaro is exactly my mom's mom, my Nonna (even down to the spitting). Nonnas made me feel like my mom was watching it right next to me. MUST WATCH"
  },
  {
    "rating": "3/5",
    "review": "Good enough. Could have been great. Drea de Matteo wasn't pulling it off. Susan Sarandon's character was forced. The bright spot was Brenda Vaccaro. All in all, a sweet and original theme. Just poorly executed by most of the cast."
  },
  {
    "rating": "4.5/5",
    "review": "How movies used to be made. Classic and heartwarming."
  },
  {
    "rating": "5/5",
    "review": "LOL, so ****ing funny!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "4/5",
    "review": "Its a heartwarming movie."
  },
  {
    "rating": "1/5",
    "review": "Pushed acting- you can see the acting, which makes it very uncomfortable for me to watch. Really too bad this movie was not edited correctly, and the script was not written in such a way that made the whole movie feel like one story. It seemed like they were skits created for the grandmother’s to argue in fight. That was really overacted also. The idea was great, but the execution was not. The beginning and the end of the movie were the best parts. Probably ending was the best. I looked forward to seeing this movie and wanted to like it. Really love the story or the idea of a story but I think it failed as a movie."
  },
  {
    "rating": "2/5",
    "review": "The cast of great actors put no real feelings into their roles. Just a group of actors getting a paycheck for their days of work. A good store, juts poorly directed or written or something. Just couldn't fall in love with the movie. Why does an old car love brand new? Gives the moviegoer the feeling or watching a first year director with season actors and not giving them a better why of doing the scene. Why did the main actor kiss the married lady near the end of the movie?"
  },
  {
    "rating": "4.5/5",
    "review": "One of Vince's best movies, a nicely paced story about great women and bringing people together over food. Wonderful to see the stellar cast."
  },
  {
    "rating": "4/5",
    "review": "What a great story with lots of sadness, but hope is everlasting. I think this is Vaughan's best movie he's acting in."
  },
  {
    "rating": "4/5",
    "review": "So many films nowadays are all about action and avoidance of death. I decided to overlook any stereotypes or pre conceived notions about Nonnas, and allow myself to thoroughly enjoy this film. And it worked! The acting is heart-felt, and ultimately, it was a welcome distraction in a troubled world."
  },
  {
    "rating": "2/5",
    "review": "I consider the above rating very generous. As a 2nd gen Sicilian who enjoys cooking, dining, reading, and films related parallels, this film could easily have been a positive reinforcement. However, it is repeatedly choked by annoying, pretentious stereotypes, essentially attempting to disguise a weak storyline development. Oh, the love interest masks herself with wedding rings, or we get repeated Capuzzella references, which my mom used to cook butterflied with doors locked and promises of secrecy. Both regional and borough orientation tensions become tired clichés rather than subtle distinctions. Near-tragic, often long-term familial thorns are simply glossed over or quickly solved. Overall, a near waste of some talented thespians."
  },
  {
    "rating": "5/5",
    "review": "A good heartwarming drama movie. Great cast, good writing, good direction."
  },
  {
    "rating": "3/5",
    "review": "Your table is waiting. Nonnas is a 2025 American comedy drama film directed by Stephen Chbosky 🍝 Although not perfect, this simple feel good movie has a good heart… Not bad, but not my favourite either 😉It’s ok, but I feel mixed about this one 😉I’d recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼 After losing his beloved mother, a man risks everything to honor her by opening an Italian restaurant with actual nonnas — grandmothers — as the chefs."
  },
  {
    "rating": "4/5",
    "review": "So I’ll start by saying I’m an Italian American who lost their grandma last year. I’m beyond the ideal audience for the movie. I think it was incredibly sweet and full of heart. Was it perfect? No. But if you have an Italian grandma, you know that perfection is never to be expected (except by them). If you feel that food can be an expression of love, you’ll appreciate this movie. Sit back with a full stomach, a nice bottle of wine, and enjoy."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie if you are a thinking adult with life experience and you actually watch the entire movie."
  },
  {
    "rating": "0.5/5",
    "review": "Filmed so dark I turned it off after 10 minutes."
  },
  {
    "rating": "0.5/5",
    "review": "Wow, total trash movie. The story suggests Vince is some young hardworking guy who's never had a girlfriend or wife. \"I don't want you to end up sitting in that chair watching Yankees games when you're 60!\" Vince is 55. The story is as stale as the washed up actors mailing it in every scene. Dead Internet Theory propping up the ratings."
  },
  {
    "rating": "4/5",
    "review": "sweet movie about grandmas. vince plays vince and the bracco woman was qute something when she was a baby. linda cardellini still a 50 year old hottie. you could watch this."
  },
  {
    "rating": "4/5",
    "review": "Great movie with a great cast."
  },
  {
    "rating": "4/5",
    "review": "Predictable… but who cares. The ride to the end is more than enjoyable."
  },
  {
    "rating": "1.5/5",
    "review": "Lazy writing and acting feels forced. Not a good film"
  },
  {
    "rating": "5/5",
    "review": "What a wonderful and warm film. A beautiful testament to the magical ability of food to be a love language and a celebration of tradition and family. Vince Vaughn finds the right note in this film alongside the fabulous group of Nonnas. Loved it."
  },
  {
    "rating": "5/5",
    "review": "Top of the rewatchable list. Finally a positive movie with family values, showing the importance of culture handed down by generations. Wish Hollywood made more of these. The movie itself is calm and character driven, building over time. Has drama, comedy, and suspense. Cleverly timed for Mother’s day but will be watching again all year."
  },
  {
    "rating": "5/5",
    "review": "Such a beautiful movie! As an Italian-American, it felt so close to my real-life experiences growing up with my Nonna. To know it is a true story makes it even more wonderful. The scene in which the real owner of the restaurant is featured behind Vince Vaughn was so well done. Such a beautiful concept for a restaurant, made beautifully into a movie. Well done!"
  },
  {
    "rating": "5/5",
    "review": "What a great movie! I like that it brought the meaning of family and the importance of helping each other as a community. My favorite actor is Vince Vaughn and he did such a good job. The actors were selected so carefully that really fit the characters and it felt like I was watching the real people it was based on. I thought the food fight was so fun! The movie did such a great job of showing what it means to be a true friend, and to not sacrifice friendship over material things. I also loved seeing the real people at the end that the movie was based on. I really think this movie needs to be seen by a lot of people today and has such a meaningful message about community, meaningful friendships, and family"
  },
  {
    "rating": "2.5/5",
    "review": "I semi loved this movie. The writing was simultaneously fresh and nostalgic. The acting was terrific and the characters were absolutely believable. But why, seriously why were the inside shots so dark you could barely see faces let alone anything about the set details??? Why???"
  },
  {
    "rating": "0.5/5",
    "review": "Helplessly boring. I couldn't bring myself past.the first 30 minutes. I feel like the only reason it has the current ranking is from influencers attempting to convince people it is good. So dry I had to bathe in moisturizer."
  },
  {
    "rating": "4/5",
    "review": "Watched it with my mom on mother’s day, heart warming story that brings families together, only reason why it gets 4 and not 5 stars os the ending is drawn out which only makes it confusing but it isn't the most complicated plots to begin with"
  },
  {
    "rating": "0.5/5",
    "review": "After 10 mins I had to check rotten tomatoes to check this was actually a comedy. 80% scores so I persisted figuring it would liven up. Wow was I wrong. As a comedy. It fails to be funny. As actors, they mostly fail to act. As a movie, it forced me to move off the couch to do something else."
  },
  {
    "rating": "5/5",
    "review": "I think its an awesome movie for family's to cherish and watch with there family this mothers day as it is mother's day weekend. also we can all learn alot from our grandmother's and mom's from being in the kitchen its a great movie would recommend To any one who wants to watch a good movie so grab your mom's and grandmother's and make popcorn and and grab a soft drink at home and enjoy this movie . And put down the cellphones"
  },
  {
    "rating": "5/5",
    "review": "As an Italian, I identified with many of the cultural references and this movie brought back many fond memories of my family. The acting was top notch and the chemistry between the actors was excellent. The fact that this was based on a true story, made it even better. Bravo!"
  },
  {
    "rating": "5/5",
    "review": "Wonderful film! Great story, the acting, and setting. Love it!!"
  },
  {
    "rating": "4/5",
    "review": "Enjoyable. You should watch it. Contrived plot? Yes. Good acting? Yes."
  },
  {
    "rating": "2.5/5",
    "review": "A cute and heartwarming story, but I couldn’t get over how bad some of the acting was. Vince Vaughn and Loraine Bracco were hard to watch, but the rest of the characters were cast perfectly!"
  },
  {
    "rating": "5/5",
    "review": "Wow a great sweet movie. Warmed our Saturday night!"
  },
  {
    "rating": "5/5",
    "review": "I'm not sure that anyone who did not grow up with a Nonna will appreciate how truly special this is. Even more, that it is based on a real person and a real restaurant. I lost my mom in February and this is my first Mother's Day without her. My heart is hurting, yet, as I watch this heartwarming movie, I'm transported to my childhood. With tears in my eyes and a lump in my throat... this totally hits the mark."
  },
  {
    "rating": "2.5/5",
    "review": "\"Nonnas\" is a lighthearted comedy set to be released in 2025, featuring Vince Vaughn, Linda Cardellini, and Susan Sarandon. The plot centers around Vaughn's character, who dreams of opening a restaurant that serves dishes prepared by local grandmothers, aiming to evoke a sense of nostalgia and comfort for diners. Throughout the film, he faces numerous challenges, including passing health inspections, securing funding, managing his day job, and exploring a budding romance with the character played by Cardellini. While Vaughn's comedic style has its charm, I find it hard to take him seriously in this role, as he has a history of portraying unconvincing characters. In my opinion, a different lead actor might have brought more depth to the emotional connection with his grandmother and mother, which is central to the story. Overall, \"Nonnas\" is a decent watch. It’s not a complete disaster, and it's available on Netflix, so I’d suggest giving it a try if you're looking for something to enjoy. However, Vaughn's performance felt somewhat lackluster to me, lacking the emotional weight needed. Additionally, Sarandon’s character, a hairdresser, is oddly reduced to discussions about her appearance rather than being given a more substantial role, which seems out of place for such a renowned actress."
  },
  {
    "rating": "4/5",
    "review": "The perfect heartwarming Netflix movie for Mother’s Day weekend! Director Stephen Chbosky’s Netflix comedy-drama Nonnas (2025) is certainly a pleasant surprise. Chbosky’s direction keeps things light and family oriented. His respect for his characters, their families, and Italian traditions is all nice. Writer Liz Maccie’s script is very kindhearted and funny. She comes up with a bunch of fussy Italian grandmothers and their families for a riot of a kitchen comedy. It’s like Chef or any other number of family comedies, but with a wonderful ensemble cast. Vince Vaughn is surprisingly touching as the grieving Joe Scaravella. He gets to flex his dramatic chops here in an unusually compelling serious role. Seeing him bumble with setting up an Italian restaurant. Michael Rispoli is good as the ultra serious Al, who is skeptical of Joe’s designs for his Italian restaurant. Campbell Scott gets a neat cameo as Edward Durant. Susan Sarandon is still a smokeshow as the hilarious and endearing pastry chef Gia. The humor based around her voluptuous figure and low cut shirts is hysterical. Lorraine Bracco is funny and moving as the lively Roberta, who takes up being a chef to get out of the retirement home. Bracco gets to be the angry Sicilian chef in the kitchen. She can still act well and it’s nice to see her after The Sopranos. Talia Shire is fantastic as the sweet and shy nun turned chef Teresa. She’s very lovable and a nice foil for the other more excitable grandmothers. Brenda Vaccaro is likable as elderly lady Antonella. She’s quite bubbly as the grandmother from Bologna. She goes from grumpy to happy as a chef. Linda Cardellini is lovely, pleasant, charming, funny, and natural as Joe’s love interest Olivia. She comes across as so sweet and genuine. Cardellini brings out Vaughn’s warmer side. Drea de Matteo is gorgeous, tough, and caring as the fiery Stella. She’s so skeptical, funny, intense, and sexy that it’s like she’s still portraying Adrianna La Cerva on The Sopranos. I appreciate that she gets to worry and be genuinely concerned for Joe. Her astonishment at Joe’s ideas is quite fun. Joe Manganiello is fun as the flippant best friend Bruno with an attitude, pragmatic approach, and blunt manner. Overall, Nonnas is a cute and charming 114 minutes with a delightful ensemble."
  },
  {
    "rating": "5/5",
    "review": "Finally a good NEW movie that I enjoyed very much."
  },
  {
    "rating": "5/5",
    "review": "Although the storyline is predictable, it is very tastefully done. Such a wholesome movie, lots of laughs (and tears!) and an enjoyable watch. The cast were great too, Molto Bravi! Great job Mr, Vaughn! 🍅"
  },
  {
    "rating": "3.5/5",
    "review": "Great story, but the lighting is awful on Netflix and the entire movie is darkened."
  },
  {
    "rating": "1/5",
    "review": "I really wanted to give this a chance cos I love Susan Sarandon… but it’s a terrible movie… so much so I couldn’t carry on after 45 mins… particularly because Vince Vaughan is in it too… how is he still in movies? - he is one of the worst and most annoying actors ever."
  },
  {
    "rating": "3/5",
    "review": "It was a cute movie. Being based on a true story made it better. The performances were very good and nice to see some older stars show up. Good movie for a night of wholesome entertainment."
  },
  {
    "rating": "4/5",
    "review": "It’s a feel-good movie just in time for Mother’s Day. Great cast, so you’re sure to see at least one of your favorite actors or actresses. I’ve been to the real Enoteca Maria three times, so now I want to go back and ask Jody (the real “Joe”) how much of the backstory is true to life."
  },
  {
    "rating": "3.5/5",
    "review": "Thoroughly enjoyable, great movie for family and group watching."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I have seen in awhile. It’s heartfelt and wholesome. Hits you in the feels. It made me tear up and smile. So good."
  },
  {
    "rating": "2/5",
    "review": "very movie of the week, what it lacks in authenticity it makes up for in saccharine sweet vibes."
  },
  {
    "rating": "4/5",
    "review": "The real story here is friendship, commitment, and that oldsters with talent can make a great team: loved it! It also made me so hungry; I pulled-out all my Italian recipes --- this octogenarian will be cooking my beloved Mom's pasta sauce recipe ASAP."
  },
  {
    "rating": "2.5/5",
    "review": "It has that underdeveloped, uncomplicated, and unrealistic feel of a typical quickly churned out Netflix movie. So ridiculously stereotypical I’m surprised that it didn’t end with them all singing along to Frank Sinatra's \"My Way\". BUT it’s still worth a watch, very sweet and enjoyable with solidly middle of the road performances. And somewhat better than many of Netflix's production-line movies."
  },
  {
    "rating": "1/5",
    "review": "Vince being tha same character as always lately. Writing like a bad sitcom. A tiny dash of reality would have been appreciated. Dont normally do reviews but wanted to save one person. Bad Editing, bad cinema photography, maybe it is well balanced? Watch one of 100 other made for TV movie Netflix is churning out."
  },
  {
    "rating": "4/5",
    "review": "Well done sentimental story of an Italian restaraunt owner, featuring food prepared by loving, real life Italian grandmas, or “Nonnas”. All star cast."
  },
  {
    "rating": "1/5",
    "review": "Weak sauce. Like a can of spaghettiOs when you want pasta Bolognese. Don’t bother."
  },
  {
    "rating": "4/5",
    "review": "I knew about this resturant after watching CBS Sunday morning, so I was very interested in the back story, which was EXCELLENT in the movie! If I lived in NY, I would definitely make a reservation!! I swear I could smell those great dishes through my television! Italian families, especially when it comes to FOOD and Nanas' cooking really made me miss my mother! She was a WONDERFUL cook and LOVED serving her chopped liver, chicken soup and all the rest to our family when we went to NY for a visit. My 3 daughters have carried her recipes into their homes today - for their husbands and 2 kids (each) Knowing this is a REAL story made it all that more entertaining - LOTS of FOOD and LOTS of LOVE coming from that kitchen."
  },
  {
    "rating": "3/5",
    "review": "Nonnas is the kind of film you can watch with your grandmother and both feel-good by the end. There are no stand-out moments or scenes, no major acting challenges, but the cast is likable across the board and they give the film its necessary charm. I laughed out loud once or twice and heard myself “aw shucks” a time or two, so you know this movie hits you in the feels. The direction is pedestrian and doesn’t reach the melodious heights of Stephen Chbosky’s first film (The Perks of Being a Wallflower), but overall it works for this material. Do I think I will watch this again? Probably not. I wouldn’t call it delicious entertainment, but it’s certainly not a dish served cold."
  },
  {
    "rating": "5/5",
    "review": "I have never in my life reviewed a movie, but I just had to give this movie the credit it deserved. Amazing movie! It was such a long time ago i felt this happy from a movie. Vince vaughn is what I came for but the family is what made me stay!"
  },
  {
    "rating": "5/5",
    "review": "This was an awesome movie 🎥"
  },
  {
    "rating": "5/5",
    "review": "Watched this last night, made me laugh and cry about 10 times. Best film I’ve watched for years! Vince is back! One of those films that hits you hard without trying too hard."
  },
  {
    "rating": "5/5",
    "review": "Movie was exceptional and acting superb, had me hooked from the very beginning, feel good story that will really give the spirit a lift, outstanding acting from Vince Vaughn and a star studded cast as well."
  },
  {
    "rating": "4/5",
    "review": "Good food, great atmosphere, heart-warming personalities and simple laughter. It is all you want in an authentic and amazing Italian restaurant in NYC and this film is all of those things. It made me want to hug my mama as soon as the credits rolled."
  },
  {
    "rating": "5/5",
    "review": "First of all, if you are Italian American and love your family, this movie will feel like being in the kitchen with them. If you’re not Italian American, and you love your family, this movie will feel like being in the kitchen with your family. From beginning to end this movie makes you feel good. It’s Vince Vaughn bringing such humanity to an every man. He has the rare presence of a movie star every time he’s on screen. The NONNAS (Brenda Vaccaro, Lorraine Bracco, Talia Shire, and Susan Sarandon) are four of the greatest Italian American actresses ever. They are cinematic royalty. They are as iconic together as they are hysterical. They will make you laugh, chair, and cry. The film is also timeless and has echoes of all the classic Italian American stories. I always stop movies when I watch them at home to get a snack, I did not stop this movie once. I was so taken into this world by the writing, the directing, and the warmest acting. You want to watch it a few times and at one time or more you’ll want to watch it with your mother or your Nonna."
  }
]