{
  "movie_name": "Novocaine",
  "reviews": [
    {
      "rating": "4.5/5",
      "review": "Steven's review says it. Very well-made, smoothly cut action-movie. Violence (extreme) with a sense of humour? Very tricky premise, but here it works. Jack Quaid is great, good chemistry with Amber Midthunder."
    },
    {
      "rating": "4/5",
      "review": "Over the top in the best way. A quick fun ride"
    },
    {
      "rating": "4/5",
      "review": "Something different for sure which is nice. Laugh out loud hilarious at times. Worth a watch."
    },
    {
      "rating": "0.5/5",
      "review": "I am starting to feel like Hollywood is playing a big joke on us all. The trailer gave me pause...however I went against my gut feeling and watched it anyways. Quaid is great in The Boys... however how did this gain an 85% rating on this site? Did people rate without watching based on Quaid? When will these companies understand that we want real reviews....\"here's looking at you Yelp\"! Watch the trailer, then reduce your expectations by 150%....then watch it! You know, because \"it got such a high rating\"! Even if you do that, you will still be disappointed, that of course in less you are a BOT or Paid Reviewer. Yes, I can tell the difference between a good movie I don't like that is good and from one that is bad. This is bad. Consider yourself warned."
    },
    {
      "rating": "1/5",
      "review": "Bad movie, bad acting, tried entertaining with blood and it wasn't it"
    },
    {
      "rating": "1/5",
      "review": "There are soooooo many things wrong with this movie."
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this movie. Comedy, action, romance, genetics, and a bit of gore."
    },
    {
      "rating": "4/5",
      "review": "It surprises me when I discover movies like \"Novocaine\" but what really surprises me is the lack of attention that this movie got, it deserves more. I had a blast and unexpectedly enjoyed every single minute."
    },
    {
      "rating": "2.5/5",
      "review": "A man cant feel pain but when would be robbers take his sort of girlfriend hostage he decides to go save her.....he may not feel pain but his body at the end of the film says differently."
    },
    {
      "rating": "1/5",
      "review": "Unnecessarily gratuitous, but not creative in the mutilations. Budget was obviously low, script, research, and characters were weak. Was not fun to watch. It was bad enough to make me create an account and review a movie for the first time in 40 years."
    },
    {
      "rating": "2.5/5",
      "review": "Interesting concept but I believe they could have explored it more. Thought it could of had more humor, related to the concept. Overall, Disappointed."
    },
    {
      "rating": "2/5",
      "review": "Jack Quaid is really good on this, but I couldn't laugh."
    },
    {
      "rating": "3/5",
      "review": "Meh, I can see why it didn't do well in theaters. Quaid was decent (ish) in it, though. Otherwise, typical modern demographic tropes and goofy body gags you'd expect from such a premise."
    },
    {
      "rating": "4/5",
      "review": "A fun, action packed comedy that is filled with laughter, emotions, and raw, gory action. Loved it!"
    },
    {
      "rating": "5/5",
      "review": "This movie had me in a twist. Absolute must see. I haven’t grasping my chair for an entire movie for a very long time. This was truly a comical action film I needed for the weekend."
    },
    {
      "rating": "5/5",
      "review": "Likeable protagonist and despicable antagonists. A fun action movie with some gore, but nothing disgusting. I had a great time !"
    },
    {
      "rating": "1/5",
      "review": "This movie should be a case study in great concept/poor execution. Just another lazy Hollywood screenplay… Maybe with writers who could combine an interesting sub-plot, intelligent bad guys, and a little help from someone with even minuscule knowledge of police procedure, we could’ve had something here."
    },
    {
      "rating": "2.5/5",
      "review": "Good action but it was pretty silly. Just because he can't feel pain doesn't mean he can't get hurt or bleed to death. Also, the main villain just getting back up at the end was really stupid but funny. For me the best part of the movie is Amber Midthunder. Just cute AF."
    },
    {
      "rating": "3.5/5",
      "review": "Did NO ONE ELSE catch the “Airplane” movie reference?!? HILARIOUS!!! Also Freddie Z below me? Gross dude…"
    },
    {
      "rating": "5/5",
      "review": "A good original idea! Some great action and twists too."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie so much. A real sweet love story lol"
    },
    {
      "rating": "4/5",
      "review": "For a thriller/comedy.....that was top notch ✌🏾"
    },
    {
      "rating": "3/5",
      "review": "The first 20 minutes are practically unwatchable; I was about to turn it off. The rest of the movie is a fun and campy action movie. Until the ending (when the action stops) - then it sucks again."
    },
    {
      "rating": "4.5/5",
      "review": "Corny at times but nonetheless a fun nail biter. Think \"True Lies\" meets \"Taken!\""
    },
    {
      "rating": "3/5",
      "review": "An ok B-movie with some fun action and a thiner than hair plot. Jack Quaid plays pretty much the same role as in the serie The Boys. If you like him there, you will like him here... If you find him annoying in the serie, which is my case, the movie won't really make it for you."
    },
    {
      "rating": "4/5",
      "review": "When you want to watch a fun action film that just doesn’t take itself seriously, you want a “Novocaine”. Breezy, at times a little gross, but non-stop action in an otherwise small story. The actors make it work and Jack Quaid shows he has range from being a good, down to earth guy here to exhibiting a sinister side in “Companion”. Nicholson is a bit over the top, but there’s a certain campiness to the aesthetic of the film that fits. And it’s totally re-watchable entertainment."
    },
    {
      "rating": "5/5",
      "review": "Prey bad ass an boys hughie have great chemistry in this crazy shootem up love story. I think Midthunder going to be a big star an Jack already has that in his blood . Some of the scenes were far fetched like cops dropping their guns . Still really enjoyed this film ."
    },
    {
      "rating": "3.5/5",
      "review": "Seeing a man without pain go through a 90 minute emotional hero journey really was a highlight so far this year. I FELT the emotion."
    },
    {
      "rating": "4.5/5",
      "review": "What an absolutely entertaining movie. Jack Quaid is hilarious and plays this character like a boss. Tim Treakle"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed it. It's comical at times, it's serious, and it's romantic in a crazy way."
    },
    {
      "rating": "4/5",
      "review": "Fun movie with good action and heart."
    },
    {
      "rating": "3/5",
      "review": "Solid film. Keeps you entertained throughout. Story line gets a little repetitive but not mad I checked it out."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie! This movie has action from beginning to ending. But the action is some of the oddest, and strangest, you will ever see. Funny as Hell too! I highly recommend that you see this movie! 👍😂"
    },
    {
      "rating": "4.5/5",
      "review": "Solid movie that has comedy, action, and violence all together making the story engaging and exciting. I'm no Sherlock Holmes so maybe this doesn't mean anything but I didn't see the little plot twist in there coming. Though of course it is unrealistic its still a fun movie that doesn't take its self too seriously. I would definitely recommend it."
    },
    {
      "rating": "4.5/5",
      "review": "Jack Quaid. No one could have played the role better. It was all him!"
    },
    {
      "rating": "2.5/5",
      "review": "Not much story or comedy in this movie. Jack Quaid has potential but not a leading man or person like his parents were, and sadly this movie relied on his talent. Never lived up to the trailer and fell very short of expectations"
    },
    {
      "rating": "3/5",
      "review": "An average comedic action film with all actors involved doing a grab bag of their most recognizable character types. You won't really find anything inspiring are new in here but its a well made one of those."
    },
    {
      "rating": "2/5",
      "review": "Interesting plot, some unforgivable plot holes. At times I was enjoying myself, other times I felt insulted."
    },
    {
      "rating": "4/5",
      "review": "Actually a pretty fun action/comedy, Quiad portrays the goofy and likable characters very well."
    },
    {
      "rating": "4/5",
      "review": "Not perfect with a soft plot and a few parts dragged a bit, but this was a fun one overall."
    },
    {
      "rating": "4/5",
      "review": "(CASTELLANO) Una comedia de acción alocada, macarra y sorprendentemente tierna, 'Novocaine' es de esas películas que no buscan cambiar el cine, pero lo pasan tan bien con lo que hacen que terminan ganándose al espectador. La idea central tiene gancho: un tipo que no siente dolor se ve envuelto en una cadena absurda de violencia cartoon, con un romance inesperado de por medio. Podría haber sido una tontería sin alma, pero entre el ritmo, el humor y un reparto con química, funciona. Jack Quaid está realmente bien. Cada vez más natural, más cómodo, más graciosamente torpe, se ha ganado a pulso un hueco en este tipo de cine. Y la chica (Amber Midthunder, inolvidable en 'Prey') le aguanta el tipo sin problemas, aportando fuerza, carisma y una presencia que llena la pantalla. Juntos hacen creíble una historia que, de entrada, no debería funcionar. No todo está tan afinado. El segundo acto flojea un poco, y hay momentos donde la película se repite o se vuelve más convencional. Pero tiene suficientes buenas ideas, escenas divertidas y personajes entrañables como para compensarlo. Y ese toque de violencia exagerada que, lejos de molestar, ayuda a mantener el tono desenfadado. Sin ser perfecta, 'Novocaine' es una de esas gratas sorpresas que mezclan acción y comedia sin caer en lo tópico. No inventa nada, pero tiene claro lo que quiere ser. Y eso, a veces, es justo lo que uno necesita. (ENGLISH) A wild, rowdy, and surprisingly tender action comedy, Novocaine is one of those films that doesn’t aim to change cinema, but has so much fun doing its thing that it ends up winning the viewer over. The central idea is catchy: a guy who doesn’t feel pain gets caught up in an absurd chain of cartoon violence, with an unexpected romance along the way. It could have been a soulless gimmick, but thanks to its pace, humor, and a cast with great chemistry, it works. Jack Quaid is genuinely great. He’s becoming more natural, more at ease, more charmingly clumsy—he’s truly earned his place in this kind of film. And the girl (Amber Midthunder, unforgettable in Prey) holds her own without a hitch, bringing strength, charisma, and a presence that lights up the screen. Together, they make believable a story that, at first glance, shouldn’t really work. Not everything is so finely tuned. The second act sags a bit, and there are moments when the film gets repetitive or slips into more conventional beats. But it has enough good ideas, fun scenes, and endearing characters to make up for it. And that exaggerated violence? Far from annoying—it actually helps keep things light and playful. It’s not perfect, but Novocaine is one of those pleasant surprises that mix action and comedy without falling into cliché. It doesn’t reinvent anything, but it knows exactly what it wants to be. And sometimes, that’s just what you need."
    },
    {
      "rating": "1/5",
      "review": "Boring. Dry..very dry joke. This movie is trying too hard to make a point without making any point.."
    },
    {
      "rating": "4/5",
      "review": "Jack Quaid seems to be on a hot streak. I’ll be honest- I wasn’t expecting much from this movie. While it is somewhat predictable, its well coordinated action scenes mixed with an endearing love story make it a solid movie. The two main characters are interesting and make a connection with the viewer, and the ending is satisfying- which for some reason is rare coming from Hollywood these days. Novocaine is definitely date night worthy."
    },
    {
      "rating": "2/5",
      "review": "I like the premise but the movie didn't meet expectations. Too much of it made no sense."
    },
    {
      "rating": "5/5",
      "review": "This film is everything you want to see in an action movie. Keeps you on the edge of your seat, roller coaster ride. Thrilling and amazingly funny. All out amazing cast."
    },
    {
      "rating": "5/5",
      "review": "A good movie, had a hell of a time"
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed the movie. Came in with mediocre expectations but it exceeded it!"
    },
    {
      "rating": "3.5/5",
      "review": "it was fine would have spent $5 on it, not $10 lol. Maybe I'm just not a big fan of dumb action movies."
    },
    {
      "rating": "4/5",
      "review": "Fun, simple and great quality."
    },
    {
      "rating": "3.5/5",
      "review": "Some of the action pieces are a little overwrought but Jack is funny enough to keep it all watchable"
    },
    {
      "rating": "4/5",
      "review": "We can call it a sick take on the comedy genre, and then while watching, this Action-Comedy becomes even more sicker and then it transitions to sicko fun. Jack Quaid's silly and friendly vibes also makes it work so well. 'NOVOCAINE' took action, comedy and a sprinkle of romance and infused it into this, not so perfect, but a watchable thriller. This movie has it's painful side too but it's painless side takes the lead. The movie began by unfolding some plot twists(which was very well done if you ask me). Jack Quaid took the lead and lead the casts on a painless ride to near-perfection. The whole story was silly, but surprisingly it works so well because of the direction it took. 'NOVOCAINE' is a good watch."
    },
    {
      "rating": "5/5",
      "review": "favorite movie of the year and loved the special effects!"
    },
    {
      "rating": "4/5",
      "review": "Jack Quaid was so good in this movie!"
    },
    {
      "rating": "4/5",
      "review": "It was fun. No saying I loved it but I found myself entertained at least. A laughed out loud a few times so it was worth the watch."
    },
    {
      "rating": "4/5",
      "review": "Generic but suprisingly amazing action film, Jack Quaid stars in this amazing action movie that just can't get hurt."
    },
    {
      "rating": "2/5",
      "review": "This movie is so painfully stupid."
    },
    {
      "rating": "2.5/5",
      "review": "Overkill with the uber-gruesome body destruction. Should've gone more for gags than fore. Quaid and Midthunder were good, as was Batalon continuing his Michael Pena-style comic relief sidekick. I was onboard with the extremes of his condition of not feeling pain, but of course they had to go too far into the ludicrous. The breaking of the arm was the last straw for me. Cheesy ending but another laugh or two as well. But credit for the stunts coordination and editing. 2.5 stars"
    },
    {
      "rating": "4.5/5",
      "review": "This movie is the best new action movie. It is very funny, while it is also packed with action filled scenes. Awesome plot."
    },
    {
      "rating": "1/5",
      "review": "Amber Midthunder's Sherry is the root cause of all the trouble, however, she escapes unscathed in the end. How? Nobody knows. The oversimplified premise that Jack Quaid's Novocaine does not feel pain gets hard to swallow, especially when the film enters into a quick series of extremely gross body piercings of arrows, knives, and other sharp metals. I just shook my head in disbelief when Novocaine appeared well dressed, healthy and all unscratched, smooth and smiling everyday guy at the end. That was too much to fathom! Cinematography and music, though, were impressive!"
    },
    {
      "rating": "1.5/5",
      "review": "Good for the first half of so, but then gets progressively more gratuitously violent and stupid. It falls apart rapidly, and they try to put it together at the end. They try. Uh, no."
    },
    {
      "rating": "4/5",
      "review": "Jack Quaid and Amber Midthunder were great! This movie was so surprisingly good. I almost did not see it because I thought it looked kind of silly, but there were so many excellent lines and the acting was very impressive. I think I need to watch it again because it was so fast moving and hilarious that I probably missed some of it while i was laughing. Very good. Definitely recommend!!"
    },
    {
      "rating": "3/5",
      "review": "A good concept that is executed well. Quaid is always a very charismatic and loveable character; I enjoyed his performance of the character whose nerves didn't work. Villain was really uninspired for me, I wasn't a super big fan of the twist, and I didn't find the comedy from the villain was hitting for me as others. I loved the action scenes, and the awkward fight moves that Quaid's character had though and overall, this was a good experience."
    },
    {
      "rating": "2.5/5",
      "review": "Love what with which Jack Quaid's been involved of late -- The Boys, \"Scream ('22)\", and at the absolute top o the list: \"Companion\" -- so I didn't hesitate jumping onboard with an action rom-com starring Lil Quaid. Unfortunately, it...just...didn't catch. JQ's his usual, delightful self, but it legitimately seems like that's all they were riding on for what COULD and -- in 2025 -- SHOULD/NEEDS TO be a smart, refreshing take on such a scenario. The elevator pitch of \"guy who can't feel pain embarks on mission to save girl\" plummets when you realize the movie THINKS it's being smarter than it is, and the parameters of Novocaine's condition lose flavor when interesting opportunities arise only to be repeatedly passed up for low-hanging fruit and (thus) dialogue regurgitated during a lunch break. It's not bad; it's just not good, either."
    },
    {
      "rating": "4/5",
      "review": "Very fun entry to action comedy, Jack Quaid and Amber Midthunder are fantastic, the plot is...present and unfortunately pretty transparent, the twist is pretty weak but the movie is a lot of fun."
    },
    {
      "rating": "2/5",
      "review": "I'm amazed the ratings are trending up. I barely finished this movie in 2 viewings. My wife dropped out during the first viewing. I like the actor. The dialogue was not great. But, the main problem is why do people like watching someone get hurt and tortured again and again? Because that's the main heart of this movie, watching gruesome injuries occur to one man, repeatedly. Why does this make a good movie?"
    },
    {
      "rating": "5/5",
      "review": "Jack Quaid. enough said"
    },
    {
      "rating": "3.5/5",
      "review": "***SPOILERS*** Novocaine is a mostly funny and entertaining movie with a pretty predictable story. The characters are likeable from the very beginning. Nathan is a great protagonist, he is just a regular and nice guy, who the audience can identify with in many ways. The story is good, but quite predictable. The dialogues are mostly funny, but sometimes a little corny, especially in the third act. On the other hand the big plot twist surprised me. I laughingly said that Sherry would be a government agent and it was funny and surprising to see that she's actually with the robbers. The cinematography is mixed, because the action scenes look amazing, but some of the quiet scenes look televisionish. The action sequences are very original and probably the best part of the movie. Jack Quaid and Jay Nicholson gave really good acting performances, they have great potential. Novocaine is a little more than generic and it's incredibly fun."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible movie. The relationship was too superficial and the fact that he couldn't feel any pain didn't bring anything special to the movie."
    },
    {
      "rating": "4/5",
      "review": "Very silly, very fun, fairly gory. Weird kind of gory splattlecore comedy action romp. Brain off enjoyable fun."
    },
    {
      "rating": "3.5/5",
      "review": "High Energy action film, not a deep plot but still a fun film."
    },
    {
      "rating": "4/5",
      "review": "This movies kicks a$$! I enjoyed it! If you want to watch a fun movie, that is action packed and has some comedy in it, this is your film!"
    },
    {
      "rating": "3.5/5",
      "review": "OK, negatives out the way, the \"twist\" was a bit obvious, the cops didn't really act like cops or, at least normally I expect them to be smarter and some of the story was convenient, written to see what unique ways he could be hurt rather than it making a good story. But the goods were great. The chemistry between the leads seemed authentic and natural, acting was good, it was well made, barring the above mentioned issues the story was fun and I had a great time watching"
    },
    {
      "rating": "3.5/5",
      "review": "In a good way some of the parts were difficult to watch. It's not really a comedy, but it is a refreshing alternative to slick action we see today."
    },
    {
      "rating": "3/5",
      "review": "Novocaine's script is a complete joke lol but it has a little charm in some moments, it also has a touch of generic film."
    },
    {
      "rating": "2/5",
      "review": "Interesting concept but everything was so predictable."
    },
    {
      "rating": "4/5",
      "review": "The First Movie I Saw Jack Quaid Was In Scream (2022). In Novocaine, Jack Quaid Perfectly Delivers An Action Packed Comedy With A Pitch Of Romance And Great Creativity."
    },
    {
      "rating": "0.5/5",
      "review": "Novocaine is an extremely sick and twisted film that spirals into chaos with little payoff. What starts as a dark comedy quickly devolves into a disturbing mess of absurd plot twists and uncomfortable scenes. It's not clever, it's not fun — it's just unsettling. The fact that Rotten Tomatoes has this rated so high is an embarrassment. Avoid it."
    },
    {
      "rating": "3.5/5",
      "review": "“Almost perfect” is the best way to describe Novocaine in two words. The film gets so much right — from well-executed setups and payoffs to the small, immersive details that make the story feel real. But one major choice holds it back from being a true 10/10. Summary Novocaine follows the story of Nate, a common banker who suffers from ‘Congenital Insensitivity to Pain with Anhidrosis.’ CIPA makes him immune to feeling pain and temperature, and Nate uses this ability to get his girlfriend back from bank robbers who have taken her hostage. Attention to detail Right from the start, the movie shows strong attention to detail — like the tennis balls on every corner in Nate’s home and office, and the fact that he drinks liquids with ice to avoid burning himself. These small but impactful choices make the film feel thoughtful and well put together. This attention to detail is also shown in how the movie takes the time to explain Nate’s motivation for trying to rescue his love interest (Sherry). Before she was kidnapped, Sherry and Nate had only been on one date. In most movies, the main character risking his life for a love interest he barely knows is just accepted as movie logic, but instead, Novocaine makes the effort to try to explain why Nate would do so. Novocaine does this through both its overall narrative choices and more subtle clues. The narrative choice that Novocaine makes is to give Sherry her own trauma. This gives her and Nate a common element to bond over quickly as they both hesitantly become more and more vulnerable with one another. Novocaine then further gives us a glimpse into Nate’s mind and justification through the use of ‘Earl.’ Earl is a character we meet early in the movie as we see Nate help Earl out with his financial problems after the death of his wife. When Nate and Earl talk about his recently deceased wife and how much he misses her, he says the line, ‘It would hurt the same if I had met her the day before.’ This one line is successfully used to justify the entire movie’s premise. It does not matter that Nate had met Sherry the day before; he cares about her just the same as he would have if they had met a year before. CIPA The movie also does a good job of avoiding its most obvious downfall: just because Nate cannot feel pain doesn’t mean he is invulnerable. A common mistake that many movies like this tend to make is to treat the character’s invulnerability to feeling pain as an invulnerability to getting hurt. Novocaine, for the most part, avoids this mistake. A majority of the wounds that Nate sustains are those that would hurt like hell for normal people but would not physically hinder them. The movie does stretch this limit as it progresses, but it does a good enough job of being realistic at the start, so by the end, the audience is willing to accept the lack of realism for the sake of the story the movie delivers. Though in Novocaine’s defence, when Nate starts receiving wounds which should physically hinder him from saving Sherry, he also uses EpiPens (pure adrenaline) to push himself to continue. So, at least, Novocaine does not completely ignore the physical effects that Nate’s wounds should have on him. The Character Arc An important element to every good movie is the ‘character arc’ of its main character. If the audience does not see the main character change by what happens to them, then the movie usually ends up feeling quite one-dimensional and lacking impact. Again, Novocaine does a good job of avoiding this pitfall. We, the audience, slowly see Nate go from this spineless man who is scared of everything that has the smallest chance of hurting him to a murderer- a justified one, perhaps, but still a murderer. Novocaine also does not make the mistake of showing this change as something instant. Nate does not become a full-fledged assassin after his first kill. On the contrary, his first kill leaves him disturbed and shaken by what he has done. Only by his third kill does the audience see him become comfortable with both what he has done and what he still needs to do to rescue Sherry. This gradual arc instead of a sudden change helps his character feel more real and not just a vessel for us to see Novocaine’s new idea (having a hero with CIPA). The Problem Now, to address the elephant in the room, the problem that stopped Novocaine from being a 10/10, Sherry is a double agent for the bank robbers. This was such a nonsensical decision in an otherwise perfect movie. It feels like one of those choices that a producer makes, a decision to add a twist to a movie where one was not needed. Novocaine could have been the perfect love story; Nate risking his life to save Sherry after one date is a bit nonsensical, but Novocaine recognised that and took the necessary steps to make sure that the audience is not left confused by this. Novocaine was doing everything right, and then someone- the director, producer, actor, whoever- wanted some kind of plot twist, so they tried to shove it into a movie where it simply didn’t belong. The added problem to this decision is that, Sherry being a double agent is revealed early in the movie. This then has the unfortunate effect of degrading the rest of the movie as the audience is left wondering why they made Sherry a double agent and are less focused on the other thing that Novocaine does right. Conclusion In conclusion, Novocaine is worth watching at least once. In a landscape full of movies that seem to copy each other and try to recapture the magic of movies past, Novocaine avoids almost every single cliche and common pitfall to deliver a fun and, most importantly, unique experience. But the one mistake it makes ruins its entire narrative and leaves a sour taste in the audience's mouth. Personally, I absolutely loved the movie. It was something new and exciting, but I will never go out of my way to watch it again. The plot twist adds nothing to the movie but is certainly irritating."
    },
    {
      "rating": "4.5/5",
      "review": "Really liked this film, funny and fast with some twists and turns. If you get an opportunity give it a try!"
    },
    {
      "rating": "4/5",
      "review": "As funny action comedy, it proved to be realistic, especially with the ending"
    },
    {
      "rating": "1/5",
      "review": "If TEMU made movies…they would be exactly like this( bad acting, bad script even worst directing )"
    },
    {
      "rating": "2.5/5",
      "review": "with a charming concept, the 'shtick' fell flat pretty quickly some cool twists that made it interesting, but more a waste of a few hrs."
    },
    {
      "rating": "3.5/5",
      "review": "A mid to low budget concept-driven action film that may not stand out in any particular aspect, but boasts a high level of overall execution — making it a perfect choice for a weekend watch."
    },
    {
      "rating": "5/5",
      "review": "Um dos melhores filmes de ação/comedia que já vi."
    },
    {
      "rating": "2/5",
      "review": "Not sure how this got such a high rating.... The dialogue feels like it was improv most of the time. There's some moments but it's pretty clumsy overall."
    },
    {
      "rating": "3/5",
      "review": "Wasn’t the worse or the best. Pretty cool scenes but got pretty draggy"
    },
    {
      "rating": "3/5",
      "review": "Una película más de acción comedia con escenas muy visuales (al estilo Boy Kills World), entretenida y ligera de esas que si dejas de prestar atención 1min no te pierdes de nada."
    },
    {
      "rating": "3/5",
      "review": "Too grusome to watch in high def. We've evolved so much since the Saw and Hostel days when it comes to gore. Where those movies feel like PG compared to a todays regular watch such as Novacaine."
    },
    {
      "rating": "4/5",
      "review": "This is a fun popcorn flick, perfect for a weekend viewing. There are a lot of amusing moments and grim humor that makes this a guilty pleasure that you don't need to apologize for. The script is solid and I'm surprised that few films have used this premise before. I can't actually think of one right now. This would be a fine one-and-done but I do hope this spawns some more, deeper adventures for Nathan Caine. I like him a lot."
    },
    {
      "rating": "5/5",
      "review": "Jack Quaid is fabulous in this movie!! Very funny and well done."
    },
    {
      "rating": "1.5/5",
      "review": "The movie was plain silly! The only good thing about it was the twist of Sherry being the main bad guys Sister. To tell you the truth:I had a very hard time getting through the whole movie"
    },
    {
      "rating": "1/5",
      "review": "Sat through this. The longer it went on the longer I regretted watching it."
    },
    {
      "rating": "3/5",
      "review": "Pretty standard, mostly predictable, action movie with a good commitment to a bit with a great performance from Quaid that puts it in the above average category. I think I would have bumped it up a little had I not seen the trailer and had most of the good bit moments spoiled from that. Definitely had fun watching it though."
    },
    {
      "rating": "2.5/5",
      "review": "It's gruesome and entertaining in parts but due to some clunky dialogue, plot holes and sloppy writing just doesn't work as well as it should."
    },
    {
      "rating": "4.5/5",
      "review": "As my spouse said, “Boimler , with a rare space disease , on shore-leave on an Earth-like planet. What could possibly go wrong?” (Lower Decks) A lot of fun seeing him get beaten up. (Movie style) A few gaming and Die Hard visual jokes that gamers will recognise. Just a fun, popcorn, action comedy. “Novocain” would fit right in with Mystery Men as a hero. Young John Wick? ( *hehe* ) I’m thinking that this will become a “Christmas movie” like “Die Hard” did."
    },
    {
      "rating": "3.5/5",
      "review": "A fun raucous ride. It is entirely single note, but that one note is enough to eek out a very enjoyable and uninhibited film."
    },
    {
      "rating": "3/5",
      "review": "\"Novocaine had potential, but ultimately it falls short of what it could have been. The premise is intriguing—a mix of dark comedy, crime, and drama with a dental twist—but the execution doesn't quite live up to its promise. There are moments where the film shows flashes of brilliance, with quirky characters and an offbeat tone that initially grabs your attention. However, as the story unfolds, it starts to lose focus and momentum."
    },
    {
      "rating": "4/5",
      "review": "decently fun, but just not suspenseful at all i guess."
    },
    {
      "rating": "1.5/5",
      "review": "This actor’s performances have grown tiresome. His whimsical, overly affected acting style has become grating, and it’s hard to sit through anymore. The story in Novocaine is lacking in substance. It’s a tough watch if you're not a fan of his particular style."
    },
    {
      "rating": "3/5",
      "review": "Jack Quaid stole the show! He is such a talented actor and nailed the role as a fun, quirky and entertaining Nathan Cane! The movie had its flaws, and wasn’t perfect by any means, but they had some good twists in there, and some good comedy to top it off. “Novacaine” is worth a watch!"
    },
    {
      "rating": "3/5",
      "review": "Novocain was cool . The main character kind of was giving simp lol but it was still a good movie. I kind of would’ve like more actions considering his condition but hey! Maybe there I’ll be a part two. I would recommend this movie."
    },
    {
      "rating": "1.5/5",
      "review": "Meh was ok I guess very cringey comedy, acting was also bad, didn't make any sense really. Just cause he can't feel pain, but he can bleed all over have arteries cut. Have his hands fried but can still use them.. definitely a shut your brain off movie.. wouldn't recommend it."
    },
    {
      "rating": "5/5",
      "review": "the film is genuinely really funny. I like how the film gives you a good laugh, sweet romance and a good amount of gore pertaining to the fight scenes. jack quaid is really a good actor and he fits the the innocent, nerdy and funny typa guy like how we played hughie in the tv series called the boys. hope i see more movies from him and more movies like these 🙌"
    },
    {
      "rating": "5/5",
      "review": "It’s just fun! Perfect movie to watch with friends and not have a care in the world. Great build up before the action starts. Quaid is really showing his potential in this film. Thumbs up for sure!"
    },
    {
      "rating": "4/5",
      "review": "It's not an Oscars movie, but in my opinion it's definitely worth watching. It's just straight up a fun movie to watch. Nothing fancy, just great acting a nicely-written sccript. The jokes are mostly hit and you will actually laugh while watching it. I think the best thing that the movie does is that it connects you to the main character and at some point you start feeling emotions towards that character. When the main character is in a fight you actually hope they win without major injuries. The main hero could literally be any of us, the story is about an average man, and when the hero is so similar to the average person you start feeling like you are there. Easily my biggest surprise this year, did not even plan on watching it. Randomly chose a movie and really enjoyed it. It could be the definition of a fun movie."
    },
    {
      "rating": "5/5",
      "review": "This has one of my favorite movies of the year so far. I hope to see him in more movies, he’s a gem."
    },
    {
      "rating": "3.5/5",
      "review": "This is a fun action movie!"
    },
    {
      "rating": "5/5",
      "review": "My husband and I saw this in the theatre, and we both loved it. Thought it was very original, well-done, funny, and exciting. The acting was great, it was well-written, and it was campy and fun at times. We both had a really great time watching this movie."
    },
    {
      "rating": "5/5",
      "review": "This movie was so good, no dull moments and easy to follow! Action from beginning til the end! Hoping for an Amateur 2"
    },
    {
      "rating": "5/5",
      "review": "It's perfect. It's like John Wick and Nobody had a child. Please don't make a sequel. This movie is perfect."
    },
    {
      "rating": "2.5/5",
      "review": "The movie seems like it is trying to be Deadpool. With the gore, violence, and humor. But it just isn't Deadpool. Its a passable movie with a few interesting plot twists I didn't see coming. The final fight sequence ends in a way I don't think I've seen anywhere before. But its also a pretty forgettable movie. It was distinctly OK."
    },
    {
      "rating": "3.5/5",
      "review": "A pleasing result that gives us the impression of a film we'll spend pleasant moments watching. It's definitely worth giving it a try. We find its strengths and weaknesses, but the final summary presents us with a film we'll have a wonderful time"
    },
    {
      "rating": "3/5",
      "review": "Jack Quaid may be new to Hollywood, it he is certainly making an entrance with fun films like Novocaine (and Companion). A fun film that doesn’t take itself too seriously. Quaid plays a full bank worker with a superhuman ability. Once he meets a woman that changed his bubble wrapped world, he embarks on a no holds barred expedition to win her back. The he film takes unique directions and will make you laugh. It will also make you cringe. WARNING! That being said, it’s a fun watch. I’d watch it again, but probably not in theatres. C/C-"
    },
    {
      "rating": "4/5",
      "review": "An interesting story, a suggestion for a good pastime"
    },
    {
      "rating": "1/5",
      "review": "How can anyone like this movie. It was bad. I used to like Quaid, but his movies keep not being that good."
    },
    {
      "rating": "5/5",
      "review": "This movie was absolutely insane, had a blast watching it and at first I thought this was going to be boring but right as the ghost pepper scene started I knew where this was going, 10/10 would watch again (also that arm scene was disgustingly cool)"
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed it. Yes, it’s gorey (and I hate gore) but I knew that going into it. I think it was an incredibly unique concept that I hadn’t thought of before, so really enjoyed following the story. Main character was extremely likeable. It was like Taken - but took itself less serious and the main protagonist is a geeky, nerd with no real skills. I’d watch it again if someone put it on."
    },
    {
      "rating": "2/5",
      "review": "Hey guys, I’m truly confused why this is rated so high. I love the work they did, but it’s 2025 and we’re watching a 2009 bs movie “he’s behind me isn’t me” type of atmosphere. It was okay. Truly"
    },
    {
      "rating": "5/5",
      "review": "action pack movie awesome performance Two thumbs up loved it"
    },
    {
      "rating": "4/5",
      "review": "A fun, exciting, hilarious, and bloody fast paced film that hits on every level. It keeps you non stop laughing with Jack Quaid and Jacob Batalon being the main comedic sources along with emotional moments too that even the movie out. The action is crazy and creative though the leads disease which adds for a style of action that most movies cannot do. In general the movie is super fast paced as the action does not stop which leads to a quick fun stop at the movies. 8.3/10"
    },
    {
      "rating": "0.5/5",
      "review": "Just stupid, relying on gore… a waste $20 and 2 hours!"
    },
    {
      "rating": "4/5",
      "review": "Great movie, thoroughly enjoyed the action, and performances, it takes a new spin on the action-movie genre, definitely worth a watch."
    },
    {
      "rating": "4/5",
      "review": "Great Full Use Of The Concept, Jack Quaid Is An Always Entertaining Everyman Role Brings The Charm Together, And He Is Dominating This Year With This Movie And Companion Being Both Entertaining. Its Easy To Watch And I Feel A Return To Form For Action Movies With A Guy Saving His Girlfriend. I Always Find Pleasure Watching These Kind Of Movies"
    },
    {
      "rating": "2.5/5",
      "review": "Predictable and simplistic but held together with enough beats of charm or choreography to lumber over the finish line. You probably won't regret your time with it, but you'll have forgotten about it by next week."
    },
    {
      "rating": "4/5",
      "review": "Wasn't expecting much going in, but it was excellent. Much more violence and gore than I figured it would have with some really creative moments."
    },
    {
      "rating": "3.5/5",
      "review": "Jack Quiad plays a charming lead in this violent comedy, filled with fast-paced and expertly choreographed action. Although enjoyable, the movie leans into unseriousness a little too comfortably and, despite a clever premise, is a facsimile to one-man-army movies like Nobody and Love Hurts."
    },
    {
      "rating": "4/5",
      "review": "Fun action packed movie! actually different type of action film that is a rarity in some small way! Good Stuff!"
    },
    {
      "rating": "2/5",
      "review": "For something meant to be painless, watching it hurt - a lot. I was expecting better. The joke wore thin very quickly. There were massive plot holes and the humour was lacking. All descended into gore and it relied on the shock value around \"how can we injure this guy in a way that will shock you even as we joke about it?\" The cast deserved to be in a better movie. In fact, this is one of the worst movies I've seen in some time."
    },
    {
      "rating": "4/5",
      "review": "A very enjoyable action film but be prepared for some grotesque injuries! Jack Quaid is fantastic as always."
    },
    {
      "rating": "4/5",
      "review": "Pleasantly surprised because of the pure comedy and special effects. However beware of the extreme violence, kids definitely should not watch this. And because Novocaine has 100% tolerance for pain, the torture scene was absolutely hilarious. The concept, even though not realistic at all, is pretty funny so there are a lot of possibilities they could do... so maybe they can do a sequel where he and Sherry have a kid that has pain tolerance too and they could build on that."
    },
    {
      "rating": "5/5",
      "review": "Dangerously Good Movie Amid all the commotion of the family friendly Minecraft, this is a movie that isn't trying to be anything more than what it is. A hero flick with an unlikely hero and the comedic journey that sees him grow into his own. I won't spoil much of the movie or any of it for that matter cause you definitely need to see it. Sometimes you just wanna watch something fun, so if you're over 21, grab a drink at the AMC and I swear this will be 100% worth your time."
    },
    {
      "rating": "4.5/5",
      "review": "hughie finally took V"
    },
    {
      "rating": "2.5/5",
      "review": "This was a fun watch"
    },
    {
      "rating": "4.5/5",
      "review": "Needless to say that the movie Novocaine is kinda over-the-top nature and occasional tonal shifts, but overall, described as an entertaining and original violent action-comedy with a dark humour and twists, often stemming from his inability to feel pain in gruesome situations. It is rough, thrilling, and pretty fun in a memorable cinematic experience at what the meaning of emotional pain and invulnerability of human connection, notably praising it's unique, the lead performance of Jack Quaid in his portrayal as Nathan Caine despite his comedic timing, charm and ability to make the unlikely hero relatable."
    },
    {
      "rating": "4.5/5",
      "review": "A surprisingly great action movie."
    },
    {
      "rating": "3/5",
      "review": "81% Rotten Tomatoes? Who did Dennis Quaid pay off for that Rating. Never the less, Jack Quaid is a a good actor and his performance in this role was really great. Novocaine was a good movie, but nothing more. Highly predictable, fun moments, but the entire concept did not work for me. It reminded me of the TV Series \"Chuck\", but not as good. Good music and the movie did have a few memorable moments. Gen Z will probably luv it. If you have seen the movie \"Nobody\" with Bob Odenkirk - Nobody blows Novocaine away in every aspect."
    },
    {
      "rating": "3.5/5",
      "review": "I went into this with low expectations and it was interesting to say the least. Tons of violence and suspense, plus a touch of romance and comedy. If you like a decent amount of fight scenes and a cool backdrop of San Diego, this is for you. I would watch it again probably."
    },
    {
      "rating": "2/5",
      "review": "An average stupid movie. I expected much better than this plot !"
    },
    {
      "rating": "4.5/5",
      "review": "Well that was original! It doesn't happen often but along comes a new movie, with new stars and an original story. Well done!"
    },
    {
      "rating": "4.5/5",
      "review": "If \"Hardcore Henry\" is your cup of tea... then you'll love this!"
    },
    {
      "rating": "3.5/5",
      "review": "Nathan Caine can't feel pain. Novocaine (known as Novocaine No Pain in some regions) is a 2025 American action comedy film directed by Dan Berk and Robert Olsen 🔫 A quirky storyline and a lot of fun… It’s good 🙂 Worth a watch. I’d recommend it if you like this genre 👍🏼 When the girl of his dreams is kidnapped, everyman Nate turns his inability to feel pain into an unexpected strength in his fight to get her back."
    },
    {
      "rating": "3.5/5",
      "review": "Imagine a smaller scale \"John Wick\" with more laughs and goofiness. The definition of a \"popcorn flick\". Solid watch!"
    },
    {
      "rating": "3/5",
      "review": "So, I haven’t watched the movie yet but the concept is odd in the sense that not being able to feel things as a super power would be akin to calling leprosy a super power, cause that is one of the main affects of the disease, which in turn causes those affected by it to lose limbs from injury and infection…yeah pretty cool super power, eh?"
    },
    {
      "rating": "4/5",
      "review": "Fun, ridiculous, nearly a spoof movie. Blend of The Boys, bank heist movie, comic action, ridiculous gross out. Just silly fun. Popcorn entertainment."
    },
    {
      "rating": "4.5/5",
      "review": "Definitely a fun ride movie…..not iconic but worthy of a popcorn movie to enjoy"
    },
    {
      "rating": "1/5",
      "review": "I watched the first 30 minutes. Not funny enough to be funny, not serious enough to be serious- I felt NOTHING with this movie- just like the main character."
    },
    {
      "rating": "4/5",
      "review": "Get’s a bit ridiculous sometimes, but a very fun watch nonetheless. Jack Quaid owns it."
    },
    {
      "rating": "0.5/5",
      "review": "Sorry, but what the hell?"
    },
    {
      "rating": "0.5/5",
      "review": "Main Character name is lazy to start. None of the cast/characters were interesting. A lazy weak attempt at movie making /writing the best thing is the budget is low"
    },
    {
      "rating": "2/5",
      "review": "What a waste. Too over the top and too ridiculous to be taken seriously. And the gimmick couldve worked had it had a better story. What a shame"
    },
    {
      "rating": "5/5",
      "review": "fortnite x novocaine when"
    },
    {
      "rating": "5/5",
      "review": "It was actually great!!! Didn't think it would be that good....I was pleasantly surprised!!!! I hope they make more!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Hyper-violent slapstick that is interspersed with unfunny quips. If your taste is for an R rated version of Laurel and Hardy without genuine humour, this is for you. Anyone else should spend their time thinking how bad the current state of Hollywood movies is because critics pour praise over this cartoon, proving how desperate they are."
    },
    {
      "rating": "2.5/5",
      "review": "It was cool. That 3rd act was a let down."
    },
    {
      "rating": "0.5/5",
      "review": "Thw movie was so boring I walked out of the cinema"
    },
    {
      "rating": "1/5",
      "review": "Looks like a rush job or just a terrible job in post-production. Score was awful and did nothing to enhance the movie. Scenes cut together sloppily and amateurishly. I fell asleep in the theater."
    },
    {
      "rating": "5/5",
      "review": "People need to go see this phenomenal film. I don’t know what the hold up is."
    },
    {
      "rating": "5/5",
      "review": "loved it. Jack Quaid is a cutie!"
    },
    {
      "rating": "3.5/5",
      "review": "Hahahahha that is so disgusting but worth watch it"
    },
    {
      "rating": "3/5",
      "review": "It was a little too mellow"
    },
    {
      "rating": "5/5",
      "review": "This was a fun movie that kept my attention the whole time - very well done."
    },
    {
      "rating": "3/5",
      "review": "It was good I was just expecting better action scenes"
    },
    {
      "rating": "5/5",
      "review": "so much better than I expected. definitely check it out."
    },
    {
      "rating": "3.5/5",
      "review": "Good comedy action film.. had potential to be a lot better."
    },
    {
      "rating": "5/5",
      "review": "Great movie!!! 10/10 I would definitely recommend watching this movie👍"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Jack Nicholson and Dennis Quaids kids duke it out"
    },
    {
      "rating": "3/5",
      "review": "somewhat ok, not great"
    },
    {
      "rating": "4/5",
      "review": "Fun. I did not see a trailer for this movie and did not know what to expect, probably why I enjoyed it, not the best acting but I think that is what makes it good."
    },
    {
      "rating": "3.5/5",
      "review": "So fun! Good pacing."
    },
    {
      "rating": "2.5/5",
      "review": "The story had soo much potential. It’s meh."
    },
    {
      "rating": "3/5",
      "review": "'Novocaine' is a solid action comedy that is brutal, quirky and makes for another strong showcase for Quaid."
    },
    {
      "rating": "5/5",
      "review": "Oi Hugie! Thus movie was so much fun not boring needless action, blood, violence. Jack Quaid looks like the nicest guy he looks like he's just having such a good time on screen. The story didn't drag on my favourite action movie of 2025. I honestly hope Jack Quaid becomes a new face of movies coz I loved his AI movie called companion that came also this year and novocaine was a top notch movie."
    },
    {
      "rating": "5/5",
      "review": "Presently surprised at how good this movie was. I most definitely enjoyed watching this."
    },
    {
      "rating": "4/5",
      "review": "Unexpectedly funny and outlandish."
    },
    {
      "rating": "4/5",
      "review": "fresh and great, nothing more to add"
    },
    {
      "rating": "4/5",
      "review": "Novocaine is what happens when you mix John Wick, Home Alone, and a middle schooler’s wild daydream. Jack Quaid plays Nathan Caine, a painfully average guy who literally can’t feel pain thanks to a rare condition. When his crush gets kidnapped by violent, bank-robbing Santas, he turns into a one-man wrecking crew—bloody, bruised, but never broken. The film leans hard into its absurd premise, serving up gnarly action and twisted humor without tipping into full-on slapstick. Quaid is hilarious and strangely endearing, even when he's stabbing dudes with his own broken bones. It’s over-the-top, messy, and loses steam by the end, but if you like your action dumb, violent, and oddly heartfelt—you’ll have a good time. Just don’t think too hard. Verdict: Dumb fun, lots of blood, Jack Quaid chaos."
    },
    {
      "rating": "3.5/5",
      "review": "A few far fetched premises but overall a fun watch"
    },
    {
      "rating": "3/5",
      "review": "I like Jack Quaid pretty much, so the rating here would be less good without him, but still its not a movie I think I would watch again. The premise is fun, off course, but Nate going after the kidnappers feels a bit off and much more I am not really into the \"stupid gangster think its smart to shoot everybody\"-routine anymore...its actually quite annoying, how they beg for being killed of. The movie looks good, has fun scenes and everything but the before mentioned points and maybe something I can't put my finger on so far makes it a mediocre movie."
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this movie! Jack Quaid was fantastic in it, the action was great, the comedy was hilarious and I was gripped from beginning to end!"
    },
    {
      "rating": "4/5",
      "review": "Easily recommendable if you like an Everyman killing people in brutal ways and don’t mind a little bit of gore. The casting in this was spot on and loved everyone. One of the rare examples only me hoping they do a sequel and don’t just stop at one."
    },
    {
      "rating": "5/5",
      "review": "Novocaine is a 2025 Action/Comedy film directed by Dan Berk and Robert Olsen. The film starts Jack Quaid as the main protagonist - Nathan Caine. For me personally, while the story wasn't the most mind-blowing thing of all time, I still found it to be a very well-done film and a very well-made story. I also believe the action scenes were great, blending comedy and action perfectly. The whole premise is an incredible idea for a film, and I think they executed it perfectly. I went into this with fairly high expectations - and I ended up liking it even more than I thought I would. It's funny, but sometimes a little emotional too, which is perfect. Jack Quaid's performance as the protagonist is amazing, a perfect casting choice alongside great acting. I truly cannot think of anything I dislike about this film, I think it's an amazing movie and more people need to see it. Underrated, while still rated high. Perfect for me."
    },
    {
      "rating": "4/5",
      "review": "I liked it! It was silly and man, I am sucker for a good dolly shot"
    },
    {
      "rating": "3/5",
      "review": "Good enough to watch but not enough to praise"
    },
    {
      "rating": "5/5",
      "review": "Jack Quaid shines in a tale that both surprises and shocks. The Home Alone rip was particularly funny. Great movie. Go see this in the cinema."
    },
    {
      "rating": "4/5",
      "review": "It's like a feel-good buddy movie, but the good guys die unnecessarily. Also, we get it, the hero doesn't feel pain, but do we really have to endure the graphic torture? C'mon. It's got great action and heart. The acting is pretty good considering half of Dennis Quaid's DNA is mixed in with half of Meg Ryan's to make the star of the show. But you really have to suspend reality when you consider things like the probation sentence and less than 2 years for the heroine of the show, who is an accessory after the fact for several murders... of Police Officers. Of course, it's California, so maybe. LOL. But hey, if you want to have a semi-light and grisly thrill ride with your date, this is your film!"
    },
    {
      "rating": "5/5",
      "review": "Humorous and gross, adrenaline fueled(literally) romance. Crazy preface but mostly believable except maybe some of the ending. Still a lot of fun and worth seeing on the big screen."
    },
    {
      "rating": "4/5",
      "review": "It was a good movie. Lots of funny stuff to laugh at and lots of keeping you on your toes! I covered my eyes many times too!"
    },
    {
      "rating": "4/5",
      "review": "Uma história diferente, divertida, ação e comédia bem balanceada, Jack Quaid herdou o talento do pai, manda bem demais como protagonista, o roteiro achei um pouco exagerado e roubado mas bem divertido! 7.5"
    },
    {
      "rating": "5/5",
      "review": "This is the best action movie I've seen this year The kills are awesome there's this one when he has his the ulna and the radius and sticks it through the bottom part of the guy's jaw kick ass there's a part when he's hanging in a snare trap so hilarious!"
    },
    {
      "rating": "4/5",
      "review": "The movie was witty, funny, and action-packed!"
    },
    {
      "rating": "5/5",
      "review": "Just a fun entertaining movie that doesn’t drag, easy to sit down and watch for an hour an a half if you like needless violence and fight scenes."
    },
    {
      "rating": "3/5",
      "review": "A cross between Nobody and Crank. Should have been a 90 min film max. Average but Quaid's charismatic performance just about makes it worth watching."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was very lame and boring. Story line was mediocre. Not worth paying to go see it., not even sure it would keep my interest to watch it free at home."
    },
    {
      "rating": "3.5/5",
      "review": "I loved Novocaine for its gripping story and Jack Quaid’s outstanding performance. He once again proves his talent in a complex role, keeping the audience engaged with every twist and turn. While the \"good guy turning bad\" or \"villain vs. redeemed villain\" plot feels a bit cliché, the movie executes it well, maintaining tension and entertainment throughout. It may not be the most original storyline, but strong character development and a well-crafted atmosphere make it work. Jacob Batalon also delivers a solid performance, and it was great to see him step outside his usual Spider-Man role. His presence adds energy to the film and fits well within the story. Overall, Novocaine (2025) is a highly entertaining film with great performances and a plot that, while somewhat predictable, keeps you hooked thanks to its execution and pacing."
    },
    {
      "rating": "3.5/5",
      "review": "Action was crazy for a Deadpool feel lol"
    },
    {
      "rating": "3.5/5",
      "review": "Great actors, a different type of script, ending could have been a little different and not predictable. Worth the watch."
    },
    {
      "rating": "4/5",
      "review": "A lot of action . Nonstop . Entertaining . Jack Quaid becoming the new action star . Was fantastic in Companion too. Would recommend."
    },
    {
      "rating": "1/5",
      "review": "too violent and the main character was portrayed as an idiot with no common sense ."
    },
    {
      "rating": "2/5",
      "review": "It was unimpressive not even slop i could enjoy running in the background. gives me the same feeling as eating lukewarm soup."
    },
    {
      "rating": "5/5",
      "review": "Stell dir vor, der Darsteller im Film \"Nobody\" würde keine Schmerzen empfinden. Fast wie eine Fortsetzung. Oder von \"Guns Akimbo\". Natürlich ist die Handlung völlig anders. Dem einfallsreichen Drehbuch ist es geschuldet, dass der Film sich nicht zu lange aufhält. Schon recht schnell geht es zur Sache. Und doch bleiben Emotionen nicht auf der Strecke. Auch könnte dieser Film, von der Machart her direkt aus den 80ern kommen. Nur wäre die komplette Gewalt entschärft worden. Der schwarze Humor trifft, ins Schwarze und auch wenn man Gewalt im Film gewöhnt ist, dürfte das Eine oder Andere, beim zusehen schmerzen. Den Machern ist bewusst, dass der \"Star\" des Filmes, der Gimmik: Schmerzfrei ist, und dieser wird voll ausgenutzt. Da wird auch \"Die zweite Wange\" hingehalten und Einstecken, statt austeilen, bekommt eine ganz neue Dimension. Wenn man glaubt, schon \"alles gesehen zu haben\"... Sehenswert"
    },
    {
      "rating": "4.5/5",
      "review": "A predictable but very fun and bloody action comedy with great stunts and effects and a unique twist to wrap it up, but that still manages to have brains alongside the brawl, with a honestly relatable protagonist that has a good amount of character devlopment and effective drama before that main part begins."
    },
    {
      "rating": "3.5/5",
      "review": "In an era dominated by predictable superhero franchises, Novocaine stands out as a breath of fresh air. Initially, I feared it might be just another cheap knockoff of Wolverine, but I’m thrilled to report that it isn’t. While the film does take cues from the Crank movies, it does so in a way that’s genuinely exciting and engaging. Jack Quaid shines in the lead role as Nathan Caine, aka Novocaine, bringing a unique blend of charisma and grit. He’s supported by a solid cast, with Jacob Batalon delivering a particularly fun performance. However, it’s Ray Nicholson who truly steals the show, portraying a villain so menacing and memorable that I’m eager to see more from him in the future. Novocaine is not for the faint-hearted—there’s plenty of brutal, stomach-turning gore that even a seasoned moviegoer like myself found hard to stomach at times. Still, the intensity of the violence is part of what makes the film so impactful, and the reactions of the audience in the theater only added to the experience. Novocain may not be for everyone, but it’s a thrilling, visceral ride that pushes the boundaries of the genre in all the right ways."
    },
    {
      "rating": "3.5/5",
      "review": "In an era dominated by predictable superhero franchises, Novocaine stands out as a breath of fresh air. Initially, I feared it might be just another cheap knockoff of Wolverine, but I'm thrilled to report that it isn't. While the film does take cues from the Crank movies, it does so in a way that's genuinely exciting and engaging. Jack Quaid shines in the lead role as Nathan Caine, aka Novocaine, bringing a unique blend of charisma and grit. He's supported by a solid cast, with Jacob Batalon delivering a particularly fun performance. However, it's Ray Nicholson who truly steals the show, portraying a villain so menacing and memorable that I'm eager to see more from him in the future. Novocaine is not for the faint-hearted-there's plenty of brutal, stomach-turning gore that even a seasoned moviegoer like myself found hard to stomach at times. Still, the intensity of the violence is part of what makes the film so impactful, and the reactions of the audience in the theater only added to the experience. Novocaine may not be for everyone, but it's a thrilling, visceral ride that pushes the boundaries of the genre in all the right ways."
    },
    {
      "rating": "3.5/5",
      "review": "Novacaine. A witting and funny action packed movie with a decent amount of twists and turns within the story. For the 1st time in ages, I didn't fall asleep at any given time during the movie. So that alone says that it's well worth the watch."
    },
    {
      "rating": "5/5",
      "review": "It's gory, funny and has a lot of action. Loved all the performances (Specially Jack Quaid). Hope to see more movies like this one."
    },
    {
      "rating": "3.5/5",
      "review": "Jack Quaid is a hoot, A. Midthunder a terrific combination of talent and beauty, script and dialogue could have been better. Maybe a bit too violent (bordering gory) in some scenes, but overall good fun"
    },
    {
      "rating": "3.5/5",
      "review": "This was brutal, and surprisingly fun. Less slapstick, which I was expecting from the trailers, and more realistic (ironically, yes) than I thought it might be. I'm glad to see Jack Quaid play a hero of sorts for once. Let's have some more good roles for him if we can. Solid \"guy in the chair\" work too. IYKYK."
    },
    {
      "rating": "3/5",
      "review": "Hard core bloody violent, and funny."
    },
    {
      "rating": "3.5/5",
      "review": "A cool twist on the average action movie. I wouldn't say it worth rushing out to a theater to see but it's a solid watch."
    },
    {
      "rating": "4/5",
      "review": "I liked the story and the acting but it was very violent and disturbing injuries"
    },
    {
      "rating": "1/5",
      "review": "This was a waste of 2 hours. I swear that I could have wrote a better script when I was 14. Very over the top action in a cringy way, not a fun way. The plot was not linear. I would have an easier time suspending disbelief in a Marvel movie."
    },
    {
      "rating": "2/5",
      "review": "This movie was the opposite of smart in every single way."
    },
    {
      "rating": "3.5/5",
      "review": "Too Violent/bloody for my taste!"
    },
    {
      "rating": "4.5/5",
      "review": "Captivating from beginning to end!"
    },
    {
      "rating": "4.5/5",
      "review": "really good, action packed and very comedic. went to see this with my boyfriend and we both loved it. great plot twist that i didn’t see coming, i wish they made more from it though."
    },
    {
      "rating": "5/5",
      "review": "Really great movie with a lot of action and great Storie line ! Highly recommend"
    },
    {
      "rating": "3/5",
      "review": "The idea behind the film has quite a bit of potential, unfortunately the characters and plot are underdeveloped in favor of gory fight scenes with a completely underwhelming background set... but still good entertainment."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining, really funny…like I held back from laughing out loud in the theater kind of funny. Loved it, would recommend it. It’s a good time"
    },
    {
      "rating": "5/5",
      "review": "Fun movie!! Great job"
    },
    {
      "rating": "3/5",
      "review": "While the dialogue did seem a bit forced and cheesy and while this is a typical/regular action-comedy, I enjoyed myself pretty well watching this movie! Jack Quaid (likable guy) and Jacob Batalon (as the sidekick/guy in the chair once again) both performed well with their roles! The movie’s plot was very easy to follow which was also a big plus. The premise for the film is quite creative as well, and reminded me a little bit of the Bond villain from the World is not Enough who couldn’t feel any pain either. I would recommend this for someone in a mood for laughs, some cool fight scenes, and even some suspenseful scenes, give this one a try!"
    },
    {
      "rating": "3.5/5",
      "review": "Great movie a ton of action and gore. But the plot is a bit thin and the big surprise was revealed way too early."
    },
    {
      "rating": "4/5",
      "review": "The silliest movie I have seen in years. I laughed and rolled my eyes all through the movie. Still I liked the comedy."
    },
    {
      "rating": "3/5",
      "review": "Me and my brothers and my sister saw it when i saw it it was okay"
    },
    {
      "rating": "3/5",
      "review": "The plot is ok if you turn your brain off. It’s a fun film. Jack Quaid’s performance as Novocaine was alright. I did enjoy the ways they used his disability."
    },
    {
      "rating": "4/5",
      "review": "As tiering as this brand of humor is, the actual plot and characters improve this film by leaps and bounds. This is seriously a great film with a fantastic gimmick. Unfortunately, they do follow a Hollywood script with all its formulaic elements, and while that is a bit disappointing the film still holds its own. 4/5 stars."
    },
    {
      "rating": "5/5",
      "review": "Action packed and funny with shocking cringe-worthy violence, in a good way (if you like that sort of thing)"
    },
    {
      "rating": "5/5",
      "review": "Re-watchable and while there were a lot of times I wanted to look away due to the potential injuries, it kept me laughing."
    },
    {
      "rating": "2/5",
      "review": "Too bloody and nonsensical. Don't recommend at all."
    },
    {
      "rating": "3/5",
      "review": "Overall, it's not a bad movie, as long as you're not tired of watching Jack Quaid portray Hughie Campbell, which feels similar to Jesse Eisenberg playing Columbus in \"Zombieland\" and Lex Luthor in \"Batman v Superman.\" Additionally, I'm not entirely sure why Ned from \"Spider-Man\" appears in this film. Oh, right... I see. Despite these minor annoyances, the movie has some enjoyable moments and plenty of easy laughs, making it an overall easy watch."
    },
    {
      "rating": "4.5/5",
      "review": "Good, fun, silly but has some serious topics. A good movie to enjoy just for fun and nothing too artsy."
    },
    {
      "rating": "5/5",
      "review": "Good time, didnt take itself too seriously"
    },
    {
      "rating": "5/5",
      "review": "I like funny actions movie"
    },
    {
      "rating": "2.5/5",
      "review": "\"Novocaine,\" the action comedy that has more heart than it has laughs. The concept doesn't get boring, largely down to Jack Quaid's physical comedy & how they kept increasing the fun, violent ways to utilise it. Where it falls apart for myself is the comedy & some of the cast are capable of delivering the humour, but there's an over-reliance on it that doesn't allow it to breathe."
    },
    {
      "rating": "4/5",
      "review": "I thought this was a great action movie with surprising depth. I love this trend of average heroes whose inner strength (and wit!) carries the movie! It was thoroughly enjoyed by everyone in my party and we’ve recommended to friends!"
    },
    {
      "rating": "5/5",
      "review": "It was a fun movie with great scenes"
    },
    {
      "rating": "4/5",
      "review": "it was wildly funny and truly enjoyed it. I would watch it again."
    },
    {
      "rating": "0.5/5",
      "review": "We walked out. The movie had one gag and everything surrounding that one gag was mediocre at best, including the acting, the relationships between the characters, the character development, the setup, etc. Shockingly bad but I’ll bet the pitch sounded good."
    },
    {
      "rating": "5/5",
      "review": "The whole movie was bloody fun."
    },
    {
      "rating": "4/5",
      "review": "Creative in some scenes while other times it could be a little boring. Overall not a bad movie but not one I'm going to go out of my way to watch again."
    },
    {
      "rating": "4/5",
      "review": "Funny and entertaining. Very surface level movie, doesn't do as much character development as they had the opportunity to do. Could've let the twist come in a little later and have more meaningful impacts."
    },
    {
      "rating": "4/5",
      "review": "Funny. Gross. Bit predictable. Worth watching in the theater"
    },
    {
      "rating": "3/5",
      "review": "Entertaining, but a little too gruesome"
    },
    {
      "rating": "4.5/5",
      "review": "Very creative and fun to watch!"
    },
    {
      "rating": "3/5",
      "review": "The premise was innovative and the twist was clever however, the action scenes were predictable and gory."
    },
    {
      "rating": "5/5",
      "review": "the gore, humor, and action were very well delivered by the amazing cast. I see you, Quaid. 👏👏👏"
    },
    {
      "rating": "3/5",
      "review": "It's okay, kind of fun; but there is no reason for it to run over 2 hours. Should be 90 minutes tops. Nepo baby sightings galore with Quaid & Nicholson sons represented. You'll probably forget this movie quickly after seeing it; but, if you're trying to fall asleep, this movie will probably help."
    },
    {
      "rating": "5/5",
      "review": "Novocane is a blast. This spring dive into a world of a man who has a very bad day, but you should see the other guy. An action pacted romp that will has dark humour seasoned through out the film. I warn you the action is visceral and no holds are barred when it comes to seeing it all. But it is well paced and clever in places. A solid watch and well recommended."
    },
    {
      "rating": "3.5/5",
      "review": "Let me first by saying more than once it was as good film. However, it was way too long of a movie & not enough character development. A lot of subplots & way too many moving parts & not enough consistency. Some of the special effects were great & some of the CGI was alright. Overall a very good, interesting movie, in the meantime please check out 2001 Novocaine starring Steve Martin."
    },
    {
      "rating": "4.5/5",
      "review": "The movie was high energy and very easy to follow."
    },
    {
      "rating": "2.5/5",
      "review": "Novocaine, a movie about a man who can’t feel pain and he goes on an awesome quest to save his girl, definitely not a must see but it wasn’t that bad if you’re paying to see action you might be left a lil unsatisfied but if you want a movie to see with your girl friend then by all means go check it out. It’s not an Oscar worthy movie either but it’s a cool movie to watch at home."
    },
    {
      "rating": "4/5",
      "review": "Grear dark comedy, pretty gruesome at moments, but fits in well with the storyline and premise of the narrative. Makes for an entertaining evening, just don't go if you're overly squeamish."
    },
    {
      "rating": "4/5",
      "review": "The movie was humorous and the plot twist was definitely not expected."
    },
    {
      "rating": "3.5/5",
      "review": "A formulaic but fun action comedy romance. The concept is used to great effect and whilst the story plays out as expected, it’s funny and entertaining with some good action scenes and visual effects. It’s a good and solid film all round with great leads, a good cast of characters, pacing, music and ending, but does struggle to leave a lasting impression."
    },
    {
      "rating": "5/5",
      "review": "Fun movie with great action!"
    },
    {
      "rating": "5/5",
      "review": "Hilarious while also keeping you on the edge of your seat!"
    },
    {
      "rating": "5/5",
      "review": "Very well done movie. Funny and captivating."
    },
    {
      "rating": "5/5",
      "review": "A little gross, but amazing casting and great plot. Damn funny, too!"
    },
    {
      "rating": "5/5",
      "review": "Overall 10/10 action, comedy, drama- definitely worth the price of a ticket and an amazing performance all around! Went into this with easy expectations of a simple stereotypical action movie, and was pleasantly surprised at the acting, pacing, and storyline. It had my attention the whole time! Jack qaid and Ryan Nicholson were stellar opposites. If you’re thinking of seeing this- do it."
    },
    {
      "rating": "5/5",
      "review": "I think it’s a fun action movie, with an interesting premise. Lots of fun twists. It was kinda weird that the setting was Christmas though, felt a little forced."
    },
    {
      "rating": "4/5",
      "review": "I cant believe how well they pulled off such a risky concept! I loved how deeply involved i got into the main character and his 180⁰ flip he made to dive head first (literally) into love. Action packed yet it didn't dominate over the deeper storyline. A fun and wild ride!!"
    },
    {
      "rating": "4.5/5",
      "review": "Great weekend movie. Lot of action although I would’ve loved more."
    },
    {
      "rating": "5/5",
      "review": "Absolutely amazing casting choice and the storyline was fantastic. The pacing of it was immaculate. I would definitely recommend watching this."
    },
    {
      "rating": "4.5/5",
      "review": "Nonstop fun and action"
    },
    {
      "rating": "4.5/5",
      "review": "Really fun movie! Jack Quaid is lovable and hilarious as Nathan Caine. Premise has more depth than I expected. The casting is also very good!"
    },
    {
      "rating": "4/5",
      "review": "This movie was nuts in all the great ways. This was a fun movie to watch in the theaters with an audience."
    },
    {
      "rating": "4/5",
      "review": "the story itself is simple but the fight scenes make up for it, so if you want to just watch a movie with creative fight scenes and have fun then this movie is worth it"
    },
    {
      "rating": "4.5/5",
      "review": "Painless never looked so painless."
    },
    {
      "rating": "3.5/5",
      "review": "I definitely liked this movie. It's a fun premise that definitely took some creativity to make it work. The comedy was good at most times, although some jokes just didn't land. The acting was well done but nothing to ride home about. And the plot? Well it was fine. It really reminded me of Die Hard. Just a very straightforward plot. The relationships between characters was also a mixed bag. Some were done perfectly but a few left something to be desired. My main critique was with the plot twist. It was done so early that it left the rest of the movie craving a gasp worthy moment. But overall, it's a good movie if all you're looking for is a creative flick to kind of turn your brain off and enjoy."
    },
    {
      "rating": "5/5",
      "review": "Great, funny, action packed movie. Jack Quaid was awesome!"
    },
    {
      "rating": "4/5",
      "review": "Liked this movie, the characters were likable and believable and the storyline was entertaining"
    },
    {
      "rating": "5/5",
      "review": "A really good movie with mix, action and comedy casually gets hurt, but can’t feel it, which is hilarious to me"
    },
    {
      "rating": "3.5/5",
      "review": "The Jack Quaid Max Payne audition tape. The exact opposite of a pain to watch, Novocaine gets an adrenaline shot of charm while finding increasingly demented ways to utilize its concept. Vulnerable, thoughtful, sarcastic and empathetic, the film will have you laughing and wincing simultaneously, and the lower your pain tolerance is, the more it will make you do both of those things. It gets more mileage from its central gimmick thanks to a clever and amusing screenplay that adeptly sprinkles laughs amid its cartoonish action set pieces. It helps that Quaid is so good at landing every punchline, if not punch. The level of gleeful mayhem this action-packed outing manages to achieve is impressive, it sets its sights low and wildly exceeds them for most of its brisk and bloody running time. Cheerfully violent, stunt-stuffed and well-acted, it's hard not to appreciate Novocaine's simplicity and bone-crunching gore, which allow for some truly creative chaos."
    },
    {
      "rating": "1.5/5",
      "review": "Don't waist your time. Not worth it. Not a good film."
    },
    {
      "rating": "3.5/5",
      "review": "Was it stupid - yes. Was it fun - yes. Was it violent - yes. Did the plot twist bother me - a little. Overall, did I like the movie - yes."
    },
    {
      "rating": "5/5",
      "review": "so many gasps & so much action! i loved it from beginning to end!"
    },
    {
      "rating": "4/5",
      "review": "Very entertaining, and had some incredible fight scenes."
    },
    {
      "rating": "2/5",
      "review": "The familiar jokes and dialogue did nothing to balance out the constant ineptitude of the characters in this comedic ass-kick style action flick. My pain threshold was reached long before the final conclusion."
    },
    {
      "rating": "4/5",
      "review": "It was so funny and action packed!"
    },
    {
      "rating": "5/5",
      "review": "Lots of great action and laughs!"
    },
    {
      "rating": "4/5",
      "review": "My rating is 8/10. Full of action, Very fun, very violent, Show!"
    },
    {
      "rating": "4/5",
      "review": "Great off beat beat-em up movie. Plenty of comedy thrown in as well. just be aware that you might not enjoy as much if you are squimish."
    },
    {
      "rating": "3/5",
      "review": "Bon film de divertissement entre humour et action.une personne poli qui a ne ressent pas la douleur qui se retrouve embarquer dans les ennuis"
    },
    {
      "rating": "2/5",
      "review": "Stupid and kind of gross."
    },
    {
      "rating": "5/5",
      "review": "This movie is INSANE!!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "Okay, it's no Crank, but it was just as enjoyable! 😂 A man who feels no pain, on a mission to rescue a girl - what’s the worst that could happen? 🧐✌️"
    },
    {
      "rating": "5/5",
      "review": "Loved this movie. Go see it! Original movies don’t make money and it’s not fair. This should come with a trigger warning though. It’s gory but if you can handle it then you will laugh, scream and maybe even shed a tear."
    },
    {
      "rating": "1.5/5",
      "review": "The main character (Nate) played by Jack Quaid is a man with a simple and average life - work, playing on the computer and sleeping. What sets him apart from the rest is a rare genetic disease that prevents him from feeling pain. His everyday life changes when he meets a girl with whom he quickly befriends and who also works with him in a bank. Everything takes a dramatic turn when she is taken hostage during a robbery of their workplace. The hero forced to act must overcome his weaknesses and use his unusual ailment to find it. Although the very concept of a man insensitive to pain who uses it in combat may sound intriguing, unfortunately the film cannot make good use of this potential. The plot is predictable, so almost every scene can be predicted, but maybe except for one and quite a slight twist. Despite everything, the whole thing gives the impression of something that we have seen many times, and the script does not even try to add freshness to it. The film is also a dark comedy, but the only moments that made me smile are due to the charisma of Jack Quaid. His performance is just good, no madness, but throughout the movie I couldn't resist the impression that I was watching Hughie from The Boys. To sum up - an interesting concept was wasted by a boring, predictable plot and not very funny, cheap jokes. It's a movie that could rather fit in the background at dinner or cleaning. For me – unfortunately a disappointment."
    },
    {
      "rating": "3/5",
      "review": "A passable movie. Ripped off kick ass which did it better but it was watchable if you have a couple hours to kill"
    },
    {
      "rating": "2/5",
      "review": "B Rated at Best. Nonsensical Love story fueled by Self Loathing Male characters. Way to Gory. Why do we need to see some of thus nasty stuff?"
    },
    {
      "rating": "5/5",
      "review": "I actually really enjoyed it. In a world of too many equalizers and John Wicks it’s a fun and original concept for an action movie that doesn’t slow down the action just because the protagonist is the one getting beat up the majority of the time. The effects were also very good and very hard to watch(in a good way)"
    },
    {
      "rating": "4.5/5",
      "review": "Good entertaining movie."
    },
    {
      "rating": "5/5",
      "review": "I was VERY entertained, great action movie!"
    },
    {
      "rating": "2.5/5",
      "review": "Mmm... Zany script, lack of any story..!"
    },
    {
      "rating": "5/5",
      "review": "Phenomenal work. I love the little details and the humor"
    },
    {
      "rating": "4/5",
      "review": "The premise feels done before (Crank) but still keeps you entertained and has a cute spin"
    },
    {
      "rating": "1/5",
      "review": "I didn't get the point and neither did he."
    },
    {
      "rating": "5/5",
      "review": "Good little action flick , with a different story. It didn't drag on too much and the action kicked in just in time . In this recent climate of movies it was refreshing."
    },
    {
      "rating": "5/5",
      "review": "I often don't like horrors or splatter but this is absolutely amazing, I \"squeaked\" out loud in fun and disgust"
    },
    {
      "rating": "5/5",
      "review": "The set up takes a bit too long but the payoff is fantastic. I love it when a the action makes you cringe , gasp and laugh out loud all at the same time. Novocaine does that time and time again ... tons'o fun in the most disturbing way!"
    },
    {
      "rating": "4/5",
      "review": "This movie is fun and different, funny and witty"
    },
    {
      "rating": "4.5/5",
      "review": "Whether you're an action junkie, a fan of witty dialogue, or just looking for a well-rounded film, Novocaine is a must-watch. Highly recommended!"
    },
    {
      "rating": "2/5",
      "review": "Not for me, but my husband was okay with it. However, he expected more comedy. I actually closed my eyes quite a bit."
    },
    {
      "rating": "5/5",
      "review": "Awesome film! Had everyone on a roller coaster ride!"
    },
    {
      "rating": "1/5",
      "review": "Had to leave the dialog felt like it was written by teenagers and the action was cringe inducing in the worst ways"
    },
    {
      "rating": "5/5",
      "review": "Just a blast. Funny and pretty good action scenes and kept it moving."
    },
    {
      "rating": "5/5",
      "review": "Funny with lots of action, great pacing."
    },
    {
      "rating": "1/5",
      "review": "Awful movie. So slow to start. Characters were poorly casted and no character development. The scenes that were supposed to be funny were definitely not funny. And the novelty of the premise of no ability to feel pain was boring after the first few scenes. Wanted to walk out, but for some reason I didnt. I dont know what I regret more, going to the movie or not walking out"
    },
    {
      "rating": "4/5",
      "review": "Jack Quaid getting abused for 110 minutes and somehow making it charming. Novocaine is dumb fun done right — a little Crank, a little Home Alone, a lot of bruises. Not perfect, but it’s got heart, blood, and enough weird energy to keep you watching. I grinned more than I expected."
    },
    {
      "rating": "5/5",
      "review": "Got a chance to go see this last night. Glad I got the opportunity. Some of the scenes, seriously reminded me of Home Alone. That ouch effect, plus seeing some of the segments from the trailers play out, it does show as a good thing he souldnt feel pain. It also does give a good insight on thinking, because even if you can't feel pain, impacts will still happen, a person would be surprised...and eventually, pass out from the body shock. Acting was a good, won't spoil it, but will recommend it."
    },
    {
      "rating": "3.5/5",
      "review": "Divertida y de mucha acción, donde un guion estable y de rápida resolución. Convence y la película no decae en ningún momento."
    },
    {
      "rating": "5/5",
      "review": "Really funny with lots of twists and turns. Very gorey though I was squealing so much lol"
    },
    {
      "rating": "5/5",
      "review": "Really funny and if you love the boys its a must see there is a lot of gore so i wouldn’t recommend this for a date night but definitely for your own personal viewing"
    },
    {
      "rating": "5/5",
      "review": "Entertaining as Heck! Action was a great mix of gory, funny, and the special effects were so RAD!"
    },
    {
      "rating": "4.5/5",
      "review": "This was a heartwarming, very funny movie. The special effects were great, as was the story line. I enjoyed it very much."
    },
    {
      "rating": "2/5",
      "review": "ended up leaving 10 minutes early because I was so bored. Movie has sections that look like they were shot for a YouTube channel."
    },
    {
      "rating": "4.5/5",
      "review": "This was great. I'm the theatre I saw it in, the whole theatre was clapping at the end. TBH the coming attraction looked pretty bad, shockingly I was surprised and liked it!"
    },
    {
      "rating": "3/5",
      "review": "It was grossly funny. Non-stop activity. Weirdly happy ending. It was entertaining. Maybe not Oscar material."
    },
    {
      "rating": "4.5/5",
      "review": "Would recommend, lots of action, good twist and fun premise. I will say it’s the kind of movie you’ll likely watch once and never come back to. Certainly not destined to be a classic, but a solid popcorn flick."
    },
    {
      "rating": "5/5",
      "review": "Wasnt expecting a lot, but I thought it was really good, very entertaining"
    },
    {
      "rating": "3.5/5",
      "review": "It was entertaining. It was a fairytale, romantic comedy, action movie."
    },
    {
      "rating": "5/5",
      "review": "One of the best movies of the year so far. Just pure entertainment with an innocent heart. It’s fun, funny, and very entertaining. This one is worth your time and money"
    },
    {
      "rating": "3/5",
      "review": "⭐️⭐️⭐️ Pretty damn funny and doesn’t hold back on its brutality - which kinda surprised me as it’s not Rated R. Often when I was laughing I wasn’t sure if it was due to Joy or Defence cuz the film goes pretty damn dark while effectively keeping a positive and light-hearted demeanour. Jack Quaid plays the roll exactly as you’d expect but sadly he’s the only talent on screen you want to watch, with the rest of the cast sorta just … there. I could not tell you a single other characters name. Doesn’t really matter though, as the point of the film is to see poor Nate constantly find himself in unlikely but funny environments for him to get hurt. Though to get to ANY of that - there’s like an entire half of the movie which is more or less setup. I commend the filmmakers for trying to make us care about the lead and his wild Hero attempt - it simply takes too long. In the final act though, I had to knock off an entire point because of a moment that is so incredibly stupid and essentially a plot-hole. Not just that, but I rolled my eyes because it was a VERY lazy trope to give the film an extra 15 minutes or so for a second climax. There’s also a pretty interesting reveal but it happens about half-way into the movie and would have been far more effective if the story held onto what is genuinely a good idea a bit longer for it to match the leads journey. As an audience we are privy to this piece of information that really, really wasn’t necessary. Still - it’s a fun time and if you’re a fan of some creative, gore-y, and bloody brutality, there’s plenty to appreciate. #novocaine #moviereview"
    },
    {
      "rating": "5/5",
      "review": "Was one of our favorite movies of the year. Action, comedy, love, etc. would definitely suggest."
    },
    {
      "rating": "5/5",
      "review": "funnnn movie , hilarious, and he does whatever it takes for love . enjoyed this movie"
    },
    {
      "rating": "5/5",
      "review": "Full of fun and action"
    },
    {
      "rating": "5/5",
      "review": "Awesome and shocking"
    },
    {
      "rating": "5/5",
      "review": "I just saw this movie for the third time in two weeks everyone needs to watch this"
    },
    {
      "rating": "5/5",
      "review": "Lots of action Lots of fun Great ride Pretty funny"
    },
    {
      "rating": "5/5",
      "review": "Absolutely loved this movie!! Nonstop action!! Funny moments!! Highly enjoyed!!"
    },
    {
      "rating": "4/5",
      "review": "I loved it. It was fun, lots of action."
    },
    {
      "rating": "5/5",
      "review": "Fantastic Movie,Funny,Entertaining with a lot of gore scenes and outstanding performances by Quaid, Midthunder and Nicholson. Must See People."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie, I had a great time watching it"
    },
    {
      "rating": "4/5",
      "review": "Great pppcorn movie good action"
    },
    {
      "rating": "1/5",
      "review": "The worst movie I've ever seen. Implausible script. Cast scrounged from a dinner theater. Puerile script. And lots of gore followed by more gore. I don't know how it's rated so high. Robots? Click farm? Can't tell you how it ends because our entire group walked out..."
    },
    {
      "rating": "2/5",
      "review": "How does this have over an 80% rating? Only finished it because I enjoy my man Hughie but holy crap, not good writing but gets slightly better after around halfway through."
    },
    {
      "rating": "4/5",
      "review": "Exactly as expected."
    },
    {
      "rating": "3.5/5",
      "review": "A lot of action! Some parts a bit gory for me. Definitely kept our interest!"
    },
    {
      "rating": "5/5",
      "review": "Great movie, I haven't seen one that kept me on the edge of my seat in a while"
    },
    {
      "rating": "3.5/5",
      "review": "great movie, the action was great and with the humor inside of it as well. very cool."
    },
    {
      "rating": "3.5/5",
      "review": "Tight script Wondering when Quiad Ritual Humiliation is gonna end"
    },
    {
      "rating": "5/5",
      "review": "I loved the attention to detail with Nathan Caines apartment, giving clues to the struggles he deals with with CIPA Jack Quaid was perfect for the role"
    },
    {
      "rating": "1.5/5",
      "review": "The movie was kind of a cliché action love story. The action scenes were graphic but stale ( the choreography was mediocre), the plot was predictable and stagnant ( if you are an avid action movie watcher this will not impress)"
    },
    {
      "rating": "4/5",
      "review": "Really enjoyed the storyline and performances. Be prepared for it be a little gory!"
    },
    {
      "rating": "4/5",
      "review": "Fun movie. Jack was entertaining and stuff like that"
    },
    {
      "rating": "4/5",
      "review": "Fun romp through the bad guys with Jack Quaid. Clever concept and looking forward to Novacaine 2."
    },
    {
      "rating": "4/5",
      "review": "Funny with a twist. Not for the weak stomached."
    },
    {
      "rating": "5/5",
      "review": "Great throwback movie with epic fight scenes"
    },
    {
      "rating": "4.5/5",
      "review": "A fun watch and overall Jack Quaid does a really good job in his role. It is almost similar in ways to his role as Hughie from \"The Boys\", but does work really well."
    },
    {
      "rating": "4/5",
      "review": "Good story line. Movie moves along at a good pace. Very entertaining. Well done."
    },
    {
      "rating": "4/5",
      "review": "Solid movie. A little bit funny, a little bit of action and a solid plot twist."
    },
    {
      "rating": "3/5",
      "review": "It was a really good movie and nice to watch it by myself on my birthday as well."
    },
    {
      "rating": "5/5",
      "review": "Fun and entertaining, this movie deserves to be watched on the big screen. While it’s not a masterpiece, it’s packed with action. I especially loved the slow-motion sequences!"
    },
    {
      "rating": "5/5",
      "review": "Parts were gory but overall very good movie"
    },
    {
      "rating": "0.5/5",
      "review": "A terrible movie that i do not like!"
    },
    {
      "rating": "3/5",
      "review": "The movie was average. It reminded my a lot of the Kick Ass movies."
    },
    {
      "rating": "5/5",
      "review": "Exciting. Not what I thought the movie was going to be about. My daughter recommended this movie to me I was not disappointed."
    },
    {
      "rating": "3/5",
      "review": "Dosis de violencia, un poco gore, con una trama un tanto absurda pero entretenida"
    },
    {
      "rating": "1/5",
      "review": "I went into this ready for a dumb, fun ride. But it was all dumb and no fun. The tone is all off throughout and I was constantly pulled out of the movie. Acting is atrocious. I should be fair and point out that I walked out within the first 45 minutes. My eyes were getting tired from rolling back in my head."
    },
    {
      "rating": "1/5",
      "review": "I haven't left a cinema mid show since Aquaman 2, but I did here. The premise seemed so fun. But despite the gross out gags / violence, I wasn't entertained. The story left a lot to be desired. I just left."
    },
    {
      "rating": "1/5",
      "review": "Worst movie I have ever seen!!!!'"
    },
    {
      "rating": "5/5",
      "review": "This movie was very graphic, but so ridiculously so that you had to laugh. I loved it! It was exciting, had a unique story-line, kept my attention, and was definitely a comedy. I'd even consider going again(and I don't do that)! Loved it!"
    },
    {
      "rating": "5/5",
      "review": "Action, humour & romance. Whats not to like?"
    },
    {
      "rating": "4.5/5",
      "review": "As incredible it might sound i trully enjoy this movie with funny moments mix with action/gore is crazy i laugh so hard at some of this moments very well recomeded."
    },
    {
      "rating": "0.5/5",
      "review": "I did not go to see this after reading some of the reviews ( I should have looked at them first). Continuous foul language. This is why I stopped going to any non-Christian movies. No sense in foul language, it adds nothing to the movie. I thought it would be funny."
    },
    {
      "rating": "1/5",
      "review": "Not at all what I expected. Thought a cute rom com with some action. This is a vulgar (language) violet movie. So much torture, but most of the torture was sitting through this movie."
    },
    {
      "rating": "3/5",
      "review": "A Jolt of Fun, But Does It Signal a Dull Year Ahead? Jack Quaid's turn as an unlikely action hero in 2025's Novocaine offers a refreshing, if slightly numbing, twist on the current action movie landscape. Quaid, known for his more comedic and everyman roles, embraces the physical demands of the genre with surprising agility and a healthy dose of self-aware charm. The film itself feels like a shot of adrenaline, delivering fast-paced action sequences and a plot that, while occasionally predictable, keeps the audience engaged. Novocaine plays with the \"ordinary person thrust into extraordinary circumstances\" trope, but injects it with a welcome dose of humor. Quaid's character, a mild-mannered dentist caught in a web of international espionage, is a far cry from the muscle-bound action stars we're accustomed to. His reactions are often hilarious, and his fish-out-of-water persona provides a constant source of amusement. However, while Novocaine is undeniably entertaining, it also falls into the trap of early-year releases that often feel like a \"just okay\" experience. It's a fun ride, but lacks the lasting impact of truly great action films. And, with having been going weekly to the theater for several years now, I can't help but notice the trend: when the early months of the year offer up a slate of merely passable films, it often foreshadows a less-than-stellar cinematic year overall (with the exception of horror, it seems). Novocaine is a solid popcorn flick, perfect for a casual night out. Quaid proves he can handle the action genre, and the film delivers on its promise of entertainment. But, it doesn't break any new ground, and it leaves me with a lingering sense of \"been there, done that.\" While I hope this isn't a harbinger of things to come, Novocaine serves as a reminder that we may be in for a year of more \"good enough\" than truly exceptional cinema."
    },
    {
      "rating": "3.5/5",
      "review": "**Novocaine** delivers exactly the kind of wild, over-the-top action-comedy ride I was hoping for—and then some. With Jack Quaid leading the charge (always a win), it’s a chaotic blend of painful-looking stunts, laugh-out-loud moments, and a surprisingly sweet love story underneath all the mayhem. The chemistry between the leads? Off the charts—you *get* why he’s willing to throw himself into absolute carnage to win her back. And speaking of carnage, the injuries here look **painfully** real. I flinched. More than once. Sure, the story plays it safe—predictable beats and all—but when the action’s this fun and the gags land this hard, who’s complaining? The creative ways people get hurt are both hilarious and horrifying (in the best way), and the slick special effects make it all pop. Honestly, I can already picture a franchise. If you want brutal laughs with a side of heart, this one’s for you."
    },
    {
      "rating": "4/5",
      "review": "STERBEN OHNE ES ZU MERKEN, WIE BEÄNGSTIGEND Nathans Leben ändert sich schlagartig als er sich dazu überwindet mit seiner Kollegin Shelly auszugehen. Doch Bankräuber nehmen Shelly als Geisel und um das einzige nicht zu verlieren was seinem Leben einen Sinn ergibt ist Nathan bereit alles zu riskieren. Denn auch wenn er keine Schmerzen spürt, er kann jede Minute an allem möglichen sterben ohne es zu merken. Mr. No Pain geht ca. 110 Minuten und ist ab 18 Jahren freigegeben. Wir haben hier eine Action-Komödie mit Jack Quaid (The Boys) in der Hauptrolle des sympathisch verpeilten Kerlchens. Etwas was man von ihm kennt, dennoch fühlt sich die Figur des Nathan nach mehr an. Dies liegt an seiner eigentlichen Tragik das quasi alles ihn töten könnte und er es nicht mal mit bekommen würde. Das nun auch noch die Frau entführt wird die in ihn mehr sieht als nur etwas worüber man sich lustig macht, lässt ihn zum Helden wider Willen werden. Jack Quaid spielt gewohnt solide und die Handlung dreht sich hauptsächlich darum Shelly zu finden sowie Nathan in verrückte Situationen zu werfen, die aufgrund seiner Besonderheit sehr komisch dargestellt werden. So ist ein Kampf in einer Küche mit heißen Geräten, eine Folter unter der man vor schreien einen zweiten Stimmbruch bekommen würde oder das töten mit mehr als seinen bloßen Händen herrlich amüsant inszeniert. Die Bösewichte sind für das was sie sein sollen klasse, gerade Ray Nicholson (Smile 2). Der Humor ist hervorragend, die tragische Figur Nathan ist klasse geschrieben und bietet Potenzial noch soviel mehr zu erzählen. Am Ende bleibt ein Werk das von vorne bis hinten Spaß macht. Die Kills sind einfallsreich, der Humoraspekt des Nicht wehtuns super und die Figuren bieten alle genug um einen nicht egal zu sein. Leider gibt es ein paar unlogische Dinge über die man aber lachend den Kopfschütteln kann. Von mir bekommt der Film 8/10 Punkten. Keine Schmerzen empfinden, ein Traum bei für jeden Zahnarzt Besuch oder jeder Prostatauntersuchung."
    },
    {
      "rating": "5/5",
      "review": "Not a dull moment and was actually a pretty funny film I enjoyed it."
    },
    {
      "rating": "4.5/5",
      "review": "The movie was pretty cool, previews made it seem like it wasnt going to be great but it was. Definitely a movie that should be seen in theaters"
    },
    {
      "rating": "4/5",
      "review": "This Movie has Funny Moments but this has streaming written all over it this should of been on Netflix not in Movie Theaters."
    },
    {
      "rating": "5/5",
      "review": "WHAT A GREAT RIDE! AND A SURPRISE TOO!!"
    },
    {
      "rating": "1/5",
      "review": "This was an absolutely stupid movie. Very fake. Not funny. Ridiculous."
    },
    {
      "rating": "4/5",
      "review": "Thought it was going to be slightly different but a fun action love story comedy."
    },
    {
      "rating": "1/5",
      "review": "Just over the top grossness, due to all the horrifically disgusting injuries. The injuries might not hurt the hero, but it sure was painful to watch. We walked out. If you like movies like Saw, maybe you’ll like this. Otherwise, pass."
    },
    {
      "rating": "5/5",
      "review": "Wow way better than I thought. A must see!!"
    },
    {
      "rating": "3/5",
      "review": "It was funny , had lots of action but kind of corny and played out"
    },
    {
      "rating": "4/5",
      "review": "I had an absolute blast with this movie! I loved the action and the funny ways Nathan gets into danger. The slight twist was good. Overall great movie if you're looking for a decent action comedy."
    },
    {
      "rating": "5/5",
      "review": "This movie was so fun and brutal. The physical comedy was so grotesque and hilariously shocking to watch unfold."
    },
    {
      "rating": "4/5",
      "review": "It was funnxy and had a lot of action"
    },
    {
      "rating": "2.5/5",
      "review": "I had high hopes for this movie but it didn’t deliver. Was slow at times and never gave us the humor or action it was advertised as."
    },
    {
      "rating": "5/5",
      "review": "so funny, hilarious and really good fight scenes"
    },
    {
      "rating": "5/5",
      "review": "Funny and action packed my whole family loved it!!!!"
    },
    {
      "rating": "4/5",
      "review": "Surprisingly better than I thought and whole lot more graphic"
    },
    {
      "rating": "4/5",
      "review": "A bit gruesome in spots but overall we loved it!"
    },
    {
      "rating": "5/5",
      "review": "Genuine good movie with a great twist, felt like being in a theater watching an attention-grabbing again."
    },
    {
      "rating": "5/5",
      "review": "Enjoyed the movie funny drama movie."
    },
    {
      "rating": "5/5",
      "review": "Very funny and action packed!"
    },
    {
      "rating": "5/5",
      "review": "Finally something different from Hollywood what a nice change. This movie was good and funny!!"
    },
    {
      "rating": "2.5/5",
      "review": "Decent but not great"
    },
    {
      "rating": "0.5/5",
      "review": "A complete waste of time and money. An unecessary bloodbath in a quite interesting and original premise. Jack Dennis is such a good actor, but totally lost in the gory ridiculous movie."
    },
    {
      "rating": "5/5",
      "review": "Great action pack movie."
    },
    {
      "rating": "5/5",
      "review": "gorey and funny was better than I thought it would be"
    },
    {
      "rating": "4/5",
      "review": "It was silly but kinda fun"
    },
    {
      "rating": "4/5",
      "review": "Directors Dan Berk and Robert Olsen have made one of if not the most entertaining movie I have seen so far this year. The kill scenes in this movie are just so creative and overtime suspense starts to build to where you start to think on how much Jack Quaid's character Nate can endure."
    },
    {
      "rating": "5/5",
      "review": "Fun movie and funny."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Absolutely awesome."
    },
    {
      "rating": "4/5",
      "review": "An absolute blast - and the journey from the gentle opening to the crazy finale is such a fun ride! Gruesome, gory and consistantly VERY funny!"
    },
    {
      "rating": "2/5",
      "review": "Sacrificed plot and character development for the no-pain gimmick. If you want to see continuous unrealistic injuries, you will love it. This movies easily could have had it all and been the full package."
    },
    {
      "rating": "4/5",
      "review": "Excellent movie. Unique movie that keeps getting more intense as it goes along. There are some good laughs in it as well"
    },
    {
      "rating": "5/5",
      "review": "THE best filme, congratulações!!"
    },
    {
      "rating": "1/5",
      "review": "Quaid plays the same meek and fearful character he plays in all the movies/TV shows I've seen. My wife and I had to walk out 40 minutes into it. I suspect, according to reviews, that it got much better, but boredom overtook us."
    },
    {
      "rating": "5/5",
      "review": "Funny, action filled, and an all-around great story. 10/10 would recommend."
    },
    {
      "rating": "1.5/5",
      "review": "Not much to say. Maybe the positive is that it reminds me of the 1980’s type of storyline? Do not recommend."
    },
    {
      "rating": "4/5",
      "review": "(SPOILER ALERT) Novocaine is exactly the kind of movie you sit down with on a casual evening — chips in one hand, glass of wine in the other — and just enjoy. It doesn’t try to be groundbreaking, nor does it need to be. It’s a simple and entertaining action-comedy with a fun premise and a likable protagonist. Nathan Cain (Jack Quaid) suffers from a rare condition that prevents him from feeling physical pain. Rather than using it as some kind of superpower, he lives a cautious, low-profile life. That is, until his coworker — who he just so happens to be falling for — gets kidnapped, and Nathan decides to go full vigilante. The story is straightforward and uncomplicated, but thanks to a few clever ideas and some solid humor, it works. Jack Quaid plays Nathan with endearing awkwardness, gradually transforming into a kind of homegrown action hero — no training, just sheer determination. The action scenes are well-executed, the visuals are decent, and the comedy mostly stems from Nathan’s inability to feel pain, which is used to great effect (especially in the torture scene, which is both absurd and hilarious). The film does lose a bit of steam in the second half, dipping into some predictable genre tropes, but it never completely derails. It maintains a fresh tone, even if it leans into clichés by the end. Its biggest drawback is that it’s not really a “cinema experience” — most people will probably enjoy it more at home than on a big screen. All in all, Novocaine is a light-hearted action comedy with a fun concept that may not be fully explored, but still delivers as an enjoyable watch. |7/10|"
    },
    {
      "rating": "5/5",
      "review": "The perfect film with an indie vibe, wit, and epic performances"
    },
    {
      "rating": "5/5",
      "review": "This movie was very fun and entertaining!"
    },
    {
      "rating": "4.5/5",
      "review": "Well done, fun movie! Enjoyed everything about this film. Casting was perfect."
    },
    {
      "rating": "4/5",
      "review": "Easy turn off your brain movie, probably wouldnt watch again but it was still solid."
    },
    {
      "rating": "1/5",
      "review": "Clearly pathetic.it appears the movie storyline/ direction is to win the most violent baseless movie of 2025- are there such awards? Quaids acting was ok, but overall a movie I could easily miss."
    },
    {
      "rating": "4.5/5",
      "review": "Jack Quaid is a phenomenal actor! Great overall cast. Funny innuendos throughout the movie. Character development of the cops was not full and thus alas no 5 stars."
    },
    {
      "rating": "5/5",
      "review": "great story, has drama, comedy, and action alliance one, would have liked for love scene to be much more than brief,.. will watch it again!"
    },
    {
      "rating": "2/5",
      "review": "Well...this is a fantasy movie of course but the writers forgot to write a script where the audience is not dumb. At the end the lady should've been in death row....not only a few months in jail. See the movie and it's a Walt Disney movie."
    },
    {
      "rating": "4/5",
      "review": "Essentially, this movie is about a guy falling in love and getting a promotion and his misadventures along the way. I'm not really an action movie lover, but I noticed that this has some of that in it. In short, it's a movie about banking, romance, guns, a guy with a genetic disability, step-siblings, and car chases. Personally, I went for the genetic disability, and I wasn't disappointed."
    },
    {
      "rating": "5/5",
      "review": "Been waiting for this movie for months. Didnt disappoint. Funny, good story, perfect nepo casting. :)"
    },
    {
      "rating": "4/5",
      "review": "My kind of film! So adorable and fun and such great acting all around. Also great soundtrack. And no violence against animals!"
    },
    {
      "rating": "5/5",
      "review": "Novacaine delivers one of the most original premises Ive seen in a long time, brought to life brilliantly by Jack Quaid in the lead role. While the film leans heavily on exposition, it feels necessary to set the stage for the wild, unexpected ride that follows. I initially went in with low expectations — a friend wanted to see it, and I didnt think it was my kind of movie — but I was pleasantly surprised. There are more than a few laugh-out-loud moments, thanks to how fresh and unpredictable the humor feels I hadnt seen jokes play out quite like this before. Its absolutely worth the time, and Ill probably be telling everyone I know to check it out."
    },
    {
      "rating": "5/5",
      "review": "So fun and fast action like Bullet Train."
    },
    {
      "rating": "5/5",
      "review": "Love the action, the blood and the romance!!"
    },
    {
      "rating": "4/5",
      "review": "Fun, original, and a good time at the movies!"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Entertaining!"
    },
    {
      "rating": "5/5",
      "review": "Great movie, we drove an hour to watch, and it did not disappoint."
    },
    {
      "rating": "5/5",
      "review": "Started off slow but definitely picked up the pace. Great movie"
    },
    {
      "rating": "5/5",
      "review": "Novocaine blends intense action with dark slapstick comedy. Jack Quaid goes from the 40-Year-Old Virgin to John McClane, battling sadists and his own absurd sense of decorum. A heartfelt adrenaline shot."
    },
    {
      "rating": "5/5",
      "review": "Funny and entertaining!"
    },
    {
      "rating": "4/5",
      "review": "Very good action comedy!"
    },
    {
      "rating": "4/5",
      "review": "Really great movie, and it takes some time to get enjoyed with it, all in all awesome movie!"
    },
    {
      "rating": "3/5",
      "review": "Its okay. Some creative action. But theres something missing in the character development."
    },
    {
      "rating": "4/5",
      "review": "Enjoyable classic style action movie. Has a decent bit of gore so stay away if you're squeamish."
    },
    {
      "rating": "3/5",
      "review": "It takes a little time for the movie to set up the premise. That said, it is set up well and you like the main character. The execution of the premise is not bad either. The story of a person who cant feel pain doesnt get too gritty, but it does get gruesome. Itll certainly keep you awake. I do feel they were running out of ideas towards the end about how keep the premise entertaining, but I had fun with what we got."
    },
    {
      "rating": "5/5",
      "review": "If I rented it at block buster I’d buy it right after."
    },
    {
      "rating": "4/5",
      "review": "Pelicula divertida, me gusto el personaje de Novocaine es interesante ver como el amor puede ser un movilizador para salir de tu zona de confort. Invito a que la vean y se diviertan."
    },
    {
      "rating": "5/5",
      "review": "I love this movie so much it is peak cinema and i love jack quaid"
    },
    {
      "rating": "5/5",
      "review": "A great and funny movie"
    },
    {
      "rating": "2/5",
      "review": "I honestly laughed once very hard at this movie and it was due to the absurdity of the scene over the cleverness of it. The overt gore (borderline torture porn except for the hero being unable to experience physical torture) and the sloppy writing make the majority of the movie almost unwatchable. The acting is believable and the motivations are fine - but getting anything to connect in Novacaine takes a wild leap of reason that I a cannot muster. Ok, so we have a guy who has lived his entire life with the concern that he will be dead tomorrow if he strays from his rigid routine of liquid food (so he doesn't bite off his tongue), careful driving (I don't know why), and putting tennis balls on every corner of his office at the bank (because apparently he can't identify if his body is jolted from hitting something sturdy like a desk). Oh, also he has to leave conversations awkwardly instead of snoozing his alarm for 1 minute to pee so his bladder doesn't burst. But he also tattoos himself with abandon and CAN be an action hero without biting off his tongue or having a blood loss that actually kills him accidentally I ask a lot from movies - I get it. I want one that adheres to it's premise. If you're going to write something and send it to theaters, have the writing make sense in the world you've created."
    },
    {
      "rating": "5/5",
      "review": "LOVE this movie! Action-packed and hilarious!"
    },
    {
      "rating": "4/5",
      "review": "So good! Laugh out loud humor. Love story. Make you jump action. Loved it!!"
    },
    {
      "rating": "4/5",
      "review": "He's a man who doesn't feel pain, and they knew how to take advantage of that. An entertaining film with a good dose of action."
    },
    {
      "rating": "0.5/5",
      "review": "Nice things to say about this movie… Offbrand Plaza? Idk just why do these films need to be made? Literally nothing original or interesting to contribute. Two mildly interesting parts are already in the trailer. Save your time. I feel for people who are wasting $14 to see this."
    },
    {
      "rating": "3/5",
      "review": "The movie had it’s funny moments but the plot was rather lame and disinteresting once you figured out what was going on."
    },
    {
      "rating": "3.5/5",
      "review": "While there were cliche moments, it was still a fun ride. Enjoyed the humor and the acting by Jack Quaid is spot on. I just wish they had built Nate and Sherry's relationship a bit more before the whole robbery."
    },
    {
      "rating": "5/5",
      "review": "A fun movie that should be seen in theater. Predictable but did not take away from the charm. Jack Quid is adorable and you can see his parents Meg Ryan & Dennis Quaid in his face. Always great to see Jacob Batalon in a film. Always the dependable sidekick. (Love him!) Surprised to learn the bad guy was Jack Nicholson’s. Jack Quaid has a promising career ahead of him & never disappoints."
    },
    {
      "rating": "4/5",
      "review": "Exactly what I thought it would be. If you go in with no expectations, you will enjoy the film."
    },
    {
      "rating": "2.5/5",
      "review": "It’s fine. Entertaining but it’s basically just dragging out the same joke about a disability the whole time and the plot is filled with holes. Nothing special"
    },
    {
      "rating": "5/5",
      "review": "I loved the movie. It was awesome and funny. I went to see it yesterday, and there were free posters left out. No worries, I only took one, and it's collectible. I plan on keeping forever and hopefully one day have it signed by the cast."
    },
    {
      "rating": "2.5/5",
      "review": "Clean, responsible, safe and wholesome family fun. That in no way, gives away the major plot twist completely unnecessarily half way through the film depriving it of any notable emotional impact."
    },
    {
      "rating": "4.5/5",
      "review": "Absurd silliness. Enjoyed the movie."
    },
    {
      "rating": "1/5",
      "review": "We read the reviews and were excited to see Novocain. Unfortunately, it started out very slow and then became a dumb movie with extremely grotesque violent scenes. I wont recommend this silly film to anyone. The previews made it look funny and wild, but Novacaine is boring and Slapstick.."
    },
    {
      "rating": "5/5",
      "review": "Honestly best film i have seem in a while. Expected nothing and it overdelivered. Its like Deadpool, but much much better. Original without Ryan Reignolds shitty jokes"
    },
    {
      "rating": "5/5",
      "review": "It was a good movie full of action."
    },
    {
      "rating": "4/5",
      "review": "I would do the same if she looked into my eyes like that"
    },
    {
      "rating": "5/5",
      "review": "Great movie! So intense and gruesome. Will watch again."
    },
    {
      "rating": "2.5/5",
      "review": "All the lead bad guy was missing was him shouting \"I'm crazy you know\""
    },
    {
      "rating": "4/5",
      "review": "Really enjoyed this movie. It was a fun laugh full ride. The fight scenes were amazing"
    },
    {
      "rating": "4/5",
      "review": "8/10 for me Don't watch the trailer! Much skill and accomplishment displayed here. Many good B movies emerge from the same template. Take an original, simple premise; hire a bunch of new faces, then, develop each character as much as possible. A subtle, key difference separates lousy Grade B movies from good ones. The good ones have actors who shine in their roles and there are no wasted characters. The female lead, villains, supporting cop characters and the comic relief character (Jacob Batalon, take a bow!)--all exceeded my expectations. This does not happen by accident. It take script changes, good directing and committed acting. One critic called the violence Looney Tune-esque, another to the Three Stooges. No. The correct comparison is the Saw horror movies. This is a \"Taken movie\" with some humor overtones of Saw."
    },
    {
      "rating": "4/5",
      "review": "Cinematography was absolutely amazing. I loved the slow motion action, and the color grading. Storywise it was solid if you don’t over analyze how unrealistic it can be."
    },
    {
      "rating": "5/5",
      "review": "Hilarious and over the top."
    },
    {
      "rating": "5/5",
      "review": "This movie didn’t disappoint me, it’s actually good"
    },
    {
      "rating": "5/5",
      "review": "I knew nothing about this movie except my husband wanted to see it (and the theater sold booze). Totally enjoyed this movie, action and humor. perfectly cast. Jack Quaid was awesome."
    },
    {
      "rating": "5/5",
      "review": "I love the action, the unique idea, the love story and the end.... pretty gross sometimes but love it!"
    },
    {
      "rating": "3.5/5",
      "review": "Great movie. This one is not a superhero movie. It’s more of the opposite of that. Fun and entertaining."
    },
    {
      "rating": "2/5",
      "review": "Not funny and the acting was mediocre. Dont waste your time and money."
    },
    {
      "rating": "3/5",
      "review": "It was fine. Some action, some comedy. Nothing special."
    },
    {
      "rating": "5/5",
      "review": "Funny and entertaining! Really enjoyed this movie."
    },
    {
      "rating": "1/5",
      "review": "Horrible bloody movie. I was so sick to my stomach and see nothing funny about it from the break in to the Bank and after. My friend and I left after we saw what happened with the tattoo artist. I would be ashamed if I was Quaid to even be in this movie. We got our money back and left to shop and have a nice afternoon."
    },
    {
      "rating": "4/5",
      "review": "I liked it!! Very funny movie almost had Deadpool vibes. This character goes to hell and back for the co worker that stole his heart. Couple twists keeps it interesting. It has a good ending I definitely recommend this for an entertaining couple hours"
    },
    {
      "rating": "3.5/5",
      "review": "Definitely worth watching to see very funny.. Quaid looks like classic Max Payne paying from the video games kicking ass 🥊"
    },
    {
      "rating": "4/5",
      "review": "Fun and entertaining. Wish they could make movies without all of the language though."
    },
    {
      "rating": "5/5",
      "review": "So well done and executed. Great characters, kills, and fun"
    },
    {
      "rating": "2.5/5",
      "review": "needed more action but it was fun and predictable"
    },
    {
      "rating": "5/5",
      "review": "Good story. Much action! Just when you think it's over, it's not! Highly recommend!"
    },
    {
      "rating": "3.5/5",
      "review": "Lots of fun even if the logic didn’t always work. And it a a Christmas movie!"
    },
    {
      "rating": "5/5",
      "review": "excellent movie really funny really good action in The Twist you don't really see coming"
    },
    {
      "rating": "3.5/5",
      "review": "Novocaine was a fun romp with a few laughs, twists, turns and a satisfying enough ending. Jack Quaid is awesome as usual and the supporting players do a good enough job. I would definitely say watch it if you are not bothered by gruesome injuries."
    },
    {
      "rating": "5/5",
      "review": "Really great movie!!! Great cast, Great Action Sequences."
    },
    {
      "rating": "4/5",
      "review": "Started out a bit slow but overall a good entertaining movie."
    },
    {
      "rating": "3/5",
      "review": "Predictable but was entertaining to watch nonetheless"
    },
    {
      "rating": "3/5",
      "review": "Good movie, worth the watch."
    },
    {
      "rating": "4.5/5",
      "review": "It was way better than I expected it was suspenseful and heartwarming. The love story was so cute."
    },
    {
      "rating": "2/5",
      "review": "What world are we living in that this movie is getting this high of reviews? Watchable, sure, but 80%+ is too generous. The redeeming quality is that it doesn't go exactly where you think it will. I'm not giving anything away by saying the level to which this guys body gets mangled is beyond belief. Basic human anatomy is ignored in this story. He would have bled out multiple times. He could have been hurt in milder ways that would help the story be told in a more realistic manner. The law doesn't seem to actually be the law in this alternative universe. Apparently if you have a good heart it redeems you of all other wrongs."
    },
    {
      "rating": "5/5",
      "review": "Novocaine is a surprisingly well written movie that delivers laughs action and a good amount of heart go see it in theaters! it’s awesome!"
    },
    {
      "rating": "4/5",
      "review": "Dacă îți place lucruri grafice, acțiune, comedie,dar și niște dragoste, îți recomand acest film. Sunt unele momente care nu se leagă, dar în general este un film de văzut Îi dau 80 %,fiindcă unele lucruri nu prea au funcționat pentru mine."
    },
    {
      "rating": "3/5",
      "review": "Me when the robbers get out of the bank \"You know what would be a huge twist...\"."
    },
    {
      "rating": "2.5/5",
      "review": "The movie was entertaining, but predictable. The main character is weak and ineffective, saving the day by sacrificing his body. The whole story was revealed by the previews. San Diego was only shown in stock flyover scenes. Other than that, not a single scene was actually filmed in San Diego. Lots of opportunities to suspend your disbelief. Also lots of corny one-liners. \"Go Padres\" at Christmastime???"
    },
    {
      "rating": "3/5",
      "review": "It was definitely funny but Id say more of like a good movie to watch on Netflix. Nothing unexpected pretty straight forward writing."
    },
    {
      "rating": "4/5",
      "review": "Very violent but very good"
    },
    {
      "rating": "5/5",
      "review": "Started slow but picked up alot at the end truly amazing sorry and something different"
    },
    {
      "rating": "3.5/5",
      "review": "The plot is a bit illogical, but overall, it's enjoyable to watch."
    },
    {
      "rating": "4/5",
      "review": "randy quaids nephew is fine, although he needs to play an evil badass guy or a secret agent, anything other than the clueless white guy who has trouble with girls. expand your characters jack. also, i've seen enough sub saharan females on youtube to know that it's become rather stupid and unbelievable to keep shoe-horning african females into roles that are just silly. suspend your disbelief and like any movie you'll have fun. watch it."
    },
    {
      "rating": "4.5/5",
      "review": "Very good movie, the story line is very interesting and there are alot of funny moments int the film. It might be a bit too much for people who dont like intese graphic display of gore or blood."
    },
    {
      "rating": "4.5/5",
      "review": "Hell yeah!! This movie was fun and it was great to see more from The Boys actor in a major role. Really enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "Something different. Good story, action and comedy a little twist too it was exciting to watch :))"
    },
    {
      "rating": "2.5/5",
      "review": "The premise takes way too long to get to. When they do get to it, it's not very imaginative. The Bad guy is a cartoon character. It would be a good Netflix movie, but disappointing to have wasted a movie night out on it."
    },
    {
      "rating": "3/5",
      "review": "Entertaining to say the least I just wish it wasn’t so gory. I’d give it a 6/10"
    },
    {
      "rating": "5/5",
      "review": "Very entertaining, but kind’ve squeamish. You know that walking in though. Jack Quaid is turning out to be as entertaining as his father. First refreshing movie I have seen since covid hit. Jack Nicholson’s kid , Ray is pretty good too as the villain. They look a lot like heir fathers and act quite well also.👍👍👍👍"
    },
    {
      "rating": "4.5/5",
      "review": "This was good it was fun seeing that he had fear but feel no pain was dope the action was great the story was good they kinda ruined the plot twist cuz I did expect it but didn’t expect it but I give it a rating 9.5/10"
    },
    {
      "rating": "3/5",
      "review": "Interesting concept, but a little too much violence for me. Good cast, however!"
    },
    {
      "rating": "5/5",
      "review": "Well written, directed and executed by the actors. A standout experience"
    },
    {
      "rating": "2.5/5",
      "review": "Unnecessary violent. Had potential but went overboard."
    },
    {
      "rating": "5/5",
      "review": "A super fun ride! Loved the actors. Super fun!! 5 stars"
    }
  ]
}