[
  {
    "rating": "4.5/5",
    "review": "Francis Ford Coppola’s The godfather explores themes of power, loyalty, and family within the brutal world of organized crime with its rich storytelling and iconic characters it remains a landmark in cinematic history and is definitely a must watch for everyone."
  },
  {
    "rating": "5/5",
    "review": "Featuring the best cast ever whom deliver their best, \"The Godfather\" is a remarkable achievement in the gangster/crime genre, a part of the New Hollywood wave that succeeds in every aspect with mistakes being null."
  },
  {
    "rating": "4.5/5",
    "review": "Eterno clássico. Sei decoradas as falas dos personagens deste filme. Merece ser visto todos os anos"
  },
  {
    "rating": "5/5",
    "review": "I love this classic!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The best crime drama ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "One of the best films ever made. GOAT contender."
  },
  {
    "rating": "0.5/5",
    "review": "it insists upon itself"
  },
  {
    "rating": "3/5",
    "review": "Its ok i guess needs better acting and a less predictable plot"
  },
  {
    "rating": "5/5",
    "review": "A total classic, one of the best movies"
  },
  {
    "rating": "5/5",
    "review": "Easily the best movie I have ever seen, I have watched it 30 times , brilliant, the actors are the best of the best"
  },
  {
    "rating": "4/5",
    "review": "The movie shows how power can change a person and i really like character development he made. He starts off as someone who wants to stay out of the family business, but by the end, he’s fully in charge and maybe scarier than his father. The lighting, music, and acting all help show that transformation. Had sometimes where I was confused like when the girl he married gets blown up in the car and then a few minutes he is back at home asking a girl to be with him."
  },
  {
    "rating": "5/5",
    "review": "Well made and great story telling 10/10"
  },
  {
    "rating": "5/5",
    "review": "The Godfather might be the most well-crafted mafia film of all time. The acting, the atmosphere, the slow-burn storytelling; it’s pure cinema. Every scene is meaningful and iconic. While Goodfellas is still my personal favorite, The Godfather is a masterpiece in its own right."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films ever made. The reviewer GRAY W is an absolute moron stating the Minecraft movie is better. I created an account just to troll GRAY W. YOU SUCK."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie, I really liked the plot"
  },
  {
    "rating": "1.5/5",
    "review": "I will never understand why everyone says this is the greatest movie of all time its so boring I thought movies wre supposed to be entertaining"
  },
  {
    "rating": "0.5/5",
    "review": "It insists upon itself"
  },
  {
    "rating": "4.5/5",
    "review": "In the vast pantheon of cinematic art, there are few works that stand with such gravitas, such enduring significance, and such meticulous craftsmanship as *The Godfather: Part I*. Directed by Francis Ford Coppola and adapted from the novel by Mario Puzo, this film is not merely a triumph of storytelling—it is a masterwork of aesthetic composition, character development, moral inquiry, and historical resonance. It is a tale at once deeply intimate and broadly mythological, a parable of power, loyalty, transformation, and the dark undercurrents of the American dream. From the very first frames, *The Godfather* sets itself apart. The opening scene, in which the undertaker Amerigo Bonasera petitions Don Vito Corleone for justice, is emblematic of the film’s entire spirit—measured, deliberate, and steeped in tradition, honour, and the implicit codes of a world unseen by most. The lighting is subdued, the dialogue unhurried, and the mood heavy with portent. It is here, in this dimly lit study, that we are introduced to a world where justice is personal, where power is wielded not through public institutions but through whispered favours and silent debts. The film is not in a hurry to unfold its story, and rightly so—for the world it paints is one in which patience is not merely a virtue, but a necessity. Indeed, it must be said at the outset that *The Godfather* is a film of deliberate pacing. It does not conform to the demands of modern sensibilities which too often favour immediacy and constant motion. Rather, it moves with a stately grace, confident in the weight of its own story. Those who seek rapid thrills or the quick gratification of action without substance may find its rhythms unfamiliar, even daunting. But to those with the patience to listen, to observe, and to reflect, it offers riches beyond measure. The film is set in the years following the Second World War, a time of transition and turbulence in American society. The Corleone family, Italian immigrants who have carved out their empire through a combination of shrewd negotiation and calculated violence, stand as a symbol both of the immigrant’s ambition and of the moral compromises that such ambition may demand. Coppola captures this era with extraordinary attention to detail—the costumes, the vehicles, the music, the dialogue, and even the very air seem imbued with authenticity. One feels, not as though one is watching a recreation, but rather as though one has been transported wholesale into another time. The performances are uniformly magnificent. Marlon Brando’s portrayal of Don Vito Corleone is nothing short of legendary. With his gravelled voice, deliberate mannerisms, and penetrating gaze, Brando embodies a man who is both benevolent patriarch and ruthless strategist—a man whose love for his family is matched only by his willingness to do whatever is necessary to protect them. His presence is so commanding that even in scenes where he says little, the atmosphere bends around him. Yet while Don Vito may be the titular Godfather, the true arc of the film belongs to his youngest son, Michael, portrayed with astonishing restraint and emotional complexity by Al Pacino. At the film’s outset, Michael is an outsider to the family business—a decorated war hero, a university man, a figure of apparent virtue and detachment. He is the Corleone who is meant to forge a different path, to escape the cycle of violence and secrecy that binds the rest of his kin. But fate, as it so often does in tragedies both ancient and modern, intervenes. Through a series of events both personal and political, Michael is drawn into the heart of the family enterprise. It is in this gradual transformation that the film finds its most poignant power. We witness, over the course of three hours, a metamorphosis that is both chilling and inevitable. Michael becomes the very thing he once distanced himself from—not out of desire, but out of duty, out of vengeance, and, ultimately, out of an internal shift that he himself scarcely seems to comprehend. By the film’s end, he has assumed his father’s mantle, and in so doing, has lost something irreplaceable—his innocence, his soul, his future as a man unburdened by the weight of blood. What is most remarkable, perhaps, is the subtlety with which this transformation is rendered. There is no single moment when Michael \"becomes\" the Godfather; rather, it is a thousand tiny moments—a look, a decision, a silence—that accumulate until we realise, almost with dread, that the change has already occurred. Coppola’s direction here is masterful, trusting the audience to perceive the undercurrents rather than pointing to them. Equally compelling are the characters who orbit around Michael and Don Vito: Sonny, the volatile older brother whose temper proves both a weapon and a weakness; Tom Hagen, the adopted son and trusted consigliere, ever the voice of reason; Kay Adams, Michael’s fiancée, whose disillusionment becomes a silent commentary on the cost of power. Each is drawn with depth and care, and each serves to illuminate a different facet of the family and the world they inhabit. Thematically, the film explores the tension between personal loyalty and institutional corruption, between family honour and public morality. It asks difficult questions: Is violence justified in the service of order? Can love and cruelty coexist? Is it possible to wield power without being consumed by it? These are not questions with easy answers, and the film wisely refuses to provide them. Instead, it presents its world as it is—complex, contradictory, and heartbreakingly human. Technically, the film is a marvel. Gordon Willis’s cinematography, often bathed in rich shadows and golden light, lends the film an almost painterly quality. Nino Rota’s haunting score weaves itself through the narrative like a lament, at once romantic and elegiac. Every frame, every note, every movement seems carefully chosen, crafted with reverence for the story being told. In conclusion, *The Godfather: Part I* is not merely a film—it is a meditation on power, a lament for lost innocence, and a portrait of a family both bound and broken by the very forces that elevate them. It is a slow burn, yes, but one that glows ever brighter as it unfolds, illuminating the darkest corners of the human experience. To those who dismiss it for its pace, I say this: greatness is rarely hurried. And in the case of *The Godfather*, it is precisely in its patience, its poise, and its quiet, smouldering intensity that its true genius lies. I recommend it, then, without reservation, to any soul who values art that demands something of its audience—attention, reflection, and, above all, time."
  },
  {
    "rating": "5/5",
    "review": "High level movie making. Superb, James Caan is fantastic!"
  },
  {
    "rating": "0.5/5",
    "review": "just didn’t like this movie i didn’t have enough"
  },
  {
    "rating": "5/5",
    "review": "Después de ver The Offer tenia que ver nuevamente esta obra maestra, más aun con de todos los detalles que me dio la serie y que hacen de esta una película aún más grande. Que genio que era Coppola."
  },
  {
    "rating": "5/5",
    "review": "Considerado um dos mais importantes títulos da Nova Hollywood — movimento cinematográfico também conhecido como Hollywood Pós-clássica — esse filme transcendeu as restrições de sua era e seu gênero, estabelecendo novos padrões sobre o que poderia ser esperado do cinema — em todos os aspectos: técnico, artístico e narrativo — nas décadas seguintes e servindo de inspiração e modelo para cineastas de gerações sucessoras à de Francis Ford Coppola. Visualmente lindo como uma pintura feita a óleo, brilhantemente atuado e marcado por uma narrativa profundamente ambiciosa e complexa, \"O Poderoso Chefão\" é, para mim, mais que um exímio épico criminal: é uma das maiores obras de artes já feitas. E eu não estou falando apenas da 7ª arte."
  },
  {
    "rating": "0.5/5",
    "review": "Mid movie please save your time"
  },
  {
    "rating": "4.5/5",
    "review": "Unmistakably stylised, remarkably jagged in its portrayal of the empathetic yet brutal nature of the Italian mafia in the United States and strongly visual in it's visceral portrayal of the Corleone family, The Godfather is arguably the world's best masterclass on filmmaking with a legendary ensemble."
  },
  {
    "rating": "5/5",
    "review": "it insists upon itself"
  },
  {
    "rating": "5/5",
    "review": "A must see great story everyone can love"
  },
  {
    "rating": "5/5",
    "review": "The Greatest movie ever made!!"
  },
  {
    "rating": "5/5",
    "review": "If one movie can be called absolute cinema, it's this one."
  },
  {
    "rating": "5/5",
    "review": "Obra magistral! as atuação de Brando e Pacino são impecáveis e até atores secundários mantêm o alto nível, a historia prende do inicio ao fim, cenas bem construidas e visualmente impactantes enriquecem ainda mais a história, simplesmente o melhor filme de todos os tempos."
  },
  {
    "rating": "4.5/5",
    "review": "Classic!! Must watch for pop culture. Slow parts but great. Good writing and acting. Must watch this and then sequel its too good."
  },
  {
    "rating": "5/5",
    "review": "One of the Greatest Movies of all time and changed the standards of storytelling, do I need to say more?"
  },
  {
    "rating": "0.5/5",
    "review": "The most overglazed movie in history, it’s straight dogwater."
  },
  {
    "rating": "4/5",
    "review": "It's dark and Mafia theme make's it perfect in every other aspect of it . It show how we ( normal people ) See a Mafia and the death of sonny is just well done . The reason I took 1 star from it is - 1) The death of Vito feels bad ( He died due an heart attack because he was playing tag with is his grandson ) 2) The slow pace some time's make' it boring But still it holds up to be the best movie of the all time according most of the people . IMBD - 9.2 / 10 Metascore - 100 /100"
  },
  {
    "rating": "0.5/5",
    "review": "Ts not good, sorry to break the news to you all but it's honestly pretty bad. the acting is way less than desirable and I would honestly rather watch Joker 2"
  },
  {
    "rating": "1/5",
    "review": "Nothing about this movie was appealing to me."
  },
  {
    "rating": "4.5/5",
    "review": "The Godfather follows Michael Corleone, whose life takes a dark turn when his mafia family is targeted by rival gangs."
  },
  {
    "rating": "5/5",
    "review": "I don't buy into overrated 'classics' just because of their status and acclaim, but The Godfather really does justify its reputation. One of the greatest pieces of cinema ever made. The entire film is a masterpiece, especially the opening half an hour. A masterclass in filmmaking. Better than the second, but only just."
  },
  {
    "rating": "5/5",
    "review": "Masterpiece. One of the best movies of all time."
  },
  {
    "rating": "5/5",
    "review": "Arguably the best movie of all time."
  },
  {
    "rating": "0.5/5",
    "review": "This terrible, disgraceful paced movie is something I genuinely wish I never even thought of viewing, if you compare this movie to the greatness that is The Amazing Bulk, it is very clear how horrendous this is, it's not even a film, this is just scrap on a camera. The poor writing and unenjoyable screen quality makes me not even be able to sit down and watch this genuine repugnant so called \"work of art.\" Keep this disney sequel away from me."
  },
  {
    "rating": "5/5",
    "review": "A classic action/drama. If this movie was a food, then it would be one of the best and most high quality meals made by the top chefs in the world. And don’t get me started on the acting, the actors were absolutely perfect in every way possible. This is definitely in my top 5, beautiful and an absolute must see."
  },
  {
    "rating": "4/5",
    "review": "It is a great movie. I love how it maintains a very unique sinister vibe. It has a lot of characters but they were all very well introduced through repetition. I have horrible short term memory so I appreciate that. It could have been a little bit more polished during some scenes."
  },
  {
    "rating": "5/5",
    "review": "🌀COLLECTION RATING 98%"
  },
  {
    "rating": "3/5",
    "review": "The movie is from 1972. It is not of today's standards. The acting is mediocre. The story has loose ends. Some good action in the end, but mostly a lot of talking."
  },
  {
    "rating": "5/5",
    "review": "If you havn't seen this (Francis Ford Coppola) or 2001 Space Odyssey (Stanley Kubrick) you havn't seen cinema at its absolute best. Yes, in a tik tok world of irrelevant shorts, it's probably ever so relevant to this day. A mid 20th century expression which deals with immigration, war, family, survival and tradition."
  },
  {
    "rating": "5/5",
    "review": "(Buckle in, this is a long one) This is the first Al Pacino film I ever watched that made me sit up and think, \"Oh, so this is what it's all been about.\" I only recently started my journey into watching older movies, having been the type to stick to things made in my lifetime, and so I was only ever exposed to Al Pacino... maybe not at his worst but definitely not at his best either. Certainly, very forgettable. And so having the opportunity to see him at the height of his career really put into perspective why, exactly, so many of my older family members loved him. Also, I've got to say, he's incredibly handsome in this movie. I enjoy seeing a good-looking man on screen, so that was a nice bonus. Additionally, Marlon Brando was an absolute delight in this film. I'm aware that his reputation as a difficult actor is well known, but seeing him portray Vito Corleone was captivating, and I can only commend the person who decided to take a shot on him for this role. I came to care for Vito, seeing the character as a fully fleshed-out person and empathizing with him deeply. Building off that, I will say that as someone who has a tendency to watch a movie and get pulled out of it from thinking about the camera crew, how they captured the shot, how many takes it took, etc., I didn't have that problem here. I was immediately invested in these characters' lives, growing attached in the way that watching old family videos gets you attached to family members that passed long before your time. Loved it, 10/10, at least a yearly re-watch."
  },
  {
    "rating": "1/5",
    "review": "Didnt really find this movie GOOD at all i dont see how people like it"
  },
  {
    "rating": "5/5",
    "review": "Greatest movie ever everything is just perfect wolrd class actors amazing story every detail is there pure perfection"
  },
  {
    "rating": "5/5",
    "review": "One of the best films of cinema, totally masterpiece."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films of all time. Just see it"
  },
  {
    "rating": "5/5",
    "review": "Great but one complaint is that it insists upon itself"
  },
  {
    "rating": "5/5",
    "review": "The Godfather is moving family drama that invites you to look at reality from their point of view and never see it the same way again. The pacing is great, the acting is top notch (personally I was more impressed by Pacino's Michael Corleone than Brando's Vito), the music is haunting, and the twist at the end still shocks when I think about it. Most classic movies are overrated, but this is one that way exceeded my expectations. Oh--and it is one of the rare cases in which the movie is actually better than the book."
  },
  {
    "rating": "5/5",
    "review": "Pasaron más de 50 años del estreno de esta obra maestra, y van a pasar otros 50 y no vamos a volver a ver una obra de semejante magnitud."
  },
  {
    "rating": "5/5",
    "review": "Perfection! One of the most well crafted stories, best cast, and best acted films of all time."
  },
  {
    "rating": "2.5/5",
    "review": "Meh, it's overrated"
  },
  {
    "rating": "5/5",
    "review": "A classic, must see film"
  },
  {
    "rating": "5/5",
    "review": "The rise, fall, and rise again of a family. A Shakespearean story in the mafia world. Keep your friends close and your enemies closer."
  },
  {
    "rating": "3.5/5",
    "review": "It insists upon itself"
  },
  {
    "rating": "5/5",
    "review": "One of the best films I've ever seen, it clearly shows how the mafia, corruption, and family wars worked. The character development is excellent, and everything unfolds in a very well-orchestrated way. Al Pacino and Marlon Brando are exceptional. Definitely in my top 5 films of all time."
  },
  {
    "rating": "5/5",
    "review": "Nothing compares (yet)"
  },
  {
    "rating": "4/5",
    "review": "A great classic with a decent musical score"
  },
  {
    "rating": "4.5/5",
    "review": "Coppola’s godfather is a cinematic masterpiece, blending artistic substance with compelling storytelling. The direction, cinematography, and score are impeccable, and Brando and Pacino deliver unforgettable performances. Minor pacing issues aside, it's an essential watch for any film enthusiast."
  },
  {
    "rating": "5/5",
    "review": "Possivelmente o melhor filme já feito!"
  },
  {
    "rating": "4.5/5",
    "review": "Exceptional performances: The film features iconic actors, including Marlon Brando and Al Pacino, who deliver stand-out performances. Clever themes: The film explores themes in a clever and intricate way. Efficient opening: The film's opening is famous for its efficiency, establishing the story in a single set of scenes. Sympathetic characters: The film invites audiences to consider the Mafia on its own terms, and the character of Don Vito Corleone emerges as sympathetic and admirable. Complexity of family: The film's heart is the complexity of family, and themes of father-son relationships and ethical choices resonate with audiences across generations. Integrity: Vito Corleone's unwavering integrity is evident in how he conducts business, treats his allies, and deals with his enemies. Influence: The film continues to influence contemporary hit shows."
  },
  {
    "rating": "5/5",
    "review": "The Godfather is the king of cinema. Brando brings an iconic supporting role as Vito Corleone"
  },
  {
    "rating": "5/5",
    "review": "There's Gods and there are men. This film is above all else!"
  },
  {
    "rating": "5/5",
    "review": "Nothing for me to say that hasn’t already been said. 5 stars. El Padrino."
  },
  {
    "rating": "4.5/5",
    "review": "Absolute Story And Greatness"
  },
  {
    "rating": "5/5",
    "review": "Greatest film ever made. 100/100"
  },
  {
    "rating": "4.5/5",
    "review": "The godfather was a very exciting film. I think the violence and suspense is really good in the film"
  },
  {
    "rating": "3.5/5",
    "review": "A good movie, but personally, it felt underwhelming compared to how highly it’s spoken about."
  },
  {
    "rating": "5/5",
    "review": "Absolutely excellent. The Godfather will forever define American cinema as what it is today."
  },
  {
    "rating": "4/5",
    "review": "So far from what I’ve seen, it’s a great mafia themed movie! I definitely recommend it."
  },
  {
    "rating": "5/5",
    "review": "This film was one of the best films I have watched, for how long it was. The plot wasn’t just running for no reason. This movie was much ahead of its time and broke many of the rules at the time. The parallel editing was fascinating when Michael killed everyone in his way. They did a great job showing Vito and how he evolved as a person, to the moment he died. Michael also evolved. For the worst in my opinion but it was best for the family and he understood that. Great movie, recommend you watch."
  },
  {
    "rating": "5/5",
    "review": "A movie with an incredible example of how non-diegetic sound can impact the suspense with a memorable eerie soundtrack. The violence considered shocking at the time set the standard for violence in movies to this day. Whenever the plot seems to slow down it quickly corrects it with a murder or some action that shocks the audience. The only complaint about the movie is that Marlon Brando is very quiet and hard to hear in the beginning."
  },
  {
    "rating": "5/5",
    "review": "This film was so so good. I loved the story line and all the characters chosen. I think the violence was very shocking , I definitely did not expect some of the dearth’s that occurred. I think the gender roles portrayed in this film were very with the time, having the man “own” the women in that sense and we barely ever really saw main roles from the women. Overall I think this film deserves to be the number one best films of all times."
  },
  {
    "rating": "5/5",
    "review": "This movie is super good I really enjoyed watching it and the film at the time seems very new gen at the time."
  },
  {
    "rating": "5/5",
    "review": "This is an iconic and amazing film. It’s so iconic that it has been referenced in many different pieces of media, including a kids animated movie. I really liked how there was a visible change in Michael throughout the movie as he transitioned from war hero to the Godfather: his hair, clothes, demeanor. The one scene that stood out to me was the hospital scene with its ominous and anxious air, ghostly sounds and dreary lighting. I would 100% recommend everyone to watch this film."
  },
  {
    "rating": "5/5",
    "review": "The godfather is a great movie. The movie for sure holds up over the years because its story is so entertaining. The violence in the godfather is still considered as very violent even for films today with people getting stabbed through the hand or shot hundreds of times at a toll and shot through the glasses into an eye."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie, it was gruesome and the acting was good. It was really long and a little boring at sometimes but there were so many unexpected scenes that I loved. I loved how they incorporated oranges in the sense that if you saw one you knew a character was gonna die."
  },
  {
    "rating": "5/5",
    "review": "An absolute classic. Uses amazing use of colors to show diffrent parts, like more greys to show classic mafia settings, and colours to show emotion, Truly an amazing classic that I recommend others to see."
  },
  {
    "rating": "4.5/5",
    "review": "I recommend this movie, it was really good. I enjoyed watching it. Everything was good it was really said when Micheal’s wife died in the car. A lot of people died which was really said. The girls don’t really get no respect, they ethier get blown or beat, which is really said. Overall the movie was really good I would definitely recommend this to people."
  },
  {
    "rating": "5/5",
    "review": "This movie was excellent!!!!!!! The acting, the symbolism, the writing, the score, the explosions- all awesome. The story was so interesting and unique from other things I’ve seen. It was also very cool to watch such a revolutionary film years later. The acting and lines were so iconic and now I understand references in modern media! This is definitely a must-watch. It was spectacular!"
  },
  {
    "rating": "5/5",
    "review": "This movie definitely lives up to the hype of it being one of the greatest films of all time. Even 50 years later it still is a true classic that has barely aged. It has very famous actors that add to every aspect of the movie. It was also a new kind of movie at the time with it being post Hayes production code and one of the first movies to feature some of those aspects. Overall this movie was fantastic and a must see if you haven’t already seen it yet."
  },
  {
    "rating": "4/5",
    "review": "I honestly didn’t expect to enjoy Francis Ford Coppola’s The Godfather but was pleasantly surprised. Though it was pretty confusing— between the multitudes of characters, accents, and general old film audio quality— I enjoyed its story progression, music, and acting. Not sure if I would personally consider it one of the best movies of all time, I understand why some would."
  },
  {
    "rating": "4.5/5",
    "review": "I think this was an very good movie with amazing cuts and parallel editing especially the bapstium scene showing to very important parts of the movie at the same time. I also think the character development was a very cool part of the movie mainly Micheal who is a war hero turned to a mafia boss that kills everyone against him."
  },
  {
    "rating": "2.5/5",
    "review": "Godfather is a good movie but it’s not great for me. personally I don’t necessarily like long movies but this one was had a good pacing. One thing I loved about this movie was the lighting on people who are talking the ones that aren’t. Overall I didn’t like the ending I feel like they could’ve done more with the women characters gave them more of a story to tell."
  },
  {
    "rating": "5/5",
    "review": "I thought this movie 100% lives up to all the hype and is a true masterpiece. Coppola perfectly weaves the story together and never loses the viewers attention even though it’s a long movie. The cast is very stacked and all give great performances. I look forward to watching the next 2"
  },
  {
    "rating": "5/5",
    "review": "I absolutely recommend this movie to anyone who loves a long film filled with action, suspense and drama. The movie takes place in the 1940’s centered around the corleone family and the other 4 crime families and there fighting for power within. At the ending of the movie I really liked Michael’s transition from a young man who didn’t want to be involved with the family business but in the end he eventually takes over and becomes the Don and did everything he promised he wouldn’t."
  },
  {
    "rating": "5/5",
    "review": "This is probably the greatest film franchise I’ve watched I’ve honestly become obsessed with the god father and I think the movie can teach you many things about morals and philosophy I love how the story develops and all the little details put into it this movie makes even side characters very important and that’s what I like about it I believe that some of the deaths are what made the movie so good and emotional I don’t think it’d be the same without them dying but I would still prefer if they didn’t die overall I give this film a 10/10"
  },
  {
    "rating": "5/5",
    "review": "The best Christmas movie ever made"
  },
  {
    "rating": "5/5",
    "review": "It's a masterpiece. The story is well-crafted and perfectly reflects Mario Puzo's book, even enhancing some aspects of it. The cinematography and editing are clean, unobtrusive to the events, just as editing should be. Above all, the performances and charisma of Marlon Brando and Al Pacino elevate everything to an unparalleled level. An essential classic."
  },
  {
    "rating": "5/5",
    "review": "The greatest movie of all time in all Cinema Marlon Brando Al Pacino James cann Robert Duvall my favorite movie and they need to come out with a part 4"
  },
  {
    "rating": "4.5/5",
    "review": "\"The Godfather: A Timeless Masterpiece\" \"The Godfather\" is a cinematic classic that has left an indelible mark on film history. The story unfolds within the complex and secretive world of the Corleone crime family. At its core, it's a tale of power, loyalty, and family bonds. The characters are richly drawn. Don Vito Corleone, played with gravitas by Marlon Brando, is a figure of both respect and fear. His wisdom and ruthlessness shape the family's destiny. Al Pacino's Michael Corleone undergoes a remarkable transformation from an innocent outsider to a calculating and powerful leader. The film's cinematography is stunning. The dimly lit rooms, the grandeur of the Corleone estate, and the gritty streets of New York all contribute to the immersive atmosphere. The score by Nino Rota is iconic, enhancing every emotional beat. The themes explored, such as the price of success and the blurred lines between right and wrong in a criminal underworld, are deeply thought-provoking. \"The Godfather\" is not just a crime drama but a profound exploration of human nature, family dynamics, and the allure and perils of power. It has set a standard that few films have been able to match, remaining a must-see for cinephiles and a symbol of cinematic excellence. I usually use these two sites for more free movies and short dramas.If you have a better website, please recommend it to me. Thank you https://omnishort.com/？utm_source=rottentomatoes https://nightgod.tv/？utm_source=rottentomatoes"
  },
  {
    "rating": "5/5",
    "review": "The best way to begin with a great franchise."
  },
  {
    "rating": "4/5",
    "review": "is it a 5? No, but it comes far closer than Goodfellas, which is its only serious rival amongst American mob movies. What it has: characterization, possibly the best I've seen in all Hollywood cinema; character growth and development within a solid structure, with a beginning, middle and end, and a compelling tale which only suffers from lacking what appears to be a central dilemma. Weaknesses: although it has a structure, it has a historical feel (though not episodic in the way Goodfellas is) in that it narrates a sequence of events rather than a forcible, necessary logic of inevitable occurrences that issue inevitably around the resolution of one central dilemma. Some of the action feels contingent rather than necessary. The movie also feels rather literary and a tad detached from the viewer, perhaps because of its supreme control; it just doesn't have the immediacy of life, rather it views like life at a remove."
  },
  {
    "rating": "5/5",
    "review": "4/4 When life imitates art, you know it's among the most legendary films in history. Right at the top of the mountain with the likes of Citizen Kane & it's own sequel The Godfather Part II."
  },
  {
    "rating": "5/5",
    "review": "If there was a perfect movie it was this movie, a classic and probably the best mafia movie out there definitely in my top 5 ."
  },
  {
    "rating": "1/5",
    "review": "The midfather"
  },
  {
    "rating": "5/5",
    "review": "I think this has to be a 5 star film. Its a classic. One a much beloved picture that I would love to see on the big screen. The story, the casting, the acting, the tight script, the score/theme, even the Godfather logo at the beginning of the film is so memorable. I haven't seen part two yet but I'm about to. I've heard good things."
  },
  {
    "rating": "5/5",
    "review": "My first time ever seeing this movie i thought i was not going to like it at all. I’m still only 16 years old and still going on my journey to be a hard core movie buff. Having seen all the classics like a Quentin Tarantino ‘Pulp Fiction’ to a Martin Scorsese ‘Goodfellas’. I thought this movie would be a little to old school for my liking but after watching it I can say it is one of the greatest movies I have ever seen. You are truly uncultured if you have not seen this masterpiece of a film by Francis Ford Copela, and the top notch acting by James Dean, Marlon Brando and of course Al Pacino. These scene are so embedded in the culture of movies today which is what makes this such a masterpiece. So many classic lines in this movie! I truly believe that movies like Goodfellas, Casino, Pulp Fiction, or even Resivior Dogs or just any movie that was made after this would not have exist if it wasn’t for this movie. It truly marked the change of good cinema!!!"
  },
  {
    "rating": "5/5",
    "review": "Impressive story and very good character development. Michael started as simple guy not wanting to be involved in the crime business, but slowly develops to be a cunning mafia boss."
  },
  {
    "rating": "5/5",
    "review": "Melhor filme da história."
  },
  {
    "rating": "5/5",
    "review": "Marlon Brando created one of the most iconic characters in cinema, giving a majestic performance in a film that tells an incredible story, showing the captivating trajectory of Michael Corleone throughout the plot. I am impressed to see this character changing little by little until he becomes what he is at the end of the film. The Godfather is a perfect film, with scenes that make me want to clap my hands every 5 minutes."
  },
  {
    "rating": "5/5",
    "review": "Phenomenal. Can't believe it took me so long to watch this timeless movie. Watch Don Corleone's son step out of character into his new role as a mafia boss to protect his family. It's all about honour, and respect the Italian way in America."
  },
  {
    "rating": "5/5",
    "review": "Simply, THE GOAT!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Um clássico absoluto do cinema"
  },
  {
    "rating": "4.5/5",
    "review": "\"You ask me a favor on the day of my daughters wedding?\" \"LOOK HOW THEY MASSACRED MY BOY.\" This film produced so many quotes, absolute classic."
  },
  {
    "rating": "5/5",
    "review": "My favorite movie ever !"
  },
  {
    "rating": "5/5",
    "review": "The GOAT 🐐 This is the third time I have watched this cinematic masterpiece, which I consider to be the best film in history. The Godfather is not just a movie, it is an icon and an artistic painting in the world of cinema. It is the definition of cinema, a woven and wonderful story, legendary acting from Brando, and an imaginative character transformation from Al Pacino. Tyranny, control, power, arrogance, and money are all things embodied in the movie. The most important lesson in the movie is that if you are not a wolf, wolves will eat you, and if you do not take your rights into your own hands, there is no one to take them for you. The Godfather’s character, Vito Corleone, is a wise character with experience, knowledge, and intelligence. He has acumen in all his movements. He is a person of authority and strength and knows how to manage things. After Vito’s death, this personality was transferred to Michael, and we saw him begin to make important decisions and manage the family business. He officially became the godfather. Well, I am waiting to rewatch the second part to enjoy Michael’s character and the story. Vito in his youth. Well, we will discuss this later. Now let us stay with the first part. We have the splendor and multiplicity of personalities. Firstly, we have Sonny, who is the nervous character who solves his problems with his fist and has no room for discussion, as he represents strength. Secondly, we have Tom Hagen, who is the advisor who uses thinking and wisdom and studies. His steps before taking them. Thirdly, we have Fredo, who is a person with a weak personality. He takes the wrong side and his decisions are not sound. One of the beautiful things is the stage of Michael’s escape in Sicily, Italy. We saw the beauty of life and the atmosphere of the conservative villages and the romance between him and Apollonia. The opening scene was wonderful, giving you an atmosphere. Calm down and listen. The scene of eliminating the heads of families was the final step to impose absolute control and prove the dominance of the Corleone family. Well, in conclusion, it was amazing to re-watch the greatest movie ever"
  },
  {
    "rating": "5/5",
    "review": "The greatest film ever created, period. Marlon Brando, Al Pacino, James Caan, John Cazale, Diane Keaton, Robert Duvall and everyone else in the picture give performances of a lifetime. I believe The Godfather Part II is tied for all-time greatest motion picture with this one, but with a gun to my head, I guess I would choose this one, since it's the first installment. Though, I do truly believe they are equal in greatness. I don't just highly recommend, I insist. 100/100 🥇"
  },
  {
    "rating": "5/5",
    "review": "Masterpiece - it checks enough of the boxes for being rewatchable that I always justify a rewatch 1-3 years after the last time"
  },
  {
    "rating": "5/5",
    "review": "Filmes de máfia não ficam muito melhores do que esta obra prima de Francis Ford Coppola."
  },
  {
    "rating": "5/5",
    "review": "Excellent story this trilogy is the best movie trilogy of all time amazing acting all around and a great story about the Corleone family and Michael taking his dads place as the don."
  },
  {
    "rating": "5/5",
    "review": "greatest movie ever!"
  },
  {
    "rating": "5/5",
    "review": "A genialidade do cinema começa aqui. Uma trama envolvente que tem como foco principal a máfia italiana, a família e os conflitos entre os seus membros e inimigos. Ao acompanhar essa história me deparei com a mais perfeita obra prima já produzida pelas mãos de Francis Ford Coppola. Instigante, comovente, brilhante, impressionante."
  },
  {
    "rating": "4.5/5",
    "review": "Does \"The Godfather\" live up to the hype? I think that it does. This was my first time watching the #2 rated movie on IMDb and it did not disappoint. The film transports you to the world of organized crime and does so in such an elegant way. I forgot that I was watching a movie and was enveloped in the terrifying underworld of the mafia. The acting is superb, with one of the strongest casts of all time. Marlon Brando, James Caan, Robert Duvall, every single actor in this film made the characters feel real. These guys all do terrible things, yet you care deeply for them. While everyone else is phenomenal, the star of this film is Al Pacino. He made me so invested in the character of Michael and had a raw vulnerability to him. Starting as the boy who was estranged from the family business to then becoming the ruthless Don Corleone was remarkable to watch. The movie is long and there are some dry spells. The names of all the different characters can get a bit jumbled, especially without subtitles on the first watch. Both of those are probably just my ignorance, but I am eager for a second watch and to dive into the sequel. Best Character: Michael Corleone Best Quote: \"I'm gonna make him an offer he can't refuse.\" - Don Corleone Best Scene: Michael in the Restaurant (Honorable mention to \"Settling All Family Business\") Best Piece of Score: \"The Godfather Finale"
  },
  {
    "rating": "5/5",
    "review": "This film has become legendary and with good reason. It's a perfect film -well fleshed out and endearing characters, astounding performances, endlessly quotable script, great cinematography - You just feel so fully immersed in the world of the Godfather that when you realise the 3 hour run time is over, you feel like you could just keep going (queue up part 2)."
  },
  {
    "rating": "5/5",
    "review": "I DONT RATE FILM 5/5 BUT THIS I S MASTERPIECE IN ALL WAY LIKE DIRECTING CHARACTER DEVP STORY ACTING CUTTING SCENE ETC .. THIS IS MATERPIECE"
  },
  {
    "rating": "5/5",
    "review": "What is there to say about this movie that hasn't been said?"
  },
  {
    "rating": "5/5",
    "review": "One of the top three greatest movie of all time. Marlon Brando take his place in the history of cinema. A great adaptation of Puzo's book. Vito is a devoted family leader, without him the family would collapse as it happens in the second chapter of the trilogy. It's a perfect movie with great characters Sonny, Connie, Tom Hagen, and Michael that start a brutal transformation from the \"prodigal son\" to a despotic mob boss, who'll take whatever he wants with no sympathy for anyone around him. Stunning, perfect, brilliant, masterpiece everything's perfect here."
  },
  {
    "rating": "5/5",
    "review": "Multiple clashing and heart felt components within the movie with a wide range of subtle hints and links, the classic cinematography coordinates the movie’s unique appearance and well written plot with deeper depth as multiple conflicts between characters with the additional foreshadowing just adds to the greatness of this film. The overall beginning to the end is an absolute masterpiece and I wouldn’t hesitate to recommend such a great hit within the movie industry!"
  },
  {
    "rating": "5/5",
    "review": "Um verdadeiro clássico clássico do cinema"
  },
  {
    "rating": "5/5",
    "review": "Talk about a great movie. If you don't enjoy this movie you just don't love cinema and you just must hate Good story's."
  },
  {
    "rating": "5/5",
    "review": "The movie is a masterpiece"
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films of all time."
  },
  {
    "rating": "5/5",
    "review": "A thrilling movie that keeps you on your toes, with suspenseful action and a wonderful interesting feel. The perfect movie"
  },
  {
    "rating": "4.5/5",
    "review": "Is this the greatest mob movie of all time? I can say it’s one of the best."
  },
  {
    "rating": "3.5/5",
    "review": "This film obviously has a sense of realism in it that is not always seen in a movie. That's what makes it one of the best films according to critics. I wanted to see this movie mainly so that I could find a better understanding of Italians and discover a reason why this movie is so highly favored. I think I found that reason, so overall it was good."
  },
  {
    "rating": "5/5",
    "review": "I was 16 when I watched this grainy..low lit movie made 10 years before...I am nearly 62 and this movie transcends most from book to celluloid ..I doubt other than Dune for following we can come close to fictional charictures based on moguls or lesser gods we will ever encapsulate in time ..the DEPTH The cast,staging, direction, depiction..background...costume, lighting..just about everything is considered whether you like the story or not. Pacino ..De Nero..Caan, Shira & Keaton weave this web that is now part of cinematography at its best for telling tales...making us an offer we cannot refuse to watch 💐"
  },
  {
    "rating": "5/5",
    "review": "The one and only 5 star film with the 5 star sequel to match."
  },
  {
    "rating": "5/5",
    "review": "Best movie in the world!"
  },
  {
    "rating": "5/5",
    "review": "This is from a time when movies could take you away to another time and place and immerse you in the story. Outstanding character development. Beautiful visuals. World-class acting and directing."
  },
  {
    "rating": "5/5",
    "review": "Absolute classic, I don’t think I know anyone who has not seen and loved this movie"
  },
  {
    "rating": "5/5",
    "review": "The number one greatest mafia movie of all time"
  },
  {
    "rating": "5/5",
    "review": "A classic, of course 5 stars."
  },
  {
    "rating": "1.5/5",
    "review": "I only recently saw this. I honestly don't understand why there's so much obsession over this movie. If I can force myself I'll try it again to see what I'm missing but it was horribly boring."
  },
  {
    "rating": "5/5",
    "review": "Why is this film not a perfect 100"
  },
  {
    "rating": "5/5",
    "review": "Re-watched it still holdup."
  },
  {
    "rating": "5/5",
    "review": "Best movie of all time??"
  },
  {
    "rating": "5/5",
    "review": "9.1/10 That's it. That's my entire review."
  },
  {
    "rating": "5/5",
    "review": "This is an absolute masterpiece"
  },
  {
    "rating": "5/5",
    "review": "Arguably the greatest movie of all time!"
  },
  {
    "rating": "5/5",
    "review": "Masterpiece! Outstanding film"
  },
  {
    "rating": "5/5",
    "review": "I mean....it's perfect. Nothing else to say."
  },
  {
    "rating": "3/5",
    "review": "I found it very underwhelming compared to the decades of hype. I enjoyed ‘The Offer’ much more. It is a miniseries about the making of The Godfather. After watching ‘The Offer’ I figured I would finally watch. Bah humbug."
  },
  {
    "rating": "5/5",
    "review": "One of the best if not the best films of all time. Coppola's magnum opus"
  },
  {
    "rating": "5/5",
    "review": "An absolutely amazingly well acted, written and driven movie."
  },
  {
    "rating": "5/5",
    "review": "I think it's an \"old\" movie with soul of a modern era of cinema, it's awesome that after 50 years this movie still feels fresh and different. Of course you have to watch it understanding that it was the 70s, a lot of these \"modern\" mafia movies took inspiration on The Godfather."
  },
  {
    "rating": "5/5",
    "review": "Without a doubt the greatest movie of all time! Perfectly casted, beautifully put together, a masterpiece in every way possible. Movies don’t get better than the Godfather."
  },
  {
    "rating": "5/5",
    "review": "the greatest movie of all time"
  },
  {
    "rating": "5/5",
    "review": "Masterpiece that sets the standard for mob and crime movies"
  },
  {
    "rating": "5/5",
    "review": "It's an old film, times have moved on, people are different today, but don't underestimate the powerful performance and superb writing of this classic! Yes it's violent, gritty, even a bit staid at times, but after twenty years of avoiding this film, I quickly realised what everyone meant when they said you have got to watch the Godfather! I can't believe you have net seen the Godfather! Well they were right, a hell of a film and well worth the effort!"
  },
  {
    "rating": "5/5",
    "review": "Really enjoyed the organized crime aspect of the movie, and how it was a lot about planning to get ahead, the movie itself was very entertaining, never really a boring moment for such a long movie which I really enjoyed, would definitely recommend."
  },
  {
    "rating": "5/5",
    "review": "O melhor filme já feito."
  },
  {
    "rating": "5/5",
    "review": "One of the easiest 5-star ratings ever. For a movie made more than half a century ago, the brilliance of the acting and the expertly-conveyed descent of a man from an honorable person into a big-time crook makes this film much more of a joy to watch than most pictures which it has preceded. It's all about the tension, and the respect."
  },
  {
    "rating": "4.5/5",
    "review": "All around great movie and very entertaining."
  },
  {
    "rating": "5/5",
    "review": "The Godfather has quite a strong rich thrilling mafia feel that negotiates with a lot of aspects that makes it spectacular to watch."
  },
  {
    "rating": "5/5",
    "review": "This movie definitely entered my top 5 of all time. Amazing soundtrack, setting, acting, plot, everything about this movie makes it one of the greatest films of all time. There is almost nothing I would change, maybe just, what happened to the cat in the intro scene? Just kidding. This is the best film I've seen recently. The story keeps unfolding in a very interesting manner, with suspense, clear plot points, and also takes a little trip to Italy, creating a variety in scenery as well. Can't recommend this movie enough. Worth every minute."
  },
  {
    "rating": "5/5",
    "review": "For some this is their all-time favorite movie. I'm not in that camp, as Marlon Brando's performance seems like a caricature in hindsight, and there are simply a few other films I've enjoyed more. But make no mistake - this is an all-time classic and a must see! A young Al Pacino screams a lot less here, and Robert Duvall even appears to have some hair. (More than one actor from this 1972 Oscar winner also appear in 1976 Best Picture \"Rocky\".) PS The score for this film, similar to Jaws, Star Wars and The Sting, is iconic as well!"
  },
  {
    "rating": "5/5",
    "review": "The movie was really good I really enjoyed this movie and would recommend and watch again."
  },
  {
    "rating": "5/5",
    "review": "This is a must watch one of the best mafia movies I ever seen kinda reminded me of Scarface but better I would recommend it to anyone or to people who like crime movies 10/10"
  },
  {
    "rating": "4/5",
    "review": "This movie was very advanced for its time. It was a great mafia movie, with being very “violent” for its time. Great movie to binge watch."
  },
  {
    "rating": "5/5",
    "review": "The story is very detailed, and there is a lot to unpack. Each time you watch it you understand the story and characters more and more. The dark lighting suits the movie well also."
  },
  {
    "rating": "5/5",
    "review": "This movie was very very good. It was extremely entertaining but kinda confusing at times. I had a very good time watching it and seeing all the action was very cool as well."
  },
  {
    "rating": "5/5",
    "review": "I had very high expectations for this movie. It blew me away. This film is striking, from the dialogue to the lighting. This movie puts incredible effort into every detail of this film. The editing was made to make you feel so engrossed in the film, that each decision and death shocks and hurts you that much more."
  },
  {
    "rating": "4/5",
    "review": "Great movie which I think has a bit of something for everyone: action, comedy, drama, social commentary, great characters, etc. I can definitely see why so many consider this to be one of (if not the) greatest movies of all time."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed everything about this movie from the acting to the storyline. The storyline has a lot of moving parts, but I like that it forced me to watch closely! Additional choices from the music and several cool sequences (parallel editing, montages, etc.) gave the film more depth and innovative storytelling. I felt like the movie went at a good pace and covered a lot within the three hour span! I am glad I watched such an iconic film and learned that it does live up to the hype."
  },
  {
    "rating": "5/5",
    "review": "I think this was probably the best movie we watched so far. I liked the plot, music, and characters. My favorite was Vito. I also liked how so many modern day shows and movies reference this movie."
  },
  {
    "rating": "4.5/5",
    "review": "Really great story and beautifully directed."
  },
  {
    "rating": "4.5/5",
    "review": "An extremely well directed movie where you won’t ever know anyone’s next move. It has held up greatly and it’s easy to see why this is considered one of the best movies of all time"
  },
  {
    "rating": "3.5/5",
    "review": "I thought this movie was really good. It had some amazing action scenes and wonderful acting. The actors did an amazing job at really getting into character and feeling the same emotions. I would definitely watch this movie again. This movie was overall an amazing movie to watch."
  },
  {
    "rating": "3/5",
    "review": "I liked how much action it had, as well as the creative use of parallel editing. Still, I found it challenging to follow at times."
  },
  {
    "rating": "5/5",
    "review": "I’m not a fan mafia movie, but I tried to watch this film for the fourth time. And it so awesome like people say"
  },
  {
    "rating": "5/5",
    "review": "Just the best movie of all time."
  },
  {
    "rating": "5/5",
    "review": "Classic masterpiece of cinema... superb in every respect. Along with Part 2, should be in the top 10 of any movie buff."
  },
  {
    "rating": "5/5",
    "review": "The perfect film in my opinion. Nothing will ever change my mind.Great characters and dialogue and interactions, they are all so interesting and everything feels earned and the characters motivations and decisions make sense."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies of all time"
  },
  {
    "rating": "4/5",
    "review": "At first I thought the movie was going to be very boring and slow. Even though a lot of names were introduced very fast it was east to remember them. I enjoyed the movie a lot and i kept things interesting through out. Still a bit too long tho. Was not really what i expected. Fighting scene with sonny was also very bad hahha"
  },
  {
    "rating": "5/5",
    "review": "It was so worth seeing The Godfather on the big screen. Obviously, this is a 5 Star movie. If you have never seen it, or it has been years since you have seen it, if it is ever playing in a theater near you, you should definitely see it in a theater. I was hoping to see that The Godfather Part 2 would also be shown in theaters, but so far it doesn't look like it is on the schedule."
  },
  {
    "rating": "5/5",
    "review": "The start of my favourite movie trilogy ever."
  },
  {
    "rating": "5/5",
    "review": "Fantastic Restoration by Paramount!!!"
  },
  {
    "rating": "5/5",
    "review": "The evolution of Michael Corleone until he becomes the head of the family and Don Vito Corleone who manages to be a dangerous mobster, but kind to his family is what makes me love this film, in addition to the plots that revolve around them, for me this film is Great, one of my favorites. A evolução do Michael Corleone até virar o chefe da família e Don Vito Corleone que consegue ser um mafioso perigoso, mas amável com a família é o que me faz amar esse filme, além das tramas que giram em torno deles, para mim esse filme é ótimo, um dos meus preferidos."
  },
  {
    "rating": "5/5",
    "review": "I could give a lengthy long explanation why not just this movie but this series is incredible and the greatest 2 film run in cinema history . But I'll just tell you to give it a chance even if you don't like these kind of movies because it is the golden standard of cinema. Look at that you can't describe this film without a long lengthy explanation ! That's how good!"
  },
  {
    "rating": "5/5",
    "review": "10/10 best movies of all time"
  },
  {
    "rating": "5/5",
    "review": "The Godfather can be summed up in one word. First. Because it was the first to so many things that other mafia movies couldn't pull off successfully. The music was one of the best soundtracks I've ever heard in my life. The acting was one of the best I've ever seen in my life, the don specifically carried this movie on his back acting wise. This is the original mafia movie and is the predecessor for many more mafia movies. I highly recommend this movie for a movie lover or even the slightest fan of the mafia genre."
  },
  {
    "rating": "5/5",
    "review": "This was such a classic and best gangster movie of all time. It's still timely after 52 years. It's definitely worth the watch. Part 2 was almost as good (4.5 stars) and part 3 I'd give 3 stars."
  },
  {
    "rating": "5/5",
    "review": "Obra prima e melhor filme já feito"
  },
  {
    "rating": "2.5/5",
    "review": "It was fine. It did not live up to the hype. It is not a top movie of all-time, although it is a times an interesting look at the demise of man and corruption of power. It also has interesting moments to get some historical context of the mafia and Italian-Americans."
  },
  {
    "rating": "5/5",
    "review": "The classic of classics. I see it once in every 10 years, and it just gets more and more powerful. I would say the greatest film noir of all time, and transcending the particular genre anytime."
  },
  {
    "rating": "5/5",
    "review": "Terrific performances and the perfect brooding atmosphere make it a truly outstanding work. Why watch with popcorn when Heinz's Godfather sauce is the perfect accompaniment."
  },
  {
    "rating": "5/5",
    "review": "Terrific performances and the perfect brooding atmosphere make it a truly outstanding work. People say the second is better but it'd (literally) be nothing without the first. Cotton-balled Brando is amazing as the Don."
  },
  {
    "rating": "5/5",
    "review": "The most powerful criminal organization is the one that's kept in the family! As mafia don Vito Corleone maintains a strong grip on the criminal underworld, his younger son Michael is caught up in the violence and death that comes from his lineage, forcing him to pick a side before it's too late. Francis Ford Coppola manages to make this iconic crime thriller a deeply tragic story of familial blood lines and the strings attached to it!"
  },
  {
    "rating": "5/5",
    "review": "Want proof that nothing can please everyone? There are actually people who don't like this movie. For the rest of us, The Godfather is about as close to perfect as they come."
  },
  {
    "rating": "3.5/5",
    "review": "I do not really understand the hipe around this film. Its a good movie, don‘t missunderstand me. But in my oppinion it‘s nothing special. First is it way to long. It wasn‘t necessary to strech it like this. Then was the story relativ trivial. Usual mafia business, nothing really exciting. The acting was good and the soundtrack is so beautiful and fits perfect in the athmosphere, or it makes the athmosphere what it is. But the common thread is missing. There are random event‘s strung together."
  },
  {
    "rating": "5/5",
    "review": "Plot/storyline: Excellent. MVP of the movie: Al Pacino hands down. Everyone else were great in their roles, but watching Al Pacino transition into Michael Corleone, when he was never meant to get involved in the family business, has to be seen to be appreciated. Replay value: Strong"
  },
  {
    "rating": "5/5",
    "review": "I created this account just to write a review about this film, so this already expresses a little of my opinion, and I need to start by saying that this is probably one of the three best films of all time, if not the best film I've ever had the greatest pleasure in my life, and what can I say, this film is full of iconic cinema scenes, characters with different layers, I have one of the most perfect atmospheres conveyed in a film, this film is a phenomenon, and about the film being long I say that this The delay only serves to add layers and increase the action scenes, with direction that leaves me speechless, this film is a work of art and I take pleasure in speaking highly of this film."
  },
  {
    "rating": "5/5",
    "review": "The first 15 to 20 minutes are kind of a drag but after that it becomes the absolute masterpiece it is recognized to be."
  },
  {
    "rating": "5/5",
    "review": "Classic storytelling, many outstanding performances"
  },
  {
    "rating": "5/5",
    "review": "I can't believe I'm almost 40 and never seen this movie. First movie that keeps me away from my phone."
  },
  {
    "rating": "5/5",
    "review": "Everything is great. The acting, especially by Brando, and Pacino is terrific, the score is very good (though better in the sequel) the story is gripping and the story of Michael Corleone's rise to power is very compelling. 5 stars all around!"
  },
  {
    "rating": "3/5",
    "review": "It was ok but no way best movie of all time, Shawshank Redemption was much better in my opinion. One thing that really frustrated me was when they spoke in Italian and didn't translate."
  },
  {
    "rating": "4.5/5",
    "review": "es una película que es casi perfecta en cual aspecto filmográfico, el único pecado en que cae es que tiene una duración de 3 horas al alargar ciertas subtramos pero se complementa y justifica en el clímax de la película. \"the godfather\" es una película que consideraría universal y un referente, pues cada persona que empiece con el habito o el gusto de ver películas debe de ser de las primeras en verse."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest motion pictures. The Godfather is simply a masterpiece. The film is the perfect mob movie and holds a lot of historical importance. Coppola's directing is nothing less than masterful in this film. Everything is shot beautifully, and the use of light and shadow is great. However, the film's bread and butter is its story and 2 lead characters. Marlon Brando gives one of the greatest and most memorable performances as Don Vito Corleone. Same can be said for Al Pacino who plays Don Michael Corleone. Both characters are written perfectly. Vito struggles to keep peace between the 5 families and prevent all-out war. Michael is the innocent war hero son who avoids the family business and maintains a healthy relationship with his love interest Kay. Eventually Michael is brough deep into the family business. Both characters are faced with large external and internal conflicts as the film goes on. We see both characters change over time and watching these characters on screen feels as if watching them on screen is a pleasure. The ending works well although it took me a while to appreciate it. It's taken me a while to fully take in and appreciate this film hence why I'm writing this review so late. I can't see any flaws in this film, and it is truly one of the greatest motion pictures."
  },
  {
    "rating": "5/5",
    "review": "The greatest movie of all time."
  },
  {
    "rating": "0.5/5",
    "review": "I did not care for The Godfather. It insists upon itself."
  },
  {
    "rating": "5/5",
    "review": "It was gud and enjoyable. 2 is better though."
  },
  {
    "rating": "5/5",
    "review": "Simply put, The Godfather is perfect. No film, except it's sequel, has come close to the level of cinematic nirvana that Coppola's work achieves. The performances, the direction, the writing, Gordon Willis' cinematography, the story, the set-pieces, the tension, the dynamics, the layers; It all culminates in a work that is as essential and as influential some of the great works of literature. Simultaneously a mafia and a family story, The Godfather isn't just focused on the inner workings of organized crime. Rather, Francis Ford Coppola's masterpiece shines its voyeuristic lens on turmoil, family bonding, tragedy, betrayal, love, fate, power, and the crumbling of society. All of these themes and motifs are set against a changing landscape of 1940s Americana, elaborating on a shift in ideals that brings both disillusion and heartbreak. I cannot wax poetic enough when it comes to this movie. It was one of the first that made me realize how editing, direction, and cinematography come together to tell a story. In particular, the meeting between Michael and Sollozzo blew my mind at the tender age of 9, and I've been addicted to these types of stories ever since. There's something about an organized story that translates so well to a great drama, and It all has something to do with the themes. The story in The Godfather is as dense and as classical as the works of Shakespeare, and this is one of the few films that deserve to be called 'Spakespearean.' Even though my love for this film is limitless, It's hard for me to write about it. There's been essays, papers, and entire books dedicated to this gold-mine of a cinematic work, and while I would love to write a long piece on it, I don't have the words just yet. This isn't even my favorite Godfather film, but the fact that It's still in my top 15 of all time says so much about Coppola's filmography in the 1970s. This is definitely Coppola's most influential work, and while I prefer Apocalypse Now and The Godfather Part 2, The Godfather is still his finest work."
  },
  {
    "rating": "5/5",
    "review": "The Godfather 110% deserves the title as one of the greatest movies of all time. The moments of suspense were just unmatched, and the acting was top tier. One of the greatest films hands down."
  },
  {
    "rating": "5/5",
    "review": "One specific scene that stuck out is when Michael Corleone becomes the new Godfather after his father, Vito Corleone, is shot. The visual composition of the scene, with Michael isolated in the dimly lit room, conveys the weight of the power he inherits. the iconic \"I'm gonna make him an offer he can't refuse\" line symbolizes the manipulative nature of power, emphasizing control through a blend of influence and intimidation. These scenes collectively suggest that power in the film is not just about dominance but also about the moral dilemmas that come with it."
  },
  {
    "rating": "4.5/5",
    "review": "I really do love this movie, and I actually enjoyed it more the second time watching it than the first. I picked up on so much more of the story, and was empathizing and remembering more characters. Some of the deaths are so devastating though, they hurt more second time around. It's not only a great and complex plot line, but I also noticed the camera angles/techniques were never overused, and always tied to the plot line, especially in terms of looking up or down on characters during conversations, and setting up the scenes especially in Don's office with low lights, and lots of big security looking guys around, making the room unsettling"
  },
  {
    "rating": "5/5",
    "review": "I believe that the Godfather is a must watch for probably everyone. It deserves its reputation as one of the greatest American films ever made. I think this because it's just an interesting movie with action and plot twists and Italian mob violence. I think that the opening wedding scene is so happy and a great way to start off the movie, it's a very Italian wedding and it's a beautiful one too. I love the choices Coppola makes when portraying the characters at the beginning of the film, Micheal is just seen as the brother who came back from war, and he's not seen much. But slowly the attention shifts towards Micheal and away from the godfather throughout the film."
  },
  {
    "rating": "5/5",
    "review": "Does The Godfather deserve its reputation as one of the greatest American films ever made? Personally, I would say yes. The Godfather is a timeless movie that will never be forgotten in the world of filmmaking. The layered story, along with the complex characters, all combine together to create a movie unlike anything ever seen in cinema. Sure, you could argue it was just another mafia movie, but at the end of the day it is way more than that. There are character arcs, changes in relationships, death and grieving, violence, all coinciding in the story, making it unfair to label the movie as just one topic or genre. That is why the movie is so good, it spans over multiple genres and delivers in every single area. On top of the amazing story, the acting, cinematography, and music all stand out in the film as well. Pretty much everyone that contributed to the making of this film gave it their all, and that is clearly seen in the final product."
  },
  {
    "rating": "5/5",
    "review": "One scene where the lighting was impactful the opening scene known as the undertaker scene. Where bonasera wants justice from Vito for the assault on his daughter. The dark environment adds a sense of tension. The lighting underscores the secretive nature of the mafia"
  },
  {
    "rating": "5/5",
    "review": "Coppola uses lighting to change the mood and feeling for each scene. One scene that stands out to me is the wedding. The wedding is outside and it's a really nice and bright day, but where The Godfather was doing business he was in a dark room with small lighting to make it more serious and mysterious."
  },
  {
    "rating": "5/5",
    "review": "The Godfather is a super cool movie that's like a storytelling genius! The action scenes are not just punches and explosions—they're like emotional roller coasters. It's not just about fights; it's about understanding the characters and their feelings. Every punch and every intense moment in the movie helps us know the characters better. Whether it's the scene with the horse head or the baptism part, it's like each action is telling a secret story. The movie isn't just about action; it's about the drama and feelings that come with it. Even though The Godfather is kind of old, it's still super awesome. The way it tells a story with action makes it timeless. It's like a classic that will always be interesting, no matter how many years pass."
  },
  {
    "rating": "4.5/5",
    "review": "This movie was very well made. The lighting used throughout was a great depicter of the mood of the scene. For example, in scenes in which people die the lighting is darker, where as happier scenes like the wedding had brighter lighting. To conclude, the lighting used was essential in creating the meaning and mood throughout the film."
  },
  {
    "rating": "3.5/5",
    "review": "What we learn about the main characters in the opening scenes is that Coppola is describing Don Vito Corleone, that Vito is very important and that The movie would be very different without Vito. Coppola is suggesting that power is like everything in the family and that people have to follow the orders of the Leader of the family's."
  },
  {
    "rating": "4.5/5",
    "review": "Yes it still has the same violence to now. Now it's really realistic but back then this movie this still really good and realistic. This movie was great I liked it a lot."
  },
  {
    "rating": "4/5",
    "review": "I think that the worst part of this movie is seeing how Michael changes. In the beginning of the movie he tells Kay that he will never be like his father. Yet at the end he took his fathers place and somehow became a worse version of him, killing his sisters husband and then lying about it. At the beginning Michael was my favorite the way he tried his best to be different from his family, he was kind and a good person. But the end is almost ruined for me just to see how much his priorities have changed."
  },
  {
    "rating": "5/5",
    "review": "I love this movie, but specifically the turn of Michael Corleone. He goes from being a WW2 war hero to the Don of the most powerful family in crime. It all begins at Connie's wedding where he says \"That's my family Kay, not me\" and those words will be used later in the movie when Kay is upset with Michael after becoming Don."
  },
  {
    "rating": "4.5/5",
    "review": "The lighting helps portray the seriousness and darkness of the scene. A scene that portrayed the seriousness through lighting is the hospital scene where Michael was protecting his dad. The halls were dim and when they went out to post up it was really hard to see them, almost foreshadowing something bad or dark is about to happen. I feel like the mood changes based on the lighting. When the lights were bright, there was people around and usually something happy happening such as the wedding"
  },
  {
    "rating": "4/5",
    "review": "The most sad scene was when Carlo found out his sister gotta beat and he went to go beat up the husband/boyfriend and he drove all the way to meet someone and he got shoot so many times that was sad to see him die that way and his dad's funeral they were talking business to Micheal at his dad's funeral but it was a confusing but great movie."
  },
  {
    "rating": "3.5/5",
    "review": "I'm sure it was a phenomenal cinematic experience at the time, with a timeless vibe, although it didn't have the same impact for me. However, it's fortunate that the performances were excellent, and indeed, it stands out with a very compelling gangster plot."
  },
  {
    "rating": "5/5",
    "review": "This movie really needs no review. Widely regarded (and rightly so) as one of the greatest movies of all time. The story, acting, writing, costumes, soundtrack, etc. etc. etc. are what the golden standard of filmmaking should be about."
  },
  {
    "rating": "5/5",
    "review": "The best movie ever made."
  },
  {
    "rating": "5/5",
    "review": "Simply the best… on all measures. It can be watched over and over again."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies ever made. The Godfather is a blueprint for cinematic achievement."
  },
  {
    "rating": "5/5",
    "review": "the best gangster movie that i ever saw in all-time great especially Marlon Brando performance"
  },
  {
    "rating": "5/5",
    "review": "As good as a film can almost possibly be: MY only complaints are James Caan as Sonny was miscast he was supposed to be huge in the book, and they made the girl he cheated on his wife with, Lucy, ugly not mega hot, as in the book, and the wife of Michael was ugly not hot as in the book. The show was almost stolen by Sollozo the Turk played by Al Lettieri wow!"
  },
  {
    "rating": "5/5",
    "review": "Esse filme é uma obra prima, um dos melhores filmes que já assisti na minha vida ou até mesmo, o melhor! E com certeza não perde esse posto tão fácil. O filme é perfeito do inicio, meio e fim, apresentando a família Corleone de uma forma única e especial, quase faz você fazer parte deste família. O filme tem 02h55m e consegue trabalhar incrivelmente bem esse tempo, trazendo cenas icônicas, memoráveis, personagens marcantes, atuações impecáveis e todo tipo de sentimento que um filme pode proporcionar e apesar de ser longo, é um dos poucos filmes que não perde o ritmo e sempre te mantem ligado e atento. Esse filme não só é recomendável como é essencial que seja assistido por todos."
  },
  {
    "rating": "3.5/5",
    "review": "Great performances from the leading roles and a good story to go with it!"
  },
  {
    "rating": "4/5",
    "review": "\"The Godfather\" is a cinematic masterpiece that truly stands the test of time. With its impeccable acting, captivating cinematography, and an unforgettable soundtrack, it's no wonder why this film has earned its place in the annals of movie history. Marlon Brando's portrayal of Vito Corleone is nothing short of legendary, and the supporting cast, including Al Pacino and James Caan, deliver stellar performances. The film's attention to detail is evident in every frame, with its beautifully shot scenes and meticulous set design. The soundtrack, composed by Nino Rota, weaves its way into the narrative seamlessly, enhancing the overall experience. The screenplay, adapted from Mario Puzo's novel, is a triumph in storytelling, balancing family drama and crime in a way that keeps you hooked throughout its lengthy runtime. However, \"The Godfather\" isn't without its flaws. The pacing can be uneven at times, and the extended runtime may test the patience of some viewers. Nevertheless, it's a perfect blend of drama and crime that continues to captivate audiences, making it a must-watch for any film enthusiast."
  },
  {
    "rating": "5/5",
    "review": "A Classic Gangster Drama 🙌"
  },
  {
    "rating": "0.5/5",
    "review": "Regrettably, one finds oneself compelled to dissect the ostensibly venerated cinematic artifact, \"The Godfather,\" with a discerning eye that, contrary to popular sentiment, reveals an opus fraught with imperfections and narrative pretensions. Francis Ford Coppola's directorial endeavor, while heralded for its supposed thematic profundity, regrettably unfolds as an excruciatingly protracted narrative, replete with superfluous instances of familial deliberation that, ostensibly, contribute to its labyrinthine plot. The film's self-indulgent commitment to protracted dialogues ensconced in shadowy environs renders the viewing experience an exercise in tedium, bereft of the dynamism one would expect from a cinematic endeavor. Cinematographically, the film's reliance on chiaroscuro aesthetics, ostensibly championed for its visual gravitas, often descends into an affectation, obscuring rather than illuminating the intricacies of the narrative. Gordon Willis's cinematography, while heralded, paradoxically overshadows narrative nuances with its penchant for visual ostentation. The ensemble cast, though frequently lauded, is not without its detractions. Marlon Brando's performance as Vito Corleone, while undoubtedly iconic, succumbs to the trappings of method acting, becoming an exercise in histrionics that veers dangerously close to the precipice of self-parody. The film's character proliferation, ostensibly aiming for complexity, results in a cacophony of underdeveloped personas, rendering the viewer indifferent to their respective fates. Nino Rota's musical accompaniment, while conventionally praised, tends towards the maudlin, at times eclipsing the narrative's emotional resonance with a saccharine sentimentality. The purported symbiosis between visuals and music, rather than enhancing the cinematic experience, becomes a discordant union that distracts from the film's purported thematic acumen. In summation, \"The Godfather\" emerges as a cinematic testament to the pitfalls of excessive veneration. Its meandering plot, affectation-laden visuals, and performances that oscillate between the sublime and the excessive impede the film from achieving the lauded status it unwarrantedly enjoys within the pantheon of cinematic classics. The emperor, in this instance, appears to be wearing threadbare garments."
  },
  {
    "rating": "5/5",
    "review": "Masterpiece https://vm.tiktok.com/ZGe1hh39x/"
  },
  {
    "rating": "5/5",
    "review": "this is obviously a classic! there is no way this can't be at least a top 10. it's a top 5 for me for sure"
  },
  {
    "rating": "5/5",
    "review": "Killer classic movie!"
  },
  {
    "rating": "5/5",
    "review": "a marvelous crime film, the godfather has earned its rightful place in the halls of glory in american cinema"
  },
  {
    "rating": "4/5",
    "review": "Très bon film, mais qui n'a pas été exactement à la hauteur de mes attentes. La montée au pouvoir et l'accroissement de la froideur de Michael est intéressante; son escapade en exil et le meurtre de sa bien-aimée fait que ceci explique cela. Le personnage de Don Corleone est mon préféré; il sait se faire respecter et sa puissance est visible. Les moments où les cadres de la famille discutent tournent souvent en rond, contrairement aux scènes d'action et de réunions. Bref, ce film mérite sa renommée, mais son contexte de guerre de gangs un peu trop silencieuse ne m'a pas autant plu que je l'aurais imaginé."
  },
  {
    "rating": "5/5",
    "review": "A superbly acted generational drama that is clearly the archetype for mafia-related stories that follow it. Amazing."
  },
  {
    "rating": "5/5",
    "review": "The Godfather film adaption by Francis Ford Coppola has grown to be such an iconic movie that anyone can see it again and not get tired of it."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films ever."
  },
  {
    "rating": "5/5",
    "review": "Melhor filme da historia"
  },
  {
    "rating": "4/5",
    "review": "Wyjątkowy. Pełen detali. Naturalnie zagrany. Leniwe tempo. Teatralne bójki. Promuje rodzinne wartości :)"
  },
  {
    "rating": "5/5",
    "review": "A crime epic that redefined cinema. Marlon Brando's iconic performance and Francis Ford Coppola's direction make it a must-see."
  },
  {
    "rating": "5/5",
    "review": "Great film. But it insists upon itself 😉… sorry, I'll see myself out 🤣"
  },
  {
    "rating": "4.5/5",
    "review": "Don't really like movies like this but gave it a go as people have recommended it. What an amazing film the way it was put together from start to finish outstanding!. Loved all the actors very well directed 9/10"
  },
  {
    "rating": "5/5",
    "review": "The embodiment of great cinema !"
  },
  {
    "rating": "5/5",
    "review": "This a timeless masterpiece. The already stunning storytelling by Mario Puzo perfectly adapted to the projector screen for us to enjoy ! Simply outstanding!"
  },
  {
    "rating": "5/5",
    "review": "The best movie of all time for sure"
  },
  {
    "rating": "5/5",
    "review": "The grand operatic scope remains the most compelling element here and despite the almost cultish fanbase that continues to misinterpret the film, it is clearly opposed to the senseless violence and destruction committed by the characters."
  },
  {
    "rating": "3.5/5",
    "review": "J didn't LOVE it but I liked it. I understand the significance of this movie and what it did for crime/mob movies that came after it. It was definitely well-made and I liked Al Pacino in it for sure. My favorite scene was when he shot Sollozzo and McCluskey in the restaurant, very well-done scene and very intense. Other than that it was good enough I suppose but I still like Goodfellas better and the other subsequent movies that The Godfather inspired."
  },
  {
    "rating": "5/5",
    "review": "The best movie of all time"
  },
  {
    "rating": "5/5",
    "review": "What can I say for this film that hasn't already been said? Not much, I'm sure, as it's been around for 50+ years, and is one of the greatest films in the history of cinema. Throughout watching the film though, I kept feeling as though it was quite overrated. Everything just seemed, well, mediocre. Well, maybe mediocre is a harsh term, but it was nothing mind blowing. But it was only after, a couple hours after, when normally a film would have kinda left my mind, that I truly realised just how genius this film was. The story, plot, characters, everything, all kept occupying my mind for numerous days after I finished watching this here acclaimed movie."
  },
  {
    "rating": "5/5",
    "review": "This movie is the godfather nothing else to say"
  },
  {
    "rating": "5/5",
    "review": "Simplemente perfecta. La veria una y mil veces."
  },
  {
    "rating": "4.5/5",
    "review": "At first I thought it was ok, but later I loved this movie, it may not be top 10 or top 20, buts still a very good film"
  },
  {
    "rating": "3/5",
    "review": "The Godfather of 1972 might have left a lasting mark, but truth be told, even a century later, this film could still sport a 9-rating on IMDB. The masses will probably keep adoring it like infatuated pups. But, let's be brutally honest, I can't call it a masterpiece anymore. Why? That third film arrived and oh boy, did it drain the life out of its forerunner. It's like a black hole of cinematic incompetence, sucking out all substance and credibility from the series. So, relish the nostalgia of The Godfather, but remember: its tainted legacy forever mingles with that cursed third film."
  },
  {
    "rating": "5/5",
    "review": "Arguably the best movie of all time. Can turn the film on anytime and still be amazed. What an amazing performance by Marlon."
  },
  {
    "rating": "5/5",
    "review": "Possibly the greatest movie ever made."
  },
  {
    "rating": "5/5",
    "review": "Francis Ford Coppola's \"The Godfather\" is an immortal masterpiece that weaves a mesmerizing tale of power and family dynamics. With impeccable performances from Marlon Brando and Al Pacino, the film's intricate narrative and unforgettable dialogue have left an indelible mark on cinema. Visually elegant and emotionally resonant, it explores moral complexities while engaging us in a gripping Shakespearean drama of loyalty, sacrifice, and power struggles. A timeless triumph that enriches the cinematic landscape."
  },
  {
    "rating": "5/5",
    "review": "The greatest movie of all time!"
  },
  {
    "rating": "5/5",
    "review": "The best movie ever made. Magnificent, excellent, perfect in every sense."
  },
  {
    "rating": "5/5",
    "review": "Um dos filmes mais incriveis já feitos"
  },
  {
    "rating": "5/5",
    "review": "É o melhor filme de todos os tempos ! A Imersão do telespectador é imediata logo nos primeiros minutos , toda a alegoria e a forma como fizeram a transição da época se aprofundando tão bem no mundo das famílias mafiosas prende a nossa curiosidade e atenção a níveis altos. Os efeitos práticos e roteiro impecaveis, não so dão brilho como também ajudam o seguimento do filme . algumas falhas são notadas ,porém não sobressai a obra ! Marlon Brando e Al Pacino dispensam comentários."
  },
  {
    "rating": "5/5",
    "review": "I waited way too long to watch this, I'm glad i finally did."
  },
  {
    "rating": "5/5",
    "review": "The extreme few critics who gave this a bad review, were obviously not hugged enough as children."
  },
  {
    "rating": "5/5",
    "review": "El padrino, es mi pelicula favorita incluso toda la trilogia es muy buena, debido a que me marco de por vida, sus frases, sus momentos, son cosas que solo pudo hacer esta pelicula en mi, acompañado de que me encanta el tema de la mafia siciliana esta pelicula es el verdadero cine, tambien con su gran banda sonora la cual es una de las mejores bandas sonoras del cine desde mi punto de vista, y con las actuaciones."
  },
  {
    "rating": "5/5",
    "review": "This is the movie with the most greatest characterizations of them all. Every actor in it deserved to be nominated for an Oscar. Also, all the sublime and not so sublime messages in it, the settings, the direction, the production qualities, everything makes this arguably the greatest movie of all time and a real triumph. Only Rocky in my opinion is superior. Thye Godfather, when viewed by the proper audiences, is an experience of a lifetime."
  },
  {
    "rating": "5/5",
    "review": "one of the best gangster films ever made a classic a film that started the gangster genre."
  },
  {
    "rating": "3/5",
    "review": "This movie is dipe and sensitive, and I know that this film show italian crime groups to viewer, and this movie did it so good, all is good: sound engeneer's work, cameraman's work, screenwriter's work and actors play so good, but for me this film was boring, although I know that this film is legendary."
  },
  {
    "rating": "5/5",
    "review": "Sem duvidas um dos filmes"
  },
  {
    "rating": "4.5/5",
    "review": "Filme maravilhoso, o papai é foda e os filhos são os fodinhas"
  },
  {
    "rating": "5/5",
    "review": "Com tramas icônicas e interpretações brilhantes, \"O Poderoso Chefão\" é um marco na história do cinema, o filme trabalha perfeitamente seu drama aliado ao gênero mafioso, sabiamente usando cada um de seus personagens para dar andamento na história e nos deixar impactados. A direção de Coppola foi algo fora de série e um dos pontos mais altos do longo, trazendo para nós um grande clássico de Hollywood e também um dos melhores filmes de todos os tempos."
  },
  {
    "rating": "5/5",
    "review": "Vito Corleone captivated me with his polite and wise way of speaking and the respect that circulated around him. The story prioritizes the family aspect of union and culture which is of great importance to them and their way of operating. Michael's character development was a cycle built from outsider to the successor to all which makes him a shrewd leader in a bittersweet position. I wanted to know why this movie is such a masterpiece and I understood it since that first scene."
  },
  {
    "rating": "5/5",
    "review": "The Godfather is a film classic and rightly so in the world. It was expected that a mafia movie from the point of view of the \"greatest family\" that exists in this world was a movie full of violence, crimes and a lot of deaths. In fact the film aggregates much more than violence, it works on the side of the family, not only the \"Corleone\" but the others as well. And besides having yes violence, that is not the main focus of the film, but rather explore the people who are involved in the mafia. And this is all presented to us with wonderful performances of Marlon Brando as Don Vito Corleone and Al Pacino as Michael Corleone. Also a flawless script, very well built, a soundtrack that always leaves me with chills when I listen to it, and simply one of the best films in the history of cinema."
  },
  {
    "rating": "5/5",
    "review": "The true meaning of a perfect movie The director Francis Ford Copolla shows us a true masterpiece of the vast world of cinema. Despite being a very long film, it manages to keep the viewer glued to the screen following the unfolding of the story, and speaking of history, I can say that the story itself is perfect. The director manages to show us 100% the reality of the mafia of those years that pass. Regarding the performances, they are very good, in my opinion the best characters are Marlon Brando, AL Pacino and James Caan. Regarding the clothing, the sets and even the cars, I confess that they are very good too. So based on everything I've said and beyond, my rating for this movie is 10/10. Thanks."
  },
  {
    "rating": "4.5/5",
    "review": "An ridiculously good film that is perhaps a smidgen too long."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie it have a really great story, good characters, iconic scenes and acting, in opinion I thing its difficult to find a better film."
  },
  {
    "rating": "5/5",
    "review": "Filme espetacular que sempre me traz uma nostalgia."
  },
  {
    "rating": "5/5",
    "review": "\"The Godfather\" is truly a chilling analogy of crime in the world with superb filmmaking and outstanding performances."
  },
  {
    "rating": "3.5/5",
    "review": "Mandatory viewing. This film and it's sequel together are one of the faces resting on Mount American Cinema."
  },
  {
    "rating": "5/5",
    "review": "A classic. The greatest crime/gangster movie ever made. Nothing more to add. A must see."
  },
  {
    "rating": "5/5",
    "review": "One of the best films ever made true cinema"
  },
  {
    "rating": "4.5/5",
    "review": "Classic. Only mob movie better would be once upon a time in America. This movie is a must watch."
  },
  {
    "rating": "5/5",
    "review": "Simplesmente uma aula de cinema. Filme perfeito em todos os sentidos."
  },
  {
    "rating": "4.5/5",
    "review": "Don Vito Corleone, head of a mafia family, decides to hand over his empire to his youngest son Michael. However, his decision unintentionally puts the lives of his loved ones in grave danger. I don't think I have much else to say about the Godfather, because everything has already been said about it, but yeah it is still an absolute masterpiece. The Godfather probably has the best ensemble of performances in the history of cinema, everyone is perfect, Al Pacino and Marlon Brando are still the highlight performances for me, but James Caan gives a powerhouse performance as well. The Godfather is one of the best written movies of all time, from the iconic one-liners, to the tensely written scenes between the heads of the families, the screenplay keeps you always invested. What I appreciate about the Godfather, is that everything feels so natural and grounded, while we are watching a mafia movie and people get shot left to right, it almost feels like a documentary at times. The Godfather features some of the best character development in any movie as well, the way that Al Pacino's character changes so much, is the definition of perfect writing. I don't have a lot else to say about the Godfather, then to say, its just a timeless classic, with a perfect setup for the next one, while being great on its own!"
  },
  {
    "rating": "5/5",
    "review": "THIS IS MY FAVORITE MOVIE - The greatest gangster film that deals with the theme of family, loyalty and the fall of man"
  },
  {
    "rating": "5/5",
    "review": "This movie is absolutely exceptional. The potrayal of Don Vito by Marlon Brando was a work of art. Every drama has to have amazing villains and this movie definitely deliveres with Don Barzini, Don Tattaglia and Virgil Sollozzo. Also, this movie is very rewatchable. Every time you rewatch you discover something new. In addition the first scene gets the watcher interested. Finally the baptisim scene is an amazing end, it was perfectly orchestrated by the Don Michael Corleone."
  },
  {
    "rating": "5/5",
    "review": "I could use the word of our Lord and personal savior but that in reality would only Sully his preciousness, and if i use the name of the creator then it would mean i have no respect for him, when it came down to earth the messing up of humans and power can only boil down to the chosen ones, they can deny it all they want but leaving everything up to time only makes it harder stronger and when the dust finally settles the view becomes clear and then acceptance is paramount, judging by the way it all started no amount of action can rival the potency of the one called the godfather that's the highest ranking human in the world, not to make it personal but that's something to keep an eye out for, in my regards don't toy with the godfather."
  },
  {
    "rating": "5/5",
    "review": "Arguably the most universally acclaimed movie of all time, 1972's \"The Godfather\" is Francis Ford Coppola's proof of excellence, whose winning strikes are the strong ethnic dive in the italian american culture (securing the authenticity that ordinary gangster movies lacked) and the story lived by the mafia family point of view, inside that normalizing bubble in which we witness only incidentally the evils that aliment the Corleone's system and where we can focus mostly on the family relations (which we discover are the same as any other 'ordinary' family) and how they influence the matters of power and its hierarchy. Marlon Brando's career is restored thanks to a fully deserved Academy Award winner charismatic yet underplayed, magnetic portayal of the family boss Vito. Equally Al Pacino stands on his own with the outstanding rendition of the Michael Corleone's descent to hell, from the chrysalis of the good american values epitome, to the full blown vendetta driven ruthless new head of the crime family. The cast has no weak spots as all the supporting actors shine on their own, to the point that literally every scene, every script line, has achieved cult status. The restoration of the '40s and '50s New York is excellent and the 'yellow to orange' downtone of the film foil is unique. The sicilian shootings, for which the editing is less tight, are fascinating and release a  concrete sense of reminiscence, of melancholic deja vu, like a family memory about an ancestor rediscovered in a dream."
  },
  {
    "rating": "2/5",
    "review": "I'm sure at it's time it was a phenomenal cinematic experience, but it did not strike me as being sensational in any way. There was an overwhelming lack of diversity, but fortunately the acting was quite good. 2 stars."
  },
  {
    "rating": "5/5",
    "review": "\"The Godfather\" draws you in with its opening scene and keeps you engaged until the last minute of the story.."
  },
  {
    "rating": "5/5",
    "review": "Nothing has come close and probably never will with the way they are making newer films."
  },
  {
    "rating": "5/5",
    "review": "the Greatest film ever made"
  },
  {
    "rating": "5/5",
    "review": "No se cuantas veces ya vi está película en HBO, en Netflix, por cable, en video, en DVD y nunca me canso de verla"
  },
  {
    "rating": "5/5",
    "review": "The Godfather, directed by Francis Ford Coppola and released in 1972, is undoubtedly one of the most iconic and influential movies of all time. It has become a cultural phenomenon, and its popularity continues to endure decades after its release. There are many reasons why The Godfather is a classic movie, but here are some of the most significant ones: Iconic characters: The Godfather features some of the most memorable characters in movie history, from the ruthless Don Vito Corleone (Marlon Brando) to the conflicted Michael Corleone (Al Pacino). Each character is fully fleshed out and has a unique personality that makes them stand out. A timeless story: The Godfather tells a timeless story of power, family, and loyalty. The themes explored in the movie resonate with audiences of all generations, making it a classic that can be appreciated by everyone. Masterful direction: Francis Ford Coppola's direction is masterful. He creates a palpable sense of tension and atmosphere that draws the viewer into the world of the Corleones. His use of lighting, camera angles, and music is superb and helps to enhance the movie's mood and themes. Cinematography: The Godfather boasts some of the most beautiful and iconic cinematography in movie history. The movie's dark and moody atmosphere is captured perfectly by Gordon Willis's cinematography, and the use of shadows and lighting is breathtaking. Memorable dialogue: The Godfather features some of the most memorable dialogue in movie history. From Don Vito Corleone's iconic \"I'm gonna make him an offer he can't refuse\" to Michael Corleone's chilling \"Just when I thought I was out, they pull me back in,\" the movie is filled with lines that have become part of our cultural lexicon. If you have never seen this film do yourself a favor and watch it. It's long runtime pays off all throughout the film. By the time you're finished all you'll want to do is watch part 2! Which is just as great. Arguably, maybe even better!"
  },
  {
    "rating": "5/5",
    "review": "The Godfather was the first film I watched that I thought was flawless. Everyone made sense and everything fit perfectly. It's like a well-executed puzzle with pieces fitting together, once again, flawlessly. Each scene deserves its very own mini movie and everyone was just captivating in their portrayal of their characters. I have watched it more than I can count and it's safe to say that it's really one of the greatest films ever made."
  },
  {
    "rating": "5/5",
    "review": "Such a well made movie with deep characterization, great acting performance, character transformations, subtexts, brilliant music, and excellent cinematography."
  },
  {
    "rating": "5/5",
    "review": "You ronde who gave it less than 5 stars. There is always some tool in the box."
  },
  {
    "rating": "5/5",
    "review": "Must see master piece."
  },
  {
    "rating": "5/5",
    "review": "The perfect movie. Everyone must see this movie."
  },
  {
    "rating": "5/5",
    "review": "The best among the best. Perfect in everything. The biggest ever made."
  },
  {
    "rating": "5/5",
    "review": "Undoubtedly one of the best films of all time, The Godfather gets everything right - and holds cinema after its release to a higher standard than ever before."
  },
  {
    "rating": "5/5",
    "review": "Francis Ford Coppola is definitely the American Nabwana I.G.G."
  },
  {
    "rating": "4.5/5",
    "review": "Absolutely fantastic. Great performances all around. Engaging, submerges you in its world."
  },
  {
    "rating": "5/5",
    "review": "Finally took the time to watch all three and hat a masterpiece the first one was. The story grabbed me and kept me focused right till the end. Pacino was incredible and showed us a crazy transformation story."
  },
  {
    "rating": "5/5",
    "review": "No wonder why it's one of the all-time top-rated movies. I should have watched it a long time ago"
  },
  {
    "rating": "5/5",
    "review": "Just the tied for the best movie I have ever seen. The writing is top notch, and so many accomplishments were made from this movie."
  },
  {
    "rating": "5/5",
    "review": "One of the most classic mafia movies of all time. Marlon Brando is phenomenal and Al Pacino puts forth a fiery but subtle performance."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest films ever made. Marlon Brando delivers the best acting performance of all time, and Al Pacino does amazing as well. Most of the time when I see a movie that's considered one of the best ever, it doesn't quite live up to my sky high expectations. That did not happen here, as it actually outdid my expectations. Definitely a top 10 film ever, even to someone who's not a huge fan of mafia movies."
  },
  {
    "rating": "5/5",
    "review": "Its beauty is in its complexness, and in the minds that can see through the set ups and lies of mob bosses. This is how peak cinema looks like."
  },
  {
    "rating": "5/5",
    "review": "The greatest movie of all time,watched many times and still a delight,pure cinematic brilliance"
  },
  {
    "rating": "5/5",
    "review": "I think it's instant classic and a beautiful movie that changed a movie industry forever. One of the all time best movies ever created."
  },
  {
    "rating": "5/5",
    "review": "This is it, this is the mafia movie. Stellar acting, everything is in it right place."
  },
  {
    "rating": "5/5",
    "review": "Perfect movie. Amazing acting and amazing story. Great cast"
  },
  {
    "rating": "5/5",
    "review": "The GOAT. No comments required!"
  },
  {
    "rating": "5/5",
    "review": "It is the best movie i ever saw! I am 19 years old and i regret not watching this movie until now. Such a piece of art. The music, the actors, the plot , all are perfect. There was non a single thing that i didnt like about. Just to finish, everyone need to watch \"The Godfather\""
  },
  {
    "rating": "5/5",
    "review": "An incredible first film of the iconic Godfather trilogy. It is and will always be the best Italian mob film."
  },
  {
    "rating": "4.5/5",
    "review": "This movie set the bars for American cinema delivering arguably the greatest movies of all time. With many famous lines and unforgettable characters,the only thing was it was hard to understand them but they did it on purpose and made a masterpiece"
  },
  {
    "rating": "5/5",
    "review": "Based on Mario Puzo's best-selling 1969 novel of the same name, Francis Ford Coppola's The Godfather nails everything: fantastic gangster business combined with assured storytelling that truly invests the viewers into the awesome characters and performances that this movie contains (particularly Marlon Brando and Al Pacino). The movie established what was possible to make and it no wonder why it is regarded as one of the greatest films ever made and most influential. Absolute must watch, no excuses!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Slow, but such an excellent score, screenplay, cinematography, and cast that it is worth sitting down for."
  },
  {
    "rating": "5/5",
    "review": "Excellence of filmmaking, everything is real to the bones because the passion for the art is what made this movie a point of reference forever."
  },
  {
    "rating": "5/5",
    "review": "It's So Fantastic! I Watched It On Paramount+ Months Ago And It Was A Masterpiece!"
  },
  {
    "rating": "5/5",
    "review": "To most, including myself, the greatest film of all time. Not much else to say - everyone should watch this at least once."
  },
  {
    "rating": "3.5/5",
    "review": "I get all the hype around this movie but for me it was just too long. Maybe it's the players that made this movie be such big deal at the time he published, but I felt the plot was good but poor a little bit, I wanted more action and depth. Hoping the next in the trilogy to be better."
  },
  {
    "rating": "2.5/5",
    "review": "\"The Godfather\", an almost perfect and unparalleled masterpiece in the history of American cinema, is not unbeatable. I don't ask for an origin or end to the story, but the repetition of the cases that go hand in hand between the mafia makes the 177 minutes feel like an extra pain in the ass. Francis Ford Coppola is a genius, and \"Apocalypse Now\" is so much more than a legend, but maybe I am young, but there was not much to see in this trilogy. The film critics are not satisfied to give it a perfect score, and as a film, it ends up being a less than inspiring piece of work."
  },
  {
    "rating": "4.5/5",
    "review": "In short, which the movie certainly isn't, brilliance: writing, directing, acting, editing, cinematography, take your pick."
  },
  {
    "rating": "5/5",
    "review": "A classic, a must see"
  },
  {
    "rating": "5/5",
    "review": "Need to see in theatres"
  },
  {
    "rating": "4.5/5",
    "review": "Classic, Greatest mafia movie of all time"
  },
  {
    "rating": "5/5",
    "review": "This movie is a very fun and great experience. Great acting by everyone, GREAT story, it's fun, the score is good, etc. Marlon Brando has another great performance here and so does Al Pacino, James Caan, and many others. A must watch film."
  },
  {
    "rating": "5/5",
    "review": "Vito Corleone is one of the most fatastic characters ever created. A true father figure."
  },
  {
    "rating": "5/5",
    "review": "Mario Puzo and Francis Ford Coppola's italian/american crime MASTERPIECE..."
  },
  {
    "rating": "5/5",
    "review": "The movie that made movies"
  },
  {
    "rating": "4.5/5",
    "review": "This classic film is about family, betrayal, power and respect. Marlon Brando gives a powerful performance as said Godfather and Al Pacino as Michael. There are many scenes with little dialogue, the emphasis being on characters facial expressions and gestures (incl. body language), to portray their feelings/emotions. I liked the scenes shot in Italy - there are some panoramic/landscape shots and I liked that you could vividly hear the crickets/cicadas. Hearing that took me back to the holidays in Europe that I've had in the past. I also thought the christening/baptism scene, towards the end, was pretty powerful, due to the obvious dichotomy facing the viewer. I also enjoyed the scene featuring Don Corleone (snr.) and the young child in the garden - there's quite an analogy present there. Of course this film contains many well known film quotes, such as 'I'll make them an offer they can't refuse' and multiple uses of Italian slang, aka mobster speak - 'badda boom, badda bang' etc. It was interesting to see the source material for such quotes (at least I assume they originated from this film, to some extent in any case). The cast very much makes this film and for the cinematic atmosphere it gives, I would certainly recommend it to others."
  },
  {
    "rating": "5/5",
    "review": "The Greatest Mafia Crime Film to date. The Godfather breaks the barriers of modern crime boss films that become an unexpected global and critical success."
  },
  {
    "rating": "5/5",
    "review": "The gold standard in acting, directing, plot."
  },
  {
    "rating": "5/5",
    "review": "Best movie ever made"
  },
  {
    "rating": "5/5",
    "review": "Ages 17 and older!!!!!!!! The greatest 02 hours: and 57 minutes of criminal action!!!!!!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Greatest movie of all time to this very day!!!"
  },
  {
    "rating": "4/5",
    "review": "I’ll make you an offer you can’t refuse"
  },
  {
    "rating": "5/5",
    "review": "Well, it definitely is one of the greatest movies of all time. I'd put it in my top 5."
  },
  {
    "rating": "5/5",
    "review": "Best in cinema. Best in storyline."
  },
  {
    "rating": "5/5",
    "review": "Che dire. In questo capolavoro troviamo probabilmente il Cast più incredibile della storia del cinema - Pacino, Brando, Duvall, Cazale, Caan, Keaton, Etc. - Quando pensiamo al capolavoro cinematografica subito ci viene in mente il Padrino, sigillo indelebile del grande Coppola. Colonna sonora superba, fotografia perfetta, montaggio da manuale, sceneggiatura del grande Mario Puzo. Meno male esiste il Padrino. Capolavoro indiscusso."
  },
  {
    "rating": "5/5",
    "review": "The Godfather (1972) is a gangster flick overflowing with charm and emotion. The amazing cinematography by Gordon Willis, paired with the artful direction by Francis Ford Coppola, truly complemented the majestic performances by the likes of Marlon Brando, Al Pacino, Diane Keaton, James Caan, Robert Duvall, just to name a few. The film dwells into the fragility of the American Dream, and ultimately, life. Through the artful depiction of the mafia life, we came to sympathize with the characters in the films; even though we knew deep in our hearts that they are flawed in so many ways. On a different note, the theme song of the film, Love Theme from The Godfather by Nino Rota, is probably one of the most recognizable musical pieces out there; it is essentially up there with the likes of Vivaldi's Le quattro stagioni, Beethoven's Quasi una fantasia, and Mozart's Piano Sonata No. 11, among others."
  },
  {
    "rating": "4.5/5",
    "review": "Not much can be said about Francis Ford Coppola's The Godfather that hasn't already be said. An American classic, it's set in 1940s New York and documents the Corleone family and their struggle for power within the crime world. Marlon Brando is great in the title role, as are James Caan and Al Pacino as two of his sons. The score is iconic, the period details are spot on, and the whole film is beautifully executed. At the risk of committing cinematic heresy, if there is one possible complaint it could be the length of the movie, which clocks in at just under three hours. Some scenes simply feel too long – for example, the opening wedding scene runs almost thirty minutes and while it is important to establish the hierarchy within the family and introduce characters, there are a lot of details that just don't matter. Despite that, it is a classic that needs to be seen."
  },
  {
    "rating": "1/5",
    "review": "Paul Rudd was not in this movie"
  },
  {
    "rating": "5/5",
    "review": "Beautifully made movie!"
  },
  {
    "rating": "5/5",
    "review": "Simply the best work of art in human history."
  },
  {
    "rating": "5/5",
    "review": "还需要过多解释么？中国外国各大电影榜单，都是前几位的存在。"
  },
  {
    "rating": "5/5",
    "review": "greatest movie of all time. Even the actors (besides the leads) are fantastic; Sollozzo, Luca Brasi and the opening scene from Bonasera is just amazing acting!"
  },
  {
    "rating": "5/5",
    "review": "Everything about this film is amazing, from the smallest detail to the most important scene was handled with such purpose, care and perfection. The characters, the performances, the narrative, the visuals and the themes all come together to create this experience. The inspiration filmmakers have drawn from this film is conspicuous in their work. This is peak cinema."
  },
  {
    "rating": "4.5/5",
    "review": "It's a masterpiece considering the time it was shot."
  },
  {
    "rating": "5/5",
    "review": "This is one of the best movies ever made. From the flawless Brando performance to the brilliant cinematography, to the near-perfect dialogue, this film is one that every movie fan must see! While the movie has slow pacing, it is fitting for this movie, since this is a 3-hour+ film that needs time to flesh out its story in the best manner possible. And unlike some films that are this long, and have scenes that begin to drag and should have been cut, this film perfectly uses its run time, and every scene has a purpose and is executed phenomenally. This is true, one of the best if not the best film ever made. The only films I think that even come close to this caliber of filmmaking are the Godfather part 2 Citizen Kane, Casablanca, and Seven Samurai. This film is not just a tremoundus film, but also a tremendous work of art. And it speaks volumes about the director, Ford Coppola, that no Best Picture winner has been as high quality or thematic richness, like the Godfather"
  },
  {
    "rating": "5/5",
    "review": "This is clearly one of the greatest films of all-time, timeless to date and relevant decades later. The Godfather reshaped the mafia as well as how society viewed organized crime. From Marlon Brando to Al Pacino to the fourth tier characters, the performances were perfect, the characters were developed and relatable. Mario Puzi's greatest work was brilliantly adapted to screen by Francis Ford Coppola, with amazing cinematography, music score, art and set design. Truly a flawless piece of art - pinnacle at the top of the mountain."
  },
  {
    "rating": "5/5",
    "review": "Filme excelentíssimo, muito bem dirigido, além de ter uma história riquíssima e bem desenvolvida!"
  },
  {
    "rating": "5/5",
    "review": "This film’s impact extended to the actual mafia. The only five star review that I have ever given."
  },
  {
    "rating": "4.5/5",
    "review": "A beautiful film, was lucky to get to see it in theaters for its 50th anniversary!"
  },
  {
    "rating": "1.5/5",
    "review": "Not that good tbh! Kind of boring. #notmorb"
  },
  {
    "rating": "4/5",
    "review": "The godftaher is kinda a bad movie if you think bout it because there is no mraramdueke 2022 movie in the movie. My favorite part of merrydukeram was when. the dog went into the dog comptittyion and started farded everywhere and that was funny and that scene didn't happen in godfather movie. I also my favorite song was from marmudkucke and it goes like this \"MA MA MARMADRUEKE MA MA MARMADRUKE MA MA MR RAMDAMDUKE, I WANT YOURE RAMD UKE!!\" I loved that sing because it made me feel like that scene when myrightmandr.reek the dog jumped from the window and landed in poop (pool) and then he water went everywhere and even glt on clown person. FUNNY BUT GOOD AS WELL"
  },
  {
    "rating": "5/5",
    "review": "Its a old movie but a absolute gem. The acting, writing and cinematography is excellent. would highly recommend."
  },
  {
    "rating": "5/5",
    "review": "A funny story about this movie is that I started to watch this movie about 3 years ago.And I never finished it .Not even the half of the movie.I that this movie is so boring and so useless for cinema I didnt see a reason to watch it.And here come the day I'm on a trip,I dont have wi fi and It happenes for me to have the godfather downloaded on my laptop.I watched it and I til this day I dont regret it .A masterpiece of the cinema.Everything was amazong from plot to actors every secound in this movie made me feel like ...I dont know..alive."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies of all time, you absolutely must see this movie at least once. I was lucky enough to see this movie in theaters for its 50th anniversary."
  },
  {
    "rating": "5/5",
    "review": "Thanks to its dazzling plot, The Godfather is a story that explores the world of mafias"
  },
  {
    "rating": "5/5",
    "review": "This was a great movie. 👍"
  },
  {
    "rating": "0.5/5",
    "review": "Awful movie, it was not Morbius -Michael Morbius"
  },
  {
    "rating": "0.5/5",
    "review": "this film is very over rated in my opinion."
  },
  {
    "rating": "5/5",
    "review": "A cinematic masterpiece."
  },
  {
    "rating": "3.5/5",
    "review": "I have probably watched this one on TV before, there was enough time, after all. The film got beautifully restored and the story felt in parts familiar, but not to the point that it got boring. Great to see very young instances of Al Pacino, Marlon Brando, James Caan, and Robert Duvall. And the classic vehicles, of course."
  },
  {
    "rating": "5/5",
    "review": "Directed by the great Francis Ford Coppola, the film stars Al Pacino and Marlon Brando. This masterpiece tell the story of a family of italian mafioso, who lives in the New York state in US. The story will quickly turn into a tragedy after some tragic evenement who will emotionally hustle the characters except Vito Corleone, THE Godfather, who always impresses us with his devastating calm, his wit and his charisma. The plot can seem to be just dark and violent without any reflexion behind it, but it's false. The plot is excellent and very intellectually stimuling. There isn't a lot of special effect, because it's a realistic film, maybe the blood can seem a little exagerated but it isn't that important. The photography can be criticize but for a 1974's film, it's really good and make the film even better because it add a very dark and vintage atmosphere (without it, The Godfather wouldn't be The Godfather). Moreover, the acting is excellent too. The actors, in addition to be very known and succesfull, have been spectacular and very compelling. And, because the acting isn't all, the script of the film, based on Mario Puzo's novel, is also interesting and very tought-provoking. In conclusion, ... if you haven't seen it yet, see it. This film is an absolute masterpiece. The casting is incredible, the acting is outstanding, the atmosphere is captivating and the plot is excellent ."
  },
  {
    "rating": "5/5",
    "review": "No wonder why it's \"The Greatest Movie Of All Time\". Worthwhile, true, understandable and enjoyable. The Godfather is a breakthrough treat compared to Goodfellas, The Sopranos, Gangs Of New York & Scarface (other Mafia films) and the films also talked about including The Shawshank Redemption & The Dark Knight."
  },
  {
    "rating": "5/5",
    "review": "There's really no other way to say it, The Godfather is a perfect film. I've never seen such a complete story, told from start to finish, that has done so like this. I was so lucky to have been able to see it on the big screen, in a Dolby Cinema theater, for its 50th anniversary."
  },
  {
    "rating": "4.5/5",
    "review": "\"The Godfather\" is now remastered and back in cinemas some 50 years after first being released. Coppola's storytelling has lost nothing over time and is equally as epic as it ever was. The way \"The Godfather\" weaves through time , moving from New York to California then Sicily and back to New York is so well executed and beautifully filmed that each shift captivates its audience. \"The Godfather\" takes the standard story of the Mobster Don looking out for his family and granting favours to \"friends\" and turns it into a cinematic work of art."
  },
  {
    "rating": "5/5",
    "review": "As classic as you can get! Never go against the family"
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies of all time!"
  },
  {
    "rating": "5/5",
    "review": "Finally got to see it on the big screen incredible"
  },
  {
    "rating": "5/5",
    "review": "I just watch The Godfather in the theater, Still in my Top 10 Movies of All Time."
  },
  {
    "rating": "5/5",
    "review": "the film is a masterpiece"
  },
  {
    "rating": "4.5/5",
    "review": "probably deserving of 5 stars but maybe i cant yet appreciate it enough."
  },
  {
    "rating": "5/5",
    "review": "Best movie of all time with part 2 so close to perfection"
  },
  {
    "rating": "5/5",
    "review": "Bestmovie ever watched"
  },
  {
    "rating": "5/5",
    "review": "Nice to see Al Pacino evolve from a level 1 crook to a level 99 mafia boss"
  },
  {
    "rating": "5/5",
    "review": "The Godfather directed by master filmmaker Francis Ford Coppola is simply one of the best movies of all time. Simply a masterpiece and cinema at its best. A work of art that puts all filmmaking aspects to work to perfection: the script, direction, cinematography, and the acting performances are top to notch. Based on the novel by Mario Puzo The Godfather is the story of how the mafia don of the Corleone family begins to grow old and weak and how he passes his legacy to his son. This story takes almost three hours to tell and is epic. The two leads are as great as it gets. The titan Marlon Brandon at the pinnacle of his career plays the Godfather an old man who faces new enemies as the mafia gets into the narcotics business. His son Michael is played by Al Pacino in one of the best performances of his career if not the best. He is handsome and does not want to be a criminal but progressively becomes a calculated killer who does not blink in this epic drama filled with violence and the complexity of morality. The editing is phenomenal and this film is simply a treasure. A true piece of cinema and perhaps the best film directed by Coppola."
  },
  {
    "rating": "5/5",
    "review": "The Greatest, simply."
  },
  {
    "rating": "5/5",
    "review": "There is a reason why this movie is considered to be one of the best movies of all time because it's GREAT! Marlon Brandon as Vito Corleone is one of the most iconic roles of all time. Then you throw in a young Al Pacino, Robert Duvall, Diane Keaton and sprinkle a little James Caan...and you get this Masterpiece! Amazing story, Amazing Score and Amazing Directing!"
  },
  {
    "rating": "5/5",
    "review": "I've somehow made it through 24 years of life without seeing this movie. After constantly hearing about it growing up I decided to go see it for its 50th Year Anniversary at AMC Theaters. While I did feel that the movie tended to drag on in the middle the ending shows just how important every detail in the storyline is. I fully believe that this movie was as amazing as everyone said. Shockingly graphic for something that debuted in 1972. Phenomenal movie!"
  },
  {
    "rating": "5/5",
    "review": "It has its reputation for a reason. The baptism crosscutting sequence is one of the best ever put to film. Michael guarding his father at the hospital is also a textbook case in tension-building. The ending, too, features masterful visual storytelling with camera placement, framing, and blocking. And while I wish there was a scene showing Vito explicitly passing things down to Michael when he returned from Sicily, the classic corruption/breaking bad arc is achieved in a riveting fashion. This film is an offer no one can refuse."
  },
  {
    "rating": "5/5",
    "review": "one of the best movies ever, only \"Gone with the wind\" perhaps beets it"
  },
  {
    "rating": "5/5",
    "review": "Que puedo decir de esta película simplemente me impresiono desde el inicio Yo soy un fan del cine pero esta obra maestra es una de las 10 mejores películas que e visto en mi vida sin duda una HBO me hizo una Oferta que no puedo rechazar que deben de ver ya. Esta película además de tener momentos inolvidables y una de las mejores actuaciones de la Historia como la Marlon Brando no muestra quien será el nuevo líder de la mafia cuando Vito Corleone muera para la secuela cosa que nos muestran al final de la película pero no los quiero espoliar por lo que mantendré en suspenso quien será el líder de la mafia. Francis Ford Coppola me dio una Obra maestra del séptimo arte. El padrino es una de esas películas que superan al libro incluso mejor que Obras notables como La arca de Schindler y El puente sobre el río Kwai. Mi puntación para esta Obra maestra es 100."
  },
  {
    "rating": "5/5",
    "review": "Mario Puzo and Francis Ford Coppola's italian/american crime MASTERPIECE..."
  },
  {
    "rating": "1/5",
    "review": "I don't know why everyone likes this. The story was bad and the movie was just boring."
  },
  {
    "rating": "0.5/5",
    "review": "sunny die at the end and now i hate Micheal."
  },
  {
    "rating": "3/5",
    "review": "You know as a movie nerd i thought why not give it a go as so many people love this film but i just couldnt find a connection or anything that kept me intrested. It felt a bit dull but i kind of see how some people might enjoy it but i dont think its as good as it seems to be."
  },
  {
    "rating": "5/5",
    "review": "This films is worthily called one of the greatest films ever made, due to its fantastic plot, storytelling, character development, acting, and script. This is a must-see for all movie buffs."
  },
  {
    "rating": "5/5",
    "review": "Everything you should want from American cinema!"
  },
  {
    "rating": "5/5",
    "review": "This is the second time I've watched the movie, So impressed and moved. It tought me valuable lessons that I would benefit all my life."
  },
  {
    "rating": "5/5",
    "review": "The Godfather is a timeless tale of family over everything. Pacino's performance as the progressively reality-hardened Michael Corleone is otherworldly and Brando's as the Godfather gives it a run for its money as the best of the film. A cinematic masterpiece that did Mario Puzo's award-winning novel proud."
  },
  {
    "rating": "5/5",
    "review": "O melhor filme já feito em todo o cinema."
  },
  {
    "rating": "5/5",
    "review": "GOAT ... and I will go to the mattresses if told otherwise."
  },
  {
    "rating": "5/5",
    "review": "You can't believe The Godfather is 50 years old already. Made in 1974. It's a film you don't want to say, \"I've never seen it\""
  },
  {
    "rating": "5/5",
    "review": "A very good movie. Although it's quit long, you do not feel exhausted throughout the movie. Every single moment of this movie is valuable, and somehow serves as a novel turned into a movie. The tension in the beginning of the movie is extremely high, which is even much more than most good horror movies. The only small flaw I have with the movie is the cliche story, in which you see a great king, a competent son, and also an older brother who is not as worthy as the other. However, considering the whole movie, It's a movie which keeps being good and entertaining, with some moments which worth being watched over and over again."
  },
  {
    "rating": "5/5",
    "review": "Greatest of all time"
  },
  {
    "rating": "5/5",
    "review": "Phenomenal piece of art, one of the greatest movies to ever grace cinema. Marlon Brando (may he rest in peace) and Al Pacino gave the peak performances of the infamous gangster-times, and the movie has put a high standard and example on later films. Exquisite!"
  },
  {
    "rating": "5/5",
    "review": "It's a incredible movie, it's in my top 3 best movies of all time"
  },
  {
    "rating": "5/5",
    "review": "I absolutely adore this movie. I love the story, the characters and how the director worked with the camera angles and lighting. Must see! <<Cinematic history>>"
  },
  {
    "rating": "5/5",
    "review": "A classical masterpiece for a reason. The Godfather is a simmering slow burn that takes you through the transformation of characters and an excellent story without you even noticing. It is also a beauty to behold, with a superbly warm color palette. The acting is also great, with Marlon Brando's Don Corleone especially standing out. A joy to witness. 100/100"
  },
  {
    "rating": "5/5",
    "review": "The title of \"best movie ever\" isn't hype, believe me"
  },
  {
    "rating": "5/5",
    "review": "Epic in scope while maintaining a patience and intimacy characteristic of European art cinema, the Godfather is rightly considered one of the greatest films ever made. It continues to influence producers of films, television shows, and video games more than 40 years after its release. Nino Rota's score, the set design, and Brando's raspy pseudo-whisper have become part of our collective cultural memory. The film possesses an operatic quality, yet it's more understated than it is flamboyant. It takes its subjects seriously, bestowing legitimacy upon the internecine power struggles of the Mafia normally reserved for classical themes in high art. The film's release initiated a period when American filmmakers dared to take themselves and their artistic ambitions seriously. There's something deeply resonant in the film's treatment of filial piety, the need for respect, and our culture's abiding interest in the parallel moral universe of the Mafia."
  },
  {
    "rating": "5/5",
    "review": "Absolutely masterpiece!"
  },
  {
    "rating": "5/5",
    "review": "No need for explanation, purely masterpiece!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie ruined my Saturday night movie night. Who needs a sleeping pill when this Godfather crap is on. Marlon Brando with the crap in his mouth to make himself sound stupid, It's been decades since this movie was out, I wish I had read the reviews from people who didn't like it before I watched this sleeping pill!!. Why so many people feel this is a great movie is way beyond me!!. I thought it would be like when I first saw \"One Flew Over The Cuckoo's Nest\", I was turned off by the title, but when I watched it years later, it turned out to be one of the best movies I ever watched, not this Godfather movie, I wish I hadn't wasted my time falling asleep on this BORING nothing of a movie!"
  },
  {
    "rating": "5/5",
    "review": "Best movie ever made!!!"
  },
  {
    "rating": "5/5",
    "review": "Possibly the greatest movie of all time. It's got everything and the acting is out of this world. You will be sucked into these characters lives and there's a good chance your own life will never be the same. Yes it's THAT good. If your attention span is horrible and 3 hour movies aren't your thing - you might struggle here. But if you have an actual attention span you will experience something spectacular. A benchmark of cinema. And wait till you hear about the sequel...."
  },
  {
    "rating": "4/5",
    "review": "Marlon Brando steals the show. Some might find it long and boring but the acting is so top notch that it is a must see."
  },
  {
    "rating": "5/5",
    "review": "I've watched this movie at every stage of my life. It never gets old; I never love it any less. There's so much depth in the story telling, so much beauty in the drama, characters, and cinematography. Something about the way Coppola conveys the family dynamic that makes this movie really hit hard with me. It's long but well paced; the action sequences are timeless classics, of course."
  },
  {
    "rating": "5/5",
    "review": "When I decided to make watching movies with my wife the primary hobby of my life, I specifically set parameters for choosing our next movie that would avoid burning through all of the classics while we were still in our 20s. This was the primary movie I had in mind when I thought to do that, and I'm glad that I did. While we still ended up watching this at 27 years old, we put 850 or so movies under our belts first and had enough perspective to appreciate this as the enduring classic that it was. The highlights for me were the pacing, as there were tense action scenes sprinkled all through the runtime, the performances, as Brando's husky voice had really grown on me by the end, and the surprise ending, which wrapped the movie up more neatly than I've ever seen a final scene do, besting even Unusual Suspects in that regard. The list of movies I consider to be my favorites are heavily influenced by nostalgia; I suspect with repeat viewing this one will fit in right next to Billy Madison & Happy Gilmore, lol. I should also note that I found this to be miles better than Part II and that the two really don't belong in the same conversation about greatest movies."
  },
  {
    "rating": "4.5/5",
    "review": "It is a movie that belongs to the canon of classics for a reason. The core of the movie is a criminal story, but from the very first scene it is clear that it is much more than that. Full of beautiful shots composed by a careful eye, abundant in real emotions and complexities of human relations, also not lucking in well- developed and fascinating characters, the story draws you in."
  },
  {
    "rating": "5/5",
    "review": "a masterpiece. Without doubt Coppola's best film. Brando transformed into Don Corleone and Pacino ready to conquer the world. More than a mafia movie is a movie about the family"
  },
  {
    "rating": "5/5",
    "review": "simplesmente incrível, assista."
  },
  {
    "rating": "4.5/5",
    "review": "One of the transformative films of all time. Brilliantly written, Directed, and acted. It is one of the rare times when all the elements align to make the sum greater than the parts. Coppola's take exceeds the source material by Mario Puzo. The music is memorable. Brando, Pacino, Duvall, Caan, and the supporting cast created iconic characters and scenes that have influenced cinema till this day. The film is often attacked as glorifying the Mob; however, that criticism id from people who do not understand the film. It is a film that can, and should be, watched multiple times. It gets better and better."
  },
  {
    "rating": "4.5/5",
    "review": "I'm gonna be a little too honest here. I only watched The Godfather in peer pressure. I don't even like old Hollywood films. I always start feeling drowsy while watching them. Not only is the camera quality too bleak, but the accent of the time was also very illegible. But this one was fun to watch. I saw it on Prime Video and took multiple sittings to watch this. I finished it 6 months ago but I remember seeing it like it was yesterday. Being from India, I have always thought of 70's films to be very family friendly and musical. But this isn't one of them. This one, in simple words, is metal. The Godfather is probably what has inspired an entire genre of crime films. It is like what Star Wars is to fantasy, or what Superman is to the superhero genre (man, all 70's films have been so revolutionary in Hollywood). The whole idea of two groups of mafia fighting out each other in the most brutal way possible gave rise to Once Upon a Time in Mumbaai, Gangs of Wasseypur, the Mafia game trilogy, and even this film's two sequels. That is the amount of cultural impact this film has left. Don Corleone has become a household name now. The action scenes, the music, the acting, everything is legendary. I legit screamed at the scene where they put the horse's head in that man's bed. We see many times people learning acting by watching The Godfather films. The only problem I had, however, was what I said in the beginning of the review. The sound is not clear at all. When Vito Corleone speaks he sounds like he is swishing saliva in his mouth like a washing machine. It almost feels like the captions are saying something completely different from what the captions are saying. I finally gave up and switched to Hindi because the English ADR was so bad. I really wish The Godfather was a standalone film. It has one of the most satisfying ending in all the old films. It really didn't need those terrible sequels which don't even have a Hindi dub. Although it has been almost 50 years since it released, it still feels like it would spark outrage among certain sections if a Bollywood adaptation would be made. Definitely way ahead of its time. I would have recommended it to everyone, except everyone I know is either not interested in cinematography or has already seen it."
  },
  {
    "rating": "5/5",
    "review": "Just an amazing movie, so well done."
  },
  {
    "rating": "4.5/5",
    "review": "Well made movie but it's not for everyone."
  },
  {
    "rating": "4/5",
    "review": "Francis Coppola's The Godfather is a legendary creation in the history of filmmaking and a timeless classic. Almost half a century later, the movie is still enjoyed and appreciated for its gripping story, brilliant performances, and unforgettable pop culture influence."
  },
  {
    "rating": "5/5",
    "review": "Worthy of all the praise it's been getting. Captivates you from the first minute. Marlon Brando gives one of the best performances of all time. Pacino, Duvall and the entire cast are equally good. Even my mother, who can't stand films with violence, loves The Godfather."
  },
  {
    "rating": "5/5",
    "review": "Favorite movie of all time. The beginning of the greatest saga, and the best film in the series. The best gangster movie of all time, because it actually does something different with it, that I haven't seen in any other film, at least not done so well as here."
  },
  {
    "rating": "5/5",
    "review": "*SPOILERS* One of the most influential films of all time for many reasons, cinematography, acting writing, stakes and characters. The characters of the film make it what is, the most well known of course being Marlin Brando's Don Corleone, the godfather, who has the right mix of quality pristine writing and this being one of the last films of his career and this being swan song for this gangster film career being how he stood in the crime and mafia film genre at the time and how there young actors who were in this film and the series later on stand today, which also links into what the main themes of the film about the end and what about you is left behind and remembered about you and what your family will do to fill the hole that you had filled. Don Corleone is a very charismatic character with believable motives for an old man who has seen the world from many angles throughout his life and this is shown at the beginning of the film which is followed on later in the series of a desperate man pleading for help and Corleone seeing him within him and helping for nothing but a favour which is followed up on later in the film; that is only one example of the script and the actors making you route for the character in the film even though you clearly should not. The cinematography of the film is fascinating with Don Corleone being placed in darkness and in general dark areas throughout the film, Sonny being in light and overexposed settings throughout and finally Michael Corleone being placed in light settings throughout the film and moving through the film getting I. darker and darker settings and eventually turning to the same dark surroundings of his father, and his father Don Corleone's final scenes at his death being drenched in light as he dies the perfect death for a man as the life he has lived. Something this film really integrated fear into the viewer this scene proved this in one of the last and most famous scenes in the film, taking place after the death of Don Corleone and his men taking out every other gang in the city showing that even in death the godfather has more power than any of them do, including in his life when he was in a coma where his men decapitated a horse and placed it into the owner's bed. This film is also very clever because you really get to know Don Corleone through the film even though he is in a coma throughout the film and we get to know him after his death films after and we understand how he sees his children his pride and disappointment. I could go on for hours about the Godfather but you can only experience the film and build your own meaning behind small details by watching it and all three of the films are must sees, one of the best films ever."
  },
  {
    "rating": "5/5",
    "review": "Arguably the greatest movie of all time. With amazing performances given by the entire cast, especially with Brando and Pacino, this movie deserves every bit of praise."
  },
  {
    "rating": "5/5",
    "review": "\"A Man who doesn't spend time with his family can never be a real man.\" Not much can be said that hasn't already been said about this film, just watch it if you haven't already done so, and if you have... Watch it again."
  },
  {
    "rating": "5/5",
    "review": "This film is without a doubt one of the greatest ever made. From the opening line, this movie already establishes it's key theme - the American way vs the Mafia way, not just this, but it does a brilliant job of taking time with it's characters, unlike almost every blockbuster nowadays that fails at that. Granted, it does take around 40 minutes to get to the main plot, however this time is spent with some of the most investing character scenes in cinema, including the famous horse-head scene. Another thing the film does great is trust it's audience. What I mean by that is that it doesn't bother to explain things over and over again, instead it goes forth with what it mentioned, to make the viewers pay more attention to they know what's going on. The main thing about this feature that amazes me is how every, EVERY main character has there own story, or life that we see in play in some form or another, for example: Michael - A war veteran in love with a maid he met after coming back home. Sonny - has a wife and kids, however is quite a playboy. Connie - In an abusive relationship with her new husband and 1 new born child. Finally, throughout most of it's most investing scenes, it presents a great level of progression, presenting lots of conflict. This is perfectly achieved by first of all, setting up a verbal story or situation, giving the audience something to expect, but when that it suppose to be happening, they give us something different, something nobody saw coming so it keeps them surprised, the best example of this is in the midpoint of the movie, when Michael has the appointment arranged for him with Sollozzo and the corrupt policeman, what we were told was going to happen was that Michael would get the gun and shoot both of them once in the head, and then walks out, letting the gun slip subtly out of his hand. What actually happens is that he shoots Sollozzo in the head once, but the policeman twice, once in the neck and once in the head, and when waking out, he flings the gun out of his hand and loudly onto the floor, showing it was in his hand, putting himself more at risk."
  },
  {
    "rating": "5/5",
    "review": "Classic Movie! Very good mob movie! I love everything about especially the characters."
  },
  {
    "rating": "5/5",
    "review": "Seriously, do I have to say why I gave 5 stars? Honestly, this movie is absolutely brilliant and it is just perfect. But Vito....Vito...We don't understand when he talks. It is just inaudible and incomprehensible."
  },
  {
    "rating": "5/5",
    "review": "a classic that everyone should see"
  },
  {
    "rating": "5/5",
    "review": "A supreme intellectual and artistic achievement by Francis Ford Coppola. Marlon Brando nailed it! Must watch!"
  },
  {
    "rating": "3.5/5",
    "review": "This film is good. I do not put this anywhere near the entertainment or story value as I do Good Fellas.. There are dull points.. It is long because it takes so long to get the point across.. The acting is great.. Pacino, Brando, Cann, Duval are amazing.. The dramatic pauses, the b-roll, the dragging out it with silence is what makes this film good not great. I'm watching a film not reading a book."
  },
  {
    "rating": "5/5",
    "review": "This is one of the greatest films of all time alongside citizen kane"
  },
  {
    "rating": "5/5",
    "review": "Greatest Movie of all time period."
  },
  {
    "rating": "5/5",
    "review": "A master piece of cinema with a spectacular portrayal of Italian mafia in New York along with an amazing performance from Marlon Brando. It is long and slow which make the movie a little bit difficult to watch in one go, however, each scene contributes something to the main concept \"family\" and the end, it is worth watching due to the cinematic taste we are left with."
  },
  {
    "rating": "4.5/5",
    "review": "I'm not usually a fan of Coppola films, but this one was excellent!!! Perfectly paced, well acted and a superb cast with great cinematography. Nothing more to be said really!!! The only slight nitpick is lower rewatch-ability due to it's length, not something you can just watch on a random afternoon (also due to it's weighty nature)."
  },
  {
    "rating": "5/5",
    "review": "It’s The Godfather not much else to say"
  },
  {
    "rating": "5/5",
    "review": "The masterpiece of cinema."
  },
  {
    "rating": "5/5",
    "review": "Brilliant Performances, terrific screenplay, dialogue and direction calls for a film that is near to perfection. This film portrays a realistic take on a Gangster's life and is less of style but more of substance, something which is rarely seen today."
  },
  {
    "rating": "4/5",
    "review": "A classic movie, deep to understand."
  },
  {
    "rating": "3.5/5",
    "review": "Took me until 2021 to see it Good film A highly rated movie To me not perfect During fight scenes you can see the actors aren't touching Francis needed better camera work here"
  },
  {
    "rating": "4.5/5",
    "review": "\"Who's being naive, Kay?\" Excellent study of the nature/cost of power. Goodfellas is stronger for me for the first 50-70%, but the resolution here - hits deeper."
  },
  {
    "rating": "5/5",
    "review": "The Godfather is a truly Godfather of all mob movie i've ever watch, fills with powerful and outstanding perfomance by all the cast, again added with Marlon Brando oscar winning perfomance that really proofing the reason why The Godfather was a Masterpiece."
  },
  {
    "rating": "5/5",
    "review": "An excellent work of art."
  },
  {
    "rating": "5/5",
    "review": "An amazing peace of art."
  },
  {
    "rating": "5/5",
    "review": "The Godfather is one of the best features ever made. It's a true epic!"
  },
  {
    "rating": "5/5",
    "review": "One of the best films i have seen in my life. watch it and you'll never forget how good it is."
  },
  {
    "rating": "5/5",
    "review": "That is one of the greatest movies ever, while some people may find it slow, the action is well placed and outstanding when it happens, the acting is great, I have nothing to complain about this movie"
  },
  {
    "rating": "5/5",
    "review": "This is one of the greatest movies ever made!"
  },
  {
    "rating": "5/5",
    "review": "Greatest movie of all time."
  },
  {
    "rating": "5/5",
    "review": "Every shot is masterful; one of the most consistently entertaining films ever made"
  },
  {
    "rating": "5/5",
    "review": "I really can't think of anything wrong with this movie. It's perfect and I loved it"
  },
  {
    "rating": "5/5",
    "review": "Please have more classic movies/pictures like Godfather on screen"
  },
  {
    "rating": "5/5",
    "review": "This might be the most genius movie ever. The script is second to none. The famous line, \"I'm gonna make him an offer he can't refuse,\" is genius in itself. At first, you might think he is gonna bribe him or something. But it turns out he literally can not refuse it or he will die."
  },
  {
    "rating": "5/5",
    "review": "Spoilers ahead. The Godfather part I, also known as, when Michael was likable and we still had Sonny :^( I don't know what I can say about this that everyone else in the world hadn't already said. This movie was so good it didn't even really feel like it was 3 hours long because I enjoyed every moment of it. I really love everything about it, and out of part one & two, this one is my favourite as a mafia movie because I just love the way the plot flows and how real the crime world the movie creates is. Also, shout out to the cat at the first scene, he was the REAL hero of the movie"
  },
  {
    "rating": "4.5/5",
    "review": "Está bien pero no tan bien como Paddington 2"
  },
  {
    "rating": "0.5/5",
    "review": "I didn't enjoy myself not one bit. The movie hasn't aged well, it's boring and the fact that it's 3 hours long doesn't help at all. Marlon Brando is the only enjoyable actor to watch (Al Pacino is very inexperienced in this movie) and I hated Michael Corleone by the end. I respect this movie for laying the groundwork for basically every mafia movie after it but it doesn't deserve \"best movie of all time\" at all. Every time I hear someone telling me that it is I get pissed off. Everything I said is true for the sequel too. And don't tell me \"oH tHiS mOvIe CaMe OuT iN 1972\" because I've seen way older and way more enjoyable movies (like King Kong, Godzilla, The Good The Bad And The Ugly etc.) Oof, that was super Rotten."
  },
  {
    "rating": "5/5",
    "review": "What makes a movie great? How can a movie be considered the best of the best? These critical questions have been asked for decades, but is there really a clear answer? \"The Godfather\" (1972), directed by Francis Ford Coppola, has been considered one of, if not, the greatest movie ever created, and more than 25 awards and 3 Oscars seem to back this claim. However, is this really the case? Is this adaptation of Mario Puzo's \"The Godfather\" novel truly the best of the best? I'll put it simply: yes. This movie is the epitome of what a movie should look like and deserves all of the recognition it has received over the years. One of the many reasons that Francis Coppola's \"The Godfather\" is considered a cinematic masterpiece is that it kickstarted an entirely new generation of films. Albeit many mobster and crime films forego the creation of \"The Godfather\", Coppola soaked his film in foreign, Italian culture and depicted these gangsters as extremely intelligent and capable people with extensive mental profundity. As a viewer, you are immediately drawn towards the puissant character of Don Corleone, brought to life from an incredible performance by Marlon Brando. From his first few minutes on-screen, his powerful presence is felt through to audiences everywhere. Brando's peaceful, downplayed execution as the Don is one of the components of this film that makes it extremely enjoyable to watch and sets it above all others. That being said, it is critical to recognize the further incredible performances given throughout the film. Al Pacino's presentation of the intelligent and innocent son of Don Corleone, Michael, is nothing to be looked over. Michael's agonizing earnestness could only truly be performed by Pacino. Furthermore, James Caan, Robert Duvall, Richard Conte, and Diane Keaton, among many others, give sincere, gripping performances that would make any viewer feel for each and every character. Relatively few motion pictures can be 3 hours long but keep a decent degree of interest from the crowd like \"The Godfather\". The messages and themes throughout the film aren't simply credited to the directing or the cast, but also to the overall production. The film is so well put together as a whole that it is extremely difficult to dissect the movie and point out its flaws. After my first watch, I nearly created a petition to change the definition of the word \"perfect\" to something else: \"The Godfather\". It is utterly impossible to glance past and ignore the beautiful cinematography put together by the legendary Gordon Willis and the incredible score produced by the acclaimed composer Nino Rota. To summarize my experience, I truly believe \"The Godfather\" has this uniqueness and almost imaginary feel that gives the viewer the inclination that they are watching the greatest film ever brought to cinema. One simply cannot live a life without experiencing this masterpiece."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies of all time."
  },
  {
    "rating": "4.5/5",
    "review": "The Godfather is a prime example of what a movie should be. It does almost everything right. The Godfather has multiple shocking moments, incredible screenplay and a immersive story backed by phenomenal acting on all ends. While it drags on for a tad to long at some points, I don't think I ever got tired of watching it. Entertaining, funny, suspenseful, immersive, beautiful and dark, phenomenal acting and amazing director work is what you will get in 1972s \"The Godfather\". This is truly a remarkable film with a long enough run time."
  },
  {
    "rating": "3.5/5",
    "review": "Now that's one iconic movie."
  },
  {
    "rating": "3.5/5",
    "review": "While ever so slightly overrated with some features with a plot that demands close attention and listening, this one of a time film series provides suspense, fantastic acting, and great filmmaking to its audience. A definite classic!"
  },
  {
    "rating": "5/5",
    "review": "The Godfather fully deserves its reputation as a cultural touchstone and one of the two or three best films ever made. The direction, pacing, perfomances and dialogue are all nearly perfect. Despite a lenghty runtime it has a propulsive forward momentum that makes it impossible to stop watching."
  },
  {
    "rating": "4/5",
    "review": "The Godfather is an American crime film directed by Francis Ford Coppola, who co-wrote the screenplay with Mario Puzo and it was released in 1972. The film is based on the novel with the same name which was written also by Puzo. It stars actors such as Marlon Brando who plays the godfather as Vito Calderon in the film and also Al Pacino who plays as his youngest son Michael. This film is regarded as one of the best films ever made and it has influenced the mafia genre quite a lot. I have to agree and say this film was very impressive and not in the way that I expected. The film is about a crime family in New York who is led by Vito Corleone it is set in the 40s and 50s and it starts at the wedding of Vito Corleone's daughter but we are in Vito's office where he is doing his business. This scene is a very good example of how the film separates the life-and-death contrast; while outside there is a very bright and happy wedding this room is very deep-toned, shuttered, lighted by lamp even in the day time, and the story moves back and forth between this hidden world and the sunshine that is outside. This back and forth however might be bit off putting at first to follow the story, but it makes separation between those two worlds a lot more real. You get the sense that this underworld darkness is another secret life with its own fear, more real than the sunlight world outside. If we talk about the story a bit more at this business meeting Johnny Fontane, a popular singer and Vito's godson asks him if he can help Johnny secure A movie role. This is the first time we see the crime family in action. Bit later and shortly before Christmas, drug lord Sollozzo, backed by Tattaglia crime family, ask Vito for investment and protection through his political connections which Vito declines this leads to Vito getting attacked by de Tattaglia family which forces his youngest son Michael to take over the family business. This leads us to what I think is one the films strongest points which is its characters. Of course, we start with our main man Marlon Brando as Don Vito Corleone, the godfather' of a powerful Sicilian- American family and it was acted beautifully with his rasp voice, twisted mouth he is very seductive when he talks and even if it wasn't told its very believable. Yes he is this dark powerful king of the underworld. Brando isn't the whole show Michael who was played by Al Pacino manages to change from a small, fresh-faced, handsome college boy into an underworld lord, becoming more intense and more isolated at every step. In conclusion the things that I like about this film are, first of all the story and the thing I like about it is that story is told from the inside the crime family .We see things not black and white or good or bad but a lot more deeply. Secondly is the characters especially their development and Michael is a prime example the way he transforms from being an innocent outsider to his family and their business to being their head and following his father footsteps even when he didn't want it. Also, I found the cinematography quite impressive as I said in the beginning the way darkness represents the crime world is great you can see this very visible with Michael the way his face fades it to the shadows as he gets in to the family business shows a change in a character very well. I think this is a great film it might not be revolutionary as it was 50 years ago but is still if you haven't watched it strongly suggest you should give it to try."
  },
  {
    "rating": "5/5",
    "review": "The Godfather is a true masterpiece. Everything in the filmmaking- cinematography, story, dialogue, acting, directing- is pitch perfect and feels way ahead of it's time. It is a true trendsetter- countless gangster films in the decades following have been trying to do what it did so well, and none with such fantastic results. Don't mistake this for a fun, popcorn, blockbuster however. I look at it as a sort of cautionary tale- an honest look at how nasty a life in organized crime can become. The action and violence is never glamorized, and it isn't making light of the heavy themes. You don't realize it until somewhere around the halfway point- but the central character is Michael Corleone. Michael starts out as the bright light of the family- he has had no involvement with the \"family business\", and is a decorated WWII veteran. Michael initially gets his hands dirty when he is trying to protect his father. He makes a choice to kill those who intend to kill his father. Despite that Michael has likely killed before in military combat- something is different about these killings. After sinking his hands into the filth, he must spend an extended holiday in Italy to evade the law. During this time he is given a second chance- he falls in love, gets married, and seems to find happiness. But this can only be temporary- he is still a wanted man, a member of a well known crime family, and the violence that he unleashed only leads to more violence."
  },
  {
    "rating": "4.5/5",
    "review": "A film without weakness adapting to the screenplay a book. 9/10"
  },
  {
    "rating": "4.5/5",
    "review": "A mafia family faces changes during tumultuous times."
  },
  {
    "rating": "5/5",
    "review": "This film has to be in my top five movies of all time. The storyline is fantastic, and even though it is very long, I never felt bored. The characters are played fantastically, the music is addictive, and the whole movie is fabulously directed."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest of all time!"
  },
  {
    "rating": "4.5/5",
    "review": "An amazing script, accompained by great performances. The GodFather is a different classic film, that opened the doors to a wonderful future in cinema. It's at the level of the expectations, and in some sense even better than expected."
  },
  {
    "rating": "5/5",
    "review": "È sicuramente uno dei più bei film della storia del cinema"
  },
  {
    "rating": "5/5",
    "review": "The most perfect film ever."
  },
  {
    "rating": "5/5",
    "review": "The actor interpreting Don Vito was exceptional. This movie is a treasure."
  },
  {
    "rating": "4/5",
    "review": "Al momento que la ves comprendes porque se le reconoce como una de las mejores películas de la historia. un reparto impecable, una trama sobre gángsters muy bien ejecutada, definitivamente es una película que tienes que ver."
  },
  {
    "rating": "5/5",
    "review": "The Godfather of movies"
  },
  {
    "rating": "5/5",
    "review": "The Francis Ford Coppola masterpiece. Has everything without question. The perfect film"
  },
  {
    "rating": "5/5",
    "review": "I was a latecomer to the Godfather and only just watched it for the first time recently. It's cultural status and reputation as one of the greatest films ever made is undeniable. After seeing it, it matched all my expectations. It truly is a masterpiece that clearly inspired countless movies since; and is arguably the greatest film of all time."
  },
  {
    "rating": "5/5",
    "review": "0.23 laughs/min. A classic masterpiece."
  },
  {
    "rating": "5/5",
    "review": "A classic, a must see movie."
  },
  {
    "rating": "5/5",
    "review": "Greatest movie of all time."
  },
  {
    "rating": "5/5",
    "review": "A masterpiece, Coppola made history with this movie everything was perfect"
  },
  {
    "rating": "4/5",
    "review": "the plot is simple and complex at the same time and the interpretations are exceptional but I was unable to fully immerse myself in the story"
  },
  {
    "rating": "4/5",
    "review": "This was a good movie, but man, it dragged on so long I had skid marks. It took a very long time to get going, but once it embraced its dark story line and the characters started to fall into place, it was really entertaining. The plot is a bit convoluted and I'm still not sure I fully understand it all, but the important themes are obvious enough that it mostly makes sense. The acting and the score really hold this one together, bringing out the perfect atmosphere for this crime story."
  },
  {
    "rating": "4.5/5",
    "review": "Godfather is about mafia families and how they handle their business. We follow the Corleone family. Don Vito Corleone(Marlon Brando) is the head of family and a very powerful man while his son Michael Corleone(Al Pacino) he tries to stay away from their dirty business. Marlon Brando was excellent in this film every time he was on the screen I was captivated. His facial expressions and his silent dominance is what you expect from a \"Godfather\". Remember any man who must say \"I am the king\" is no true king. You heavily see how important family is for a mafia man(and italian also) and how everything revolves around it. While Al Pacino portrays beautifully the son who slowly tries to learn the ropes of the job. The movie has heavy dialogues and the most scenes are people talking then acting for brief moment then talking again I really liked that , its not fast-paced not slow-paced either is just the perfect combination. Music was really good , I feel like if the music was not on point we will be talking for an entirely different movie whatsoever. Definitely a must see."
  },
  {
    "rating": "4/5",
    "review": "The classics of the genre. Virtuously crafted, brilliantly staged and played the movie almost doesn't have any weak spots. Although the transition of the main character from the outsider of the family business to its head demands some more explanation."
  },
  {
    "rating": "5/5",
    "review": "Una de las mejores películas de todos los tiempos. Nada que añadir a lo que todos sabemos."
  },
  {
    "rating": "5/5",
    "review": "This is one of the most rich and compelling crime dramas ever made. Grade: A+"
  },
  {
    "rating": "5/5",
    "review": "A must-see for any human. Awesome cinema!"
  },
  {
    "rating": "5/5",
    "review": "I used to think that the second one was better but after just watching it recently this one tops it!"
  },
  {
    "rating": "5/5",
    "review": "What can be said that hasn't already been said? It's a timeless masterpiece that can be watched and quoted over and over again. Perhaps the greatest movie ever made."
  },
  {
    "rating": "4.5/5",
    "review": "This is a masterpiece. I saw it for the 1st time in 2009. I knew a lot of the lines because they are quoted in my favorite movies and TV shows. Still, I found myself saying certain lines to myself in the next weeks. Different lines than I've heard from others. I heard some of the dialogue as lessons to remember. I had to remind myself that I didn't really attend an Italian family's wedding. My fav moment is when Michael shot the cop. I started yelling, \"drop the gun! Drop the gun! Drop the gun!\" Nothing else was in my mind for minutes after. After I calmed down, I thought, that was a mistake. It totally pulled me out of the movie. I almost had a heart attack. I couldn't think. Then I realized my panic meant I was totally in the movie. A masterpiece!"
  },
  {
    "rating": "5/5",
    "review": "No matter how many years have passed, this movie is the example of a true classic. A true master piece!"
  },
  {
    "rating": "5/5",
    "review": "Goodness gracious this movie!!!"
  },
  {
    "rating": "5/5",
    "review": "Paramount almost ruined this movie, it is because of Francis Ford Coppola that we can enjoy such a masterpiece."
  },
  {
    "rating": "5/5",
    "review": "The most appropiate definition of \"Materpiece\". Tell me a movie that is more famous than this. Tell me a movie that has had more parodies spinned off its storyline than this. Tell me one movie that has been as quoted as a much as this. The answer is you can't. No movie has had as much of an impact as The Godfather has had ever since it was released. The acting was simply amazing, what else could you say. What could be more appealing to people(even today) than watching actors like Al Pacino, Marlon Brando, James Caan, Diane Keaton, Talia Shire and Robert Duvall. This is like heaven for someone who is a fan of movies. With this movie Brando was able to bring himself back into the limelight. His performance as the godfather alone is iconic. His character has been recreated so much in films that it has almost if it has not already become a cliché. His performance though was not a cliché. His performance was subtle and breathtaking. It was so genuine and realistic that it was not just probably but definitely more genuine than Marlon Brando himself. Al Pacino was perfect for this film as well. What a way to start up your career. His character was all about depth and he displayed it perfectly. He was able to display his own inner-battles in his mind as well as the battles he had with his family, friends and enemies. His character was more of a psychological character study than anything else to me. Robert Duvall to me was the glue to the movie. He added a different perspective to everything in just that he was not Italian yet having the respect of the mafia. His character is a man of high authority within the Corleone family who was listened to and insightful;. This was simply perfect giving the film great balance throughout. The rest of the cast was just icing on the cake. The writing was phenomenal and breathtaking. As mentioned before there has been no movie quoted more than this. It is not even the quotes though that makes the writing in here so perfect. It is the symbolism and meaning that went into every scene. There are countless symbols, messages and lines in here that are so memorable yet it is as realistic as a movie could get. The directing by Coppola was perfect as well. Not many movies can be 3 hours and yet maintain a good level of interest from the audience like The Godfather. Coppola deserves credit for this. The symbolism and messages that went into every scene also has to do with the directing not just the writing. The movie is so well edited and strung together that the only word that could come to my mind is perfection. The cinematography and music were perfect. The score of this movie is one of the most memorable ever. If you were to hear it you could identify it right away. The cinematography was what actually really drove this movie. The Godfather seems to have this mystique to it, it gives you the feeling you are watching something truly remarkable. The horse's head, the scene of Brando running with his groceries, the coffee shop scene, \"I'll give him an offer he can't refuse\" and countless other scenes and quotes from this movie have become a part of our culture. These scenes and lines have been recycled over and over again in comedies, commercials, etc. that it is impossible to avoid the greatness of The Godfather. The Godfather is like a disease once you see it you fall in love with it. I don't know if it is the greatest movie ever but it is definitely the most iconic film ever made. 10/10"
  },
  {
    "rating": "5/5",
    "review": "It's a depiction of the integrity that still hang on those dangerous peoples' lives , it's not a gangster film that only takes a picture of what's on the surface , it takes that camera a little deeper to those master minds of the underworld ."
  }
]