[
  {
    "rating": "5/5",
    "review": "Great acting, music, concept, social theme - twists you dont expect and keeps you fully engaged. Need to see again!"
  },
  {
    "rating": "5/5",
    "review": "You HAVE to see this movie!!!!"
  },
  {
    "rating": "5/5",
    "review": "In Sinners, director Ryan Coogler and star Michael B. Jordan reunite to deliver what may be their most spiritually charged and politically urgent work to date. More than a film, Sinners is a mirror—boldly reflecting the buried traumas and enduring strength of Black America. Jordan’s performance is raw and riveting, carrying a generational weight that never feels forced. Coogler’s direction transforms symbolic imagery—baptismal water, fractured stained glass, the pulpit and the prison—into poetic language. Each frame breathes with historical memory and present-day urgency. Rather than spoon-feed its audience, Sinners trusts us to sit in discomfort and revelation. For Black viewers, especially, it speaks directly and powerfully: a cinematic sermon that interrogates systems of sin and survival. Coogler doesn’t just tell a story—he resurrects one. Without question, Sinners stands as one of the most meaningful cinematic achievements of the decade."
  },
  {
    "rating": "4/5",
    "review": "Culture Music Vampire"
  },
  {
    "rating": "5/5",
    "review": "second time watching it that 70mm worth it totally worth it, still a badass Vampire flick especially with that IMAX"
  },
  {
    "rating": "5/5",
    "review": "Incredible storytelling and beautiful cinematography. Go see it in 70mm!! Its beautiful to watch real film!"
  },
  {
    "rating": "5/5",
    "review": "This was a very good movie. Haven’t seen a great movie in a while. It flowed, made sense, and even though it was a #VampireMovie , the overall story & message was a #GreatVibe. I give it a 10/10"
  },
  {
    "rating": "5/5",
    "review": "Superb! Very well written and casted!"
  },
  {
    "rating": "5/5",
    "review": "Greatest movie in my lifetime. A classic."
  },
  {
    "rating": "5/5",
    "review": "Favorite part is when he killed the klansmen"
  },
  {
    "rating": "5/5",
    "review": "Second time seeing it in theatersblown away both times. Ready to go again. I have never seen a movie more than once in my life! The acting, the storytelling, the costume design and the music.there is just so much to love. Well done, Cooglers. Very well done."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed the Film . It was great movie to watch"
  },
  {
    "rating": "2/5",
    "review": "Very odd movie, made no sense"
  },
  {
    "rating": "5/5",
    "review": "Great movie!! Stay past the credits."
  },
  {
    "rating": "2.5/5",
    "review": "It is a good movie but as a born again Christian it definitely has some inappropriate elements in it. There are some scenes I did not enjoy as a Christian. If you watch this from a non biblical world view it is a very good film. With a biblical world view it is a good story but very very inappropriate."
  },
  {
    "rating": "5/5",
    "review": "New agr vampire movie but also set in post slavery times when African Americans still had to fight to be free and own property. It's about love and family and equality and standing up for what's right and fighting evil with all your might."
  },
  {
    "rating": "5/5",
    "review": "Great movie just got to pay attention to detail!"
  },
  {
    "rating": "5/5",
    "review": "10/10 Definitely one of the Top 10 Films of the year."
  },
  {
    "rating": "5/5",
    "review": "It’s a masterpiece of a movie. layers upon layers of metaphors"
  },
  {
    "rating": "5/5",
    "review": "Excellent casting. Great imagery connecting the past to present society challenges."
  },
  {
    "rating": "5/5",
    "review": "Ryan Coogler does an excellent job at blending different genres from a period piece to horror to thriller And borderline a musical. I have seen it twice already and got more out of it the second time around. Michael B Jordan does an excellent job at playing the twins. He made it so it was easy to distinguish the twins from each other from mannerisms. It is quite good to see Haley Steinfeld in a more mature role as she grows as an actress. I go back to the movie soundtrack constantly because that’s how much of a role the music played in the movie."
  },
  {
    "rating": "1/5",
    "review": "Meh. Boring and fell asleep 40 min in. Walked out during climax. 2/10"
  },
  {
    "rating": "5/5",
    "review": "Must see will see again."
  },
  {
    "rating": "1.5/5",
    "review": "From a Horror movie, it's a great movie, BUT as a Born Again Spirit-Filled Christian ii was NOT a Movie that was beneficial for Christians to Watch. Lots of things that are in CONFLICT with the Christian Life!"
  },
  {
    "rating": "1.5/5",
    "review": "Bots have taken over this service. This movie was incoherent and mind numbing. Great message, but lost in its poor storyline, and complete lack of character connectivity."
  },
  {
    "rating": "5/5",
    "review": "I loved every second of it!"
  },
  {
    "rating": "5/5",
    "review": "Great pace and execution. Thrilled to my satisfaction"
  },
  {
    "rating": "5/5",
    "review": "What a movie, I left wanting more. Music was amazing and story line was scientific. Loved the characters."
  },
  {
    "rating": "3.5/5",
    "review": "I thought the movie was overall a worth watching story and a new take on the vampire genre. However, I think the director took too many liberties with what we have know for years about vampires, their strengths and weakness, no way the twin would have been able to best his vampire twin as the vampire is always stronger than a human. I think the story took too long to get to the action and was very slow and dull, also there were many more vampires than humans by the end of the movie so how the player survived was just not very believable."
  },
  {
    "rating": "5/5",
    "review": "My city had one of only eight 70mm prints in the country. Gorgeously shot film, great experience seeing it. Pretty much full audience each time I saw it. Absolutely incredible."
  },
  {
    "rating": "0.5/5",
    "review": "It was very weird, gory and long. I would not recommend it."
  },
  {
    "rating": "5/5",
    "review": "Exceptional movie, so good and original"
  },
  {
    "rating": "5/5",
    "review": "really enjoyed this movie. it was exceptional work. not once was it a dull moment. kept me entertained the whole movie."
  },
  {
    "rating": "5/5",
    "review": "Loved it! Plenty of messages."
  },
  {
    "rating": "5/5",
    "review": "That was the best movie i’ve ever seen."
  },
  {
    "rating": "3.5/5",
    "review": "I feel like it was missing something…"
  },
  {
    "rating": "5/5",
    "review": "Everything about this movie is amazing!!👏🏾👏🏾👏🏾👏🏾 10 out of 10. Highly recommend."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie. Unique take on a classic horror movie monster. I loved the intersection of music, black culture, and horror."
  },
  {
    "rating": "5/5",
    "review": "It was a good watch it just took a little long to get to the point, but that's storytelling. I love the idea of the twins, and it' was funny and sad"
  },
  {
    "rating": "5/5",
    "review": "Great movie. 💯👍🏾👏🏾"
  },
  {
    "rating": "5/5",
    "review": "Incredible. Perfection."
  },
  {
    "rating": "5/5",
    "review": "Probably the best vampire movie I’ve ever seen in a long time"
  },
  {
    "rating": "5/5",
    "review": "Great writing and acting! This is my 2nd time seeing it and I plan on seeing it again."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie and storytelling. Was honestly 1 of the best movies I've seen in the past 10 years. Highly, highly recommend"
  },
  {
    "rating": "5/5",
    "review": "The movie was really good. It was movie that made you think. Michael B Jordan did a wonderful job."
  },
  {
    "rating": "5/5",
    "review": "So many visual messages. So good. It was giving “Rosewood + Dusk til Dawn” vibes. The all star cast bench was deep! Performances were outstanding and the soundtrack was perfect."
  },
  {
    "rating": "5/5",
    "review": "The best movie experience ever! I cant understand why marks are so low! Probably because they have too many black people for certain audiences! I have seen it three times already and will purchase as soon as it becomes available!"
  },
  {
    "rating": "5/5",
    "review": "great movie all around an great twist"
  },
  {
    "rating": "2/5",
    "review": "I just feel it was a little overrated"
  },
  {
    "rating": "5/5",
    "review": "I love the movie, it was great"
  },
  {
    "rating": "5/5",
    "review": "Casting was great! The storyline was unique and interesting. Micheal B Jordan was flawless as both Smoke and Stack. I’d watch it again!"
  },
  {
    "rating": "5/5",
    "review": "It’s a great story and that could be it but it also could be about community and power and messaging and sin and soul… I hope this gets some kind of Oscar recognition because there is so much to think about and so damn good! Also soundtrack like Oh brother where out thou where it is great and interwoven."
  },
  {
    "rating": "0.5/5",
    "review": "What in the Zimbabwe mushroom trip was this movie? DO NOT WASTE YOUR MONEY."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! Very intense and thought provoking. Great casting of the actors."
  },
  {
    "rating": "4.5/5",
    "review": "I loved every single bit of symbolism in this movie, the messages were clear and it actually didn’t feel like a gory horror movie i loved it"
  },
  {
    "rating": "5/5",
    "review": "One of the best movies that I have ever seen. Amazing writing and original storytelling alongside a beautiful soundtrack. Refreshing to watch in the sea of Hollywood remakes."
  },
  {
    "rating": "1/5",
    "review": "I totally disliked the Movie I liked nothing about the movie"
  },
  {
    "rating": "5/5",
    "review": "Atmosphere and just oozing it. This is not your typical horror or vampire movie. Its an incredibly well done period piece and just is awesome."
  },
  {
    "rating": "4/5",
    "review": "Sinners is a stylish, high-octane ride that injects fresh blood into the vampire genre. With slick action sequences, a genuinely original story, and a cast of compelling, well-drawn characters, this film stands out as a bold and entertaining addition to the supernatural action lineup. The fight choreography is a highlight—brutal, fast-paced, and beautifully shot. But what really elevates Sinners is its commitment to character. Each member of the ensemble feels distinct and layered, with motivations that make the drama hit just as hard as the violence. The world-building is sharp and creative, offering a new spin on vampire lore without feeling forced or gimmicky. There are a few pacing hiccups here and there, but overall the direction keeps things moving with confidence and energy. It’s stylish without being hollow, and fun without losing emotional stakes. A solid 4-star experience that proves there's still plenty of life left in the vampire genre when it's done right. Definitely worth a watch."
  },
  {
    "rating": "5/5",
    "review": "A highly inventive and visually stunning piece!"
  },
  {
    "rating": "5/5",
    "review": "Excellent vampire movie. The music was great. Good acting."
  },
  {
    "rating": "5/5",
    "review": "incredible. Great exposition, great history, loved the metaphors used about black culture in American History. the horror aspect was very cool and the action was satisfying and fun to watch. the character work and writing was phenomenal. Better than anything Disney is making these days."
  },
  {
    "rating": "5/5",
    "review": "This movie is amazing on so many different levels. Acting Michael B Jordan fantastic! Editing 5 Stars, cinematic masterpiece. Sound 5 Stars. Directing 5 Stars. See this movie in Imax to achieve the full impact."
  },
  {
    "rating": "5/5",
    "review": "Great movie, the culture, history, and music was beautifully represented."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie. I regret waiting so long to see it. Definitely gonna watch again."
  },
  {
    "rating": "5/5",
    "review": "What an outstanding film. With historical accuracy, great cinematography, music, sets, choreography, cast., the story of love and redemption was incredible!"
  },
  {
    "rating": "5/5",
    "review": "Wowza! Haven’t seen a horror movie this entertaining and well done in a LONG time. With movies like this, here box office —take my money."
  },
  {
    "rating": "5/5",
    "review": "Loved it would see again"
  },
  {
    "rating": "5/5",
    "review": "Very eye opening and draws your emotions in"
  },
  {
    "rating": "5/5",
    "review": "Great movie!! Hopefully we'll get a part 2!"
  },
  {
    "rating": "5/5",
    "review": "This is a really good movie! Saw 2 times will definitely see more and more. I always see things I didnt see or pick up on things I didnt."
  },
  {
    "rating": "5/5",
    "review": "Fantastic back-story, characters, and of course some horror thrown in. DON'T LEAVE THE MOVIE AT THE BEGINNING CREDITS ROLL, YOU WILL MISS A GREAT ENDING MONTAGE!"
  },
  {
    "rating": "0.5/5",
    "review": "Slow start, corny monologues, and then it turned into a ridiculous vampire movie. Can't for the life of me find that this movie had any value."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing movie loved the story and production."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! Surprises around every corner. Dont miss the end! Some people left the theater when the credits started."
  },
  {
    "rating": "5/5",
    "review": "IMAX experience is amazing...Loved this movie! Ryan Coogler is the best writer/directors today! Michael B Jordan dual portrayal is a master class in acting. Storyline is terrific and totally unexpected. I will see it again and again. Yes, people, it IS that good! Just go see it."
  },
  {
    "rating": "5/5",
    "review": "If you're already looking up the movie, I'm certain you already heard its praises - the best thing to do next is go in and enjoy a phenomenal film."
  },
  {
    "rating": "4.5/5",
    "review": "Like everything about the movie."
  },
  {
    "rating": "5/5",
    "review": "Originality and great acting."
  },
  {
    "rating": "1/5",
    "review": "Movie is very slow and predictable. Plus the old southern American accent is really difficult to understand. Oh yes, I did give up when all the vampires started dancing Irish music."
  },
  {
    "rating": "4.5/5",
    "review": "Enjoyed the film very well made fantastic music"
  },
  {
    "rating": "4.5/5",
    "review": "One scene in particular was great! Overall the movie was very good/excellent. It starts off as a work of historical fiction set against the terror and indignity of the Jim Crow south before becoming a bit of a more conventional horror film. As always Coogler solicits great performances from his cast and layers social and political commentary into the narrative in ways that are apparent on the surface and as well as nuanced in allegories."
  },
  {
    "rating": "5/5",
    "review": "The movie was great and interesting. The cast was brilliant especially Michael B. Jorden he is really a great actor. It’s worth seeing in theaters. 👍❤️😀"
  },
  {
    "rating": "5/5",
    "review": "Love it! Went in with zero knowledge of the plot and was blown away!"
  },
  {
    "rating": "1/5",
    "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
  },
  {
    "rating": "5/5",
    "review": "This was a fantastic movie. Many different genres. Not as scared as you may have been led to believe but thats a good thing. The story is much deeper than horror. Its really about family"
  },
  {
    "rating": "5/5",
    "review": "Didn’t expect it to be so good 👌🏽✨"
  },
  {
    "rating": "2.5/5",
    "review": "at the beginning it was slow but right at the middle part things got interesting."
  },
  {
    "rating": "5/5",
    "review": "The whole movie was wonderfully done. I've seen it a few times in theaters, and I always notice something I didn't see before. it's a really great movie."
  },
  {
    "rating": "5/5",
    "review": "Even if youre not a fan of monster movies, give this film a watch. Its more about the power of music. And a lot of things. The monsters are a sideshow representing other things. A masterpiece."
  },
  {
    "rating": "1/5",
    "review": "Overhyped for no reason."
  },
  {
    "rating": "5/5",
    "review": "The realness the thrill loved it!!!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely 5 stars. Beautiful made and beautifully shot. No notes."
  },
  {
    "rating": "5/5",
    "review": "IMAX Experience is cool, but regular theater experience would be just fine."
  },
  {
    "rating": "5/5",
    "review": "It was a blended genres that delivered a wonderful dish of culture, scenery, and sound. These elements combined made this movie great."
  },
  {
    "rating": "5/5",
    "review": "Best movie of the year"
  },
  {
    "rating": "5/5",
    "review": "Great movie! awesome effects!"
  },
  {
    "rating": "5/5",
    "review": "Best movie I’ve seen"
  },
  {
    "rating": "5/5",
    "review": "I really liked the theater and the ambience. The people were all very polite and had minimal-to-no-talking. Jacob did a great job of introducing the movie and the IMAX/70mm technology, and thank you Dick for flying in from England! My only complaints was that the sound was a little quiet and that the film was a little dim, but those could just be me unaccustomed to 70mm film (it was my first time seeing it). There were also a few dust/specks flying down the screen towards the end of the movie, but I also think its part of the technology. Thanks for having such a cool theater and screen available to the public!"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie it's definitely a must watch!"
  }
]