{
  "movie_name": "Until Dawn",
  "reviews": [
    {
      "rating": "3/5",
      "review": "A decently fun watch, if the trailer grabbed you at all, give it a watch"
    },
    {
      "rating": "4/5",
      "review": "Good thriller far from what I expected though the game was better…. Still a good thriller though."
    },
    {
      "rating": "3/5",
      "review": "I thought it was going to be like the game. It was little jump scared. Giving 2005 movie."
    },
    {
      "rating": "4.5/5",
      "review": "Greatly produced 🤗😈"
    },
    {
      "rating": "4/5",
      "review": "Never played the game but honestly thought it was a well made movie with good effects."
    },
    {
      "rating": "3.5/5",
      "review": "It was pretty good but like a lot of movies the main characters are the dumbest people I’ve ever seen."
    },
    {
      "rating": "5/5",
      "review": "Felt like the game beginning to end. Just an amazing job!"
    },
    {
      "rating": "4/5",
      "review": "It's completely different from the original game but this was great"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Very entertaining."
    },
    {
      "rating": "2.5/5",
      "review": "Worth a watch as a film not being attached to the game, with genuinely good scares and sequences. However it significantly fails at adapting the source material"
    },
    {
      "rating": "3/5",
      "review": "It was good as a movie but shouldn’t be compared with the game"
    },
    {
      "rating": "5/5",
      "review": "One of the better scary movies I’ve seen in awhile! Lots of jump scares!"
    },
    {
      "rating": "5/5",
      "review": "It was very good with gotcha moments that were great!!"
    },
    {
      "rating": "5/5",
      "review": "This movie was a good terror film, all those haters only hate cause it’s not EXACTLY or somewhat linear with the game. It’s a good terror movie for anyone just wanting to watch an exciting film."
    },
    {
      "rating": "0.5/5",
      "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Está horrible esta cosa."
    },
    {
      "rating": "3/5",
      "review": "Ok. Was I the only one who was extremely disappointed that there were no reverse scenes as shown in the trailer? This is why I went to see it because it looked so cool and different. Yet, it never happened. With that said, I will be fair. The movie was good. The audience rating is on target. It was a fun movie. Only downside is some of the scenes were extremely dark and I could not make things out."
    },
    {
      "rating": "3.5/5",
      "review": "Okay, it wasn't exactly similar to the game, but it is worth a watch. There are cameos from the game, some shots, and the background looks familiar. That ending credit scene wish there was more too it and I wish there wouldve been more like that ending credit cause that is Until Dawn. Character choices for this movie were solid Megan was a great actress I was so glad she was the spirtiualist friend always need one of those in our life. Clover connected and connected and from the jump she was the main clue after the sister."
    },
    {
      "rating": "2.5/5",
      "review": "Overall, it ended up being a pretty fun movie that had somewhat of a story line to it, which is what should county."
    },
    {
      "rating": "4/5",
      "review": "Good concept, good movie, good execution. Liked it, just didn’t love it. Had so much potential but only lived up to about 80% of it. Definitely good for a single watch, for sure."
    },
    {
      "rating": "3/5",
      "review": "im going to be fair because thats all that is left when it comes to horrors in today Hollywood. Black person killed first (if they are even in the movie). Some sort of Lesbian touching going on with confusion). Atleast two white bimbos with blonde hair, big breast and no acting skills. Dont forget the friend zone or dumb jock/bully. Well you can ditch the script about 10 minutes in and just focus on the cool EFX killer scences. I thought it was watchable, I mean I didnt fall asleep so that says something right? Look its not Forrest Gump or Oh, God is it Cancer? So really, for what it is, I give it a fair \"3\". Because if you are watching it then you already know what to expect. A good ole fashion horror movie. I say its a win/win. See you at Final Destination this weekend!!!!!"
    },
    {
      "rating": "4/5",
      "review": "Had me jumping sometimes"
    },
    {
      "rating": "4.5/5",
      "review": "O filme é interessante, não repete exatamente a fórmula do jogo, mas usam de artifícios para se assemelhar do elemento de escolhas ou o fato de poder re-jogar para ter um novo final, eu gostei, tem seus problemas, por exemplo o final, n gosto tanto, mas em geral achei um filme muito bom"
    },
    {
      "rating": "4.5/5",
      "review": "Even though it was a loop hole movie where the movie starts over and over, it kept me engaged and interested."
    },
    {
      "rating": "5/5",
      "review": "good watch. great gore scenes"
    },
    {
      "rating": "4/5",
      "review": "loooooved this movie. the jump scares were everything and the easter eggs aaaahhhh omg ! i’m hoping they make a sequel"
    },
    {
      "rating": "3.5/5",
      "review": "It’s a good horror flick that could have been better if the main premise had a more focused narrative. The initial setup while fairly typical in horror cannon is done well but then its unfocused nature becomes apparent during the main storyline. Overall had some good jump scares and some interesting kills."
    },
    {
      "rating": "3/5",
      "review": "\"Until dawn\" is a Horror movie based on the popular game under the same name, but let me tell you the movie and game are two very different things. If you are going into this movie thinking you are getting a sequel to a popular choose your own path horror game you are wrong. This Flim is more of a prequel than a squeal to the game, with totally different characters and a different story line that only ties a bit into the game, also the Flim takes place before the main events of the game. Now I personally enjoyed the movie, mostly because I didn't play the game before I saw the movie. But after playing the game my mind has changed about the Flim. Sure it's a good, fun, and one gory hell of a ride but it's more of a you'll watch once and most likely never again. So that is why I have given this the rating of 3/5 Stars."
    },
    {
      "rating": "1.5/5",
      "review": "Beginning writing wasn’t a great set up, started losing me from the beginning due to not understanding our characters. The new actors also couldn’t do it justice but I don’t necessarily blame them. There were a couple scenes that made sense and were a likely choice for anyone, but there were also a few that were classic stupid horror character decisions that I will never enjoy. Didn’t even get through all of it before I left. A horror movie shouldn’t be dependent on expected jump scares, and I feel this is what it turned out to be."
    },
    {
      "rating": "3.5/5",
      "review": "A very good horror film, definitely worth watching. Graphic, bloody and gore! What you want from the horror genre."
    },
    {
      "rating": "2.5/5",
      "review": "Certainly makes allusions to the game, but doesn't really follow the story at all, which could be for the best since the original game already kind of captured the movie experience. The resetting time premise is intriguing and adds a neat twist although it winds up falling into standard horror movie tropes. Not a bad watch, but ultimately nothing outstanding."
    },
    {
      "rating": "4/5",
      "review": "I liked the different scenes/killers. Interesting story-line"
    },
    {
      "rating": "3/5",
      "review": "A fun watch with a lot of good ideas! Just don't go in expecting a movie like the game. Just pretend the movie is named something else."
    },
    {
      "rating": "4/5",
      "review": "A fun and well-paced horror movie made by people that clearly share a love for the genre. May not resemble the game that closely, although there are a number of easter eggs and great scares to enjoy here"
    },
    {
      "rating": "4/5",
      "review": "I enjoyed that it was different from any other horror movie and kept me on my toes"
    },
    {
      "rating": "3.5/5",
      "review": "I thought this movie was going to be based of the videogame. It was not…it took a different turn and its not bad but i see why alot of fans are disappointed. There was great scares and some funny dialogue; gen z coded. Its worth a watch just dont go in thinking its about the video game."
    },
    {
      "rating": "2.5/5",
      "review": "It was different! I liked it just didn’t understand the ending."
    },
    {
      "rating": "3/5",
      "review": "Good if like gore!!!"
    },
    {
      "rating": "1/5",
      "review": "Awful and stupid premise for a movie"
    },
    {
      "rating": "5/5",
      "review": "I f**king loved this! It was a scary, mind f'er! A Great watch even if you didn't play the games!!"
    },
    {
      "rating": "2/5",
      "review": "A victim of bad writing and mid-acting. It’s not a good adaptation, but it’s an okay horror movie. Though, I’d have to say Cabin in the Woods did it better- I wish the “survive the night or become the night” was expanded on more or the lore surrounding the town but eh- we’ve come to expect mediocre or lazy writing when it comes to Sony adaptations…"
    },
    {
      "rating": "4/5",
      "review": "Some questions left unanswered, but all in all great movie!"
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing!! Idc if it wasn’t like the game is fine is still an amazing flick. The creatures in this game are freaking creepy."
    },
    {
      "rating": "3.5/5",
      "review": "I loved the cinematography and cast but the story would've been better if there was more backstory. For example, we don't know how everyone keeps coming back to life. What's the origin of that? Other than that, the movie was alright. It didn't match the video game but it had horror of you're looking for scares."
    },
    {
      "rating": "3.5/5",
      "review": "Mid again like 6.5/10"
    },
    {
      "rating": "3.5/5",
      "review": "Not bad for a horror movie. Some stuff wasn't explained but it didn't matter. I love the special effects. They did a good job with that."
    },
    {
      "rating": "5/5",
      "review": "Excellent film with its unique and very special characteristics"
    },
    {
      "rating": "1/5",
      "review": "As a lover of Horror movies since a child and now a 30+ year old, this was not it! It was too much going on, confusing at times. The movie gave the vibe of an upcoming director who's trying to get in the game, and it's like \"show me what you've got\"....and then this movie is the best you can come up with. Very amateur horror movie. Also the ending was as if they ran out of things and just was throwing things together in the movie. Overall, it was terrible. There were a few jump scares for someone easily scared, but I didn't budge once."
    },
    {
      "rating": "3/5",
      "review": "It wasn't bad. A decent jump scare flick, but nothing original or interesting. It definitely pulled out every horror movie cliche in the book. But it was fun enough for a night out horror movie."
    },
    {
      "rating": "3/5",
      "review": "The 1st hour of this movie is a 8-9/10 but as most horror films once it explains what's going on and gets to the conclusion it unravels. I like some of the changes from the game but since I didn't really care about the characters it would have been better if we had more permanent deaths. Overall it's about an average film."
    },
    {
      "rating": "5/5",
      "review": "10000/10 would def recommend such a good and scary movie perfect if you like jumpscares and gore somewhat"
    },
    {
      "rating": "0.5/5",
      "review": "As a fan of the videogame and even knowing that it doesn't have the most original concept in the world, I can only say that whoever made the movie took something with good potential and somehow managed to turn it into an average american cliche horror movie that has literally nothing to do with the game at all. The movie doesn't contain the same characters,scenes,dialogue,scenarios, or concepts, so it's basically just a random horror movie with SOME references to a video game. If you're a fan hoping to get a representation of Until Dawn on the big screen, the best thing you can do is ignore this movie."
    },
    {
      "rating": "5/5",
      "review": "I wish I had played the game before seeing the movie, but that is ok, because I still enjoyed the movie. I liked that this movie was a different horror story."
    },
    {
      "rating": "5/5",
      "review": "I was worried if this was theater worthy. It did not disappoint!"
    },
    {
      "rating": "5/5",
      "review": "I am a horror movie aficionado, and this movie is SOLID. Very scary, fun surprises, my daughter even left the theater because the nonstop suspense was too much for her. Highly recommend!!"
    },
    {
      "rating": "5/5",
      "review": "it had jump scares in the movie....which I loved. it was a great movie."
    },
    {
      "rating": "5/5",
      "review": "Absouotely brillant movie from start to finish cast was great a must watch ✅✅"
    },
    {
      "rating": "0.5/5",
      "review": "People need to follow the game more to the T. This is absolute garbage where the game was a masterpiece. Like the game is so detailed story wise where this movie is just a cliche mess."
    },
    {
      "rating": "2.5/5",
      "review": "This movie left a bitter taste in my mouth. I've wanted an Until Dawn movie for so long and when one finally comes out it's just a cop out. The story is completely different and doesn't make any sense. The idea is never fully developed. The one good thing I can say about this film is it's gore. Other that that? Bleh."
    },
    {
      "rating": "3/5",
      "review": "None of the tropes we love and know, all of the happy ending this group didn't deserve"
    },
    {
      "rating": "3.5/5",
      "review": "There were many jump scares. It kept me intrigued in what was happening. Overall I enjoyed the movie."
    },
    {
      "rating": "0.5/5",
      "review": "For fans of the game, this has next to nothing to do with the plot of it. Unnecessary amounts of gore that didn’t fit at all with the plot and felt very disjointed as a whole."
    },
    {
      "rating": "5/5",
      "review": "Actually really good!! The critics score I do not reflect how much I enjoyed the movie! It really did keep me on the edge of my seat"
    },
    {
      "rating": "5/5",
      "review": "Such a great movie. Had me on the edge of my seat. Such an original horror plot. Loved it"
    },
    {
      "rating": "0.5/5",
      "review": "Poor acting, low budget scare tactics /special effects- its a hard pass, wait til available at no cost"
    },
    {
      "rating": "4/5",
      "review": "I love horror, and I love the game Using the game’s background as origin To create a new story that suitable for a movie I think it has already been good enough than most of the game’s movie And even though you know where will be scared, it still sacred me as hell, it’s great"
    },
    {
      "rating": "2.5/5",
      "review": "A B movie at best. The movie reminds me of the movie Silent Hill."
    },
    {
      "rating": "5/5",
      "review": "Not your typical take on a video game adaptation great acting from less known actors it is something that I greatly appreciated didn't try to make it something it wasn't but still stayed true to the until dawn universe"
    },
    {
      "rating": "2.5/5",
      "review": "There were some funny scenes, and for the most part it was entertaining. If you're looking for gore that you've seen in a dozen movies before (and they joke about this in the movie), this is your movie. Other than that, it was mediocre."
    },
    {
      "rating": "3.5/5",
      "review": "Not sure why it feels like a lot of people are hating on this movie. I felt like it had a lot of good scares, plot wasn’t too bad, and the monsters were really well done. It strayed a lot from the original until dawn game while still paying homage and I thought that worked great for it. The only thing that really stuck out as bad to me was the exploding scene. When the first person exploded I burst out laughing and couldn’t stop until the scene ended. All the people I was watching with had the same reaction. It was so sudden and random we couldn’t help but laugh. All in all though, the movie is definitely worth a watch."
    },
    {
      "rating": "3.5/5",
      "review": "As someone unfamiliar with the games, the movie was enjoyable. Some pacing issues at the end but overall lots of fun deaths, sets, monsters."
    },
    {
      "rating": "4/5",
      "review": "overall good movie. had some really good startling moments. thanks"
    },
    {
      "rating": "4/5",
      "review": "I’m surprised I’m giving a modern horror film 4-stars, and I mean that in a positive way. I like the cast, the movie is cinematically pleasing, the “scary characters” are creepy!I laughed, I jumped, I turned my head to look away and I got into bed at night wondering if I should triple check to make sure all the doors were locked. It’s not a 5-Star Exorcist quality script, but it is well-done. Take a friend and go watch this movie! You will need the support afterwards."
    },
    {
      "rating": "2.5/5",
      "review": "If they would have stuck with the plot of the game it would have been more interesting. It just wasn’t interesting. The characters didn’t annoy me, and the acting was good for what it is. They recycled Groundhog Day, but didn’t really say why anything happened. A guy just kind of appeared and had a magic “fear” experiment."
    },
    {
      "rating": "5/5",
      "review": "pretty cool scary movie"
    },
    {
      "rating": "1.5/5",
      "review": "Not crazy about the adaptation from the game which is far from similar. Slightly entertaining but overall could’ve just watched at home."
    },
    {
      "rating": "5/5",
      "review": "La verdad es buena aclaro solo tiene giños al videojuego ya que no es como el juego pero nos mustran referencias de el, tiene momentos de sustos es buena para pasar el rato"
    },
    {
      "rating": "0.5/5",
      "review": "A disheartening use of the \"Until Dawn\" IP. If I could give this zero stars, I would."
    },
    {
      "rating": "4.5/5",
      "review": "En lo personal no me \"asustó\" mucho, pero si fue una buena experiencia, le doy un 8/10 en mi escala personal, tal vez los actores pudieron hacerlo un poco mejor, en especial \"Abel\", que a veces parecía que sus emociones/gestos no concordaban con lo que se supone debía demostrar, pero fuera de eso, es una buena película de miedo, no es \"novedosa\" en cuanto lo mostrado, pero son ingredientes clásicos, a veces queremos que inventen nuevos ingredientes en la pizza, pero nunca está mal pedir y disfrutar una que tenga lo que clasicamente sabemos que nos gusta."
    },
    {
      "rating": "4/5",
      "review": "Good jump scare. Very good film."
    },
    {
      "rating": "4.5/5",
      "review": "I’m surprised people gave this movie mid reviews and said it was unoriginal when in fact there is nothing out there like it."
    },
    {
      "rating": "2.5/5",
      "review": "The \"stuck in a homicidal time loop\" has been done before and done better. This movie gives strong Silent Hill vibes complete with an air raid siren. Director David F. Sandberg directed one of my favorite horror movies \"Lights Out\" so I guess I was expecting and hoping for more than I got. It's not bad but still left me wanting."
    },
    {
      "rating": "3/5",
      "review": "I loved the Game and liked the movie. Did not follow the game, but still enjoyed it."
    },
    {
      "rating": "3.5/5",
      "review": "Has all the ingredients of a good horror movie. I liked it 🔥"
    },
    {
      "rating": "5/5",
      "review": "did not see this movie yet, but i liked the game"
    },
    {
      "rating": "4/5",
      "review": "jump scares left and right, good storyline"
    },
    {
      "rating": "5/5",
      "review": "Easy 5 stars. Dunno why people don't like it or say it's decent. And the ending was awesome"
    },
    {
      "rating": "3.5/5",
      "review": "A lot better than some reviewers give it credit for, as for a game based film I really enjoyed it. Ella Rubin gave a great performance"
    },
    {
      "rating": "3/5",
      "review": "Story goes bland about halfway through, it's just meh, nothing groundbreaking or original here"
    },
    {
      "rating": "2/5",
      "review": "The reveal near the end wasn’t even good, like why is dude trying to turn people into Wendigos? The whole trauma thing was neat but associating it with Wendigos wasn’t clever. Might as well just have made a Silent Hill movie. If this was a movie with a different title and wasn’t trying to connect with the game, maybe it’ll be good. But no, the concept wasn’t excecuted well. Whatever, this movie is better than that crap Uncharted."
    },
    {
      "rating": "2.5/5",
      "review": "It was ok, different, potentially could have been more scarier if it could have been something that could really happen. I would watch it again though too see what i may have missed the first time"
    },
    {
      "rating": "5/5",
      "review": "Great movie but could of shown us more of that giant creature in the rain"
    },
    {
      "rating": "3/5",
      "review": "maso mi rey, esta ok pero no se pq tienen efectos especiales nivel el mono si son sony pero weno, esta wena pero no repetiria."
    },
    {
      "rating": "5/5",
      "review": "Aunque no es fiel al juego al 100%, tiene unas referencias e ideas que encajan bien y hacen qué la película sea amena. Deberían verla, muy entretenida."
    },
    {
      "rating": "5/5",
      "review": "Really good movie. Great plot. Great dialogue. Didn't expect that from a movie. The movie is based on a game, so it will be hard to get a good rating because usually a big percent of the player base likes to get in echo chambers and gangcomplain how different is from the shoa. Which is sad, because this one is actually good."
    },
    {
      "rating": "1/5",
      "review": "Not worth watching in theaters or watching in general, it barely ties into the game and even if it wasn’t based on the game the movie is still trash. One dimensional characters, bad acting, zero cinematography, random monsters that don’t make sense, boring climax, corny friendship lines, bad plot and story. Don’t watch."
    },
    {
      "rating": "2/5",
      "review": "I walked out after about 20 minutes."
    },
    {
      "rating": "3.5/5",
      "review": "“Until Dawn” é um filme com direção competente — o que inclui sustos bem orquestrados, apesar dos jumpscares excessivos, e uma maquiagem impecável —, mas peca no roteiro a partir do clímax. A trama carece de explicações coesas e bem amarradas, o que compromete seu desfecho. Ainda assim, merece uma nota 3,5 em 5."
    },
    {
      "rating": "4/5",
      "review": "I’m surprised on the lower ratings for this movie. It’s worth seeing and my partner both enjoyed it. I’d not pay too much attention to the reviews and go in for the experience, just be mindful there isn’t much in terms of backstory. Have fun and enjoy the ride!"
    },
    {
      "rating": "5/5",
      "review": "I loved it. Not a movie snob and I found it entertaining from beginning to end. Better than most horror films these days. It was funny, had it scare moments and the kills were holy crap, innovative and different"
    },
    {
      "rating": "3/5",
      "review": "\"Survive the night or become part of it\" is the name of the game in one of the latest horror installments, \"Until Dawn.\" Derived from the 2015 PlayStation release, tis a playful, bloody story of a group of friends thrust into a world of perpetual nightmare and death, including by way of a pickaxe wielding villain. They say a cat has nine (9) lives. This film has apparently seen those nine (9) lives and raised the related humans four (4) more, allowing for any glimmer of hope and escape. Amongst the personal vibes of Evil Dead 2 in part, Ella Rubin crushes the role of \"Clover,\" displaying Ash-type strength and stamina throughout the many long nights. Until Dawn doesn't materially move the needle, but it scratches the itch, and goddammit, that's good enough for me today."
    },
    {
      "rating": "2/5",
      "review": "Until Dawns predictable story, clunky Wraithspawn, and uneven pacing disappoint. The acting is the only highlight, but it cant save the mediocre experience."
    },
    {
      "rating": "2/5",
      "review": "Kinda blah. That’s really all I can say 🥹"
    },
    {
      "rating": "3/5",
      "review": "This movie started off great but then fell apart really fast. The ending was horrible and no one actually die. The movie got very cheesy at the end and I saw people leave the screening."
    },
    {
      "rating": "2.5/5",
      "review": "I think the biggest flaw of this movie is its title. I would’ve enjoyed the film more if I hadn’t been expecting something similar to the game. This could have easily been fixed by changing the title to reflect the fact that it has nothing to do with the masterpiece that is Until Dawn. As a standalone original movie, I can say it wasn’t bad."
    },
    {
      "rating": "4/5",
      "review": "Good plot good story and you couldn't really guess what was going to happen really good movie to check out"
    },
    {
      "rating": "3/5",
      "review": "It's definitely a one-time watch. I prefer playing the video game."
    },
    {
      "rating": "3.5/5",
      "review": "Fun horror movie. Not the typical “cookie cutter” storyline."
    },
    {
      "rating": "5/5",
      "review": "Had few good jump scares. Some funny lines. Lots of suspense."
    },
    {
      "rating": "3.5/5",
      "review": "It is not the game, which isnt a bad thing in this case. However, if you have played it youll get all of the fun references and connections that lead from it."
    },
    {
      "rating": "2.5/5",
      "review": "as a massive fan of the game, my expectations were in hell so that probably helps my rating lol it’s fine tho. bad dialogue, corny characters, fun kills, a pretty cliché horror movie based off a far superior (but still cliché) video game."
    },
    {
      "rating": "1/5",
      "review": "If you've ever played the game, you won't like this movie. One of the only things it has in common with the game is it's title. It feels like the scenario was written by an AI with the sole directive of \"make a movie vaguely based on Until Dawn and add a time loop to it\". Even if you haven't played the game, it's just another pointless teen scream with no real plot or point to it."
    },
    {
      "rating": "5/5",
      "review": "Foi tão bom ir ao cinema e ver um filme inspirado em um dos meus games favoritos, captar as referências e compartilhar com meus amigos essa experiência. Foi incrível!"
    },
    {
      "rating": "4/5",
      "review": "I know a lot of people don’t really like this movie, it is supposed to be based on the game, but even if it’s nothing like the game, it’s still a good movie. I think it’s just easy to over hate, but then again, that’s just my opinion."
    },
    {
      "rating": "3/5",
      "review": "Tem alguns elementos da história do jogo mas no geral é diferente, então chamar de Until Dawn foi mais pra atrair o público que jogou. Tem umas facilitações de roteiro e não achei que ficou claro sobre a tal maldição de reviver a noite, mas gostei da ideia de \"checkpoint e save game\". Me lembrou muito \"O Segredo da Cabana\"."
    },
    {
      "rating": "5/5",
      "review": "A must see I loved it"
    },
    {
      "rating": "3/5",
      "review": "The movie was good, but I personally think it has nothing to do with the original game. There was only some references, but nothing much, like the wendigos, dr.Hill and one mention of Josh. And they experience multiple nights instead of just one. It’s a good movie, but disappointed that it’s not more relatable to the game."
    },
    {
      "rating": "4/5",
      "review": "It was fine. Serviceable. I liked the actors. It was extremely gory. I think fans of the video game will enjoy the movie. Inventive kills."
    },
    {
      "rating": "2.5/5",
      "review": "Okay, so I went into Until Dawn blind, not having played the game, and honestly, it was a bit of a letdown. The setup’s intriguing: a group of friends, led by Clover (Ella Rubin), get stuck in this creepy, rainy valley where they keep dying in brutal ways—slashed by a masked killer, mauled by some clown-thing—and wake up to relive the night. Cool concept, but it gets repetitive fast. The scares are loud and gory, which is fun for a bit, but they feel like the same trick over and over. Ella Rubin’s decent as Clover, hunting for her missing sister, and Peter Stormare’s Dr. Hill is unsettling in a good way, but the other characters are forgettable—just there to scream and die. The story tries to tug at your heart with Clover’s grief, but it’s too rushed to care. The big finale, where they break the time-loop with a sacrifice and some mystical mumbo-jumbo, felt like every other horror movie ending. It looks slick, and the blood’s aplenty if you like that, but it’s shallow and predictable. I wanted more twists or depth, but it’s just an okay horror flick that fizzles out."
    },
    {
      "rating": "3/5",
      "review": "I liked the graphics and the amount of gore, I liked the premise of the movie. It just fell a little flat, felt like there was something missing from it."
    },
    {
      "rating": "3.5/5",
      "review": "defiantly unique with its own narrative that sways away from the original game but still a very enjoyable horror movie! & a lot of GOOD genuine jump scares that caught me off guard."
    },
    {
      "rating": "3.5/5",
      "review": "Very gory. Stupid parts 3 1/2 stars"
    },
    {
      "rating": "5/5",
      "review": "Jump scare movie but honestly best horror movie I’ve seen in years"
    },
    {
      "rating": "5/5",
      "review": "The original game of Until Dawn was a campy homage to the genre of horror films that so many reviews are criticizing the movie for actually being. People who are complaining that it \"isn't like the game\" are complaining that an interactive movie wasn't downgraded and regurgitated as a barebones film with no substance. The game was frightening because you were playing it. It would never have worked out without major overhauling, which this movie did. This movie was just plain FUN. The actors were excellent, there was more than enough subtle callbacks to the game and it is a powerful story about healing mental illness. 5/5 stars from this psyche major!"
    },
    {
      "rating": "5/5",
      "review": "Ending could have been a bit better but it was overall a good movie. A ton of jump scares and I’m waiting on part 2"
    },
    {
      "rating": "3.5/5",
      "review": "Overall a pretty good horror movie. Had some suspenseful moments. Had a little feel of Groundhog Day without the comedy. If you like slasher flicks it's worth seeing"
    },
    {
      "rating": "5/5",
      "review": "Must see if you are in to horror films, even tho it’s based on a video game it will still catch you by surprise."
    },
    {
      "rating": "4/5",
      "review": "Had good suspense and thrills , but ending was predictable"
    },
    {
      "rating": "2.5/5",
      "review": "If you played the game you wont love it, if you have watched a scary movie before you have seen it. Not a date night movie but a good time killer, I’d wait for streaming. Good special effects, different horror troupe each night is a fantastic idea, cast did fine. Note- I played and loved the game and stereotypically the movie does not follow the plot to the game at all. (Eventually Hollywood will learn to use the source material that made it famous in the first place.)"
    },
    {
      "rating": "5/5",
      "review": "My whole family loved it!"
    },
    {
      "rating": "5/5",
      "review": "By far the best horror movie Ive seen in awhile"
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this one. Kept you on the edge of your seat and was genuinely scary!"
    },
    {
      "rating": "4/5",
      "review": "Loved the game references"
    },
    {
      "rating": "5/5",
      "review": "Creators were able to take the source material of the game and turn it into something fresh and creative. As a Until Dawn's player back on PS4, I liked it! Keep it going!"
    },
    {
      "rating": "4/5",
      "review": "As a horror fan, I loved this movie! As an until dawn fan, I think they could have definitely made it more accurate to the game. I do definitely think it was a good horror film, and if it was just a horror film and not an adaptation it would have definitely done better."
    },
    {
      "rating": "3/5",
      "review": "Some good jump scares and creepy vibes. Maybe better as a stream at home movie. Worth a watch but maybe not the ticket price."
    },
    {
      "rating": "1/5",
      "review": "I got there and i got no notification that my movie was canceled"
    },
    {
      "rating": "4/5",
      "review": "Somewhat novel approach to the traditional horror/thriller film."
    },
    {
      "rating": "3/5",
      "review": "Didn’t bore me too much but also didn’t entertain me enough. I liked the concept and how it linked to the games. It just didn’t use the concept enough and felt a little dull at times."
    },
    {
      "rating": "3.5/5",
      "review": "So scared!!! I liked it!!! :D"
    },
    {
      "rating": "3/5",
      "review": "Go into this movie knowing it's nothing like the game, once you separate the two it's actually quite an enjoyable movie. Good CGI and great acting, I wish Sony tied it a bit more into the game lore but still a great movie:)"
    },
    {
      "rating": "4.5/5",
      "review": "Definitely worth seeing. It was refreshing to see a horror movie with actual actors as the monsters & not CGI or AI."
    },
    {
      "rating": "4/5",
      "review": "Great movie, I loved the references from the game"
    },
    {
      "rating": "3/5",
      "review": "It was just ok. This movie was kind of strange."
    },
    {
      "rating": "2.5/5",
      "review": "A good movie, but if you know the game you’re expections are way higher. Many Details are missing, the story could go very deeper."
    },
    {
      "rating": "5/5",
      "review": "loved it fantastic practical effects and a unique plot"
    },
    {
      "rating": "5/5",
      "review": "Watched the movie with my daughter and we loved it. Movie had our hearts running and jumping out of our seats"
    },
    {
      "rating": "5/5",
      "review": "GREAT movie. As a horror movie fanatic, this is one of the best horror films I've seen in a decade."
    },
    {
      "rating": "1/5",
      "review": "It sucks! It is not even close to the game, this definitely could have been somewhat more successful if it was just its own movie itself. It is a disgrace to the video game, and is nowhere near as good as it. I like the actors though, but everything else is just disappointing."
    },
    {
      "rating": "4/5",
      "review": "Its one of the best movies Ive seen this year"
    },
    {
      "rating": "5/5",
      "review": "Absolutely original and fun"
    },
    {
      "rating": "2/5",
      "review": "Personally didnt like it. If youre someone who doesnt know much about horror, itll suit you. Premise of the movie was good, acting and suspense factor not good. Wasnt realistic enough for me"
    },
    {
      "rating": "3.5/5",
      "review": "While it isn’t sanbergs best, nor certainly his worst, it manages to be creatively horrific and even funny at times."
    },
    {
      "rating": "2/5",
      "review": "Great start but horrible finish! Sadly a disappointment."
    },
    {
      "rating": "3/5",
      "review": "Good plot idea, lots of jump scares and blood. Just not executed to the best possibility."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is incredibly repetitive. It throws the book at you with the monsters from the game and has next to no real explanation. If you like the game, just play it again. Save your money or use it to buy the remaster and just play that. This movie is beyond garbage"
    },
    {
      "rating": "5/5",
      "review": "Nothing like the game but a great film on its own"
    },
    {
      "rating": "3/5",
      "review": "Very good suspense. Good plot. Kept me interested and had lots of thrillers"
    },
    {
      "rating": "3.5/5",
      "review": "If you go in expecting it to be anything like the game you won’t enjoy it, but if you haven’t played the game or don’t care if it’s not accurate you’ll probably have a fun time."
    },
    {
      "rating": "5/5",
      "review": "I definitely enjoyed it"
    },
    {
      "rating": "1/5",
      "review": "Too much gore. I knew it was scary but did not like it. We got up and left after 25 - 30 minutes into the movie."
    },
    {
      "rating": "4/5",
      "review": "Had a blast with this film. It had some great jump scares and fantastic kills! I wanted more and more! Bring on the sequel!"
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this movie. It was tense, interesting, gory, well-acted and looked really great. The sets were really well done. I also have to give a huge thumbs up to the excellent make-up effects. The movie's second half was not as good as the first half, but overall this a very good Horror movie."
    },
    {
      "rating": "4/5",
      "review": "Really good horror movie for now adays"
    },
    {
      "rating": "5/5",
      "review": "Genuinely terrifying and I never saw the next twist coming"
    },
    {
      "rating": "5/5",
      "review": "As a long running Until Dawn fan, I went into this not expecting my expectations to be met but it succeeded them. This movie kept me on my seat, guessing what would happen next. I can't wait to get it on Blu-ray."
    },
    {
      "rating": "3/5",
      "review": "Not a bad movie if you can get past the whiny male characters."
    },
    {
      "rating": "4/5",
      "review": "This isn't a masterpiece of horror, but it's unique enough to keep you guessing about what will happen next. Even though it's a time loop movie, it's different every time, and I was notably more anxious during this movie than any other horror movie I've seen recently."
    },
    {
      "rating": "5/5",
      "review": "If you dont think about the game it's a amazing movie with a amazing premise. I loved it and probably one of my favorites. I liked how clover was so stubborn about everything but learned to let go. She learned what she needed to do to survive and she didn't settle for less. That is just one of the many great character arcs in this movie."
    },
    {
      "rating": "3/5",
      "review": "Not great, but not terrible either. A lot of ridiculous SMH moments, but not a bad way to spend a few free hours on a weekend."
    },
    {
      "rating": "2.5/5",
      "review": "Meh, it was okay if you turn your brain off."
    },
    {
      "rating": "5/5",
      "review": "I loved everything about this movie. It's a great suspense movie with lots of gore. Jump scares were on point!"
    },
    {
      "rating": "2/5",
      "review": "What a waste of a premise. It couldve been something decent but instead it settled for mediocre. Sad"
    },
    {
      "rating": "3/5",
      "review": "While I didn’t realize \"Until Dawn\" was based on a decade-old video game prior to watching it, the film did give me strong \"Silent Hill\" vibes, which made it more enjoyable. That said, I don't think it worked well as a film. The pacing felt overly hectic, the storyline lacked clarity, and the characters came across as one-dimensional. However, while it didn’t work as a movie, it could definitely be more effective as a mini-series, with each episode ending in a death and beginning with a revival."
    },
    {
      "rating": "3/5",
      "review": "I think it’s a great movie since the beginning"
    },
    {
      "rating": "5/5",
      "review": "an absolute mind bender"
    },
    {
      "rating": "5/5",
      "review": "There is nothing to disliked is a great movie and I really enjoyed the fact that there is always a suspense and terror."
    },
    {
      "rating": "5/5",
      "review": "movie was great like a fun house of terror."
    },
    {
      "rating": "2/5",
      "review": "Very LAME video game-movie: Clover and her teenaged friends are trapped on a mysterious island where a masked stranger stalks them all and kills them, just to have the ritual repeat itself the next day ...a la Groundhog Day. This tired, formula-thriller is a very obvious rehash of Friday the 13th and shows like From which also explores recurring death motifs. Some tell-tale signs this is a bad movie? All the girls have bare midriffs; they speak in cliche dialogue like \"I'll be right back\" before getting killed; and it's produced by Playstation Productions. Which is a video game company. Not a movie studio. Enough said."
    },
    {
      "rating": "4/5",
      "review": "having not played the game myself, I can't speak to the aspect of how well it was adapted. but as a standalone Movie experience itself, it was a very satisfying ride. suspenseful, with a few good, genuine scares thrown in. And the cast outperformed What I'm sure anyone expected From a List of relatively lesser-known faces. easily a four out of five for me."
    },
    {
      "rating": "4/5",
      "review": "Some fun call backs to the game but definitely a different story. It was good overall as a horror movie. Just have to have the right expectations going in!"
    },
    {
      "rating": "5/5",
      "review": "A lot of action from beginning to end"
    },
    {
      "rating": "4.5/5",
      "review": "This was a good movie, but I started out very confused! Once I understood the series of events, I was able to fully engage."
    },
    {
      "rating": "4/5",
      "review": "Horror movie Jumanji with good jump scares."
    },
    {
      "rating": "5/5",
      "review": "Jump scares , great movie"
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good for a movie based on a game! Kinda loud for no reason but that’s the point kinda lol"
    },
    {
      "rating": "4/5",
      "review": "Had such a good time with the movie. So glad I watched it in theaters. Doesn't follow the game storyline, but that's ok! Def worth the watch!"
    },
    {
      "rating": "1/5",
      "review": "This movie raised far more questions than it answered."
    },
    {
      "rating": "3/5",
      "review": "not what i expected but wasn't the worst thing i've ever watched"
    },
    {
      "rating": "4/5",
      "review": "it was decent . about 1 jumpscare . and pretty gore . overall a 7.5/10 ."
    },
    {
      "rating": "3.5/5",
      "review": "Story plot was good, exciting, good action, horror, great monster characters, great thrillers, and ending with good."
    },
    {
      "rating": "3.5/5",
      "review": "i thought this was really fun - i sort of went in blind & wasn't expecting much; i didn't even know it was a game until after the fact (which, i've heard it's nothing like anyway). but it was visually appealing & even though the characters/dialog/storyline wasn't the greatest, the jump scares & kill scenes were pretty on point. it's really hard to make scary movies - everything is so subjective & everyone is so desensitized nowadays - so i know jump scares get a lot of flack for being cheap, but at least they're scary for a split second. i think if you're into campy, over-the-top gore comedy-horrors, you'll enjoy it."
    },
    {
      "rating": "4.5/5",
      "review": "I thought it was pretty good. Lots of jumpy scenes. Makes me want to play the game."
    },
    {
      "rating": "1/5",
      "review": "Mediocre, run of mill slasher film, kills not creative and plot repetitive!! Skip it !!"
    },
    {
      "rating": "5/5",
      "review": "Gore galore. I'll give it 5/5 for the kill scenes alone. 🤘"
    },
    {
      "rating": "5/5",
      "review": "Was a great movie, pop ups were scary!"
    },
    {
      "rating": "5/5",
      "review": "This movie was really good, and it definitely had some scary moments."
    },
    {
      "rating": "2.5/5",
      "review": "Meh. I just finished watching it and I’ve pretty much forgotten it already."
    },
    {
      "rating": "5/5",
      "review": "Was good! It had some good scenes."
    },
    {
      "rating": "2/5",
      "review": "very upset and disappointed"
    },
    {
      "rating": "2/5",
      "review": "I'd avoid this. The story was confusing and poorly put together. Wish I could get my 25 back"
    },
    {
      "rating": "0.5/5",
      "review": "Would not recommend , would not want to have to watch it again, 150.00 plus for the worst food that I have eaten in a long time,small bits of lobster covered in the greasiest breading, steak and salad were tolerable, because we were famished,You could use a good Kitchen Manager, only thing worse than the movie was the food"
    },
    {
      "rating": "0.5/5",
      "review": "Skip! DO NOT WASTE your money on this. I feel bad for the folks at supermassive games. Sony and PlayStation just 💩 all over one of the best and most creative games I ever played... I couldn't finish the movie it was such a joke. Wait for it to come to a streaming service or TV provider but don't spend a dime to watch this ... They could have re-created the actual game and done better.... Sony should offer refunds"
    },
    {
      "rating": "1.5/5",
      "review": "Wouldn't recommend paying to see this movie."
    },
    {
      "rating": "5/5",
      "review": "It was a good scary movie, jump scares, gore and guts. Action- packed, survival skills was a must. I liked it a lot!"
    },
    {
      "rating": "2/5",
      "review": "Predictable and excessive. I left after two or three time resets. I heard this is a game of some sort, well the movie adaptation doesn't sparkle."
    },
    {
      "rating": "3/5",
      "review": "Until Dawn was pretty good, but very dragged out!!!"
    },
    {
      "rating": "1/5",
      "review": "I did not go because it was 18 and over"
    },
    {
      "rating": "5/5",
      "review": "I honestly loved this movie so so much! I think the lower ratings are probably coming from people who played the game, and feel like it didn’t pertain to the game at all. Well, I never played the game so that didn’t matter to me. Just based on the movie itself, it was SO GOOD. Like, I would go watch it again for sure. My goal is to actually get scared during a movie, I like good jump scares, which is hard for me to find with movies. This one had a couple but one scene in particular, my friend and I both almost jumped out of our seats! Haha. It was awesome. It also shows what good, loyal friendships look like. The main characters want to help and save each other, they’re not only worried about themselves. Which I loved. A lot of movies it’s everyone for themselves and they would throw their friend in front of a bus to save themselves, but not with these characters. It was very refreshing. I’ve already been hyping this movie up to everyone I know. I can’t wait to watch it again!!"
    },
    {
      "rating": "4/5",
      "review": "not too long, sustain interest, some unique visuals, unique plot from the typical ground hogs day theme."
    },
    {
      "rating": "2.5/5",
      "review": "Movie was pretty good. Not great, but fun."
    },
    {
      "rating": "4/5",
      "review": "it was a OK movie... i really enjoyed it..."
    },
    {
      "rating": "3.5/5",
      "review": "I went in with low expectations. It was a fun- slasher movie with a few great jump- scares. It will be streaming soon, so turn out the lights and have a good time."
    },
    {
      "rating": "4.5/5",
      "review": "it was pretty cool. (spoiler) The jump skip to the last day was good and bad at the same time"
    },
    {
      "rating": "5/5",
      "review": "Brilliant as good as the game 🎮 👏"
    },
    {
      "rating": "2/5",
      "review": "Unremarkable time filler"
    },
    {
      "rating": "5/5",
      "review": "LOVED this movie, this was a pretty good horror movie and it’s been the scariest ive seen in AWHILE. This movie really captures the horror of death and dying and is highly recommended!!!!"
    },
    {
      "rating": "3/5",
      "review": "Too many jump scares that it took over the entire point of the movie. It was also just like any other type of horror film"
    },
    {
      "rating": "5/5",
      "review": "A lot of jump scares and an actual good scary movie for once!"
    },
    {
      "rating": "3.5/5",
      "review": "It was an entertaining movie."
    },
    {
      "rating": "5/5",
      "review": "Interesting story plot, gore was good along with the chemistry with the cast"
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this movie. Some good jump scares and a great cast and really liked the way it ended, had me on the edge of the seat at times which I like movies that really get you into it and on the edge but overall a great watch. Would recommend this movie over Clown in the corn field any day."
    },
    {
      "rating": "3.5/5",
      "review": "Interesting plot but some of the photography was dark, out of focus & difficult to follow"
    },
    {
      "rating": "4/5",
      "review": "This was a fresh and interesting movie. Took my son (who is 10) to see it, which was a little gory for him, but there were lead times enough to cover his eyes in the gory parts. We both enjoy playing video games together (when I have time) -- so that feeling was definitely there. All in all, a fun movie. I'm sure it may not win any awards, but worth the price of seeing in a good theater if you have the time and want something fun that doesn't take itself too seriously. Good acting, editing, sound, filming, and decent plot. If you think there are plot holes, you may be on the spectrum. It's pretty straight forward and complete. We're actually looking into buying the game after this."
    },
    {
      "rating": "1/5",
      "review": "The movie was terrible. We didnt even stay to finish it."
    },
    {
      "rating": "0.5/5",
      "review": "Really really stupid"
    },
    {
      "rating": "3.5/5",
      "review": "A great film with great nods to video games. A great performance from Peter Stormare."
    },
    {
      "rating": "4/5",
      "review": "suspensfull..action..good directing."
    },
    {
      "rating": "2/5",
      "review": "Nah this isn’t the one. The acting alone was pretty lame, and it went for gore instead of horror. On the horror side it just went pretty silly. Based on a video game my expectations weren’t high anyway, but this was not the one."
    },
    {
      "rating": "3.5/5",
      "review": "Not bad! Well-shot, reasonably scary."
    },
    {
      "rating": "3/5",
      "review": "I thought it was a decent horror movie. The first hour was really good. It’s nothing like the game tho. I know some ppl don’t jump at jump scares but there was 2 of them that got me 😂 1 of them almost gave me a heart attack. Jump scares work really good when you’re watching the movie in theaters."
    },
    {
      "rating": "5/5",
      "review": "I was so nervous the whole time lol, it’s scary cause you never know what’s happening next"
    },
    {
      "rating": "5/5",
      "review": "Muy bien est esa pelcula pero no s ve tan divertido pero si se los recomiendo para que no se aburra uno"
    },
    {
      "rating": "2/5",
      "review": "De Until Dawn esta película realmente solo tiene el nombre, más que unos guiños al juego que ni siquiera llegan a ser tan relevantes. La idea del time loop era buenísima idea para llevar a cabo este juego, pero fue mal ejecutada y aunque la veas como un producto a parte y original, la historia es muy simple y a la vez te meten conceptos demasiado enredosos que ni siquiera terminan de explicar, en momentos se cae y tarda en levantarse, quisiera haber podido disfrutar más la película, pero en momentos se toma más en serio de lo que debería."
    },
    {
      "rating": "2.5/5",
      "review": "Plot was a little slow for me. I would still recommend."
    },
    {
      "rating": "2/5",
      "review": "Not that bad a movie. but it ends up tripping and falling in the end. Another movie where most of the plot is given away in the trailer.   Our young people find themselves in a house where various scary folks chase and kill them.  Upon their death, our gang finds themselves 'reset' to the start of the night. They go through around 3 nights of getting killed in creative ways before they decide to start investigating and trying to figure out what is going on.   This is where the movie starts to get a little interesting.   They investigate their surroundings, find some clues and start to discover the environment they are in and why some things are going on. Just when you think 'scoopy and the gang' will figure out what is going on, the plot just gives up.  they reset and can't seem to figure out which loop they are in, and we find out somehow we jumped from an interesting 4th loop to their 13th 'last loop', with some of the scary scenes on the trailers are just video clips they find on their phones (I guess their phones to not reset?) Worried they won't reset in this last loop, they finally make a bold move and try to do more to get out of their situation (avoiding spoilers).   When we find out the why, it's a big let-down, and doesn't explain any of the supernatural things going on (nor why they reset after death).   But they do leave off hinting at a sequel - which, given, this movie, probably won't be happening. Probably best left for Cable/Streaming."
    },
    {
      "rating": "2/5",
      "review": "Meh..I had to kill time, nothing special over here."
    },
    {
      "rating": "0.5/5",
      "review": "Why use an IP to leverage the existing audience, if you are going to butcher the original story? Call it something else and stop lying the people stupid enough buy tickets."
    },
    {
      "rating": "1.5/5",
      "review": "So, video game adaptations have actually been doing pretty damn well lately. The Super Mario Bros. Movie — fun! Fallout — awesome! The Last of Us — emotional gut punch! Gran Turismo — way better than it had any right to be! We were starting to think, 'Hey! Maybe the video game movie curse is dead!” But no. Until Dawn is here to slap us back to reality. Hard.. Now, I'll be fair for a second — adapting Until Dawn was always gonna be tricky. The game is basically a glorified 'choose-your-own-adventure' story. You have QuickTime events, you make choices, characters live or die... it's built on replayability. So trying to turn THAT into a 2-hour movie was always going to be like building a house out of Jenga blocks And I’ll give them this: they tried to get creative. They didn’t just do a straight retelling. They attempted something different. But here’s the thing — we don’t grade movies on effort. We’re not giving out participation trophies. Either it works, or it doesn't — and this one just... doesn't As an adaptation? Hardcore Until Dawn fans are gonna be pissed. It strays way too far from the game’s spirit. Characters get reworked, plotlines get Frankensteined together, and the big twist that made the game so memorable? Yeah, they botched that too But maybe you’re thinking, 'Okay, I never played the game. Maybe I'll just watch it as a regular horror movie!' Bad news, my friend. Even if you haven't played the game, Until Dawn feels like a cheap mashup of Edge of Tomorrow and Groundhog Day, but without any of the brains, heart, or creativity those movies had.. Die, reset, die, reset! Seen it. Done better. And the real kicker? As a horror movie — which is what it should nail — it’s even worse We are living through a second golden age of horror right now. Hereditary, Get Out, The Babadook, Talk to Me, The Invisible Man — horror movies are smart, stylish, and genuinely unsettling these days. Until Dawn feels like it crawled out of 2005 and not in a cool, nostalgic way. It’s not scary. It’s just a non-stop parade of cheap-ass jump scares. LAAAH — cat jumps out of closet! BLAAAH — mirror fake-out! BLAAAH — hand on shoulder that's just a friend Honestly, they could have just renamed this movie Jump Scare: The Movie and at least been honest about it. There’s no tension. No atmosphere. No lingering dread. Just loud noises and quick cuts. So in the end, Until Dawn is a mess. It fails as an adaptation. It fails as a movie. It fails as horror. It’s a triple threat… just for all the wrong reasons. Save yourself the time. Play the original game. Hell, watch someone else play the game on YouTube. You'll get a better story, better characters, and honestly, way better scares. This movie's a hard skip."
    },
    {
      "rating": "0.5/5",
      "review": "It didn’t keep my attention"
    },
    {
      "rating": "1.5/5",
      "review": "This movie took itself too seriously for how comedic it was. If you'd like the good version of this film watch 2011's The Cabin in the Woods"
    },
    {
      "rating": "4.5/5",
      "review": "Loved the storyline different from most modern movies"
    },
    {
      "rating": "4/5",
      "review": "It was a pretty good movie. Different from the preview because I thought they were going to be trying to get out of the same scenario all night but nope they switched it up. LOTS OF JUMP SCARES. Even when I was anticipating it, it got me again.. lol"
    },
    {
      "rating": "4.5/5",
      "review": "Really good i mean it wasn’t that bad pretty decent for what it was advertised"
    },
    {
      "rating": "3.5/5",
      "review": "characters are not annoying. theme is simple and a bit different from recent horror movies. does not deserve the dislike"
    },
    {
      "rating": "3.5/5",
      "review": "Not a masterpiece but fun. Had a couple of good jump scares which is always nice. Nothing I would watch over and over but worth it once."
    },
    {
      "rating": "3.5/5",
      "review": "I gave it a 4 star. The story line wasn't bad, but I wouldn't say it was really \"scary\". However I like how you kinda got all scary movies in one. Zombies, witches, werewolfs in a way, the creepy guy that won't die all in one movie. I would recommend to watch not because it makes me scared to walk to my car all by myself or go to the bathroom in the middle of the night by myself, but because it will definitely get you and your friends or significant other talking about it."
    },
    {
      "rating": "5/5",
      "review": "This was a great and scary watch. Twists and turns and gore galore. Just sit back and wait to be scared."
    },
    {
      "rating": "3/5",
      "review": "I liked how the movie brought in some elements from the Video Game"
    },
    {
      "rating": "2/5",
      "review": "I played the video game and it’s nothing like it. I wish producers, writers, and directors who make movie adaptations from video games, actually played the game!! Complete dissatisfaction. Sure some parts were suspenseful but it mostly didn’t make sense."
    },
    {
      "rating": "5/5",
      "review": "The movie was really good. A lot of jump scares."
    },
    {
      "rating": "4/5",
      "review": "Nothing to do with the game obviously but still was a good watch💯"
    },
    {
      "rating": "2.5/5",
      "review": "Ending felt abrupt and middle felt slow. Liked the references to the game."
    },
    {
      "rating": "5/5",
      "review": "Great horror movie! I was actually creeped out and some of the jump scares got me good. Definitely worth the watch and if you know the game, there’s Easter eggs and maybe a hint of a sequel?"
    },
    {
      "rating": "5/5",
      "review": "Definitely a great movie"
    },
    {
      "rating": "4.5/5",
      "review": "Very entertaining. It is also very scary, and will keep you on the edge of your seat."
    },
    {
      "rating": "4/5",
      "review": "I thought it was good. If you like some jump scares, some gore, interesting story line, and some evil people and creatures this movie is for you! At 1h 43 mins was perfect amount of time to move story at a decent pace."
    },
    {
      "rating": "4/5",
      "review": "if you want a good intensive scare I got one after view it"
    },
    {
      "rating": "3/5",
      "review": "Nothing revolutionary but it was pretty good for what it was. If you're looking for a flick to throw on, it has some decent kills and an interesting concept. The characters were a bit too generic, but most of the acting was ok."
    },
    {
      "rating": "5/5",
      "review": "Sabes que no se parece al juego, aunque si toma ciertas diferencias, sin embargo es una bomba de terror, tiene mucho suspenso excelentes actuaciones, efectos visuales espectaculares, necesitamos más películas asi, tiene gore, tiene monteros, asesinos. Entre otras cosas y un buen final"
    },
    {
      "rating": "5/5",
      "review": "This movie is good I don’t see how anyone could dislike it . It has jump scares funny parts and action that will keep u on your toes."
    },
    {
      "rating": "2.5/5",
      "review": "It's alright I suppose, the actings actually pretty good from most of them which isn't always the case in this sort of movie but I was a bit underwhelmed by the plot and I was bored half way through and was just waiting for it to end. Not terrible by any stretch of the imagination but not particularly good either."
    },
    {
      "rating": "2/5",
      "review": "Haven't seen it but by the trailer looks not promising."
    },
    {
      "rating": "2.5/5",
      "review": "This was honestly super disappointing. If you came to watch this movie because you’re a fan of the game don’t have high expectations probably the only thing close to the game is the title and they do not take anything from the source material. Although I do like the concept that they came up with instead. The premise of this film is that a group of friends go to this house but they get stuck in this time loop where they have to survive “Until Dawn”. But the catch is that there is a supernatural entity that hunts them down sometimes it will be a zombie and sometimes it will be a demon. I do like the first act of this movie but the second act seemed very rushed so after one of the characters die she wakes up and they tell her that she’s has been out for a multitude of days . To me this just seemed a little rushed they could have done a plethora of different ideas but they decided to rush it. Ultimately if your a fan of the game I do not recommend but if your a person who hasn’t played the game it will be more likely interesting as a concept although the second act felt really rushed in some scenes the first act I really enjoyed."
    },
    {
      "rating": "5/5",
      "review": "I went to go see the film with my sister 5 days ago, we were hoping if my cousin could come along with us, but she couldn't. My sister asked before watching the film and since I have played the original game three months ago, she asked what the game was about, the plot was about 8 friends returning to the lodge a year later after the disappearance of twin sisters. Then, a killer came with an revenge plot to attack the friends when he held them as responsibles and getting the twins killed. Because the game shared similarities through films, like Saw and I Know What You Did Last Summer. I went to see the movie and my sister called the film \"dull\", because the live action movie had similarities with Happy Death Day, because the film introduced five friends, completely different from the game. We had fun with the jumpscares, but I wasn't satisfied with the runtime, taking 3 friends away and not honoring what made the original game special. When we left the movie, we rated 8 out of 10 stars, some fans have a point. The film wasn't good, but it wasn't bad either. It was just regular. Let's be real, Melanie was similar than Beth or Hannah. Clover shared similarities than Josh. Nina was similar than Jessica. Abe was similar than Mike. Max was similar than Matt. Megan was similar than Emily. No Chris. Neither Ashley. Not Sam. Some behaved like the characters from the game, but in different choices, except when meeting their fates. We felt that the director, David F. Sandberg, should've done more than that. Better directing. Better screenwriters. And what they shouldn't do was to cut nights, because leaving with five nights will make the fans disappointed some ways, it's making reference than Five Nights at Freddy's movie. If they had done that, the fans would've been satisfied and happy with the results, versus the one we've seen. The one that surprised us in some ways it wasn't supposed to disappoint us. There were PlayStation games that turned into live action. Uncharted. Borderlands. The Last Of Us. Resident Evil. Until Dawn. Two and a half disappointed the lore fans."
    },
    {
      "rating": "4/5",
      "review": "It was truly a good movie, but there were some things that left me stumped. Overall 8/10 movie experience."
    },
    {
      "rating": "4/5",
      "review": "Thought it would have more to do with the game."
    },
    {
      "rating": "4.5/5",
      "review": "Definitely different for a slasher film. Constant action. An excellent group of young acting talent. Spared no expense on the sets. Scary, perplexing, and even a few chuckles."
    },
    {
      "rating": "5/5",
      "review": "Very good movie kept me hooked and in suspense loved the thrill don’t try to believe the low reviews it’s not that bad honestly to me"
    },
    {
      "rating": "3/5",
      "review": "It was alright the jump scares and special effects were the best part about it. The Writing was completely terrible didn’t care for the characters at all."
    },
    {
      "rating": "3/5",
      "review": "This film really ups those horror, gore thrills with each turn it makes but really lacks that full look into the concept it's trying to setup. There are moments where the scare potential is present but isn't elaborated any further and replaced with more screen time for characters making obviously poor decisions. It's a fun watch the first time round, unsure if I'll see this on streaming when released."
    },
    {
      "rating": "5/5",
      "review": "It was a very fun movie and straight to the point."
    },
    {
      "rating": "2.5/5",
      "review": "Despite decent direction from David F. Sandberg, some creative kills, and creepy atmosphere, the film version of Until Dawn is a pretty by the numbers horror movie and introduction to the PlayStation video game that inspired it!"
    },
    {
      "rating": "2.5/5",
      "review": "The movie was decent, nothing amazing but it was fun and had some really great effects! If youre a fan of the game this only loosely connected but it had some fun easter eggs."
    },
    {
      "rating": "5/5",
      "review": "While Until Dawn is not the original story, David F. Sandberg found a way to write a new story that literally was scary from beginning to end. 10/10"
    },
    {
      "rating": "2.5/5",
      "review": "'Until Dawn' is an adequate horror feature that doesn't fully realize the potential of its source material."
    },
    {
      "rating": "2/5",
      "review": "i am really disappointed because the film is almost nothing like the game it was meant to be based on. At least there were few references to the original game but they could have added more to entertain the fans. Whats the sense of naming the film after the game and then making the film nothing like the game?"
    },
    {
      "rating": "1/5",
      "review": "This was a \"B\" flick, in my opinion, weak narrative. It's not even scary !"
    },
    {
      "rating": "4/5",
      "review": "decent enough movie, ignore the man babies crying about its not just like the video game"
    },
    {
      "rating": "4/5",
      "review": "it was actually pretty good! even though it wasn't like the game"
    },
    {
      "rating": "2/5",
      "review": "“Guys I think we’re fucked” Best quote of the movie. It’s probably also what Sony said in the board room right before they were about to release this. This movies not great.. but it’s got some spookies! Have a beer or two and go enjoy some jump scares with your friends for this one."
    },
    {
      "rating": "0.5/5",
      "review": "Disappointed after watching it."
    },
    {
      "rating": "2/5",
      "review": "Not bad, but not a favorite"
    },
    {
      "rating": "5/5",
      "review": "Very enjoy the movie!! Love the end and a lot a good scare"
    },
    {
      "rating": "3/5",
      "review": "Haven’t finished playing the game, but this made me want to. Had me entertained and fully engaged throughout the movie"
    },
    {
      "rating": "3/5",
      "review": "Reminded me a lot of cabin in the woods"
    },
    {
      "rating": "4/5",
      "review": "The movie was very enjoyable and pays tribut to the game. It is of course not a live action version of the game but a standalone movie that contains elements like the vendigos. The movie was also build like one of \"supermassive games\" games and builds another story based on clues they find. The audio was great, the horror elements were outstanding and the repeated but different nights keep you on edge. But the dialog is straight up bad and not realistic at all and sometimes i sat there wondering why anyone would say that, so that takes away half a star"
    },
    {
      "rating": "5/5",
      "review": "The Young Group did an amazing job . Good jumpscares and the atmosphere was great . I had fun watching it with my bros"
    },
    {
      "rating": "5/5",
      "review": "It was really good movie"
    },
    {
      "rating": "5/5",
      "review": "ahh scary and now they have to do it again???"
    },
    {
      "rating": "5/5",
      "review": "Me gusto. No es lenta como las ultimas de su genero, ni te da sueño. En la sala de cine se sintió la tensión. Es una película que atrapa, pasas por muchas emociones pero aun asi mantiene el nerviosismo. Algunas partes son absurdas, otras asustan pero siempre mantenes la tensión. Aplicaron muchos elementos del terror sin que se vuelva pesada, dieron contexto al universo, no profundiza al personaje pero lo entendes sin empatizar, desenvolvió bien el aspecto psicológico. Deja buen gusto en la boca. Creo que supera el objetivo con creces, y es un buen giro para un genero de terror que no se veía hace mucho en cines."
    },
    {
      "rating": "1.5/5",
      "review": "Until Dawn was just okay. While the death-looping scenes and cross-game references were cool, they weren't enough to redeem the weak plot and underdeveloped characters. I found it hard to care about the main cast, and the ending felt typical and predictable. Honestly, you're better off experiencing the original game like with The Last of Us."
    },
    {
      "rating": "2.5/5",
      "review": "Until Dawn had its moments but not enough of them. It was a good concept and well executed. The actors did a pretty good job but the script didn't give them much to work with. There were several good executions, some of which were so sudden and spectacular that I found myself chuckling in appreciation of the over the top value of the effect and others in the audience were chuckling right along with me. But it was all in a good way. I frequently get a laugh out of some of the most allegedly frightening moments of a good horror flick. If you go see this one be realistic about what to expect and you will have a good time."
    },
    {
      "rating": "5/5",
      "review": "Not what i expected, but great movie. awesome kills, decent storyline. If you like slasher/gory horror films you would love this!"
    },
    {
      "rating": "5/5",
      "review": "Had My Attention The Whole Way Through. A Mix Of Escape Room And Horror Stories All Into One. Enjoy The Twists"
    },
    {
      "rating": "3/5",
      "review": "It was ok some parts was scary sometimes it felt a little funny it was gore galore very bloody that could be in a mortal kombat game I give the 3 stars it wasn’t terrible but it has its moments"
    },
    {
      "rating": "4/5",
      "review": "It's actually really good. My only mistake was going on $5 discount movie day, people are annoying."
    },
    {
      "rating": "4/5",
      "review": "Watch it for what it is a movie! Good graphics and death scenes. Doesn't follow game story line so don't expect that. Worth a watch."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie - it doesn't follow the plot of game it's named after, but it does make nods to the game's story and mechanics that I enjoyed as a fan of the original Until Dawn, The Dark Pictures Anthology, and The Quarry. Even if you're not a fan of the game, though, it's still a fun slasher-esque flick with great characters, well-executed practical effects, and David F. Sandburg's characteristic humor."
    },
    {
      "rating": "5/5",
      "review": "O filme traz uma experiência tão assustadora quanto bem humorada, o suspense também é incrivelmente bem colocado. Mortes cruéis e extremamente realistas, (até demais). Mas em si, foi um ótimo filme e vou assistir novamente com certeza!!"
    },
    {
      "rating": "5/5",
      "review": "Funny and entertaining"
    },
    {
      "rating": "4/5",
      "review": "there are some parts that could of been took out but overall the movie was good from beginning to end 8/10 fr me"
    },
    {
      "rating": "3/5",
      "review": "Decent little horror movie."
    },
    {
      "rating": "3/5",
      "review": "A Gruesome Groundhog Day with Teeth. David F. Sandberg's Until Dawn arrives with a wicked grin, initially luring you in with the familiar tropes of a secluded setting and a group of young adults stumbling into potential danger. The opening of the film gives off Cabin in the Woods vibe, introducing a cast of characters – Clover, her ex Max, friends Nina and Megan, and Nina's boyfriend Abe – as they embark on a search for Clover's missing sister, Melanie. The film pivots when the group finds themselves trapped in a time loop within a seemingly innocuous visitor center. This is where Until Dawn embraces its gaming inspiration, echoing the \"live-die-live again\" formula popularized by titles like Happy Death Day. The recurring nights, marked by a chilling hourglass, the mystery of the masked pickaxe assailant and the discovery of a hidden house deliver genuine scares and intrigue. However, as the nights bleed into one another, Until Dawn unfortunately begins to lose its way. While the time loop mechanic provides ample opportunities for creative and gruesome deaths, the film frustratingly neglects to fully explore the initial driving force: Melanie's disappearance. The urgency of finding her gets somewhat lost in the story telling. Until Dawn offers a thrilling, albeit slightly uneven, ride. It successfully captures the spirit of making crucial decisions with life-or-death consequences, reminiscent of its gaming namesake (which may be ahead of its time, or just fly over peoples heads). The film stumbles by sidelining its initial premise, the relentless cycle of terror and the inventive ways the characters meet their demise makes the film a fun popcorn flick to check out."
    },
    {
      "rating": "1/5",
      "review": "Annoying typical waste of money"
    },
    {
      "rating": "3.5/5",
      "review": "Until Dawn keeps up the trend of video game moves that are actually good, I look forward to what they do with Subnautica. Just remember every slasher flick you’ve ever seen, & you’ll have a fighting chance."
    },
    {
      "rating": "3.5/5",
      "review": "I've never played the video game, and wasn't expecting much from the movie. It was fast paced, with plenty of jump scares and gory effects. I enjoyed it much more than I thought I would."
    },
    {
      "rating": "3/5",
      "review": "It was more blood than anything but it was entertaining overall. I thought it was going to be scary but hadmore humor."
    },
    {
      "rating": "3.5/5",
      "review": "Very Groundhog Day or Happy Death Day. Mildly entertaining. However, not very scary."
    },
    {
      "rating": "3/5",
      "review": "Pretty decent effort. The premise was good, it was suspenseful,but I felt it ultimately didn't explain itself well enough at the end"
    },
    {
      "rating": "2.5/5",
      "review": "Another brainrot movie you somehow end up enjoying. Predictable and full of fan service, but the right amount of gore and geeky monster lore gives it a fun video game aura."
    },
    {
      "rating": "4/5",
      "review": "It was a lot of fun. I didn't see the trailer so didn't know what to expect. It has the spirit of the game. Also reminded me of a mix of movies like Silent Hill, Groundhog Day and those 2000s horror movies like House of Wax. Lots of good gore. I don't get the hate."
    },
    {
      "rating": "4.5/5",
      "review": "Exactly what I was expecting and wanting, pure entertainment"
    },
    {
      "rating": "4/5",
      "review": "One of the better horror movies Ive seen in a while. I also liked the ending."
    },
    {
      "rating": "0.5/5",
      "review": "Nothing but a spit in the face to the game."
    },
    {
      "rating": "2/5",
      "review": "Really dull movie with characters you don’t care about and a storyline that isn’t very good. The first half is good but really falls flat In the second half. Effects are very well done and it has enough story to warrant watching but I definitely wouldn’t recommend watching in theaters. Wait for streaming for this one"
    },
    {
      "rating": "4/5",
      "review": "I liked the movie it wasn’t bad but should’ve been more descriptive."
    },
    {
      "rating": "5/5",
      "review": "not like the game much but a good love letter to horror."
    },
    {
      "rating": "2.5/5",
      "review": "Until Dawn offers a promising start, delivering chaotic horror energy, creative deaths, and a genuinely entertaining first half that feels fresh and fun. Unfortunately, the movie loses momentum quickly. The second half relies heavily on exposition, skips over key story developments, and fumbles its emotional payoff. While the first act shows real potential, the rushed conclusion and clumsy lore connections ultimately leave the experience feeling incomplete. Fans of the game may find it frustrating, but casual viewers might still enjoy the initial thrills."
    },
    {
      "rating": "5/5",
      "review": "Thrill ride from start to finish. This films offers many jump scares and puts you in several horrifying situations. The cast is fun and the movie overall I would give a solid 5 out 5 for its original 90s horror vibes. Miss horror films like this. P.S. The ending is a crowd pleaser!"
    },
    {
      "rating": "4/5",
      "review": "Surprisingly very good adaption of the original video game. It’s give me chills…!"
    },
    {
      "rating": "1.5/5",
      "review": "Una adaptación sin sentido. Aburrida."
    },
    {
      "rating": "5/5",
      "review": "SO SCARY. very gory. classic horror movie"
    },
    {
      "rating": "0.5/5",
      "review": "The movie was not as scary as trailer made it out to be, and the theater screen turned off an hour into the movie like an Ad was about to pop up & it took them 15 mins to get it back working"
    },
    {
      "rating": "5/5",
      "review": "I know people are disappointed that it's not like the game, but I actually thought the acting and the wendigoes were top tier! The wendigoes moved and acted just like they do in the game!"
    },
    {
      "rating": "5/5",
      "review": "As an adaptation, the movie did a great job implementing the video game’s “butterfly effect” with an alternative “groundhog day effect.” The subtle homages and easter eggs towards the original franchise made me appreciate this film much more as well. The right amount of gore and intense jump scares made the plot much more exciting for me, I will definitely be watching again!"
    },
    {
      "rating": "3.5/5",
      "review": "Quería dejarme llevar por la critica, pensar que saldría decepcionado, pues no fue el caso, en estas situaciones es cuando uno se da cuenta que es mejor verlo por ti mismo y tener tu propia opinión. Faltaron mucho desarrollo a los personajes, eso es verdad, pero se deja disfrutar y de que manera la película, entras en su ambiente, donde posiblemente te lleves par de sustos. Así que justamente se lleva las 3 estrellas y media."
    },
    {
      "rating": "1/5",
      "review": "This movie was so bad!! I hate to give a bad review ."
    },
    {
      "rating": "4/5",
      "review": "Good movie with many unexpected and expected jumpscares...but good movie"
    },
    {
      "rating": "1/5",
      "review": "Horrible. Plot with ridiculous and it went nowhere. Was so glad when it ended."
    },
    {
      "rating": "3/5",
      "review": "Nothing like the game but I appreciate that they tried and plus it would be really hard to make it exactly like the game. I love the direction it when in with little Easter eggs! I really hope they make another movie set at the cabin in the snow!"
    },
    {
      "rating": "3.5/5",
      "review": "Criticizing a horror/gore/ 5 people trapped in \"whatever loop\" is almost redundant. As it is actually that...it is pretty well done...a number of jump out of your seat moments..a number of soo ridiculous moments you have to laugh...doesn't take itself too serious and nor should we..just have fun with some popcorn and Coke..lol!!"
    },
    {
      "rating": "5/5",
      "review": "Great film, great plot and overall entertaining to watch. Surprised the film has mid reviews. I’d watch it again."
    },
    {
      "rating": "3.5/5",
      "review": "Great way to show the movie"
    },
    {
      "rating": "2.5/5",
      "review": "It was good but seemed to be missing some plot but a fun horror flick"
    },
    {
      "rating": "1/5",
      "review": "Not only unfaithful to the source, but it butchers the source like one of it's characters. The creators could have made a rushed Cabin In The Woods style movie without dragging a beloved franchise into it."
    },
    {
      "rating": "1.5/5",
      "review": "Honestly just came out of the cinema and I felt dossappinted it felt like the lazy part of tje film was just random ideas and suddenly lacked cohesion , the characters were VERY forgettable and lacked the character dynamics from the game that makes us love or hate our characters the plot just seemed to try and mesh every horror genre together and it felt very rushed and its shown when they timeskip from life number 5 to 13"
    },
    {
      "rating": "2/5",
      "review": "Cheesy version of Cabin in the Woods"
    },
    {
      "rating": "3.5/5",
      "review": "Good movie. But it is just that. A good movie. It honestly did not pull much from the source material of the video game. It was 2 completely different stories. Cool cameos. But its not an adaptation in my opinion. So it should not have been marketed as so it was one."
    },
    {
      "rating": "3.5/5",
      "review": "better than I expected but forgettable"
    },
    {
      "rating": "3/5",
      "review": "The 2025 horror film \"Until Dawn\" hits theaters without any major star power, but it delivers a well-crafted cinematic experience inspired by a video game. Going into the movie, I was completely unfamiliar with the game's narrative, which left me focused solely on the film's storyline. There were moments where I felt like a deeper understanding of the video game would have enhanced my grasp of the movie, ultimately detracting from the viewing experience. It seemed like I needed to play the game to fully appreciate the film, which was a significant drawback. That said, the film wasn't all bad. It had its confusing moments, with a sense of disorientation until the plot began to come together. The pacing felt off, as it took far too long to reveal the necessary details for understanding the story. I found myself perplexed by the main character, the mysterious man in the house—his motivations and purpose for gathering the group were unclear, which left me feeling like I missed out due to my lack of familiarity with the game. In conclusion, I believe the filmmakers have their work cut out for them in building this world. While the film may not be a box office hit, I think it will find its audience on streaming platforms, helping to cultivate the video game franchise's transition to film. It was enjoyable overall, despite the confusion stemming from my unfamiliarity with the game's storyline."
    },
    {
      "rating": "5/5",
      "review": "Definitely enjoyed it! So if you're into jumping and some gore, this is definitely the movie for you!"
    },
    {
      "rating": "3/5",
      "review": "Until Dawn has managed to be entertaining, but after all is not a movie able to make any remarkable sequence or environment. It just hold it self with formulaic characters and some typical Jump scares. And the monsters which are really well designed and frightening were already in the game."
    },
    {
      "rating": "1/5",
      "review": "The worst adaptation I’ve ever seen. Hardly even it’s homage to the game."
    },
    {
      "rating": "4/5",
      "review": "I liked the special effects. The story though was old, I feel like Ive seen the same basic story in other movies."
    },
    {
      "rating": "3.5/5",
      "review": "actually one of the better movies in 2025.... basically a movie with a combination of jump scares and okay special effects...creating a good atmosphere for a popcorn movie. logic is absolutely out of the window... The villian(s) where in the beginning of the movie which seemed impossible to beat is easily beaten later without much effort / or simple never show up anymore... lots of action but mostly consists of running in dark... its not bad but its very average. between this and the recent movie Death of Unicorn I'd choose the later."
    },
    {
      "rating": "5/5",
      "review": "Good movie to watch with a group of friends"
    },
    {
      "rating": "3/5",
      "review": "Basically another PlayStation cinematic game transfer to a cinematic horror film similar to the Resident Evil movies but those were franchise movies with big name stars. Not a game changer but a good popcorn horror film to catch if you’re into it"
    },
    {
      "rating": "5/5",
      "review": "la mejor lo que va del año 2025"
    },
    {
      "rating": "2/5",
      "review": "I have no idea why they called this Until Dawn, seems like the producers found an old script to a horror movie, liked it, and then decided to use the Until Dawn name to get butts in the seats. Even if you remove this entity from the game and look at it as its own piece of art. It is a flawed movie with some pacing issues and uses tropes to give exposition that doesn't build to a good climax, the most interesting character Clover is supposed to have the most emotion and attachment to every character and you don't feel it at all. With a bad climax, resolution, and falling action. This is a film that impresses and is interesting for the first half and then becomes a half-baked Cabin in the Woods knock off."
    },
    {
      "rating": "5/5",
      "review": "It was a great movie!!"
    },
    {
      "rating": "0.5/5",
      "review": "Anyone who thinks this movie \"successfully translates game logic to the big screen\" has never played this game. Also they have never seen the multiple endings which this movie completely ignored. It doesn't even start at mountain resort, or really utilize any of the story. As someone who got a platinum from the game this movie is based off of. Just avoid it. It's trash."
    },
    {
      "rating": "5/5",
      "review": "As a fierce horror movies watcher and horror games player, I was deeply frightened at the thought of an Until Dawn adaptation. This was one of the most clever way to stay true to the game spirit without replaying the same exact narrative we already knew (and the same actors). I can see why some people will not enjoy it, but for me this is a win. (Although please, don't make a sequel unless you really know what to do with it)."
    },
    {
      "rating": "1.5/5",
      "review": "not scary at all. more laughable than anything and somewhat of a whack ending. mehh to me"
    },
    {
      "rating": "0.5/5",
      "review": "Silly movie no plot no story line"
    },
    {
      "rating": "2.5/5",
      "review": "good effects but storyine not clear and confusing"
    },
    {
      "rating": "4/5",
      "review": "A great film: they successfully captured the essence of the video game with an incredible atmosphere and effective scares. I really enjoyed how they brought the experience to the big screen."
    },
    {
      "rating": "2.5/5",
      "review": "Brad’s view ‘Until Dawn’ is a bit of a mess, relying heavily on overly cranked audio for its numerous jump scares to try and force the audience to be frightened. The most frightening thing about the film is the large number of changes that happened to the story from the original game, with the director throwing in ‘Groundhog Day’, ‘Cabin in the Woods’, and many other throwbacks to other horror games and genres. It loses a lot of the lore (it’s partially there, but really insignificant to the story) and the emotional impact of the game's story. While it does a good job with the deaths and practical effects, the best scares are found in very short snippets towards the end of the film in yet another method of horror storytelling. Josh’s view If you can disconnect from it not being a straight adaptation, you can get a solid fun horror experience out of it that still gives you a decent amount of the game, but still feels that what they might be setting up for a sequel would have been better served for this first film. ‘Until Dawn’ can only be a recommendation if you are into jump scares and gore, or you can fully disconnect yourself from the game. Past that, there may not be a lot worth talking about. Brad: 4.5 Josh: 6.5 Final: 5.5"
    },
    {
      "rating": "0.5/5",
      "review": "First of all, it was very dark. I saw it in the theatre, and it was hard to see as it took place at night but one would expect some clarity in distinguishing what was going on. Next it hit every horror movie trope - very predictable. Lastly the store was ridiculous and muddled. We still don't know what was chasing them and why. Please save your money and see something better."
    },
    {
      "rating": "5/5",
      "review": "I liked all the horror"
    },
    {
      "rating": "5/5",
      "review": "I have no complaints about this movie. From start to finish, there are no dull moments. This movie was released in 2025? No freaking way. It is based on a video game (Ive never played it but now I want to lol) and the plot is dark, interesting, consistent, and extremely creepy. As a horror fan I highly recommend this movie. Seriously if you are tired of these new horror movies that throw a few jump scares and have dumb horror cliches to exhaustingly try to keep you watching, watch. this. movie. It will restore your faith in horror."
    },
    {
      "rating": "5/5",
      "review": "Bloody and frightening dark movie. Always keeps you on the edge and waiting for the next death. Good sound and visual effects. Wendigos (cannibal monsters) looks real (that’s a plus)."
    },
    {
      "rating": "5/5",
      "review": "my honest thoughts on this movie were that the acting and the story of it was top tier even tho i heard a lot of people weren’t happy with the whole adaptation idea of it i really enjoyed it"
    },
    {
      "rating": "3.5/5",
      "review": "Great special effects and video game adaptation. Little predictable but had a good storyline"
    },
    {
      "rating": "4/5",
      "review": "I had a hell of a time with it!! 👿🥶⏳️ Until Dawn (2025) ⌛️🌚🌃 Until Dawn is such a well made, scary and unexpected horror movie! David F. Sandberg once again! You horror master! It comes at you out of a sudden! It comes at you hard! You aren't really expecting anything and it happens! Creative deaths at it's peak! Now this movie won't stick in your head as years go on primarily bcz it lacks depth overall. It also doesn't feel like a big enough world of whatever is going on. Unlike movies like Annabelle: Creation, Insidious, The Conjuring and more of such, it doesn't have an overall unlimited, infinite possibilities vibe to it like The Further or The Conjuring Universe. It feels pretty much done and dusted. It nowhere affects the quality of the movie but it's just one of the downsides I wanted to highlight. I thought the characters were good! Their acting was good too! The story, what more is needed?? It's a good enough storyline for what the movie intends to do. 💯 I had a Sunday midnight horror experience! Now.. The only truth that the critics spoke was that the second half was bad. In fact, that's a partial lie too! The 2nd half was good! Weaker than the first half but good! It's always the best to watch a movie for yourself! Most of the negatives or downsides pointed out by the critics, were just a hogwash. Overall a scary and creepy movie! Some claim, no one screamed or reacted during the movie. Well, you should come out of social media and know how a person reacts after being scared. If you are lucky, you'll find someone who let's out a sound. It's a quick reaction and if it's a minor or normal one, you cannot hear it due to the loudness of the speakers. The movie was really good! David F. Sandberg knows exactly when to shock and when to let it build to avoid being cliche. Needs talent and practice. Today, in the 2020s no one can do it except for some directors like James Wan and Mike Flanagan. Lastly! Everyone should just go out there and watch this horror epic in the cinemas where the horror is meant to be witnessed! A 7/10 for me! Horror at it's peak! 🤩🥶🥵👀🌃🖤"
    },
    {
      "rating": "5/5",
      "review": "Good movie if you think outside the box"
    },
    {
      "rating": "1.5/5",
      "review": "Until Dawn largely fails to cater to fans of the video game or capitalize on its alternate concept, as time for its redemption runs out soon enough."
    },
    {
      "rating": "3/5",
      "review": "Night of the living dead meets Groundhog day. Explanations of how such a situation could occur let alone repeat are beyond weak. But by the time we endure the death cycle of these 5 , you just want it to end. Major points for art direction, cast performances, and creatively shocking death and horror sequences. Again and again and again."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie, great graphics, keeps you on the edge of your seat every moment."
    },
    {
      "rating": "3.5/5",
      "review": "The film successfully translated the game’s logic to the big screen without being a mere copy. It delivers solid moments of tension. It doesn’t aim to be more than it is, but it avoids falling into the inevitable mediocrity of other adaptations that fail in their transition. It fulfills its purpose well"
    },
    {
      "rating": "3/5",
      "review": "This film is nothing like the original game. Think of this film version of a mix of cabin in the woods and happy death day. This version however has a group of very unlikeable characters that us as the audience don't really care for. I wish they had cast the same cast as the original game or at least even kept the same premise/plot. The only likeable aspect of this film is some of the kills are creative and very gory."
    },
    {
      "rating": "3.5/5",
      "review": "A movie that makes you really want to go and play the game, even if you've never played it before. A group of friends goes in search of the sister of one of them, who has been missing for a year. Following her footsteps, they all arrive at a cabin with the peculiar characteristic that you have to survive an entire night to be able to leave it. The problem is the number of monsters that prevent them from surviving. A movie that, while it doesn't scare you, definitely stresses you out, but above all, it creates curiosity about who or what is behind all this and how they are going to be able to get out, that is, if they manage to."
    },
    {
      "rating": "2.5/5",
      "review": "Idk just was looking for more in the end"
    },
    {
      "rating": "2/5",
      "review": "It was not bad neither was it great. One of those films where, unfortunately, the previews more or less contain most of the moments of the movie that are really worth anything. It was worth a single watch, but not much else."
    },
    {
      "rating": "3/5",
      "review": "Likes: Jump scares (funny). Blood n gore (funny). Dislikes: Story line (unoriginal.. 3 movie mashup!). Characters ( Typical teen scream reactions.. too much running and tripping over AIR!)."
    },
    {
      "rating": "5/5",
      "review": "great movie! loved the concept almost being like the until dawn game! scary and gore i liked it very much!!!"
    },
    {
      "rating": "5/5",
      "review": "This movie Is Good asf!!"
    },
    {
      "rating": "3.5/5",
      "review": "Interesting to watch. If you don’t compare directly to the game."
    },
    {
      "rating": "1/5",
      "review": "Not good dont make sense"
    },
    {
      "rating": "5/5",
      "review": "Great plot and action !!"
    },
    {
      "rating": "5/5",
      "review": "I have not played the game but the movie was dope!"
    },
    {
      "rating": "3/5",
      "review": "didnt like repetitive and predictable creatures"
    },
    {
      "rating": "5/5",
      "review": "this was a crazy movie and there'll be a sequel coming out eventually"
    },
    {
      "rating": "1.5/5",
      "review": "Where to start? Okay we won’t, because I already wasted two hours of my time watching this tedious film and don’t want to waste much more talking about it. Loud jump scare movies are not my favorite, and this one is about as generic as it comes. It is at times brutally violent (for my tastes). Again I just don’t see why this film needs to exist as it contributes nothing to the genre or medium beyond being a waste of shelf space. I could understand this being as practice for students to make a film like this, but with a $15 million budget you just want something with a little bit of a pulse, even if it is a horror film. The actors try and there are a few spooky environments, but it’s not enough to make me ever want to watch this film again. It’s not an unwatchable movie, it’s just there a lot of other awful horror movies that are more worth your time. Watch “Blink Twice” or “Cabin Fever” instead.i"
    },
    {
      "rating": "2.5/5",
      "review": "As a viewer of the film adaptation of Until Dawn, I offer my perspective on the experience, having not played the video game. Upon learning that David F. Sandberg was returning to the horror genre, I harbored some excitement. However, I must express my profound disappointment with the film. While the premise seems promising and fresh, the acting was not up to par and immature. The horror elements were not effectively conveyed through the screen. The actors demonstrated a lack of seriousness in their conversation, ignoring the impact of their previous experiences on their conscience. The movie was not suspenseful due to its visual presentation. By timing the scenes correctly and using slightly darker and more grainy lighting, the story could have the potential to be highly frightening. Although certain aspects of the movie were enjoyable, I did not emerge from the viewing experience with a fully satisfying impression. Fortunately, the film opted for practical effects over CGI, which resulted in some gratifyingly violent moments. However, the off-screen nature of some of the kills diminished the impact of these scenes. David possessed the necessary skills and experience to create a memorable horror film, but instead, he resorted to conventional tropes from numerous horror movies. The film lacked atmosphere, evoking neither sympathy for the characters nor a sense of dread during the viewing. While I do not harbor any animosity towards the film, I believe it was a squandered opportunity."
    },
    {
      "rating": "5/5",
      "review": "Lots of jump scares and gore and, finally, a unique concept"
    },
    {
      "rating": "5/5",
      "review": "Me gusto, te mantiene entretenido y el reloj girandose provoca un poco de ansiedad por lo que no sabes que vendrá en la siguiente muerte"
    },
    {
      "rating": "2.5/5",
      "review": "I was surprised to believe that this movie wasn't gonna be a masterpiece ever since I'd seen the trailer of this a few months ago. I'd only found it interesting. I was actually surprised that this film was gonna be split between both critics and audiences. Honestly, I think that's fair. I went in with as low as I kept my expectations, and I knew that this wasn't gonna be a great horror movie. Actually, this is more or less a bad film but I had fun with it. I had fun with how this film is structured while dealing with the problems that it has. First of all, getting the positives out of the way, I love the carnage candy in this. Pretty bloody, too. I love how you see different ways for these five kids getting kicked off every night from a masked killer, a wendigo, a witch, this kind of water that makes you explode, and even ghost possessions. I love the practical effects being used in this, even by the designs of the wendigo as a whole. I love the concept of dying and coming back to life as they start a new life in the night until you survive until dawn. Yeah, I know, bad pun. I'd even have to admit the exploration of the area they are in is interesting. I'd tell you that, but that would mean I would be spoiling. Unfortunately, that's all the positives that I'd have to share. I think the acting is okay from the main five teenagers and even Peter Stormare in this. They do show plenty of emotion. Especially fright when it comes to the dangers that head their way. However, the writing is poor for everyone. Everyone is one-dimentional. There isn't much character development for them. Even I didn't care much for them, especially the one couple, which I swear one of them was gonna throw the other to the wolves. The story itself is kind of a mess. Remember in one of my previous reviews that I don't mind much of a video game/book adapted into a movie not all 1:1 as long as it's written well? Not so much in this film. At the start, we get the sense of seeing the finding Ella Rubin's character's sister and they found themselves into this housing area where it's the beginning of their endless loop of dying and coming back to life to start over. The mystery section is interesting until the twist on why that was the case that kind of ruined it. I will say there is a scene that was kind of interesting as this one scene had me think that they'd rushed the nights until someone pulled out a phone to see what was recorded. I'm not gonna lie, I like that loophole of a twist within that scene. I give this film credit for being its own thing coming from David S. Sandberg. I'd played the game once, before you ask. Despite the negative, I still had a fun time with it. I'm not shocked that folks don't like this film. I might be surprised that some love this film. Even to say, this could be in others' category on their list of so bad, it's good or so bad, it's bad. To me, I kinda put this on my list of so bad, I had fun with it. I just don't see myself watching this again in the future unless I'm bored. I'm not saying you should go out and see this and maybe wait until it hits the streaming service or rent it. But if you want to check it out for the theater experience, go right ahead. I'm giving this film five Clover with a smile on her face and pitch-black eyes, possessed out of ten. 5/10."
    },
    {
      "rating": "5/5",
      "review": "awesome movie! very gory and a great story line. great for horror fans"
    },
    {
      "rating": "5/5",
      "review": "great movie brought in details from the game which was really nice but still had a movie feel."
    },
    {
      "rating": "3/5",
      "review": "It was ok, suspense kept it from being totally boring. Probably rates higher for those that like gore and blood. They had an opportunity to do something great with the ending but I was left wanting more. Too many things just didnt make sense."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie. Lots of consistent scares throughout."
    },
    {
      "rating": "5/5",
      "review": "lots of jump scares, entertaining"
    },
    {
      "rating": "5/5",
      "review": "Terrified the entire time"
    },
    {
      "rating": "4/5",
      "review": "A lot of fun if you can get over the title not being true to the source material."
    },
    {
      "rating": "5/5",
      "review": "The movie was very entertaining. Very good horror and suspense."
    },
    {
      "rating": "4.5/5",
      "review": "I really enjoyed this movie and it was scary"
    },
    {
      "rating": "2.5/5",
      "review": "Movie has some decent scares and effects. Overall it’s a streamer in my opinion. Not worth full price movie ticket. Unless you have an unlimited plan."
    },
    {
      "rating": "5/5",
      "review": "It was super scary!! My husband and I loved it!"
    },
    {
      "rating": "3.5/5",
      "review": "Ever heard of the pesky butterfly effect? Gamers who loved 2015’s “Until Dawn” will recall that split-second decisions could have huge, rippling consequences on who survives a terrifying night on Blackwood Mountain. This film adaptation, from the director of “Shazam!” compacts that already-cinematic experience into a spine-chilling and unpredictable movie, set in Glore Valley. The cool part is, even those who’ve played the game can’t say whether Cimino’s character Max lives or dies: they’ll have to buy a ticket and find out which way the deadly butterfly has gone. At the end of the day, the game is a 10-hour long movie, so the challenge was trying to condense that down into a two hour movie. Swedish Director David F. Sandberg (“Lights Out”, “Annabelle: Creation”) lives on the autism spectrum and is no stranger to horror movies so he stayed in his lane with “Until Dawn” a genuinely creepy, freak show and made the edit possible! Watch out for: Dr Hill who sums up the on screen action, “Trauma becomes terror and sparks ignite! and lookout for the Wendigos….a Native American legend of cannibalistic monsters. “Until Dawn” is set in a town that subsided during a mining disaster decades ago, the sets are impressive and intricate. I’m a sucker for this kind of folk lore connection in horror movies (“The Gorge”). Being an old coal and limestone mining town Ipswich, Queensland, Australia people can relate to both mining disasters and subsidence. The happy Hollywood ending didn’t sit well with myself or other people at my screening. It felt like the producers of “Until Dawn” just wanted to keep their test audiences pleased. Stay for the closing credits on the Missing Persons Wall for photos of all the cast and crew. The closing scene hints at a sequel at the same location, but in winter which is more in keeping with the original video game. Still “Until Dawn” is a solid horror flick and way better than “Sinners” in this department. “Until Dawn” takes place on the same night, but it will leave you with different nightmares! Have you got what it takes to survive “Until Dawn”?"
    },
    {
      "rating": "5/5",
      "review": "I love horror and they didn’t hold back. Brilliant 3rd act. 👌"
    },
    {
      "rating": "4/5",
      "review": "While not a direct adaption of the video game, the movie was still very good and treated the story aspect with respect. I hope there is a follow up movie with The Quarry!"
    },
    {
      "rating": "4/5",
      "review": "10 years since the successful popular video game made its debut on the PlayStation 4 Horror director David S. Sandberg brings the title to life with a new gimmick It’s a scary version of ‘Groundhog Day’ involving more blood A young woman Clover and her 4 friends go searching for her missing sister Melanie after a family tragedy A gas station attendant directs them to an empty lodge in the woods Unbeknownst to Clover and her friends the horror begins when each of them dies and miraculously come back to life when the night resets itself putting them through a new scenario each time, slowly they realize they’ll keep dying unless they can survive until sunrise But how can they break the chain when they face such terrors as a killer in a mask, an old woman subduing her victims with an oxygen tank, spontaneous combustion or creatures known as Wendigos? I’ll be honest saying I was a bit nervous walking into this one since the fanbase treasures the game so much Of course several changes are expected to happen when you do an adaptation It was a very effective horror movie I gotta say, an entertaining one I got a lot of jolts and enjoyed the gore next to the kills What worried most was the time travel element but they make it fun with the looping from one crazy life or death situation to the next There’s also a ton of exposition at the beginning but they get that out of the way fast Plus there’s a very funny scene in the middle I appreciated that breaks the tension I’m very glad they brought in Peter Stormare, he was a big part of the game and without spoiling too much he wasn’t just a minor cameo in this Sandberg and the filmmakers still stick in minor elements from the original source material like references as well as Easter eggs fans will be able to spot They also do some nice world building as well I only knew one actress Odessa A’zion out of these unknowns; hardly any of them are likable minus the lead herself who’s trying to let go getting past her trauma It’s also a nice touch they break down each scenario as a physical manifestation of a person’s insecurities in a way, fear becomes trauma, our true horrors become what keeps us down, sticking together is how we get through messed up things, what’s more terrifying is not knowing what to expect next, what’s worse is surviving but living without those closest to you This truly felt immersive like you were part of the experience these victims go through The game itself already has a cinematic feel to it like an extended cutscene you can play with your controller so it’s a good thing here they decided to do something different and not be a shot-for-shot recreation After all like a video game if you’re main character dies you have to option to restart and try again so it does have that trait about it Im glad this is a decent adaptation that acts as a love letter to the horror genre that embraces its own nature as far as frights as well as time travel itself"
    },
    {
      "rating": "0.5/5",
      "review": "If could rate this zero stars I would. It was too predictable and the ending was disappointing."
    },
    {
      "rating": "3.5/5",
      "review": "A lot of Jumpscares it was super entertaining if you love Gore and love drama this is definitely for you!!"
    },
    {
      "rating": "3/5",
      "review": "Basic horror movie. There was cool gore effects, but no other substance than that."
    },
    {
      "rating": "3/5",
      "review": "Decent movie that I somewhat enjoyed. Character development was sparse and plot was pretty much all over the place with very few answers/explanation as to what was going on. Fans of the game will be disappointed as there is very little carried over. Overall it was worth a watch, but not, in my opinion, worth going to a theater. Some good ideas, but not fully formed wonder how much was cut from the final product?"
    },
    {
      "rating": "1.5/5",
      "review": "Another dumb horror movie, with dumb younger people doing dumb things, but if the video game is as bunkers as this movie is, especially with all of the mindless outrageousness that goes on for all of it, then you cannot fault the movie for being a literal adaptation of the game, and in that case, then a faithful adaptation at that. If there was no video game involved, then the movie is pointless."
    },
    {
      "rating": "4/5",
      "review": "Good movie really liked it."
    },
    {
      "rating": "3/5",
      "review": "Worth seeing. Hilarious deaths."
    },
    {
      "rating": "2.5/5",
      "review": "Decent horror movie but had a very underwhelming 3rd act. Kind of movie U watch once but never need to watch again"
    },
    {
      "rating": "3/5",
      "review": "Not like the game, but a good movie."
    },
    {
      "rating": "3/5",
      "review": "After venturing into the universe of superheroes with the films Shazam! and Shazam! Fury of the Gods, director David F. Sandberg returns to horror in Until Dawn, a work sold as an adaptation of the popular game by Supermassive Games. With the promise of honoring the game's atmosphere and still flirting with the narrative structure of night survival, Sandberg delivers a film that has both hits and misses, in an unstable balance between creativity and narrative exhaustion. From the outset, Until Dawn seems comfortable abandoning the idea of a faithful adaptation. Although it uses the name of the game and makes some direct references to The Dark Pictures Anthology franchise, the film takes its own path, establishing an original story where each night the characters face a new deadly danger - from serial killers to supernatural curses and explosive infections. The concept, at first, is ingenious and provides a good deal of entertainment by exploring the different types of threats that lurk around dawn. Each new challenge comes with the promise of heightening tension and creativity, and it's undeniable that on the first few nights this strategy works, supported by good practical effects and a constant sense of urgency. However, the same creativity that drives the plot also becomes its main Achilles heel. As the movie progresses, the exhaustion of ideas becomes evident. What once seemed like a succession of innovative events gradually loses momentum, causing the script to resort to easy, generic solutions from the horror genre, until it leads to an inevitable change of tone for the action in the third act. This abrupt transition not only weakens the atmosphere of tension built up until then, but also highlights the script's difficulty in sustaining its own concept until the end. The climax, which should represent the culmination of the narrative, sounds rushed and anticlimactic, leaving the feeling that much has been promised and little actually delivered. The homages to the original game, such as the presence of familiar characters and some recreated moments, try to create a link of nostalgia with fans. However, these references are merely superficial, since the essence of the game - centered on choices and emotional consequences - is practically lost amid the rush of the script. If it weren't for the title and a few winks to the original material, Until Dawn would work perfectly well as an independent horror movie, which reinforces the impression that the use of the brand was more of a marketing strategy than a legitimate artistic concern. On the emotional front, the story of Clover and Melanie, separated sisters in whom Clover is on a quest, is dealt with in a shallow manner. Although the film tries to insert internal conflicts related to guilt, redemption and loss, these themes are poorly developed and easily overshadowed by the creative death scenes and the frenetic pace of the narrative. The protagonist is even constructed with some care, but the depth of her personal dilemmas never becomes a driving force in the plot. In the end, the viewer cares more about the anticipation of the next threats than the emotional fate of the characters. Even with its flaws, Until Dawn has undeniable qualities within what it sets out to do: Sandberg's direction, especially with regard to the use of practical effects and the handling of tension in the first few nights, reveals a solid mastery of the genre. The film unashamedly embraces the clichés of teen horror, knowing exactly what kind of experience it wants to provide. However, the lack of consistency in the script, the abandonment of emotional depth and the mischaracterization in relation to the original material are factors that compromise the work as an adaptation and as a complete narrative experience. All in all, Until Dawn is a horror that starts off with breath and thought-provoking ideas, but gives in to predictability and haste in the final stretch. It's a production that amuses and entertains, but is too far removed from what it promised to be, disappointing fans in particular who were hoping to relive the intense experience of the game. As an independent film, it entertains in its best moments; as an adaptation, it's a missed opportunity."
    },
    {
      "rating": "5/5",
      "review": "great movie, I loved the suspense of it"
    },
    {
      "rating": "4/5",
      "review": "It’s a good simplistic horror movie , as a non player i went to go see it and it was good and pretty funny , i hope they make 1 more"
    },
    {
      "rating": "3/5",
      "review": "It was ok, did not expand on the back story with the sister and how she ended up at Gloreville. Could have been better."
    },
    {
      "rating": "4/5",
      "review": "The story line is super well written and the scary characters are definitely scary! Will 100% recommend."
    },
    {
      "rating": "4.5/5",
      "review": "Fans of the games will notice all the hints and nods to the franchise. But I don't feel like the story was burden with it. I thought it was a fun little movie and we'll worth the price of admission. I'm really hoping for a sequel that includes the original game story."
    },
    {
      "rating": "4/5",
      "review": "Eu achei muito foda, direção boa, roteiro decente, ambientação e efeitos práticos excepcionais. Bons personagens, o vilão é ok mas o final foi muito \"feliz\" para os personagens. Bons jumpscares. Ninguem pediu o filme do jogo Until Dawn, provavelmente não vai faturar muito, mas pra uma adaptação de jogo é massa."
    },
    {
      "rating": "5/5",
      "review": "Love it and wished it had original actors from the game but loved how true they were to the original content it was one of my favorite games !!"
    },
    {
      "rating": "1.5/5",
      "review": "Not scary whatsoever and it was all over the place. Thumbs down!"
    },
    {
      "rating": "5/5",
      "review": "Loved it!!! Had so many fear elements in it. Really enjoyed it."
    },
    {
      "rating": "3.5/5",
      "review": "it was alright. not like the game great but it was alright for it's own thing."
    },
    {
      "rating": "2.5/5",
      "review": "The storyline was absolutely outstanding! But the actors were flat-out trash they could have done without every single one of those cast members. Then the wording for the language that they used, it was very poor. They would say very immature things like the director was a child. Not sure how but this film had all the makings of a great film and then fell short."
    },
    {
      "rating": "0.5/5",
      "review": "I’d rather be the one being killed over and over rather than having to watch this again. What did you do to my favorite game :("
    },
    {
      "rating": "5/5",
      "review": "Good movie! Keep you on your feet!"
    },
    {
      "rating": "4/5",
      "review": "Filme extremamente divertido, porém, zero drama e zero terror. Um belo Spin-off do jogo original, não uma adaptação. Poderia assistir esse filme em Loop. De novo e de novo..."
    },
    {
      "rating": "1/5",
      "review": "Bad movie experience"
    },
    {
      "rating": "5/5",
      "review": "Loved it! Just like the game"
    },
    {
      "rating": "4/5",
      "review": "Fun and gory. Great pace. Knows how to keep it fresh in a genre of repetition."
    },
    {
      "rating": "4/5",
      "review": "well done movie based on video game with lots of horror and gore. very worth seeing."
    },
    {
      "rating": "4/5",
      "review": "The movie was not bad, I liked it"
    },
    {
      "rating": "3.5/5",
      "review": "It a good watch. Its different. Personally I wished it was scarier. Acting could have been better. Although it doesn't follow the game it still pulls ideas from it. Personally I would watch it again. Deaths are creative. Most scary movies you know what's going to happen with this film I couldn't tell."
    },
    {
      "rating": "1/5",
      "review": "The movie was going ok until about halfway through. I had a hard time paying attention after that point."
    },
    {
      "rating": "3/5",
      "review": "Don't understand the negative reviews. Lots of jump scares and lots of WTF moments. Reminds of Phantasm with the tall man and his minions."
    },
    {
      "rating": "5/5",
      "review": "Different concept is interesting, this movie definitely has the scare factor."
    },
    {
      "rating": "1.5/5",
      "review": "Not the best story. Kinda boring."
    },
    {
      "rating": "4/5",
      "review": "I never played the video game, but can say as a horror movie entry, this one was right out of the playback of good horror movies from the 2000s. It is fun, scary, gory, and just an all around winner. This is right up there with House of Wax, Wrong Turn, Friday the 13th (reboot), etc. If you're a horror fan, don't sleep on this one. 2025 is shaping up to be another great year for horror movies. 7.7/10"
    },
    {
      "rating": "5/5",
      "review": "O filme consegue manter a essência do jogo de 2015 e além de juntar peças, e fazer com que isso possa ter uma sequência explicando os devidos acontecimentos, além de que tudo do filme pode ser uma grande revelação do jogo que ninguém esperava mudando todo o rumo, o diretor foi muito criativo com isso. Sem contar que o elenco é incrível, você se importa com os personagens e torce por eles, cenas de susto são bem feitas sem se exageradas, várias cenas tensas. As criaturas por serem muitas ficaram um pouco de lado, mas a primeira aparição de cada uma delas é sensacional. Posso dizer que é um dos melhores filmes de 2025, que venha until dawn 2 jogo e filme. Quem só viu o filme tem que ver o jogo para ter outra experiência, é simplesmente outro filme."
    },
    {
      "rating": "3.5/5",
      "review": "Tldr at the end. While the movie strays from the game quite a bit, my skepticism entering the theater was soon replaced with tangible amusement as the movie manager to completely capture the feeling of playing a decision- based horror game. You can see where a player would make a choice via pacing and dialogue beats, you can tell where choices would reward a player with an \"this action will have consequences\" and you can tell when the wrong decision was made. The movie also captures the player experience of trying to get the ending where everyone lives, and constantly having to retry. This, in addition to Easter eggs, teasers and references to the story of the game left me with an overall positive feeling at the end of the film. Criticisms of the film involve pacing issues, one- dimensional and script-bound character writing and acting (Dr.Hill excluded), and the use of elements from the game too directly but incorrectly. **SPOILERS here** The use of Dr.Hill was fun, but fails to connect that he wasn't a person during his characterization throughout the game, he was a subconscious psychological construct in Josh's mind, based on a normal shrink named Dr.Hill. Additionally, changing the origin of the game's primary monster antagonist so drastically and away from it's origins was an interesting but unsuccessful way to shoehorn them in. Tldr; The movie was fun overall and pays homage to an entire genre of gaming in a way no other movie has, despite pacing issues and a lack of regards for the source material."
    },
    {
      "rating": "1.5/5",
      "review": "I knew the movie would be nothing like the game so I tried to go in with an open mind and thought maybe it could still potentially be a good movie. It was not. It lacks character development, was not scary at all, and yet again the most significant moments were shown in the trailer. There were a few scenes that paid homage to the game which I did enjoy but overall this movie is not something I would watch again or recommend."
    },
    {
      "rating": "5/5",
      "review": "It's got a lot of jump scares, that caught my boyfriend & I off guard , the movie it's self isn't necessarily scary for those who watch true horror , more of a psychological thriller. good movie all n all , I personally recommend it."
    },
    {
      "rating": "5/5",
      "review": "As someone who has known about the game, but never played it, I thought this was a really well done horror movie. Its campy and a little silly, but none of the jumpscares felt cheap, and the suspense was built just right. My boyfriend is very familiar with the game, and was pleased with it for all the same reasons, as well as a number of Easter eggs and callbacks they made to events and features in the game (as well as other games from the same studio). One of the better films Ive seen in a while."
    },
    {
      "rating": "5/5",
      "review": "No clue why everyone is dissing on this film so much. I've played the video game numerous times and was looking forward to this movie. I kept an open mind and it made sense with the video game if you have followed the story or played the game more than once. The jump scares were placed in good locations just like the game. And the actors did a great job with their roles. It was a mix of the Until Dawn game with a dash of Groundhog Day, and Silent Hill charm. I personally loved it and look forward to watching it again!"
    },
    {
      "rating": "5/5",
      "review": "Movie was great! A lot of jump scares and good plot."
    },
    {
      "rating": "0.5/5",
      "review": "As I’m watching it from the beginning it seems a LITTLE interesting, but over all the movie isn’t that eye catching the mimics the game in some ways but it tells its own story overall. Not my cup of tea just buy the game if you haven’t."
    },
    {
      "rating": "5/5",
      "review": "Instantly one of my favorite horror movies. It translated the game's choose your adventure mechanic perfectly. I loved that they didn't explain the world and left us to figure out and other little things (that may have been by accident), that shows respect for the audience inteligence. Like when Megan is missing they didn't instantly thought that she had survived and left them there, the first thing they thought was that she had been captured, they knew her heart. The theme of loyalty over fear perfectly displayed in an extreme and unreal circumstance without being cheesy was beautiful. Life can be scary but scarier is living it without friends, your chosen family."
    },
    {
      "rating": "3/5",
      "review": "Nothing too wrong with it really, it's not great but it's not bad. It is not trash, it has as much merit as any other film. I loved the game, and appreciate how this is another chapter in the game. Really, this could have been worse. I was genuinely scared a few times, and the lead acting and creature special effects were good. There's a lot of intentional humor, and I found the end kind of refreshing. Wonky pacing and extremely bad makeup were the only things that really distracted me."
    },
    {
      "rating": "1.5/5",
      "review": "Once again another video game adaptation bites the dust. Not only is it not like the game but it strays far from that and only leaving the Wendigos, but even the rules for that was changed. Even with what I said they still try to connect it to the game but there’s no need because they’ve now destroyed established lore. Having Dr. Hill come in for a tie in the game won’t change minds, but instead rolls eyes. Characters are extremely one dimensional and there is no worry for these characters as you know they’ll just come back. The only thing I’ll give it is the practical effects, gore, and bloody kills. Even that’s not saying much as I always say those stuff are the icing on the cakes or the cherries on top. The main course should be the story and characters. Overall if it ain’t broke don’t fix it, and just like Godzilla 1998, this movie was Until Dawn in name only."
    },
    {
      "rating": "5/5",
      "review": "We loved it, I took my niece to see this and wow it was good! One of if not the best horror films we have gone to yet in 2025. We actually played the game through and beat it a little over a week before going to the movie and the connections were a great way to tie the two together."
    },
    {
      "rating": "5/5",
      "review": "As a Until Dawn fan, absolutely loved it. I'm glad they didn't just copy 1 for 1 of the game then it'll be boring since I'll know what to expect and most likely butcher all the original story and characters. Silent Hill movie did this as well, it wasn't an exact replica of the story and it turned out pretty good. Until Dawn movie was fresh not knowing what was going to happen next. Other fans gonna complain it should of been a full copy. If that's what they wanted then they can watch full game cutscenes on YT. It's an entertaining movie but don't expect it to be an exact replica which was the very reason I went to watch it day 1."
    },
    {
      "rating": "3/5",
      "review": "The killings were amazing, but the movie was predictable. Definitely could have waited til Netflix released it."
    },
    {
      "rating": "3/5",
      "review": "The movie had references to the PS4 game but other than that everything was different the gore and jump scares weren't bad though. If you are going to go watch the movie don't go in expecting it be exactly like the game cause it won't be."
    },
    {
      "rating": "3.5/5",
      "review": "Such a cool concept but would’ve been cooler as a tv show. It felt rushed in the last 10-15 minutes of the movie. I would love to see them dive deeper into everything. Seemed like they hinted at a #2 at the end. I would watch that! There were a few scenes that reminded me of The Descent. I will definitely try to get my friends to watch this one 🙌🏻"
    },
    {
      "rating": "2.5/5",
      "review": "It was ehh , 2 parts made me jump - not because it was scary but because it was unexpected."
    },
    {
      "rating": "1.5/5",
      "review": "Complete trash. Not only is it not like the PS4 video game but the movie by itself was utter garbage. I almost walked out 30mins into it and again almost 20mins later. Do not see this movie."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Watched it with friends in theaters dubbed and me and my friends enjoyed it. TW: Occasional screamers."
    },
    {
      "rating": "3/5",
      "review": "I’m a gamer and have yet to play this game despite owning it. The plot of the film is basically a horror version of ground hog day and edge of tomorrow. Sorry if I killed it for you. It was entertaining but nothing special. So far the best horror/ scary video game made into a movie in my opinion is still the first Silent Hill movie. Def not its sequel. I’ll be playing the game soon and expecting it to be better than the movie. Side note, it seems Hollywood still shows a pattern of struggling to adapt video game IP’s."
    },
    {
      "rating": "5/5",
      "review": "A treat for any horror fan. Thrilling from start to finish!"
    },
    {
      "rating": "3/5",
      "review": "terrible acting, the scare pop ups were the only good thing about the movie"
    },
    {
      "rating": "1/5",
      "review": "This movie was terrible. Save your money and wait until it hits streaming if you want to watch it. If you want a superior experience, play the actual game."
    },
    {
      "rating": "5/5",
      "review": "A lot of jump scares"
    },
    {
      "rating": "4.5/5",
      "review": "Until Dawn is a classic example why you should never listen to critics reviews for horror movies. The movie was a love letter to fans of the game as much as the original game was a love letter to horror fans. The movie was made for the fans, not the critics. I caught so many Easter eggs that tie it to the original game, both blatant and subtle. It was everything I wanted it to be knowing it wasn't a movie adaptation of the game. I'll probably go see it again. **update** I did. Even better the second time"
    },
    {
      "rating": "5/5",
      "review": "Wish they could implement little people in these type of films lol. Really enjoyed this film not quite like the game but still very enjoyable"
    },
    {
      "rating": "4/5",
      "review": "Great concept. However, as a fan of the game can’t say the movie topped the game."
    },
    {
      "rating": "1/5",
      "review": "The movie was not scary. It was more of a thriller. Some people on here are saying it was the most scariest movie they have watched 👀 to me and my boyfriend everything was more funny than scary. Don't recommend the movie to people who really want to get scared. But 100% recommend the game!"
    },
    {
      "rating": "3/5",
      "review": "\"Highly recommended if you want to have a good time, I recommend ignoring those opinions from so-called 'critics'.\""
    },
    {
      "rating": "5/5",
      "review": "it was a very good movie"
    },
    {
      "rating": "2.5/5",
      "review": "The pacing was weird. It didn't really have much of a soundtrack. The characters were boring and lacked depth."
    },
    {
      "rating": "3.5/5",
      "review": "It was a good movie but it wasn’t as Iconic as the games. Still worth the watch! Had a few jumpscares & cool kills. Wish it had more gore!"
    },
    {
      "rating": "5/5",
      "review": "The movie is great! Me myself have not played the game so i cant compare them but as a horror film forgetting that idea its great the characters feel real there are 1-2 things that could’ve been explored more and 1-2 things that didnt add up or clunky bur overall the movie was great,the ending couldve been way better i will say its a little clunky but apart from that a must see"
    },
    {
      "rating": "0.5/5",
      "review": "Had nothing to do with the game it's supposedly adapting. If you wanna make your own project, then make your own project, don't hijack an existing franchise to do it."
    },
    {
      "rating": "2.5/5",
      "review": "Until Dawn is a competently made film with solid performances and some scary sequences littered throughout. Unfortunately for the gamers who played the game and virgins to it alike; the movie doesn't add anything surprising or new that will keep viewers invested for a sequel. The finale collapses out and doesn't give a rewarding end to what already seemed like a slog of a movie to get through."
    },
    {
      "rating": "5/5",
      "review": "This is the first time I’ve gone to see a movie at the cinema in a couple of years now, totally worth it. I really enjoyed this flick. If you’re a horror movie fan and can’t have fun watching this movie then I don’t know what you tell ya."
    },
    {
      "rating": "5/5",
      "review": "Really really good movie. Not as scary as I thought but once I saw that SONY made this movie I knew it was going to be a good one. Definitely recommend!"
    },
    {
      "rating": "3.5/5",
      "review": "It was good, in the fact that they were creative with it. Only problem I had was that there was a few plot holes in it, that didnt really make sense. And would have liked to seen connected. But other than that, it was pretty good! Worth the worth the watch if you want to see something with a twist."
    },
    {
      "rating": "4/5",
      "review": "very unique horror movie"
    },
    {
      "rating": "4/5",
      "review": "It was very entertaining. I loved the monsters! They were great."
    },
    {
      "rating": "4/5",
      "review": "Movie is much better than I expected. Strays a bit from the source but highly recommend. Actors are decently good too!"
    },
    {
      "rating": "4.5/5",
      "review": "Gotta love the jump scares and the comedic moments thrown in there as well my 12 yr old daughter and I enjoyed it!"
    },
    {
      "rating": "1/5",
      "review": "Had absolutely nothing to do with the video game. They made a couple references but that’s about it. It’s just a horror movie version of 50 First Dates….or Groundhog Day"
    },
    {
      "rating": "5/5",
      "review": "Loved this movie! Extremely interesting concept and quite scary. I will definitely be watching it again when it comes out. I'm very excited for a sequel film. It is a bit generic in the monster aspect but it works well for the film. I'd love to see more movies where they switch up the creatures more and maybe have a better way of beating them besides just running. But overall, very entertaining movie."
    },
    {
      "rating": "5/5",
      "review": "It was a fantastic movie and I can’t wait until it comes out of cable or streaming to watch it again."
    },
    {
      "rating": "5/5",
      "review": "Definitely scared me"
    },
    {
      "rating": "4/5",
      "review": "Not bad me and my girlfriend enjoyed the movie. nothing like the game didnt surprise me what did surprise me was it was actually enjoyable. My girlfriend think that the movie could take place before the game after watching the movie ending"
    },
    {
      "rating": "3/5",
      "review": "Interesting idea for a horror flick (Groundhog Day version of a scary movie), but lack of character development and the movie's ending landed kinda flat."
    },
    {
      "rating": "5/5",
      "review": "People will always hate. The movie was really good I enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "Its a different story then the game but it stands on buisness. Brutal deaths and enthraling story! Must see"
    },
    {
      "rating": "5/5",
      "review": "This movie gives you chills from beginning to the end."
    },
    {
      "rating": "4/5",
      "review": "It's not exactly the game and that's good because the game already exist. In fact it's a translation of it. In the end is a good film, a good adaptation and you would enjoy it."
    },
    {
      "rating": "5/5",
      "review": "It was better than the video game"
    },
    {
      "rating": "1/5",
      "review": "Had plenty of random slash, blood and gore, but heres what it lacked, a script with a believable plot and the ability to put any kind of \"jump scare\" into the watch.. I mean in some parts was a downright snoozefest.. I mean people in the theater were actually sleeping in between the actual jump scare scenes....I guess as a game this was a hit?..Should have redone the script and thrown in some random nudity and that might have helped elevate to a 3 star.. I dunno.. I dunno. But as a movie.. , It will go straight to netflix in 45 days.. save your money and watch it online.."
    },
    {
      "rating": "4/5",
      "review": "As a fan of the game, I would have enjoyed this more if they had either committed completely to an original story and nixxed the Until Dawn title, or just stuck with the story from the actual game. There was too odd a blend of the two. Otherwise, interesting story and fun movie."
    },
    {
      "rating": "2.5/5",
      "review": "Couldve done way better"
    },
    {
      "rating": "3.5/5",
      "review": "Crimson and Clover, over and over."
    },
    {
      "rating": "3.5/5",
      "review": "Had a great time. Not scary but I thought it was fun."
    },
    {
      "rating": "5/5",
      "review": "I totally enjoyed watching this movie"
    },
    {
      "rating": "2/5",
      "review": "To gory and the story line was slow."
    },
    {
      "rating": "5/5",
      "review": "Loved this movie!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "I liked the movie , it wasn't much like the game but it was still quite good , gory for a 15 aswell , just wish there was a bit more wendigo and more to the story of the game but its still worth a watch"
    }
  ]
}