{
  "movie_name": "Pride & Prejudice",
  "reviews": [
    {
      "rating": "5/5",
      "review": "one of my favourites of all time!"
    },
    {
      "rating": "5/5",
      "review": "Seen this in a movie theater elevates it to another level. The top of the top in the romance/drama/comedy genre, and one of the best movies of all times. And that's all I have to say about that."
    },
    {
      "rating": "4.5/5",
      "review": "I thought this was great! Wonderfully atmospheric and the chemistry between the main actors was a joy to behold. I think I should read the book..."
    },
    {
      "rating": "5/5",
      "review": "I would have to say, personally, this is the greatest movie I have ever watched. The story was so compelling, the characters like no other. It may have seemed idiotic for her to fall in love with Mr. Darcy in the end, but that is what made it the truest form of love possible. You can't love everything that someone does, after all. But what you can love, that part can overcome all, showing who they truly are. It shows just how much they love, and just how much you love them in spite of everything. Love is in spite of all things. That's what makes it so powerful."
    },
    {
      "rating": "4/5",
      "review": "Its the most cliché movie i never seen in my life, but i love cliché."
    },
    {
      "rating": "4/5",
      "review": "Really good movie, wonderful story! And the actors did a lovely job!"
    },
    {
      "rating": "4.5/5",
      "review": "Brilliantly directed with truly stunning cinematography . Watch it on the biggest screen possible ."
    },
    {
      "rating": "4.5/5",
      "review": "Sooo good... a peruod piece that could have been shot in 2025!! Younger versions (by 20 yrs) of many actors in wondeful parts not to mention a beautiful Kiera Kightley and the great now gone Donald Sutherland!!"
    },
    {
      "rating": "5/5",
      "review": "New life exists in the pages of Jane Austen's book as her words are brought to new life. Leaping from the pages into this amazing adaptation of her stories. The acting and directing are superb and leave you aching for more."
    },
    {
      "rating": "4/5",
      "review": "Beautiful and exquisite in every level, fantastic cast, Rich retelling of the classic book, beautifully p presented in a 20th anniversary edition."
    },
    {
      "rating": "5/5",
      "review": "Definitely one of the best castings for a movie. I absolutely love all of these women.."
    },
    {
      "rating": "4.5/5",
      "review": "This is a spectacular film in every way"
    },
    {
      "rating": "3/5",
      "review": "Very slow and typical rom com fare though some amazing cinematography"
    },
    {
      "rating": "1.5/5",
      "review": "I wanted to like this movie, really I did. The language I thought was appalling, and Georgiana’s quip that her brother must “force Elizabeth” to play duets was frankly eye rolling. Mrs Bennett was not obnoxious enough, we, the audience, were supposed to be as embarrassed as Elizabeth and there was nothing to be embarrassed about. This Mr and Mrs Bennett are also supposed to be barely able to stand each other & these two were clearly devoted to each other. I know the book isn’t necessarily for everyone but was it too much to ask that the director read the book?"
    },
    {
      "rating": "4/5",
      "review": "A beautiful movie with beautiful costumes, set design, music, cinematography, and character portrayal. Pride & Prejudice (2005) is so utterly charming that you spend a great deal of the movie dreading that something bad might happen to the characters it so thoroughly convinces you to love and root for. It is a comfort movie that makes one feel warm, hopeful, nostalgic, and happy, and it is an utter escape from everything else going on in the world."
    },
    {
      "rating": "4.5/5",
      "review": "Soundtrack, Cinematography, Acting... all awesome. A movie that I rewatch at least once a year."
    },
    {
      "rating": "2.5/5",
      "review": "Matthew Macfadyen is the only reason I kept watching. He is such a powerful presence in the movie! Well, of course, Judi Dench and Donald Sutherland are amazing. Everyone else and everything else was so disappointing - all the characters looked like they had not washed their hair in ages, so sloppy, the whole background was pitiful. The insistence on scenes with pigs running around, cows being fed. They looked like a modern family where kids answer back and go crazy. I did not like this version. Did not like Jane AT ALL! Did not like Keira K., sorry, none of them."
    },
    {
      "rating": "5/5",
      "review": "I love every single minute of this movie ❤️"
    },
    {
      "rating": "5/5",
      "review": "This movie was my gateway into Jane Austen films and literature and set the bar high. It is the most interesting cinematography-wise and emotionally in performance than any other adaptations of her work. Worth rewatching for the small details throughout."
    },
    {
      "rating": "5/5",
      "review": "The chemistry between Keira Knightley and Matthew Macfayden make this the most romantic version of Austin's tale. I streamed this tonight, twenty years after I'd seen it in a theater, and it seemed even more powerful than I remembered."
    },
    {
      "rating": "5/5",
      "review": "This is my very first RT review ever but I just had to because it’s my favorite movie of all time…I LOVE this! I saw it a couple years ago and watch it all the time, it just never gets old. The chemistry between them is sensational…the tension is intoxicating, their quarrels are heated, and their connection is authentic and original. I enjoyed that they introduced the characters to each other early on in the movie, as many movies don’t. It’s almost like a complex “Enemies to lovers” story. I love all of the other characters/actors as well. On top of that, the cinematography is beautiful. The character development throughout the movie is captivating - you see Mr. Darcy (“a proud, unpleasant sort of fellow”), come out of his shell and begins to show his softer side while Elizabeth (a witty, vivacious yet stubborn sort of woman), starts to develop a more pleasant disposition by being less overly critical and more open-minded (unprejudiced, if you will). Another thing I loved is despite how much happened between them, they didn’t share to any of their friends or family…almost as if it was a forbidden love. My only complaint is that I wished we had a little more backstory on Mr. Darcy! I understand you can only put so much in one film, but for what they DID do, they excelled. ❤️"
    },
    {
      "rating": "5/5",
      "review": "My favorite movie !!"
    },
    {
      "rating": "2.5/5",
      "review": "It hardly blended Jane Austin’s work at all. I appreciate the cinematography and acting, but is greatly lacking in the adaptation of the story, detail and heart behind pride and prejudice. This movie has all the characteristics of stolen valor. Wearing the coat of Austin’s work, with none of the background or content."
    },
    {
      "rating": "1/5",
      "review": "I wanted to love this film. But, I couldn't get past that almost every single character was changed and sometimes the changes didn't make sense. Keira Knightly is not someone who comes off as a quick witted, sparkly eyed person with an intelligent face, she should have never taken the role. It became an entirely different story than the one written by Austen. The character of Mrs. Bennet who is meant to be very ridiculous is not portrayed that way. Mr. Darcy who is strong and silent...well, he is silent but I actually didn't even like Mr. Darcy in this. Of course he's one of the great romantic literary heroes. And he just left me shaking my head. In every Jane Austen adaptation I have generally been able to find something to like, but....I can't."
    },
    {
      "rating": "5/5",
      "review": "I've seen every version of Pride & Prejudice and didn't think anything could be better than the BBC's 1995 Jennifer Ehle/Colin Firth 6-hour version. Welp, this tops that. Absolutely gorgeous, beautifully acted, and even though it was only a couple hours long, it didn't feel like anything vital was skipped. Just a complete stunner!"
    },
    {
      "rating": "5/5",
      "review": "TE AMOOO SEÑORITO DARCY... si no fuera por la poca salubridad y los inexistentes avances médicos del siglo XXI y obvio el WiFi, amaría vivir en esa época, lector dime si esta epoca no te parece tan, in-reptiliana... GRACIAS ELON"
    },
    {
      "rating": "5/5",
      "review": "Pride & Prejudice with Kiera Knightly and Matthew McFadden is my sister and I favorite movie of all time. So beautifully written and the music is wonderful. It is our “go to” movie when nothing else is worth watching. The director and producers did such a fantastic job in creating this magnificent masterpiece. I have seen it probably 30 times and look forward to watching it again. Such beautiful chemistry within the actors and actresses. I look forward to seeing another Joe Wright period drama soon. Number one movie out of thousands."
    },
    {
      "rating": "5/5",
      "review": "This film is superbly videographed. The videography is perfect and breathtaking. The script is absolutely spot on. The set design and costuming is incredible. The plot moves along at just the right pace. This is a perfect film. But, the best thing about Wright's version of this classic literature to film... the cast! Nailed it! Every single cast member is spot on. The acting is just right with every, single character portrayal. Knightly and MacFadyen portray so much chemistry and you can feel the emotion emanating through the screen, as with Pike who is a beautiful actor. It's a treat to see Sutherland and Dame Dench, but I have to give the biggest shout outs to Blethyn who plays Mrs Bennet impeccably (she's hilarious!), and Reilly (always gets it right), and MacFadyen... what a perfect cast he was for our favourite Mr. Darcy. Can't recommend this film enough!"
    },
    {
      "rating": "5/5",
      "review": "Amazing film watched many times"
    },
    {
      "rating": "5/5",
      "review": "Absolutamente apaixonante! Um enredo de amor que só Jane Austen poderia com sua genialidade entregar aos seus leitores. Mas a direção de Joe Wright revelou para o cinema a perfeição dessa história. A experiência vale a pena, pois emociona e encanta, instiga e cativa o público de forma excepcional. Status de clássico cult merecido."
    },
    {
      "rating": "5/5",
      "review": "The one, the only. May I add: the camerawork, the pacing, the conflict, the dialogue, the acting, the family dynamics, the music, the dancing, the pure joy and bliss of Keira Knightley in a Jane Austen adaptation. And then there is one scene at the ball that goes on for several minutes while all the characters interact in different places all at once and it just seems to be an utter demonstration of talent and power. Truly flawless."
    },
    {
      "rating": "2.5/5",
      "review": "Pretty boring and not my kind of movies by any means!"
    },
    {
      "rating": "5/5",
      "review": "It's my ultimate comfort movie. Everything about this film puts you at ease: from the cinematography to the warm color tones to the English countryside. Darcy's honor and integrity are something to admire and, at times, envy."
    },
    {
      "rating": "5/5",
      "review": "obra prima absoluta!"
    },
    {
      "rating": "5/5",
      "review": "I mean it contains Matthew Macfadyen's Mr. Darcy. Need I say more."
    },
    {
      "rating": "4/5",
      "review": "A bit slow but well done and the emotions are very strong"
    },
    {
      "rating": "5/5",
      "review": "A bountiful wealth of beauty is on display. Every frame is gorgeous, bringing Austen’s finest novel to exhilarating life: Pride and Prejudice rests in the enriching purity of loveliness."
    },
    {
      "rating": "5/5",
      "review": "This movie is the ultimate romance staple. We don't talk enough about how great Keira Knightley and Matthew Macfadyen are together, their chemistry is unmatched. I will never forgive the filmmakers for not giving us a kiss scene, BUT it's a testament to the writing and directing that the movie also didn't need one. The effect was felt!!!"
    },
    {
      "rating": "5/5",
      "review": "Dancing. Even if one's partner is barely tolerable."
    },
    {
      "rating": "5/5",
      "review": "An adaptation that is not particularly faithful but it works perfectly."
    },
    {
      "rating": "4.5/5",
      "review": "A clasicc, a beautiful love story"
    },
    {
      "rating": "5/5",
      "review": "Amazing. Not only the chemistry, the love and outfits but the shots are so well done"
    },
    {
      "rating": "2.5/5",
      "review": "This narrative propelled me towards an unexpected climax, even though the ending seemed evident, it left me yearning for more. The character development felt erratic at times, causing me to lose track of the plot momentarily. However, the acting performances were exceptional, serving as the cornerstone of this commendable film. I watched it for the first time in 2024, and I am confident that its cinematography will endure through the ages. The editing was impressive, although the storyline felt somewhat disjointed. Nonetheless, the script was captivating and brilliantly executed. While the audience reception may be hyped, I personally won't revisit this film."
    },
    {
      "rating": "5/5",
      "review": "I just saw it again at the movie theater because they were showing old movies. Jane Austen's adaptation is nearly a perfect movie. The acting, screenplay, directing, cinematography, original score is remarkable but Keira's acting is Oscar worthy."
    },
    {
      "rating": "5/5",
      "review": "One of my favorite movies of all time. It shows just how imperfect love is. The actors are fantastic."
    },
    {
      "rating": "4.5/5",
      "review": "I really enjoyed watching this movie. The dialogue was really well done, and the pace was great. If you want to watch a simple romance movie that is innocent and cute, I recommend this movie!"
    },
    {
      "rating": "5/5",
      "review": "A phenomenal movie in imagery, soundtrack, and acting. It's romantic, frustrating at times, and delivers on many emotional fronts for fathers, mothers, sisters, daughters, and lovers. Wonderfully put together with new things to discover every time you watch it. This isn't simply a \"chick flick\"."
    },
    {
      "rating": "5/5",
      "review": "I love this movie... its so rare for a movie devoid of any explicit scenes can make me feel butterflies from just the intense eye-gazing on screen chemistry between the leads. Best romance movie ever, also notebook and lady and the tramp obviously"
    },
    {
      "rating": "5/5",
      "review": "Es hermosa la película , empatice con todos los personajes , su historia es igual al libro."
    },
    {
      "rating": "5/5",
      "review": "Love it, favorite movie!!!"
    },
    {
      "rating": "4.5/5",
      "review": "The main character is very sweet and lovable, there is good chemistry between the actors, and most importantly, a great atmosphere."
    },
    {
      "rating": "2/5",
      "review": "Things I liked - it finally made sense why Charlotte Lucas married Mr. Collins. Finally made sense why Mrs. Bennett was such a nervous wreck. Rosamund Pike and Simon Woods. Grittier Bennett home and grounds. Mr. Collins - not funny like the original but sympathetic and brought a new spin. Things I didn't like - everything else. Zero chemistry b/s Knightley & McFayden. Neither one is swoonworthy and it's not fun to watch their awkward faces for 2 hours. Zero buildup to their romance. No slow burn, no flirting, nothing. When they kissed at the end it was so awkward. Worst of all - zero humor. Seriously, Jane Austen is FUNNY! Where were the laughs? All humor gone. Gaaah"
    },
    {
      "rating": "5/5",
      "review": "absolutely adore and love this movie. a classic, a masterpiece."
    },
    {
      "rating": "5/5",
      "review": "my favorite movie!! shot well with so many layers to unpack. every time I watch I find something new. adapts the book so well. 100/10 so good"
    },
    {
      "rating": "5/5",
      "review": "Beautifully done. Excellently acted. Delightful."
    },
    {
      "rating": "4/5",
      "review": "Fantastic Rendidtion of this book will always be a favorite- the cinematography and the chemestry between actors really brings the purpose of the story to the front! A classic must see verson of this story"
    },
    {
      "rating": "0.5/5",
      "review": "Na minha opinião um dos piores filmes de época já feitos"
    },
    {
      "rating": "5/5",
      "review": "Um dos melhores filmes de romance de todos os tempos."
    },
    {
      "rating": "4.5/5",
      "review": "Pride and Prejudice is a envolving romance story. It's starring Keira Knight as Elizabeth or Lizzie, my favourite character. Pride and Prejudice takes place in the 1800 in England/London. It's about two people from different social status who meet in the country side. She is poor and proud. He is rich and prejudice. They face many problems. I give this movie, 4.5 out of five stars. And I recommend it to people from 14 and over who love a timeless love story."
    },
    {
      "rating": "5/5",
      "review": "This is and may always be my favorite movie. As a child I refused to sit down and watch it with my mom, seems too girly and romantic for me at the time and I couldn't appreciate it. A few years ago a friend and I decided to watch it and I fell in love with it. Since then I have regretted not watching it soon with my mom but we've definitely made up for the lost views. As I've grown older I am definitely a romantic and love a love story but Pride and Prejudice is so much more than that. Beyond the romance, it is simply a beautiful film. There is so much detail even in the little things and as I rewatch it I am just as amazed by it as the first time. The scenery, the music, and the atmosphere is so gorgeous and it makes you want to step into the screen and be a part of it all. The characters are also wonderful and so well cast. Darcy in particular is such an interesting character because even though he is very reserved, as you rewatch the movies you can really read his face and body language when he isn't otherwise expressing how he feels. It is a longer than average movie but much prefer that than a movie and plot being rushed. I think the length is perfect for this movie because so much happens in the quiet/slow moments that are just as important to understanding the story as the big moments. Despite the movie coming out in 2005, I think the beauty of the film attracts audiences of all ages and for anyone to enjoy."
    },
    {
      "rating": "5/5",
      "review": "I just yesterday watched this movie for the first time. I actually thought I'd already seen it! I am so familiar with the story, and I do know I had seen some clips from it, but I was actually astonished at how very well done it is. The sets, the costumes, I loved how untidy most of the people were most of the time, it seemed very natural. I am not an enormous fan of either Knightly or Macfadyen, but I thought them both quite good in this and I really, really liked Rosamund Pike and Simon Wood, quite the perfect Jane and Bingley. And Claudie Blakley as Charlotte - splendid, very touching. Well, really, there were no bad performances. But I was especially struck by the direction, and impressed to learn that this was Joe Wright's first feature film. I love how he took his time and let important moments sink in, one in particular was immediately following the confrontation between Lizzie and Charlotte when Charlotte announces her engagement. I think it might have been the third or fourth time I read the book before I was able to fully appreciate this pivotal moment in the story, and the long quiet time span in which we watch Lizzie on her swing, contemplating, realizing, is extremely moving. Really, really worth watching."
    },
    {
      "rating": "4/5",
      "review": "Very entertaining and romantic. Matthew Macfadyen's as arrogant as fragile portrayal matches w Keira's headstrong, thoughtful Elizabeth very well. I love how the movie tackles w Bennet siblings. Sisterhood and chaos of it all. Underlying comedy of social interactions make the movie comedic gold too."
    },
    {
      "rating": "4.5/5",
      "review": "i loveee this movie. definitely a little long, but still pretty good."
    },
    {
      "rating": "5/5",
      "review": "This movie changed my life. It is a masterpiece and the cast.. perfectly chosen. Wish I could watch it all over again."
    },
    {
      "rating": "1/5",
      "review": "Hated this version!! All wrong! Rushed to make. I saw the 1995 version that was the best by far!! I saw the 1995 version. I thought it was realistic, funny and the sets were correct. Jennifer Ehle was gorgeous and I loved her wig that it looked natural. This version made them look too poor and they hung out with everyone. Assembly rooms were supposed to be for the upper class or upper middle class gentry not the farmers like if you have seen Persuasion in the 90s too, the Musgroves would not be acceptable to Mrs Bennett who married up. Lizzie would have talked to them and Jane but they were different classes. Musgroves were acceptable to this versions opening party and they would be the top family in there. Bennett family in 1995 would go into that place. Area may have had 2000 people from around but only 200 people max would have been upper crust! top 10 percent! Remember they dine only with 4 and 20 families. 24 families. Maybe 100 to 200 with extended families. Mr Darcy they made too rich. I saw Chatsworth in 1998. That was for a Duke or a Prince or Royals. Mr Darcy was the grandson of an Earl. Pemberly is Lyme! I visited that place in 1998 too and that was fit for Mr Darcy. He was rich but not that rich. Places were miscast! Pigs bothered me going into the house. They had an estate yes like the one in 1995 that I visited in 1998 too. Perfect. Farm would have been far enough away that the pigs would not get into the house!! Their hair was unkept and their clothes!! 95 version their hair and clothes was well kept. Mr Darcy would never have went into the barn of an assembly room with the Bingleys in 2005!!!! Like the Bennetts or Lucas family!! Mrs Bennetts sister too!! It would have been beneath them. They might have known some of them but they were in different circles. Bennet circle was small!! They can interact with higher gentry like Mr Darcy but they would be at the bottom. Keira Knightley? I kept thinking Judith Dumbar from Coming Home with Peter O Toole and Joanna Lumley. That was good. Keira is no Lizzie. Jen was perfect!! The cast was perfect in 1995!! Mr Wickham might have been too old and Mr Collins. Mr Collins was so good in 1995!! This very was wrong silly and totally wrong. People who liked it are people that they tried to attract to see period films. These people probably like Brigerton too. I would never look at!"
    },
    {
      "rating": "4.5/5",
      "review": "An absolutely fantastic period drama that has only grown in praise and prominence over time. Not a single casting choice gone wrong as Mcfadyen is fantastic with Knightley. Absolutely great movie experience, with fantastic cinematography and an amazing soundtrack. Recommend to anyone, 9.0/10"
    },
    {
      "rating": "3.5/5",
      "review": "Depending upon the scene, Keira Knightly either did really well or really poorly in acting in this film. Also, the change of feelings by Knightly's Elizabeth Bennet for Mr. Darcy is abrupt. However, this is a well-made film in terms of lighting, pacing and more."
    },
    {
      "rating": "0.5/5",
      "review": "Very slow and boring. My girlfriend made me watch it. Fell asleep within 30 minutes."
    },
    {
      "rating": "4.5/5",
      "review": "Absolutely adored this super cute movie."
    },
    {
      "rating": "5/5",
      "review": "Pride and Prejudice carves a powerful story about love and understanding a person for who they are in time when betrothal was more about social status than anything. With a beautiful setting, electric leads, and cunning diolog, this film intelligently parses wisdom from the most whimsical of romantic situations."
    },
    {
      "rating": "5/5",
      "review": "hermosa la amo la mejor pelicula"
    },
    {
      "rating": "3/5",
      "review": "Knightley just loves herself too much. If she would spend as much time acting as she does looking doe-eyed and seeking her best angles she might be worth watching."
    },
    {
      "rating": "4.5/5",
      "review": "The 2005 film adaptation of Pride and Prejudice brings a fresh and vibrant take on Jane Austen's timeless tale, infusing it with modern sensibilities while staying true to its classic heart. Keira Knightley's spirited portrayal of Elizabeth Bennet injects youthful energy into the character, while Matthew Macfadyen's Mr. Darcy exudes a brooding charm that evolves beautifully over the course of the story. Director Joe Wright's dynamic visuals and sweeping landscapes create a cinematic canvas that enhances the narrative's emotional depth and social nuances. While some critics may raise an eyebrow at the liberties taken with the source material, the film's atmosphere and the chemistry between the leads make it a captivating adaptation that resonates with audiences of all ages, reaffirming the enduring power of Austen's storytelling."
    },
    {
      "rating": "2/5",
      "review": "Before i've seen the film, i hadn't any expectations so my suggestion is if you have no expectation and you'd like to see the movie that makes you emotional a little bit, you ought to see it."
    },
    {
      "rating": "5/5",
      "review": "A beautifully illustrated adaptation of the romantic classic! A must-see period piece."
    },
    {
      "rating": "5/5",
      "review": "This is a perfect love story."
    },
    {
      "rating": "5/5",
      "review": "Stunning Cinematography, a dazzling score, a phenomenal cast and a timeless story...it doesn't get any better than this! Endlessly re-watchable and an instant classic."
    },
    {
      "rating": "3.5/5",
      "review": "Close to the book with only minor alterations. For this movie, best to read the book first to fully understand the story."
    },
    {
      "rating": "4/5",
      "review": "This is a very great romance movie, i liked it very much"
    },
    {
      "rating": "5/5",
      "review": "Awesome movie, 10/10 acting"
    },
    {
      "rating": "5/5",
      "review": "Absolutamente encantador. É um filme que funcionou muito para mim, adentrei de cabeça nesse universo e vivi intensamente cada momento, gostaria de apagar a minha mente para poder ver esse filme outra vez e sentir tudo aquilo que senti na primeira vez em que assisti. O casal principal é maravilhoso e as atuações são sensíveis mas poderosas, amei a ambientação e os figurinos. A história em si é amarradinha e foi eficaz em me deixar presa no sofá até o final. É simplesmente um dos meus filmes de romance favoritos de todos."
    },
    {
      "rating": "3/5",
      "review": "I think the BBC 1980 Pride & Prejudice is the best. If you have not seen it, I would recommend watching it and compare. Keira Knightley's portrayal of Elizabeth Bennet is awkward and and her acting is exaggerated."
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst movies ever. I'd rather watch the notebook 100 more times."
    },
    {
      "rating": "1/5",
      "review": "Gabble, gabble, gabble, mumble mumble...and who picked Donald Sutherland as Mr Bennet, ghastly mistake. Gabbling courtesy of Keira Knightley, Matthew Macfadyen mumbler in chief. Only Brenda Blethyn shone above the actors from the BBC adaptation with Jennifer Ehle and Colin Firth. Here Mr Bingley is little more than a blithering idiot. Austen for the Instagram generation. A total lack of nuance and and ending that defied logic, straight from Mills and Boon. The one star, for the local Ball scene which flattered to deceive."
    },
    {
      "rating": "5/5",
      "review": "Amo! Vejo todos os dias! O livro também recomendo!"
    },
    {
      "rating": "3.5/5",
      "review": "A beautifully shot adaptation. The cinematography is lush. The screenplay, written by Emma Thompson, isn't as good as the Sense & Sensibility adaptation, but it's good enough. Keira Knightley is good, not Matthew Macfadyen's best work but that's largely down to how Darcy is written in this adaptation."
    },
    {
      "rating": "5/5",
      "review": "Lindo lindo lindoooo, que filme, que história!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "This was the worst rendition of this novel I have ever seen. I actually hated it!!! I love the BBC version from 1995. And could watch it a million times. I've read the book so many times I can not count and did not find this movie even remotely close to Jane Austens novel. I believe she would be extremely disappointed. The dialogue was terrible and not for the period. I could go on but I don't understand how anyone that is a fan of this novel could say it was a great adaptation. Terrible I would give it zero stars if it were possible."
    },
    {
      "rating": "4.5/5",
      "review": "I can definitely see why fans of the novel rave for this version. The acting is really good, the cinematography is off the charts, the music, editing and pacing are all very well done. The only complaints (Some personal taste and some structural) is the editing can jump around a bit with so many love arcs in the middle and it can be a bit hard to follow who is interested with who (I was able to put 2 & 2 together enough though) but I know the mini series due a better job fleshing those out as well. It really is more a product of the medium of a movie than anything. Also, the language can be on the flowerily side due it coming from its 19th century source material and it is a bit hard to follow sometimes when a lot is spoken. This is more a personal issue of mine rather than anything else. Overall it does a good job brining those relationships and the results all together in the end though. Anyone who is a fan of the director, actors in this, romance films, or the source material will definitely enjoy this. It's a Classic Romance Film."
    },
    {
      "rating": "5/5",
      "review": "Though a little different from the Book, the movie conveys the same feeling. They added some really funny and sweet lines I wish were in the book. The only problem is that it’s too short."
    },
    {
      "rating": "5/5",
      "review": "Pride and Prejudice (2005) is the best version that exists of this story. The film is sweepingly romantic and empathetic. It is acted to perfection by the whole cast, namely the two leads who perhaps have the best romantic chemistry seen in film. Much credit has to go to the original score and cinematography (which is potentially the best and most effective I've seen)."
    },
    {
      "rating": "2/5",
      "review": "To me, it seems that the screenwriter read the synopsis on Wikipedia and took it from there. If you want the full experience, read the book."
    },
    {
      "rating": "5/5",
      "review": "The first pride and prejudice movie version I ever watched. Time and time again I find my self returning to this version. Beautiful cinematography, set designs and brilliant acting... I only wish this was a series instead of a movie because the run time does not do it justice."
    },
    {
      "rating": "5/5",
      "review": "This version of Pride and Prejudice never gets old and I watch a couple times a year. A perfect film with perfect casting. Matthew Macfadyen is wonderful here as is Keira Knightly. Rosamund Pike's beauty just shines and she plays the subtle and poised Jane beautifully. The scene of the two lovers in the rain is an all time favorite. This may be Joe Wright's masterpiece. Or is that his treatment of Ian McEwan's Atonement? Thanks you, Joe Wright."
    },
    {
      "rating": "3.5/5",
      "review": "Good film, well casted and well acted, brilliant setting of the time. Loved the cinematography and some of the main songs were very good as well. A bit predictable but worth the watch especially if you are into those films."
    },
    {
      "rating": "3.5/5",
      "review": "\"I'm 27 years old. I've no money and no prospects. I'm already a burden to my parents, and I'm frightened.\" Who says vintage romantic fiction isn't relatable? Making cinematic adaptations of historical literature is a dangerous game. There's name recognition in the title, sure, but it's a tightrope walk between making dated source material appealing to a mass audience, and meeting the expectations of the vocal and rabidly dedicated base of readers that insist on nothing short of absolute accuracy. This 2005 Joe Wright adaptation (shockingly only the second cinematic version of the Jane Austen novel, the former predating this one by 65 years) could never hope to do justice to all of the intricate character designs and subplots of the full novel by virtue of runtime alone, and instead opts for alterations in structure and writing in order to give the film more popular appeal while staying true to the base premise and the romantic intrigues of the novel. With excellent casting and period details that together make characters seem empathetic and relatable rather than relics of another time, Pride & Prejudice slides only slightly when it comes to the risks that its characters undertake (which never feel that daring), but retains solid footing as a period romance; I particularly liked Donald Sutherland and the underrated Brenda Blethyn as Mr. and Mrs. Bennet, such a charming, loving, and slightly eccentric couple, even if they were made to be more rustic than Austen intended. But this version doesn't even have Colin Firth in a wet shirt, so how can it be considered comparable to the 1995 miniseries? (3.5/5)"
    },
    {
      "rating": "3.5/5",
      "review": "So…my only objections are Mr. Darcy is not handsome at all…like honestly in the whole UK…I mean heck, the whole of Europe…you couldn't find a handsomer English man to play one of the great heartthrobs of literature? It moves much too quickly to do justice to the story and all of the Bennett girls are dumbed down x100. Keira was great though and it was a pretty movie cinematically. I mean meh but ok."
    },
    {
      "rating": "5/5",
      "review": "Keira Knightley is marvellous in this fantastic piece of cinema!"
    },
    {
      "rating": "5/5",
      "review": "Visually outstanding and having amazing performance from the actors make this movie a joy to watch."
    },
    {
      "rating": "4.5/5",
      "review": "Loved, loved, loved it."
    },
    {
      "rating": "4.5/5",
      "review": "An underrated movie to be true. This would be in the top 5 of the romantic dramas I've watched. The plot is not boring and the cinematography is also great. Needless to say, the acting of lead characters are marvelous. Also, the costume design and makeup is as well mesmerizing"
    },
    {
      "rating": "5/5",
      "review": "Absolutamente fantástica. Es sin duda de las mejores adaptaciones de Jane Austen. Magnificas actuaciones y hermosa fotografía. Una película que no defrauda a los fans de Jane Austen y, a su vez, es disfrutable para alguien que nunca escuchó de ella."
    },
    {
      "rating": "5/5",
      "review": "The enemies to lovers by excellence. Plus character development and strong and independent FL. Also we have Mr. Darcy."
    },
    {
      "rating": "5/5",
      "review": "I can't stop watching this movie. The acting, screenplay, cast, cinematography are all exceptional. I also can't take my eyes off of Keira, she's so mesmerizing in this movie. I like the fact that it's cast a few years earlier to set it apart from the other P & P movies. Maybe it's just me, but the UK/US english differences are a bit hard to understand by my American ears."
    },
    {
      "rating": "5/5",
      "review": "With great performances from everyone involved (not just Keira Knightley; the idea that this version of the story would technically not exist without Pirates of the Caribbean is honestly the most amusing thing I've ever read since I wouldn't expect those two to be in the same sentence), immersive production design, great storytelling, lovely cinematography and a script not lacking in its fair share of wit, Pride and Prejudice is a worthy adaptation of an iconic novel."
    },
    {
      "rating": "5/5",
      "review": "Idiosyncratic notion: A+.  Over-natural material gets creative, yet devoted, treatment from Joe Wright in this beautiful little transformation of Jane Austen's \"Pride and Prejudice\". The two primary regions where Wright appears to concentrate his executive endeavors are in his meandering utilization of cinematography and spatial movement to attempt to capture the hearty disorder of the Bennet family and the more practical than expected portrayal of the mid-nineteenth century social milieu. The masterpiece of Wright's shrewd art is in the beautiful opening, where he utilizes a solitary effort to acquaint us with the liquid, crazy environment in the Bennet family, as the cheeky mother (played brilliantly, if typically, by Brenda Blethyn) and her five little girls make life \"engaging\" for the dad of the family, Mr. Bennet. In a similar shot, as opposed to the sun-dappled, consistently princely milieu furnished in numerous Austen variations (think both Douglas McGrath's and Autumn de Wilde's Emma transformations, for instance), Wright complements the functioning real factors of life in a lower working class country home. Poultry and animals are seen meandering around the Bennets' farmhouse, and the young ladies' garments appear to be plunged in the sloppy grass through which they rush and quibble. Typifying the glow and inventiveness of this transformation is the strong last scene where Keira Knightley's Elizabeth looks for endorsement for her union with Darcy from her dad, played by Donald Sutherland. Sutherland's absolutely genuine reaction of warm giggles, watered down with bittersweet tears of euphoria, takes shape as the effective marriage in this film of that precarious Austen mixed drink of satire sifted through more genuine social editorial."
    },
    {
      "rating": "3/5",
      "review": "No doubt that the filmmaking and the performances adapting one of Jane Austen's earlier works that supposedly revolutionized romanticism faithfully remains as gracefully elegant bolstered by a fine cast, therefore collectively ranked in its release year's tops. However, the favorably boosted reputation by enthusiasts and romantics show that this film served them a good, staged performative read-aloud, slightly modern by taste, but didn't go as far to garner wider interest to resolve the disassociation of being characteristically unmemorable. (B-)"
    },
    {
      "rating": "5/5",
      "review": "Absolutely stunning scenery. Amazing cast who fitted the roles with perfection. Accurate dialect from all cast members. Took a trip back in time to when men treated women with respect and dignity. Some humour added in. Great shits and a good adaptation from the book."
    },
    {
      "rating": "5/5",
      "review": "Pride And Prejudice Is a beautiful movie, its lexis, and setting are amazing, I've seen it a million times but worth it totally, you be captivated by the intelligent and rebel Elizabeth and the presence of Mr. Darcing. Pride And Prejudice is a movie that encourages you to repeat the best scenes one more time a have the same powerful emotions."
    },
    {
      "rating": "4.5/5",
      "review": "I love the scene when Darcy bursts into her house solely because of the Office-style zoom."
    },
    {
      "rating": "5/5",
      "review": "The music is beautiful, georgous, so calming, so relaxing... The scenery is magnificient, Keira's acting was superb in this... love this adaptation !"
    },
    {
      "rating": "5/5",
      "review": "so romantic and beautiful"
    },
    {
      "rating": "5/5",
      "review": "Beautiful. Wonderful. Romantic. Thank you Jane Austen and everyone involved in this film."
    },
    {
      "rating": "5/5",
      "review": "This movie was a wonderful homage to the book. The scenery and filming locations were absolutely beautiful. The movie score is beautiful as well. Kiera Knightley and Matthew Macfayden were truly captivating in this film."
    },
    {
      "rating": "5/5",
      "review": "this brings romantic movie to another level"
    },
    {
      "rating": "5/5",
      "review": "There aren't enough stars for this movie. I have watched it more times than I can count. I watched it every day practically for 2 yrs. when I felt like it and to go to sleep to in a good way not a boring way. It was bliss. I still watch it from time to time now. Several times a year."
    },
    {
      "rating": "5/5",
      "review": "It's very heartfelt and very emotional. 100% would recommend if you're a fan of movies based on old times."
    },
    {
      "rating": "3.5/5",
      "review": "Una excelente adaptación de la clásica novela, que mantiene la tónica sobria y el lenguaje de la época. Bien ambientado y con muy buena historia."
    },
    {
      "rating": "5/5",
      "review": "There are lots of things to like about this adaption! Firstly, music score which threads through the story so well, helping to pull it together as does the excellent use of the locations with the grand houses, gardens and countryside being stars in the movie in their own right. The two lead performances are excellent. Knightly deserved her Oscar nomination. She truly embodied Lizzie's wit, warmth, humour and frustrations and that she did so whilst challenged by a much diminished amount of dialogue and much fewer opportunities than afforded by a TV series was remarkable. In this she is assisted by the script which retains sufficient elements from the book to achieve this end but the romance is certainly helped along by both Knightly and McFadyen being equally as God as Firth and Ehle at acting with their eeyes and having the right chemistry. Some standout scenes for me are the two dancing together in an a suddenly empty room, the hand flex scene and the scene where the sisters are excited post the ball and chatting together in bed! Brought back many happy memories of sleepovers at the homes of my friends and chatting excitedly post party etc. Rosamund Pike is very good at capturing Jane's goodness and tolerance and her pain at 'losing' Bingley, despite her being under used. There are many scenes or characters totally removed or only referenced but these removals are well chosen and the core elements and themes of the book remain in the movie. I have mixed feelings about Wickham being hardly on screen, certainly he is not present enough for the viewer to hate him. Afterall, he is the pantomime villain of the tale. Who doesn't want a proper opportunity to internally boo and hiss at him? Unfortunately, we don't get it here but I confess when re-watching the series I often fast forward through the bits with him in, so perhaps Wickham is on screen quite enough. Mr and Mrs Bennett are much softened around the edges here, with still sufficient of the character's faults found in the book to lead to the the inevitable social embarrassments and Lydia's stupidity but Mr Bennett here shows genuine regret that he hurts his wife when siding with Lizzie on the occasion of Lizzie refusing Mr Collins and his wife also demonstrates real fondness for him, rather than false flattery or nagging to get her way. I like this portrayal whilst not considering it superior to the more colder portrait of the relationship in the book Mary and Kitty are also more kindly treated here and I confess i like the nice touch of this movie showing them becoming closer after Lydia is out of the picture. I do wish there was more Darcy! Yet MacFadyen and the script still do him justice portraying a man who's a bit shy and determined to preserve his dignity and yet deeply loyal, very honourable and loving. The proposal scene, so different from the book and other dramatisations, is nevertheless moving and his expression when Lizzie refuses him! It's actually heart breaking! Even though you are, as you should be, annoyed with his arrogant, basically insulting proposal you do recognise that he is truly attached to her. I know that the portrayal of Bingley is criticised. Quite a few of my friends don't like it. The proposal preparation scene and actual proposal is well done, as is the scene where he gets too scared to propose when he first turns up and the ballroom scenes I also like. However, I have to agree that some scenes, most especially those at Netherfield when interacting with his sister and Darcy are almost painful. The actor plays him almost like a dim-witted buffoon. That hee hee school boy laugh really grates and his expression often looks vacant and daft. This is unfortunate as on other occasions he does a good job of playing the role but I was rather annoyed by those scenes. Overall though it's an excellent version of the book staying true to its core and often being genuinely moving. When Lizzie cries after receiving Jane's letter I cried too. Her pain felt so real."
    },
    {
      "rating": "5/5",
      "review": "A great movie with standout chemistry filled performances from leads Kiera Knightly and Matthew McFayden. The adaption of this Love story written by the magnificent Jane Austin. The scenery and cinematography were also beautiful!"
    },
    {
      "rating": "2.5/5",
      "review": "Not for me, but then again neither are jane austen books."
    },
    {
      "rating": "5/5",
      "review": "My literal favorite movie of all time. From the score, to the cinematography, to the phenomenal acting, this movie is perfection. Keira Knightley's performance is breathtaking and Matthew Macfadyen's interpretation of Mr. Darcy is wonderfully captivating. Will forever be my comfort movie, I love it so much."
    },
    {
      "rating": "5/5",
      "review": "Before I watched this movie, the 1995 TV series was my favourite P&P made and I didn't think anything could come close to Colin Firth's Mr Darcy. However, I absolutely LOVED this film! Knightley and Macfadyen adopted the roles of their characters to near perfection and their chemistry was incredible. I found their versions of the characters to be the most natural when conversing with each other compared to other adaptations made."
    },
    {
      "rating": "5/5",
      "review": "THE best version of Jane Austen's Pride and Prejudice."
    },
    {
      "rating": "2.5/5",
      "review": "It could not compare to the 1940 version. Did not develop the story thoroughly to bring about believability of the growing relationship of Darcy and Elizabeth."
    },
    {
      "rating": "4.5/5",
      "review": "A fantastic telling of the classic P&P story. Having read the book, I feel that this adaption definitely does a fulfilling job of creating the characters with their various intricacies. Keira Knightley and Matthew Macfadyen both provide convincing portrayls of their respective characters. This is a great movie for anyone who wants to know the story without having to read the book or watch the 5-hour long version (while I would still strongly recommend both). Definitely worth the watch, and repeat viewings!"
    },
    {
      "rating": "5/5",
      "review": "I'm a straight guy and I thoroughly enjoyed it."
    },
    {
      "rating": "3.5/5",
      "review": "The only thing that annoyed me is how much Beth smiles, but again it's just how her character is. Except from that, everything was good espicially the romantic scene with Mr. Darcy."
    },
    {
      "rating": "5/5",
      "review": "Jane Austen’s classic novel is brought to the screen in this wonderful adaption. Pride and Prejudice is a gripping film with an phenomenal elegance to it and lovely moments and characters that will keep you entertained from beginning to end. However in the center are Keira Knightly’s Elizabeth Bennett and Mathew McFayden’s Mr. Darcy and their confusing and loving relationship. This is a phenomenal film that will not disappoint, especially to fans of the original novel, Jane Austen, or other readers of the classic books."
    },
    {
      "rating": "3/5",
      "review": "Sometimes some scenes felt too long and sometimes it seemed some scenes were missing."
    },
    {
      "rating": "4/5",
      "review": "A little inaccurate but due to the time constraints of a single movie I'd say they did a fantastic job!"
    },
    {
      "rating": "5/5",
      "review": "Never has a movie made me so giddy."
    },
    {
      "rating": "5/5",
      "review": "This movie is amazing with proper acting and beautiful continuity ,definitely worth a watch"
    },
    {
      "rating": "5/5",
      "review": "yes!! a million time yes! just watch it!"
    },
    {
      "rating": "5/5",
      "review": "Perfectly cast and well paced. An incredibly sweet story and movie. I highly recommend."
    },
    {
      "rating": "4.5/5",
      "review": "A slow burn that had me frustrated and lovesick by the end of the movie - a testament to the great performance by the cast. I know I will watch this again."
    },
    {
      "rating": "4.5/5",
      "review": "A gorgeous cinematography and excellents costume and production designs, Joe Wright makes this movie a memorable (and even funny and impressive to behold) adaptation of this classic Jane Austen novel. Some camera focus is a little bit uneven, but that does not matter too much with a great cast led by a (first for me) charismatic performance from Keira Knightley."
    },
    {
      "rating": "3.5/5",
      "review": "The gripping plot points rife with originality and splendor in the hit novel are not absent here. This adaptation features an ensemble cast and some passionate cinematography."
    },
    {
      "rating": "4.5/5",
      "review": "More than enjoyable to watch, ‘Pride & Prejudice' succeed in everything, from beautiful cinematography to remarkable costume design and a big and lovely story that evolves with a terrific script."
    },
    {
      "rating": "5/5",
      "review": "This movie captured my heart. It's the kind of love that's so well done, well developed, well written, well acted, that your heart might just turn inside out"
    },
    {
      "rating": "5/5",
      "review": "Favorite movie of all time. LOVE the way it is directed. Perfect actors and I get sucked into this love story every time I watch."
    },
    {
      "rating": "5/5",
      "review": "Love this movie so much. The chemistry between the leads is great and I have always loved the enemies > friends > romantic lovers plot."
    },
    {
      "rating": "4/5",
      "review": "I wanted to see what all the hype was about, and I was not disappointed! I did feel that the movie was a bit shallow in both the storyline and the characters themselves, and I wish that there was a TV show version with these specific actors (yes, I know about the actual TV show). Overall, though, I loved it!"
    },
    {
      "rating": "5/5",
      "review": "I loved the 1995 BBC adaptation; however, this film betters that incarnation. A great date night film and an excellent portrayal of this timeless love story. Highly recommended."
    },
    {
      "rating": "4/5",
      "review": "If you like Jane Austen then you probably gonna like this movie. Be careful, there's two endings involving the \"kiss\" scene, which that they shouldn't do that."
    },
    {
      "rating": "4/5",
      "review": "Very pleasantly surprised - extremely romantic without becoming stuffy or overly saccharine and Hollywood-ized. I some ways a fairly traditional adaptation and in others quite modern. Great dialogue and actually very convincing acting - one of the best roles I’ve seen Keira Knightley in. I enjoyed this way more than expected."
    },
    {
      "rating": "5/5",
      "review": "Loved this adaptation of the book. Fell in love with Elizabeth and Mr Darcy."
    },
    {
      "rating": "4/5",
      "review": "My girlfriend proposed this movie as our Valentine's Day entertainment, and it exceeded my expectations. I have not read the book so I cannot speak to the faithfulness of the movie, but judged as a separate work, Jane's plot is clever, fun and engaging. The casting was immaculate (especially Darcy and the eldest Mrs. Bennet), and I found myself gravitating towards and falling for characters in a way entirely deliberate on the part of the author. Some parts were a little cheesy (namely the emotional conversations and arguments in the driving rain and Darcy's \"cold hands\" in the final scene), and yet they didn't seem out of place. Love fights an uphill battle the entire movie, and the audience is willing to accept anything to see it prevail. At the risk of making a shallow comparison, I haven't had this much fun watching the inner workings of family life since I watched Little Women."
    },
    {
      "rating": "5/5",
      "review": "Summary: The movie tells the romantic story of a young lady who lives in a small town in England in the 19th century. The story begins when two young and rich men arrive in town. One of them is a gentle, kind person who everyone loves, but on the contrary, his friend, though visibly good-looking and rich, seems to be proud and arrogant. The young lady, Elizabeth Bennet, calls the attention of the arrogant rich man, Mr. Darcy. She, however, has a terrible first impression of him that makes her decide she would never marry a man like him. After some time, Elizabeth and Mr. Darcy meet again and he confesses his love for her, telling her he has tried in vain to repress what he feels for her, and even with her inferiority of class he has concluded that he loves her. Elizabeth rejects his offer to marry him, feeling offended by his words, but soon after that, she reflects on the offer she has just lost. After some time, while Elizabeth is traveling she gets to know his sister and people who work for him. She then is admired by the profound respect all of them have for him, considering him a generous, kind, unselfish, and caring person. She then admires him and more profoundly regrets having rejected him the first time. At the same time, Mr. Darcy repents of having thought of Elizabeth as an inferior-class person and learns to recognize her for who she really is. The last event that helps Elizabeth reflect is that when her little sister causes a scandal after flying off with a military officer, Mr. Darcy anonymously helps to solve the problem. This last event brings a new opportunity to meet again with Mr. Darcy, who she now respects and admires. He proposes her marriage for the second time and she now accepts. Analysis: The themes that Pride and Prejudice analyzes are gender, class, and reputation. The story occurs at a time when women had rigid roles and were expected to fulfill them. For example, marriage was the only thing that Elizabeth's mother and friends were worried about. This is because at that time, marriage was the only way in which a woman could have economic stability. The movie recognizes and criticizes the gender injustices that were present at that time. The principal character, Elizabeth Bennet, rejects two marriage offers showing that she knew she was capable of remain independent until she wanted to marry someone she really loved, not just because of money and need. Another theme mentioned in this movie is class and reputation. A woman's reputation was the most important for society. Women were expected to behave such that they would always look good. For example, there is a time when Elizabeth appears with muddy clothes and people appear to be uncomfortable with that. Another example comes when Elizabeth's sister escapes with an officer without being married; this completely destroys her reputation and even the reputation of his entire family. The movie again goes against the ideas of that epoch. The movie exaggerates some class boundaries in order to ridicule some behaviors and make them seem absurd. However, it also recognizes and accepts other less formal class boundaries. Critique/Recommendation: I personally love Pride and Prejudice movie. The adaptation from Jane Austen's book is amazing; the sensibility of the film makes it sweet and enjoyable. It also helps you to understand how society was established and the roles women played in society in the 19th century. Along with that, you enjoy the beautiful love story of two and more characters. This is a perfect movie to enjoy with your family or a group of girlfriends. I fell in love with this movie the first time I saw it and could watch it again a thousand times. I highly recommend it and would give it 5/5 stars."
    },
    {
      "rating": "5/5",
      "review": "Amazing I absolutely loved it."
    },
    {
      "rating": "5/5",
      "review": "This movie is fantastic! If you like Jane Austen, romance films or just beautifully shot films this is a complete must see!"
    },
    {
      "rating": "4/5",
      "review": "one of favorite movie"
    },
    {
      "rating": "4.5/5",
      "review": "Best movie adaptation of Jane Austen's book. Photography and direction are key here to summarize the story, keeping its core and adding new layers to it by making use of cinematical tools as lightning, music, etc."
    },
    {
      "rating": "5/5",
      "review": "My favorite movie. A must watch!!"
    },
    {
      "rating": "3.5/5",
      "review": "I watched film \"Pride and prejudice\" made in 2005. I was very skeptical about it before watching, with prejudice, because I had heard a lot. In a word, the film is beautiful, but is it a film adaptation? Let's start with shooting. Wonderful atmosphere of the film directly depends on it. All the close-up shots, surroanding nature and actor's play make the film a perfect love story. House's interior isn't that well-designed as in film adaptation 1940, but it fits in whole picture. Now, costumes. Here is only my opinion. Costumes fit in time of the book, but don't fit actors at all. Maybe it's also casting fault, but I think it's about quality and price of the fabric. Moreover, I'd like to say about hairstyles. Honestly, I feel weird about seeing that kind of hairstyles after watching 1940's film. Men's one looks more or less harmoniously, especially, when they're attending balls, but women's looks awful. The actors. I was very surprised by the choice of casting. Claudie Blakley to play Charlotte Lucas. There wasn't told that Charlotte was such a bad-looking girl. I don't how this impossible, but she looked bad all the time. Keira Knightley (Elizabeth Bennet) act very freely and swaggerly, the opposite from Lizzie in the novel. Here, Mary is perfect book interpretation of Elizabeth. Matthew Macfadyen (Mr. Darcy) don't look arrogant, he is just shy person, who in love. Simon Woods (Charles Bingley) seemed like guileless and foolish person. In film adaptation 1940 Mr. Bingley was much better. But Rupert Friend (George Wickham) made me happy. This character inspires trust and his deception really strikes your heart in the film. I was amazed by Tom Hollander (Mr. Collins) too. He showed another side of the character, as romantic and very miserable man. And last but not least, Judi Dench (Lady Catherine de Bourgh) always amazing in any role. She showed her character entirely. In conclusion, consistency with the wording of the book - medium, but it's hard to say that about plot. I recommend this film, but you should regard it as an independent artwork, not as film adaptation."
    },
    {
      "rating": "4.5/5",
      "review": "I recently reviewed the movie \"Pride and Prejudice\" (2005 )and I really like this movie. The big-budget film \"Pride and Prejudice\" was based on the novel by Jane Austen .This film has been adapted several times, and the last film adaptation was 2005, directed by Joe Wright. I was interested in this film primarily by the cast, which stars Keira Knightley and Matthew McFadyen in the lead roles . This film tells the story of two wayward natures who must fight with pride for the sake of their happiness and love. I also wanted to note that for the entire film, the characters never kissed or touched each other .I mean, can you imagine how great the relationship was at that time? No vulgarity, everything was so subject to ethics. Also I would like to add that everything was spectacular , especially as they expressed their thoughts powerfully , they expressed them so gallantly that even I, as a philologist, felt uneasy. The film is GRIPPING! If you have lost faith that there is true and pure love, without any vulgarity, then I think you should watch \"Pride and Prejudice\"."
    },
    {
      "rating": "4.5/5",
      "review": "Very well put together, this is a great work of art worthy of a standing applause. Although, Ms Bennett's character was more than annoying at times, I take it that it reflects a typical behavior at the time."
    },
    {
      "rating": "4/5",
      "review": "How are you this evening, Mrs.Darcy?"
    },
    {
      "rating": "5/5",
      "review": "If you've read the book, you know that the best adaptation is the BBC series. However, this one is my favorite. This is a beautiful romance story, more realistic in some way, in which its characters show their vulnerability at some point in the story. Very good performances, all of them make their characters credible. The soundtrack is excellent, always at the right time. It's definitely a movie you must see."
    },
    {
      "rating": "3/5",
      "review": "The technical aspects were terrific, the acting, the directing, cinematography, etc but I simply can't say I enjoyed the story itself. It was sad to see a time when the entire goal of a young woman is to get married and nothing else. These women have nothing else in life and if they don't fulfill this then they are failures. Plus these marriages are more like financial agreements so its more about helping the family with its \"honor\" and its pocketbook then anything else. Then because these women and most of the men are so shallow I had no interest in them whatsoever. Only Mr. Darcy showed any kind of character at all and this is not enough to make this a very enjoyable watch. I think a 6/10 rating is agreeable, never need to see it again though."
    },
    {
      "rating": "5/5",
      "review": "It was just at delightful movie."
    },
    {
      "rating": "4.5/5",
      "review": "00:02:25 Goodness gracious! If it isn't Cpt. Benjamin Franklin himself! I love seeing Donald Sutherland smother the screen in his splendiferousness. = My first thought that popped into my head while watching this film. 00:08:00 I am only eight minutes into this period drama and it's already teeming with amusing dialogue and scrumptious sequences! An odd choice although it may seem, launching headfirst into a flurry of sniggering and dancing could not make my eyes and ears more happy. Bravo! 02:08:37 I have just finished the whole shebang. Wow. I even teared up at the dashingly romantic climax! And that's saying something … Can we all just agree that the biggest thing going for this film is not Keira Knightley (no matter how good she may be), nor production quality, but the photography. Having just sat through several film analysis classes in English, I really began to appreciate just how effortless the the panning and positioning in 90% of this film is.The only problem I would have, would be with the camera(wo)man behind a couple of scenes near the beginning and end. Their ‘darting' between close-ups quickly became quite ‘noticeable', if not irratble. Even if they were tying to react with the actors' heads in unison, the final scene could've come across a little less … try-hard-y. LOVED the shut-eye P.O.V. though, when she's day-dreaming in the carriage. I've ALWAYS wanted to try that! In the end though, this finishes (the chaotic race that is this movie!) as a first-rate period drama full of RaW emotion and … yeah, just goodness-ness. Judi Dench is good as per-usual, Rosamand Pike is fine, and hmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm I've made up my mind now. Keira Knightley is a bit bloody marvelous! Okay, okay, she's mediocre. Actually … jOKiNg! *Also, I looooooooooooove period dramas. They make you think intelligently and have you saying long and cryptic words for at least 48 hrs after the film has finished. This film in particular is vry gd and nobody can tell me different!"
    },
    {
      "rating": "5/5",
      "review": "Cinematography, costume, casting and acting all 10/10. Everything about this movie feels deliberate and serving a purpose for the story. Amazing English scenery. Great film adaptation of a Jane Austen classic."
    },
    {
      "rating": "4.5/5",
      "review": "An excellent adaptation of Jane Austen's iconic romantic drama novel, that acts as a clever, interesting, enjoyable and refreshing update of its source material, with charming performances, impressive production values, well-crafted narrative and modern sensibilities."
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved this movie. I sat in awe after the movie ended because of how much I loved it. I don't think I have ever seen a movie as good as the 2005 Pride and Prejudice."
    },
    {
      "rating": "5/5",
      "review": "Masterpiece among masterpieces."
    },
    {
      "rating": "4/5",
      "review": "With stunning camera work and fabulous casting, joe wright once again captures the magic of the period drama within Jane Austen's finest works."
    },
    {
      "rating": "4.5/5",
      "review": "It's a very good movie, that takes you to the XVIII century and shows you the emotion they felt, the only problem I could is that in the beginning, it was as the novel said, but after it changes somethings, but, in spite of that, it's a very recommended movie for every Jane Austen's fan."
    },
    {
      "rating": "1/5",
      "review": "An unnecessary and choppy adaptation that lacks in everything but American actors."
    },
    {
      "rating": "1/5",
      "review": "Where do I begin? Messy mops was the order of the day, or did those who made the movie not have enough money for a hair dresser? Knightley's hair was so stringy, as was nearly everyone's. Tho obviously ballet trained, Knightly is far too androgynous for Austin anyway. Ehle blows her out of the water. IMHO, Rupert Friend was badly miscast. Love Blethyn in anything. I'd watch the Colin Firth version a dozen times before I would watch this once."
    },
    {
      "rating": "4.5/5",
      "review": "This is a very delightful movie, the screen play and the film images are amazingly beautiful. Great acting too! Very pleasant to watch"
    },
    {
      "rating": "4/5",
      "review": "Outstanding screenplay of the novel! Very well acted, especially by Keira Knightley."
    },
    {
      "rating": "5/5",
      "review": "Watching this movie always makes me feel like I'm reading a very good book. Furthermore, the central romance is one of the very few movie romances that doesn't seem forced. Brilliant movie!"
    },
    {
      "rating": "3/5",
      "review": "It was enjoyable, but goes pretty much as expected. Pirates of the Caribbean girl ended up with moody rich guy after much drama and family affairs!"
    },
    {
      "rating": "5/5",
      "review": "Cinematography is incredible. Acting is great, script too. Loved the chemistry between Elizabeth and Mr. Darcy, bedazzles me every time I watch it."
    },
    {
      "rating": "4/5",
      "review": "A great adaptation with powerful performances that captures the heart of one of the greatest books of all time."
    },
    {
      "rating": "5/5",
      "review": "Pride and Prejudice is the perfect romance. Don't believe me? – read the book . Although some might argue that Elizabeth only loves his money and Mr. Dracy is an ass (pardon my language), I find their love story beautiful and their characters inspiring and unique. In case you haven't figured it out yet: I loved the book. So naturally I had very high expectations regarding this movie. When deciding to watch this movie, I was terrified that it would ruin the book for me – like some movies do. By taking certain liberties, producers often change the stories into something they're not, destroying them in the process. Thankfully, there was no crime committed in this case. While leaving certain aspects of the book not fully developed, this movie wasn't lacking. Elizabeth Bennett was still the inspiring, headstrong, witty young woman and Darcy still the brooding love interest. That being said, I would also like to address the casting choices for this film. While I feel like television director Joe Wright must have had and especially daunting task choosing his lead actors, I believe that he did an exceptional job. Keira Knightley as Elizabeth was an amazing choice, however I find the choice for Mr. Darcy even more impressing. Relatively unknown actor Matthew Macfadyen had some shoes to fill, for Colin Firth was cast as Mr. Darcy in the 1995 TV adaption, and did a spectacular job. Furthermore I felt like the chemistry between the actors was there, which is of course extremely important in any romance. So all I can really say is : bravo – amazing."
    },
    {
      "rating": "5/5",
      "review": "I love this book and I love this film."
    },
    {
      "rating": "1/5",
      "review": "If you want beautiful cinematography, pretty people, and melodramatic romance, you'll love this. If you're a true Pride And Prejudice fan and understand Austen's priceless ironic masterpiece, you'll hate it. This is NOT Pride And Prejudice."
    },
    {
      "rating": "4/5",
      "review": "My wife is a huge Jane Austen fan and this her favorite movie. I can see why that is. This is a very good move with a great script and good story."
    },
    {
      "rating": "5/5",
      "review": "Devine movie Your eye could tear up just from seeing the impeccable cenimatography And the blend of cenimatography and feelings... If you let your soul to slip with it ... Your brain might be even overwhelmed with it... You will certainly light up."
    },
    {
      "rating": "3.5/5",
      "review": "This is the best rendition of the story. A bit dry at times. Binge worthy at others."
    },
    {
      "rating": "4/5",
      "review": "One of the best romance films ever made"
    },
    {
      "rating": "5/5",
      "review": "It's my favourite absolutely amazing. I love Keira Knightley so much in this movie. ❤❤❤❤🥰"
    },
    {
      "rating": "0.5/5",
      "review": "Boring AF! Completely a snoozer lol"
    },
    {
      "rating": "5/5",
      "review": "This film is not the boring period drama that I expected! Pride and Prejudice takes viewers on a charming, affectionate journey alongside strong characters which, it turns out, I adore."
    },
    {
      "rating": "4.5/5",
      "review": "For me this film was so watchable that I watched it 3 times. I'd see it again. Great casting and acting, wonderful cinematography and a well done you job of bringing this classic tale to film. One of my favorites."
    },
    {
      "rating": "5/5",
      "review": "With the exception of Tom Hollander's absurdly silly Mr. Collins, the characterization of every character is flawless. And with the exception of the overly-fluffy and stuffy period pieces first act, Joe Wright captured the spirit of Jane Austen's classic novel astonishingly: Austen's biting sarcastic, yet delicate humour runs through the vein of this film. What I love the most about Jane Austen is that she has a strong control over her characters: she develops them throughout the novel so exquisitely, and she can change the reader's perception of them so gracefully. And of course that was my biggest concern about this film: I doubted that such thing can be done on screen convincingly. I daresay Moggach's screenplay managed to pay justice to the characters, and their development, in a way I've never thought it would be possible. Besides the aforementioned nitpicks, I have some other quibbles: I think Lydia's elopement is a turning point in the story and the film should've laid stress on it more, and I think the same should have been applied to Mr. Darcy's \"revealing\" letters to Lizzy. Other than that, I think this is an astonishing adaptation, and a one that truly benefits from being condensed - for I think the novel gets a bit monotonous at some point. All the actors and actresses are perfect for their roles: I would've never thought I would say that about Rosamund Pike having seen Gone Girl first, but she is perfect as the most innocent and persuasively ideal character, Jane Bennet. Keira Knightley delievered her best performance in her career by far, and I think out of all the roles she played, this is the only one that trully shows her talent. (9/10)"
    },
    {
      "rating": "4/5",
      "review": "The story of Elizabeth and Mr. Darcy is incredibly beautiful. Their character development is well played out and satisfying. However the movie seems to drag out a bit with undeveloped background characters that don't do much. They're just kinda convenient for the plot."
    },
    {
      "rating": "4/5",
      "review": "The movie has a way of making you feel the warmth of summer. Love the score."
    },
    {
      "rating": "2.5/5",
      "review": "Although at first i found Keira Knightley's Pride and Prejudice interesting, I watched it and it was pretty boring. I didn't care for it so much."
    },
    {
      "rating": "5/5",
      "review": "this film is a visual masterpiece in terms of the the cinematography, the environment, grand estates and even the filthy, messy real-life scenarios. this gives me the romantic feels just by the way the characters look at each other, more so when they throw their dialogues. the sexual tension is very subdued and conforms with propriety rules but still delivers that spark and magic that true love makes you feel. the only downside is the meshed scenes and downgraded costume design."
    },
    {
      "rating": "5/5",
      "review": "Most beautiful love story of all times!"
    },
    {
      "rating": "2/5",
      "review": "A Beautiful score and flawless filmatography are the two aspect i like about this movie. Storywise and characters the movie is hollow, reducing the rich characters from Austen's novel to one dimension hollow versions of themselves. Still, if i'm in a good mood, i can ignore all that and enjoy it as simple a movie set in Regency-ish without connecting to the beloved book. And i still didn't need the close up to the Pig's testicles."
    },
    {
      "rating": "4.5/5",
      "review": "Never let your pride pass by your prejudice! Little do I know about Jane Austen's novel from 1813 named Pride & Prejudice. But if there is one thing I am certain of, it must be the extraordinary nature of Joe Wright's film Pride & Prejudice based on that novel. There is no such thing as too many awards for this 2005 film because, hey! The film only took two decades to finally be released? Besides we know that this is no modern story since it's been originally written in the 19th century. However, Joe Wright's film is only one way of interpretation of Jane Austen's novel. I, for example, liked his interpretation. Or should I say loved ? Yet I must admit the reached length of the film as it is quite long. Roughly two hours to be correct. Nonetheless it does have its advantage and disadvantage. You can enjoy the film for a longer amount of time and the story definitely could have been put in a film of shorter length as it would be, I think, more powerful. I'm sure you've seen at least one romantic drama whose story takes place in the 21st century. If I'm right then you should know that those movies are pretty predictable, which by the way, doesn't necessarily makes them inferior. It's just that these movies usually have the same build-up of storyline compared to the unique course of Pride&Prejudice. That's how many other movies have been inspired by this story, such as Becoming Jane, Bright star and several other movies. The first half of the movie was kind of confusing to me, not because I didn't understand what was going on but because I didn't know what to expect the end to be like. I enjoyed it nevertheless. In fact, this kept my tension up because I couldn't predict what would happen afterwards. The not too exciting progress of the film is besides what made the ending so special, beautiful and outstanding. I was surprised to say so. Elizabeth Bennet played by Keira Knightley an Mr. Darcy played by Matthew Macfadyen are the main characters of this film. They performed charismatic and splendid. It is not always as easy to live according to the standards of the 19th century as a modern person, but they have certainly succeeded. Elizabeth and Mr. Darcy form a prejudice about each other after an inconvenient meeting at a public ball. They meet several times afterwards, but no one is willing to take the first step towards getting to know each other better as their pride dominates and because of their difference in class. Despite their persistence they still get to discover each other's true personalities. This simultaneously leads to the end of the film and the start of a new story. Something that really took my attention is the remarkable acting of Matthew while representing Mr. Darcy. Many people do not really appreciate his acting opposed to what I see in his performance. I could sense the absence of Mr. Darcy's emotions and mainly face expressions during most of the film. As the film continued we got to see how he flourished and exposed more and more of his emotions. So we surely did get rewarded for our patience. Even more surprising is how some of his emotions were perfectly expressed by his words. Truly admirable. On top of that there is also the time aspect of the film. The story took place in the 18th century and I really got to see how a love story, mainly revolving around marriages, could occur in that time. It was the first time I got to see something like that which was very interesting. The film crew created the ideal setting for the story and it clearly paid off and added depth to the story. As if all of that wasn't enough, humour was included as well. This is what completed the film for me. I personally like an additional touch of humour. Finally, I have to say that this movie left me with a smile on my face. Not many movies can do that to me. This is a classic that you can't miss out. Now you know which film to watch next time you jump on your couch in front of the TV!"
    },
    {
      "rating": "5/5",
      "review": "Jane Austin's adaption of one of her finest works has truly been done justice through spectacular performances and awe-inspired scenery that crafts one of the greatest love stories in the history of cinema."
    },
    {
      "rating": "5/5",
      "review": "One of my favorite movies ever, I've wached a tousand times..."
    },
    {
      "rating": "4.5/5",
      "review": "Screenwriter Deborah Moggach initially attempted to make her script as faithful to the novel as possible, writing from Elizabeth's perspective while preserving much of the original dialogue. Director Joe Wright, however, encouraged greater deviation from the text, including changing the dynamics within the Bennet family. Wright and Moggach set the film in an earlier period and avoided depicting a \"perfectly clean Regency world\", presenting instead a \"muddy hem version\" of the time. Janeites notoriously scorn this version because of its plot variation and the historical inaccuracy, but I have always loved the music and costumes in this version!"
    },
    {
      "rating": "4.5/5",
      "review": "If you like old romances, I highly recommend. Most definitely a classic. The music and scenery was gorgeous and set the tone amazingly!"
    },
    {
      "rating": "5/5",
      "review": "The photography and soundtrack are magnificent! A movie you'll never forget"
    },
    {
      "rating": "5/5",
      "review": "Pride and prejudice are one of the most fascinating films I have ever seen. I love it, it is a romantic and comedy novel. All movie is excellent that the protagonist to show pride that their social states like Mr. Darcy and Elizabeth Bennet they are different families but The love they feel, makes them do things that keep them further. But their love makes them take courage to be together. However, Austen is the best of her novels because its romance involves two people who were born to be in love, and care not about business."
    },
    {
      "rating": "3.5/5",
      "review": "Joe Wright is a hit and miss director for me as Darkest Hour (2017) and Pan (2015) are ghastly films and yet I am quite a fan of Atonement (2007) and this film although they feel very sub-Merchant Ivory at times. This, his first big hit, launched him as a successful director of middle brow prestige dramas and it's easy to see why as he blends the style of Jane Austen's classic text with modern sensibilities more palatable to young audiences. I personally like the film although it never reaches the heights of great period romances like The Age of Innocence (1993) and A Room with a View (1985). This is the sort of film that will reliably entertain teenage girls who enjoy pomp and pageantry but don't want to have to deal with all of the hard to understand, old fashioned language that can sometimes accompany films of this sort. Young Elizabeth Bennett, Keira Knightley, is encouraged to marry by her social climbing mother Mrs. Bennett, Brenda Blethyn, so that she may obtain financial security. She meets the socially awkward Mr. Darcy, Matthew Mcfadyen, at a party held by her Charles Bingley, Simon Woods, the suitor of her attractive and sensible sister Jane, Rosamund Pike. The two immediately clash although she develops romantic feelings for him over time. After rejecting the proposal of Mr. Collins, Tom Hollander, Bennett is angered by Darcy as he encourages Bingley not to marry her sister, an action which frustrates her as Jane is left saddened. When Darcy does admit his feelings she reveals her long held grievances against him and the two argue fiercely but are eventually able to set aside their differences and end up married. Unlike the cold and stuffy Sense and Sensibility (1995) this film gets the warmth of Austen's novels write as the characters are humorous and the film acknowledges the absurdities of Victorian society. The characters here feel like real human beings although Mr. Darcy is a bit of a female fantasy what with his being wealthy and rich and only slightly socially inept. Screenwriter Deborah Moggach retains the bare bones of the novel but updates a lot of the themes and ideas to suit a 2005 audience watching the film. For example, the sisters bicker and fight in this film without using the flowery language present in the novel and add in a bit of elbowing for good measure. While we can trust that this is probably not how young women living during this time period interacted we can also feel comfortable knowing that we understand what their bond is and we are not lost looking up old timey language. For fans of Downton Abbey this may not be acceptable but for audiences less likely to enjoy Maggie Smith reprimanding feisty young upstarts this film caters to their needs. The acting in the film is also understated but rather marvelous as Knightley makes her first foray into period dramas, the genre with which she would become closely associated with. She is a feisty Bennett with fierce intelligence and frustrations with the restrictions that the world around her place upon her but she's not too fiery or angry as she remains as subdued and repressed as you would expect a woman of this time period to be. Blethyn fares well as Mrs. Bennett who is a delight even as she schemes to sell her daughters off while Donald Sutherland is a reliably sage benevolent presence as their loving father. Mcfadyen is decent as Darcy as he and Knightley have a lovely chemistry and he does bring a certain brooding chemistry to the role that Colin Firth did not. The acting is never spectacular but it fits the middle of the road style that the film adopts as it is uniformly pleasant while never blowing you away. If you are looking for originality or inventiveness this is not the film to turn to but if you like fairly traditional costume dramas then this will fulfill your desires. This film also yielded the first of Knightley's two Academy Award nominations and displays why she would be such a dominant force in the genre over the next decade as she looks lovely, has a bright, cheery presence and a surprising talent for comedy. An essential watch for fans of Knightley."
    },
    {
      "rating": "0.5/5",
      "review": "Unfortunately Judi Dench, Brenda Blethyn and Donald Sutherland are miscast. Other than that would be a 5."
    },
    {
      "rating": "2/5",
      "review": "Slow and poor performances from all characters. The original novel contains more passion and excitment than the entire movie."
    },
    {
      "rating": "1/5",
      "review": "This movie was boring. It's old, but it was extremely boring, even for a romance. The characters didn't carry any weight and all the somber tones were over exaggerated. The sisters didn't play a role and most characters could be completely left out and the stoey would be the same. Maybe I just don't see the excellence of the film because I'm a guy."
    },
    {
      "rating": "4.5/5",
      "review": "A very heartfelt and enjoyable period piece, often quite funny, with a comfortable and beautiful atmosphere. I have watched this movie multiple times and always look forward to watching it again."
    },
    {
      "rating": "4/5",
      "review": "A nice period drama, well written, with beautiful photography, a great score and a good performance from Keira Knightley"
    },
    {
      "rating": "5/5",
      "review": "I cry everytime. Beautiful and stunning cinematography."
    },
    {
      "rating": "4/5",
      "review": "Good, but not as good as Colin Firth version"
    },
    {
      "rating": "5/5",
      "review": "Great movie. Kiera Knightley is amazing."
    },
    {
      "rating": "4.5/5",
      "review": "I think the cinematography is really perfect as are the costume and the lines of the actors are really loyal to the book. All reunited and you are truly transported into the story, the era."
    },
    {
      "rating": "5/5",
      "review": "This film may be aa goog remedy to health everybody who are disgusted by love."
    },
    {
      "rating": "5/5",
      "review": "I think Keira Knightley's execution of Elizabeth Bennet was so perfect even Jane Austen would be proud. This movie kept me on the edge of my seat and had me feeling like I had entered an entirely different time."
    },
    {
      "rating": "3.5/5",
      "review": "Pride & Prejudice is everything I expected it to be. Jane Austen stories have this glamorous view of Georgian England, and it is delightful to enter that world for a couple of hours. The extreme amount of propriety displayed by everyone is fascinating, and I enjoy the simplicity of a world where the greatest desire of young people is just a spouse. This particular story is a complex one because there are many sisters involved and their relationships all seem to intersect with one another in some fashion. I’ll admit that I lost track of some of the story, and even found myself looking for a cheat sheet on the internet about halfway through. There are a couple reasons I got confused. First of all, the way they speak using dialogue that is sort of period specific, it can make it hard to understand everything they are saying (and half the time they avoid saying what they are thinking because they don’t want to show any impropriety.) The other problem I had was that I never learned all the women’s names early on. As a result, when they would refer to Jane, Mary, Charlotte, and so forth, I would struggle to follow who they were talking about. At the heart of all this drama is the unlikely pair of Elizabeth Bennet and Mr. Darcy (the two names I absolutely knew.) Keira Knightley is the same radiant beauty I always expect, who lights up the screen every time she is there. I thought she did a wonderful job of showing all the conflicted emotions she was experiencing as the plot unfolds. Even when my brain was struggling with the story, my heart was connected to it because she had me invested. But Matthew Macfadyen was a little bland as Darcy. I kept trying to decipher if this was on purpose because he was playing the character as stoic and emotionally reserved, or if he isn’t that good of an actor. The scenes where he wasn’t holding back what he truly thought made me suspect he might just be a mediocre actor. I simply didn’t believe he was as head-over-heels in love as he said. Even with a lesser performance from the male lead, I enjoyed the primary romance story. There’s something so pleasant about films based on Jane Austen books. I found myself getting swept up in the charm of Pride & Prejudice even when the plot escaped me. I bet if I rewatched it, now that I know what’s happening, I would like it even more."
    },
    {
      "rating": "5/5",
      "review": "My all time favourite movie..."
    },
    {
      "rating": "5/5",
      "review": "This is my favorite romantic movie, I'm not a fan of romantic movies but Pride and Prejudice is the perfect one for me"
    },
    {
      "rating": "1/5",
      "review": "Im disappointed. I came across this movie while trying to find something emotionally romantically satisfying. Time period or not, theres just nothing romantic or emotionally about a bunch of giggly girls being desperately thrown at a bunch of entitled snobs who already get anything they want and then getting married with no quality time spent. There were no real conflicts that kept me interested, i literally fell asleep halfway through and forced myself to finish it the next day hoping i might have just been tired. No real obstacles are keeping them apart up until the end, they knew each others upbringing before they met so that wasnt convincing and the all of these reasons make the romance feal unearned. I looked for suspense but got a bunch of beautiful but pointless shots, and giggling during the moments where i thought things were getting serious. Im a Huge Beauty and The Beast fan so maybe i went wrong by looking for potentially dangerous confrontations, bad guys, and/or real unfolding drama that make the romance that much more gratifying. It may also be that i subconsciously long for a more realistic scenario in todays day in time where the guy has the hardest time finding romance in a world full of beautiful and rejecting superficial woman. As beautiful as the music was, it was entirely too soft and gentle for too long with the piano which kept everything dull. I generally look for a full on beautiful but dynamic orchestra to be the foundation of romantic movies. A good example would be the theme song in an old classic called The Unbrellas of Cherbourg, and even Randy Edelmans scores in movies that have little or no focus on romance but where his scores give me a consistantly satisfying romantic charm throughout his movies (e.g. Kindergarten Cop, The Mask, The Big Green). Cinematography is excellent and Kiera is beautiful, but the movie is entirely too dull and not worth watching a second time."
    },
    {
      "rating": "5/5",
      "review": "Esta película nos demuestra que no es necesario recurrir a cursilerías y empalagosos besos para crear una obra maestra del romance."
    },
    {
      "rating": "5/5",
      "review": "Best book adaptation EVER made of any book. Love it."
    },
    {
      "rating": "5/5",
      "review": "LOVE this movie so much!!"
    },
    {
      "rating": "5/5",
      "review": "I'm obsessed with the tones on films and this one just kills it. such a visually beautiful film."
    },
    {
      "rating": "5/5",
      "review": "Wonderful fantastic amazing"
    },
    {
      "rating": "5/5",
      "review": "God, I love this movie. Just caught this for maybe the twentieth time on Film4.I can't believe it's been 15 years. I'm still baffled as to why Matthew MacFadyen's stellar performance didn't translate into a higher box office profile. Still, he's done alright."
    },
    {
      "rating": "5/5",
      "review": "The best adaptation by far! One of my all-time favourite movies! It captures the romance, wit, intelligence and passion of Jane Austen's classic. I was pleasantly surprised by Macfadyen's performance. He brought out the sensitivity and vulnerability of Mr Darcy. He is so lacking to the task of unravelling his emotions that he really does not know what to do with himself. The despair in Macfadyen's eyes as he attempts to figure out what he can do next to clarify the misunderstandings is so agonizing. The way his voice catches when he actually does talk to her. The man is huge in status and standing but appears meager in her presence. Keira Knightley did a fantastic job in portraying Elizabeth. She shines in this film. The chemistry between the two leads is truly compelling and also great acting by the supporting cast. Amazing music and cinematography. I only wish this movie was much longer!"
    },
    {
      "rating": "4/5",
      "review": "Star power, beautiful setting and costumes combine to overcome a lack of respect for the source material and historical accuracy. In not attempting to be anything other than entertainment the film succeeds on its own terms, capturing much of the spirt of the book."
    },
    {
      "rating": "5/5",
      "review": "One of the best movies ever made! My all time fave!!!! I LOVE this movie!"
    },
    {
      "rating": "5/5",
      "review": "A lovely creation..."
    },
    {
      "rating": "5/5",
      "review": "Fantastic score, cinematography, acting, design, choreography, and writing. True to the amazing book, yet brilliant in its own right."
    },
    {
      "rating": "5/5",
      "review": "My favorite movie. I can watch it over and over and never get bored"
    },
    {
      "rating": "3/5",
      "review": "Proving that sometimes a single 2-hour movie adaptation isn't enough to do a novel justice, Pride & Prejudice ends up being beautifully shot, well-acted but emotionally stunted. I admire the talent involved, and for me Donald Sutherland was the absolute best thing about it. His sense of humour, his ease at shifting between moods, the way he interacts with his onscreen family, I thought he was great. Unfortunately, as becomes quickly apparent, there's a reason this worked better as a 6-part miniseries than as a feature film. The novel is long and complex in its exploration of societal expectations and how a person can be blinded by the words of its title. Darcy's gradual emotional shift is very abrupt, as he jumps from looking down his nose at Elizabeth to expressing his love for her so quickly that it just comes across as rushed and unconvincing. Also Mr. Darcy's expression changes little throughout the film, suggesting either the actor has trouble smiling or the Director told him not too. Also it suffers that problem endemic to films based in England in this time period, in that characters use twice as many words as necessary to say very simple things, such as 'It would be most inappropriate of you to accept such an impertinent invitation' rather than 'No you shouldn't.' It might sound like I'm dogpiling on the film, but it's still a nice watch. It just fails to live up to the standards of its source material, but given the time constraints, it's understandable. And since very few movies live up to the books on which they're based, Pride & Prejudice deserves credit for making the best effort it could."
    },
    {
      "rating": "5/5",
      "review": "LOVE, LOVE. Art, the whole movie is a pure work of PURE ART. From the first dot of ink Jane splotched by hand to the final shot from the movie camera. This movie has amazing music, it fascinates all my friends and always delighting to hear. And even my brothers who are not gay like it and watch it....(they are men and they know it ;) Thanks again Jane and Joe!????"
    },
    {
      "rating": "5/5",
      "review": "best remake of pride and prejudice by far."
    },
    {
      "rating": "5/5",
      "review": "Okay, when this first came out, I was ready to tear it apart because how could they shorten the week long A&E's Pride & Prejudice. I mean, you need at least 5 hours to tell that story. Well, I was wrong! They NAILED it!! in EVERY WAY! The humor, the love story, the performances, the relationships between the characters, and just beautifully shot with superb production and costumes!! Highly recommend! BRAVO!!"
    },
    {
      "rating": "4.5/5",
      "review": "Good for me, that I found Joe Wright's passioning filmography in \"Darkest Hour\". However, after watching \"Pride & Prejudice\" i feel like running the whole world looking for the love of my life. This movie, beside having Keira Knightley giving her best performance ever, which one of the best female ones in History, is a thouth-provoking, beautiful, passioning and romantic ride into the english society, the dangers of pride and prejudice and the evolution of its protagonist's personality. There are few romances like this one!"
    },
    {
      "rating": "5/5",
      "review": "After having just finished the novel, I decided to watch the movie since I’ve never seen it. It was absolutely fantastic and it was so true to the novel! The movie definitely did Jane Austen’s book justice, and I throughly enjoyed it."
    },
    {
      "rating": "4/5",
      "review": "Joe Wright's first full length feature may possess most of the strength of the novel by Jane Austen, or one could arguably presume, and Keira Knightley's performance shines enough to endure, especially along her chemistry with Matthew MacFadyen that makes up for this beautifully filmed and sublimely produced romance, even when its themes resonates considerably out loud with familiarity and corniness, but then again, its production and adaptation values makes up for that for the most part."
    },
    {
      "rating": "5/5",
      "review": "Perfectly cast. Beautiful picture."
    },
    {
      "rating": "5/5",
      "review": "This movie pulls at my heartstrings in all the right ways! Elizabeth and Mr. Darcy’s relationship is fueled with such romance and tension. It is the best part of the movie!"
    },
    {
      "rating": "5/5",
      "review": "Classic, romantic and clean!"
    },
    {
      "rating": "5/5",
      "review": "Definitely the best of all the Pride and Prejudice versions of this film. You really feel like you're there. And that moment when Darcy has been up all night like Elizabeth, and you see him walking towards her in the mist like he's walking towards Hugh. Oh my goodness."
    },
    {
      "rating": "3/5",
      "review": "Puntaje Original: 6.0 Cursi, aburrido, sexista. Lo único que se puede rescatar de esta película es el diseño de vestuario y las imponentes locaciones de filmación."
    },
    {
      "rating": "5/5",
      "review": "Intricate, non mushy gushy love story. Love it"
    },
    {
      "rating": "5/5",
      "review": "Favourite movie of all time, not a single bad thing about it."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie, im in love with every single bit of it!"
    },
    {
      "rating": "4.5/5",
      "review": "A really good adaptation of a really good story. Not too much to say about it; It's just incredibly competent. Also the score is gorgeous."
    },
    {
      "rating": "3.5/5",
      "review": "Watch the Colin Firth version instead, I give that series 4.5 Stars"
    },
    {
      "rating": "0.5/5",
      "review": "fez eu perder uma partida"
    },
    {
      "rating": "1/5",
      "review": "The star is actually for Jane Austen, or rather her contribution in this."
    },
    {
      "rating": "5/5",
      "review": "I read the book, loved it, and still LOVE this portrayal of Pride and Prejudice. The acting is superb, the cinematic elements beautiful, and progress is well-maintained throughout the movie. It's entertaining, sweet, and sigh-inducing."
    },
    {
      "rating": "3.5/5",
      "review": "Loved the cast, production design, cinematography and editing. Some great filmmaking craft and storytelling on display here. Interesting choices by director Joe Wright and going outside the box a bit compared to typical period films like this."
    },
    {
      "rating": "3.5/5",
      "review": "A bit different from the original story, but it's a great movie that interests you in some ways."
    },
    {
      "rating": "5/5",
      "review": "An amazing film with amazing casting. One of the few films which leave the viewer both satisfied yet reflective. Absolutely loved it."
    },
    {
      "rating": "3/5",
      "review": "Boasting a stellar cast Kiera Knightly, Rosamund Pike, Carey Mulligan, Donald Sutherland etc you can't go to wrong with that. The story of head strong Elizabeth who has little interest on marriage & enjoys arguing with Mr. Darcy who doesn't seem that focused on marriage also. Shot beautifully & complimented with terrific score that just takes the film to a deeper level. No doubt this film will largely appeal to female audiences but I still find it interesting & enjoyable."
    },
    {
      "rating": "5/5",
      "review": "Love this movie so much. Keira did a fantastic job.Love. love.love"
    },
    {
      "rating": "3/5",
      "review": "It's hard to deny that this is a really well-made movie, but I just didn't care about the arc at all. Did lots of work to make Talulah Riley look ugly."
    },
    {
      "rating": "3.5/5",
      "review": "This didn't compare to the 1995 BBC 6-hour mini series adaptation, but it's pretty good considering it's in the shorter film format."
    },
    {
      "rating": "3/5",
      "review": "Mediocre adaptation with a lot of pretty faces, which was enough for me."
    },
    {
      "rating": "2/5",
      "review": "decoruri bune. povestea e trasa de par. nu vad chimia intre ei doi. geoffrey rush a jucat bine ."
    },
    {
      "rating": "5/5",
      "review": "Best movie of all time!"
    },
    {
      "rating": "5/5",
      "review": "Hands down one of my favourites!"
    },
    {
      "rating": "3/5",
      "review": "Puntaje Original: 6.0 Cursi, aburrido, sexista. Lo único que se puede rescatar de esta película es el diseño de vestuario y las imponentes locaciones de filmación."
    },
    {
      "rating": "4/5",
      "review": "One of my favorite adaptations I will watch against n and again. The costumes, music, scenery and acting are exceptional. Hollander captured Mr Collins to perfection. Not sure why Southerland held his hand against his mouth at the end. It was as if he was trying to hold his dentures in."
    },
    {
      "rating": "2/5",
      "review": "No, I liked the mini series more than this, this is a very light version and performance from the BBC fine production back at 1955. one thing, here they tried to do a semi- kiss to accelerate the pace a little."
    },
    {
      "rating": "5/5",
      "review": "Keira Knightley deserved the Oscar for this movie, in my humble opinion. One of the few films I can watch over and over again with just as much joy as the first time I saw it in theaters. Breathtaking cinematography and score. A must-see for Austen fans -- even those stubbornly exclaiming the superiority of the 1995 BBC classic"
    },
    {
      "rating": "5/5",
      "review": "It´s my favorite! I´ve watched this thousand times :3"
    },
    {
      "rating": "3/5",
      "review": "Mr. Darcy fever for all woman watcher in the era. Classic cliche romance type ."
    },
    {
      "rating": "4.5/5",
      "review": "what a beautiful movie I have seen! a big surprise but in a very good way.... loved everything about it, Keira knightley carry all the movie, and she does it very well, every minute she appears on screen she is fire....and all the supporiting cast is outstanding too. this is a love story with such an elegant script and wonderful sets, every shot you see, you have a feeling you are watching something beautiful. I didn´t think I was going to like this one as I do, but it did it. highly recommended for everyone who love period and love movies."
    },
    {
      "rating": "5/5",
      "review": "Best Movie Ever!!??????"
    },
    {
      "rating": "5/5",
      "review": "One of the best romances! Beautifully done and very much alike the book. Great performances by Keira Knightley and Matthew MacFadyen."
    },
    {
      "rating": "4.5/5",
      "review": "Languistically magical"
    },
    {
      "rating": "5/5",
      "review": "Quite possibly my favorite film of all time. Raised the stakes on what I expect from films of this nature and caused me to fall deeply in love with Keira Knightly. I will sit and watch this movie any time of any day ever, it never grows old and if it plays on television I will sit through the entire film. Can't. Express. My. Love. Enough. IT'S THE BEST."
    },
    {
      "rating": "4.5/5",
      "review": "Pride and Prejudice is a excellent modern adaptation to Jane Austen novel. Great acting, its fresh, and its enjoyable."
    },
    {
      "rating": "4/5",
      "review": "I love this movie and find it completely engaging. What a wonderful cast though Mr & Mrs Bennett steal the limelight of any scene they are in"
    },
    {
      "rating": "5/5",
      "review": "probably the best film adapted from Jane Austen's novel."
    },
    {
      "rating": "5/5",
      "review": "Watched it a million times - one of my all-time favorites!!!"
    },
    {
      "rating": "3/5",
      "review": "OK Go see the PBS Colin Firth version, longer and way better"
    },
    {
      "rating": "3.5/5",
      "review": "The film is nice, the story is really good and Keira Knightley delivered an excellent performance. However, it is absolutely not as good as the mini series starring Colin Firth. The mini series is way way better than this. Mr. Darcy in this version does not match at all to Colin Firth's performance. Actually the only performance that matched up to the mini series was Keira's. Whoever seen this movie and have not seen the mini series should go and watch it now. This gets 70/100 from me while the mini series gets nothing less than a 90/100"
    },
    {
      "rating": "4/5",
      "review": "romantic drama at its best <3 so perfectly redundant and presented character. the ending was quite a twist. every character had a role to play. You can't image the movie without any 1 character. pleasant movie I would say. very. stage setup was very clean, precise. England from 1800's I presume... in all, the movie was very conventional. it was a happy movie to have seen."
    },
    {
      "rating": "3/5",
      "review": "Finally bit the bullet and watched this movie. The '95 miniseries is one of my favorites, so this had a great deal to live up to. It was admirably filmed and acted, but the condensed plot left the end feeling rushed and a bit too close to a deus ex machina, which hurt the story."
    },
    {
      "rating": "5/5",
      "review": "It's a well-known tale from Jane Austen back in the early 19th century. In a society where the only thing anybody seems to think about is finding a good suitor for his or her children, Mr. and Mrs. Bennet are busy with five daughters to stress about. Lucky for them, one of their five, Lizzie (Keira Knightley), has a good enough grasp on her own independence to figure things out for herself. If you can understand the British lilt accompanying the archaic repartee used throughout much of this film, then more power to you. Luckily, it doesn't hinder my ability to comprehend the main story, but the problem lies in the lighthearted banter that picks up the mood between dramatic ambits. Some things may get lost in translation, but it gets its point across. Matthew MacFadyen does well as the famed Mr. Darcy. When you first see him on screen, he's so cold that you have no idea how that man is capable of love of any kind. He and Knightley's chemistry grows as their characters' does. Lizzie, being from a more middle-class family, and Mr. Darcy, a wealthy personage of significance, have unspoken tensions and reservations about each other regarding financial status. And obviously, the point is that we should look past superficial attraction and at true character. However, this is derailed a bit as director Joe Wright's order of things gives us some reason to believe that Lizzie could, in fact, be falling in love with Mr. Darcy for those exact reasons. I assure you, this is far from Austen's original intent. Nonetheless, this 2005 adaptation means well and is a classic piece of modern cinema. It may not be my first choice of drama to watch on any given day, but the impressive performances by the whole cast, along with the very consistent pacing make for an enjoyable watch. The beautiful scenery and set pieces are a plus, providing a pleasurable watch all the way to the end. Twizard Rating: 96"
    },
    {
      "rating": "2/5",
      "review": "The landscape shots are breathtaking, and the score is beautiful. That is where the worthiness of Austen ends. Rumpled clothes,bare feet, loose ratty hair, and farm animals in the house are not Austen. Elizabeth Bennet was feisty, not bipolar. The film's attempt to cram this rich story into a commercial-length film -- and appeal to non-Austen readers -- resulted in sudden, inexplicable character turns. I felt that both leading roles were excruciatingly miscast. (Although I have enjoyed them in other films.) And Donald Sutherland -- an actor whose work I have much admired in the past -- turned in one of the most humorless performances I have witnessed on film. Austen was anything but humorless. But the engagement announcement scene between Mr. Bennet and Elizabeth was excruciating to watch, more befitting a man having a nervous breakdown than one sharing joy with his most beloved daughter. I have seen many Austen movies -- both the costume-drama ilk and the modern adaptations and enjoyed them immensely. It seems to me that this particular production suffered an identity crisis in trying to adapt Austen whilst leaving Austen out of it almost entirely."
    },
    {
      "rating": "4/5",
      "review": "A very British movie whose only minor weakness is its typical British movie pacing, Pride and Prejudice succeeds in all other aspects: its dedicated acting, tight and surprisingly humorous script, gorgeous art direction, impressive cinematography, and beautiful musical score. Surprising lack of zombies, though."
    },
    {
      "rating": "4/5",
      "review": "I thought this was going to be boring and instead it turned out pretty entertaining.getting ready for the zombie version."
    },
    {
      "rating": "5/5",
      "review": "I really thought I was going hate this movie. I hate period pieces about the 1800's because they're usually cliche and boring. I didn't really enjoy the book either. This movie completely surprised me. The colors used in this movie very brilliantly express the feelings of the scene and the movie itself is a pleasure just to look at. The acting is superb and Keira Knightley has a stunning performance. You quickly get caught up in the activities of these complex sisters, each ones personality more intricate than the next. Overall, I enjoyed the movie from start to finish."
    },
    {
      "rating": "5/5",
      "review": "Probably one of my top fifteen or so favorite films."
    },
    {
      "rating": "4.5/5",
      "review": "My 'Man Card' will be returned once I leave this review. I loved it. Historically authentic-looking, beautifully shot, great costumes. Kiera Knightley beams wit and charm. Well cast all-around. A squeezed plot, but it didn't seem rushed. Great emotional character builds. It would be hard to pull off this book adaptation any better. 4.25/5"
    },
    {
      "rating": "5/5",
      "review": "So so romantic and beautiful. The colours and music and landscaping were all wonderfully pleasant and fitting. The actors and actresses were absolutely perfect and talented and each portrayed their characters brilliantly! A truly magnificent adaptation of the equally magnificent novel. I am in love with it and the ending of this version was sigh worthy and swoon worthy."
    },
    {
      "rating": "4/5",
      "review": "A well done adaptation that concisely crams Austen's wordy novel into an enjoyable 2 hours, with scenic filming (I do love camera flare!) and solid performances. Everyone is very true to character, which is cause for hilarity, embarrassment (oh Mrs. Bennet), and affection - rather like spending time with one's own family!"
    },
    {
      "rating": "5/5",
      "review": "One of my favorite movies! Love the romance and the witty bantering."
    },
    {
      "rating": "3.5/5",
      "review": "Finally sat down to watch this film. Did not have high expectations, I mean it is Jane Austen classic and as most classics, there is a great chance that the film will be slow. I am glad that I went over the plot before I watched it as I think I might have been a bit mixed up. All these characters going to various balls, sitting, drinking tea, taking walks and visiting relatives/friends and through it all, the main thread is that all the ladies are trying to get a husband. Terribly exciting and all that. In the end it is all a bit like soap opera, he said this to her and so she believed and so assumes this, but really it is that and so on and etc. As a film it is really nicely done. Cinematography, decor/props and the costumes are great. Good acting too. I think it worked well as a period piece."
    },
    {
      "rating": "5/5",
      "review": "THE BEST MOVIE I EVER WATCHED!! And the most romantic one, I could watch it million times more and it's my favorite movie!"
    },
    {
      "rating": "5/5",
      "review": "My favorite all time movie. Perfect!"
    },
    {
      "rating": "3.5/5",
      "review": "Ok as a movie, but it's a meddled and messy 'version' of 'Pride & Prejudice' that I thought insulting to Jane Austen's work. It felt that many of the actors were half-hearted in their performances - I especially didn't like Keira's Elizabeth & the historical inaccuracies were cringeworthy. Wouldn't bother to watch again. I still love the BBC's 1995 version with Colin Firth, but of course, there is nothing like the book itself."
    },
    {
      "rating": "5/5",
      "review": "One of my favourite adaptations ever. It's truly a beautiful film all around."
    },
    {
      "rating": "5/5",
      "review": "best love story next to Beauty and the Beast"
    },
    {
      "rating": "3/5",
      "review": "Pride & Prejudice may drag at times, but it was, overall, surprisingly entertaining."
    },
    {
      "rating": "3.5/5",
      "review": "Continuing my watching of movie adaptations of classic novels (after seeing The Great Gatsby), this movie does a good job of capturing the romance of Jane Austen's novel. It starts out a little wobbly, but I think it gets better as it focuses more on Elizabeth and Mr. Darcy and less on the other characters. It's not that the other characters are boring - there is a really great cast here. But the relationship between the two leads is the heart of the novel and that's what draws you in. I've never been a big fan of Keira Knightley but she's in her wheelhouse here."
    },
    {
      "rating": "5/5",
      "review": "One of my favorite movies of the year. You may be tired of Pride and Prejudice, but it's excellently adapted here. The cast and costumes are stupendous, it's passionately directed by Joe Wright, and the romance is lovely. Everything about the movie is lovely! A timeless classic."
    },
    {
      "rating": "4/5",
      "review": "Not as deeply delightful as the book but still quite a good adaptation. Keira Knightly as Elizabeth Bennet is on point."
    },
    {
      "rating": "4.5/5",
      "review": "I've never understood the distaste for this adaptation. I think it holds pretty damn true to the novel, and does it justice quite nicely. Supreme acting lineup without the usual disappointment that accompanies it."
    },
    {
      "rating": "2/5",
      "review": "Just not my type of movie. I agree with a previous reviewer in my opinion of the way women were treated during that time period. It's just depressing how they were basically required and expected to marry by a certain age and getting married was essentially the only path they could possibly take as well as the only thing that mattered to their families. Plus I have just never really liked the story of Pride and Prejudice in the first place. I always lose track of what is going on and who is marrying who, nor do I find myself caring. I know people say you need to have read the book or need to watch the film at least twice to fully appreciate it but honestly a -really- good movie should reel me in on the first viewing, without any prior knowledge of the content or familiarity with source material. That said, Keira's performance as the main protagonist is pretty stellar. She fits the role perfectly."
    },
    {
      "rating": "5/5",
      "review": "I absolutely adore this movie"
    },
    {
      "rating": "4.5/5",
      "review": "love it, I have watched it a lot and continue to watch it a lot more. the sets, the actors and actresses are perfect for their parts. due to this movie I have seen a few more of this leading lady's movies. the duchess was just as good if not better."
    },
    {
      "rating": "1/5",
      "review": "Dreadful if you are a fan of the novel. This was like it was based off of the poorly written cliff notes. The acting was not good, especially Mr Dacy and all the male characters. Kiera Knightly was ok. The cinematography was very good though. The actual novel and the BBC mini series are both a thousand times better."
    },
    {
      "rating": "5/5",
      "review": "Mi pelÃ­cula romÃ¡ntica favorita para siempre, he perdido la cuenta de todas las veces que la he visto."
    },
    {
      "rating": "3.5/5",
      "review": "I wasn't sure if I was going to like this movie, since these period pieces usually don't do much for me, but I wound up really enjoying it to the point it is still lingering with me. The cast is great and chemistry is top notch. Now I actually want to read the book..."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie because of the building up to love. We all have some pride and have been fools and been wrong in love. I relate to Jane Austen's character Elizabeth in so many ways and understand the stoic way of Darcy which is often misunderstood. Men are different then women in their expression and I like it that way, some things take time and with these two in this movie the tension and build up was something else. All the Bennet sisters and the entire story was superbly done, I have to admit I have watched this on those nights when i want to clear my head of what is going on today and everything else. P&P has the ability to take you away from what is going on, your troubles or stress for a couple hours and just leaves me always feeling a sense of hope where love is concerned."
    },
    {
      "rating": "3.5/5",
      "review": "The popular story gets a beautiful interpretation of the two strong characters. Enjoyable and sensible and romantic and full of Englishness in terms of picturesque sceneries, just beautiful"
    },
    {
      "rating": "5/5",
      "review": "Probably one of the most beautiful films you'll ever lay your eyes on."
    },
    {
      "rating": "4/5",
      "review": "Not the best adaptation of Jane Austen's best loved masterpiece, but beautifully shot and acted. The most unbelievable part was that Keira Knightley could ever be thought only tolerably attractive."
    },
    {
      "rating": "4.5/5",
      "review": "Pride and Prejudice was an excellent adaption to the novel by Jane Austen. It had no major changes from the novel as most novel to movies do, only a few small differences. The plot is very good and the producers were able to fit the entire book in two hours. Personally I believe that this is the best version of Pride and Prejudice, both in the actors and the set. I would recommend anyone who loves classic literature and romance to watch this."
    },
    {
      "rating": "5/5",
      "review": "my favorite movie of all time. alone and tired in miami i could not take my eyes off elizabeth aka mrs darcey wow!!!!"
    },
    {
      "rating": "4.5/5",
      "review": "OK I'll buy. This was very well done. Mr. Darcy, those eyes....I swoon! Donald Sutherland perfect."
    },
    {
      "rating": "4.5/5",
      "review": "Somehow I'd never seen this movie, despite my love of period films! So good. Kiera Knightley is absolutely perfect, as is Matthew MacFadyen as Mr. Darcy. The suspense and delayed gratification build nicely throughout the movie, with such a sweet and satisfying climatic reward at the end."
    },
    {
      "rating": "4.5/5",
      "review": "Joe Wright nails the period setting and finds two leads worthy of their roles. Full review later."
    },
    {
      "rating": "5/5",
      "review": "To say that I'm obsessed with this film is a massive understatement. I watch it every month, maybe even twice a month. They've done a true-to-the-book adaptation before at BBC, so to me this was a really welcome, modern take on the story. Absolutely divine fun."
    },
    {
      "rating": "5/5",
      "review": "Incredible performances by all. Beautiful."
    },
    {
      "rating": "4/5",
      "review": "Countless times I have watched this film and it never loses its magic and charm. The love of a 19th century english upperclass man is every woman's dream."
    },
    {
      "rating": "1/5",
      "review": "The directing was exceptionally poor."
    },
    {
      "rating": "4.5/5",
      "review": "http://filmreviewsnsuch.blogspot.com/2015/01/pride-prejudice.html"
    },
    {
      "rating": "2.5/5",
      "review": "Overrated as I suspected. Resembled Wuthering Heights and Persuasion more than P&P. Just no comparison to the novel and the BBC version."
    },
    {
      "rating": "5/5",
      "review": "I read the book years ago in college so I don't remember as much to be able to say if this is a very accurate film adaption, but whether it is or not, it is still a great film. From the cinematography to the acting and casting, I very much enjoyed it."
    },
    {
      "rating": "3/5",
      "review": "BBC version is much better"
    },
    {
      "rating": "4.5/5",
      "review": "I must have watched this a hundred times."
    },
    {
      "rating": "3/5",
      "review": "Lengthy and drawn out. Story entirely emotional."
    },
    {
      "rating": "5/5",
      "review": "I have been obsessed with this film for several years. It's the best adaptation yet. Even though I own it, I still watch it on HBO because I know I am sharing the experience with other viewers. The cinematography is incredible. I don't know why but in several scenes, I am reminded of Gainsborough paintings. The chemistry between Keira and Matthew is what has me hooked."
    },
    {
      "rating": "5/5",
      "review": "So romantic! My favoriteð??­"
    },
    {
      "rating": "5/5",
      "review": "Absolutely the best Pride and Prejudice version out there. I have watched it many, many times and each time I feel as delighted as if I am watching it for the first time. The acting is amazing and, perhaps, is only surpassed by the directing and the script. I could feel the emotions right along with the characters. The movie made me a fan of both Keira Knightley and Matthew MacFadyen for all time. Love it!"
    },
    {
      "rating": "4/5",
      "review": "Love me some romance movies...love this one...hmmmm : love, seriously though, reallllllyyyy enjoyed this one, every actor is amazing, and I believed in the story that was unfolding in front of me the whole time, goods."
    },
    {
      "rating": "5/5",
      "review": "Keira Knightley, as always, is extra-special in this period piece; it is like she was born to star in these vehicles. Matthew MacFadyen does well with the difficult role of Darcy. The love story is believable and touching. One of the best adaptations of an Austen novel I've seen."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie! It was very loyal to the book."
    },
    {
      "rating": "5/5",
      "review": "mcfadden is so great as Mr Darcy"
    },
    {
      "rating": "3/5",
      "review": "9/22/14 This is a typical Jane Austen romance film. Not a lot happens, just a lot of people walking around being \"proper\". I always have trouble with this type of film because I don't pay close enough attention to the characters names. So, when they mention someone, I'm always thinking, \"who was that again?\". Anyway, it isn't a bad film, just a fairly typical story."
    },
    {
      "rating": "3.5/5",
      "review": "Beautifully shot and designed, and some great casting and performances, especially Dench, Macfadyen, Blethyn, Pike, Riley, Malone, Mulligan, and Woods. Sadly this piece isn't without its faults though. Maybe I'm too attached to both the book and the '95 BBC mini-series (although this movie has the advantage of being less neat-and-tidy and more grittily 19th-century real), and perhaps it was a lot of material to cram into two hours, but time wasn't really taken to establish Lizzie's considerable smarts nor her relationship with her father, and these were strangely sacrificed for time spent on some vaguely arty shots that might have been cool if they weren't a little reminiscent of similar shots from the Twilight movies. Knightley seemed to warm into the role only mid-way through, and Sutherland mumbled through the movie (in his imperfect accent) only to capture the drily acerbic yet deeply caring Mr Bennet way too late."
    },
    {
      "rating": "3.5/5",
      "review": "Keira is amazing! And I'm reading the book."
    },
    {
      "rating": "5/5",
      "review": "Lovely, one of my favorite movies! I highly recommend it if you like period dramas created from novels!"
    },
    {
      "rating": "5/5",
      "review": "With a fantastic screenplay, captivating cinematography, and a magnificent cast, Pride and Prejudice is certainly one of the finest films I have ever seen."
    },
    {
      "rating": "4/5",
      "review": "Just tried to view it through the lens of a romance movie and not how horrid it would be if your life's main objective was to find a man to marry."
    },
    {
      "rating": "4.5/5",
      "review": "This was a wonderful remake of the timeless romance between Elizabeth Bennett and Mr. Darcy. The scenery and landscapes were breathtaking and the love story remains forever captivating. The male and female leads did a wonderfully convincing job at demonstrating both their hatred and their love for one another and although the movie is over 2 hours, you don't realize it! If anything, I didn't want it to end! Keira Knightly is right at home in this role and I honestly loved this film."
    },
    {
      "rating": "5/5",
      "review": "So good!! I don't know what it is that makes P&P so beloved, but it deserves the love."
    },
    {
      "rating": "5/5",
      "review": "Exquisitely well written and acted, along with a beautiful score to accompany it, 'Pride and Prejudice' is sure to enthrall and entertain the majority of audiences; even those who don't take romantic films too much to their liking."
    },
    {
      "rating": "5/5",
      "review": "Best movie ever! If you like a good love story, this is a must watch."
    },
    {
      "rating": "2.5/5",
      "review": "Not a huge Jane Austen fan (call me crazy, but nothing in these stories really strikes me as romantic), but Keira Knightly does shine here..."
    },
    {
      "rating": "4/5",
      "review": "A beautiful film. I enjoyed every moment and I think anyone who fancies a relaxing evening will enjoy this."
    },
    {
      "rating": "5/5",
      "review": "So good I watch this movie 8 times in 4 days I love every thing in it <3"
    },
    {
      "rating": "5/5",
      "review": "Such a powerful & romantic film. Jane Austin is my literature idol. This woman was so brilliant. She gave us in-depth, emotional & beautiful stories, which were all captured perfectly in film with the right actors of course. There's nothing more satisfying than reading a novel & watching the film that stays true to the actual story. Book lovers like myself truly appreciate that."
    },
    {
      "rating": "4/5",
      "review": "A very good book.. I MEAN MOVIE! Even though it's not the kind of movie i'd normally watch, \"Pride and Prejudice\" is very well-shot and has a surprisingly enjoyable love story."
    },
    {
      "rating": "4.5/5",
      "review": "Truly one of Keira Knightly's best performances (which may arguably be her most recent collaboration with Joe Wright that being Anna Karenina). In addition Wright's direction and stylistic tone are a key element that is breathed in to this mysterious and intriguing story that may otherwise could have been a boring period piece."
    },
    {
      "rating": "4/5",
      "review": "For what it is, it's solid. As an aside, it has a great score."
    },
    {
      "rating": "5/5",
      "review": "Mesmo se sustentando em uma trama basicamente previsível e já clichê, revela-se como um trabalho bastante gracioso, sensível, envolvente e belo - e para tanto contamos com diálogos afiados, excelente elenco (Keira Knigthley maravilhosa), trilha sonora evocativa e a habilidosa e divertida câmera de Joe Wright (ênfase óbvia para os elegantes e impertinentes planos-sequência!)."
    },
    {
      "rating": "2.5/5",
      "review": "Beautifully made, but Keira Knightley was just not right for this movie."
    },
    {
      "rating": "5/5",
      "review": "The best movie ever â?¤"
    },
    {
      "rating": "5/5",
      "review": "This movie makes me swoon."
    },
    {
      "rating": "5/5",
      "review": "Love the book, and love the movie. I like how Joe Wright, took Jane Austen's iconic novel and turned it into this fantastic movie. Also, Keira and Matthew did an excellent job of bringing life to Elizabeth, and Mr. Darcy."
    },
    {
      "rating": "2/5",
      "review": "I'm giving this a two out of five purely based on the film's visual style and performances. I loathe Jane Austen's \"Pride and Prejudice\" novel impassively--although the language is beautiful, the characters are wooden and the situations are uninteresting and have no legitimate conflicts. This movie seems pretty faithful to the general tone of the novel, but it wouldn't have hurt them to make characters such as Elizabeth and Mr Darcy more interesting. Keira Knightly is okay, as is the supporting cast, with Donald Sutherland's hilarious performance being my particular favorite. I will praise this film especially for its beautiful landscapes and intricate sets, as well as it's cinematography and period soundtrack. It's a well-made film, I am just not its intended audience."
    },
    {
      "rating": "4/5",
      "review": "Pride and Prejudice is a gorgeous and well-acted adaptation. Kieras cat like smile was really beautiful :)"
    },
    {
      "rating": "3.5/5",
      "review": "The editing of the movie makes sense, as it has to be shorted based on the original novel. I immediately re-read the novel after this movie, and found they modified closest to the novel which i like most. The actors and actresses also awesome in presenting the story. A good one!"
    },
    {
      "rating": "5/5",
      "review": "A great movie. This movie shows how we can misjudge people based on money. Character is what matters. In our day and time this lesson is so vital. To not hate or love someone based on their possessions or lack there of, but rather love them because of their character."
    },
    {
      "rating": "4.5/5",
      "review": "Women's life of the time is interesting."
    },
    {
      "rating": "5/5",
      "review": "Undeniably the best Austen adaptation ever. It's got life brought to screen with stellar performances from the cast, especially the bubbling-with-energy Keira Knightley, haunting music, gorgeous costumes, sets and cinematography and of course- the electrifying chemistry between the leads. Keira has never looked more beautiful and it seemed like she was playing herself, her Oscar-nominated acting was so natural. It has got the key point of the novel that the yawn-worthy '95 mini-series lacked- life."
    },
    {
      "rating": "5/5",
      "review": "I absolutely LOVE this film. It is one of my old-time favorites!"
    },
    {
      "rating": "3.5/5",
      "review": "Not necessarily my type of movie but the combination of Jane Austin's great story and the wonderful acting by the cast makes for a movie that most will enjoy!"
    },
    {
      "rating": "4.5/5",
      "review": "I pride myself on having read the novel and loving it, and so i believe I am a little prejudiced at this moment. (See what i did there?)"
    },
    {
      "rating": "4/5",
      "review": "Though the film is adjusted a century back from the novel, Pride & Prejudice is far more invested in emotional authenticity, delightful and engaging in every moment."
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing!!!!!"
    },
    {
      "rating": "4/5",
      "review": "People who go for this sort of thing will find Pride and Prejudice exactly the sort of thing that they go for. People who don't go for this sort of thing will get exactly the sort of thing they expect - and yet there's a very good chance that they'll still find some enjoyment in Pride and Prejudice. Transcending beyond the assumed audience is key for a movie like this. Because lets be honest, a (somewhat) stuffy 18th century drama about love between two levels of the British class system is not something that would tickle the fancy of most male moviegoers. And yet this movie, at least for me, was entirely enjoyable and far better than most films of similar ilk. And I guess the movie has Jane Austen to thank for that. I was required to read the 1813 novel (that this movie is an adaption of ... bet you couldn't have figured that one out) this year for school. What started out as a requirement quickly turned into something genuinely enjoyable, much to my chagrin. My preconceived notion of the book turned out to be completely false. In its place, I found a witty, sarcastic, endearing, and engrossing novel that brought me to the realization that, \"maybe this book is popular for a reason.\" I really enjoyed Pride and Prejudice. And yet, going into this movie, I had the same expectations. Sure, by that point I knew that the director, Joe Wright, had great source material to work with. But than the classic question arose, \"how can they adapt a book that's three or four hundred pages long into a two hour movie?\" I twice doubted this story, and I was twice proven wrong. I'm still not quite sure how the filmmakers were able to cram so much into this movie, but I can't deny that they do. It's a streamlined version, but everything that was significant in the novel is brought successfully onto the screen. I really enjoyed Pride and Prejudice yet again! The story revolves around Elizabeth and Jane Bennet, and their relationships with Charles Bingley and his friend, Mr. Darcy. Elizabeth and Jane are charming individuals, but they live below the upper class. Bingley and Darcy are rich, and the latter gives off a distinct aura of contemptibility. The story masterfully intertwines a couple of different interpersonal relationships. As I mentioned before, screenwriter Deborah Moggach and director Joe Wright do an exceptional job of condensing are rather large book into a concise and digestible movie. Because the vast majority of the book is just conversations, you can tell that Wright made the conscious effort to add interesting aspects to these scenes of dialogue. For instance, in the classic first marriage proposal scene between Elizabeth and Darcy - Wright moves the action from simply inside a house in broad daylight, to rain and overcast skies, outside, under a beautiful stone gazebo. It's little tweaks like this that add a certain level of freshness to this well-known story. Wright also uses very slight zoom-ins during scenes of dialogue. They feel a bit weird, but they do bring focus to important parts of scenes. I'm guessing that was his aim. In addition, the cinematography present here turns simple shots into things of beauty. The performances in this movie are spot-on, and casting in this movie is pitch perfect! I'm not just talking Keira Knightley and Matthew Macfadyen (who are both fantastic!). No, the filmmakers here are totally in tuned with each and every character. Starting at the top, Keira Knightley was worthily awarded an Academy Award nomination for her performance as Lizzy Bennet. It's not really out of her range to play a classical character like this - she's done it many a time - but she is, nonetheless, very good. Matthew Macfadyen is not only playing a fantastic character, but he's also playing him fantastically well. While both Darcy and Elizabeth have unique character arcs throughout the story, I think Darcy's is the more difficult task to pull off. And Macfadyen is up to the challenge. He can be thoroughly unlikable at times, but the good heart of the character manages to shine through as the movie progresses. In casting Elizabeth's sisters, Joe Wright seemed to have had a knack for plucking talented actresses before their careers took off. Lydia and Kitty are played by Jena Malone and Carey Mulligan. Long before Malone started lighting up the screen as Johanna Mason in The Hunger Games, she was totally embodying the frivolous and shallow Lydia Bennet. And long before Mulligan was playing Daisy opposite Leonardo DiCaprio's Jay Gatsby, she was making her film debut as Kitty. Rosamund Pike is given perhaps the most uninteresting character in the movie. In both the book and the movie, Jane is 100% good natured throughout the entire duration. Still, Pike does what she can with the material. The Bennet parents are both played to the hilt, but in different ways. Brenda Blethyn is disgustingly shallow as Mrs. Bennet ... exactly as she was in the book. And playing my favorite character in the movie, Mr. Bennet, Donald Sutherland does what he always does. He's such a phenomenal actor, and Mr. Bennet is such a funny character. He definitely has the funniest lines in the movie! In addition, Tom Hollander, Judi Dench, and Kelly Reilly are all perfectly cast in supporting roles. Dario Marianelli's score rises above the genre standard for classical scores for historical movies. It's become one of the most iconic things about the film. His theme for piano that often crops up, played by the actors on screen, is excellent. The score is well worthy of the Oscar nomination it received. Sometimes, low expectations can be a movie's best friend. Sometimes, being thoroughly well made can propel a movie beyond one or two shortcomings. And sometimes, a movie that fits squarely into the last genre in the world that would appeal to this reviewer, actually turns out to be a great film! \"Well, if Jane does die, it will be a comfort to know she was in pursuit of Mr. Bingley.\" 8/10"
    },
    {
      "rating": "5/5",
      "review": "As good as romance gets. Jane Austin, you did it right."
    },
    {
      "rating": "5/5",
      "review": "Just love this movie and Jane Austen."
    },
    {
      "rating": "3.5/5",
      "review": "Well-paced interpretation of the book."
    },
    {
      "rating": "3.5/5",
      "review": "Lavish it may be, but dreadful it is not, the 2005 Pride and Prejudice feels quite drawn out and standard, even if it is only two hours long, and many of its characters and subplots drop out and in willy nilly. Still, Joe Wright's adaptation is smoothly shot, well acted, and stylish in every department, meaning it can still be worth a viewer's time if he or she so desires."
    },
    {
      "rating": "4.5/5",
      "review": "Fantastic and brilliant! In my top favorites list! Excellent acting and storyline kept my interest... will they or won't they?"
    },
    {
      "rating": "2.5/5",
      "review": "lovely movie i love that era .."
    },
    {
      "rating": "4.5/5",
      "review": "I'm very fond of the pacing and the music in this movie; it's a movie that I've watched a number of times, and it never fails to draw me in. I feel like I fall in love with the characters all over again, every time I watch it."
    },
    {
      "rating": "5/5",
      "review": "Score is beautiful. This movie is a wonderful adaptation. The ending was not my favorite but this movie has so much that is can easily fall into one of my top ten favorite movies of all time. Jane Austen would be proud."
    },
    {
      "rating": "5/5",
      "review": "Elizabeth's wit, Mr. Darcy's pride, and the Bennets' ridiculousness all fit so perfectly into this adaptation of the book Pride and Prejudice."
    },
    {
      "rating": "4/5",
      "review": "Classic. Beautiful. Well-acted. I could just watch it over and over again :)"
    },
    {
      "rating": "4.5/5",
      "review": "Loved this movie! Especially the ending. Definitely a film I will never tire of watching over and over."
    },
    {
      "rating": "4/5",
      "review": "A very engaging adaptation which is beautifully crafted and very well acted."
    },
    {
      "rating": "0.5/5",
      "review": "Just watch the BBC version with Colin Firth - it's a FAR superior version of Pride and Prejudice to this one."
    },
    {
      "rating": "5/5",
      "review": "This story is wonderful in any format I have yet to see. This is my second favorite version but with that said, it is still wonderful."
    },
    {
      "rating": "3.5/5",
      "review": "Eehmmm... a ver, estoy sumergida en este universo Austeniano desde hace unos días, y todavía no termino de decidir si me cautiva o me exaspera. No es exactamente fiel al libro (creo que no podría por una cuestión de tiempos), y hay personajes que están casteados tremendamente mal (para mi). Sin embargo, por momentos me gustó más la película que el libro. #ListoLoDije, vengan de a uno."
    },
    {
      "rating": "5/5",
      "review": "The evil Mr Wickham and the truly distant Mr Darcy. Great cast Sutherland Knightly and Friend are great. Plus the movie is shot incredibly."
    },
    {
      "rating": "4.5/5",
      "review": "Majestically mounted, and cleverly, freshly written, Joe Wright's Pride and Prejudice is an unabashedly romantic, sweet adaptation of Jane Austen's classic that allows itself to be fresh thanks to Wright's authentic sensibility that is lacking in several classic adaptations, beautiful visuals and costume design, Dario Marienelli's score, and a perfectly chosen cast, leaded by the delightful Keira Knightley."
    },
    {
      "rating": "4/5",
      "review": "Finally an original, genuinely well madr adaptation of \"Pride and Prejudice.\" The performances are fantastic, the directing is sharp and sure of itself, and the cinematography was extremely well orchestrated and visually masterful! A phenomenal film!"
    },
    {
      "rating": "2/5",
      "review": "I hated the mr. Darcy in this version and couldn't buy into the romance they were selling though I wanted to going into it."
    },
    {
      "rating": "5/5",
      "review": "Just perfect, just Austen. Great actors, great adaptation and great picture. This movie is a must to see where feelings are perfectly described with the way of looking."
    },
    {
      "rating": "5/5",
      "review": "Beautifully crafted!"
    },
    {
      "rating": "3/5",
      "review": "My favorite will always be the BBC Version - but this was not a bad shorter version for people who want to learn the story."
    },
    {
      "rating": "5/5",
      "review": "This movie is the perfect, innocent yet powerfully romantic. It is witty and satisfying. It is every girl's dream of romance. :)"
    },
    {
      "rating": "4/5",
      "review": "Good adaptation and performances from Knightley and MacFayden."
    },
    {
      "rating": "4/5",
      "review": "In some regards, it's a complete and utter miss that is not Jane Austen's Pride and Prejudice. But the cinematography, the acting, and the score bring enough moments of gold to make a successful film."
    },
    {
      "rating": "4/5",
      "review": "Deligjtful British period drama based on the Jane Austen novel that focuses much of its attention to the sexual tension in elegance and charm. Knightley and Macfayden share great chemistry, and art direction is magnificent."
    },
    {
      "rating": "2/5",
      "review": "How disappointing. For many P&P lovers the language of the story and the time period is one of the vessels that made Jane Austin's wit and bite so subtle and potent. This version seems to disregard the preserved beauty of that story feature in favor of more obvious, blunt tools. It killed some scenes I was literally holding my breath to see. Knightley and MacFadyen have serious talent but they aren't buyable in these roles (in part maybe due to the script) or as having the passionate push and pull with each other that is so key to this love story. The rest of the cast portrays their characters spot on, Blethyn, Pike Sutherland, Dench, Friend, Malone, Reilly, Hollander--great! I honestly keep trying to watch it again thinking I must have been mistaken but I can't even finish it."
    },
    {
      "rating": "4.5/5",
      "review": "Are you kidding? Victorian England? English countryside? Keira Knightley's awesome tooth acting? Seriously, watch her teeth next time. Proclamations of undying love in the rain? Sign me up!!"
    },
    {
      "rating": "5/5",
      "review": "I know it is not the most faithful adaptation, but I LOVE this movie! I love Matthew MacFadyen as Mr. Darcy. & his chemistry with Keira Knightly is fabulous. I have watched it over, and over again, and I never get tired of it. (Though sometimes I go back to the scene of them in the morning with the sun shining through their profiles, because I love tat scene & it is way better than the final scene.) Great \"Movie to stitch to.\""
    },
    {
      "rating": "5/5",
      "review": "Music fantastic, Very detailed, love it."
    },
    {
      "rating": "3/5",
      "review": "how do i get to watch the dam movie"
    },
    {
      "rating": "5/5",
      "review": "love strong lady's standing for what they believe"
    },
    {
      "rating": "3.5/5",
      "review": "Fair film, unconvincing leads."
    },
    {
      "rating": "4.5/5",
      "review": "I have watched this movie many times over and over again. I truly love watching Keira Knightly potray Elizabeth Bennett and Mathew Macfadyen was a dream to see, especially in the coming together scene in the early morning light. It still brings a huge smile to my face. Love, love, love this movie!!!"
    },
    {
      "rating": "4/5",
      "review": "Perfectly modern adaptation. Kira is a most lovable Elizabeth Bennett."
    },
    {
      "rating": "4/5",
      "review": "¡Qué bonita historia! El inglés de aquella época se oye tan elegante y tan respetable, me encanta."
    },
    {
      "rating": "3/5",
      "review": "An adaptation. Nothing more and nothing less."
    },
    {
      "rating": "4/5",
      "review": "This is an engaging and watchable film version of the Jane Austen classic novel. Keira Knightly makes a good Elizabeth though Matthew MacFadyen's Darcy does lack some of the charisma the character requires to make him truly memorable. I also struggled with the casting of Donald Sutherland who, though capable, just seemed uncomfortable in the role of Mr. Bennet. Visually, this movie is a treat and everything you would expect from a period drama. Good use is made of some stunning English landscapes and architecture and the script is well handled. Brenda Blethyn is great as Mrs. Bennet, driven to distraction by the drive to marry off her daughters and secure their future and Judi Dench is proper boo-hiss as Lady Catherine. The success of this adaptation lies with the lovely direction by Joe Wright who allows the silences and glances to tell the story as much as the words. Austen's novel is as much about the manners and etiquette of the era in which it was set and this is well captured here, despite the need to heavily edit several plot lines."
    },
    {
      "rating": "4/5",
      "review": "I like this movie very much but my sister totally loves it!"
    },
    {
      "rating": "4/5",
      "review": "At times it's almost exhaustive to follow its long plights of dialogue. But despite its taxing nature, Pride and Prejudice is just too clever and gorgeously shot to not enjoy. And it's one of the best films to come from 2005."
    },
    {
      "rating": "4.5/5",
      "review": "Beautifully written and perfectly cast. The most romantic movie I've seen in a long time kiera knightly was so great in this movie! It's dramatic when it needs to be, funny when it needs to be and breathtakingly romantic in its finale. My one gripe is that the end felt rushed. They could have spent another ten minutes or so on the actual relationship between Lizzie and Darcy, maybe showing their marriage. Other than this, perfect. 9.5 out of 10"
    },
    {
      "rating": "5/5",
      "review": "Brilliant interpretation of a classic on silver screen. Sets and scenery both amazing while the direction is both witty and refreshing."
    },
    {
      "rating": "4.5/5",
      "review": "Very good, not quite as good as the BBC mini series, but very enjoyable."
    },
    {
      "rating": "4.5/5",
      "review": "I have never read the book, but this is the second film adaptation I have seen of the classic novel (The other version I've seen is the 1940 version). While I feel that the 1940 version is an underrated film, this 2005 adaptation is a superior film in my opinion since the story flows better and overall is a better-made film. What really makes this film stand out are the great performances by all the cast members who truly bring life to the story. While the story has since been copied and done to death by other films and storytelling mediums as a whole, this film adaptation was clearly made with the utmost care and given a great deal of energy because of that. This film is lively, funny when it wants to be, beautifully acted, beautifully directed, and will forever be deemed a classic in the years to come because it feels timeless. It's a truly wonderful romance film and among the few great entries of the genre to come out in this century, and I really have to applaud the film-makers for that. If only there were more good ones instead the usual dreck we get these days."
    },
    {
      "rating": "3.5/5",
      "review": "I didn't particularly like this movie, it's not my thing. I give it a good rating though because it is well made and well written and anyone who enjoys romance drama will probably love it."
    },
    {
      "rating": "4.5/5",
      "review": "Beautiful images, quick wit, and breath-taking story. Keira Knightley was only NINETEEN. Insane. Wonderful acting, and again, love the wit. I wish we talked smart now. (dat was joke)"
    },
    {
      "rating": "3.5/5",
      "review": "It's a good one but the one with Colin Firth is even better I would give that one 20 stars. But it definitely is worth watching if you don't wanna watch the 4 hour version it's still really good one"
    },
    {
      "rating": "4/5",
      "review": "I had a hard time getting over the really fast and incomprehensible babbling and squealing of the women, particularly in opening half. However the films beautiful art direction and cinematography eventually charmed me over."
    },
    {
      "rating": "5/5",
      "review": "Matches the book really well. Great love story"
    },
    {
      "rating": "5/5",
      "review": "Perfectly scored movie."
    },
    {
      "rating": "2/5",
      "review": "Lightly entertaining, but mostly a disappointing adaptation if you've seen the BBC version with Colin Firth. The only characters that truly shine here are Lady Catherine, Jane Bennet, and Mrs. Bennet. Donald Sutherland was wasted here. I'd recommend \"Lost in Austen\", an ITV production, before this movie - it's not as good as BBC's P&P, but is highly entertaining."
    },
    {
      "rating": "4.5/5",
      "review": "a classic tale of love ....... i was moved by the passion"
    },
    {
      "rating": "5/5",
      "review": "An absolutely beautiful screen adaption of Austens beloved novel."
    },
    {
      "rating": "5/5",
      "review": "I love this movie one of my favorite Jane Austen books."
    },
    {
      "rating": "5/5",
      "review": "This is one of my all time favorite movies! I absolutely love Matthew MacFayden as Mr. Darcy..so hot! 2 thumbs up!"
    },
    {
      "rating": "4/5",
      "review": "I basically watched it on a dare -- and because it's one of my friends favorite movies. Pride and Prejudice is not the typical film I would endeavor to watch. In the past I've called myself a film connoisseur, but in reality I'm merely an overly qualified movie fan. And something of a film snob. I've never entertained the idea that I have enough time to waste watching film after film if it does not, in some way immediately spark my interest. Hence the reason why I refrain from viewing more than one superhero movie a year. In the case of Pride and Prejudice, my prejudice came in the form of period costume drama. I had not the patience nor the desire to sit down for two hours watching people speak in polite, rhetorical fashion which preserves both posterity and class distinction in their understanding. In other words, it sounded boring as hell. This is where the dare came in. In fact, it was less the dare and more the understanding of my dear friend's love for the picture which ultimately lured me into Ms. Austen's talons; for I was swept away by this film as prey to the hunter. To alleviate the curiosity of any reader who may have found there way to this summary, I shall explain the dare: The film, Pride and Prejudice was lent to me by a friend (different friend but just as dear) who procured it from her local library. Along with this film she borrowed a another upon my suggested, entitled \"Invasion of the Body Snatchers\" (yes, the 1956 cold war-era science fiction thriller). I had previously explained to her the greatness of \"Body Snatchers\" and delved slightly into its allegorical subtext, ensuring her that this film is indeed of a rare and bygone quality. Knowing that this was a film which stirred great affection from the friend previously mentioned, Liane (friend with the library card) offered to let my borrow the film from her. A night after I had been given \"Pride and Prejudice\", I received a message from Liane which said that her husband, Dennis expressed an irreconcilable indifference to the idea of a film which dealt in an alien race who has come to take over humanity. I thus told Liane that if Dennis watches \"Body Snatchers\" I would watch \"Prejudice\". Thence the dare I mentioned earlier. I found the film to be difficult to penetrate at first (as most films are which deal in this particular period). Upon further viewing it was easy to allow myself to become entangled in the headstrong and brashly mouthed Elizabeth Bennet and the quiet and oft misunderstood Mr. Darcy. I dare say I found myself strapped to my seat, deeply engaged with the film and look forward to viewing it again to extract its deeper levels of meaning."
    },
    {
      "rating": "5/5",
      "review": "I see a lot of male reviewers here, like myself, who are confused as to why we like this movie so much. Should i be ashamed to recommend it to friends? Hell no, a good movie is a good movie, and it's not often i find a movie in this genre that i actually enjoy. Top notch acting and cinematography sold it for me. Bravo."
    },
    {
      "rating": "0.5/5",
      "review": "Hated the zooms and overall the cuts were just timed terribly."
    },
    {
      "rating": "5/5",
      "review": "Will never ever get sick of watching this adaption! Beautiful!"
    },
    {
      "rating": "5/5",
      "review": "Beautiful cinematography!"
    },
    {
      "rating": "1.5/5",
      "review": "Pride and Prejudice seemed like a good film on the surface but I got lost within it and was unable to find a way out. The problem is that the story is incredibly slow moving and along the way so many dynamics occur, but if you fail to comprehend even one of the the entire series of events becomes utterly confusing and barely comprehendible, and so it barely becomes worthy of the audience's efforts to sit through it. By the end of the film I didn't know what had happened or who it had happened to, but either way it was just confusing and I don't enjoy viewing Pride and Prejudice, because amongst the excess of confusion is a slow moving plot and when it draws to a close the story seems to have moved as far as to the house next door and was largely an unproductive bore. I think part of it is the fact that I've never read the book Pride and Prejudice and I'm unaware of the cultural significance the story has, but whatever it is isn't apparent to me because essentially I found the film to be much like the film Little Women, although not nearly as thought-provoking or developmentally focused in my opinion. Basically, Pride and Prejudice didn't make me think and just made me bored, and it had many long and directionless scenes which seemed just to be there as a decent looking sequence to pass the time without dialogue to provide entertainment. Basically, Pride and Prejudice is a film that requires multiple viewings to grasp the story, but I was so bored the first time that I'm not eager to try again anytime soon. And I just think that it was a film insightful into a woman's mind but didn't give me information, so it's just not my ideal thing. Although it wasn't the most pleasant feature, it did have benefits. Namely, the production values are good and the film is well shot and benefits from a strong musical score which embodies the intended beautiful atmosphere which is obviously present at many points in the film. And Keira Knightly makes a fine lead role, capturing the passion of a young woman with an emotional grasp on her character and flawlessly confident line delivery. Pride and Prejudice features one of her absolute finest performances and indeed it is worth witnessing the film if not to examine the skill of its adaptation, but to be one to see Keira Knightly in one of her finest roles, worthy of recognition by the Academy Awards themselves as it scored her a well-deserved nomination for Best Actress. So i don't know what Pride and Prejudice does for its original source novel, and it does require multiple viewings, and even though I found it slow and dull it still was well crafted and finely acted."
    },
    {
      "rating": "3/5",
      "review": "surprisingley, not too bad"
    },
    {
      "rating": "4.5/5",
      "review": "not into chick flix. never have been. something about this film makes me watch it over and over. the acting is excellent and the characters bring you in. the director has pacing down to where you aren't lost and lagging or wanting to fast forward. everything seems to blend to a wonderful mix of emotions so well. any film that can do that deserves recognition. some clichés are in the storylines but that may be from jane austen's influence or the screenwriter's changing up her original plot (or so i've heard). this movie is an escape, nonetheless and one done very well. keira is someone to fall for and her work here is what makes me believe she's one of the best to hopefully win an oscar down the road."
    },
    {
      "rating": "5/5",
      "review": "One of my top ten movies, but I love Austen & Regency England. Knightley & MacFadyen should satisfy the romantic yearning of male & female audience members. Blethyn & Sutherland are delightful. Cinematography & setting are lovely. I'd like to watch it again right now."
    },
    {
      "rating": "1/5",
      "review": "Not to be mistaken for a period piece. . . . or for it's magnetic supporting characters. though I do like Sutherland as Mr. Bennet."
    },
    {
      "rating": "5/5",
      "review": "God! I LOVED THIS MOIVE!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "Good movie. Love Keira but this was way off of the book!"
    },
    {
      "rating": "4/5",
      "review": "Like Elizabeth Bennet, we eventually warm to Matthew MacFadyen's Darcy and come to recognize the depth of character Jane Austen and Joe Wright have bestowed upon him. Keira Knightley is wonderful."
    },
    {
      "rating": "3/5",
      "review": "Yet again knightly pulls off a wonderful performance."
    },
    {
      "rating": "5/5",
      "review": "i love this movie. i ca watch it any time and never get tired of it"
    },
    {
      "rating": "4/5",
      "review": "Que buena película, sencilla, colorida, se nota que procede de un muy buen libro. La cámara ama a Keira Knighley. Es un tipo de película que pudo ser más aburridora y lenta, pero el ritmo es adecuado. Recomendada."
    },
    {
      "rating": "5/5",
      "review": "I love it!!! If i got to marry Mr.Darcy then i would say yes cuz he is HOT and ROMANTIC!!!!"
    },
    {
      "rating": "3/5",
      "review": "I laughed, I'm not sure if that was the intention, but I did laugh. But man was it boring."
    },
    {
      "rating": "5/5",
      "review": "Love this movie, and the soundtrack."
    },
    {
      "rating": "5/5",
      "review": "This is my favourite movie, both Keira knightly and Matthew Macfayden play there parts so well."
    },
    {
      "rating": "3/5",
      "review": "In my opinion the Darcy they picked wasn't strong enough for the role. If only Colin Firth was 20 years younger he could had easily co starred with Keira. What a shame"
    },
    {
      "rating": "4/5",
      "review": "Quite good. Been studying this story extensively for the past few weeks. Not a huge fan of Keira Knightley but I will give credit when credit is due. Se did very well. The standout performances really do come from her, Matthew MacFayden and Tom Hollander. Great cameo by Judi Dench as well. Overall very true to the book and very well shot."
    },
    {
      "rating": "4/5",
      "review": "Not bad. Not bad at all."
    },
    {
      "rating": "4.5/5",
      "review": "Stunning cinematography, entrancing landscapes, charming characters, and pretty great acting. Matthew MacFayden intrigues and impresses with concentrated masculine grace, and Keira Knightley bursts with smile-eliciting personality on screen."
    },
    {
      "rating": "5/5",
      "review": "Love this movie. It is a great movie."
    },
    {
      "rating": "5/5",
      "review": "The casting is nothing short of perfection, the cinematography is breathtaking, the music is absolutely beautiful, and the story entails one of the greatest romances of all time."
    },
    {
      "rating": "5/5",
      "review": "the best movie ive ever watched"
    },
    {
      "rating": "4/5",
      "review": "It was okay, not as good as the version with Colin Furth in it but otherwise I thought it was well done."
    },
    {
      "rating": "5/5",
      "review": "\"And those are the words of a gentleman. From the first moment I met you, your arrogance and conceit, your selfish disdain for the feelings of others made me realize that you were the last man in the world I could ever be prevailed upon to marry.\" Mr Darcy, that's all I have to say! Great adaption from Jane Austens novel with a very good choice of actors. I especially enjoy Judi Dench as Lady Catherine, she gives the movie something extra with her performance"
    },
    {
      "rating": "5/5",
      "review": "One of my favorite movies. Perfectly cast, beautiful cinematography, and wonderfully executed. I can not get enough of this movie."
    },
    {
      "rating": "5/5",
      "review": "Flat out, one of the best films of all time."
    },
    {
      "rating": "5/5",
      "review": "Perfection, Matthew Macfayden ignites worldwide passion and affection with his portrayal of Mr. Darcy which is intensified by his co-star Kiera K. Perfection"
    },
    {
      "rating": "5/5",
      "review": "Boring movie, but a beautiful story that gets a hold of you and wont let go. I wanted to stop watching it but couldn't!"
    },
    {
      "rating": "4.5/5",
      "review": "Pride and Prejudice by Jane Austen is one of the best romantic stories I've ever read. The love between Elizabeth and the mysterious Mr. Darcy is incredible. The way the story goes about showing their love though words and awkward meetings is refreshing when we think of some of today's so called loves stories. The movie version of Pride and Prejudice that came out in 2005 directed by Joe Wright is a true masterpiece.First, lets discuss the amazing casting for this film. Starting with the lovely and talented Keira Knightley. She was perfect for the role. Her tomboyish beauty is what makes her, in my opinion, the perfect Elizabeth Bennet. She has an independent way about her that fits perfectly with the original character of Elizabeth. Matthew Macfadyen was also a great Mr. Darcy. His evolution throughout the film is the greatest of any in the movie. Though he seems harsh in the beginning we learn he is misunderstood and painfully shy. Matthew acts like a man pretending not be a hopeless romantic puppy through out half the film making every women fall in love with him instantly. And the way the two reacts to one another is perfect. They have a subtle sexual tension throughout the whole film that makes the movie 12 times better. They both react to each others actions so well to the point where the audience can clearly see they love one another before either character actually realizes that face. For example, the scene in the rain where Elizabeth states that Mr. Darcy is the \"last man in the world\" she could ever be married too is the most intense scene in this film. The rain, though some may say is clique, I find it to be perfect (even though it is slightly clique). That moment when they stare at each other is filled with sexual tension. The audience fully expects them to embrace one another and share a long passionate kiss. Darcy leans in, as Elizabeth does the same. He turns his head and the audience is sitting at the edge of their seat only to hear Darcy utter \"Sorry, for taking up so much of your time.\" The first time I saw this I was shocked! In movies set in today's time period the two characters would have kissed. However, because it is a classic story the two must walk away, longing and pretending to be indifferent. The actors and actresses in the whole film are perfectly cast and wonderful, however, without Knightly and Macfadyen, this movie wouldn't have been such a success.This movie also excels due to its amazing camera work. As I continue to write more blogs you will all see that I love camera work. Me and the camera are intimately involved. In this film the setting is simply breath taking and Wright does a great job of showing the beautiful scenery he has. The long takes are the best in this film. Particularly when Mr. Darcy is walking up to Elizabeth towards the end of the film. The camera stays on him for a good minute and a half. The director could have made cuts back and forth between him and Elizabeth. Or he could have made Mr. Darcy's walk much shorter. Instead, he plays the beautiful piano in the background (thanks to Dario Marianelli) and Macfadyen walks toward the camera with the wind in his air. This scene is what I like to call subtly dramatic. You don't realize the drama in the scene until it ends and you think \"man that was the most epic walk across a field I have ever seen\". The close-ups in this film also show the simple beauty in the story. It causes the audience to be absorbed into the film in a way that makes you feel like you are standing in the field or in the rain watching the characters right in front of you.Overall, this movie is excellent Granted, I can understand if its not for everyone. Some people might not enjoy the whole 'old English' theme. However, the love story of this film is a good one and that is undeniable. It shows how you cannot judge a person based on loose first impressions and you need to open yourself up to the best love possible. Towards the beginning of the film, Elizabeth tells Jane \"Only the deepest love will persuade me into matrimony\" showing how she would only settle for the greatest love, not the convenient kind of love. That's why I think this film is so exceptional and different then a lot of love stories today. Obviously the movie is shot in a different time period than other movies based on romance are today. Yet, there is a true love in this story that I think other romantic movies in this generation lack. But, I do believe that good romance movies are making a comeback. Stories filled with real love, not a selfish sort of love story, and that is exciting to me. -Megan O'Neal Read more from me at http://moviesfrommyeyes101.blogspot.com/"
    },
    {
      "rating": "3/5",
      "review": "I use to be in love with this movie, but after seeing the BBC version, I began to see many flaws with this one, as well as it just didn't satisfy me anymore. Matthew, who plays Mr Darcy, is handsome and charming, and I always liked him. Keira, who plays Elizabeth, well, I never really grew to like. First off, my preference, is that I don't care much for Keira, so I am biased in that aspect. BUT, from a completely unbiased stand, I think her Lizzy was way to goofy, smily, and immature, while Lizzy in the book, and in BBC version, was mature, insightful, was humorous yet still classy, calm, and so forth. Keira was way to childlike and I didn't see anything in her character other than her reading from her script. It seemed like what she said did not match her personality...she said all the things Lizzy would say, but she just wasn't Lizzy.Also, I do want to point out the BBC version has the luxury of being a mini-series and has time to build character and storyline, so that was good. This movie just seemed rushed and also the characters weren't all to satisfying. I wanted more on the family dynamic and their flaws, which supposedly made Darcy see them as threats to Lizzy's happiness and security. This movie did not seem to point that out as much, while the BBC version was satisfying in that aspect and made what Darcy wrote about and though about the family more justified. As a quick movie highlighting the book's highs and lows for a general audience, it does the trick, but for a Jane Austenite, an avid fan who's always searching for better versions, this one just stopped satisfying me fully. I still would briefly eye it to get a fix, especially for Matthew, but for a full rendering of the book and all it's plots and arcs and characters, I'd watch another version or the mini-series."
    },
    {
      "rating": "5/5",
      "review": "my favorite movie hands down. This was probably one of the only movies that I ever saw in theaters and immediately after wanted to watch it over again. Absolutely wonderful actors and brilliant script that kept me laughing throughout the movie and wanting to read the book again!"
    },
    {
      "rating": "4.5/5",
      "review": "I haven't seen the full length version yet but as far as I know this one was pretty good"
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing."
    },
    {
      "rating": "5/5",
      "review": "I absolutely love this movie. It is definitely a chick flick but still so romantic."
    },
    {
      "rating": "2.5/5",
      "review": "i wasn't in the right mood to watch this but the costumes were great"
    },
    {
      "rating": "4/5",
      "review": "Those who have read the original novel by Jane Austen may be surprised. This movie did a wonderful job with the romance, but left out almost all of the comedy. I don't believe that any other adaptation of 'Pride And Prejudice' simply dispensed with the considerable comedic element of the novel. So for those familiar with the novel, this movie presents only half of the story, but does it very well."
    },
    {
      "rating": "3.5/5",
      "review": "a beautiful classic. love conquer all"
    },
    {
      "rating": "4.5/5",
      "review": "A modern retelling of the Jane Austen classic, and the most faithful. This is my go-to movie when I'm bored."
    },
    {
      "rating": "5/5",
      "review": "i LOVE THIS MOVIE!! I ALWAYS TELL PEOPLE THAT IS ANNOYING TO WATCH THINGS over and over again!! but honestly i would watch this movie a thousand times!!!!"
    },
    {
      "rating": "4.5/5",
      "review": "The acting, writing and art direction are all top notch. An absolute jewel of a film."
    },
    {
      "rating": "3/5",
      "review": "The novel Pride and Prejudice is a humorous satire about women's dependence on marriage for economic security. In the 2005 movie rendition of it, Joe Wright, a relatively new director, attempted to capture the feeling of it in a condensed two-hour film. Though it is considered by many to be the best version of the movie, it ultimately fails to capture the novel's satirical message about women marrying for financial safety and plays out more like a romantic drama with a corny ending due to its underdeveloped or differently developed characters and lack or change of a few important scenes. The movie Pride and Prejudice had several scenes omitted or changed to make it fit into the two-hour average movie runtime. The whole rendition of the movie is a cliché. In shortening the time to tell the entire story, Joe Wright turned a satire about the women's views on marriage into just another love story. Evidence of this can be seen as early as the first ball. In the movie, Elizabeth and Mr. Darcy make eye contact for a moment and it is evident by her facial expression that she is going to end up with him at the end. This is a cliché seen in most romance movies. Also, in the scenes where Mr. Darcy professes his love to Elizabeth, it rains as she turns him down and says he's the last man she would ever marry. They are not outside in the rain when this happens in the novel. This makes the entire scene seem more dreary and sad where the novel is humorous and satirical. The ending to this movie is a romantic cliché also. Elizabeth and Darcy are outside after they get married and are about to kiss when a conversation happens in which Mr. Darcy professes that he is completely happy with her in heart-warming way. Give me a break. The ending is so corny in the movie that it kills the entire satirical point of the novel. All these clichés turn the movie into a heart-wrenching love story rather than a humorous satire. A few of the characters in the movie are developed differently than the characters in the novel. One of these characters is Elizabeth. She is kind and has a good humor in the novel, whereas in the movie she is rude and ill-tempered. Darcy is also seen as a comic character in the movie, which he was most certainly not in the novel. And speaking of characterization, it was virtually nonexistent for Wickham in the movie. Whoever wrote the scripts for these characters and was in charge of their characterization failed to capture them in the way Austen did in the novel. This makes the entire movie feel like a romantic drama. It does not have the feel of the satire that was created by Jane Austen in the novel. Though Joe Wright successfully recreates the events of the novel Pride and Prejudice in his movie, he fails to capture the feeling of it. The movie has underdeveloped or differently characterized characters and condensed scenes with some actually omitted. With this, Wright creates a romantic drama instead of the humorous satire created by Austen in the novel."
    },
    {
      "rating": "1/5",
      "review": "My intelligence has been insulted yet again. If you want a good movie version try the A&E version."
    },
    {
      "rating": "4/5",
      "review": "this is an awsome movie. i love it!"
    },
    {
      "rating": "5/5",
      "review": "Favorite movie of all time"
    },
    {
      "rating": "4.5/5",
      "review": "I love it. Not as good as the mini series, but it is great."
    },
    {
      "rating": "5/5",
      "review": "Just a beautiful adaptation."
    },
    {
      "rating": "5/5",
      "review": "So true to the book!!!"
    },
    {
      "rating": "3.5/5",
      "review": "i still love the original better"
    },
    {
      "rating": "5/5",
      "review": "wonderful movie. wonderful book."
    },
    {
      "rating": "5/5",
      "review": "This moving is amazing!!!! Great era and wonderfully directed piece!!"
    },
    {
      "rating": "4.5/5",
      "review": "Modern sensibilities and captivating performances make this one of the best adaptations of Jane Austen's 1813 classic."
    },
    {
      "rating": "4/5",
      "review": "Pride and Prejudice is a love story that will make you think about what makes you fall in love."
    },
    {
      "rating": "5/5",
      "review": "Obrigatório ver pelo menos 1 vez de 3 em 3 meses!"
    },
    {
      "rating": "5/5",
      "review": "This movie made me completely, and perfectly, and incandescently happy."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Very enjoyable and quite realistic."
    },
    {
      "rating": "3/5",
      "review": "It is hard for one to rate this without reading the tale, but as far as films go, this Romance is far more believable and enjoyable than most. Knightly wouldn't have been my top choice for the role of Elizabeth, but she is still solid in her performance and the rest of cast is excellent in bringing life and energy to the story."
    },
    {
      "rating": "4/5",
      "review": "I resisted seeing this movie for quite a while. I saw it on DVD, instead of the theaters. Which is surprising for P&P, and a period piece. But I was adament about staying monogamous to the one with Collin Firth. I admit it. I'm a cheater. But you mean the world to me, Original Mr. Darcy!"
    },
    {
      "rating": "5/5",
      "review": "No matter how many times I read the original novel by Jane Austen, I cannot help but wonder if Mr. Darcy and Elizabeth would ever be together in the end; no matter how many times I watch Joe Wright's version, I cannot help but admire the way he shot the movie to make it all smooth and comforting. Every element in it is delightful, wonderful and cheerful."
    },
    {
      "rating": "5/5",
      "review": "This is one of few romance films that I truly enjoy, mainly because it is British. I enjoy the highly eloquent conversations and arguments, which makes the film every more interesting and engaging. It has become a signature for Joe Wright's period romance films, apart from deliciously lavish production set designs, beautiful cinematography, gorgeous makeups and costume designs, and Dario Marianelli's sweeping music. If only Twilight had a better script, I would have enjoyed it more."
    },
    {
      "rating": "4.5/5",
      "review": "The perfect love story!"
    },
    {
      "rating": "4/5",
      "review": "Sure, it's another adaptation of cinema's fave Jane Austen novel, but key performances and a modern filmmaking sensibility make this familiar period piece fresh and enjoyable."
    },
    {
      "rating": "4/5",
      "review": "The ultimate adaption of Pride and Prejudice! Beautiful, bold and endlessly romantic!"
    },
    {
      "rating": "5/5",
      "review": "Fantastic classic, especially for Jane Austin fans!"
    },
    {
      "rating": "5/5",
      "review": "you have bewitched me, body and soul, and I love, I love, I love you. I never wish to be parted from you from this day on."
    },
    {
      "rating": "4/5",
      "review": "Visually stunning, wonderfully acted, a great period piece. Loved it."
    },
    {
      "rating": "4.5/5",
      "review": "much less than your usual book adaptation, anything but boring. strong cast made the movie goes really well, exceptional all around. but it's deborah moggach's work that gave it life"
    },
    {
      "rating": "5/5",
      "review": "One of the best movies I have ever seen! 5 Stars"
    },
    {
      "rating": "5/5",
      "review": "I absolutely looooove this movie and can watch it over and over again!!!!"
    },
    {
      "rating": "4/5",
      "review": "It's good but it can get slow if you've read the book or have watched it before. The cleverness in the book comes out alright in the movie, but some of the dialogue is muffled. I realized this while watching it with CC at the gym."
    },
    {
      "rating": "2.5/5",
      "review": "A woeful remake of Pride and Prejudice that lacks charm."
    },
    {
      "rating": "2/5",
      "review": "Great camera work...dialog...poo gas"
    },
    {
      "rating": "4/5",
      "review": "Wonderfully girly, and Matthew MacFayden is so cute! The Colin Firth version of Darcy is better, but this one is a close second."
    },
    {
      "rating": "4.5/5",
      "review": "So romantic...that accent is to die for Kiera... Mr. Darcy"
    },
    {
      "rating": "5/5",
      "review": "one of the most beautiful movies i have ever seen! kiera knightly portrays elizabeth bennet perfectly. a movie based on jane austen's book, this movie makes the book come to life."
    }
  ]
}