[
  {
    "rating": "5/5",
    "review": "Really good!! We loved it 😊 (4k blu ray, english, 5.1.4 atmos)"
  },
  {
    "rating": "1.5/5",
    "review": "I really would like a princess that herself chest ribs are not showing. It's very hard to accept a MALNOURISHED example of a princess for the next generation. Please give us more characters like Moana that are normal sized humans. Im not okay with front ribs showing on an example of a beautiful princess. Wheelchair is awesome, green is awesome, MALNOURISHED Galinda is not acceptable. Feed her to normal dimensions. I will not watch this again in front of impressionable children."
  },
  {
    "rating": "4.5/5",
    "review": "I thought the movie was too good. I loved Ariana and Cynthia's performances. I also love that the cast really knows how to sing and that when they sing, they convey it to the audience. I'm looking forward to Part 2."
  },
  {
    "rating": "1.5/5",
    "review": "How are people raving about this? Sure the cinematography and special effects are beautiful but that’s it!"
  },
  {
    "rating": "5/5",
    "review": "Wow.. I thought this would be awful for some reason.. it was funny, heartfelt and beautiful! What talented people!"
  },
  {
    "rating": "5/5",
    "review": "Easily my favorite movie from last year. I cant wait for part two to come out."
  },
  {
    "rating": "5/5",
    "review": "This was such an amazing movie the two leads were amazing the amount of emotion in this story is truly fantastic, one moment you would be laughing the next crying. you can really tell how much love and care was put into this movie. Would definitely recommend."
  },
  {
    "rating": "0.5/5",
    "review": "Incredibly boring! Songs just thrown in randomly. ChatGPT would write a better script than this dog pile."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible. The music is terrible, Arrivo \"overacts\" all of her scenes so it's painful to watch. Am I the only one that thinks she screams instead of sings? I really think this movie would have been excellent if Cynthia was not in it"
  },
  {
    "rating": "4/5",
    "review": "With Wicked, what you see is what you get. The setting is fantastic, the cast is phenomenal, and the musical numbers are mesmerizing. The world of Oz feels much more populated than the original film might lead you to believe. It also feels like an actual governed society instead of some outlandish fantasy world. Cynthia Erivo did a great job as Elphaba and gives a convincing performance, but Ariana Grande stole the show for me. She embodied her role so whole-heartedly; I forget that she isn't actually like that in person. Her comedy in this movie was priceless (for me, at least). It was exactly my kind of humor. I chuckled here more than any other movie this year. The story was pretty basic. It's the same old \"misunderstood villain\" schtick that I've grown tired of, but the B-Plot was very interesting. I hope that it gets elaborated upon going forward. And yes, this is only Part One. They have more story yet to tell. I found it more entertaining than I expected it to be. 4 out of 5."
  },
  {
    "rating": "1.5/5",
    "review": "The story of why the wicked witch from wizard of Oz is so evil. Long and mostly boring. Felt like one of those Disney musicals but poorly written"
  },
  {
    "rating": "5/5",
    "review": "Best thing since sliced bread"
  },
  {
    "rating": "5/5",
    "review": "Great fun movie!! Can’t wait for part 2"
  },
  {
    "rating": "2/5",
    "review": "This over the top musical, didn't live up to my expectations of the London theatrical production. Although I do appreciate it for its achievements, I got bored with its cliche preaching of good and bad that also didn't feel that way in the book. I don't plan to see this again. I was not a fan of some of the cast either."
  },
  {
    "rating": "2/5",
    "review": "Sayang oras. Oks sana un mga revelations, climax sa ending pero nabitin lang ako na kelangan pa hintayin ang part 2"
  },
  {
    "rating": "3.5/5",
    "review": "The best Broadway musical film adaptation since Chicago? Probably. Fun to watch in 2025 and note the Trumpian qualities of Oz leadership? Absolutely. Beautiful to see and hear, but also bloated and overlong, especially for a part one."
  },
  {
    "rating": "5/5",
    "review": "I want more movie. I need this injected in my veins. it's so good, such a masterpiece."
  },
  {
    "rating": "5/5",
    "review": "It was an amazing movie, can’t wait till the second one !"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie...saw it twice!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Can’t wait for part two!"
  },
  {
    "rating": "1.5/5",
    "review": "I enjoy a good musical, but the this one just felt exhausting."
  },
  {
    "rating": "4/5",
    "review": "With its outstanding musical sequences, performances by Cynthia Erivo and Ariana Grande, and production value, “Wicked” is how to do a cinematic musical right."
  },
  {
    "rating": "4/5",
    "review": "Really good, but i enjoyed the musical more"
  },
  {
    "rating": "5/5",
    "review": "Hands down loved this movie, I loved the play and I love this movie, cannot wait for the next one to come out. Very Excited!!!"
  },
  {
    "rating": "5/5",
    "review": "Seeing Cynthia Erivo play in this role was so powerful and moving. Loved every second and so glad they did more practical effects!"
  },
  {
    "rating": "5/5",
    "review": "It was a great movie. Me and my friend was just cry the whole movie"
  },
  {
    "rating": "5/5",
    "review": "We loved it. Waiting patiently for part 2. Cynthia’s voice is 🔥🔥🔥🔥 Arianna facial expressions are hilarious."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is awful. Wish I could get the time back i wasted watching it. It not put together well. The singing was not good. The plot sloppy. The fact that people wasted so much money on this is amazing. Garbage tier film."
  },
  {
    "rating": "5/5",
    "review": "Brilliant! Only one small quibble why cut up Defying Gravity, arguably the best song in the show?"
  },
  {
    "rating": "4.5/5",
    "review": "“Defying Gravity” will have you levitating! A musical movie adaptation that does justice to both the original Broadway production and the beloved film adaptation of “The Wizard of Oz”. The singing performances and choreography put just the right amount of spin on the iconic musical numbers from the play, similar to how the sets, costumes and special effects honor the legendary Oz film. Cynthia Erivo’s bone-vibrating voice is as powerful and moving on screen as it is on the stage, likely placing her in the conversation for best singing performance ever put on film. Ariana Grande’s successful musical career kept her from showcasing her acting talents for a while, but viewers of Nickelodeon during the 2010s are well aware of her brilliant comedic timing. Together, they make a perfect Elphaba and Glinda pairing!"
  },
  {
    "rating": "5/5",
    "review": "Brilliant! Words cannot express my satisfaction of this film! Absolutely loved it and cannot wait until Part Two!"
  },
  {
    "rating": "5/5",
    "review": "As someone who has never seen the Wicked musical or heard the Wicked soundtrack, I didn't know what to expect. This movie blew away any expectations that I did have due to the set design, costumes, soundtrack, and overall story. I have already watched this a few times and am eager to see part two when it comes out!"
  },
  {
    "rating": "4.5/5",
    "review": "Wicked is a breathtaking musical adaptation that honors its Broadway roots while delivering a visually stunning and emotionally powerful cinematic experience. Director Jon M. Chu brings Oz to life with vivid production design and sweeping visuals. Ariana Grande shines with a transformative performance, blending her dazzling vocals with emotional depth. The chemistry among the cast and the heartfelt storytelling make every musical number resonate. Wicked is an unforgettable, joyous celebration of story and magic."
  },
  {
    "rating": "5/5",
    "review": "i really liked the story me and my BF watched it together it was a really fun movie date we ended up talking about the movie alot and wanting to rewatch it again"
  },
  {
    "rating": "5/5",
    "review": "I was honestly very pleasantly surprised!"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. Saw the Broadway play twice but was not as moved as I was with this movie. Loved Ariana Grande as Glinda. Great voice. Excellent comedic timing. Cynthia Erivo’s acting was incredible. Great interpretation of the character. Her eyes and nuanced facial expressions. She really knows how to use song as an emotional vessel. Her voice is stellar. The choices she made starting with a high voice when she was young and shy and then belting as she became more resolute. Masterful can’t wait to see her in Part 2. The two actors together were excellent. I believed them both as their characters. And when they sang together. Chills."
  },
  {
    "rating": "0.5/5",
    "review": "This is the lowest score I can give, right? It is a horrible film and a professional waste of nearly 3 hrs. All it was was a green woman and Ariana Grande dancing and prancing around an overpriced movie set. As well as that, the singing was too over the top, as every 3 or 4 muttered words broke into a weird song. Overall, I can't believe how so many people are hyped about the movie, as I'd rather watch Bluey instead."
  },
  {
    "rating": "5/5",
    "review": "No words can do this justice"
  },
  {
    "rating": "5/5",
    "review": "Loved this movie!!!!"
  },
  {
    "rating": "5/5",
    "review": "Wicked was the best thing I ever saw and it got off my bucket list my daughter loved it. The characters are awesome and in the mix of live action and CGI it makes it perfect for the movie it’s a must see movie and a lot of people did not make any funny changes because I think they didn’t do it and it’s a perfect backstory for Alphaba and Glenda for the Wizard of Oz"
  },
  {
    "rating": "3/5",
    "review": "Es realmente un poco lamentable ese final creo que pudo haber quedado mejor de lo que se puedo,también es un quiero y no puedo de la obra de OZ."
  },
  {
    "rating": "5/5",
    "review": "Exceeded my exceptions - which were already high. I actually don't like musicals so if you don't either -- don't worry they don't overdo it and when they are singing they are also acting and not just swaying around and singing la la la (like a lot of musicals) there is stuff going on. A lot of storyline which I loved. The acting was fabulous!!!"
  },
  {
    "rating": "5/5",
    "review": "Brilliant, brilliant, brilliant. I was very sceptical about this being made into a movie but that all disappeared in the open sequence. Ariana grande is the perfect Glinda and just oozes her aura."
  },
  {
    "rating": "2/5",
    "review": "It's a beautiful film that's well acted, but the story and messaging are so awful and heavyhanded it ended up being a hate-watch, though I had been looking forward to it."
  },
  {
    "rating": "5/5",
    "review": "Brilliant movie. Just beyond on all levels. Acting, creativity, sets, filming, music, dancing, singing. Captivating, magical, touching, and totally entertaining."
  },
  {
    "rating": "2.5/5",
    "review": "Not feeling it like everyone else... Only the ending excited me w the infamous song.."
  },
  {
    "rating": "5/5",
    "review": "I wasn't crazy about the movie being done in 2 parts. Seemed like a money grab. That said, part one was spectacular and I can't wait for part 2."
  },
  {
    "rating": "5/5",
    "review": "I'm not too into musicals but this was so damn good. The world of Oz I'm wicked is colourful and vibrant, great acting and cinematography and what a twist I honestly can't wait for part 2"
  },
  {
    "rating": "4/5",
    "review": "Not a fan of musicals, but this one was really good!"
  },
  {
    "rating": "0.5/5",
    "review": "Just bad. Can't remember the last time I walked out on something. Now I can't say that anymore."
  },
  {
    "rating": "4/5",
    "review": "I never saw the Broadway production, but this movie makes me want to!! The story is sweet, it's a strong backstory, and the music is absolutely killer!"
  },
  {
    "rating": "5/5",
    "review": "I usually fill these out on my letterboxd -- this is such a life changing experience as a film waiting over 10 years to hit the big screens ever since i found out about in High school. Its truly magic"
  },
  {
    "rating": "5/5",
    "review": "Love Ariana grande amazing performance"
  },
  {
    "rating": "0.5/5",
    "review": "My mom and I had been waiting for almost a month to watch it together, we couldn't even get through an hour of it before we stopped watching it! We had debated on continuing to watch it not even half an hour in. It was so random and all over the place. And Ariana looks so sick it's not even funny so we're sitting next to each other commenting on how sick she looks every time she comes on screen! And so much was changed from the books and the original movie! And I get that that's kinda the point, but the slippers!"
  },
  {
    "rating": "5/5",
    "review": "I am a huge fan of the novel series by Gregory Maguire, and therefore rolled my eyes at the announcement of the movie that promised to be an adaptation of the stage everyone loved, as opposed to the darker and more sinister (and nuanced I felt) novel series. However, I did drag myself to the theater to watch it with a friend, if only to bemuse them, and despite a first watch being distracted by a horribly distracted audience experience (people were standing up and feuding over children making too much noise) upon a second watching, I did, in fact, fall in love. What neysayers are possibly missing, and perhaps don’t want, is a more grounded story. Well, read the novels, I would say to that. But for this musical, for this adaptation, and for mainly the characters of Galinda/Glinda and Elphaba, Jon M Chu successfully inserted just enough more nuance and character development to make this, honestly, superior to the stage experience. If you want the glitz and glam and stage craft, absolutely see the stage play. Short, sweet, to the point. It gets the message more or less across of ‘girl discriminated against because she is different, meets people along the way, becomes bitter, and falls in love and, well the story (and my memory) gets fuzzy toward the end but whatever don’t think about it.’ What the movie does is it takes that raw story, takes even more of the aesthetic of the 1939 film than Gregory Maguire, in a written medium, was able to infuse, and sets all of that ablaze with the looks that Ariana Granda and Cynthia Erivo conjure between one another and those on the periphery that inform their tale. Truly spell binding, with engaging choreography and enough detail that it warrants multiple watches, and while you are searching for each new moment, you get to once again listen to Cynthia belt ‘the wizard and I’, unknowingly joke about her tragic fate of melting, and be excited to meet the man that will ultimately cause her revolt and ultimate disappointment, and Ariana’s ability to act priveledged, but simultaneously show the truth behind Gregory Maguires character of Glinda, which is more that she never had the opportunity to think before meeting Elphaba, and though it is startling, Glinda does ultimately happily rise to the challenge. Again, magnificent and spellbinding. Thank you, John M Chu, and I’m still waiting for that stupid picnic deleted scene!"
  },
  {
    "rating": "5/5",
    "review": "Extremely Good! I would give it a 5 star for sure, absolutely stunning performance and great vocals. Saying it is Great isn’t even enough. The story line isn’t as clear but the performance was exceptional from both witches especially!!"
  },
  {
    "rating": "5/5",
    "review": "This is definitely a Classic. Exceeded my expectations. Well written, Great Acting and GREAT STORY!"
  },
  {
    "rating": "5/5",
    "review": "I don't particularly like musicals —in fact, I kinda hate 'em. This one had a completely different feel, though, and for once I completely get that people went to screenings just to sing along. Cynthia Erivo is amazing (I've been a fan since that other movie, that noir movie about the hotel on the border of CA and NV). Even if you've never liked musicals give this one a chance."
  },
  {
    "rating": "5/5",
    "review": "This was the best movie of 2024 I can't wait for the second one to come out."
  },
  {
    "rating": "2.5/5",
    "review": "The whole idea that the wicked witch was from an affair?? This is supposed to be a movie that the whole family can enjoy. The other thing that Wicked missed is that the Wicked witch’s if anyone recalls had a sister in the original Wizard of Oz who was killed when Dorothy’ house fell on her, why was this never included in the story."
  },
  {
    "rating": "1/5",
    "review": "Character development sucked. Some of the acting was really bad. E.g. Elphaba’s dad. Music was good, but you could get that from any musical cast for Wicked. I spent a lot of time cringing at Prince Fiyero, especially with his solo where he flirted with other men. If they would just slow things down, maybe the story would have flowed better too."
  },
  {
    "rating": "5/5",
    "review": "They were perfect for the roles"
  },
  {
    "rating": "3/5",
    "review": "Was excited for this, but it was a bit of a letdown. Highlights are Jonathan Bailey's Fiyero and Michelle Yeoh's Madame Morrible, as well as the background actors performances. Costuming is by-and-large great as well, albeit with a few notable flops. Sets are mostly good, but the overuse of CGI really holds a lot of scenes back. Its glaringly obvious in quite a few scenes and makes several big moments just look silly - I really wish they had used more practical effects. And the music is mostly good too, though the unnecesarry riffs from both leads do take away from it at times... But most of the issue is with the acting - apart from a couple standouts, it is just a mess. Elphaba and Glinda's dynamic should be the centerpoint of this story, but despite all their time together, they just dont sell that - every interaction between them feels forced and fake. I didnt expect them to fully live up to their brodway counterparts, but I was at least expecting them to look like they genuinely care about each other by the end... Boq also gets a strange amount of screentime for such a minor character, and is never fun to watch. While Nessa doesnt get enough to feel like a meaningful character, which will certainly hamper the second half."
  },
  {
    "rating": "4.5/5",
    "review": "Soooo good! Can’t wait for the next"
  },
  {
    "rating": "3.5/5",
    "review": "to be continued...... wasn't what I wanted after watching a 3 hour movie. they should charge you have the price..... JS"
  },
  {
    "rating": "4.5/5",
    "review": "I was pleasantly surprised at how much I enjoyed this movie. As a huge fan of The Wizard of Oz growing up I was not sure that I would enjoy this. However, I took my granddaughter (who had already seen it 3x) and was told by my daughter to not try to compare it to the original Oz. There are certainly some lessons to be learned from the film, like not judging others. Those older will get those, while those in the younger age may catch some of them but will certainly just enjoy the show. It was funny and it was sad. The acting was fun and the songs were good. I was glad to see it streaming already as I want to see it again (and not cost me $50+ at the movies) Very enjoyable cast, and I am interested to see what Part 2 brings."
  },
  {
    "rating": "5/5",
    "review": "Une chef d'oeuvre visuel ! Les décors et les costumes sont absolument splendides (récompenses gagnées, amplement méritées). Ariana est parfaite pour le rôle de Glinda, elle apporte cette fraîcheur et cette qualité vocale que peu auraient pu offrir à travers ce rôle. Le duo Ariana-Cynthia est touchant et je n'ai qu'une hâte: le retrouver en novembre prochain. Ravie également de la présence de Jonathan Bailey qui fait un super Fiyero. Bravo pour la qualité vocale de tous et bravo Monsieur Chu pour ce succès."
  },
  {
    "rating": "1/5",
    "review": "The adaptation had a chance for the “Wicked Witch” to really become an intimidating formidable character. Instead, the direction of the whole film was goofy and fell short of captivating. An expired bottle of Ketchup has more spice than this film."
  },
  {
    "rating": "0.5/5",
    "review": "I hate this movie. I saw it in theaters thought it would be good I was so wrong. First of all the length it was so long 3 hours long. The first 30 minutes I wanted to leave. Leaned over to my kids and said “only three hours to go” After the movie I felt it was a waste of my life. My kids hated it and so did I. Second the acting it was fine but Ariana Granda COME ON! No thought she would be ok news flash SHE WASN’T. Third what was this script! “You’re greeen?” Said Glinda “I am” Said Alpba that’s just so who talks like that in real life. Now I don’t think it was all Ariana but she was cast wrong. Okay fourth I just watched a three hour movie and wow there’s a second one. Like what no! I just we watched a three hour waste of time and another one. Fifth too much advertising. I saw these ads everywhere target, Starbucks, cvs my massage place I went there to relax not to be triggered again. This movie will forever be horrible in my heart. I wrote this so you don’t make the same mistake as I did."
  },
  {
    "rating": "5/5",
    "review": "ABSOLUTELY AMAZING!!! there’s nothing else I can say!! Just wow!! This is what I call cinema"
  },
  {
    "rating": "5/5",
    "review": "Phenomenal in everyday. From the actors to the sets, this film had so much love put into it that it was infectious. It was very well done and left me wanting more! Can't wait for a sequel"
  },
  {
    "rating": "5/5",
    "review": "Amazing, have watched the theater show many times and the film did not disappoint"
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed this movie! The singing and dancing is outstanding. The sets are beautiful. I read the book many years ago, but I cannot remember it. I don’t think I actually liked it! But I love this movie. It was such an interesting take on the wicked witch of the West. It’s really hard not to like her. She was wonderful. Definitely recommended!"
  },
  {
    "rating": "4/5",
    "review": "This is such an amazing musical! I’m so excited for part 2!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Waiting on part 2. I hope they don't take so long to bring it out. This movie was better than I thought it was going to be. A little less singing would be even better"
  },
  {
    "rating": "0.5/5",
    "review": "I was annoyed by the characters and music less than an hour in and decided to watch YouTube videos instead while my wife watched the rest of the movie. It’s pretty visually, but pretty bad in every other aspect. It’s just another self gratification movie for theater people."
  },
  {
    "rating": "3/5",
    "review": "When I read Wicked years ago, I hated it. And later, when I heard they were making a stage musical based on the book, I thought that was a mistake. But then I eventually heard the music and I loved it. So I decided to see the musical, which was disappointing. Therefore, I didn’t know what to expect for the film adaptation. As it turns out, Cynthia Erivo, Ariane Grande, and Jonathan Bailey are fantastic singers and were wonderful in their respective roles. I just don’t care for the story. It’s contrived and convoluted. So as much as I enjoyed moments of this movie, I’m not that guy that loves Wicked."
  },
  {
    "rating": "5/5",
    "review": "just perfect, just right"
  },
  {
    "rating": "3/5",
    "review": "Not sure what the big deal is. Its shiny and singy and funny (sort of) but seemed shallow and without purpose other than to sell tickets. Not a fan, but might want to watch it just to be in the know."
  },
  {
    "rating": "4/5",
    "review": "I think of this film on a similar level as the Wonka prequel that released a couple years back. Both of them are on the same level because while this film does better with it's story then Wonka this film fails in the fact that if you watch this in a theater you will not hear anything, Ariana Grande is a good singer if you can hear any of the notes she says. But other than that it's on the same level as Wonka"
  },
  {
    "rating": "4.5/5",
    "review": "Wicked is an amazing piece in cinematic history the cast was amazing the songs and scenes delivered and there were some suprises. When I was growing up I loved wicked it really spoke to me being bullied defying gravity was one of the things I would just listen to on repeat so when I heard wicked was becoming a movie I was overjoyed. The Cast when I first heard i was impressed but I was skeptcal at one person Ariana Grand but after watching the movie I was proven wrong. I've known Ariana Grand as a popstar for a while now so I thought they would just have her turn this movie into one of those anyoing ripoffs with references everywhere but I saw that they didn't do that and that Ariana was Hilarious and did a perfect job in popular and a perfect pick for Glinda so even though everyone else was amazing I have to say the Ariana Grand is the true wicked MVP. Cynthia Erivo I barley knew of but when I watched wicked I went back home and watched every movie she was in because she is so talented she can belt act and deliver her role as Elphaba was a perfect fit and Honestly when I heard who else was audtioning for Elphaba I was rooting for people like Lady Gaga and Lea Michelle but when I watched wicked I knew they had made the right choice. Let's just say this Johnathon Bailey you are Amazing he delivered just like I expected He was the only person I wasn't skeptical with, Dancing through life is one of my favorites and I relate to that song a lot and Johnathon Just made the song really come to life. So that is Ranking of The Wicked Movie an amazing part of entertainment history and an amazing cast"
  },
  {
    "rating": "5/5",
    "review": "Such a groundbreaking movie from its amazing world building to its jaw dropping vocals!"
  },
  {
    "rating": "5/5",
    "review": "A movie I can rewatch a 100 times and not get bored of it"
  },
  {
    "rating": "5/5",
    "review": "Your green. I am."
  },
  {
    "rating": "4/5",
    "review": "It's too long, but it's otherwise delightful, colourful and whimsical. I might take issue with the runtime but the pacing just hums along and it's never boring."
  },
  {
    "rating": "5/5",
    "review": "Una película absolutamente hermosa!!!"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. The songs and the actors were spectacular, and I am always watching this movie or trying to. I think that everyone should try and watch this movie at least once because I guarantee you that if you liked The Wizard of Oz or the other wicked movies, this one won't disappoint you. 10/10"
  },
  {
    "rating": "5/5",
    "review": "An amazing adaptation of a Broadway play from 2003. I’m happy it took its time to Release the film. I am very excited for part two"
  },
  {
    "rating": "4/5",
    "review": "Ariana Grande & Cynthia Erivo were such a great pair & match for this film! This musical was a drama but emotional film, followed by insights of who is who & how/why they are who they are; tying into the storyline of The Wizard of Oz. After watching this movie, I’m definitely going to watch the original broadway musical next! ⭐️8/10⭐️"
  },
  {
    "rating": "3.5/5",
    "review": "Long and lots of singing. The visuals are insane and Jeff Goldblum is always amazing."
  },
  {
    "rating": "5/5",
    "review": "Perfect cant wait for part 2"
  },
  {
    "rating": "5/5",
    "review": "'Wicked' was a great movie with an even better soundtrack!! This is the perfect movie for music lovers. The sets were also outstanding, along with the costuming. It truly brought the musical to a bigger than life picture that worked so so well."
  },
  {
    "rating": "5/5",
    "review": "It is a wonderful musical"
  },
  {
    "rating": "3/5",
    "review": "It was ok but not my favorite. I didn't read the book or see it onstage. Strong voices. A huge undertaking to put this together. I commend everyone for all their hard work. Costumes? Deserved the Award. Long. But oddly enough, I hung in there. Even more odd? I'd probably watch Part 2! I didn't find it \"a witches story\" so talked about. I did find a \"lesson\" in it, which I feel is important for all people young and old. I hope many got the \"message.\""
  },
  {
    "rating": "0.5/5",
    "review": "I thought it would be a film version of the play, but was utterly disappointed. They completely changed the motives of main character, instead of a feel good story of rivals to friends out of respect for each other. We got an activist made into a hero."
  },
  {
    "rating": "5/5",
    "review": "I finally got around to it and was so surprised. The cast, the sets, the direction were wonderful. Erivo and Grande clicked beautifully. It blended so well with the Wizard of Oz. Kurt Kocher"
  },
  {
    "rating": "5/5",
    "review": "I didn’t like the Broadway version, but really liked the movie. Great scenery, good songs and singers, good choreography, some great actors, and I found the story much more captivating than in the stage version. Looking forward to Part 2."
  },
  {
    "rating": "5/5",
    "review": "This movie is stunning. From the quirkiness of Ariana Grande, and the sincere emotion from Cynthia Erivo, it's a beautifully made film."
  },
  {
    "rating": "4/5",
    "review": "This movie is a great movie, I think this movie is too long. I deserve to be like Two hours not like 23 by and 30 minutes"
  },
  {
    "rating": "0.5/5",
    "review": "A combination of the very worst of stage musicals paired with the very worst of Disney excess. The original stage play had its charms; this monstrosity does not. Tedious, overlong, and frankly--boring."
  },
  {
    "rating": "1/5",
    "review": "Wickedly not worth watching could have picked a better actress besides Ariana grande thank you very much! And also slow in my opinion."
  },
  {
    "rating": "4.5/5",
    "review": "It’s been a while since I’ve watched a movie twice in cinema, absolutely loved it"
  },
  {
    "rating": "3.5/5",
    "review": "I enjoyed but I don't think I would watch it again"
  },
  {
    "rating": "2/5",
    "review": "If Ariana grande was not in the movie this movie would been perfect"
  },
  {
    "rating": "5/5",
    "review": "Didnt want to see it but was sort of cohersed into it. Well I am glad I did. I am not into musicals not at all this was fantastic! I cannot get over the performances even though the girl who played elfiba almost ruined it by all her nonsense with the pr nightmare she created. Grande did a wonderful job in her Glynda over the top giddiness as did all the others! Costumes, songs, the whole thing!"
  },
  {
    "rating": "4.5/5",
    "review": "I was prepared to hate the movie. But it was very well done. Aria Grande was excellent."
  },
  {
    "rating": "4/5",
    "review": "A great feel-good family movie!"
  },
  {
    "rating": "1/5",
    "review": "We managed to watch until the end just to know how they would end it but it was so boring and hard to watch..."
  },
  {
    "rating": "5/5",
    "review": "This movie was a masterpiece. Every inch of it immaculate."
  },
  {
    "rating": "3/5",
    "review": "Again it would have been a great movie without all that singing,classics should be classic movies without the singing.it ruins the movie!!"
  },
  {
    "rating": "1/5",
    "review": "This was a total departure from Oz. A horrible chic flick that left out wonder and imagination in exchange for senseless child drama and new-age living. I absolutely longed for the end of this movie as I suffered through it, and was sickened to have paid to see it in theaters. I loved Oz. This made me saddened to have suffered through it."
  },
  {
    "rating": "1/5",
    "review": "Finally got around to watching this movie. I was extremely disappointed. It was so slow and boring. How anyone thinks it's so wonderful is beyond imagining. Thank god there is always \"The wizard of Oz\" that I can watch when I want to dive back into this land."
  },
  {
    "rating": "4/5",
    "review": "Truly an enjoyable film."
  },
  {
    "rating": "5/5",
    "review": "Amazing! Award winning performances from Cynthia and Arianna. The music is so well done and the visuals are stunning. Cannot wait for part two!"
  },
  {
    "rating": "5/5",
    "review": "Phenomenal. Want to rewatch it right now."
  },
  {
    "rating": "3/5",
    "review": "This is a hot take but this movies very mid to me. The only thing that stands out to me is the set design. That was really great. Besides that there's not much that I liked. There's one song 'Popular' that I thought was fun and catchy. Don't see why people glaze this movie so much. I don't like Ariana Grande but she was good in this film. Well casted. I actually do like musicals like 'Hamilton' and 'La La Land' and 'Newsies'. Maybe this just wasn't my cup of tea."
  },
  {
    "rating": "0.5/5",
    "review": "I think rotten tomatoes likes to remove lots of negative reviews."
  },
  {
    "rating": "0.5/5",
    "review": "I guess I could chalk it up as simply par for the course when it comes to today’s bad, agenda packed renditions of actual classics. What a huge waste of 3 hours."
  },
  {
    "rating": "1/5",
    "review": "Ugh... yet another slapped together musical with nonsensical songs that are underperformed and mostly unintelligible. While the talent of the singers is legendary, the song selection and movies direction is abysmal. The highest accolade for this production is that had claimed the title of \"The Worst Musical Ever Made\"."
  },
  {
    "rating": "3/5",
    "review": "The storyline was not bad at all, yet the singing seem awful in some parts. Almost made it hard to watch."
  },
  {
    "rating": "4.5/5",
    "review": "o Though a bit confusing in the early going, \"Wicked\" ended up being well scripted, well acted, with great effects, and some wonderful voices. The two principals were amazing as was Goldblum who carried off his number with style. I had never considered him a singer before seeing this but he performed marvelously. Michelle Yeoh was wonderful as was the entire supporting cast. The cinematography was spectacular and the sound recording and editing was as good as it should be for a musical presentation. I have been a fan of the Wizard of Oz since first seeing it when I was eight. The most impressive character was the Wicked Witch of the West played by Margaret Hamilton. Cynthia Erivo honored Hamilton with her portrayal of this character. The story was well designed - the writers found a way to take us back to before Dorothy while recalling the original story. A real winner that I would give a higher score to it, if I could, but I found it too operetta-like in some cases. Script was sung that would have been better left as spoken dialogue. If not for that, the movie would deserve five stars but because of that I can only give it four and a half. But, it's definitely worth the watch. Summary: A great musical."
  },
  {
    "rating": "5/5",
    "review": "Nothing but good and great."
  },
  {
    "rating": "5/5",
    "review": "That cliffhanger was amazing! Elphaba's solo had me tearing up. Can't wait for the sequel"
  },
  {
    "rating": "5/5",
    "review": "MOVIE OF THE YEAR!! It made me defy gravity"
  },
  {
    "rating": "1.5/5",
    "review": "Predictable because everyone knows about the wizard of Oz movie . steals a lot from Harry Potter movies and possibly from Dr Strange Colorful .. but wow . Didn't know it was going to be a 2 parter.. Couldn't understand the words .. And holy crap thought Galinda was supposed to be nice . To me she seemed like a backstabber, a liar, and not at all a good person or friend.. seemed like she should of been green as she was clearly jealous of Alda"
  },
  {
    "rating": "5/5",
    "review": "A delight from beginning to end."
  },
  {
    "rating": "4/5",
    "review": "I dont know what all the shade was about. The movie was good. Not great, but good. It sent a positive message to all who get carried away with appearances. Snow White was purposely less attractive than the queen. The only thing that still baffles me is: why does grumpy look so much like Tommy Lee jones? Its no coincidence that in real life he really is grumpy and frugal and that his acting debut was at 7 years old where he also played a dwarf in Snow White. No one mentions this!"
  },
  {
    "rating": "5/5",
    "review": "I want to watching this movie"
  },
  {
    "rating": "3.5/5",
    "review": "Blobbo not young girl in target audience but movie seem well done. Skinny girl good singing voice. (If young girl go see.)"
  },
  {
    "rating": "5/5",
    "review": "All fantasy genres I really like, including this wicked movie, won't get bored to watch the movie many times."
  },
  {
    "rating": "4/5",
    "review": "Plot seemed to move very slowly over all good movie"
  },
  {
    "rating": "5/5",
    "review": "Amazing Movie Stellar Cast Excellent Performances Musically Talented Actors everything about this movie was great and enjoyable from start to finish I highly recommend it to anyone!"
  },
  {
    "rating": "2/5",
    "review": "So I'm going to start with the positives. I think the movie looks really good. And I really enjoyed the Wicked witch of the west. She made me laugh and I enjoyed her singing and acting. I just found the movie kind of boring. And I'm not sure if Ariana is paying a bad actress? Why does she look like she's starving to death? Is that part of the character? I have not seen the play. But Ariana singing just isn't what I would expect from a professional singer. My wife saw the play and loved it. But couldn't sit through the movie. I don't know? I wouldn't suggest this movie. Unless you're into musicals. If you're not I just don't see this movie capturing your attention."
  },
  {
    "rating": "3/5",
    "review": "It was pretty good, but it was very long."
  },
  {
    "rating": "5/5",
    "review": "Directed by jon chu, Wicked tells a story of a girl named elphaba,she is a girl misunderstood cause of her skin color ,she was born with the green skin.In the movie,she grown and start to discover her power.At the school of magic ,she meet Glinda,who is very popular and start became friend but they have a different destiny.The plot seem to be unpredictable,gripping.I think that de special effect are just stunning,all effects are prefect,the power,the background,it’s look very realistic and we have the impression to be in the movie.The photography is just incredible and the global visual is very realistic.The acting of the actress look very natural,fabulous,spectacular ,we don’t saw that they played.The role is spontaneous and doesn’t look overreact.I love the script,this musical comedy reach of theme that we doesn’t discuss everyday and I think it’s good to talk about it,don’t judge about the physical,the true could be att the final not what we expected,the power and the popularity don’t define a person. Generally I find this film absolutely fascinating,the theme reach are very interesting,everything was perfect,the acting,the music,the directing.I recommend this film to anyone who loves comedy musical magical and enchanting If you haven’t seen it yet, you don’t know what you have been missing."
  },
  {
    "rating": "5/5",
    "review": "I saw so many people walk out of the cinnema when the movie was finished, either crying or happy. I was one who did both. For multiple reasons I have known Wicked since 2019, so when I heard that they were making a Wicked movie starring these 2 absolute powerhouses Cynthia and Ariana, I was so happy. Ariana wanted to be in Wicked since she was little, and Cynthia was no less than perfect to play Elphaba. Their chemistry on camera and off was so amazing they made their characters connection really come to life. The special effects, the voices, the ensemble, the acting, the feeling that you are watching a real story when its fiction, everything is amazing. If you havent seen Wicked...are you living under a rock? (Holding space for this movie)"
  },
  {
    "rating": "5/5",
    "review": "This movie was incredible cynthias and arianas voices were incredible. story was incredible the sets were to die for and the costumes,hair and makeup were to die for absolute must-see"
  },
  {
    "rating": "5/5",
    "review": "I loved the songs. I loved the sets. I love the costumes. I love Jeff Goldbulm. Not so keen on Cynthia Erivo, but she does give a great performance and she sure does how to belt the songs out. But I think Ariana Grande stole the show with her singing and her literally eating the scenery. This movie is definitely popular."
  },
  {
    "rating": "5/5",
    "review": "Yes it’s a musical and yes it’s Broadway. And Yes I loved it. The cast was great. I enjoyed the musical on Broadway several years ago and was hoping for the best and well, this surpassed any expectations. POPULAR! The chemistry between the two leads was fun, funny, touching and fantastic."
  },
  {
    "rating": "5/5",
    "review": "Amazing musical movie."
  },
  {
    "rating": "5/5",
    "review": "They both did such a good job :,) Definitely thought because it was Ariana i wouldn't be able to see her otherwise but she became her role completely. And their voices made every song amazing. I usually don't get super into musical movies but i loved this. The end had me balling. I felt their friendship through the screen frfr. Very excited for part 2 !"
  },
  {
    "rating": "0.5/5",
    "review": "Terrible movie, took a 2 hour play and made it into 3 hours for part one. Would not recommend."
  },
  {
    "rating": "0.5/5",
    "review": "It was wicked to make me spend 9 dollars on this bologna. Cringe."
  },
  {
    "rating": "1.5/5",
    "review": "My overall first impressions was I did not like this movie. But I went into this with ideas based on what I could remember of the Wizard of Oz, and so it was hard for me to readjust my perception on who I thought was going to be \"wicked\" and who was not. And even when I it dawned on me who I was supposed to like and dislike, that too took another turn. I think in hindsight, had I been informed about what the Broadway version of this story was all about I would've been more accommodating. But putting that aside, I also found the songs to be for want of a better word \"off-key\". A lot of the notes just keep going in the wrong direction for me, and I found that I could not hum along. I like musicals that have songs that are easy to pick up and for some reason I could not do it here. So, that was enough for me to be meh about the movie. But, if I was to analyse this movie from a critical perspective I'd have to say the casting was just sublime - from the somewhat shallow, but on the very edge of breaking through into someone of substance Galinda, to the enigmatic and charming, but ultimately serving no real purpose at all Oz. And though I have no love for the songs, they were delivered with great emphasis. And the stage settings were very innovative and a delight to look at. It just bugs me that on this occasion, reading a synopsis of the Broadway Version might have made a difference for me."
  },
  {
    "rating": "5/5",
    "review": "Amazing I've watched it about a million times already im still not over it and I never will be im so excited for the new movie"
  },
  {
    "rating": "3/5",
    "review": "Great Visuals ,no Real Munchkins,and terrible songs except for Popular. 🤣"
  },
  {
    "rating": "3.5/5",
    "review": "Great movie, but some lighting needs to be fixed."
  },
  {
    "rating": "5/5",
    "review": "A massive tug on the heartstrings through nostalgia, fantastic acting, mind blowing set pieces, out of this world costume design and music that will bring tears to your eyes. Cynthia and Ariana deserved more recognition for their generational roles. Perhaps we see more awards for this group on the second go around later this year? I certainly hope so!"
  },
  {
    "rating": "2/5",
    "review": "We’re only 40-min into watching this movie and it is already so boring and predictable. Ariana Grande is a wonderful singer but barely adequate as an actor: stay in your lane, Ms Grande! Cynthia Erivo, however, is perfect for the role of Elphaba possessing both the Broadway musical singing power and the necessary acting chops to pull off this major role. Splitting this story into two parts is just a blatant attempt to milk the public for all its worth. Musicals are best for the stage and Hollywood hasn't made a decent musical movie in decades. Give us as live theater musicals and spare us for all the campy acting from Ms Grande, Bowen Yang, and most of the others, with the exception of Michelle Yeoh (who should never be asked to sing ever again)."
  },
  {
    "rating": "2.5/5",
    "review": "I love the Wizard of Oz. I've seen this on stage a few times and now the movie. I would say the music and the production is very good and have some catchy tunes. However, I hate the story line and feel like it does not line up with the original story. The Wizzard was never meant to be the bad guy. It just does not line up with the original story line. I think Oz, The Great and Powerful actually gives a much more believable story of the Wizzard and the witches. Say what you will about the movie, but the story line is solid and doesn't ruin the original movie."
  },
  {
    "rating": "0.5/5",
    "review": "the singing was literally every other minute, while their voices are great, the songs and music were horrible. the songwriters are horrible, if i brought my kids to see it i’d have to leave. way too long of a movie for them to be singing every other minute with crappy songs. honestly disgraceful to the original Oz movie. i feel like i wasted almost 3 hours on this dreadful movie. glad i didnt spend any money on it or id be livid."
  },
  {
    "rating": "5/5",
    "review": "Amazing portrayal of reality, a necessity with the lack of morality today."
  },
  {
    "rating": "2/5",
    "review": "I didn’t really enjoy this movie that much. The editing wasn’t that great, and I hate mostly musical films. That what this movie is, and that’s why I give it this rating. I can’t say I’ll watch it again, but for others may have different thoughts."
  },
  {
    "rating": "5/5",
    "review": "Esta película es excelente la mires por donde la mires. Se la recomiendo a cualquier persona que disfrute de los musicales o quiera ver un musical por primera vez"
  },
  {
    "rating": "1.5/5",
    "review": "This movie was a struggle to watch. The extras' acting was bad and over the top, and the actresses for Galinda and Elphaba felt like they were just saying lines or singing. I couldn't connect with them because there were no genuine emotions from them. It was difficult to hear the background music for the songs which didn't help portray the current scene's emotion."
  },
  {
    "rating": "1/5",
    "review": "I know that it is a musical, but the singing is just excessive if there hadn't been so much singing the movie would have been great because the storyline is good."
  },
  {
    "rating": "1/5",
    "review": "Can’t understand why it’s so highly rated. I really like musicals and this was unbearable. Ariana Grande was not right for the role in my opinion, not a commanding presence like the green witch. We had to skip to the end where they had the scene of defying gravity."
  },
  {
    "rating": "5/5",
    "review": "I liked it, Almost fell asleep didn't like that."
  },
  {
    "rating": "4/5",
    "review": "If conventional musicals are your thing, this is a must-see. The production and signing are top-notch (this is definitely Erivo's shining moment). However, the leads are let down by a weak and underdeveloped supporting cast."
  },
  {
    "rating": "5/5",
    "review": "I think I can confidently say that “Wicked” is one of the best movies I’ve ever seen. It was very entertaining and simultaneously heartbreaking. The songs have been stuck in my head since the movie came out. The issues covered in the film are also easily relatable to real world issues. I feel like many movie musicals often struggle with the transition from dialogue to song but they did amazing with “Wicked”! I was pretty skeptical when I found out that Ariana Grande was cast as Glinda based on the music of hers that I’ve heard and her previous acting abilities (tbf, I’ve only ever seen her on “Victorious” and “Sam & Cat”) but she was an incredible Glinda. I really don’t think anyone could have played her any better. They also couldn’t have picked a better Elphaba; Cynthia Erivo is so talented in every way and she has one of the most beautiful voices I’ve ever heard. I definitely recommend watching “Wicked”."
  },
  {
    "rating": "4/5",
    "review": "Wicked was straight up magical. I wasn’t even sure I’d vibe with a musical about witches, but holy crap, it sucked me right in. The whole Elphaba and Glinda thing? Pure gold. Cynthia Erivo’s voice gave me chills, and Ariana Grande was legit sparkling. The sets and costumes were like stepping into Oz for real, all bright and wild. The songs? Catchy as hell. I’ve been humming “Defying Gravity” nonstop. It’s funny, it’s heartfelt, and that twist on the Wizard of Oz story felt so fresh. Absolute wizardry. Left me grinning like an idiot."
  },
  {
    "rating": "5/5",
    "review": "Don’t miss this! I avoided seeing the musical for years, then I continued avoiding the film. My husband and I finally sat down and watched the streaming video of it tonight. I don’t think I’ve lived a movie this much in a long time! The songs were adorable, the sets and costumes beautiful and the cast was fantabulous!"
  },
  {
    "rating": "4/5",
    "review": "A beautiful film, with two incredible actresses and an impressive performance. It's a shame the songs are bad, but it's still one of Disney's best."
  },
  {
    "rating": "1/5",
    "review": "No, I couldn't feel the magic. Marketing for this movie is too overly."
  },
  {
    "rating": "2.5/5",
    "review": "Glinda has a fabulous voice. However the had no personality in her character. She didn't come off as nieve just a stiff spoiled blonde brat. The rest of the cast and story was amazing."
  },
  {
    "rating": "5/5",
    "review": "Fantastic movie. Everything from the sets and costumes, to the actors and musical performances are stunning. All lead actors - Erivo, Grande, Bailey, Yeoh - are incredible in their roles and deliver excellent takes on the original musical. Ariana Grande's comedic timing in particular was a highlight, along with Cynthia Erivo's dazzling vocals and Michelle Yeoh's chilling villainy. The soundtrack was appealing and featured some excellent foreshadowing that many viewers may not pick up on in their first watch. The storyline was wonderfully faithful to the original musical with hints of the Gregory Maguire novel and Wizard of Oz lore, providing a special experience for fans of related media. A must-watch movie that well deserves its positive reviews."
  },
  {
    "rating": "4/5",
    "review": "I'm not a huge \"musicals guy\" but found this film to be pretty good and watchable. I watched it per my wife & kids wanting to see it, and even remember laughing a few times during it. Lots of good singing, effects, humor and heart. And Goldblum, of course, haha. Anyway, I don't feel like doing a full review here. 4/5 stars. And as a side note, Jon Chu is an incredibly hard worker, as is his entire family. I used to work right next to Chef Chu's in Los Altos, CA where his father (and some family) run the famous restaurant. They are all very hardworking, kind and generous people."
  },
  {
    "rating": "1/5",
    "review": "The last half hour is decent but to get there you have to endure two hours of tedium, unmemorable songs and various mild to medium irritations. Not quite sure who it’s meant to appeal to but it clearly does judging by the reviews."
  },
  {
    "rating": "4/5",
    "review": "It's a true feat production-wise. It's dazzling, wonderfully choreographed and Jon M. Chu directs this with so much confidence."
  },
  {
    "rating": "4.5/5",
    "review": "Perfect casting and wonderfully colorful art direction make this movie shine. It captures the spirit of the play without losing any of its charm. Even at a lengthy 2 hours and 40 minutes, it doesn't overstay it's welcome or ever feel monotonous. It was one of the best broadway play adaptations to film."
  },
  {
    "rating": "1/5",
    "review": "Overrated. The story and acting are fine, but the music sucks. There's more memorable songs in Snow White."
  },
  {
    "rating": "1/5",
    "review": "I'm sure others enjoyed this film, and I do enjoy a handful of musicals. This WAS NOT my cup of tea, the one upside is that it did make me laugh, at it! I think since I'm not a fan of the wizard of Oz at all, maybe that's why I hated it, but it honestly felt like a very different movie and i still didnt like it. There's a song almost every 2 minutes, the references to the wizard of Oz felt forced and, it oddly reminded me of the show Wednesday and Harry potter films merged together. I did not find it unique, but rather a hodge-podge of various themes that are tired and redundant."
  },
  {
    "rating": "1/5",
    "review": "Music obviously is great. Loved the story when seeing it on stage, and it's not like they changed that. However something about it doesn't really work. I get it, it has hype and everyone is supposed to love it. Maybe if you haven't seen it on stage it's spectacular. Maybe it's the same concept as \"the book is better\", but the film just doesn't have the magic. The acting is underwhelming. Ariana is the best, however it just feels like she's doing a Kristen Chenoweth impersonation the whole time. She didn't make the character her own, maybe she would have failed if she tried, so it's a bit of stacked deck either way. As far as Cynthia goes, her first song made me think \"why didn't they get a professional singer?\", then I looked her up and was shocked. She clearly has the singing pedigree so it has to be something with stage singing not translating to film, or the sound recording. There's just something off with her solos. Visually it's nothing special, CGI is average at best. Overall the film is just underwhelming. End of the day, it's fine to experience the story and music if you can't see it on stage or if live musicals aren't your thing, but the film doesn't hold a candle to a live performance. Other Broadway to films have been done successfully, this one just falls short. This is ok for a one time watch, but repeated watches would be a task, especially at 2 hour 40 minutes. (OMG it's really only part one😭 I thought they were going to do like a cute intermission in this film not split it into two movies. wtf?!)"
  },
  {
    "rating": "5/5",
    "review": "I have never seen the broadway show or anything that relates to this movie. I was blown away. The story, the music, the visuals, the casting, everything was absolutely on point. Can’t wait to see the next installment."
  },
  {
    "rating": "4.5/5",
    "review": "I……am………….speechless!!!! One of my top 3 favorite movies of the year!!!! Both story, and musical wise, it’s everything and anything you could possibly imagine! It’s a great musical/adaptation/prequel to Wizard of Oz! 💚🩷"
  },
  {
    "rating": "2/5",
    "review": "Movie is well executed. It is easily 70% song and dance, which is really not my cup of tea, but it can be really enjoyable for some. It plays like a high school musical, and not necessarily bad."
  },
  {
    "rating": "3/5",
    "review": "Stunning imagery and great chemistry between characters. I felt it lacked heart in areas and was at times too one tone in color scheme."
  },
  {
    "rating": "5/5",
    "review": "i'm a little late to the party, but this was 10/10 fantastic. I've seen the musical live & frequently jam out to the OST, so I was a little skeptical of this film at first; I didn't want them to ruin it. but it was spectacularly wonderful - I thought they did a really fantastic job. the acting, the singing, the soundtrack, the imagery... everything was fantastic. i laughed, I cried, I watched it twice back-to-back. fan or not, I think everyone would enjoy it."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute narcissistic lib garbage. Really bad acting. Pure dribble from start to (didn't come quick enough) end."
  },
  {
    "rating": "4.5/5",
    "review": "This wildly enchanted venture into the world of Wicked, created by Gregory Maguire and brought to life by Jon M Chu and Winnie Holzman, will keep you entertained the whole way through. I'm not one for writing reviews, however the amazing direction, production, and casting encapsulates the tale fantastically! You must bring room for laughs, love, and briefly tears when buckling in for the ride Cynthia Erivo and Ariana Grande take you on! The singing is superb and there couldn't have been a better way to leave us to pining for more. I will leave you with this. Wicked For Good (Part 2) releases November 21, 2025, and my family has already made plans to be there opening weekend to support this two part film that will forever be a part of our discography at home!"
  },
  {
    "rating": "1/5",
    "review": "Was ready to walk out after the first 10 minutes, and was at risk of slitting my wrists at 30 minutes. This happens every time a company tries to re-make a classic. Stop doing that! Save yourself the stress and waste of time and money."
  },
  {
    "rating": "1/5",
    "review": "I'm not half way through it and am reviewing it as a one star. So stupid, the songs are stupid the plot is stupid. I'm not sure how others claim it's anything to do w the original. I simply hate it, the acting, the songs, the plot are terrible. Please do not waste your time with it."
  },
  {
    "rating": "0.5/5",
    "review": "Over rated I guess if you like musicals it's great, but not a good movie, the story has to many holes, missing the munchkins. Over corrected from the original."
  },
  {
    "rating": "5/5",
    "review": "Loved it! The acting and singing were incredible!"
  },
  {
    "rating": "4.5/5",
    "review": "I have never been a musical fan, but this one was great. I cried at least 4 times. Very inspirational ."
  },
  {
    "rating": "4.5/5",
    "review": "I have never seen the theatrical version of Wicked, but listened to it on Spotify. I watched the movie adaptation and loved it. I like musicals in general and as far as favorites this one is tied in my top three, I just can't seem to choose a top one. I cannot wait to see the continuation."
  },
  {
    "rating": "5/5",
    "review": "I melted into this movie. Delivered beautifully, the artists captivated me while taking me through a range of emotions. The makeup and wardrobe teams did such great and detailed work as well, I could not look away. All the nostalgia of childhood was touched on, like the shoes, the movements with the big cape, and the classic bike. Also so impressed with the ombré lip on Elphaba."
  },
  {
    "rating": "4/5",
    "review": "There were a lot of plot holes in the story, but overall it was such a fun movie. The performances were spectacular and the visuals were beautiful. I'd definitely recommend it for fantasy and musical fans!"
  },
  {
    "rating": "3.5/5",
    "review": "I mostly liked this movie. The music, scenery, and special effects were pretty good, but it was quite long and drawn out. I would have appreciated a greater demonstration of Elphaba's powers to make the movie more exciting in my opinion. I'm just used to the witch being evil and here she's just too nice. I would have liked to see her use her powers for destruction and to teach others a lesson."
  },
  {
    "rating": "4.5/5",
    "review": "There are a lot of overlapping themes that play into this movie but I think that all of them made perfect sense toward the end and with how Elphaba's character related to Galinda as she worked to position herself as the most likeable of all the students in Shiz - it was complex and relatable because you could see how the differences in acceptance as it correlated to the student body could cause a split in causation for the evolution you see through both girls. I feel that Galinda is the perfect representation of the mean popular girl that every finds charming and sweet who actually finds herself challenged by the girl who is less popular and perceived to be strange due to the attention it brings. I am curious about the next installment."
  },
  {
    "rating": "3.5/5",
    "review": "The 2 hours and 40 minutes went by fast but I wouldn’t watch it again. The set was interesting and pretty. Some of the CGI was really sketchy though. I did really liked that Idina Menzel and Kristin Chenoweth was in it briefly."
  },
  {
    "rating": "3/5",
    "review": "It’s a great movie itself - actors, costumes, soundtracks. Though it kinda delivers a message that ignorants can fit well in the system; people with integrity will be bullied and outcasted. One less star to the implications."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie, I was so worried I'd hate it but omg. And it's so sad, the way they portray the characters. The backstory behind why the wicked witch is the way she is, its spectacular. I also loved the scene where Glenda and elphaba danced, it was beautiful and moved me to tears. Favorite part right there, also Justice for professor dillamond!!!"
  },
  {
    "rating": "5/5",
    "review": "Combining the best of both the musical and the book, resulting in something greater than either."
  },
  {
    "rating": "3.5/5",
    "review": "Spectacular! But not perfect, and I wanted it to be perfect… It did not need to be this long. Length made it feel uneven at times. Lovely cameos from “Adele Dazeem” and Kristin Chenoweth! But comparison side by side did not help Ariana Grande. As adorable as Ariana Grande is and clearly bent over backwards to sound right for the part, she is no Kristin Chenoweth! Unfortunately, with all my love for her, Michelle Yeoh was a total miss for me, terribly miscast, even though she did her best. Even Melissa McCarthy would have been better. Bette Midler would have nailed it. Helen Bonham Carter, Imelda Staunton, or Patti LuPone, or Bernadette Peters. So many better choices. I know, they never ask Broadway people to do film musicals. Why? No idea. Yeoh doesn’t have the right vibe of an “old battle axe”, which is what this part is and has always been in the Broadway version! I guess they wanted a big name and an Oscar Winner. Staunton has an Oscar nomination and she is a dame, and she is actually a singer! Bette Midler has two Oscar nominations and is a singer! Why didn’t they ask any of them? But overall quite fun. Musical numbers as stand alone are great! And visually stunning, but that was expected."
  },
  {
    "rating": "4/5",
    "review": "It was very good. Must watch. A little long though."
  },
  {
    "rating": "4.5/5",
    "review": "To be fair I wasn’t looking forward to it almost dreading it in some bizarre way but from almost the opening scene I was surprisingly impressed and that continued with the plot and the songs the sets and Ariana Grande was bloody excellent with just the right amount of haminess"
  },
  {
    "rating": "5/5",
    "review": "I am not someone who likes musicals ever. My daughter wanted to watch this but i have to say I actually liked it. The story line was great and I think they did a great job on this movie."
  },
  {
    "rating": "3.5/5",
    "review": "Magical musical brought to the big .screen. What fun! Can't wait for wicked part 2! Ariana Grande was hilarious as Glenda. Cynthia Erevo's powerful voice and performance was the heart and soul of the movie. 💚🩷"
  },
  {
    "rating": "3.5/5",
    "review": "Genuinely shocked by how much I ended up liking this movie. Because of how long it was on Broadway, I was sick of the memes and hearing the songs (only sung by fans, I hadn't ever looked the track up) I was sick of it by the time the movie rolled around and refused to see it in theatres. Now that its free on peacock I figured, why not? And boy I was tearing up at the end. The performances from both the female leads were amazing and the songs truly make the film. Glenda was such a comic relief the whole time she was on screen. The only nitpick I have about this is that I felt... a whole lot of nothing actually happened during the film? We get background on Elphaba, she goes to school, bonds with the goat professor, frees a cub, goes to a dance, then she sees the wizard. That honestly felt so fast and slow all at once. Although I've never seen the Broadway show and I have zero clue what's supposed to happen next, I almost wish they released both movies close together or just made this an HBO special with several parts. That being said this was so well made and a treat to watch."
  },
  {
    "rating": "5/5",
    "review": "What an amazing prequel to a classic tale. The cast,costumes,songs and cinematography was breath taking. It answers so many questions and I'm excited to see part 2. Tim Treakle"
  },
  {
    "rating": "1/5",
    "review": "This may not seem far. Watched Wicked…. Hated the play. Hated the soundtrack. Couldn’t finish the book or audiobook. The movie is so overproduced and boring. Lot of good talent lost in a poor production. Will the song “dancing through life ever end?” I can see how it was “overlooked” at the Oscars. It should have been."
  },
  {
    "rating": "2/5",
    "review": "Ok I was in no rush to see the film when it was released. So I waited until released on 4K/blu ray. Where do I start: 2 hours & 40 minutes. WAY too long. Sing a longs? I can not even remember one of the songs. I love great songs in films. Last song from a film I LOVED: \"Let It Go\" from Frozen. The \"polically correct\" character in a wheel chair. All the CGI. Film is great to look at I give it that. And a part 2 to be released November 2025 so we get the story of Glenda becoming the good witch. I've seen worse, I've seen better. Don't think it was worth the hype. I will not be in any hurry to see part 2."
  },
  {
    "rating": "3/5",
    "review": "Snagging 10 Oscar nominations, including for Best Picture, Jon M. Chu's adaptation of the Broadway show that concocts the intricate origins of the sisterhood of Elphaba Thropp, the Wicked Witch of the West, and Glinda, the Good Witch of the North casts spells but never quite potent enough to ward off the ticky-tacky Nickelodeonian story elements of the source material."
  },
  {
    "rating": "4.5/5",
    "review": "Loved it! So great to see a full musical that ENJOYS that it’s a musical. There is so much care put into the sets, dancing, and every actor is giving 110%. Even the background dancers are so amazing and talented. The costume design is so good and Glinda’s pink ball gown at the start is far more beautiful and gorgeous then anything Disney has made for their awful live action remakes. This Film also knows how important cinematography is when shooting musicals, the camera work emphasizes the motion of the dancing and songs. Every actress and actor is a talented singer and performer that was chosen because of how well they fit the role. The film is funny, emotional, and just overall a good time. Can’t wait for the next part and I’ll continue to listen to the soundtrack on repeat."
  },
  {
    "rating": "4/5",
    "review": "Super good movie and it subverted my expectations. Super fun and upbeat but also is able to get some tears out of you. It was a great movie with a stellar cast that really made this world something special. Cant wait for the second part!"
  },
  {
    "rating": "3.5/5",
    "review": "Wicked was great! As an avid movie-goer, I tend to stay away from musical films, but the storyline and the hilarious characters kept me entertained the whole time. I'm definitely looking forward to seeing the second part."
  },
  {
    "rating": "5/5",
    "review": "Good and with great views"
  },
  {
    "rating": "4.5/5",
    "review": "i love this musical movie, ariana and cynthia erivo one of the best for harmonization. can’t wait for part two!"
  },
  {
    "rating": "5/5",
    "review": "Enjoyed this movie, entertaining and enjoyable"
  },
  {
    "rating": "4.5/5",
    "review": "This movie is tragically beautiful and the voices and songs are so powerful."
  },
  {
    "rating": "5/5",
    "review": "Loved it but it there were like one or two parts that did not match the play but it was AMAZING!"
  },
  {
    "rating": "4.5/5",
    "review": "If you're a musical fan it's a must-see for you. The movie does justice by the musical, and the acting and singing are simply great. There are a lot of special and exciting moments. It's a bit too long, but still, it's clear that the writers, director and cats knew exactly what they were doing."
  },
  {
    "rating": "5/5",
    "review": "Absolutely wicked!"
  },
  {
    "rating": "1/5",
    "review": "My husband was moved by this, I however was left cold. I love the book and enjoyed the musical, unfortunately this had neither the depth of the former nor the simplicity of the latter. Hollywood has taken a great book and a clever musical and as is it's wont, managed to make worst of both! The storyline is a mangled confusion of the two, resulting in an uncomfortable mix of political fable and Musical. Yes the sets are impressive, rich, and complex, but after half an hour or so one is so overwhelmed by them and the colour saturation (presumably a reflection of the Garland film in Technicolor) that a rest in a darkened room may be advised. And the two main characters are woefully miscast. Cynthia's Elphaba is, unbelievably given she's green, unmemorable. The book describes her as an independent feisty, deeply political creature, whereas Cynthia's portrayal seems to be of a slightly wet and insecure girl. And AG's Glinda is so robotic she may as well be AI! The book describes her as charismatic, but selfish and bitchy with a sharp and witty tongue. AG is none of this. They both lack charm and screen presence and for me, despite the fact that they're the only two students not in uniform, they almost blend into the over blown background. All in all a disappointment."
  },
  {
    "rating": "5/5",
    "review": "An amazing adaptation of a Broadway musical, based of a fan fiction prequel of the Wizard of Oz haha. Incredibly colorful and well acted, Cynthia’s Defying Gravity was incredible. Ariana Grande finally got to play Glinda, very happy for her! They really brought it to life. I loved how they used real sets to recreate the magic of Oz, because the play version can be quite limited of course. Can’t wait for part 2."
  },
  {
    "rating": "5/5",
    "review": "One of the best Broadway musical turned into movie. So magical and the set design was so thought out and grand. The acting was so believable .. kudos to Ariana for pulling off this character. She made it her own but stayed true to the character. The vocals all around were amazing! The costuming was so whimsical! I cant Wait for part 2"
  },
  {
    "rating": "3.5/5",
    "review": "A solid film, though I wanted it to end before it ended and some visuals were a bit inconsistent."
  },
  {
    "rating": "5/5",
    "review": "Love love love can’t wait for part two!!"
  },
  {
    "rating": "5/5",
    "review": "A true masterclass in how to convert a Broadway musical into a live action movie. Cynthia Ervio is absolutely wonderful and completely “steals” every scene she’s in. However, that doesn’t discredit the stellar performances from the rest of the cast. A must see for any Wicked fan!"
  },
  {
    "rating": "5/5",
    "review": "Great musical score and the actors and actresses play their respective parts as they should. I’m not a big musical person but thoroughly enjoyed this all three hours of it."
  },
  {
    "rating": "5/5",
    "review": "Great movie, lots of hidden gems from the wizard of Oz."
  },
  {
    "rating": "5/5",
    "review": "SO SO GOOD The acting was spectacular (so glad to see Ariana back in acting haha) and the singing was incredible as well. Cynthia and Ariana literally changed the world here not going to lie. Now, Wicked is a long movie, and some scenes drag on a bit, but honestly the movie had me hooked the whole time, and it flew by! The sets and costumes are also amazing! This is a must see for anyone, not just musical theatre nerds!"
  },
  {
    "rating": "5/5",
    "review": "A MA ZING! Sums it up!"
  },
  {
    "rating": "5/5",
    "review": "An absolute masterpiece. The intricate details and in depth plot captivated me from start to finish. Of course all of the cinematography, soundtrack, performances and visuals were impeccable but the actual story line in itself was truly genius and left me wanting more. Cannot wait for part 2."
  },
  {
    "rating": "2.5/5",
    "review": "The storyline and dramaturgy made no sense at times, the unimportant and extremely boring details no one cares about dragged on painstakingly long and then blew through random 180 degree story reversals at the end, the songs all sounded the exactly the same and were so cheesy I found myself literally dissociating every time. Not to mention Ariana Grande and half the cast's acting. The art direction, costume design, and set design were FANTASTIC, but that's about it."
  },
  {
    "rating": "3.5/5",
    "review": "it was a great movie the one thing that was bad about it was that at the beginning the song just was boring and a little long ."
  },
  {
    "rating": "4.5/5",
    "review": "The kids and I enjoyed it. Will be back to see how it ends."
  },
  {
    "rating": "5/5",
    "review": "Absolutely perfect! It's long, but I honestly would've sat through 5 hours of this. Can't wait for part 2."
  },
  {
    "rating": "4.5/5",
    "review": "Wicked is a musical that tells the story of two girls that go from enemies to best friends. Glinda, Elphaba, Madame Morrible and the Wizard are the main characters. Glinda and Elphaba are students at Shiz, the school of magic. Madame Morrible is the principal. The Wizard lives in the Emerald city. I think it's a good film because I like the friendship between Elphaba and Glinda. Also, it sends a positive message that people are different and it's okay. This film is good for people who like musicals, fantasy and those who are Ariana Grande fans."
  },
  {
    "rating": "2/5",
    "review": "A lot of singing. And I just feel like it's not my type of movies."
  },
  {
    "rating": "5/5",
    "review": "Loved the movie cant wait for part two"
  },
  {
    "rating": "1.5/5",
    "review": "Muy aburrida... Nada que ver con la historia original"
  },
  {
    "rating": "5/5",
    "review": "By far one of the greatest movies I have ever seen. Everything from the performances - especially those of Cynthia Erivo and Ariana Grande, to the unbelievable score is truly fantastic - while \"Defying Gravity\" has always been a showstopper onstage, the film took it to a whole new level. It may have lost the Oscar for Best Picture, but it's always going to be a winner in my heart - and it deserved the two awards it did win."
  },
  {
    "rating": "3.5/5",
    "review": "Wicked is a well-crafted and successful Hollywood film—an enjoyable watch, for sure. But is it an Oscar-worthy film? No. It was good, but if it gets nominated for an Oscar, I’d attribute it more to political discourse than artistic merit."
  },
  {
    "rating": "4/5",
    "review": "I have to say I had a really fun time with this film. It had been really the first of its kind that I had seen in a long time. The last I saw in theaters was The Greatest Showman. The sets were eye candy and amazing. The singing was difficult to not sing along with.(I had to hold it in)Also it had been the first time I had seen Ariana Grande before. Which I found strange I had never seen her before. However I thought she was a wonderful character and actor in this film. I thought the film was great I applauded the film after the credits began to roll and so did everyone else in the theater. How Cinema should be."
  },
  {
    "rating": "0.5/5",
    "review": "What is it? because it's not a movie, and it's not a musical - It's just a gazillion hour long mash with no story, no change, no interest. I cannot for the life of me understand why anyone wants to see this, and why would anyone give it any amount of stats. even the 0.5 is too much in my opinion."
  },
  {
    "rating": "0.5/5",
    "review": "THIS MOVIE IS RATED HIGHER THAT INCEPTION, AND IT'S ALL THANKS TO BIAS. The only reason people like this movie is because it has, \"deep themes.\" oh yeah? well, the plot is HORRIBLE. It's all just filler, filler, filler. Either that, OR you don't know it's significance. because it will all be explained in the next movie. awful. Only watch this movie if it's at a theater and you can manage to not eat all your popcorn and drinks before the movie. Absolutely disgusting how popular this movie is. 0/10. would not recommend."
  },
  {
    "rating": "5/5",
    "review": "I went into watching this expecting to hate it & I cried like a baby during it. I loved it. The acting is sublime. The talent is unparalleled. The visuals are stunning. They took this musical and handled it with the upmost respect and created something incredible. It deserved better in the award ceremonies"
  },
  {
    "rating": "5/5",
    "review": "I like this film. so colorfull"
  },
  {
    "rating": "0.5/5",
    "review": "The movie was way too long."
  },
  {
    "rating": "3/5",
    "review": "I liked the story, but so. much. singing. Even for a musical."
  },
  {
    "rating": "0.5/5",
    "review": "This movie fails at everything it tries to do. The runtime is simply unacceptable and the movie is filled with Hollywood bloat. Copius needless dialogue scenes added with the characters taking significantly large (7-10 second) pauses between each line so the generic Hollywood score has time to play and tell the audience what emotion they're supposed to feel. Neither Cynthia Erivo nor Ariana Grande seems willing to give their all to their characters, with Ariana's poor acting being a particularly sore spot of the movie. The aesthetic of the movie leans towards plastic, fake, and overly CGI'd, completely losing any sense of immersion. The lighting is particularly dreadful and does nothing to support the story or the emotions of the scene. (The lighting for the final scene, in particular, is very bad.) The pacing is horrid. The movie lurches from slow dialogue scene to slow dialogue scene, occasionally grinding inexplicably to a halt to begrudgingly shoehorn in one of the songs from the musical that it attempts to pay homage to. The musical numbers are so underwhelmingly choreographed and shot, with two of the biggest and most iconic numbers in the show sharing the exact same setting and color palette (their shared dorm room). All this pales in comparison to how they murdered \"Defying Gravity\", which was all I was holding out to hear after over two and a half hours of stupid Hollywood slop. They insisted on chopping the song up into sections so they could continually cut away from it, completely stop the song to switch back to the generic Hollywood score, add fake tension to a scene that didn't need it, then once again come back and remember they're supposed to be singing literally the showstopping number. It's like if Les Miserables kept stopping \"One Day More\" to show you footage from The Wire. Just terrible. This movie didn't even deserve to play the songs from the musical which it so wickedly massacred. Prior to watching this, I had thought I might at least sit through Part II to hear For Good, but now knowing how poorly they executed Part I, it's not worth my time or money. I'll just put on the OBC soundtrack."
  },
  {
    "rating": "4/5",
    "review": "I got obsessed with the songs, the makeup, the scenario, is truly a great movie and i'm so excited for part , the end of the movie gave me goosebumps, Cynthia is a great singer and so is Ariana."
  },
  {
    "rating": "3/5",
    "review": "It’s not that easy being green. Pretty visuals. Good songs and music. Wish it was a complete story so I didn’t have to come back."
  },
  {
    "rating": "5/5",
    "review": "my favorite movie of all time"
  },
  {
    "rating": "5/5",
    "review": "The first time I have been in a cinema screening & people have stood up to applause at the end. Absolutely loved watching this with my daughter who loves musicals so this was a joy to watch together for her birthday celebration, looking forward to part 2."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is full of cringe content. Try hard musical with a weak message. The ratings are lies. Wasted time on a bad rental. I had high hopes after watching wicked in live theater. This movie should have never been made."
  },
  {
    "rating": "5/5",
    "review": "Wicked is an exceptional movie!!! The acting, music, cinematography, and sets were captivating. The story was heartwarming, relevant, and beautifully told in this epic movie. We loved the movie and can't wait to see the sequel!"
  },
  {
    "rating": "5/5",
    "review": "Is it enough for Wicked to be a better version of those live-action Disney remakes, one with more tactile sets, defter direction, and better leading performances?"
  },
  {
    "rating": "0.5/5",
    "review": "My god it was terrible. Literally made no sense. Hard to follow and confusing. Way too long and my the singing was relentless. The two lead women have such immeasurable talent and it's just wasted in thus nonsensical film. The only good part in my opinion was the very last 5-7 minutes maybe."
  },
  {
    "rating": "4.5/5",
    "review": "Lloré con Defying Gravity."
  },
  {
    "rating": "2.5/5",
    "review": "Was excited to see this, but honestly disappointed. Visually stunning, great choreography. The last 20 minutes were fantastic, but I had to sit through the rest to get there."
  },
  {
    "rating": "4.5/5",
    "review": "I had never seen the broadway production, but was vaguely familiar with the plot. It must have been a challenge to take something so widely loved and make it even better. I don’t like musicals but had to see Wicked for the culture moment. Cynthia Erivo gave me chills, and although I did not like the character of Glinda, Ariana Grande performed her very well. I went into this open to being impressed or just find it wasn’t for me, and I was so impressed. The costumes, the world of Oz, the plot, all were very absorbing. It’s easy to understand why this is such a beloved franchise."
  },
  {
    "rating": "1.5/5",
    "review": "Had to turn it off after an hour, didn't enjoy it at all during that time. Even for a musical, there is far too much singing and none of the songs were very good."
  },
  {
    "rating": "4.5/5",
    "review": "I had waited over a year for this film . I feel this film is easy one of the best films of the year . Ariana Grande & Cynthia Erivo were chosen Perfectly for their roles . I enjoyed watching their Friendship on Screen and the singing I really enjoyed ."
  },
  {
    "rating": "3/5",
    "review": "Let's be straightfoward. The story is bad. What was the whole Fiyero situation? That was so extra. I really hoped there was some more character development and more participation of other characters. I have no idea if it was actually an improvement from the stage show or not, but I have to say that the visual aspects were amazing, and there was no doubt that the singing would be fantastic, and it was. Ok movie but I don't think it was good enought to get 10 nominations in the Academy Awards. Sit back and enjoy."
  },
  {
    "rating": "2.5/5",
    "review": "Somewhat disappointing… references to the broadway show are cute at times but the acting wasn’t very good and it roughly took an hour before the plot began to form. Makes sense if you’re targeting almost a 3 hour run time. The singing was top notch but again, it’s an adaptation."
  },
  {
    "rating": "5/5",
    "review": "Everything about this movie was so great! Let me tell you, I’m a horror thriller girl and I freakin loved this movie. From the acting, to the emotions, to the jokes, and the visuals it was just pure fantasy entertainment! I also couldn’t stop listening to the soundtrack afterwards. I didn’t believe the hype till I saw it myself. Pure Bewilderment!"
  },
  {
    "rating": "3/5",
    "review": "Kind of annoying. Even so, the performances are great, the songs brilliantly belted out, and a final visual world to experience."
  },
  {
    "rating": "5/5",
    "review": "A MUSICAL THAT ISN'T AFRAID TO BE A MUSICAL! So good, the performances, the choreography, the music. 10s across the board. Cynthia Erivo and Ariana Grande can be as annoying as they want, they've earned it. As a Fiyero defender, Jonathan Bailey's hotness making the public appreciate Fiyero more is amazing for my agenda. Also, I've been a Boq hater in the past but Ethan Slater kinda made me like Boq more!"
  },
  {
    "rating": "5/5",
    "review": "E incrível como Wicked se torna um filme perfeito desde as suas músicas ao roteiro e a atuação de seus personagens. Um filme baseado no musical da Broadway Wicked e tão quadradinho que consegue ser perfeito em quase tudo, e difícil aponta um erro na direção de Wicked! A história sabe sobre quem é o que diz, em forma de musical ela sabe medi na dosagem certa onde é quando terá um momento musical com performance lindas de suas atrizes e de seu elenco. E quase impossível não se arrepia ao ouvir a Elfphaba (Cynthia Erivo) ao estrelar seu momento solo em Defying Gravity música própria do teatro da Broadway mais que brilha tanto ou mais A performance deste filme é encantadora e fascinante."
  },
  {
    "rating": "5/5",
    "review": "Cynthia Erivo, as Elphaba, did a fantastic action. She makes the character real, and her singing is so powerful. I have goosebumps and cry when hearing Defying Gravity at the movie's end. Ariana Grande, as Glinda, her character is funny, but when she sings, her emotions go with it. When Cynthia and Ariana sing together, they make it more perfect and act like real friends. Their feelings and friendship are realistic. The Original Soundtracks are way better than Disney movies these days. They are all good. I’ve listened to the original musical, and I like the movie version more. I personally like Defying Gravity, which makes me emotional; Dancing Through Life and Popular is a fun song. The Wizard And I has a great high note at the end; and One Short Day, featuring Idina Menzel, Kristin Chenoweth, and the original cast from the musical version of Frozen. Wicked is a prequel to The Wizard of Oz but focuses on how Elphaba becomes The Wicked Witch of the West. The story is about Elphaba and Glinda's friendship. They met at Shiz University in the Oz. Animals can talk and teach in the university, but the plot twist is that The Wizard of Oz is not a good person. He wants those animals to be blamed so he can continue controlling Oz. Still, Elphaba knows this and resists it by stealing the grimmer, the magical spell book, and becoming The Wicked Witch to resist The Wizard. Her relationship with Glinda reaches a crossroads as they take different paths. Even though the movie is 160 minutes long, I don’t get bored at all. Every moment and every action is worth watching. The CG is excellent. I watched it in IMAX, and the sound, the songs, everything feels so real. This is the first time I've watched such a great musical movie. Part 2 will be released on November 21 this year, and I will absolutely watch it. I’ve listened to the song For Good from Part 2, and its meaning really touches me. The people who said Wicked shouldn’t won the Oscar are biased and mad because their favorite movie didn’t win. Wicked deserves an Oscar, the reviews from critics and audiences are above 80%. This is one of the highest-rated movies in 2024 and the highest-rated musical movies in 2024. The whole song from Wicked debuts on the Billboard 200 charts, no other film can do this. This proves that Wicked deserves an Oscar."
  },
  {
    "rating": "5/5",
    "review": "As a fan of the musical I was NOT disappointed with this result. Fantastic visuals, costumes, makeup, cinematography, sound, everything. Great casting choices too!"
  },
  {
    "rating": "5/5",
    "review": "As someone who was fortunate enough to get to see the musical when I was in high school, I am so in love with this movie and dying to see part 2, For Good!!!!! It was a joyous, gorgeous, exhilarating experience and if I could afford to, I would go back to the theater to see it again and again! ¡¡Singing along is a religious experience!!!"
  },
  {
    "rating": "5/5",
    "review": "The visuals, spectacular! The music, spectacular! It was fun for me, my 2 teenage daughters , and my two preteen sons. Afterwards we learned the whole soundtrack together so we can sing it karaoke."
  },
  {
    "rating": "0.5/5",
    "review": "Little to no depth with some mildly improved singing on previous installments… not worth the watch perhaps part 2 will redeem it"
  },
  {
    "rating": "4/5",
    "review": "The special effects and singing!"
  },
  {
    "rating": "2.5/5",
    "review": "I just don’t see the appeal, sorry."
  },
  {
    "rating": "0.5/5",
    "review": "the worst, most overrated musical comes to cinema (as Hollywood has NO new ideas)... just another Marvel Comic event with a different set of bulls@!t heroes, singing the worst songs ever to be celebrated as great on broadway. trash movie and trash musical and the movie appears to be promoting mental illness by using these two insufferable women for leads, both clearly mentally ill.... just a terrible movie. go away hollywood studio execs..."
  },
  {
    "rating": "4.5/5",
    "review": "Wicked builds its university and its ambitious characters across a beautiful landscape of emotion and magic. Enjoy the show as if it were your only chance, because experiencing the Wicked experience for the first time is even more magical and enchanting than you could ever imagine. A special treat for fans of the original series, and a captivating story for those seeking magic in the deepest, most revealing sense possible."
  },
  {
    "rating": "2/5",
    "review": "Who ever know story, plots, Time line about wizards of OZ this movie may work. I just saw as sequal to OZ: the great and powerful and My biggest disappointed there is no connection, other than hot air balloon. Wicked is magical fantasy movie? This part 1 and run time 2 hour 40 Mins, not explained anything. why Elphaba is green, how Galinda got interest in Magic, why Goldblum revel himself to new comers, what forced Elphaba to go emerald City who never control powers, Why Elphaba risk herself for animals there is no impactful reason for this."
  },
  {
    "rating": "4.5/5",
    "review": "There is not much negative to say about this movie. Cynthia Erivo gives a stellar performance and will send chills down your spine when singing Defying Gravity. Ariana Grande wasn't bad but is definitely overshadowed in this one. The scenery and graphics are stellar. Some of the songs ran a bit long when they probably didn't have to"
  },
  {
    "rating": "3/5",
    "review": "The ending was great but it doesn't quite match the hype."
  },
  {
    "rating": "4.5/5",
    "review": "I hated wizard of ozz so i went into this movie expecting crap but it wasn’t at all. Very good story"
  },
  {
    "rating": "1/5",
    "review": "Rubbish film boring horrible songs one of the worst films I have ever seen"
  },
  {
    "rating": "4/5",
    "review": "É bom,muito bom mesmo"
  },
  {
    "rating": "2/5",
    "review": "Honestly, I dint even finish the film, its way too long, and it didn't deserve an Oscar, and Ariana Grande is more overrated than my balls"
  },
  {
    "rating": "5/5",
    "review": "great!!! suitable for recommendation"
  },
  {
    "rating": "3.5/5",
    "review": "I am a huge wicked on broadway fan and it was ... alright. Casting is great and they kept all the musical numbers, but I felt their was too much spectacle. Did not like how it is a 2 parter just to milk sequels."
  },
  {
    "rating": "0.5/5",
    "review": "Unoriginal and overhyped."
  },
  {
    "rating": "5/5",
    "review": "best movie. sangat bagus filmnya . rekomendasi film 2025"
  },
  {
    "rating": "1/5",
    "review": "Weak acting, weak script, destroyed the memory of a great Broadway play. Sad indeed."
  },
  {
    "rating": "5/5",
    "review": "Best movie ever they were equally excellent in this movie. I love them both. I am a big fan. Can’t wait for wicked too."
  },
  {
    "rating": "5/5",
    "review": "keren. hebat bagus sekali"
  },
  {
    "rating": "5/5",
    "review": "Film yang sungguh bagus sekali"
  },
  {
    "rating": "4/5",
    "review": "Wicked seems like a family movie to watch; the singing is pretty good. The movie makes sense, but this is before The Wizard of Oz. The witch Elphaba looks pretty nice. Elphaba in other movies is evil only because of her sister's death. But she is considered a wicked witch. I enjoyed the movie, but the only thing I don't like is the part about the animals. The animals have to stick up for themselves and how the animals aren't going to be able to talk anymore. I also like how diverse it is. Glinda and Elphaba get better throughout the movie, but Glinda doesn't seem like a good witch. And the romance was very short; I wanted to see more romantic scenes with Elphaba and Fiyero. I wonder what's going to happen to Elphaba and her relationship with Fiyero."
  },
  {
    "rating": "5/5",
    "review": "Better than I ever could have hoped. Absolutely pitch-perfect casting, stunning visuals, goosebump inducing renditions of all the music… Every aspect is treated with such love and care, and injected with that old-Hollywood flair. This movie is MAGIC"
  },
  {
    "rating": "1/5",
    "review": "To me this movie was nothing but a cashgrab. Inviting popular figures to play main roles. The movie told a story that could've been told in 1.5 maybe 2 hours in almost 3 hours. The music was too much (even for a musical) and everything felt way too sappy. The story was bland there isnt that much of a new spin and the new stuff that was there where cliches that didnt fit to well in the wizard of oz story. No thank you."
  },
  {
    "rating": "3.5/5",
    "review": "TUDO MUITO BEM EXECUTADO, FIGURINO, MAQUIAGEM, ATUAÇOES, ROTEIRO, ENTRE OUTRAS COISA COISAS MUITO BEM FEITAS, MUSICAS EXPLENDIDAS, MAS NÃO É UM FILME QUE CONTA COM UMA GRANDE HISTORIA, APESAR DOS PRODUTORES SE ESFORÇAREM PARA TORNAR ESSE FILME UMA GRANDE HISTORIA, WICKED É UM LIVRO POUCO CHATO E MONOTONO.L"
  },
  {
    "rating": "4/5",
    "review": "Movie was long but worth it"
  },
  {
    "rating": "4.5/5",
    "review": "Absolutely incredible!! The songs, the voices, the dancing, the costumes, the story line, the actors EVERYTHING is just perfect"
  },
  {
    "rating": "0.5/5",
    "review": "I despise these modern theatre kid style musicals most of the time so I can’t expect much but visually the wash-out of the colors and cinematography of the framing of characters and scenes was not nostalgic or magical enough either."
  },
  {
    "rating": "5/5",
    "review": "I really can’t understand how Wicked didn’t win Best Picture. This movie is great, the interaction between Cynthia Erivo and Ariana Grande was amazing, the music, costumes, sets, everything was incredible. I was not expecting much from this adaptation of a marvellous Broadway musical, but it definitely went above and beyond every single expectation I had. In all honesty, I wasn’t even expecting Ariana Grande to be so good at this either since most I had seen from her acting was some Disney. Also, the plot is as real today as when the Broadway musical came out. A “wizard” lying and manipulating the masses… what does it sound like? Okay, It didn’t win Best Picture in the Oscars, but at least people should learn from this movie to be very careful about believing in everything they tell us to believe."
  },
  {
    "rating": "4.5/5",
    "review": "We watched the premier a month following seeing the stage production on Broadway. The Broadway production blew us away, and the movie did not disappoint. I felt those same goosebumps during the movies climax as I did in the theater on Broadway. It had a large story to tell and was able to dive deeper than the play can, sometimes doing more than necessary, but all around a wonderful movie and adaption of the popular play."
  },
  {
    "rating": "5/5",
    "review": "Best movie ever they were equally excellent in this movie. I love them both. I am a big fan. Can’t wait for wicked too."
  },
  {
    "rating": "1.5/5",
    "review": "Not all films are meant to appeal to all audiences, thankfully, and this is definitely not my particular cup of tea. If you’re a teen age girl or a fan of saccharine fantasy or a fan of composer Stephen Schwartz’s god awful music (Sondheim or Rodgers or Loewe he absolutely isn’t…heck, he isn’t even Webber) then you might enjoy it. If not, it’s the cinematic equivalent of drinking Pepto-Bismol."
  },
  {
    "rating": "5/5",
    "review": "Wicked is the best movie ever! Ariana Grande was spectacular at making Glinda more than just a popular girl. Cynthia Erivo's vocal performances were STUNNING! Everybody was good in the movie not just the main cast. I've watched this 8 times. It is the best movie of all time! Absolutely see it!"
  },
  {
    "rating": "5/5",
    "review": "This big-screen adaptation of the Broadway phenomenon hit every beat, captured every nuance, and truly replicated the experience for those who can't travel to NYC to see the show. Cynthia Erivo showed why she's a Broadway powerhouse, effortlessly tackling some of the most vocally demanding songs, and left us wanting more. Ariana Grande also introduced herself to a new audience, as the pop princess handled the dramatic material with aplomb, holding her own with seasoned actors. So far this movie has been a box-office juggernaut yet they've been shut out this awards season, but if they don't win a couple Oscars, we'll know Hollywood doesn't appreciate excellence."
  },
  {
    "rating": "2/5",
    "review": "Great performances (the entire cast) and incredible production design don't do anything to help this rise above its genre expectations. Just your standard high budget spectacle in musical form."
  },
  {
    "rating": "4.5/5",
    "review": "Anchored by two absolutely dazzling central performances from Cynthia Erivo and a scene- stealing Ariana Grande, WICKED delights and moves with stylized musical numbers, beautiful technicals, and an undeniable way of storytelling that make it an unforgettable experience."
  },
  {
    "rating": "5/5",
    "review": "Well casted and great cinematography!"
  },
  {
    "rating": "5/5",
    "review": "Even though I haven’t seen the broadway musical yet, I loved this movie. It was well written, acted, and directed. The visuals and production design were phenomenal, the performances from Cynthia Erivo and the rest of the cast were outstanding, and the music and songs are catchy and memorable. It’s a fantastic journey into the strange and whimsical land of Oz and provides a fascinating backstory for an iconic cinema “villain” and is a great lead up to the classic Wizard of Oz story. I highly recommend watching this movie!"
  },
  {
    "rating": "2.5/5",
    "review": "Better than what I expected, but still not that great, Cynthia and Ariana had some good performances, but... I guess my opinion is different than others as I didn't really enjoy this movie that much"
  },
  {
    "rating": "5/5",
    "review": "This is the second time I've seen it. I got to share it with my son and a friend. So wonderful. My son is 7 and was glued to his chair. so cool to see him enjoy a musical with me"
  },
  {
    "rating": "5/5",
    "review": "Filmnya bagus dong 😃"
  },
  {
    "rating": "5/5",
    "review": "Sangat rekomendasi ni"
  },
  {
    "rating": "5/5",
    "review": "film keren banget!!!!!"
  },
  {
    "rating": "5/5",
    "review": "beautiful, stunning performances by both Ariana Grande and Cynthia Erivo. i had watched wicked on broadway before but the fast pacing and aesthetic cinematography kept me on my toes throughout. props to the creators for embracing its \"musical theatre-ness\", complete with full choreo and not pop-ifying the songs (i'm looking at you, mean girls the musical the movie wtf that was)."
  },
  {
    "rating": "5/5",
    "review": "Nice for this move. I don’t know for the explain again for this movie. Good job"
  },
  {
    "rating": "5/5",
    "review": "Best movie, ariana grande really cool."
  },
  {
    "rating": "5/5",
    "review": "I don’t even know how to explain how good this movie is"
  },
  {
    "rating": "5/5",
    "review": "Excellence in acting, costumes, and music I liked everything about it."
  },
  {
    "rating": "5/5",
    "review": "Very extraordinary film, very interesting storyline"
  },
  {
    "rating": "0.5/5",
    "review": "Drawn out long and draining"
  },
  {
    "rating": "0.5/5",
    "review": "Прекрасный фильм о расизме с расизмом. Здорово, что всеми способами пытаются угодить расовым меньшинствам Америки, при этом возвращаясь к оскорбительным клише про блондинок, отличниц и розовый цвет. Я так понимаю, с чем боролись на то и напоролись. Почему мир решил снова насрать на герли герлс, хотя в культуре столько лет пытались с этим бороться. Это так мерзко, как сюжет тщательно лижет жопу всем темнокожим, конечно, азиатам и оригинальному населению Америки. Ни в одном персонаже не ощущается личность. Все воспринимаются как переигрывающие актеры. Да, фильм по мюзиклу, но даже в мюзикле на сцене персонажи были куда живее. Тошнотная голливудская бурда."
  },
  {
    "rating": "3.5/5",
    "review": "way better than expected! amazing vocals too!"
  },
  {
    "rating": "4/5",
    "review": "The movie is good . It is very long though and I started to nod off towards the end. I didn't want to miss anything so I willed myself to stay awake. I would have been mad at myself if I had woken up and credits were rolling. Grande and Erivo are fantastic!"
  },
  {
    "rating": "5/5",
    "review": "We liked the singing, dancing, acting, sets, costumes, special effects, story line, everything."
  },
  {
    "rating": "5/5",
    "review": "Is the best recommended i m so impressed with the quality"
  },
  {
    "rating": "5/5",
    "review": "The storytelling and music are great. It’s worth watching/seeing it."
  },
  {
    "rating": "5/5",
    "review": "Kalian harus nonton film ini"
  },
  {
    "rating": "5/5",
    "review": "Musically, Wicked's songs like Defying Gravity and Popular are iconic, so expectations for the musical and vocal arrangements are high. If the film can maintain the emotional power of the Broadway stage and adapt it well to cinema, this could be one of the best musical films in recent years."
  },
  {
    "rating": "5/5",
    "review": "Oz Prequel, musical fantasy"
  },
  {
    "rating": "4.5/5",
    "review": "Great costumes and set, excellent performances"
  },
  {
    "rating": "4.5/5",
    "review": "If you never got to see the play, I can see how it wouldn’t make sense. If you havent seen the play, pease read up on wicked before seeing the movie. The movie was not as good as the play but it was still good. The cinematography, Cynthia and Ariana singing the songs made it worth the watch alone."
  },
  {
    "rating": "5/5",
    "review": "The first time I watched Wicked was on an inconspicuous Monday night. I went in not expecting much-- in fact, I almost didn't even go. However, Wicked blew me away. Ariana Grande's and Cynthia Erivo's vocals convalesced in incredible concert, and the musical ingenuity of Wicked's soundtrack has made a permanent addition to my playlist. In particular, The Wizard and I, One Short Day, Defying Gravity, and Dancing Through Life surpassed all expectation. The script masterfully jumped between quippy humor, introspective dialogue, and dazzling cinematic scenes. I can confidently say that I wouldn't hesitate to watch Wicked again-- and I did. Not even a month after my initial Wickedness, I bought tickets to see the performance again. The novelty had dissipated, but the movie still held up. Again, the music amazed, the cast entertained, and the movie enchanted. Wicked is an expectation surpassing, tactile masterpiece entirely deserving of its five-star rating"
  },
  {
    "rating": "3/5",
    "review": "Was decent, some words were hard to make out with all the singing, they weren’t clear."
  },
  {
    "rating": "5/5",
    "review": "Amazing acting and vocal performances from Cynthia Erivo, Ariana Grande, and the rest of the cast are icing on top of what is an incredible adaptation of the famous stage musical. The run time is lengthy, but they use every minute to tell the story in different ways than can be done on stage. All while displaying great reverence for the source material."
  },
  {
    "rating": "5/5",
    "review": "From broadway stage to big screen, very well done, great cast with amazing vocals and phenomenal choreography"
  },
  {
    "rating": "1/5",
    "review": "Though for many this will be a good movie but for me, I thought is was rather boring and WAY to long. I mean 3 hours of signing come on. (I was hoping for a wand duel to)"
  },
  {
    "rating": "4.5/5",
    "review": "10 años después de que Sam Raimi y Disney llevaran la magia de Oz de nuevo a la pantalla, Universal revive este mundo mágico con la adaptación cinematográfica de Wicked. No se trata de otra precuela de la película original que fue producida por MGM, pero tiene una estética similar. La película usa créditos clásicos como los de la película original y de cierta manera toma bastante del encanto musical de esta. Al igual que con la precuela de Sam Raimi, esta película es visualmente bella y colorida, con un magistral diseño de producción y alucinantes efectos visuales. Supieron plasmar la magia de Oz con la producción y los números musicales. Las canciones tienen el tono emocional de la película clásica y las coreografías se sienten muy fluidas y bien elaboradas. Es indiscutible que se trata de una obra de arte cinematográfica a nivel visual y hasta narrativo. Con respeto a esto último, hay que aclarar que tanto esta película como el musical de Broadway se basan en la novela Wicked: The Life And Times Of The Wicked Witch Of The West de 1995. Dicha novela actúa como una precuela del relato original, aunque tiene algunas diferencias con la obra de Baum. De hecho, se trata más bien de una reimaginacion del relato original o una realidad alterna donde La Bruja Mala Del Oeste nunca fue la verdadera villana. Tanto esa novela como el musical y esta adaptación usan la misma fórmula de Maleficent y Dracula Untold. Siempre ha sido interesante conocer el pasado de los villanos más conocidos del cine para entender sus motivaciones. Si hay algo que estas historias enseñan es que ser malvado no es algo con lo que nacemos, sino que es la misma sociedad la que nos da esa imagen. Esto está muy bien representado en la película Joker. En esta película Elphaba es una chica que sufre de prejuicios debido a su apariencia, pero que posee un increíble poder. A lo largo de la película vemos como eso hace que se vaya forjando la imagen de bruja malvada que ha tenido en la historia que todos conocemos. Cynthia Erivo hace un maravilloso trabajo tanto en la actuación como en el canto al darle vida a este personaje. Aunque se ha juzgado la elección de Cynthia, fue una elección acertada para darle credibilidad a uno de los temas fuertes de la novela que están en la película. La novela original se caracteriza por tocar temas adultos relacionados con la discriminación, los derechos de los animales y la corrupción política. Estos temas están bien plasmados en la película y ayudan a entender las motivaciones que llevan a Elphaba a convertirse en la enemiga de Ciudad Esmeralda. La única amiga de Ephaba es Galinda, quien tiene todo ese encanto y generosidad que siempre la ha caracterizado. Hay que decir que aquí Galinda tiene esa característica estereotípica de una dama tradicional que le da bastante encanto. Vemos que es alguien con una personalidad animada y que no se aleja de una quinceañera hija de una familia rica. Ella es como una caricatura femenina de la década de los 30 que luce bastante elegante y radiante. Ariana Grande hace brillar a este personaje con su increíble carisma y su bella voz. Su debut en la serie Victorious demostraba que ella tenía un gran futuro y en esta película logró demostrar de lo que era capaz. Es indiscutible que Wicked: Part 1 es una maravillosa película que ofrece una nueva perspectiva sobre el mundo de Oz, pero sigue manteniendo su magia. Mi calificación final para esta película es un 9/10."
  },
  {
    "rating": "5/5",
    "review": "I hope this movie wins a oscar for best actress ariana grande and best director and best screenplay and best picture 🤞🤞🤞🤞🤞🤞🤞🤞🤞🤞🤞🤞🤞🤞🤞🤞"
  },
  {
    "rating": "4/5",
    "review": "The film is beautiful, with stunning scenery and costumes and interesting attractions."
  },
  {
    "rating": "4/5",
    "review": "This movie will be remember not just for its costume and set design but because of Ariana Grande breakout performance. She does a great job being a co lead and at times over shines Cythina Erivo who has a great performance herself. But for me Grande was just amazing probably the best singer to actress conversation I have ever seen. As for the film I have not watch the musical play but this was a great way to not only get people interested in the play but in the world of Oz won't be surprise if more theater plays make the jump to the big screen. Overall, great film."
  },
  {
    "rating": "5/5",
    "review": "Best musical Ive probably seen. Cant wait til the the 2nd 1/2 comes out!!!"
  },
  {
    "rating": "4/5",
    "review": "Very visually appealing, which does a lot for me, personally. Cannot argue with the raw talent of the singers. Incredible. The only lack I found was perhaps in the way they pieced it together. Would watch again."
  },
  {
    "rating": "1/5",
    "review": "Übersetzungen die nicht zum gesungenen passen, langatmig und dann nur ein Teil? Absolut enttäuscht! Teil Zwei - kein Interesse!"
  },
  {
    "rating": "3.5/5",
    "review": "Good story line, acting and movie effects, but I was disappointed that I'll have to wait to see Part 2 to see how it ends."
  },
  {
    "rating": "5/5",
    "review": "I would get in a literal physical fight with anyone who had anything negative to say about this movie."
  },
  {
    "rating": "3/5",
    "review": "I liked it, but I didn't love it. Ariana Grande was amazing. I knew she could sing, but her dancing surprised me. To me, the dance numbers were the highlight of the movie. The \"Dancing Through Life\" sequence stood out to me as the best of the best dance numbers, reminiscent of the old time Busby Berkeley style of choreography. The special effects in the movie were dazzling, but not unexpectedly so. Overall, I was impressed by the music, but would have liked to have seen more of a plot. The movie could have been shorter. 2:40 makes for a long movie. By the end, I was not sorry to see it end."
  },
  {
    "rating": "4/5",
    "review": "A stunning 1st of half of a wonderful musical. The sceptical of this proves that movies can look and be stunning without so much CGI and massive budgets. The production design, costume, sets, make up is perfection. Cynthia & Ariana give us magical performances and genuine chemistry that flies off the screen. Can't wait for part 2!"
  },
  {
    "rating": "5/5",
    "review": "- A True Contender That Deserved the Spotlight Unlike some of this year’s baffling award favorites, Wicked was a cinematic triumph. Engaging from start to finish, it delivered everything a musical should—spectacle, heart, and unforgettable music. The performances were nothing short of perfection, elevating an already iconic score with depth and emotion. What makes Wicked stand out is how it masterfully balances its grand scale with intimate character moments, a challenge many musicals fail to meet. It was ambitious in every aspect and exceeded expectations at every turn. Frankly, I don’t understand how any other film could be considered over it this year—this was the true cinematic achievement."
  },
  {
    "rating": "4/5",
    "review": "Woww I love this movie, I expected a little bit more of it but it’s still great. The scene at the party near the beginning where everyone accepted Elpheba was so beautiful and that ending was absolutely amazing. But the movie is just too long and could’ve been way shorter. The first hour was slow and drawn out."
  },
  {
    "rating": "3/5",
    "review": "The set and ensemble was amazing. The creation of the Oz World was worth just watching the movie. Songs were not my favorite but this is personal opinion. Other family members love the music in Wicked. My biggest beef is that the book is 100x better than the musical which this movie was adapted from. If they make a movie true to the book it can be nothing but 5 stars!"
  },
  {
    "rating": "5/5",
    "review": "Great story line Well worth the time to go out to the movies"
  },
  {
    "rating": "5/5",
    "review": "A brilliant vision by Jon M. Chu!"
  },
  {
    "rating": "3.5/5",
    "review": "Beautiful production design with fantastic sets and costumes. Well acted and beautiful singing. I didn't really love the story itself, but it was fine. Some of the songs fell flat for me, and it probably could have been about a 1/2 hour shorter for my entertainment value. A plot line about the prejudice and targeted elimination of talking animals seemed out of place within the general tone of the story. Overall, a very well done movie. How much enjoyment you get out of it will probably depend on how much you like musicals. I'm generally \"okay\" with them, so my millage was probably a bit lower than some other people's."
  },
  {
    "rating": "5/5",
    "review": "The movie was perfection from the beginning till the end. From the acting to set design to the costumes to music and vocals. It was the greatest musical adaptation I have ever seen. Ariana Grande was a great Galinda she did the character justice. On the other hand Cynthia Erivo made Elphaba her own in a way that made the character more interesting than any Elphaba on Broadway. Jon M. Chu the director you are, you always bring musicals to life without killing their meaning and story while adapting them from the stage to the big screen. Even though the movie was 2 hours and 40 minutes, I watched it 5 times and never once got bored. The movie is a fun roller coaster to all musical and non musicals lovers."
  },
  {
    "rating": "5/5",
    "review": "Really enjoyed the music and the beautiful special effects. Looking forward to part two. This story never gets old."
  },
  {
    "rating": "4.5/5",
    "review": "This was an absolutely grossing and amazing movie, adaption of the world famous Wicked musical. The casting was perfect. I felt like some songs could have been more strong when it comes to acting, considering, their deep meaning. Other than that it was solid gold"
  },
  {
    "rating": "5/5",
    "review": "Easily the movie of the year. Based on the Broadway musical, this film is part 1, with part 2 still yet to be released. What a visually stunning, cinematic masterpiece. From outstanding acting by Cynthia Erivo and Ariana Grande as well as Jeff Goldblum and Michelle Yeoh to beautiful production design and cinematography to a solid retelling of the musical done in an epic fashion. There is absolutely nothing to critique about this film, except for the fact that we have to wait for part 2!"
  },
  {
    "rating": "1.5/5",
    "review": "I must be completely out of touch. I wanted to leave but I had to stay because I was with my family. For someone not enjoying it, it was way to long."
  },
  {
    "rating": "5/5",
    "review": "This was a fascinating movie! Well worth the time to get there. Music phenomenal, acting and special effects dramatic and totally engaging."
  },
  {
    "rating": "3.5/5",
    "review": "It was too long. The music was fantastic though."
  },
  {
    "rating": "5/5",
    "review": "Story line was excellent. Music great. Special effects fantastic."
  },
  {
    "rating": "5/5",
    "review": "Only dislike was the length yet still a two part show."
  },
  {
    "rating": "5/5",
    "review": "Loved the story, the cinematography was amazing. All of the actors have beautiful voices that help bring the story to life!"
  },
  {
    "rating": "4/5",
    "review": "I'm not even a musical fan, but have to admit this was quite good. Catchy tunes that's I'm unfortunately still humming days later. Only thing was it did drag on a bit, but wasn't as egregious, or didn't feel as bad as other nearly 3 hour long movies"
  },
  {
    "rating": "5/5",
    "review": "A MASTERPIECE. This movies is truly the best movie of 2024. Ariana and Cynthia really gave EVERYTHING on the screen. Can we talk for a second about the clothing? The world where it is build in? Eveyrthing is inmersive and the songs are just true wonders to my ears. THIS guys is how a great movie is made."
  },
  {
    "rating": "5/5",
    "review": "Even better than I thought it would be. I was turned off when I first heard that Ariana Grande was starring and I hadn't heard of Cynthia previously. F*ck was I wrong! Perfectly cast and surprisingly moving! To know that all of the audio for the movie was recorded live is impressive once you see it. I saw this twice already and will soon be taking my mother which will be a third time. If Cynthia doesn't win an Oscar for her performance, we'll know why."
  },
  {
    "rating": "5/5",
    "review": "I've never seen anything from the musical, except that one song I saw from Glee years ago. I've also never been a big fan of musicals. That said, this movie was so fun! I watched it with my 6 year old and we had a blast dancing around to the songs and giggling from all the passive-aggressive jokes. I highly recommend this movie for families to watch together ❤️"
  },
  {
    "rating": "3.5/5",
    "review": "The beginning half of the movie was quite slow and had too much “story building” without sufficient addition to the plot. Once the true story began it was quite exciting. Ariana Grande is an unconvincing Glinda. Could have been cast better."
  },
  {
    "rating": "0.5/5",
    "review": "Such a horrible movie, do not recommend."
  },
  {
    "rating": "4/5",
    "review": "A great fun twisting melody mixing filled with charming cast n performances it's a great invitation to revisit the amazing world of oz n also a ending twist for the next ♥️💫🦸‍♂️💯👏🎉😃👌"
  },
  {
    "rating": "5/5",
    "review": "Best musical ever! I love Wicked 💚❤️"
  },
  {
    "rating": "4/5",
    "review": "Musicals make me want to smack Andrew Lloyd Weber, but not this one."
  },
  {
    "rating": "5/5",
    "review": "I think they absolutely nailed this adaptation, it's gorgeous. Almost every word and scene in it is pulled directly from the stage musical, and the elements they added felt like they helped knit the story together rather than interrupting it. You can tell it was a labor of love. I do wish that this was released as one movie, but given the length, I understand why it wasn't."
  },
  {
    "rating": "5/5",
    "review": "My 8 year old daughter's favorite movie ever, that's a quote."
  },
  {
    "rating": "4/5",
    "review": "Too many musical numbers. At times it seemed like they were just going from one song to another for the sake of it. It would have been better with a bit more dialogue and more careful and selective placement of the music and dancing. Nevertheless, it was pretty entertaining and well acted with beautiful visual effects."
  },
  {
    "rating": "5/5",
    "review": "I was blown away by this movie!!! Didn’t plan on seeing this in theaters but I am so glad I decided to see this on the big screen. This movie is a 10 out of 10!! Amazing acting, singing and visuals that makes this movie an instant classic for future generations."
  },
  {
    "rating": "4/5",
    "review": "Fun for everyone, amazing music, and great acting."
  },
  {
    "rating": "1/5",
    "review": "boring movie, not sure why people even like it, about midway through we had to pause the movie and no one was interested to continue watching the next day or ever.... returned the DVD without finishing the Movie."
  },
  {
    "rating": "4/5",
    "review": "Adaptación en dos partes (esta apenas es la primera) del exitoso musical de Broadway. No hay mucho que comentar sobre la historia, ya es muy conocida. La producción es de primera, las actuaciones están muy bien, solo que tres horas para desarrollar solo la primera parte de la historia, me parece una exageración. Entonces, prepárate para ver un buen musical, pero con una duración que por momentos pudo (y debió) ser más sintético."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie! I usually don’t care much about musicals. But I’m so glad I went to see this movie. It was all around great. I’m actually quite excited about the sequel. Phile!"
  },
  {
    "rating": "4/5",
    "review": "A great transformation of how the misunderstood can become an antagonist, and much better than that of Revenge of the Sith."
  },
  {
    "rating": "5/5",
    "review": "This movie was truly an inspiration for the times we live in today. Truly enjoyed the movie"
  },
  {
    "rating": "5/5",
    "review": "Best movie ever I absolutely loved it and can’t wait for part two"
  },
  {
    "rating": "5/5",
    "review": "This is the best live-action film of 2024. One of the best in general, actually. The music is amazing, the cast is excellent, the world is huge and immersive, and finally, the plot is compelling and entertaining. Cynthia Erivo and Ariana Grande are some of the greatest talents of the 21st century. They perform so naturally it's great. The cast connects so well with each other it's insane. They're ALL great. The sets were built for real so when you're watching you believe it. Finally, the plot is tried and true from the Broadway musical, and, it works really well. 110% deserved a 5-star rating. SO GOOD!!!"
  },
  {
    "rating": "5/5",
    "review": "this movie was beautiful!!! 🩷💚"
  },
  {
    "rating": "5/5",
    "review": "One of the rare exceptions of a broadway show that delivers all of the charm of its theatrical version and properly translates it to the big screen. Weather you want to sing to it or just enjoy the show/music the cinematic version delivers on all fronts - excellent musical delivery, resonant personal interactions, clear story telling and panoramic scenes. An absolute must see weather you have been able to see it on stage or not. A few minor quibbles - there were no dwarfs/short people that could be seen for the roles of the Munchkins (why?), a somewhat forced same-sex relationship for background characters (again, why?) and lastly, Ariana Grande needs to be given a sandwich... she looked so thin and her shoulder bones, chest bones / ribs could all be seen prominently.. not a great look."
  },
  {
    "rating": "1/5",
    "review": "As my friend watching the film with me said when the train shows up....wow, windmills, why not???? Indeed, as long as you are just throwing every silly movie trick and trope in, why not windmills. I don't know what that movie was, but it was a lot of it."
  },
  {
    "rating": "5/5",
    "review": "Me encanto esta pelicula, las canciones, las actuaciones todo realmente fue maravilloso, estoy tan emocionado de ver la segunda parte, se merece ganar todos los premios en la que este nominada, verdaderamente perfecta en todos los sentidos."
  },
  {
    "rating": "4/5",
    "review": "oooooooooaaaaaaoooooooh! (ARIANA GRANDE)!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Sinceramente eu amei tudo no filme. Provavelmente se tornou o meu musical favorito. Que atuação das duas, elas foram gigantes!"
  },
  {
    "rating": "5/5",
    "review": "I can’t stop thinking about this movie - the songs have been on a constant loop in my head and the performances from the cast were spectacular."
  },
  {
    "rating": "4/5",
    "review": "Gorgeous songs with great vocal performances. The songs went directly to my Spotify. I was not crazy about the beginning, that felt abit unnecessary and a bit dragged out, maybe it will make sense in the second movie. When that is said, the story and characters were really interesting with some deep themes that connects to our own wold beautifully. The two main characters had great kemestry and I cannot wait to see where they take this story next."
  },
  {
    "rating": "5/5",
    "review": "Excellent! Surpassed expectations!"
  },
  {
    "rating": "4/5",
    "review": "Overall is very good. But casts aren’t all good. Music and cinematography are wonderful!"
  },
  {
    "rating": "3.5/5",
    "review": "WICKED faces the challenge of living up to its iconic predecessors—the Oz books, the 1939 film, the WICKED novel, and the Broadway sensation—all irreplaceable in their own right. While the film stumbles with a slow start and uneven pacing, its electrifying finale redeems it. But does it truly need to be split into two parts? Time will tell."
  },
  {
    "rating": "5/5",
    "review": "Probably the best stage to screen adaptation ever. This was made as cinema art, and not just filming the stage show like so many others. It's beautiful."
  },
  {
    "rating": "3/5",
    "review": "Too much singing. I dont like the to be continued at the end."
  },
  {
    "rating": "5/5",
    "review": "Speechless. ❤️ This is how I feel. This movie musical is just breathtaking. I already knew the story but how they delivered it was astonishing. The casting was perfect. Also I can say the costume design and the whole scenery was just out worldly and really special. So colorful and funny, emotional and just hits the right spots of your mind and heart. Ariana Grande's acting was top notch and of course Cynthia was perfect Wicked Witch 🧹 About the musical part I love how they delivered the songs, on a special way for the movie. It's different then what we are used to, but just as perfect, really suitable for the movie. For sure I'm going to watch it again. This is a show, one must keep on watching. My only wish is to see it one day live. ❤️"
  },
  {
    "rating": "5/5",
    "review": "Ariana Grande was great as Glinda. Cynthia Erivo was also great as Elphaba. And I 💜 the music."
  },
  {
    "rating": "5/5",
    "review": "Amazing at all aspects, really good music."
  },
  {
    "rating": "5/5",
    "review": "The acting, the singing, the dancing… COULD NOT TAKE MY EYES OFF THE SCREEN 😍🩷💚"
  },
  {
    "rating": "4/5",
    "review": "It really is the best musical movie ever made. If you've seen the original, you're bound to love it."
  },
  {
    "rating": "5/5",
    "review": "Hard to think of a better pairing for the two main roles. Wish I could watch it again for the first time. It was a little long for me, but the excellent performances by Cynthia and Ariana made it worth the seat time. I was wowed by the visuals and songs. Counting down the days for part two."
  },
  {
    "rating": "5/5",
    "review": "Ariana Grande encarnou a Glinda em todos os sentidos, sua atuação é extremamente cativante, mesmo que esteja interpretando uma personagem que não se importa muito com aqueles a sua volta. Cynthia Erivo também não fica para trás, suas expressões faciais e a maneira fácil com que transmite os sentimentos de Elphie são extraordinárias. Esse filme nos faz viajar até Oz e dançar e cantar ao ritmo de músicas mais do que épicas."
  },
  {
    "rating": "1/5",
    "review": "I usually like musicals. This one had too much music and was generally a bore. Nothing spectacular about it. No songs that stick out as memorable. I like to watch a musical that fills your head with ear worms, that you find yourself humming the tune to, when the song comes on you want to dance like a fool, none of that was found in this movie whatsoever."
  },
  {
    "rating": "5/5",
    "review": "This movie is excellent in every way."
  },
  {
    "rating": "5/5",
    "review": "I’ve seen this in theaters four times and do not regret any of them! I love it so much, I am mildly obsessed with it, and it is just so incredible!!! WATCH IT!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Excellent sets & costumes. Interesting story."
  },
  {
    "rating": "2/5",
    "review": "If your not a musical person and you thought this was a movie with a few songs brace yourself lol it's literally nonstop singing like 90 percent of the movie with like 40 mins of actual story, and it's a bit slow until the end."
  },
  {
    "rating": "3/5",
    "review": "to much singing. the plot was confusing... difficult to understand the words when Galinda sang."
  },
  {
    "rating": "5/5",
    "review": "Saw it three times in one week! Each time I saw more and more details…quite excellent! Flawless!"
  },
  {
    "rating": "5/5",
    "review": "Amazing music and choreography!"
  },
  {
    "rating": "5/5",
    "review": "one of the greatese pieces of fan fiction to ever exist!! a brilliant movie and I cannot wait for part 2 with my baby!!"
  },
  {
    "rating": "4/5",
    "review": "It was a good film and I’m looking forward to part 2"
  },
  {
    "rating": "5/5",
    "review": "超好看，歌也很好聽 只是後面三分之一的劇情有些過於緊湊"
  },
  {
    "rating": "5/5",
    "review": "Loved every bit of it"
  },
  {
    "rating": "5/5",
    "review": "it is great if u love musicals and can reach out to more audiences with its concept and it surprised me when they said they used close to no CGI :)"
  },
  {
    "rating": "2/5",
    "review": "Too overhyped. Ariana Grande is not that good. Go watch Role Models (2007) instead."
  },
  {
    "rating": "0.5/5",
    "review": "Too much ozempic, lay off"
  },
  {
    "rating": "3.5/5",
    "review": "Gostei. Valeu o tempo como diversão. Boas atuações do elenco e ótima mensagem que faz o público pensar. Não é uma obra prima mas um ótimo filme. Não estaria na lista dos meus 200 filmes prediletos pra reassistiir."
  },
  {
    "rating": "5/5",
    "review": "Jaw dropping, incredible, spectacular - my favourite movie I’ve seen in a long time!! Cynthia and Ariana were born to play these roles."
  },
  {
    "rating": "5/5",
    "review": "It's an excellent movie, best thing we could have asked for a movie version of a musical of a book of a 1939 film 😊 can't wait for part 2"
  },
  {
    "rating": "5/5",
    "review": "Cynthia Erivo and Ariana Grande gave stellar performance worthy to both original play actresses. 👏🏾👏🏾👏🏾"
  },
  {
    "rating": "5/5",
    "review": "Characters amazing, music superb, costumes exquisite!! Absolutely LOVED this movie and cant wait for part two!"
  },
  {
    "rating": "1.5/5",
    "review": "Overlong. All spectacle and no heart. Elaborate sets, costumes, and production, to no avail. The animatronic animals were cute. Ariana Grande was annoying. Cynthia Erivo was quite good. Jeff Goldblum had a nice turn as the Wizard. Don't want to see Part 2."
  },
  {
    "rating": "5/5",
    "review": "Great musical on the big screen! Acting, singing, choreography and staging were spectacular!"
  },
  {
    "rating": "2/5",
    "review": "Not the story we thought it would be. Was just ok."
  },
  {
    "rating": "5/5",
    "review": "Probably the greatest cinematic masterpiece of my lifetime. I've seen the Broadway Musical twice and was skeptical about how Hollywood would do with this, particularly with Pop Star Ariana Grande starring in it. I was awestruck with how amazing she was as was Cynthia Erivo. The sets, costumes, dancing and design were incredible. I can't think of any scene in the movie that could have been done better. I believe Defying Gravity, the final scene, was the greatest movie ending I have ever seen. Do yourself a favor and see this. I would rank this up there with Wizard of Oz, Gone with the Wind, and Citizen Kane."
  },
  {
    "rating": "5/5",
    "review": "Amei, não vejo a hora de estreia a parte 2."
  },
  {
    "rating": "3/5",
    "review": "Ehh… I feel like half of this movie was really good, and the other half sucked. The production design was incredible, and the songs were very well-choreographed. The wordbuilding was great, and created a (semi) realistic look into what the world of Oz is actually like. The plotline with the animals was compelling, and the last 30 minutes were genuinely great storytelling. Everything before that, though, felt off. It felt like a generic, poorly written version of High School Musical with Harry Potter elements. It just didn’t work. But the ending was great. Hopefully Part 2 is more like that."
  },
  {
    "rating": "2/5",
    "review": "Far too long, and too many scenes dragged on! Especially song and dance numbers. The main stars were outstanding: Ariane Grande was a revelation, with a fantastic voice., and added some humour; and Cynthia Erivo actually garnered empathy for her character, and showed depth in explaining how she became who she did, and I do like Jonathan Bailey, Michelle Yeoh and Jeff Goldblum. Marissa Bode was really good too, and poignant as the girl confined to a wheelchair.. Loved the animals, especially the goat professor, and their subplot: the stormtroopers dragging him out from the lecture hall gave a jolt, specially given our current political reality, and the campaign for ethical treatment of animals! And I liked the Oz meets Hogwarts university town and natural setting - not so much the Emerald City, futuristic nightmare combined with an ugly, over mechanical past."
  },
  {
    "rating": "2/5",
    "review": "Dont like musicals in general and liked this one even less And then, totally unexpected, its only Part 1!!! I will not be back for Part 2"
  },
  {
    "rating": "5/5",
    "review": "Good scenes good cast"
  },
  {
    "rating": "5/5",
    "review": "Can hardly wait for part 2."
  },
  {
    "rating": "5/5",
    "review": "I loved it. I felt transported in a magical world. Costumes, decorations, scenario, actors, voices, sounds… all was perfect for me to make me feel part of the movie."
  },
  {
    "rating": "4/5",
    "review": "Just cant stand green people. Otherwise great movie but maybe no green people next time."
  },
  {
    "rating": "0.5/5",
    "review": "Straight up NOPE!!! 5 minutes in and the continuous high pitched racket they call singing just about drove me nuts. I couldn't find the exit button fast enough."
  },
  {
    "rating": "5/5",
    "review": "Everyone must watch this! Espetacular!"
  },
  {
    "rating": "5/5",
    "review": "I hope to see it again soon. I was amazed at all of the dancing & the singing was beautiful!"
  },
  {
    "rating": "4/5",
    "review": "absolutely revolutionary. SHE SLAYED SO HARD. (not enough sex)"
  },
  {
    "rating": "4/5",
    "review": "Um bom musical, divertido e com vontade de quero mais."
  },
  {
    "rating": "5/5",
    "review": "Wicked is a breathtaking cinematic masterpiece that brings the beloved musical to life with stunning performances, masterful direction, and incredible attention to detail. The acting is phenomenal, capturing the depth and emotion of its characters, while the visually striking production adds to its timeless appeal. With unforgettable music, rich storytelling, and themes of friendship, self-discovery, and challenging perceptions, Wicked resonates with audiences across generations. It’s a mesmerizing film that celebrates empowerment, acceptance, and the beauty of being different—leaving a lasting impression for all fans!"
  },
  {
    "rating": "5/5",
    "review": "Colorful costumes, lots of action! Incredible story line."
  },
  {
    "rating": "2/5",
    "review": "Totally predictable … why watch 5h for a story that was in a musical 20 years ago."
  },
  {
    "rating": "4/5",
    "review": "Extremely good, although a bit fatiguing in length. Overall highly recommended for those that love The Oz Universe and/or musicals. Very well done."
  },
  {
    "rating": "5/5",
    "review": "A fun movie, great acting, amazing singing. The best movie of the year!"
  },
  {
    "rating": "5/5",
    "review": "*Wicked* is a mesmerizing cinematic experience that captivates from start to finish. The film brilliantly adapts the beloved Broadway musical, blending fantasy, heart, and unforgettable music in a way that both honors the original and expands on it. The performances are nothing short of stellar, with the leads bringing depth and emotion to their roles, especially in the dynamic relationship between Elphaba and Glinda. The visuals are stunning, transporting viewers to the magical land of Oz with breathtaking sets and spectacular effects. The music, with its iconic songs like “Defying Gravity,” continues to evoke powerful emotions. Overall, *Wicked* is a beautifully crafted movie that is both entertaining and thought-provoking, leaving audiences feeling inspired and full of wonder."
  },
  {
    "rating": "5/5",
    "review": "Beautifully created movie! The music and artistry were outstanding."
  },
  {
    "rating": "4.5/5",
    "review": "Definitively is of the most beatiful movies of the entire year is of the only ones which had make me get amazeby how its created the esmeral city or the Oz wizard world the colors balace had a big relation of how the movie is , apart of that even i dont like too much the musical movies but the songs of this one are amizing the lirycal voice of Selena Gomez is pretty and amazing the letter its so acording to the moment them had apear apart that the mix between opera and pop its magic inside my ears also Ariana and Zynthia had a so great advance and representation of their character one its a little bit dum and had in mind that all people make whath she want , meanwhile Elphada is serious dont mattter what others said of her apart that she had great empaty with the animals for that she and Ariana had a so good work in pair as both had be so different , also the CGX and practic effects watch amazing really beatiful also its of the best adaptions of one of the best Broadway play its only failure from the moment its how the forgot a little what happen with the animal capting and exibition also the prince need a little of more importance as inside the original I hope the second part its better than this one."
  },
  {
    "rating": "3.5/5",
    "review": "The film is effective at capturing what made the original musical so beloved, and in turn, will belong to a new generation of kids."
  },
  {
    "rating": "1.5/5",
    "review": "Unbelievably over the top. Ariana Grande sings through her nose and her character appears far too often: it/she is extremely annoying. The other set pieces were chockfull (i.e far, far too busy) of people, colours and changing sets. Barely could understand what was going on, as the camera panned and swerved and passed over the many dancers. Seems to appropriate Hogwarts school for wizards, into the same wizards training school. Michelle Yeoh as the Professor is the only good thing going in these scenes. Too many eager faces trying to catch the camera, it seems. The songs were awful - all sung (by either the stars or the ensemble) to what seemed to be the same tune. The parts of the song(s) were played at very predictable scenes, with the only changes being the lyrics. If you could understand what was being sung, with appalling ups and downs in the same word. Very contemporary, with the loud background music thankfully drowning out what passed for \"singing\"."
  },
  {
    "rating": "3.5/5",
    "review": "I hope they make the 2nd part faster."
  },
  {
    "rating": "5/5",
    "review": "It's better than expected, what? It's my first time watching any version of wicked and now I'm a new fan. The main stars can definitely sing, the world building and costume designs are so good. I can't wait for part 2!"
  },
  {
    "rating": "0.5/5",
    "review": "I just can't get into it. It is uncomfortable, and weird. Dont recommend it"
  },
  {
    "rating": "3/5",
    "review": "Wicked has a lot going for it. There are plenty of catchy tunes. Ariana Grande and Cynthia Erivo give remarkable performances. The sets, make-up, and cinematography make for some great eye candy. Despite all of that, there are some questions to be asked. The play ran for 150 minutes. Why is the first HALF of the film franchise longer than the entire play? There’s a lot of filler that could be trimmed, but two movies are clearly twice as profitable for the studio, one would suppose. Why does pretty much the whole thing look as though it was shot in the gloom of Hogwarts instead of the colorful and vibrant Oz from The Wizard of Oz? Why are virtually all of the Munchkins taller than Glinda? Why must the movie (and the play and the book) change our view of the Wicked Witch from inherently evil to a victim of her social circumstances? And, really, why does it need “to be continued”?"
  },
  {
    "rating": "4.5/5",
    "review": "loved it but it definitely felt long in parts and i wish there wasn't so many stops between defying gravity because u cant get all excited about it or feel how good it is because it keeps stopping"
  },
  {
    "rating": "4/5",
    "review": "It was very drawn out and I wasn’t sure how I felt until they went to OZ and then I absolutely loved it. I can’t wait until part 2!"
  },
  {
    "rating": "3/5",
    "review": "Could have saved a lot of time, about 30 min at least is just them tapping inside the school with no actual movie changing story… The actors did a great job and especially the ending was made very well."
  },
  {
    "rating": "3.5/5",
    "review": "I was positively surprised at how much fun I had watching Wicked. Knew nothing of the story and I absolutely hated the cinema trailer. Found myself so involved with the story, though. It could have felt forced because of the “social causes” underlying theme, as seen in other recent productions, but in this case, everything felt just part of a well woven narrative."
  },
  {
    "rating": "5/5",
    "review": "this movie was an incredible experience to watch, everything in the movie is great and made me very emotional, definitely one of the best movies I've ever seen <3"
  },
  {
    "rating": "4/5",
    "review": "Fantastic music. Great scenes. Just not quite as good as it was in Broadway."
  },
  {
    "rating": "5/5",
    "review": "Flawless movie experience"
  },
  {
    "rating": "5/5",
    "review": "I thought this was going to be a full musical but I loved the story. my niece and I were confused at the beginning, how it started. The movie goes into detail afterwards. would definitely watch again!!!"
  },
  {
    "rating": "5/5",
    "review": "This has been such a comfort movie for me and I can watch it endlessly! Superb set designs, acting, singing and overall entertainment and emotional value! Glad to belong to the era this new version has been made. Such a gift!"
  },
  {
    "rating": "5/5",
    "review": "Absolute masterclass in how to correctly make a movie musical adaptation. Director John M Chu perfectly captures the essence of the stage musical while finding new ways to captivate through the movie screen. On top of outstanding performances from Cynthia Erivo, Ariana Grande, Jonathan Bailey and Michelle Yeoh, audiences will be left feeling the same sense of magic you get from watching it live on stage."
  },
  {
    "rating": "5/5",
    "review": "Absolutely incredible. So many themes. Outstanding performances by all. Looking forward to Part II!"
  },
  {
    "rating": "5/5",
    "review": "This movie makes you connect with the characters and feel what the moment in each scene wants to convey in a natural way and you dont feel forced to do it, that makes the movie great and interesting, in addition to the fact that the plot is very good."
  },
  {
    "rating": "5/5",
    "review": "Such a great movie. It really captivated the musical so well!"
  },
  {
    "rating": "3/5",
    "review": "Wicked is wonderful eye candy with luscious colors, sets and costumes. The characters all seem familiar, and not because of the Wizard of Oz.... Grande is a carryover of last year's pink Barbie, and Alpheba is a green Carrie, not yet proficient in using her super powers. They all study at a place like Hogwarts, and eventually get to the Oz we know and love. The songs are completely forgettable, the ending makes no sense, and the whole thing is about an hour too long, but not an unpleasant way to spend a coupe hours."
  },
  {
    "rating": "5/5",
    "review": "AMAZING!! Breathtaking. Cried, laughed, and sang!"
  },
  {
    "rating": "5/5",
    "review": "I'm a 34 year old white male. I have never seen the Broadway play and absolutely loved this movie. I feel like, something has awakened inside me, I can't stop thinking about it. Hanging for part 2."
  },
  {
    "rating": "5/5",
    "review": "Watched it twice in the cinema. The second time is just as good and thrilling as the first. Amazing cast, sets, costumes and singing. I have been listening to the soundtrack everyday since its release and can't wait to own the DVD."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was a pretty good adaptation of the original and I would say a better retelling of the original musical. and of the original book/movie."
  },
  {
    "rating": "5/5",
    "review": "Contrary to what certain memes suggests, it is in fact possible to spoil an adaptation of an old/well-known property, so I won’t be ruining any surprises here, even if to a large number of folks, they aren’t really surprising. Although, mild spoiler for the spoilers (spoilception?) there are quite a few surprises. Chu’s take on the smash Broadway adaptation of the bestselling book series is quite possibly the best cinematic adaptation of a Broadway production since Chicago (better than Les Mis, better than In the Heights, waaaaay better than Cats). Erivo and Grande are beyond perfect in the lead roles of Elphaba and Galinda (respectively), with the former carrying the lion’s share of emotional weight, but the latter stealing pretty much every second of every scene. The music is amazing, the costuming is outstanding, and yeah, they basically kept everything (and added some more). The CGI is a bit wonky at times, but the practical set pieces are legit astonishing. Overall, even folks who claim to not dig musicals, will probably (almost certainly) dig Wicked. If you do dig musicals, this is THE film to see of 2024."
  },
  {
    "rating": "2/5",
    "review": "Everything was so pretty but the movie plot wasn’t good"
  },
  {
    "rating": "5/5",
    "review": "Fantastic! I loved this so much!!!!"
  },
  {
    "rating": "5/5",
    "review": "Even if you’ve seen the musical or read the spoilers, still a powerful and brilliantly-made movie!"
  },
  {
    "rating": "4/5",
    "review": "They will say that when it comes to telling stories that nothing is new. Personally, I would agree. However, to find a way to convey messages in a way that moves people after they have already heard them could be no greater achievement. I am not a critic. I love the results efforts more than I love the results for most things in life. Perhaps one day I will learn to be overly critical of products and not the process, but I doubt that life becomes enjoyable at that point. For me, a non-critic, I can only say that the work which must come from countless efforts may be uncounted but will not go unseen for this film. I did not finish it in my first sitting, but fortunately I bought it. I would say I loved it, but that would be redundant. I love everything. So, to escape from repeating myself I would only say congratulations to an almost infinite number of moments that it must have taken to produce the display of talent. A culmination of pure effort and it shows. Although the world changes, the stories that define our struggles, our triumphs and out achievements are on full musical display. I am very impressed by both the onscreen display of effort and without any understanding of what it must take in reality to produce am simply very glad that I decided to purchase the movie. Not just for the idea, not just for the story but to help them celebrate their achievement which my opinion may not matter in the long run, but their effort will inspire people for generations to come. I could not imagine the pressure one would feel striving to be considered in such a way as in the same realm of work as the Wizard of Oz. I would never engage in the argument for the works are in two different worlds and generations apart. But as far as deserving the consideration there is no doubt that the effort of all involved is apparent and deserving of praise and recognition. So, I wrote this review. I like the movie, I bought the movie, and I will watch it again. Thank you."
  },
  {
    "rating": "5/5",
    "review": "Excelente adaptação! Esperei anos por esse filme e está incrível!! As atuações, os cenários... a direção e as musicas... tudo se encaixa perfeitamente. Me emocionei numa cena silenciosa de um musical. Quem assiste, conhecendo previamente ou não a estória, entende todo o necessário para amar esse filme e percebe que foi tudo feito por quem sabe e ama o que faz. A vontade é de aplaudir de pé ao subir os créditos"
  },
  {
    "rating": "5/5",
    "review": "Amazing story and visuals and musics. Loved it, a movie for everyone and beautiful and heartwarming moments with joy and laughter."
  },
  {
    "rating": "5/5",
    "review": "Great adaptation of the musical. The whole family loved it!"
  },
  {
    "rating": "5/5",
    "review": "I don't care for musicals generally speaking. This was one of the best movies I have seen in what may be years. The songs, the emotion, the visuals. My likeminded family felt the same. Well done to all those involved in the making of this and so happy to know I get to experience part 2 later this year."
  },
  {
    "rating": "4.5/5",
    "review": "I think this is a great movie adaptation of a musical. I can't wait for part 2. Everyone is fantastic & I love the chorus & dancers."
  },
  {
    "rating": "3/5",
    "review": "I mean, what? It's a good movie, not an Oscar contender, but it's good."
  },
  {
    "rating": "3/5",
    "review": "It was alright. I expected more foreshadowing and not so much conflict. Music was like a Broadway show. Didn't catch happy melodies and messages."
  },
  {
    "rating": "4/5",
    "review": "Mesmo sendo uma releitura/adaptação, o filme entrega: vocais perfeitos e músicas cativantes; sintonia das personagens principais impecável e emocionante, além de uma história boa de se acompanhar, unico ponto negativo do filme, é o seu tamanho, ficou um pouco logo de mais."
  },
  {
    "rating": "5/5",
    "review": "I finally get the hype and what everyone talked about constantly during my 6th and 7th grade year."
  },
  {
    "rating": "5/5",
    "review": "Great cinematography, good story line."
  },
  {
    "rating": "2/5",
    "review": "Not that great a movie, not as it was hyped up to be. Even my three granddaughters lost interest about half way in."
  },
  {
    "rating": "4.5/5",
    "review": "The olympics of singing - so good. I had not seen the play before this, so I didn't know the songs as well - they're a little harder to catch on to sing along."
  },
  {
    "rating": "5/5",
    "review": "Love this movie I cried and clapped at the end of the movie very nice to see these women on screen. They have chemistry from beginning to end."
  },
  {
    "rating": "4/5",
    "review": "Its was the best movie i ever saw it has my favorite actor in it"
  },
  {
    "rating": "5/5",
    "review": "This was my second time seeing it because I wanted to share it with my family (husband and 15 year old). I went with my co-workers the first time around. My family enjoyed it as much as I did."
  },
  {
    "rating": "4.5/5",
    "review": "Disney's attention to the details in set and costume design is simply perfection. The music was okay....less songs would have been better. Story very good.....can't wait for Part 2."
  },
  {
    "rating": "4.5/5",
    "review": "Middle-aged man / movie buff here: zero knowledge about the franchise or the hype, very low expectations, allergic to the genre, went with my daughters just because they wanted to see the film. But to say I was pleasantly surprised would be a huge understatement. That was actually an awesome film! The music is obviously great, but the highlights for me were the pacing, it doesn't get bogged down at any point, the writing, which is witty and entertaining, and the chemistry between Glinda and Elpheba. Especially Glinda was absolutely brilliant! I can't wait for the second part. I'll still be going with my daughters, but this time it won't be them dragging me to the film."
  },
  {
    "rating": "1/5",
    "review": "Wish they'd make movies like they once did. Just entertainment no agendas !"
  },
  {
    "rating": "5/5",
    "review": "So. Good. Seriously, everything I hoped for and more. Cynthia Erivo absolutely killed it, and Ariana Grande was low-key hilarious. She was so good. I'm a sucker for a musical with strong songs and I've never seen Wicked in any form and only heard the music in passing over the years. And let me just say, this really delivered. The music is simply powerful. Some of the best musical numbers I've heard in a long time. There's real emotion in the songs. It's commendable how they took what by all accounts is an epic, famed Broadway musical and, as far as I can tell, did it so much justice. I was completely hooked. Just, wow."
  },
  {
    "rating": "4/5",
    "review": "It was a good movie. Probably better in a theater than on a small screen, but definitely worth watching!"
  },
  {
    "rating": "5/5",
    "review": "All the best in a massive Hollywood production! Great cast, singing, costumes, choreography, etc."
  },
  {
    "rating": "5/5",
    "review": "Great Movie. Enjoyed the singing and story line!"
  },
  {
    "rating": "1.5/5",
    "review": "Wasnt like the book at all. Disappointed."
  },
  {
    "rating": "5/5",
    "review": "First timer..,Love, love love this movie! Intriguing, funny, deep and full of LIGHT and excitement!"
  },
  {
    "rating": "5/5",
    "review": "Such an awesome broadway musical and a fantastic movie experience. They brought this show to a very high level."
  },
  {
    "rating": "5/5",
    "review": "They did a great job portraying Wicked on the big screen!"
  },
  {
    "rating": "5/5",
    "review": "The acting was perfect and the songs felt like they were felt and had meaning to the characters. The cinematography was great."
  }
]