[
  {
    "rating": "1/5",
    "review": "If you like gore for a horror film, this is your movie. I don’t care for just gore and would rather be scared in a startling way."
  },
  {
    "rating": "4.5/5",
    "review": "The Substance est une œuvre radicale, dérangeante, et viscéralement engagée. Elle ne plaira clairement pas à tout le monde, et c’est tant mieux. Ce film ne cherche pas à caresser dans le sens du poil : il choque, il bouscule, mais surtout, il interroge. C’est une satire sanglante et provocante de notre obsession de la jeunesse, un miroir cruel tendu à une société obsédée par l’apparence, la performance, et la perfection. Visuellement frappant, narrativement osé, The Substance s’impose comme une expérience cinématographique presque organique, à ne pas mettre entre toutes les mains, mais à ne surtout pas ignorer. Cela dit, si le propos est fort, la dernière partie verse dans un gore outrancier, presque gratuit. On comprend la volonté de choquer, mais à ce stade, le message était déjà passé, et cette surenchère visuelle risque de faire décrocher certains spectateurs. Un peu plus de retenue dans le final n’aurait pas enlevé d’impact au contraire. Malgré cette dérive sanglante, The Substance reste un film audacieux, ambitieux et viscéralement moderne."
  },
  {
    "rating": "3/5",
    "review": "A beautifully presented movie that is both interesting and disturbing that ends with a freakish 80s character a la hellraiser. Unexpected but weird and worth watching."
  },
  {
    "rating": "4/5",
    "review": "Excellent acting, cinematography, editing, and especially make-up! Not a single thing in this movie was done poorly, and even the weaker elements were held-up by the excellence of all the other moving parts. It has a very lucid and dreamlike quality which makes the more real aspects ever more haunting. The film is a body horror movie, and while it does have excellently grotesque special and practical effects, it revels in its ability to make even the normal human body seem horrid in the eyes of the characters. Every shot of normal body parts and functions are shot in such a way as to make us experience the characters' disgust in it. A body horror movie which manages to make the normal seem grotesque. The ending, while intentionally made this way, does get to a point where the camp overshadows any last semblance of horror it had, despite being in theory the most horrifying entity thus far; though the ending was quite spectacular even so."
  },
  {
    "rating": "5/5",
    "review": "A absolutely unhinged masterpiece. Body horror at its finest. I really enjoyed the acting in the movie. The story line was incredibly unique. The ending for me was the best part. Without spoilers it truly was wild. I'd highly recommend this movie."
  },
  {
    "rating": "5/5",
    "review": "Demi was absolutely phenomenal as usual. Her character in this is so interesting and bizarre. This is one of my favorite horror movies of the year!!!"
  },
  {
    "rating": "0.5/5",
    "review": "I kinda wish the director would zoom the camera out just a little more… maybe write a better script next time. So glad I rented instead of bought it, but I’m still going to ask for my money back"
  },
  {
    "rating": "4.5/5",
    "review": "Brilliant plot, great writing, amazing characterisation, and captivating acting. This is a nuanced film, the sort where even if you watch it three times and go in for a fourth, you'd find details that you missed earlier."
  },
  {
    "rating": "3.5/5",
    "review": "Awesome, unique concept. Very fever-dreamish. Very gross at times in unexpected ways. Also very campy. I appreciated visual references to Stanley Kubrick and David Lynch."
  },
  {
    "rating": "2/5",
    "review": "Can’t understand how a film that started out as good as this one does ends up in the mess I watched. Great Cronenberg style body horror & strong critique of how many view youth & beauty for the first one and a half to 2 hours. Then it somehow goes way off in to splattery D-grade monster/gore that is very reminiscent of Troma."
  },
  {
    "rating": "4.5/5",
    "review": "I would have gave it the full 5 stars but the last 20 mins or so (when Elizasue) goes to the NYE party is just a bit too ridiculous and through me off of what was otherwise an amazing, deep, serious movie"
  },
  {
    "rating": "4.5/5",
    "review": "Awww she didn't go on her date with Spark Brushel from Ace Attorney 😞"
  },
  {
    "rating": "0.5/5",
    "review": "Dogshit of a movie..."
  },
  {
    "rating": "0.5/5",
    "review": "Movie was horrible. Would not recommend to anyone."
  },
  {
    "rating": "1.5/5",
    "review": "It was like an episode of Black Mirror that ran an hour and a half too long!"
  },
  {
    "rating": "5/5",
    "review": "AMAZING. It is crazy, awesome, gory, absolutely insane, and insanely enjoyable."
  },
  {
    "rating": "1/5",
    "review": "I don't understand how two good actresses can play this farce. It's shocking how the stupidity in this movie reaches its peak. Please don't watch it. It's the worst in years."
  },
  {
    "rating": "5/5",
    "review": "Una experiencia. Dudé en ponerle las 5 estrellas, pero la verdad es que siguiendo mi corazón, si se la daría, aún con cierta reiteración que ocurre en la trama, no creo que nada se sienta fuera de lugar y definitivamente cumple con todo."
  },
  {
    "rating": "0.5/5",
    "review": "so does it not disgust anyone else that there was an actual little child in the seating of a live performance where actual NUDE people were not five feet away???? Was that filmed separately or something because how egregiously disgusting and should be ILLEGAL! SHAME ON EVERYONE WHO WORKED ON THIS PROJECT"
  },
  {
    "rating": "4/5",
    "review": "\"The substance\" was one of the goriest films I've watched in a while and is definitely not for the faint of heart. Seeing demi moore in this role was wonderful and margaret qualley killed it throughout. I was curious how the film would end given how long it is, and I think it made sense the way everything wrapped up. I don't entirely agree with those saying the ending was chaos, but i do feel the movie went on for 20-40 minutes longer than it probably should have. There were some comical moments here, original concepts I've never seen before, and scenes that were truly novel that will stick with me for a while hereafter."
  },
  {
    "rating": "2.5/5",
    "review": "I really did not like this movie. I get it the acting was very good but the world they built is shallow, gross and cartoonish. The body horror goes on a bit for my taste. The social commentary beats you over the head and the movie just goes on and on and on. I understand some will hold this up as a master class, but I think after a few years you will find this will be forgotten."
  },
  {
    "rating": "5/5",
    "review": "As a horror fan, I never expected I would come across a body horror like this. From the superb actresses, Demi and Margaret to the cinematography and soundtrack everything is phenomenal. We don't always get to have horror films like this"
  },
  {
    "rating": "0.5/5",
    "review": "This movie seriously sucked balls. It could have been such a cool sci fi based on the premise, but it went way overboard with excessive gore scenes (think Kill Bill) and was overall very disconnected. It was painful to watch to the end."
  },
  {
    "rating": "2/5",
    "review": "Did the original director quit half way through this movie? The second half was a big miss and a mess."
  },
  {
    "rating": "5/5",
    "review": "A very very good movie, it has a great story of how as humans, we want to be a younger self and always stay relevant, cool and pretty. It’s a very good analogy of what length people will go to maintain their “beauty”, even if it means putting their life’s at risk. Just like with plastic surgery, we just want to cut corners and “hack” life and time itself."
  },
  {
    "rating": "3.5/5",
    "review": "The Substance is an audacious, grotesque horror film that delves deep into the psyche, blending body horror with a surreal narrative about societal obsession with perfection and youth. The film is unapologetically intense, offering visceral visuals and unsettling sound design that heighten its nightmarish atmosphere. Though its chaotic final act may be overwhelming, the film’s bold, provocative approach challenges expectations and provides a one-of-a-kind experience for those ready to confront its disturbing truths."
  },
  {
    "rating": "0.5/5",
    "review": "It was a god-awful movie. Near the top of the list of worst movies I've seen in my entire life. Interesting premise, but that's about it. Sucked eggs..."
  },
  {
    "rating": "3/5",
    "review": "It wasn’t bad but it’s a bit overrated hopefully I’ll give it a rewatch in the future and hope it’s better then the 1st time."
  },
  {
    "rating": "1/5",
    "review": "The Nutty Professor meets Dorian Gray, poorly. Both stories handle body dismorphia and beauty standards and its impact on an individual's self-worth, the desire to fit in and to be accepted, driving the proganist to drastic measures by using unapproved and dangerous substances. In both stories, the main character is doing huge damage to their own life, in order to provide for a parasite that despises and antagonizes it's host. The difference is, one of the movies is self-aware. It does not intend to be anything else but light entertainment. The suspension of disbelief is granted because the storyline is not trying to be realistic in any sense. For the most part, it consists of overacting and simplified, irrational behaviour on part of the side characters in order to give the main actor more room. But the film always stays true to it's premise. It is advertised as a lighthearded comedy and is stringent in that. It does not take itself seriously at all. And most importantly, professor Klump has a clear motivation to keep the parasite going: approaching his love interest. And, although the narrrative is inconsistent, it seems that at least in the beginning he shares the same experiences and thoughts with his parasite, is able to live through him. In The Substance on the other hand, there is no motivation at all for the main character Elisabeth to keep going with this. Why would she keep on letting the parasite suck the remaining life out of her when apparently she has no connection to her feelings, doesn't see through her eyes, doesn't seem to have any benefit whatsoever from the situation. The substance starts off as serious movie. It has it's satirical moments at times, but mostly it is presenting itself as a suspenseful, pychologycal body-horror movie with a message. Adding to that is Demi Moore, approaching the role with a sort of seriousness and sadness that is captivating, yet doesn't match the overarching tone of the film at all. Almost all of the characters around her act as stereotypical parodies of what they are supposed to represent, i.e. the abusively creepy neighbour, the non-chalant, disgusting producer and his greedy investors, or the passersby that are hostile to anyone above 50. Most men are displayed as complete jerks, most women purely as sexual objects. Margaret Qualley plays along in the role of the parasite whose sole character trait is having the body of a young, attractive woman. While her portrayal of the character as shallow and enticing fits the narrative and overall tone, it just doesn't leave much of an impression. Only Dennis Quaid really shines here. Maybe he understood the sillyness of the story from the get go and just played along with it. He fills every scene with comedic energy and over-the-top acting that fits perfectly into the silly plot. Ah yes, and then there's what could be interpreted as an homage to Oscar Wilde's Picture of Dorian Gray. Only here, the picture stays the same while the character gets uglier and more misfigured with every scene, being the result of complete self-abuse. It conveys with the message that is hammered into the audience's ears all through the movie: \"you can only be yourself. Your actions have consequences\". Futher on the topic of homages, there's an obvious reference to Stephen King's Carrie in the very painful to watch final chapter of the story. The level of grotesque and stupidity of these concluding 20 minutes drags the film down from mediocre to outright terrible. So while on the surface The Nutty Professor and The Substance have nothing in common, they are both a similarly unrealistic and exaggerated critique of societal standards . But the former doesnt pretend to be anything else than lowbrow family entertainment with fart jokes, while the latter aims at something it fails to achieve, coming off as pretentious. One star for the amazing, innovative cinematography and Dennis Quaid as the disgusting producer. Zero stars for anything else."
  },
  {
    "rating": "0.5/5",
    "review": "I have watched thousands of movies, And while I can appreciate the message and satire, this movie was not worth my time. The actions of the characters was stupid. The pacing tedious, and just when I thought I couldn’t get worse, it turned into a bloodbath. Just no. The best thing I can say is that it was original and the makeup astounding. But Jesus! Just no!"
  },
  {
    "rating": "3.5/5",
    "review": "1st half of the movie is really good. Cinematography, visual, vibe, makeup, sound design are great. But the ending dreaming scene is really threw me off :("
  },
  {
    "rating": "0.5/5",
    "review": "Wow, this movie really sucked. Plot holes, nonsensical elements that you can't even attribute to science fiction, incredibly superficial social commentary and overall just cheap and not particularly great horror. It baffles me that anyone would rate it more than a 2 or 3 other than for political or self gain reasons. Insane."
  },
  {
    "rating": "2.5/5",
    "review": "It escalates a bit..."
  },
  {
    "rating": "5/5",
    "review": "Incredible. Demi Moore was brilliant. Glad I watched but it isn’t something I would likely rewatch (Requiem for a Dream status)."
  },
  {
    "rating": "2.5/5",
    "review": "Great movie, ending absolutely killed it for it for me. I think the goal was an artisic approach, I did not find it good."
  },
  {
    "rating": "0.5/5",
    "review": "This is Bad Really Bad. The Story is nonsensical, and the Plot Holes are Huge. One Good Acting Performance does not overshadow the lame movie."
  },
  {
    "rating": "5/5",
    "review": "The concept is good, but what makes this movie SUPER good is the production and direction. Music and sound is brilliant. This is so well done. Love it."
  },
  {
    "rating": "1.5/5",
    "review": "The first hour and a half of the movie is great. The story was interesting and the acting was solid. If they had simply ended the movie there it probably would have been one of the best of the year. The last hour is hard to watch. Just repetitive nonsense and gore with no further point. It was so bad at this point I was fast forwarding just to get to the end."
  },
  {
    "rating": "3.5/5",
    "review": "Excessive effort to shock."
  },
  {
    "rating": "0.5/5",
    "review": "Pensa num filme ruim... Agora pensa que pode piorar... Agora pensa que ainda dá pra ficar pior... Isso, é este aqui!"
  },
  {
    "rating": "4/5",
    "review": "The ending is a bit off! how the hell is that old hag able to run so quickly and what’s with spraying all that blood?!!"
  },
  {
    "rating": "4.5/5",
    "review": "The substance movie is known as a horror/science fiction movie. It is one of the excellent examples of how a movie can include entertainment elements in itself so that people stay awake and how at the same time artistic elements (Form and the way movie is shot) can be simply layered within it. In my opinion, This movie is essential for every one of us to watch not because of its entertainment respects, but because of how it reminds us of what humanity really mean, why we should get to know ourselves, how greed for fame or anything can lead us to wrong routes, and so on. This is a simple story of a Materialist woman who is suffering from a mental disorder - she wants to be seen and admired by people; she wants to be loved by people - not herself, as in self-love. We are not shown a lot of locations, unnecessary details and scenes; what we watch clearly shows us the point of the story and this is done skilfully by the storytelling and directing power of Coralie Fargeat, and via the movement of camera by the cinematographer. The movie is full of great compositions and color choices. For example, when at the end of the movie a huge amount of blood is split on the audience, there is a symbol of how what we people and producers want from celebrities – Beauty of their appearance and high expectations – seems as if we shed their bloods and make them sacrifice their life for nothing. Additionally, the beginning and ending of the movie were at the same spot, and it made a parenthetical start and end, which very well depicted how the main character chose her life to be as worth as a little inscribed Hollywood star on a floor. In the 9th episode – Mean Seasons – of “Batman the new animated series”, season one, the villain is very similar to the main character of this movie and in terms of the development of the character, it could be inspired by this episode. Actings are great starting from the main role, Demi Moore, to the side roles such as Dennis Quaid. Moral lessons and principles are evident and understood after watching the movie; for instance, do not disturb nature. If something is not done by any good means, it is not for you. The nasty side of Hollywood is also criticised. What makes the film not to be a perfect one is that It exaggerates action and violent scenes in a too frightening, disgusting, and aggressive way. Besides, the fiction seems to be too much as it's hard to beleive someone can emerge from somebody's back. Overall, apart from all of us, this movie is so much recommended to those who are working in the entertainment industry. A lot of efforts has been put and this has resulted in a very good and simple outcome. If you're a fan of science fiction/horror movies, this film is for you."
  },
  {
    "rating": "4.5/5",
    "review": "The Substance is not just a simple movie; it’s a disorienting experience, a true madness that forces you to focus on the smallest details of a world very similar to ours, where the male gaze becomes the main antagonist. This work is an extraordinary critique of the contemporary show business world, with the theme of “the double” handled with an almost obsessive precision. The direction is technically flawless, drawing influences ranging from Kubrick to Cronenberg, and even Lynch. I truly believe it’s one of the best films of 2024, absolutely worth watching and rewatching."
  },
  {
    "rating": "1.5/5",
    "review": "Thought it was pretty interesting and compelling - until it just dragged on and on and got far to gross for my taste... In the end left the movie feeling eye-raped. Unless you're a horror freak I would not recommend."
  },
  {
    "rating": "4/5",
    "review": "So beautiful, whats her name, story supposed to be good to….already forgotten it but not the beautiful girl.👍"
  },
  {
    "rating": "0.5/5",
    "review": "Gross. Pointless. I regret having watched it. There are so many truly great films out there why waste your time on this one."
  },
  {
    "rating": "3.5/5",
    "review": "Um filme excelente até chegar na parte final, depois deixaram grotesco até ficar cômico e sem sentido."
  },
  {
    "rating": "2.5/5",
    "review": "I don't think movie follows the right path. In the beginning one egg separated into two with identical copies. There was a promise that substance created a new younger better version but not a completely different one. It would have been better if younger version looks like Demi Moore. Moreover old version experiencing cellular decay but not the younger til it was suddenly out control. I dont like the ending"
  },
  {
    "rating": "2/5",
    "review": "O filme, na minha visão, peca pela falta de diálogos mais profundos e não consegue aprofundar sobre a personalidade das personagens principais. No fundo, a única que sabemos sobre elas é que são obcecadas pela beleza e pela juventude. A filmagem meticulosa é um ponto positiva, mas a história é repetitiva e o final é muito ruim."
  },
  {
    "rating": "0.5/5",
    "review": "Literally one of the stupidest, most drawn out examples of wasteful money in Hollywood. How do shitty directors keep getting green lit. Don’t waste your time on this absolute train wreck."
  },
  {
    "rating": "1.5/5",
    "review": "Great concept but just got too weird. Strange lack of character development was surprising."
  },
  {
    "rating": "4/5",
    "review": "First of all, this performance by Demi Moore (IMO her best movie) is the bravest female actress performance since Gloria Swanson in Sunset Boulevard (1950), and is sort of a cross between that and The Shining (1980). I think it's almost a classic but maybe went a little too long. Still totally worth seeing. I'm not surprised to learn it was directed by (I presume) a lesbian seeing that it depicts most men as stereotypically grotesque, but it doesn't exactly make pretty women look great either (morally - Margaret Qualley is clearly a ten physically). I look forward to Coralie Fargeat's next film."
  },
  {
    "rating": "1/5",
    "review": "Objectively, the filmmakers accomplished what I’m guessing they set out to: this film is a horrifying takedown of the way modern American society sees and treats women. Very little about it landed for me, though. I’m pretty sure the odd, timeless feel with the 80s sets and 70s clothes and 2010s vehicles and technology was purposeful, though it just added another layer of confusion early. Demi Moore’s performance for the first 40 minutes or so was the lone bright spot—she is still gorgeous and still a star, though that made it harder in many ways to buy the storyline. Quaid was one of the most singularly disgusting characters in the history of film and he played it to the hilt, but so much of this was just horrible on many levels that it was hard to either take it seriously or be entertained by it."
  },
  {
    "rating": "3.5/5",
    "review": "I really enjoyed the concept of this movie but I felt as it went on it they seemed to run out of ideas. I don’t know if I just don’t have the attention span or what but toward the end it seemed to drag on way too long without much of a pay out. Happy I watched it though."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible. Just a bunch of total nudity. Couldn’t even finish it."
  },
  {
    "rating": "2/5",
    "review": "First 1/2 really good. It got too weird from there on out,"
  },
  {
    "rating": "4/5",
    "review": "The acting was superb. I did not see that ending coming. It's one of those movies that sticks with you."
  },
  {
    "rating": "3.5/5",
    "review": "It's worth the watch, But.... I'm speechless... They did great on the body transformations and also a very great creative concept!"
  },
  {
    "rating": "4/5",
    "review": "Like most movies these days The Substance is way too long. 15 of the last 20 minutes I could have done without. That said, it's gross, funny and great to look at. Moore and Qualley give it their all. The dovetail of the beginning and end was sad but so satisfying. Who knows? Edited to under two hours The Substance might have been a much more realistic Best Film contender."
  },
  {
    "rating": "5/5",
    "review": "Unconventionally direct with its storyline, acting and, most of all, cinematography. The Substance is quite a panic inducing experience."
  },
  {
    "rating": "0.5/5",
    "review": "Es una película que solo está entretenida al inicio pero mal realizada y sin coherencia a partir de las ¾ partes de su duración . Parece que el guión fue muy forzado, no la recomiendo para nada, lamento haber desperdiciado tiempo de mi vida viéndola."
  },
  {
    "rating": "5/5",
    "review": "One of the best plots of a movie I seen the effects for this movie is awesome. Not to mention the sounds for this movies will give you chills. We need more movies just like this. My favorite movie from 2024."
  },
  {
    "rating": "4.5/5",
    "review": "Really good! The last 10-20 mins are absolutely garbage tho (the NYE show scene) … kinda ruined what was almost a great ending"
  },
  {
    "rating": "1.5/5",
    "review": "A movie that I feel gained traction and praise due to people falling in love with an important topic that is the center piece of this film, the love affair with the poor verbal acting and adequate physical acting is asinine. The story should have ended 30 minutes prior, the symbolism of the end scene is ridiculous, and not in a Quintin, Kill Bill sort of way. The film work was fun in the beginning, the repetitiveness of sexual content seemed baseless after 45 minutes of throwing it in your face. We get it; over sexualization, obsession and vanity is killing us. I can understand why reviewers want to latch on to the meaning, but it doesn't make it a great film. Extremely disappointed."
  },
  {
    "rating": "2.5/5",
    "review": "Great seeing Demi Moore getting the love she deserves, and her performance is excellent, however the film overall doesn’t match her levels. Once you become desensitised to the initial body shock horror it becomes a laboured watch, with an absurd ending making you checking your watch for the end."
  },
  {
    "rating": "4/5",
    "review": "Is good enough but not really worth a 2nd watching (which isn't a bad thing just throwing that out there) There are moments that should've been cut but were left in but I only gave this 4 stars because it's not really scary nor did I give a damn about the main character but really enjoyed the ideas that were explored"
  },
  {
    "rating": "5/5",
    "review": "Everything about The Substance is amazing. Every. Single. Thing."
  },
  {
    "rating": "4/5",
    "review": "The substance was good, I see why it won awards. So creepy , so disgusting in certain parts. Great acting by Demi Moore. It was get to see the OG stars still getting cast. The reminder of vanity in this film was really good to see especially with society nowadays. I would recommend this movie especially for sci-fi enthusiast."
  },
  {
    "rating": "1.5/5",
    "review": "Cool premise, bad execution, lot of unnecessary nudity."
  },
  {
    "rating": "5/5",
    "review": "Melhor filme de Body horror, uma obra de arte !"
  },
  {
    "rating": "3.5/5",
    "review": "Didn’t expect I will enjoy this movie. At first, it felt like just another cheap horror movie, but I found it more enjoyable as the film going."
  },
  {
    "rating": "1.5/5",
    "review": "Last 15 minutes was laughably predicable, and subtracted from the rest of the movie. Which was overly predictable and basically a very over the top metaphor that has been done over and over again. It was a clever movie for not clever people teatering on angsty over the top stylalized production."
  },
  {
    "rating": "5/5",
    "review": "TL:DR: The Thing but it's a metaphor. Great movie. Watch it! This movie was really spectacular, literally and figuratively. I can imagine myself completely missing the point of it, as many of the reviews seem to, just a few years ago. But as it stands, the feelings and experiences of the main character were deeply fascinating to me, and were incredibly sympathetic. This overwhelming fear of age in show business, the willingness to improve yourself at any cost, only to be forced to come to terms with the dreadful ramifications those costs actually entail. The relentless and heartless meat grinder of Hollywood, magnified ten times for young and older women alike. Of all the revolting gore and nightmarish body horror, including my literal groan of distress when her tooth came out, I still think the msot disgusting part of the film was the producer. And although his name was only mentioned once, it was not lost on me that it was Harvey. If you like tension and body horror, watch it without hesitation."
  },
  {
    "rating": "0.5/5",
    "review": "Easily one of the worse movies I've ever seen in my life! This one is bad from the get go but the ending goes off the rails! A \"B-rated\" type movie, something you would catch on the sci-fi channel at 3am. However that expression gives it more credit than it deserves. This movie does not get a passing grade, 0 stars."
  },
  {
    "rating": "3.5/5",
    "review": "The Substance was more of an intense-thriller, rather than a horror movie. You definitely cannot enjoy this film if you have a weak stomach. The ending made me lower the rating by 1 star, but the acting of the two main characters made up for it. ⭐️7/10⭐️"
  },
  {
    "rating": "3/5",
    "review": "Liked it. I just wish the ending was different. It went off into the deep end of grotesque and bizarre. I do think the ending tarnished it a bit. But the story had me pulled in the whole time. Gross, but I kept looking, anyway. I rented it, so I made sure to watch it twice in 48 hours to catch what I may have missed. The second time around, I did turn my head on the parts I knew were going to be gross and disturbing. But that is something the director felt the movie needed. I'm okay with that for this kind of story. It fits here. Still disturbing, but appropriate for the art form."
  },
  {
    "rating": "4/5",
    "review": "Very trippy, far out there, and hard to even describe. Memorable for all the right...and wrong reasons. Enjoyed it and was a wild ride."
  },
  {
    "rating": "2.5/5",
    "review": "It started promising, Demi Moore dis a fine job as a middle aged has been actress desperate to find relevance again and then jealous of her new body. But then the last quarter of the movie it went into grossout mood and it became hard to watch and even mean. Its OK not my type of movie, and yes society is very unfair to middle age and old people"
  },
  {
    "rating": "1.5/5",
    "review": "Really an over hyped movie. The idea was good but totally exaggerated on the screen. It really was not necessary."
  },
  {
    "rating": "1/5",
    "review": "This movie literally has no substance. It is poorly written, and full of gratuitous sex, blood and gore. The ending is ridiculous. You get the point immediately and then it doesn’t go anywhere. It’s basically just disgusting and gross. I feel like it was an utter waste of my time."
  },
  {
    "rating": "5/5",
    "review": "This is a good movie it brings out lots of different emotions... But the most powerful emotion was compassion... I like it and Demi Moore was great, she is a person who people always relate no not wanting age .... And the fact that she was so vulnerable with this roll. She earned my respect with this character she should win an Oscar for this."
  },
  {
    "rating": "5/5",
    "review": "I didn't know what to expect, at first I thought it was just a normal horror movie. As the movie passes on, things get darker and it became a total gore next to the end. Demi Moore delivers an unique and visceral acting, the best one in her career. The movie make an intelligent critique about how the media valorize young women and the old people are put aside like they're not useful anymore. It was a fierce critique which it could be seen in real life with the winning of Mikey Madison in the Oscar as Best Actress. It's an absolute must-see!!!"
  },
  {
    "rating": "2/5",
    "review": "the thing id its ok but its not as great as some people make it to be Also the fact that the two versions are not linked with anything .the originature or what ever its called is losing herself for someone else to live her dream . she doesnt get any benifit so if only they made it to be as the samoe person living 2 diffrent realities biweekly it would've been more intresting to see how they will damage themselves not thinking about whats to come and it would've made \"the fight\" scene more intresting"
  },
  {
    "rating": "4.5/5",
    "review": "Though a variation on \"fountain of youth\" premises we've seen before, it's a particularly creative and evocative twist on these concepts. It has more of a minimalist approach to special effects, but is shot in such a compelling way where every effect and shot counts. Indeed, this film reenforces the saying less is more."
  },
  {
    "rating": "0.5/5",
    "review": "High expectations for this film after all of the nominations. Kudos to Demi for her performance and the cinematography was incredible but that’s about it. The longer it went, the worse it got. Two hours and 40 minutes I wish I could have back."
  },
  {
    "rating": "4.5/5",
    "review": "I COULD NOT LOOK AWAY. Demi Moore like you've NEVER seen her. She deserved all the accolades she received. Margaret Qualley also Great. NOT a movie for Everyone. I, however, thought it was fantastic. Fascinating. Bizarre. SAD. Gory. Weird. Different. Unique. It will stay with me Forever. Probably in my nightmares too."
  },
  {
    "rating": "1/5",
    "review": "I don't get the good rating, this movie is stupid, senseless and insane. If you like this film, you have lost control of your life."
  },
  {
    "rating": "4.5/5",
    "review": "“The Substance” is a super intriguing film. It’s got that dark, twisted vibe, mixing body horror with some deep commentary on beauty and aging. Demi Moore really brings it with her role—she’s chillingly good. The movie takes you down some creepy paths, but it’s not just about the horror; it makes you think about the crazy lengths people go to for fame and youth. It’s got this slow burn that really hooks you, and by the end, you’re left with a lot to think about. Definitely worth a watch if you’re into something different and thought-provoking."
  },
  {
    "rating": "1/5",
    "review": "This movie is a stomach churning disaster. Hollywood is truly dead and living in hell."
  },
  {
    "rating": "1.5/5",
    "review": "original, unheard story. Some things though didn't make too much sense"
  },
  {
    "rating": "2/5",
    "review": "The whole movie was really good and held my attention. You really had no idea what would happen next. Yet the end really felt like the writer gave up or just pulled the ending from a hat of possible endings. There was a fine spot that the movie should have ended, it just doesn't and gets stupid. very disappointing"
  },
  {
    "rating": "3/5",
    "review": "The movie does well to lock you in and keep you guessing what will happen next. Surprisingly good and well acted with a unique approach from the director and director of photography. I was pleasantly surprised"
  },
  {
    "rating": "5/5",
    "review": "Batshit insane movie. Must-watch ong"
  },
  {
    "rating": "1.5/5",
    "review": "Nauseating and didn't have enough of a story. Felt like a vehicle to make the audience feel increasingly ill with the needles, the blood, the violence, etc. I like a good horror movie but this was too much. We were fast-forwarding at the end just to get through it."
  },
  {
    "rating": "0.5/5",
    "review": "Quite possibly the worst movie I have ever seen."
  },
  {
    "rating": "3.5/5",
    "review": "The body-horror concept is interesting and does eventually become horrifying, yes. However, the concept does seem a bit drawn out and I had a lot of unanswered questions at the end of the film. Fine to watch if you aren't too squeamish."
  },
  {
    "rating": "1.5/5",
    "review": "Atrocious. Walked out."
  },
  {
    "rating": "1.5/5",
    "review": "Dark and twisty, yet isn’t this a vulnerable and delicate topic for many people, mostly women? It seemed to be made for the mainstream market with overstretched unpleasant scenes which drive more reviews but miss the mark when it comes to meaningful storytelling!"
  },
  {
    "rating": "0.5/5",
    "review": "Pointless drivel. Suspended disbelief can only accommodate so many holes in a plot. And the acting was hammy. And it was too long - a bit like this review. I could’ve just said it was rubbish but here I am, still wittering on. I mean I really wouldn’t bother, you could go out and enjoy the sunshine, or have a nice toastie. You could even book a holiday and go and see a bit of the world. I mean, what are you even doing with your life?"
  },
  {
    "rating": "5/5",
    "review": "What an amazing movie! I was surprised at how good it was!"
  },
  {
    "rating": "5/5",
    "review": "Was actually an enjoyable movie to watch, it had good acting, the story was nice, it was a bit gory. The directors did a good job , would definitely see it again."
  },
  {
    "rating": "5/5",
    "review": "This Movie Was Great But I Cried In The End"
  },
  {
    "rating": "1.5/5",
    "review": "Overhyped, mindless, tasteless junk."
  },
  {
    "rating": "4/5",
    "review": "A bold Demi Moore movie showing the human response to aging and beauty standards with a good plot and scary, thrilling and gross enough to hold a standard B+ horror film."
  },
  {
    "rating": "0.5/5",
    "review": "Bad script which left good actors with very little to work with. Special effects, though they probably took great effort were unimpressive to me. Let's just say it's not for me."
  },
  {
    "rating": "2.5/5",
    "review": "If you like body horror and gore, this one is just basic. Despite having a good message, it does relly a lot on cheap tricks and sounds to make it feel gross. The acting was good, but not overly impressive - the Oscar nomination for acting came as a surprise to me, both actresses have better works. The whole film is a satire, and that makes the last 30 minutes of the film ridiculous. I understand that was the intention, to take the concept and push it to the extreme. But the final act really was just a waste of my time and a waste of their money. Made the whole thing feel stupid. Feminism, but for men."
  },
  {
    "rating": "2.5/5",
    "review": "This movie had a great concept and was very entertaining up until the end , it lost me . Very unnecessary plot twist that basically killed the whole movie for me . It’s a good watch up until the end ."
  },
  {
    "rating": "4/5",
    "review": "It wasn’t perfect but I was captivated. Creative premise and it was well told with good acting. A breath of fresh air in todays movie climate."
  },
  {
    "rating": "0.5/5",
    "review": "Honestly it started off ok but then I could barely get through it. I love gore but it was just dumb"
  },
  {
    "rating": "5/5",
    "review": "Absolutamente irreverente y brillante"
  },
  {
    "rating": "4/5",
    "review": "Really liked this movie....The Gore, the acting, Bravo to Demi.The ending not so much but I get it."
  },
  {
    "rating": "0.5/5",
    "review": "The movie starts with an interesting premise about the extremes people go to for beauty, but it fails miserably in execution. The production feels stuck in the 70s—not just in aesthetics but also in technical quality and storytelling, as if it were truly made with the limited resources of that era. Creativity is wasted on a shallow script with minimal dialogue and weak scene connections, making the experience feel disjointed and sluggish. Despite its promising concept, the film loses itself in its own approach, resulting in a frustrating experience and a waste of time. Even the lead actress made a mistake in accepting this role."
  },
  {
    "rating": "3.5/5",
    "review": "An aging actress discovers a way to reignite her career with disastrous consequences. Fargeat established herself as a capable director with Revenge, a stylish film I viewed in 2022. That style is improved upon here but I found it too detached to get invested in the characters. And the length is far too long. Despite that, I was enjoying my sojourn into this gonzo world until the ending. There is no way a stage manager would allow something like that. That ruined the illusion."
  },
  {
    "rating": "2.5/5",
    "review": "Very interesting scenario with a very talented director! Both actress were great! I would prefer the movie to had ended 40min before ..."
  },
  {
    "rating": "4/5",
    "review": "If Requiem for a Dream and The Fly had a baby The Substance would be the outcome. Great acting, a gloriously gross and fun story."
  },
  {
    "rating": "1/5",
    "review": "I HATE THE SUBSTANCE MY NAME IS REED FRIELER NEVER WATHC THSI HORRENDOUS PIECE OF FILM LITERATUREDS"
  },
  {
    "rating": "5/5",
    "review": "I was excited to see this film when I got on Blu Ray sucks that I missed my showtime because I fell asleep after coming back home from the gym."
  },
  {
    "rating": "4.5/5",
    "review": "Innovative telling a horror story for the modern times. Stand out performances from Moore and Qualley."
  },
  {
    "rating": "0.5/5",
    "review": "I wanted to like this but was sadly very disappointed. Long, gory, and boring."
  },
  {
    "rating": "4/5",
    "review": "Too on the nose at times, but the acting, direction and visual style are all superb."
  },
  {
    "rating": "5/5",
    "review": "The Substance is perfect at ramping up and up and up until it hits the ceiling - then it just bursts through the ceiling in the most gloriously gory of ways."
  },
  {
    "rating": "3/5",
    "review": "Jako naporan film. Kajem se sto sam uposte odgledala do kraja"
  },
  {
    "rating": "5/5",
    "review": "The Substance instantly became one of my favorite horror films of all time. Tops notch acting, amazing filmography, and an excellent relatable story."
  },
  {
    "rating": "1/5",
    "review": "Absolutely some of my most wasted hours of my entire life! Should have known Hollyweird would give so many accolades for such a stupid, poorly scripted movie. While the subject matter should be of importance, they managed to make a ridiculous, trite piece of crap. From the fact that there is no money required for the drug and no explanation of who's offering that type of drug to her or any background on the person/group supplying it to the B movie ending, it's just total stupidity from start to finish. This movie falls in the \"Emperor's Clothes\" category in that once people started saying it was amazing other sheep fell in line. Seriously, don't waste your time on this piece of junk. I'm sorry I did!"
  },
  {
    "rating": "0.5/5",
    "review": "First time reviewer. Had to give my 2 cents on one of the worst movies ever! Can't believe all the positive reviews. Demi Moore and Dennis Quaid should've never made this movie."
  },
  {
    "rating": "4/5",
    "review": "I would give 5 star if the last 15 minutes is not so exagerated. It felt out of place and don’t add to the global storyline. If the movie tell the same story without trying to look so shocking will get better result. A very good movie with an original story, a fresh of air in the current remakes saga!"
  },
  {
    "rating": "1/5",
    "review": "If the beginning idea shines with wit , the rest of the movie enters a spiral of vomiting blood that blows away any desire of watching this movie again…."
  },
  {
    "rating": "4/5",
    "review": "Very good film, the story is good and gripping, we don't see the time pass. I loved the way this film was filmed. Some moments are comical and don't spoil the serious moments. However, a little disappointment with the way the story ends, I find this ending much too ridiculous which spoils the atmosphere of the past hour and a half. I think this film deserves a better ending, however it is an original film that deserves to be seen."
  },
  {
    "rating": "4/5",
    "review": "Demi Moore got robbed at Oscar time. That's not a review of the movie, though, is it?"
  },
  {
    "rating": "5/5",
    "review": "Loved this thrill of a weird movie! So much symbolism. Makes me look within to my own image issues and where they could lead me if it got too extreme."
  },
  {
    "rating": "0.5/5",
    "review": "Ngl, hands down the worst film I've ever watched. I'd rather run through a field of broken glass and venomous snakes in 45 degree heat than have sit through this again. I lost apart of soul watching this. There's hell, then there's 'the substance'."
  },
  {
    "rating": "4/5",
    "review": "This should have been Demi Moore’s Oscar winner. As she completely lived in this character, and as an audience we can tell she gave it everything. Side note, I think this’ll go down as the most insane movie i’ve ever seen (and i’ve seen a lot of movies)"
  },
  {
    "rating": "0.5/5",
    "review": "\"The Substance\" aims for a provocative take on aging and beauty standards, but its message gets buried under excess. While Demi Moore delivers a committed performance, the script fails to give her character real depth. The film does have some striking cinematography, with well-composed shots that create an eerie atmosphere. However, it relies too much on grotesque body horror, often feeling excessive rather than meaningful. The constant, almost voyeuristic focus on female bodies—through lingering, unnecessary shots—feels less like a statement and more like indulgence. Instead of critiquing the exploitation of women, the film ends up participating in it. Ultimately, it’s an unbalanced experience that mistakes shock for substance."
  },
  {
    "rating": "5/5",
    "review": "This film is very good"
  },
  {
    "rating": "1/5",
    "review": "Half a star for the effects and half for Demi Moore's acting which wouldn't have been easy. Other than that the movie completely lost it's way and any message obliterated along with Elizabeth aka Sue aka Elizabeth."
  },
  {
    "rating": "0.5/5",
    "review": "The worst movie that I have seen for a long, long time. What was the point to the whole movie? Towards the end, I was thinking there has got to be a twist or some kind of explanation for all the violence. There was nothing. Terrible waste of two hours. Perhaps a reflection on what Hollywood has become of late."
  },
  {
    "rating": "3/5",
    "review": "Moore put in an outstanding performance and the film could have been so much more than it is. So many writers, directors and producers seem to lose purpose 2/3 or 3/4 of the way through and we end up watching the start of one film and the end of another. Moore and Quaid deserve 5/5 for their performances."
  },
  {
    "rating": "4/5",
    "review": "Recommended! I missed a good body horror flick. Great practical effects. Also, the cinematography is great, I specially love the stark contrast between the glossy fabulous world of showbusiness and fitness, and the more gritty scences, which translate not only in the explicit scenens, but even in small things like when the chain exec is eating shrimp, for example. Great score too."
  },
  {
    "rating": "3/5",
    "review": "First half: soft porn. Second half: gory horror."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely asinine. Don’t bother."
  },
  {
    "rating": "1/5",
    "review": "Would have got a 4...if it ended 20 minutes earlier."
  },
  {
    "rating": "0.5/5",
    "review": "Possibly worst film I have seen in 20 years"
  },
  {
    "rating": "4/5",
    "review": "The Substance is brilliant as it seamlessly transgresses from old ass to hot ass to dead ass to nasty ass and will keep the interest of most the whole time. All asses aside, it’s a poignant and powerful statement about the entertainment industry. This is an original story, this is original cinematography, this is original filmmaking; no one who complans about no new ideas in movies can complain about this."
  },
  {
    "rating": "3/5",
    "review": "This is good movie that women need actually Demi Moore actings never bad but the story development is too fast make it too much for me"
  },
  {
    "rating": "1.5/5",
    "review": "Thought this had some real promise, and liked the premise, but it devolved into shock horror/Meet The Feebles territory towards the end. Too much! Just became gross and ruined the entire message. Lost me entirely. Utterly disappointing! I'm out!"
  },
  {
    "rating": "1/5",
    "review": "Boring, hackneyed, too many naked women, a lot of not particularly pleasant moments"
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies Ive ever seen. I FF through all the butt cheeks (70% of the scenes) which was literally what the movie was. Sick and twisted yes. Plot= the Worst. Making the end deformity like the monster from the 300 movie? So bizarre and not scary. Just awful. Couldn’t fast forward quick enough. It never got better. A shame Dennis Quaid stooped to this horrible foul mouthed role, Demi? Why. Just why? So far fallen from Ghost."
  },
  {
    "rating": "4/5",
    "review": "Just a super fun body horror ride that does not disappoint"
  },
  {
    "rating": "5/5",
    "review": "Unexpectedly disgusting in an artistic way."
  },
  {
    "rating": "5/5",
    "review": "Demi was just amazing Everything was original , this movie was my favorite"
  },
  {
    "rating": "5/5",
    "review": "Honestly, this has been one of the best films I've seen in years. The director perfectly captured the subconscious pressure women face to be flawless and youthful in the eyes of men, regardless of the cost. The macro shots and close-up details? Absolutely stunning. The film struck just the right balance between unsettling and visceral. If you have Odontophobia or Onychophobia, be warned! The ending left me speechless, and the foreshadowing was brilliantly executed. Bravo!"
  },
  {
    "rating": "4/5",
    "review": "Uniquely written, great acting, and the movie flowed very well. Demi Moore was absolutely sensational. Going into the film, I knew that it was going to be gory, but I was really intrigued by all of the horrors. I laughed often at its offbeat humor -- normally gory movies turn me off. And I rewatched it to reassess both Demi's and Margaret's acting; was equally engrossed in the film the second time. It will leave you thinking long after the movie. I rooted for Demi to win the Oscar, and I recommend you watch the movie for the performances alone."
  },
  {
    "rating": "2.5/5",
    "review": "Don't regret watching it, but won't watch it again. A fresh take and overall decent storyline let down by it's longevity and sub par acting"
  },
  {
    "rating": "4.5/5",
    "review": "At first I didn't want to watch this movie, as it seemed a bit disturbing. Due to its many film nominations I decided to give it a try. I did end up really liking the movie, but it was disturbing nonetheless, which is probably why I did like it."
  },
  {
    "rating": "0.5/5",
    "review": "The movie is annoying and disgusting. The disgust is a goal of the movie but for a such a shallow idea for me it was completely unnecessary to endure the body horror."
  },
  {
    "rating": "1.5/5",
    "review": "O Filme é uma crítica excelente, mas deveria ter apenas 1h e 30 minutos. Após isso, o filme se perde e fica terrível. Seria 10 se tivesse acabado junto com a substância."
  },
  {
    "rating": "5/5",
    "review": "This isn’t a film for everyone and by now people know about the body horror which is a substantial part of the film but doesn’t define it. This camp, grotesque, sad, bonkers, batshit, hilarious and incredibly made film is a tribute to cinema old and new. I knew from the opening credits, that not only sets the tone but also the main social commentary of the film, that I was going to love it. Demi Moore gives a knock out performance - especially in the third act and Margaret Qually excels in her doppelgänger role, both matching eachother’s brilliant energy and understanding of the material and what Coralie Fargeat intended with her incredible script and direction. An instant classic that will be remembered for a long time. I love it when Hollywood and arthouse combine and they get it right. My film of 2024."
  },
  {
    "rating": "2.5/5",
    "review": "Do Wish The Theme...Obsession With Youth...Could Have Been Told In A Different Manner...Way Too Much Blood, Gore Etc..."
  },
  {
    "rating": "3.5/5",
    "review": "Appreciated the longer length of movie for this one. Intriguing but lacked dialog for me personally, though I do not regret watching it. Some interesting blackmirror-type thought provoking moments."
  },
  {
    "rating": "5/5",
    "review": "Reminiscent of old horror films. Having more visual impact and culturally abstract themes on beauty and ageing that shame us as a society. A horror film with a cause I loved every highly entertaining minute of it. Wonderful to see Demi Moore given the opportunity to shine yet again."
  },
  {
    "rating": "2/5",
    "review": "The beginning of the movie is via Sunset Boulevard with good acting by Demi Moore. The end of the movie is a stupid low budget horror film."
  },
  {
    "rating": "0.5/5",
    "review": "I decided to watch this based on the high ratings. There must be something going on with bots increasing favourable reviews because this movie is terrible. This movie didn’t make me feel anything except that I wasted my time and I’ll never get it back."
  },
  {
    "rating": "3.5/5",
    "review": "So, I finally got around to watching The Substance, and let me tell you, it's a wild ride. Directed by Coralie Fargeat, this film is a bold mix of body horror and dark comedy that takes a hard look at society's obsession with youth and beauty. It's not for the faint-hearted, but if you're into movies that push boundaries, this one's worth your time. The story centers on Elisabeth, played by Demi Moore, an aging Hollywood star desperate to reclaim her former glory. She turns to an experimental drug that promises to restore her youth, but things go horribly wrong, leading to a series of grotesque and darkly comedic events. Moore's performance is nothing short of fearless; she dives deep into the role, unafraid to showcase vulnerability and vanity in equal measure. It's arguably one of her best performances in years. Visually, the film is both stunning and disturbing. Fargeat doesn't shy away from graphic imagery, using it to satirize the lengths to which people will go to maintain their youth. The cinematography is sharp, and the special effects are impressively unsettling, adding to the film's overall impact. However, The Substance isn't without its flaws. Some critics feel that the film's approach to its themes lacks subtlety, making its commentary on aging and beauty standards feel heavy-handed. Additionally, the film's intense and graphic content may not sit well with all viewers, potentially overshadowing its underlying messages. Despite these issues, I found The Substance to be a daring and thought-provoking film. It challenges societal norms and forces viewers to confront the often grotesque nature of our obsession with appearance. If you can stomach the gore and appreciate dark satire, this film offers a unique cinematic experience that's hard to forget."
  },
  {
    "rating": "0.5/5",
    "review": "A cringeworthy B movie, glad I didn’t pay full whack at the movies to see that dross"
  },
  {
    "rating": "3/5",
    "review": "The substance has no substance. There isn’t a moral to the story. The character Elizabeth, Demi Moores’s Character gets nothing out of this experiment. She does not experience youth and beauty again. Visually it’s Kubric meets Lynch meets Aronofsky. This really was overall disappointing and I can’t believe I heard of people feeling this movie was snubbed by the Oscars. This movie has no business at the Oscars. It’s a gore horror flick at best."
  },
  {
    "rating": "5/5",
    "review": "This movie is absolutely hilarious 🤣"
  },
  {
    "rating": "0.5/5",
    "review": "If I could give this movie a zero I would. This is by far the worst movie I’ve ever seen. It’s not witty or some sort of commentary on society’s superficialness, it’s just bad. I want the two hours and twenty minutes of my life I spent watching this movie back. I have no idea how this was nominated for an Academy award. I’ve never rated a movie and this movie was so bad, I felt the need to finally do so."
  },
  {
    "rating": "2/5",
    "review": "It floors us that so many critics loved this movie. The premise is absolutely fantastic, acting superb and film techniques incredible. But the grotesque last third of the movie does not do it credit. Filled with deplorable nude scenes (which could have been done more effectively), transformation of the monster spewing blood across the audience, a breast falling out of the monster, and I could go on forever. It is not the type of movie I would recommend."
  },
  {
    "rating": "0.5/5",
    "review": "\"The Substance\" aims to critique Hollywood's obsession with youth and beauty but falters under the weight of its own grotesque imagery and heavy-handed symbolism. The film's artificial production design and reliance on shock value overshadow its intended commentary, resulting in a viewing experience that feels more punishing than enlightening. While Demi Moore's portrayal of Elisabeth Sparkle offers moments of depth, the narrative's lack of subtlety and excessive focus on body horror diminish the film's overall impact. Instead of providing a nuanced exploration of societal pressures, \"The Substance\" devolves into a spectacle that is challenging to endure, leaving viewers more repulsed than reflective."
  },
  {
    "rating": "1.5/5",
    "review": "While this movie and concept had potential… the last 25% of the movie went too far into stupidville. The critics who are saying this was a poetic and symbolic masterpiece have lost their marbles. I was left laughing at the stupidity of this movie for the last quarter of it and it’s almost insulting how far they kept taking it. Not sure how this movie won awards, it’s probably the most f’d up movie I’ve ever seen."
  },
  {
    "rating": "1/5",
    "review": "Gross and sickening."
  },
  {
    "rating": "3.5/5",
    "review": "I have mixed feeling about this movie. One one hand the whole thing is very creative, artistically. One the other hand, it's an over the top and borderline ridiculous horror film. The first half is great, you are curious about \"the Substance\" and what is going to happen (even though you are pretty sure it's not going to go well) then the rest get's crazy with an ending that will make you go \"WTF?\""
  },
  {
    "rating": "3.5/5",
    "review": "A very entertaining movie. Unfortunately, the ending kinda ruined it. It get it's message, sure, but it still feels like they had no competent way to finish the story."
  },
  {
    "rating": "0.5/5",
    "review": "Avoid it, shockingly bad movie. Had to laugh at how horrifically bad it was"
  },
  {
    "rating": "0.5/5",
    "review": "The sickest most horrible movie I have ever seen in my life."
  },
  {
    "rating": "5/5",
    "review": "It is unfair to this movie that i didn't get more appreciation from the Oscar. It is original story, great acting, the way it reflects current trends in beauty standards its to the face. And it blows a hard slap to the movie and beauty industry. And the work and imagination for the prosthetic is insane. Great work by creators of this movie."
  },
  {
    "rating": "0.5/5",
    "review": "What a horribly stupid movie!! Everything about this was a waste. I couldn't wait for it to end."
  },
  {
    "rating": "1.5/5",
    "review": "The concept behind the story is smart, the visual experience is plausible but the second half of the movie kicks in with unnecessary splatter and spoils the rest. Does not adds art to your life..."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I ever wasted my money on!!!!!! Don’t watch this movie. You cannot unsee the terrible movie!!!"
  },
  {
    "rating": "3.5/5",
    "review": "The film highlights in a grossly way this particular problem and suggests very strongly that something needs to be done about it as soon as possible. The film is 140 minutes long and the same story could have been told in less time, but that is not the biggest problem. The bigger problem is that the film becomes so absurd by the end that it feels like it's not the same movie at all. The film is a very good piece in the bodyhorror category and its elements are very well illustrated. In conclusion, I recommend this movie to anyone who loves bodyhorror because let's be honest this movie is pretty disgusting. I honestly think that the last half hour could have been cut out of the film as it is. Translated with DeepL.com (free version)"
  },
  {
    "rating": "3/5",
    "review": "Filme bom até mais da metade, depois começa a ir para o ralo. E a atriz que interpreta a Sue, tem uma atuação melhor que a da Demi Moore."
  },
  {
    "rating": "1/5",
    "review": "What a waste of 2 hours"
  },
  {
    "rating": "2/5",
    "review": "Terrible starts well but becomes gross and unpleasant"
  },
  {
    "rating": "4.5/5",
    "review": "hilarious, tragic, disgusting, and utterly terrifying, The Substance has it all"
  },
  {
    "rating": "3.5/5",
    "review": "Quasi-hallucinatory, Grand Guignol, surrealist science-fiction with a stunning, over the top, absurdist ending, that left me unsatisfied. If only the film makers could have nailed the ending; it's also obvious they want you to ignore gigantic plot holes and just digest the experience. With that in mind, it's worth a watch."
  },
  {
    "rating": "4.5/5",
    "review": "The Substance got under my skin—literally and figuratively. It’s messy, shocking, and completely unapologetic. Demi Moore is fierce, and Margaret Qualley’s performance is unforgettable. I kept thinking about this movie for days afterward, trying to make sense of its deeper meanings. It’s horror that dares to be ugly, and I respect that."
  },
  {
    "rating": "3.5/5",
    "review": "Pudieron terminar la película antes de tiempo sin tener que meter ese final espantoso y asqueroso pero aún así fue un muy buen tema fue muy buena película"
  },
  {
    "rating": "4.5/5",
    "review": "Disgusting. I loved it."
  },
  {
    "rating": "5/5",
    "review": "it's neither scary, nor all that comedic despite the comedy nomination at the ggs but it's great all around. MQ is about to burst and this is probably DM's best role"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was riddled with poor writing and plot holes that were never filled in or explained. The logic of the characters is pure idiocy and although the film gets pretty metal in the end, I cannot help but ask myself how many other ways could I have better spent that last 2 and a half hours of my life. Skip it."
  },
  {
    "rating": "2.5/5",
    "review": "It was okay. Kind of boring"
  },
  {
    "rating": "4.5/5",
    "review": "I always been a fan of a good horror never body horror too much, however this movie change all that for me I love the camera, effects, acting 🎭 I see why this movie won so many awards"
  },
  {
    "rating": "5/5",
    "review": "MOVIE OF THE YEAR. Seriously, it's so good I could watch it over and over again."
  },
  {
    "rating": "4.5/5",
    "review": "This movie will be remembered for many years to come. Demi Moore's performance is brilliant and the premise fits perfectly with the nihilistic society we live in."
  },
  {
    "rating": "3.5/5",
    "review": "The movie's overall concept is a great idea. It portrays how drugs can affect your mind and your imagination. It also shows how human always try to be beautiful to impress other people. The CGI is also very well made. However, the idea of the transforming scene and the monster in the end is very weird and unrelated to the concept. It isn't really a horror movie but also have some thrilling scenes. The ending is probably the worst. There are just too many things happened but not many things to understand. It's just like a fever dream. The characteristic of each character is clear and realistic. There are character developments along the movie also. There are also many mirror scenes which shows the act of self-reflection of the character. The actor's portrayal of the character is very realistic and admiring. The emotions expression is also great. Overall, this movie might not be the best option for everyone. But it is definitely worth a watch. If you are a movie enjoyer, this is a must. It is unique and not like other movies."
  },
  {
    "rating": "0.5/5",
    "review": "That was the worst movie I have seen in my life it wasn’t even a horror movie it was a catastrophe"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was terrible! The first half hour was promising but after that it goes down hill really fast. My first major issue with this film is that I felt like I was watching a b rated skin flick. Secondly the movie makes zero logical sense. This movie was extremely poorly written. It's never really clear if the main character lives the life of her clone. If she does you can understand why she would want to go through all this but it seems like she doesn't and they are completely different people, so the whole plot doesn't make sense. A little dialogue would have gone a long way. The clone servers no purpose to her, none. Like I said it isn't clear so I couldn't enjoy the movie. Then in the end it's just cheesy and stupid. This was two hours of my life I'll never get back, thanks. Side note I found it funny that a movie talking crap about sexualizing women was very much sexualizing women the whole movie."
  },
  {
    "rating": "4.5/5",
    "review": "Some scenes are so intense that you might find yourself turning away, needing a moment to recover before continuing. Absolutely gut wrenching and left me feeling disturbed… to say the least. Oh. My. God…."
  },
  {
    "rating": "1/5",
    "review": "I just didn't understand it. It's not horror because it wasn't scary. The prosthetics and make up were interesting at best. A lot of red fluid sprayed everywhere. That's pretty much the movie."
  },
  {
    "rating": "1/5",
    "review": "Terrible, dumb movie"
  },
  {
    "rating": "3.5/5",
    "review": "A wildly sophisticated film and there is beyond disturbing amount of body horror here. Great concept."
  },
  {
    "rating": "5/5",
    "review": "A thought provoking, slick, and at times humorous ride."
  },
  {
    "rating": "1/5",
    "review": "Demi’s acting was fine but in a movie with poor actors a slow plot and disgusting scenes don’t waste your time! The trailer and reviews I found were misleading, this was a gory, and slow movie that was hard to watch and I kept waiting for it to improve and it ended in the most bizarre train wreck! Worst movie ever, like the writers said what non- sensical, depressing twist can we add here and how about more blood."
  },
  {
    "rating": "4/5",
    "review": "O filme lembra muito a série brasileira \"a fórmula\" mas tem alguns conceitos únicos e incríveis, como a maquiagem, a própria história, os elementos da direção. É um filme muito atual e necessário, talvez o filme fique meio confuso, mas não tira a beleza do filme."
  },
  {
    "rating": "5/5",
    "review": "The Substance is a disturbing horror movie by Coralie Fargeat. It explores our obsession with beauty 💄 and the desperation to remain young and desirable at any cost. Starring the iconic Demi Moore and newcomer Margaret Qualley, this film makes you realize how far people will go to stay relevant in a youth-obsessed world. Read full review here: https://wesleythomashorrorauthor.weebly.com/horror-blog/the-substance-2024-movie-review"
  },
  {
    "rating": "5/5",
    "review": "The Greatest and powerfully meaningful film, I have ever watched."
  },
  {
    "rating": "1.5/5",
    "review": "Water of time, all this symbolism that critics are trying to find are like the emperors clothes, if they want to find somethings good in this awful movie good for them, for.me a grotesque long film."
  },
  {
    "rating": "5/5",
    "review": "This movie is one of the best horror movies of 2024! Demi Moore's performance is brilliant, while Margareth Qualley's deserves an Oscar just for that \"Control Yourself\" of hers, if there is a horror movie that deserves recognition, Substance is one of them"
  },
  {
    "rating": "3.5/5",
    "review": "i personally didn't like it much, there are some elements that i did find entertaining for sure but the story is a bit plain, just a girl who hates herself and you just wait for the movie to end bad as it is the only way to end it. One things i can say for sure is that it has an impact, some scenes stayed stuck into my brain for days. worth a watch"
  },
  {
    "rating": "1.5/5",
    "review": "Started off well, intriguing, dark humour but the last half hour was just plain silly."
  },
  {
    "rating": "5/5",
    "review": "I liked its slow pace and quietness which added, rather than took away, from the drama. It’s a wonderful satire on the quest for external youth and beauty without inner beauty. The Picture of Dorian Gray and Death Becomes Her most likely influenced this but it’s modern horror and relevant all the way. I also found a touch of Carrie and that’s no bad thing. Great - and bold - work from the three main actors who each played their parodies to perfection. Stunning sets and comedic overtones. Beautiful and grotesque. I loved it."
  },
  {
    "rating": "4/5",
    "review": "Amazing visuals and acting. Truly unique and unexpected."
  },
  {
    "rating": "3/5",
    "review": "It was ok. Honestly, i don't understand the hype. It actually wasn't that great. Not terrible, but not that good either."
  },
  {
    "rating": "3.5/5",
    "review": "I little bit ridiculous in some scenes. People that say Demi Moore would have won the Oscar for that interpretation do not understand nothing on movies. Sure, Demi Moore offered a good interpretation. However it is limited to some parts. The movie is founded on the fame that eat everything, but I disagree that people nowadays use products without instructions or a little information of what they are taking."
  },
  {
    "rating": "4/5",
    "review": "Me dió un poquito de asco"
  },
  {
    "rating": "2.5/5",
    "review": "The Substance is a provocative body-horror film that explores the extreme pressures of societal beauty standards and aging. I was captivated by its concept, particularly the initial horror and sci-fi elements surrounding the idea of a shared (or not shared?) consciousness. The film’s visuals and satirical edge effectively challenge the absurdity of age-defying expectations placed on women. However, as the story progresses, its absurdity, gore, and plot unravel into something closer to an acid trip than a symbolic horror. I found myself wanting more from Demi Moore’s older counterpart, whose presence felt underutilized. While the film embraces its sci-fi nature, the sparse dialogue left The Substance ironically lacking in substance, and what dialogue remained often felt so bizarre it could have been written by a third grader. I’m glad to have seen it for the buzz, but it’s not one I’ll be revisiting."
  },
  {
    "rating": "3/5",
    "review": "I liked the plot of the movie. It's unlike anything I've seen before, and it poked fun at beauty standards in a funny and clever way. However, this movie was hard to watch because of many very gross scenes. I wish they had tamped down on that. I can see why people have thrown up. I definitely felt nauseous. I had to close my eyes many times."
  },
  {
    "rating": "4/5",
    "review": "It's strong, impactful, agonizing, I've never felt bad and amazed while watching a movie. Splendid!"
  },
  {
    "rating": "3/5",
    "review": "This was out of this world weird.. I wanted to stop watching but I couldn't. It was....weird. it was as if time stood still. Slow but intriguing. Demi looks ...weird lol"
  },
  {
    "rating": "1.5/5",
    "review": "This movie was absolutly horrible. I was really interested in watching this from the first time I saw trailer. I finally decided to rent it from Amazon. The movie started well but this it just gets obsurd. From an old woman who cant walk to suddenly sprinting up and down stairs, to sleeping on the bathroom floor naked. This movie is a disappointment to say the least I turned it off with about 10 minutes left and yes I stayed for the scene in the theater. How the Heck did it get an Oscar?"
  },
  {
    "rating": "0.5/5",
    "review": "Lousy movie. More Hollywood hype."
  },
  {
    "rating": "5/5",
    "review": "Demi Moore definitely should have gotten the Oscar for this over Anara. Saw both and this was much better!"
  },
  {
    "rating": "0.5/5",
    "review": "I still don't know what i just saw. Started good, with potential then... idk still traumatized confused and weird it out about ketchup on the floor"
  },
  {
    "rating": "1/5",
    "review": "Ironically, it lacks substance – it's an interesting idea turned into a disappointing movie. At first, it seems oddly focused on visuals – but half an hour into the film you begin to realize that this is all it will offer, lacking story and character development, until, and including, the absurd finale."
  },
  {
    "rating": "5/5",
    "review": "Demi deserved an Oscar for this performance"
  },
  {
    "rating": "1.5/5",
    "review": "Weird messaging. Mostly predictably. Gross about arbitrary stuff."
  },
  {
    "rating": "0.5/5",
    "review": "I thought this movie was an absolute failure. The beginning was slow and as it progressed it became ridiculous. The ending was so over the top terrible I can’t find the accurate words to describe my distain for it. PLEASE take my advice and don’t waste your time , you will thank me for the advice"
  },
  {
    "rating": "0.5/5",
    "review": "I don’t understand how this movie made it to the Academy Awards. I will never get the 2+ hours back. I thought the premise had promise but the movie quickly went off of the rails and never recovered. Don’t waste your time is you are a horror fan! If you dare to watch it I promise you will be scratching your head in disbelief at what you are seeing. I prayed that it was over but the movie just kept going further into madness. Truly terrible. This movie is a hard NO"
  },
  {
    "rating": "2.5/5",
    "review": "O tema que ele aborda, sobre os padrões de beleza feminina e a obsessão pela juventude é a única coisa que salva no filme, pois achei ele nojento e bizarro. O final do filme é muito grotesco e da vontade de vomitar! Era óbvio que esse filme não ganharia o Oscar, muito menos a Demi More que passa boa parte do filme deitada no banheiro! #TheSubstance"
  },
  {
    "rating": "1/5",
    "review": "This was one of the worst films I've ever watched in the cinema. The first part was ok, and then about half way through they completely lost it, and literally any other ending would've been better."
  },
  {
    "rating": "5/5",
    "review": "O filme é fantástico em vários momentos, exagerado em muitos, mas ele deveria ser assim, entendi a necessidade desse exagero, afinal de contas, a denuncia do filme exige que ele seja dessa forma! Filme injustiçado no Oscar's."
  },
  {
    "rating": "5/5",
    "review": "Visually, this movie is stunning. Very well shot. The story gets a bit repetitive, but it displays the downward spiral into madness that the main character goes through very well. The practical effects are also excellent. It makes the movie that much believable. It has such digusting gore that i could barely watch a few scenes. I tipically don't like movies to display gore for the sake of it/jump scares, unless it's absolutely necessary. It's one of the reasons i don't watch scary movies unless they have a good story. But for this movie, it was absolutely necessary to have some of these scenes. Be warned, they will give you nightmares. Although i tipically don't like movies like this, i think this is an oscar contender, and it could even win in a few categories."
  },
  {
    "rating": "1/5",
    "review": "Utter garbage. It starts with a lot of promise, but soon descends into embarrassing tripe, the likes of which l haven't seen since the Toxic Avenger. It beggars belief that it received five Academy Award nominations, including Best Picture, Best Director, Best Original Screenplay, and Best Actress for Demi Moore. Give me a friggin' break!!"
  },
  {
    "rating": "1.5/5",
    "review": "You'll read or hear a lot about the message of this film. Most people misunderstood that message. It's not just about Hollywood's obsession with female youth and beauty. It's equally about how self-destructive Hollywood female superficiality can be. Moore's character is a narcissistic jackass, like many an actor was, is, and always will be. She's not supposed to be especially sympathetic. That said, if someone suggests the movie is profound either in form or content, that person is revealing himself or herself as not understanding profundity. Shallow cannot perceive deep. The film slams you in the face with its message, and that message has no original insights. It's a 90 IQ film for a 100 IQ audience. The story itself is not terrible, but a few points. The writer/director knows less than nothung about biology, so much of the film is unintentionally hilarious. Not uncommon for scifi, but outrageous ignorance never deserves much consideration. She tries to distract from the absurdity with insane levels of gore. That will titillate the juvenile and disgust the mature. The acting is solid, except Quaid's. He is a live-action cartoon villain. The best uses of this film are to learn about the mentality and limitations of its reviewers, and to test how mamy exploding heads you can stomach."
  },
  {
    "rating": "4/5",
    "review": "Demi Moore muito bem no filme. Efeitos especiais ótimos e uma história muito atual. Uma crítica ao mundo que pressiona pelo padrão da beleza e juventude eternas."
  },
  {
    "rating": "3.5/5",
    "review": "Interesting concept, although the ending became way to strange for my taste. Very much appreciate the message though. Acting was alright too, and the spfx were cool. Good if you like artsy flicks. Bad if you don't. I typically don't but giving it 3.5 due to writing, acting and effects."
  },
  {
    "rating": "1.5/5",
    "review": "I really wanted to like this film. I did for the first 30 minutes, then it began to bang a left. The last 45 minutes is a blood bath that makes no sense. Great concept ruined by a director."
  },
  {
    "rating": "4.5/5",
    "review": "Visceral, loved every minute of it, most creative horror movie I've watched in a while."
  },
  {
    "rating": "4/5",
    "review": "Demi Moore & Margaret Qualley were phenomenal in this film . The scenes were grotesque at times and the story was Very good . Always Appreciate who you are as a person and Be yourself ."
  },
  {
    "rating": "2/5",
    "review": "I feel the movie is 1 hour longer than it should. It's good as a critique of the entertainment industry, the desire for eternal youth, and the refusal to accept the passage of time. But it doesn’t have enough substance to justify being two and a half hours long."
  },
  {
    "rating": "4/5",
    "review": "Horrifying... but you can't look away. EYE-OPENING - HORRIFIC - TECHNICAL - INGENUOUS The Substance is another technical masterpiece. (Context: I just watched Challengers yesterday.) Absolute harmony between production design and the score - otherwise this would be a bad Barbie spinoff. It deals with much of the same ideas as Barbie, but in a much more grotesque way. What Kračun (cinematographer) does with the camera... ... ... The shots degrade in stability as Elizabeth's psyche gets split in two. The fish-eye effect is used with perfection. The perspective shots are reeling. No notes. Fargeat's previous work on Reality+ is like the conceptual draft for The Substance. Looking at her body of work, you can tell this is something she dwells on and takes seriously. The Substance is classified as horror... but it's not that kind of horror. It's psychological, a thriller. It gets graphic, no doubt... but if you understand the meaning... this hits you like a ton of bricks. The New Year's Eve party scene became over the top very quickly, in that it dragged on far too long, past the point it was trying to make. The whole film is ingenuous. Conceptually raw. Unashamedly IN YOUR FACE. A commentary on the addiction to beauty, the emptiness of vanity, and the sexualization of people. The story is about a woman... but if you're watching closely, it's applicable to anyone. ... freaking insane. The third act weakens a bit. It doesn't go where you'd expect it to take you, but if you haven't gone back to Amazon Prime and picked a different movie to watch, then you are already hooked and a long for the ride. The Substance is supposed to make to kinda freak out about what you're seeing. It's supposed to make you cringe, say \"oh my god\" and \"holy sh**\". It's designed to rip off the commercialization of beauty and show us what's it's really doing to our society, our bodies, our minds. It does all of this and more. A moment to talk briefly about nudity in film - THIS is what using nudity with PURPOSE looks like. There were some shots that were pointless, and some of its too in-your-face for my taste, but it's also supposed to be... That transformation scene in the bathroom... there are a ton of films that need to take notes here. Moore is... shocking, as Elizabeth Sparkle. She drags you on a journey down the path of obsession with image. Too many people are so far down this path already... the pursuit of perfect image turning them into monsters instead of of models. Love yourself. That is the cry of this film. Love who you are, as you are. That is what will free you. Love yourself, because He first love you. You don't need any substance to give you the better version of yourself, besides healthy food, sunlight, and water. You don't need anything to feel beautiful... accept who God made you to be, and you will have everything you need. Love who you see in the mirror... because God does."
  },
  {
    "rating": "0.5/5",
    "review": "1 word - DON'T! 2 hours 20 minutes of my life I won't get back. What a descent from a barely believable out-there futuristic concept that had potential, to such absurd stupidity it was comedic. Totally missed the mark. Don't bother!"
  },
  {
    "rating": "0.5/5",
    "review": "Man what a waste of a cool concept....went from very interesting to holy crap what a bad movie they made to a deformed E.T walking out onstage. So stupid. What a waste."
  },
  {
    "rating": "0.5/5",
    "review": "This goes from slow and boring to gross and unwatchable then just gets so ridiculous it’s beyond stupid. They tried so hard to make it artistic and meaningful, I guess it worked, someone got an Oscar. Let the academy watch it so you don’t have to."
  },
  {
    "rating": "0.5/5",
    "review": "save yourself do NOT"
  },
  {
    "rating": "4/5",
    "review": "This film hooked me from the start thanks to the outstanding performances of its leads. While it’s pretty weak as a body-horror film, the story keeps you engaged and is highly entertaining. Don’t expect too much gore, but it’s definitely a fun watch."
  },
  {
    "rating": "0.5/5",
    "review": "Overall just skip it. Don't waste your time here. Watched to figure out why others liked it so much and I wish I didn't. It's shot well and some nice horror moments but the story is beyond terrible that it makes me question why this thing was even made. So many loopholes you have to put aside. Just an annoying watch."
  },
  {
    "rating": "3.5/5",
    "review": "The Substance presents a shocking depiction of the lengths people will go to create a perfect version of themseves."
  },
  {
    "rating": "5/5",
    "review": "If you love horror this a MUST SEE. Especially in theatres. A wild, unexpected, bonkers of a good time! Anyone hating in the reviews is LYING and too simple minded to enjoy this film!! Also Seeing Demi Moore on screen is always a pleasure! She was PHENOMENAL. And though the message is aimed towards women aging, the director did a great job and allowing the film to resonate with everyone. As a 30 yr old male I did a lot of reflecting myself after seeing this!"
  },
  {
    "rating": "0.5/5",
    "review": "There is no real story. It felt more like an excuse to exploit women. I know what they say the meaning is, but it fell flat with the poor storyline. I am not a fooled viewer. This movie was a waste."
  },
  {
    "rating": "0.5/5",
    "review": "What was that?? 🤔 2hr 20minutes of my life I won’t get back…"
  },
  {
    "rating": "4.5/5",
    "review": "For being 140min it moves at a pretty quick pace. Great elements of modern and classic horror. All the comparisons made to Corman, Carpenter, Argento, and even a little early Karine or Peter Jackson are on point. Reminds me of going to Chart Hits as a teenager and grabbing that movie off the bot knowing I would be WAY too high for what I was about to watch, and I mean that in a wholly positive manner. Those with a good theater system will appreciate the excellent sound design. Great film, glad I chose to see it in theater."
  },
  {
    "rating": "0.5/5",
    "review": "Awful movie, not because it’s gross. There’s just nothing good about it. It’s long and boring, it drags a basic concept over 2 hours, there’s no dialogue, annoying close ups, ad nauseam close ups! One of those annoying, absurd movies that show up and everyone raves on about it. But it’s just trash!"
  },
  {
    "rating": "1/5",
    "review": "Possibly one of the worst movies I’ve ever sat through. And it goes for over 2 hours which makes it worse. Critics are not at all writing about what is a good movie but focussing purely on an inspirational message being strongly displayed. Bring back old movies, this is trash."
  },
  {
    "rating": "0.5/5",
    "review": "What a shitshow. I can’t recommend. It"
  },
  {
    "rating": "5/5",
    "review": "Good movie for the story nice"
  },
  {
    "rating": "2/5",
    "review": "Well, I watched this haha. Super gross in contrast with sex appeal. Wild. Acting was great and obviously the makeup, art, prosthetics were good. Not rewatchable for me"
  },
  {
    "rating": "5/5",
    "review": "Very good sci-fic movie I ever watch! The acting, the camera perspective, the tension make me sivering!"
  },
  {
    "rating": "5/5",
    "review": "the movie was so good anda inspired"
  },
  {
    "rating": "3.5/5",
    "review": "With a strong sense of irony, the interesting premise and heavy meta narrative still lack substance. As it becomes increasingly difficult to separate actor and role the meta narrative of an aging star in the film being played by an actual aging star does much of the heavy lifting in the narrative. Particularly when it comes to the stark and scenes of Elisabeth (Moore) examining her body in the mirror being mirrored by the (near perverse) audiences attention on the bodies and imperfections of starlets. Similarly the comparisons of young and old bodies that have mainstays in the everyday conversations and societal norms are challenged by the themes of the film. However, the film in my opinion does not go far enough to explore the wider commentary and themes of the our older selves \"paying for the sins\" of our younger selves. The world we are shown is noticeably narrow and Elisabeth seemingly has no \"life\" to speak of outside of her work. If this was the intention of the filmmakers it should have been expressed more deftly. At present the film just feels empty because of budgetary issues rather than a stylistic choice. We see a vignette of a world when it would be far more meaningful to see wider consequences and character interactions. Moore, Qualley and Quaid all do well in their respective roles, though sadly the acting chops drop off a cliff beyond this trio which also hints at a lack of budget and a potential explanation why it wasn't possible to deliver a grander vision. If the Substance had Megalopolis Money it could have been a masterpiece rather than a quirky side show."
  },
  {
    "rating": "4/5",
    "review": "Pretty gross and creepy but I could take my eyes off the screen. Interesting concept however if I looked like Demi I think I could live with it (HAHA). She should have won for Best Actress - she was amazing!"
  },
  {
    "rating": "3.5/5",
    "review": "Once in a while you want to drink a milshake and smoke a cigarette while bathing in the bathroom."
  },
  {
    "rating": "5/5",
    "review": "One of the most twisted, original and unique movies I’ve ever seen!"
  },
  {
    "rating": "4/5",
    "review": "Good but not great :)"
  },
  {
    "rating": "5/5",
    "review": "Wild!! It was a great movie. Some of it was a little out there, but worth watching. Demi definitely deserved her award."
  },
  {
    "rating": "0.5/5",
    "review": "CRINGEworthy! Terrible I cannot unseen this movie… but you can avoid this experience. DO NOT WAIST YOUR TIME"
  },
  {
    "rating": "4/5",
    "review": "Breath of fresh air for an industry in decline, I don't give it 5 starts because I couldn't stomach some scenes (yeah it's not on the movie it's on me) but great movie, great filming, great performances"
  },
  {
    "rating": "4/5",
    "review": "So many sub themes run through this film. It definitely makes the viewer stop and think like a good Malkovich movie. Totally feels like The Fly for its brutal gore and body destruction."
  },
  {
    "rating": "5/5",
    "review": "Such a weird but cool movie Absolutely loved it"
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely awful movie!!!!! Absolutely gross🫣"
  },
  {
    "rating": "4.5/5",
    "review": "This movie was phonomenal; an amazing take on aging, celebrity culture, modernity, and self-perception as a woman. It also examines what the 'self' is, compared against many different things. I tend to not like many modern movies, but this might be one of my favorite movies EVER; the body horror in this is enough to leave a horror fanatic nauseous. It does get pretty messed-up in certain scenes, so if you're not a fan of body horror, blood (and arguably gore), or injections, stay away. The suspense in this movie is also amazing--it's edge-of-your-seat tension all throughout. The editing is great; I love the contrast between Elisabeth as Sue and Elisabeth as Elisabeth. One thing I think could've been done better is the contrast. In some scenes, it's a bit difficult to understand what's going on due to dark lighting combined with low contrast. However, such scenes are few and far between. I have to agree with the more critical reviews that the ending seemed a bit over-the-top, but what isn't in this film? Quick warning before I end the review; this movie is NOT for everyone. You have to be a seasoned fan of 'weird' horror to get this, in my opinion. I wouldn't be surprised if most people just thought it was something made for the mentally deranged."
  },
  {
    "rating": "0.5/5",
    "review": "The worst movie I have ever seen. I know the ending wanted to be metaphorical but it looks like it was written by someone with some mental disorder. I can't belive this \"movie\" have so high rating. It's just disgusting and disturbing. This is not a good way to make a point to anything. Man...it's bad, very disturbing, not like horror but like .....don't have words for this. It's very disturbing....."
  },
  {
    "rating": "5/5",
    "review": "Great performance from Demi, amazing makeup and effects."
  },
  {
    "rating": "1/5",
    "review": "All of the actors in it were great. My review would be different if it weren't for the last 10 minutes of the movie which felt like a horror film on par with Sharknado. If you do watch it, maybe turn it off before the end and then at least you get to appreciate the concept of the film."
  },
  {
    "rating": "5/5",
    "review": "What a beautifully ugly allegory about self-hatred. Throw in some social commentary on what it's like to be a woman in a society where your youth and beauty is the ultimate commodity. For me, there were so many ways to look at the film. Things that came to mind were the ever-expanding market for plastic surgery and the risk of deformation, and the messages we tell our young women and men: you lose value as you age. I particularly liked the scene with the \"shareholders\" - hilarious. For me, it was a sad, sometimes angering, but at the same time life affirming movie. I've read some other reviews commenting negatively on the hyper-fixation on Sue's body, but I found it in line with Coralie Fargeat's style. It's also a body horror film where the body is the main focus, so why wouldn't we also be focusing on Sue's body?"
  },
  {
    "rating": "2/5",
    "review": "It was good until the final 20-30 minutes when it went completely off the rails. The messaging was good and I loved the story and the way it was being told...until the gaudy, unneeded gore fest that was the end of the show. None of that was necessary or seemed to fit with the rest of the show. It was as if the Director decided he needed to spend some budget money. This also made the movie much too long. If this had ended at 100 minutes, it would have been much more impactful. Confounding choices at the end."
  },
  {
    "rating": "2/5",
    "review": "I love Demi and Margaret was awesome and so was the whole cast, but the story and subject were not compelling to me. It was challenging to watch until the end."
  },
  {
    "rating": "0.5/5",
    "review": "The substance is the stupidest movie I have ever seen. It is senseless, disgusting and meaningless. Shame on everyone who participated. This garbage getting awards illustrates how our values are twisted."
  },
  {
    "rating": "0.5/5",
    "review": "This movie definitely wasn't for me. It had terrible gore, and a weird amount of nudity/sexualisation. It also felt like the plot jumped too much or had no meaning to it, kinda felt like an over glorified teen movie turned into a horror. My least favourite part was probably the food scenes, it felt so wrong to watch it. But idk, maybe I'm missing the bigger picture/meaning of this movie, but I just didn't like it all that much"
  },
  {
    "rating": "2.5/5",
    "review": "Tinha muito potencial! Ele tem dois momentos, antes dos 20 minutos finais e dois dos 20 minutos finais. O ápice final é muito, digo em exagero mesmo. Virou salada, ápice de atuação, de direção, de imagem, de desenvolvimento e resolução. Perdem a mão em efeitos e a conclusão deixa o filme com um Q pitoresco que não agrega com a narrativa que se cria. O roteiro é mal feito, a direção é fraca, mas a critica sexista, etarista é pesada e fica visível mesmo sendo trabalhada de forma natural mas nada sutil. A atuação da Demi Moore é fraca, pra mim deveria agradecer e muito a indicação para o Oscar. Franca porque não tem consistência, ela começa morna e poderia ter entregue muito muito e até mesmo levantado mais o filme e problemas como os que eu citei talvez seriam irrelevantes. A atuação dela só fica realmente notável e distinta no ápice final e ai já é tarde demais. Fotografia do filma claramente é machista e tenta a todo custo objetificar as atrizes, mas essa é a proposta, então se seguiu a proposta ta de parabéns, mas no contexto geral é pobre, ruim, mais do mesmo. Parece filmado de uma Galaxy Pocket. Cenários mal elaboradores, longos corredores, recursos que parecem ter sido reaproveitados de outra set em set. Faltou criatividade na construção de cenário, só mudou os papeis de parede, o que me faz acreditar que abusaram do CGI. Notável emprego demasiado de recursos em maquiagem e recurso escasso para o restante do projeto. Maquiagem final impecável! Sem retoques! Alias, poderia ser menos excede no lúdico. Ah, o excesso no uso de recursos sonoros (som dos personagens mastigando), gera agonia e repousa do personagem, ajuda na construção do estereótipo do etarista principal."
  },
  {
    "rating": "0.5/5",
    "review": "childish and stupid. pathetic movie"
  },
  {
    "rating": "3.5/5",
    "review": "Movie is way too drawn-out. There were too many filler scenes that felt more esoteric than it was thought-provoking and thus made for a lot of boring moments. Nevertheless, it's beautifully shot and excitingly bizarre. Overall great acting from the cast such as Quaid and Qualley, though Demi Moore is the best thing about this film."
  },
  {
    "rating": "1/5",
    "review": "Started off really well except for the ham fisted attempts by Quaid to be edgy and over the top. He’s never been a good enough actor to pull off broad character choices without employing his signature cheesy grin and he seemed sort of desperate. And sad to say, an entire pretty good premise does sort of the same thing at about mid point of this film. Desparate because somebody seems to have figured out the story had no intelligent or creative pathway forward. So….more annd better gore. Qualley and Moore did a really good job for the most part, but I’m glad the academy chose to not give Moore an Oscar for this. It would have been like giving one to Faye Dunnaway (a much much better actress) for going over the top so severely in Mommy Dearest. I’ll give credit though; Demi Moore did some good work in what was basically a gore fest without an ounce of nuance when all was said and done."
  },
  {
    "rating": "0.5/5",
    "review": "Simply bloody awful. Story is moronic. Acting really good. Quaid a terrible over actor"
  },
  {
    "rating": "4/5",
    "review": "Definitely worth the watch!!"
  },
  {
    "rating": "4/5",
    "review": "I loved, they know very well what body horror is, a genre that I hate a little, but without a doubt I have been fascinated by the disgust but at the same time the realism of the versions that deteriorate (so to speak) in addition to the fact that it has a great and very entertaining plot, what was hard for me to understand is that ending that is quite strange and what stands out most is the great use of makeup, how would they have done it?"
  },
  {
    "rating": "3/5",
    "review": "Great acting, but was not enough for making this movie good."
  },
  {
    "rating": "5/5",
    "review": "perfect, it has so many meanings to be more grateful and love myself, from the shooting to the execution flow which is concise and doesn't make you bored."
  },
  {
    "rating": "1/5",
    "review": "Demi Moore has had a great career but after watching this movie and seeing the attention it has gotten I can't help but wonder Is this some kind of lifetime achievement trophy for Moore? The acting and effects are good, but the plot is unbelievably vapid. Don't get something about the plot? Don't worry the director will spoon feed you. The young actress looks great in an 1980s inspired workout outfit. You get to see some (honestly for a horror fan rather tame) body horror. And for the most part the actors do a decent job hamming it up with the silly script. But everything else about this movie makes it a giant waste of anyone's time. I had this movie recommended to me because I love horror movies. And who doesn't enjoy a good satire? But sadly this movie's plot is so contrived and self-indulgent, a viewer has to forget instantly character motivations the movie sets up for the story to make sense. If someone recommends this to you they are incredibly shallow or they are too afraid to watch better horror movies."
  },
  {
    "rating": "1.5/5",
    "review": "I only watched this because of it being showcased at the Oscars. It’s lacks any substance (ha). It’s all about nudity and poorly done gore. An extra half star given for all the hot scenes."
  },
  {
    "rating": "5/5",
    "review": "Well at least I can say that I feel really good about myself after watching that! 😂 Beautiful and unpredictable, sexy and grotesque all mixed into one!"
  },
  {
    "rating": "5/5",
    "review": "Requiem for a Dream meets Aphex Twin on meth!"
  },
  {
    "rating": "5/5",
    "review": "The one of gore film with unique horror vibe i seen. Good to watch"
  },
  {
    "rating": "0.5/5",
    "review": "Gross, I want my time back! 😝😡🤬🤬🤬"
  },
  {
    "rating": "5/5",
    "review": "i loved it! and Demi, wow, such a knock out yea she's not 19 anymore, but who cares she is stunning. in all honesty her compared to margaret, well margaret wins for body, but demi wins for face. her face is just so beautiful. margaret's ehhh maybe a 5. but hey thats just me."
  },
  {
    "rating": "3/5",
    "review": "too much gore, started well but the end was terrible. I dont get it how this was even nominated to an Oscar"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies I have ever seen. Had a named actress like Demi Moore not been involved it would have/should have never been made. Dennis Quaid is a great actor. I actually felt sorry for him here. Terrible waste of time and $5.99 rental fee"
  },
  {
    "rating": "5/5",
    "review": "Best story. It's actually show another point of view.."
  },
  {
    "rating": "0.5/5",
    "review": "Horrível não recomendo"
  },
  {
    "rating": "5/5",
    "review": "Just wow. Gross, dark, humorous, entertaining, campy and gross. I was mesmerized. I’m actually watching parts of it again. Not for weak stomachs. Won’t give anything away. Cast was awesome."
  },
  {
    "rating": "5/5",
    "review": "I think this movie will be great to show young women that you dont need to change yourself to look beautiful."
  },
  {
    "rating": "1/5",
    "review": "Interesting concept. A sci fi twist on Death Becomes Her. But this was taken to the extreme. It was gore with no purpose other than seeming shock. It should have ended with the final internal battle. I wouldn’t recommend this. Do you do yourself a favor. If you watch this, stop the movie where you think it is ending. Because it should’ve."
  },
  {
    "rating": "3.5/5",
    "review": "An intense film, reminiscent of Requiem for a Dream. Grotesque and violent commentary about Hollywood standards of beauty with an obvious Jane Fonda-like heroine. Tough to watch, but weirdly compelling."
  },
  {
    "rating": "3.5/5",
    "review": "O FILME É BOM, MAS EU NÃO GOSTEI MUITO DO FINAL, ACHEI MEIO EXAGERADO, MAS O FIGURINO E A MAQUIAGEM ESTÃO MUITO BEM FEITAS, TODA A CONSTRUÇÃO DE ENREDO E DAS PERSONAGENS, FAZ O TELESPECTADOR CRIAR UMA CONEXÃO COM AS PERSONAGENS."
  },
  {
    "rating": "2/5",
    "review": "Strange name for a movie that’s all flash and no substance."
  },
  {
    "rating": "5/5",
    "review": "the actor was very cool and plot wist movie"
  },
  {
    "rating": "1.5/5",
    "review": "Gratuitous nudity and excessive violence with ridiculous ending."
  },
  {
    "rating": "5/5",
    "review": "I love the way Demi Moore acts."
  },
  {
    "rating": "0.5/5",
    "review": "Ok, I don' know how anyone could enjoy this movie. It had heavy groteque scenes and lets not forget about the constant nudity. Strange how Demi would make this movie since she obviouly had work done herself. Worse movie I have seen in a long time. Although, one I won't forget anytime soon...unfortunately."
  },
  {
    "rating": "5/5",
    "review": "what an amazing movie"
  },
  {
    "rating": "5/5",
    "review": "Film yang sangat bagus"
  },
  {
    "rating": "5/5",
    "review": "The film is kinda good"
  },
  {
    "rating": "5/5",
    "review": "Perfect movie, demi moore deserved an oscar for her role"
  },
  {
    "rating": "5/5",
    "review": "WOW Absolute Cinema!!!"
  },
  {
    "rating": "5/5",
    "review": "Film nya bagus seruu!!"
  },
  {
    "rating": "5/5",
    "review": "Filmnya Seru banget......"
  },
  {
    "rating": "5/5",
    "review": "The special effects/Makeup were top notch. Oscar material"
  },
  {
    "rating": "1/5",
    "review": "The worse film i have ever seen .... words fail me ."
  },
  {
    "rating": "5/5",
    "review": "Demi Moore her best performance to date and Deserves an Oscar for this. Terrific Story good cast and compelling"
  },
  {
    "rating": "5/5",
    "review": "Really intense movie! A great satire of our modern world obsession with beauty. Perfectly executed in a very grotest, gore and sickening way. If you have a bit of anxiety, prepare yourselves, it's though, but a great movie! 👍"
  },
  {
    "rating": "3.5/5",
    "review": "For now, i have watched The Substance for three times. It is definitely a great study on self-love, fame and media, but somehow the body horror on display at the last third is not for me. Demi Moore deserves every praise."
  },
  {
    "rating": "3.5/5",
    "review": "It was a pretty enjoyable film with an interesting premise, good acting and excellent special effects. It was let down by the ending where it was like if Monty Python made a horror film. Definitely the ending was a case of when less is more being a better option."
  },
  {
    "rating": "2/5",
    "review": "This movie had great potential and 80% into it I was liking it a lot - but then the RIDICULOUS ending!! So dumb…"
  },
  {
    "rating": "5/5",
    "review": "Loved the beautiful demi moore and what the represented about older women. People want newer, better, etc. sometimes classics and well seasoned is the way to go. I saw myself in some parts. Love the view of dennis quad on the lens. loved the concept. loved the gore. Thank you for a fantastic movie! Thank you for bringing it to the theater!"
  },
  {
    "rating": "2/5",
    "review": "Lost effect after Sue used the Activator. Artistically bloody."
  },
  {
    "rating": "0.5/5",
    "review": "This movie had potential, but it was wasted in the final part. The director lost his touch, and the ending is absolutely terrible."
  },
  {
    "rating": "5/5",
    "review": "Después de años de ausencia de la gran pantalla, Demi Moore regreso nuevamente con una obra maestra moderna del cine de terror que retrata la lucha interna que muchos sufren al tratar de encajar en una sociedad donde lo único que importa es la apariencia externa. The Substance es una refrescante película de horror corporal que actúa como una cruda sátira sobre cómo los estándares de belleza han hecho que se valorice más la apariencia por encima de la individualidad. Coralie Fargeat presenta una deslumbrante visión que toma inspiración de David Cronenberg y la plasma en una experiencia cinematográfica bastante deslumbrante. Los planos y la fotografía no son lo único admirable, la directora hace acercamientos de primer plano y un acertado uso del sonido para generar sensaciones. La banda sonora de Raffertie es una magistral composición que tiene bastante glamour. La película tiene un sabor único que no se ha visto en otras películas y se siente muy fresca. A pesar de abordar un tema que otras películas han tocado, la manera en que lo hace le da bastante originalidad. El maquillaje que se usa para la belleza de Sue y el decaimiento de Elisabeth es asombroso. Nada más se usaron unos toques de CGI, pero el maquillaje es admirable al nivel de muchas películas de los años 80. Podría decirse que la historia en sí es bastante sencilla, pero el mensaje de la película y el profundo desarrollo de ambas protagonistas le da bastante potencia. Aunque Elisabeth y Sue son la misma persona, el desprecio que Elizabeth siente y el deseo de tener la aprobación de los demás por medio de la perfección, dan lugar a que Sue se manifieste como un doppelganger. La película se convierte en una historia similar a Jekyll & Hyde, pero tirando más por el lado de The Nutty Professor. Para entender la comparación, The Substance es protagonizada por una mujer que es descartada por ser una mujer mayor y no tener juventud. Algo que es irónico, pues Demi Moore aún es atractiva a pesar de tener unos 60 años. El punto aquí es que Elisabeth vive en una sociedad donde la belleza es un producto que se puede explotar y cuando se gasta, termina siendo desechado. Dicha sociedad implanta la idea de que para poder encajar y ser valorado, hay que cumplir obligatoriamente los estándares de belleza que la sociedad demanda para ganar un alto prestigio. Al ser una mujer de 50 años, Elisabeth es desechada y eso hace que ella deje de sentirse valorada provocándole un vacío existencial. The Nutty Professor de Eddie Murphy no está lejos de esta idea sobre tener que ser bello para sentirse aceptado. En esa película, Sherman Klump es un hombre con sobrepeso que se siente infravalorado y menospreciado por su físico. Eso lo lleva a recurrir a la fórmula que lo convierte en un joven viril con excelente físico. Con The Substance pasa lo mismo cuando Elisabeth decide recurrir a La Sustancia para convertirse en la bella Sue. Ambas personajes simbolizan el conflicto interno que la protagonista siente y sus dos versiones se convierten en dos personalidades separadas. Elisabeth empieza a envidiar a Sue por su belleza y la admiración que está recibiendo y cuando decide terminar con ella, no puede porque se convierte en su único medio para tener la aceptación de los demás. Esto ya sería una metáfora de ese ser que muchos fingimos ser en los medios o en las redes para tener la aprobación de los demás. Fingiendo ser algo que no somos en realidad, pero acabamos siendo dependientes de esa imagen para no perder nuestro lugar en la sociedad. Sue siente desprecio hacia Elisabeth porque ella es esa vejez que muchas mujeres que se sienten perfectas o que se preocupan por su aspecto no desean. Ella es la materialización de ese autodesprecio que Elisabeth se tiene. Sue es ese sentimiento de negación hacia el envejecimiento y que siempre quiere vivir en la ilusión de ser eternamente bella. El monstruo que surge en los últimos minutos de película aun con ese sueño de ser admirada hasta el final, completa la metáfora de esta película. Claro que hay momentos humorísticos que pueden rayar en lo absurdo. La escena del portero puede parecer ilógica, pero no se sabe si eso realmente paso al ver a la criatura ilusionando con el recibimiento que tanto anhela. Tras toda la analogía, La Sustancia a la que Elisabeth recurre es claramente una metáfora sobre los cosméticos y las cirugías a las que las personas se exponen para mantener esa belleza perfecta que no quieren perder. Al no aceptar que todos envejecemos, ya sea por vanidad o por depender bastante de la aprobación de los demás, no aprendemos a aceptarnos tal como somos. Eso lleva a que terminemos recurriendo a métodos que pueden ser dañinos para nuestra salud y llevarnos a nuestra propia destrucción. The Substance refleja cómo las jóvenes que desean encajar en una sociedad superficial acaban recurriendo a productos o cirugías para perfeccionar sin importar los riesgos de salud. Más aún en una generación donde las niñas jóvenes desean alcanzar la belleza perfecta usando cosméticos para adultos que pueden perjudicar su salud. La estrella de Elisabeth al inicio y al final de la película dejan en claro que a esta sociedad no le importa nuestra salud, ya que solo nos ve como consumidores o simples productos. The Substance acaba siendo una asombrosa película que sabe transmitir una cruda realidad sobre nuestra sociedad y demuestra que el cine de terror puede dejar un valioso mensaje como otras películas. Mi calificación final para esta película es un 10/10."
  },
  {
    "rating": "0.5/5",
    "review": "WORST movie we’ve ever seen! How this movie has been nominated for any awards is mind boggling. Very few lines for actors to learn for this movie just grotesque special effects and costume changes."
  },
  {
    "rating": "4/5",
    "review": "The acting was superb, but it could've ended sooner than this.... With the final scene being the final result of her form... The stage scene wasn't well written nor played and the details of the body parts and bloody scene afterwards was the step further that the movie didn't need."
  },
  {
    "rating": "5/5",
    "review": "ini film ter dar der dor sih menrutku, bagus banget, walaupun kasihan sama yang asli cuman ya gimana lagi dia juga kurang bersyukur, tapi bagus banget gak boong"
  },
  {
    "rating": "2/5",
    "review": "Started off strong, then it got weird, and finally ended just stupid."
  },
  {
    "rating": "4.5/5",
    "review": "I cant believe so amazing 🖤🖤🖤"
  },
  {
    "rating": "4.5/5",
    "review": "the ugly within and the ugly without, whether you like it or not it can't be denied."
  },
  {
    "rating": "1/5",
    "review": "It started off with an interesting concept, but it failed to have anything interesting or significant to share. The movie had grotesque footage and lots of blood and gore. Growing older is hard for both men and women and the portrayal of men is not relevant for today’s time."
  },
  {
    "rating": "0.5/5",
    "review": "Sorry for Demi Moore, but this is just the worst movie I have seen. The willful disbelief of anything that might be reality (like the production sequences), is pushed even further by the stupidity and gore. Even the 50's teen age horror parody at the end is beyond anything worth watching or filming. The critics that said this is good are full of themselves and should be marked for the Hall of Shame. The ending, special effects, and cinematography are beyond puerile, beyond even what Beavis and Butthead would create given the chance."
  },
  {
    "rating": "3/5",
    "review": "A very unique movie that depicts the issue of how body image can make people think and act in ways that damages themself. Intense gore and a lot of nudity. The gore was very similar to what you’d see in the movie The Thing. Not for kids or older generation."
  },
  {
    "rating": "2/5",
    "review": "I am still in disbelief at what I just watched, on one hand its a movie about an aging woman losing her youth and her career crossed with an alien type, roald dahl witch hybrid. The middle contained a lot of fluff and I kept getting impatient wanting the story to hurry along. I didnt watch to the end. It could have been good, maybe if they laid off the cheap horror cliche nudity and actually elicited some fear instead of gore. I mean did they answer the age old question would you sell your soul to get yoyr youth back?"
  },
  {
    "rating": "0.5/5",
    "review": "Probably the worst movie I've seen all year. I can't believe it's up for academy awards! Admittedly not my favorite genre but also really poor props and scenery, as well as a poor storyline makes this a thumbs down for me."
  },
  {
    "rating": "3/5",
    "review": "O filme é até bom, mas se perde em muito CGI. Vale a pena assistir? Sim, Demi está bem? Sim! Merece o Oscar? Não!"
  },
  {
    "rating": "4.5/5",
    "review": "very cool, suitable to watch with family"
  },
  {
    "rating": "3.5/5",
    "review": "I like the first hour and forty minutes but then it just gets very gross."
  },
  {
    "rating": "0.5/5",
    "review": "Awful! Simply a compilation of all the grotesque blood & gore movies through the cinema history. A Razzy Award would be all it deserves. Spoiler alert! The final scene is reminiscent of the prom Scene from 1976’s Carrie. Nothing held this movie together. Pun intended."
  },
  {
    "rating": "4/5",
    "review": "It takes a lot for a movie to make me severely unsettled, but this one delivered in that way and in a good, remarkable way. What an idea for a modern-day horror movie! I was glued to my bed watching this. Sure there are some plot holes and nitpicks I have with certain things that don’t make any sense and that came across as annoying, but that doesn’t outweigh what went into making this movie and how it impacted me as I watched it. There can be a lot of social and cultural commentary that this movie inspires us to have, in fact it’s a good addition to the conversation we’ve been having for years. Beauty and fame vs authenticity and honesty. And it’s depressing since Demi Moore in this movie is already incredibly beautiful and still given crap for it towards the beginning! It made me frustrated but again, in kind of a good way and got me invested in this movie! By the end, it kind of feels like Carrie and the Thing combined, which was pretty neat. Well, there goes my bed time folks! That barely ever happens with me and horror anymore but I have to speak truthfully! What a work of art!"
  },
  {
    "rating": "5/5",
    "review": "good movie and very enjoyable"
  },
  {
    "rating": "1/5",
    "review": "Worst movie ever. Too bad I’ll never get those two hours of my life back."
  },
  {
    "rating": "1/5",
    "review": "We walked out………………."
  },
  {
    "rating": "0.5/5",
    "review": "Dumbest movie I have ever seen and I am 55 years old. 0 stars!"
  },
  {
    "rating": "5/5",
    "review": "Excellent story about body dysmorphia and self hatred."
  },
  {
    "rating": "1/5",
    "review": "Could have been a great movie. Kind of kept me in suspense/entertained for the first 2 hours but then the silly/stupid ending ruined the complete movie. Very disappointing 😞"
  },
  {
    "rating": "1/5",
    "review": "This should have been rated M and comedy/gore. I liked the idea of the plot, but in almost 2.5 hours the story went no where."
  },
  {
    "rating": "4/5",
    "review": "Previously on Severance: Hollywood... Mirrors are the worst! That was wildddddddd. This movie is insane. Like, so messed up on so many levels. And it’s messed up in a way that really sticks with you, like, deeply affecting. I can't stop thinking about it. It so viscerally nails how we rage against our bodies as a consequence of cultural programming and self-loathing. Body image brutality. The first half, I was like, \"Damn, this is pretty crazy,\" but I had *no* idea how much crazier it would get. I also really wasn't prepared for how horror it would turn out to be. So much gore. What the actual f-"
  },
  {
    "rating": "5/5",
    "review": "This film is really great! I love the storyline."
  },
  {
    "rating": "3.5/5",
    "review": "Maximum weirdness. Demi, Qualley, and Quaid were all great. Starts strong then kinda doesn’t go anywhere. Fun watch but not something you wanna watch with your parents"
  },
  {
    "rating": "0.5/5",
    "review": "filme ruim, só fala de coisa idiota. parece os maromba da academia!"
  },
  {
    "rating": "1.5/5",
    "review": "The Substance feels deeply problematic, particularly with its portrayal of self-improvement. The idea of striving for the 'best version' of oneself is undermined by the film's dystopian nature, making it feel both unrealistic and harmful. For vulnerable individuals, especially young girls, this film could potentially trigger psychological and eating disorders. The ending, in particular, was ridiculous and didn't do justice to the story's premise."
  },
  {
    "rating": "3/5",
    "review": "The first hour is excellent and tells an interesting story about women’s entire value being based on looking young, the film goes downhill as the gore increases and the last 30 minutes is almost unwatchable (as the excellent leads disappear). It drifts into “Bad Taste” territory without the humour of that Peter Jackson classic. The director made a brilliant short film 10 years ago (Reality+) which laid the ground work for lots of the aesthetic here. If this had been held to 90 minutes it would’ve been a classic."
  },
  {
    "rating": "5/5",
    "review": "A good movie, with an uncomplicated storyline that is easy to understand."
  },
  {
    "rating": "5/5",
    "review": "\"The Substance\" is a thought-provoking and visually striking film that offers a disturbing yet insightful commentary on the pursuit of youth and beauty. It is a film that is intended to make its audience uncomfortable, and to make them think about the society that we live in."
  },
  {
    "rating": "0.5/5",
    "review": "Most overrated film ever. Diabolically cringeworthy which is a shame for Qualley."
  },
  {
    "rating": "5/5",
    "review": "Nice and lovely movie"
  },
  {
    "rating": "5/5",
    "review": "Es genial y bastante gráfica y cruda"
  },
  {
    "rating": "3.5/5",
    "review": "Definitivamente é um filme perturbador. Excelente crítica à sociedade machista e etarista que trata as mulheres como \"coisas\". A cena do monstro é genial! Amei a referência ao clássico \" A Maldição de Carrie\". Não tem como sair sem náusea após as cenas de terror dessa sátira."
  },
  {
    "rating": "0.5/5",
    "review": "Seriously one of the worst movies I have ever seen. The acting was dumb too. I don't see how she got an award. I regret spending my money and time to watch this trash. Honest review"
  },
  {
    "rating": "4/5",
    "review": "I really liked this film. Definitely a horror movie and it was great to see Demi on the big screen again. She nailed this movie!"
  },
  {
    "rating": "0.5/5",
    "review": "I have no idea what I just watched, all I know is that it does not portray body consciousness well at all. As a woman, a mother, whos put weight on and aged like a peasant, seeing all these amazing looking ladies of a mature age and young did nothing but make me feel worse about myself!! How is this helpful?? They spend more time than necessary naked/boobs out, full frontal from Demi Moore who looks better than most people I know at 60 due to having a vast amount of wealth. Don't even get me started on the end part when excessive blood goes everywhere, like seriously as a fan of Eli Roth I was not impressed as it was just stupid. All in all I came out this film feeling depressed and unimpressed and how it managed to score so highly is beyond me. Never watching this again. Lastly there was about an hour of totally pointless scenes that were elongated for only the director knows why so this film ideally would have wasted an hour of my life instead of over two. Thanks for that. Worst film I've watched in 2025!! Thank God it is over."
  },
  {
    "rating": "5/5",
    "review": "The ending was absolutely exaggerated and the movie contains way too much gore, but outside of that it’s amazing. Demi Moore and Dennis Quaid gave a great performance, the movie has a good message, the score was great, and it’s honestly a crime that the academy didn’t nominate it for best sound."
  },
  {
    "rating": "1.5/5",
    "review": "This movie was fantastic until the end ruined it. They couldn't have thought of a better ending.... Or at least make it look better then what it did ? Everything up till the end was 100% then the end dropped it to -100%"
  },
  {
    "rating": "5/5",
    "review": "If anyone gives this under a 5 star they are insane. The substance was like, omg. I’ve never been left this speechless in my life."
  },
  {
    "rating": "3.5/5",
    "review": "Would definitely recommend it. I think it has something for everyone- love the gore and shock factor. Some humour to it. The body horror. The acting. The commentary it made on unequal beauty standards between men and women and women in the industry just being used as propped up sex dolls. Was a great watch"
  },
  {
    "rating": "0.5/5",
    "review": "This is the worst movie I’ve ever seen. I would like to emphasize that is the worst movie I’ve ever seen. I now hate Demi Moore and whoever directed this pointless ludicrous pointlessly grossly disgusting, cheesily sexually explicit, trash script, absolutely terrible movie. My son just said “someone needs to get fired for this. Maybe several people”. I agree. I think there is a totally fake marketing campaign pumping this movie. Demi Moore should be paying people to not watch it out of horrific embarrassment. So bad."
  },
  {
    "rating": "5/5",
    "review": "Demi Moore was outstanding in this movie. Just stunning for her age and what an ass. The movie was weirdly nastily gory. I didn’t know it was a comedy. I laughed so hard at the ending I nearly fell off the couch. Definitely going to be a classic cult film."
  },
  {
    "rating": "1/5",
    "review": "Not funny enough to be camp. Not interesting, clever, insightful, or scary in any way. Fails on every level. Desperately pathetic. I feel sorry for everyone involved - particularly the audience."
  },
  {
    "rating": "0.5/5",
    "review": "Derailed massively at the end and needed an edit of about 30 minutes."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible story line and acting"
  },
  {
    "rating": "1/5",
    "review": "Gets a bit boring after a while. Rather than wait through the gory ending, I walked."
  },
  {
    "rating": "1/5",
    "review": "Worst movie of the year. So stupid!"
  },
  {
    "rating": "5/5",
    "review": "*We discuss The Substance on Ep. 162 Here*. A modern The Picture of Dorian Gray, The Substance is a gnarly story about an aging star (literally, the movie begins with the creation of Elisabeth’s Sparkle’s (Demi Moore) Hollywood Boulevard star) and the deal she makes with a faceless company that sells a wonder drug known only as “The Substance”. Once started, you “birth” a younger version of yourself (but it doesn’t look like you) who lives there life for a week at a time. Every seven days, you must switch back. Ignoring this detail leads to disastrous results. Coralie Fargeat shoots the film with the intent to make you squirm. For example, we hear and get a close-up of every dunk into cocktail sauce and mastication of Harvey’s (Dennis Quaid) lunchtime shrimp — in this scene, he’s firing (without having the stones to really do so) Elisabeth for simply being too old. Harvey (I assume the name was intentional) endeavors to find the next hot thing. Elisabeth, after some gentle pushing from a young, handsome male nurse (Robin Greer), signs up for “The Substance”subscription. “Sue,” (Margaret Qualley) her new form, is young and tight and exactly what Harvey ordered. If they kept a statistic for “Most Shots of Butts in a Movie,” this would have to be #1. Set to an powerful and catchy industrial and EDM score by Raffertie, Sue lives the life of adoration, success, and hotness seven days at a time, until that no longer is enough. Humans will abuse anything. The product of this abuse results in practical effect concoctions I haven’t seen in a contemporary movie in… maybe ever. It doesn’t go from 0 to 100 right away, but a declension and decrepitude akin to stuff I’d expect in Society (77) or The Thing (91). The plot goes a little off the rails at the end, even if I understood the symbolism of Elisabeth’s actions. Fargeat deftly toes the line of “a movie with a message” and a movie to entertain (like all movies should). This is a must-see, if you can handle it."
  },
  {
    "rating": "5/5",
    "review": "You must see guys and amazing"
  },
  {
    "rating": "0.5/5",
    "review": "One of the dumbest films I’ve ever seen. The ending was god awful."
  },
  {
    "rating": "1/5",
    "review": "Turned into a soup of gore. An idea that went too far. Demi Moore needs to stop with the C grade movies."
  },
  {
    "rating": "5/5",
    "review": "recommended!! if you like gore movie"
  },
  {
    "rating": "4/5",
    "review": "Good performances but a bit wierd towards the end"
  },
  {
    "rating": "5/5",
    "review": "Film out of the box, sangat kerennn"
  },
  {
    "rating": "5/5",
    "review": "Started off strong then fell apart at the end. Was very weird."
  },
  {
    "rating": "5/5",
    "review": "Horror Movie Is The BESTTTT"
  },
  {
    "rating": "0.5/5",
    "review": "Unnecessary gore made this interesting idea for a movie plot just shy of repulsive. The director is clearly out of touch with what the audience wants. Avoid this movie. It’s utter garbage."
  },
  {
    "rating": "5/5",
    "review": "such a good movie and fun"
  },
  {
    "rating": "4/5",
    "review": "Honestly didn't know \"The Substance\" was a horror movie when I went to see it. Thought it was a flick about an actress with a Substance abuse issue. Well, technically I guess I was right! There's abuse of a substance alright! :D Kudos to Demi Moore for her wonderful portrayal of aging actress/fitness star Elizabeth Sparkle who thinks she's found a sort of fountain of youth after she is unceremoniously dumped by over-the-top network mogul \"Harvey,\" played with outrageous delight by Dennis Quaid (Life after Reagan???) I can only assume that this had to be the most rigorous, physically, mentally and emotionally demanding role of Moore's career. As Demi's younger \"alter ego,\" Margaret Qualley scores top marks for her performance as the beautiful, yet devious \"Sue.\" Director/screenwriter Coralie Fargeat's sci-fi thriller had me on the edge of my seat, squirming often during some highly disturbing scenes from suturing slit bodies to Dennis Quaid eating shrimp! (Disgusting! 🤮 ) Unfortunately, Fargeat overcooked the ending! :( Still, it's a fun, wild ride and if you like horror/sci-fi/thrillers, you'll enjoy \"The Substance!\" :)"
  },
  {
    "rating": "1/5",
    "review": "Started off strong then fell apart at the end. Was very weird."
  },
  {
    "rating": "1/5",
    "review": "Demi Moore is an awesome actress. The storyline was awful. Way too much blood and gore for us."
  },
  {
    "rating": "4.5/5",
    "review": "Muito bom! Filme 🍿 empolgante e divertido! Atuação 🎬 belíssima! Roteiro bom, nota 9.2"
  },
  {
    "rating": "5/5",
    "review": "The best movie of this decade so far! It is gut wrenching, thought provoking, funny and grossly entertaining! This is Demi's finest work ever, fearless and beautiful!"
  },
  {
    "rating": "3/5",
    "review": "The movie is very campy and stylistic in a way that horror fans will admire, but the ending takes a sharp turn for the bad. Overall, the story was fairly predictable--I was hoping for a twist ending that never came. But the acting and cinematography were well done and the movie certainly wasn't boring."
  },
  {
    "rating": "4.5/5",
    "review": "After watching The Substance, I was both captivated and unsettled by its audacious storytelling and intense visuals. Directed by Coralie Fargeat, this body-horror film delves into the extremes of beauty standards and the relentless pursuit of youth in Hollywood. Demi Moore delivers a fearless performance as Elisabeth Sparkle, a 50-year-old actress desperate to reclaim her fading stardom. Her portrayal is both raw and compelling, capturing the vulnerability and determination of a woman battling societal pressures. Margaret Qualley complements Moore's intensity, adding depth to the narrative with her nuanced acting. The film's visual style is striking, with Fargeat employing bold cinematography and unsettling imagery to create a visceral experience. The narrative is unapologetically direct, confronting the audience with the grotesque realities of cosmetic obsession. While some scenes are graphically intense, they serve to underscore the film's critique of the entertainment industry's fixation on youth and beauty. The Substance is not for the faint-hearted, but it offers a thought-provoking commentary on the lengths to which individuals will go to preserve their image. It's a daring piece of cinema that challenges conventional norms and leaves a lasting impression."
  },
  {
    "rating": "3/5",
    "review": "The first half of the movie is sleek, stylish, and intriguing but like Thanos, with a snap of an old gnarled finger it 180s at break-neck speed into a cheap and campy gorefest that had me rolling my eyes at how preposterous it becomes. Demi Moore is fine I guess, but Margaret Qualley is deliciously vile"
  },
  {
    "rating": "0.5/5",
    "review": "I love movies. I like Demi Moore. Hollywood must owe her something because of the awards this is garnering, but I am sorry. This is the worst movie I have seen in years. Makes as much sense as Clockwork Orange. I don't typically expound on negatives, but how this can have 85% positive reviews I guess shows my disconnect between today's Hollywood. Sorry. Do not watch. Run!"
  },
  {
    "rating": "3.5/5",
    "review": "It's a good surrealist film, with good performances and bizarre but well-made scenes."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute rubbish - no substance! Waste of tine bothering to watch this film, degrades women!"
  },
  {
    "rating": "2.5/5",
    "review": "Okay. This one goes all the way. It's very stylish, surreal, gory and provocative. Over-the-top doesn't even go there. Dennis Quaid is brilliant as the asshole mouthed producer. Too long probably, but if you can stomach it, you'll never see anything quite like it in a major motion picture."
  },
  {
    "rating": "4/5",
    "review": "Definitely different. I don't need to watch it again, but definitely worth the watch. I'm struggling between 3.5 and 4.0, but it kept interest and it was different."
  },
  {
    "rating": "2/5",
    "review": "Come on people. This is a simple idea that is beat to death. It is 40 minutes too long and the last part is so unnecessary. It is a movie for people who want to be grossed out but that's not me."
  },
  {
    "rating": "5/5",
    "review": "Wow! What a trip. Best practical effects i have seen in a horror movie for many many years. I love this movie and how it is provoking and unpredictable."
  },
  {
    "rating": "1/5",
    "review": "it is horrible. I was turning my head away from the screen the entire evening. Too many needles in the back and very violent/gory. I do not understand why Demi Moore is getting so many accolades. She was in a coma like state a lot."
  },
  {
    "rating": "0.5/5",
    "review": "I think this might be the worst movie I have ever seen. EVER. And I have seen Plan 9 from Outer Space and Robotman, voted the worst movies ever made. The Substance. DO NOT DO IT. Appalling, boring, derivative, nonhorror horror film. I have no idea how Demi Moore could win a Golden Globe for this piece of utter trash. Must have been given the sympathy vote for so much ageing makeup, nudity and prosthetics. So stupid I almost laughed. But it wasn't even that good."
  },
  {
    "rating": "0.5/5",
    "review": "Was terrible, horrible acting...worst ending ever. What a waste of time!"
  },
  {
    "rating": "4/5",
    "review": "What a surprise! This film was a bit mind-blowing and that's a good thing. Of course, tons of nudity which I didn't expect or enjoy, but every man's dream. Demi was fantastic and I've never been a huge fan. Hope she wins the Oscar."
  },
  {
    "rating": "5/5",
    "review": "De las mejores body-horror que he visto"
  },
  {
    "rating": "5/5",
    "review": "Dude. The Substance is an absolutely insane movie, but it's awesome. It has an incredible and original story with flawless execution and terrific production and sound design. Has to be one of the best movies of 2024 for me. I loved this movie. THE SUBSTANCE. IT CHANGED MY LIFE."
  },
  {
    "rating": "2.5/5",
    "review": "While the premise of a declining celebrity using a substance to rejuvenate is intriguing, the execution may be seen as overly stylized and lacking in narrative depth. The exaggerated aesthetics and focus on body horror can alienate viewers who seek a more substantial plot and well-developed characters. Additionally, the attempt to address complex themes such as the obsession with youth and beauty standards may come across as superficial and forced. In summary, \"The Substance\" may be visually striking, but it fails to deliver a truly memorable cinematic experience."
  },
  {
    "rating": "5/5",
    "review": "Very interesting topic Demi was really good but a bit too bloody n didnt need to be"
  },
  {
    "rating": "5/5",
    "review": "If you can take the uncomfortable gore, you will appreciate the genius of the plot and Demi Moore's most wonderful performance. The entire film is delightfully crafted with a nod to many sci-fi movies. My own sense of humor found me laughing at the brilliant ending."
  },
  {
    "rating": "2.5/5",
    "review": "I watched The Substance yesterday, and while I was intrigued by the concept, I found the execution somewhat lacking. The film felt overly long, with several scenes that seemed unnecessary and dragged down the pacing. While the visuals and atmosphere had potential, the storytelling didn’t hold my attention as much as I had hoped. Some moments felt drawn out without adding much to the narrative, making the film feel slower than it needed to be. There were interesting ideas at play, but the overall experience left me feeling a bit underwhelmed. If you enjoy slow-burn films with a strong artistic vision, The Substance might be worth a watch—but for me, it didn’t quite hit the mark."
  },
  {
    "rating": "3.5/5",
    "review": "Three acts. Three horror genres. All in one film."
  },
  {
    "rating": "5/5",
    "review": "An original grotesque but brilliant movie! It really sends a message that age is just a number and no one should be judged by that. Demi gives the performance of her career and is finally getting the recognition she deserves. Margaret proves she's a future star. Coralie provides great direction and screenplay. I've never left the cinema feeling sickened but also amazed by what I just witnessed. We need more risk taking stories like this in cinema going forward. Never seen anything like it. Bravo to Coralie, Demi & Margaret!"
  },
  {
    "rating": "0.5/5",
    "review": "This was by far the worst movie i have ever seen it was disgusting and predictable. Awful and grotesque sound effects. I made an entire account just to come warn the public. If I prevent one person from watching this movie i will feel as though I’ve done the world a service. I beg of you not to waste your precious life with 2+ hours of such an awful attempt at entertainment"
  },
  {
    "rating": "2.5/5",
    "review": "A bit of a challenge to watch to the end. Weird movies needs to be your think to enjoy this."
  },
  {
    "rating": "3.5/5",
    "review": "**Review: *The Substance* – 3.5/5 Stars** *The Substance* is a wild, body-horror ride that’s as slick as it is unsettling. Margaret Qualley is absolutely magnetic—you can’t take your eyes off her, and honestly, why would you want to? The plot is fresh, bold, and taps into that horror-sci-fi sweet spot with some killer social commentary on Hollywood’s obsession with youth. The special effects? Insane. It nails that grotesque-yet-gorgeous vibe, and the aesthetic is pure perfection. Some of the camera work and editing are so sharp, they practically cut through the screen. It’s wildly entertaining, the kind of film that makes time evaporate. But while it delivers the thrills and a fresh take on body horror, it could’ve used a bit more depth to really hit hard. Still, it’s easy to see why it’s hyped—if you love horror that’s daring and different, this is your jam. It’s freaky, it’s fun, and it sticks with you."
  },
  {
    "rating": "4.5/5",
    "review": "Not sure what all the hubbub is. If David Cronenberg was still making interesting and different films, this would be it. Go watch his version of \"The Fly\". If you can stomach that, you'll survive \"The Substance\". \"The Substance\" kept my attention, laugh a few times, and am glad Demi Moore took on a risky role. I come from the \"Jazzercise\" era, so it was easy to identify with Elisabeth and Sue. Bring on the Accelerator."
  },
  {
    "rating": "2/5",
    "review": "It started off interesting enough. It was all downhill from there. Demi Moore was nominated for an Oscar so thought it would be decent. I had to run and watch GI Jane to get that bad taste out of my mouth. Dennis Quaid is such a good actor, he made his sleezy character authentic. He should have turned this movie down. This should have been a 1980 USA Network up all night film."
  },
  {
    "rating": "3.5/5",
    "review": "A movie that’s intended to be offensive, over the top and unapologetic for its portrayal of a very real inner struggle that many experience. It plays with heavy, personal topics and instead of hiding behind euphemisms, it intentionally shocks and disgusts the viewer by confronting these topics head-on in graphic, gruesome detail. This movie tells a story that’s been told before, but screams at the viewer to take it more seriously, and really question the underlying issues of having a perfect image, romanticizing youth above all else, and the shelf life of talent that the masses no longer find attractive. For all that this movie has to say, there feels like a focus issue at the end of the day. In criticizing the overt sexualization of young beauty, I left wondering if this movie is a critique or turning the volume up louder. At some point the nudity stops feeling intimate, and starts feeling like a way to keep the viewer engaged. Overall I did very much enjoy this movie, and what it had to say. It’s uncomfortable. It’s visually loud and intended to disgust. It is well done in many respects from visual effects to set design and anxiety-ridden editing. Unfortunately, the ending takes a powerful and visceral story, and doubles down on shock value and gore rather than the human struggle that it symbolizes . It feels as though the director handed the last 15 minutes off to a different director and didn’t bother to watch it. It’s an important movie that’s got a lot to say, but it should keep some of those things to itself."
  },
  {
    "rating": "5/5",
    "review": "This film thrilled me so much! I saw Gilles Deleuze’s philosophical imagery in it. The way it develops images of gaps and folds is absolutely brilliant. I covered some aspects of its direction in a Korean YouTube video, but since it's not in English, I don’t think I can share it here. If you're interested, I recommend searching for it in Korean and focusing on the visuals. I hope more people can appreciate the beauty of this film. A hole is a circle through which other things can pass. In the film, eyes, cameras, shower hoses, and pipes serve as these holes. The movement of substances related to the hole forms lines. The flow of water, the movement of light, the actors’ motions, and even blood traveling through a tube all represent line imagery. https://youtu.be/epLf5tv5prw?si=7W_81TodiFfjhsPE"
  },
  {
    "rating": "5/5",
    "review": "Brilliantly capturing the ugly side of the system, which ever system that may be, it's up to you, by using intentionally on-the-nose & on-screen 'sarcasm'. This movie is nihilistic, Kafkaesque, disgusting, offensive, and does not hold back. Anybody who can't handle that (and there's quite a few, probably raised by Disney) gave it a low score."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I’ve ever seen, no contest. I kept hoping this would get better, but instead it just got worse and worse. I cannot comprehend on any level how this was nominated for best picture. Just horrifyingly bad."
  },
  {
    "rating": "1.5/5",
    "review": "I am a science fiction and horror lover, but I couldn't wait for this film to be over. The things I remember most are lots of butt shots and too too much blood splashed all over on and on. And an unsatisfying ending."
  },
  {
    "rating": "1/5",
    "review": "If Siskel and Ebert were alive and reviewed this movie, it would never have been up for any Academy Awards, except for special effects. Definitely not for acting. I sincerely doubt either Siskel or Ebert would have sat through the whole movie. The theater should have paid us to sit through this mess. Deplorable. Not entertaining."
  },
  {
    "rating": "5/5",
    "review": "Loved every goofy gory minute of it. Take the family, run don’t walk"
  },
  {
    "rating": "2.5/5",
    "review": "The Fountain of Youth premise is undoubtedly relatable to many, including myself as most of us like looking \"young.\" While I knew it was a B movie, I had to give a C. The blood and gore were extreme and senseless reminding me of those cheap horror movies of the 1950s, which, admittedly, I enjoyed (as a kid). Demi did a good job acting the part, but her role is not deserving of an award."
  },
  {
    "rating": "0.5/5",
    "review": "Just not good at all. Definitely made by a freak in more ways than one. Don’t understand the hype"
  },
  {
    "rating": "4.5/5",
    "review": "The Substance. I really regret not watching this sooner. After missing its theater run, I kept checking streaming services almost every weekend, hoping it would finally be available. I was even tempted to rent it on Apple or Google a few times. While waiting, I tried my best to avoid spoilers and memes, which was no easy task. Unfortunately, I still stumbled across a few grotesque memes and got some hints about the film’s intensity. But even with those glimpses, nothing could have truly prepared me for the experience of finally watching it. \"The Substance,\" directed by Coralie Fargeat, is a bold and visceral exploration of vanity, obsession, and societal pressures, delivered in a way that is both captivating and deeply unsettling. Balancing horror with sharp social commentary, the film evokes a complex mix of fascination and discomfort, leaving audiences caught in a love-hate relationship that lingers, alongside with the search for the meaning in the film. Themes such as body dysmorphia, substance abuse alongside others are all littered throughout the screenplay make it enigmatic and engaging to watch. The film felt like a blend of David Cronenberg’s body horror and Michael Crichton’s sci-fi intrigue, with the practical effects reminiscent of Alien. The first half delivers a gripping, powerful story, pulling the audience into its unsettling world. Visually striking, the film boasts meticulous set designs akin to Stanley Kubrick, top-tier sound and editing, and an Academy-worthy performance by Demi Moore. It seamlessly shifts between the sleazy underbelly of Hollywood show business and a nightmarish, hallucinatory descent into dark, surreal passages beyond the studio walls. I’ve seen my fair share of disturbing films, but this one pushed me to an entirely new level. If you struggle with anxiety, consider yourself warned—this is not an easy watch. That said, I have to applaud the cast for their fearless performances and the director and crew for crafting such an intense, immersive experience. The film felt like a chaotic symphony of psychological torment, reminiscent of A Clockwork Orange, all while I sat frozen in my comfortable living room. The film’s visuals are absolutely stunning, with striking color contrasts that make every frame feel meticulously crafted. These contrasts, seamlessly woven throughout the scenes, elevate the film’s aesthetic, balancing artistry with unease. The cinematography amplifies this discomfort, using clever framing and movement that keep you on edge, while the haunting score sustains an atmosphere of dread from start to finish. Each scene is expertly constructed, with impressive attention to detail, ensuring the film remains immersive and visually captivating. The style is exceptionally aesthetic, operating more like a carefully curated paint palette than a traditional work of art—vibrant and pleasing yet strangely clinical, devoid of soulful substance, which adds layers to the experience. In this regard, the film is both impressive and notable. The cinematography and editing immediately place it on a level with the works of the great directors and auteurs, including those no longer with us, leaving a lasting imprint on the viewer. The final act is an entirely different beast, taking a wild, unexpected turn that pushes the film into even more unhinged territory. Without spoiling anything, it goes far beyond what I anticipated. While I can see some viewers criticizing this descent into madness, I personally appreciated it—it’s what elevates the film to potential cult status. My only critique is the runtime; parts of the final act could have been trimmed without losing impact. That said, the full spiral was necessary to deliver the shock value that makes the film so unforgettable. In the end, The Substance is an unforgettable cinematic experience—one that lingers long after the film is finished. I couldn’t fall asleep after watching it—not out of fear, but because its themes, visuals, and message kept replaying in my mind. Coralie Fargeat has crafted a film that is as thought-provoking as it is unsettling, seamlessly blending body horror, sci-fi, and sharp social commentary into something truly unique. While its descent into madness may not be for everyone, I found it to be a bold, thrilling choice that cements its potential cult status. Despite minor pacing issues, the film’s stunning visuals, gripping performances, and unrelenting atmosphere make it a must-watch for those who can handle its intensity. I only wish I had seen it sooner. 9/10"
  },
  {
    "rating": "5/5",
    "review": "WTF did I just watch??? It's a great allegory for a piece of our culture that hides dirt under a thin veneer of beauty."
  },
  {
    "rating": "1/5",
    "review": "B movie with a star Should never be on Oscars nominations"
  },
  {
    "rating": "0.5/5",
    "review": "Very mediocre movie. Demi more has no talent"
  },
  {
    "rating": "0.5/5",
    "review": "shallow and completely besides the current zeitgeist. i thought the ending was kinda funny, but i didn‘t even think the performances or makeup/cgi effects were that good for what it‘s worth. the message seemed so obvious and boring, and it seems to get praised as being sort of „feminist“? also, very predictable plot, and the „body horror“ seemed to just boil down to „old people are ugly“. idk, don‘t get the hype. was it because margaret qualley and demi moore are both incredibly hot and naked in the film?"
  },
  {
    "rating": "0.5/5",
    "review": "What an absolute waste of time... I knew two people who were in this movie and I'm shocked that this has actually been made.... I understand the movie, but everything about it was just terrible and that's including the acting. I never write reviews on anything, but this, wow. Don't even bother wasting your time. Just wow.... To the two actors I do know, I'm not sure what's been going on but yous must have gone downhill pretty bad to have played any role in this movie.."
  },
  {
    "rating": "0.5/5",
    "review": "I’m shocked at all the positive reviews on this movie. It is, without a doubt, one of the worst movies I have seen in the last 2pm years. Just terrible. I can’t believe Demi Moore put her name to this. 2hrs I’ll never get back."
  },
  {
    "rating": "0.5/5",
    "review": "If I could give it a zero I would. Gross and a waste of time."
  },
  {
    "rating": "2.5/5",
    "review": "Eh, not that good. Not sure what the hype is about."
  },
  {
    "rating": "3/5",
    "review": "We couldn't turn it off but I expected more at the end. For me the closing ruined the whole movie. Sadly."
  },
  {
    "rating": "4/5",
    "review": "Missed this the first time around so was grateful for the opportunity to see it on the big screen following all the Oscars attention. Wasn’t sure what to expect and so even though the main storyline was known to me, the film was able to surprise and entertain throughout. This film may not be for all and at least one couple found it too much and left half way through. Demi Moore definitely deserves the praise heaped on her as do Dennis Quaid and Margaret Qualley. The ending has to be seen to be believed and had me laughing for a good reason. Will be interesting to see how it fairs at the Oscars®️ next month."
  },
  {
    "rating": "4/5",
    "review": "I think its a really good body horror film, It's like a brutal, exaggerated metaphor for modern beauty standards and society’s obsession with youth and perfection. It highlights the extreme lengths people go to in order to meet unrealistic expectations. It's definitely not for everyone because it has some disgusting scenes but I recommend it"
  },
  {
    "rating": "4.5/5",
    "review": "Straight up excellent. Everyone does such a great job breathing life into their characters. If this doesn't win best picture out of those nominated, it should easily win for sound editing. Also, by far the best Dennis Quaid role of his career. Imagine what Toxic Avenger could be with the right budget and a studio that stays out of the art."
  },
  {
    "rating": "5/5",
    "review": "Ok… this is a must-watch, even if you’re not into the genre. It’s so well-cast and packed with twists and turns. This film takes you to places you don’t want to go, but once you make it through, you feel better for having made it back to reality."
  },
  {
    "rating": "1/5",
    "review": "Absolutely the most horrible and disgusting movie Ive ever seen. How desperate was Demi to do this?!? Just awful!"
  },
  {
    "rating": "4/5",
    "review": "An instant classic. The film boldly embraces nudity and gross elements to depict the primal appetites of human nature, juxtaposed with the conscious struggles of greed, arrogance and aging. Its shallow, selfish characters are a testament to this dichotomy, adding depth to a well mixed suspenseful horror story. The narrative seems meticulously crafted to cater to the audience's desires and curiosity of the organically madness evolving, interesting enough to happily ignore the multiple plot holes and a delightfully insane finale that definitely will leave a lasting impression, \"The Substance\" masterfully intertwines grotesque elements with a compelling story, making it a must-watch for horror fans."
  },
  {
    "rating": "4/5",
    "review": "Really surprised on how much I enjoyed this! I don’t really like Horror movies all that much but this one, really surprised me. I like how perfectly normal it starts out with this Substance cure that can make you more beautiful but then, it takes a turn and makes you feel more and more weird and that’s what I like about it! Demi Moore is really amazing in this! Hope she wins Best Actress but I could be wrong. One of my favorite Horror films just not as good as Jordan Peeles “Nope” (Edit: Okay so the Oscars happened and she did lose and that does make me sad a little bit so yeah, this review didn’t age well. lol)"
  },
  {
    "rating": "0.5/5",
    "review": "This was probably the worst movie I have ever seen. I honestly cant think of any other movie i have seen that is this terrible. The ending was so bad it was comical."
  },
  {
    "rating": "3.5/5",
    "review": "Solid film. Demi Moore plays a woman who is fired from an aerobics show she runs and vows to become young again, so she injects herself with a medicine to make her youthful again. This film is definitely bizarre, however the creativity, visual effects, and production design are some of the best of the year. The movie could have flowed better though, needed a bit of a better “logical” plot, but overall very unique and creative."
  },
  {
    "rating": "4/5",
    "review": "The Substance is a small movie with a big punch. This is a truly unique moviegoing experience. The story of an aging female fitness star confronting her shelf life in a superficial world that measures woman based on shallow criteria is stunning. The movie is among the most visually memorable and disturbing films since Jeff Goldblum planed \"The Fly\". The acting by Demi Moore, Margaret Qualley, and Dennis Quaid are terrific. No wonder this film has gotten so much buzz. It is genre bending as I have heard it referred to as anything from a Comedy to a Drama to a Horror film. It is all of those things and more. Great Storytelling. Great script. Great Direction. Great Cinematography."
  },
  {
    "rating": "0.5/5",
    "review": "Top 5 of the worst movies I have ever watched. Demi Moore’s performance is nothing more than ok, not worthy of any nomination for any award whatsoever. The film is pretentious until it becomes swanky and it seems to me quite clear that in the end no one really had the slightest idea of how to end it and so decided to make the most bizarre finale possible."
  },
  {
    "rating": "2/5",
    "review": "The first hour is compelling- Demi Moore is brilliant, costumes and dialogue sparkle....then it starts to slide into Hollywood ridiculous. The plot becomes unfathomable and a gore-fest starts without reason. I lost any interest in the last 30 minutes. So much potential wasted with shock and awe taking over from character and depth."
  },
  {
    "rating": "4/5",
    "review": "The Substance is some kind of movie, that is for sure. Definitely not for the squeamish and those who can't tolerate good dosings of body horror. Demi Moore and Margaret Qualley are the backbone of this movie, there is no doubt, and they deliver stunning performances. Probably 20 - 30 minutes too long, and the last 15 minutes covering the evening premiere (which has to be seen to be believed) was probably not really necessary... except for the very final minute which appropriately ended the movie."
  },
  {
    "rating": "4.5/5",
    "review": "This film is wonderful in every aspect. As a person who experiences needle and intense gore agony, I took half a star off for this. If it weren't for me, I'd give it 5 stars. Social criticism in film form won't come close to this one. Demi Moore and Margaret Qualley are in an era I can't even explain how much their acting means to the story. This is surely a glorious movie."
  },
  {
    "rating": "2.5/5",
    "review": "First part was ok, second... to much ugly."
  },
  {
    "rating": "4.5/5",
    "review": "eu amei o filme, minha nota 9.2 que produção maravilhosa !"
  },
  {
    "rating": "4/5",
    "review": "Pretty creative and compelling story! Cut off the last 20 minutes, and it’s a great watch."
  },
  {
    "rating": "5/5",
    "review": "Masterful, twisted, sick, depraved, disturbing and utterly disgusting. Cancel the Academy Awards, give Demi Moore all the Oscars and let’s call it a day. That’s all."
  },
  {
    "rating": "3.5/5",
    "review": "Excellent. IF you can suspend disbelief and tolerate many plot short cuts and sparse world building. Trade offs for low-mid budget films Also a bit heavy handed with “The Message”, especially near the end, by which time we definitely had already “gotten it “."
  },
  {
    "rating": "0.5/5",
    "review": "Great scene shooting and unique story… up until the end. This movie is straight up garbage. I have no clue how anything could be nominated from this piece of crap."
  },
  {
    "rating": "0.5/5",
    "review": "I truly cannot believe Moore and Quaid have sunken to these depths. Sad."
  },
  {
    "rating": "1.5/5",
    "review": "The Substance starts with some interesting visual & plot ideas, and the body-horror effects are rather well done. But most of the film is a bit boring and full of adolescent clichés. A lot of the dialogue and acting is downright amateurish. (The title may refer to the maker's daily intake)"
  },
  {
    "rating": "2/5",
    "review": "Starts out very promising that takes a sharp left into the totally ridiculous. Demi Moore is fine but she's hardly in the movie so I don't get all the attention she's getting."
  },
  {
    "rating": "5/5",
    "review": "Refreshingly different. Demi Moore should be seriously be considered a front runner for an Oscar."
  },
  {
    "rating": "5/5",
    "review": "Any movie that takes down the absurd standards of female beauty gets an A+. Demi Moore deserves to win best actress. The movie deserves to win best picture. I hope this film offends the masses."
  },
  {
    "rating": "4/5",
    "review": "Very bold. Few moments that don’t give the audience much credit"
  },
  {
    "rating": "0.5/5",
    "review": "The premise of this film is intriguing and very true to our terribly ageist society. Sadly, the writing takes it into a grotesque and unnecessarily brutal and graphic horror realm. That is a complete turn off. Good writing might have shown the superb acting of Demi Moore, but instead it made it laughable. The characters are reminded repeatedly that they are truly only one, but neither the older woman nor the younger woman seem to have any compassion for the other, and the younger woman’s rage at the end is inexplicable. I am at a complete loss to understand why this film would receive any nods from the Academy of Motion Pictures, certainly not best picture!"
  },
  {
    "rating": "3.5/5",
    "review": "I understand why the reviews are split. If I were you as a first time watcher, I would turn it off - right after Sue walks away from Dennis Quaid’s character & follows the dancers with the producers. It was almost a masterpiece. It butchered what could have been a fantastic ending. The cinematography was wonderful until that point."
  },
  {
    "rating": "5/5",
    "review": "i need this to win best makeup effects"
  },
  {
    "rating": "0.5/5",
    "review": "Way to bizarre. Actually can't believe that Demi would stoop to this level. Weird."
  },
  {
    "rating": "4/5",
    "review": "This horror film presents a deeply personal narrative centered around Demi Moore. While she delivers a strong performance, it sometimes feels like a desperate attempt to redefine herself as a \"popcorn actress.\" Margaret Qualley provides crucial support throughout the film, often carrying key moments. However, the last 20 minutes felt unnecessary and overly horrific. I expected the ending to reveal that the events were merely imagined—flashes in her mind before she decided to take the substance. Ending it this way would have made her character more powerful, showing that she ultimately chose to love herself rather than succumb to the temptation of escape. This would have added a more profound and impactful conclusion to her journey."
  },
  {
    "rating": "1/5",
    "review": "I don't know what to say really, like... wth did I just watch? It could have ended with the appearance of the mangled creature that used to be Elizabeth, but for some weird reason it just kept going and going and getting worse and worse."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely stupid. 80s effects should have ended 40 years ago"
  },
  {
    "rating": "1/5",
    "review": "Has to be one of the worst movies I've watched. Absolutely pointless rubbish."
  },
  {
    "rating": "3.5/5",
    "review": "I really wanted to like this movie but idk what they were thinking with all the zooming into booty the entire time I think it has a lot of unnecessary nudity but oh well great concept and interesting ending"
  },
  {
    "rating": "4/5",
    "review": "Fun head trip with great acting."
  },
  {
    "rating": "3/5",
    "review": "The story starts off well, but the movie ends up falling apart 20 minutes from the end, where it is perceived that the plot is too forced and silly, that it even ends up being laughable and asking for it to end, it is incredible that they could have written such a bad ending."
  },
  {
    "rating": "0.5/5",
    "review": "Too much gore, too much nudity. It ranked up there with the worst move we have seen. Movies are just not entertaining anymore."
  },
  {
    "rating": "3/5",
    "review": "One very long (about a hour too much) Tales from the Crypt episode. It was ok, but kind of regret paying to watch."
  },
  {
    "rating": "3.5/5",
    "review": "Take out the last 20 minutes and you got a decent movie. \"I got a big hammer\""
  },
  {
    "rating": "3/5",
    "review": "El retrato de Dorian Grey se encuentra con el SciFi de terror, en esta cinta en que la protagonista sacrifica mucho más de lo que piensa que tendría que sacrificar para lograr \"permanecer joven por siempre\". Escalofriante y aterradora, por lo real que pudiera ser, cuando menos en cuanto a la aspiración de nunca envejecer para tantas y tantas, banales, personas en el mundo."
  },
  {
    "rating": "3/5",
    "review": "This movie is objectively a great movie. Beautifully shot, great message, creative. But I found it truly hard to watch - so be warned - only watch if good with gory body horror"
  },
  {
    "rating": "0.5/5",
    "review": "movie is horrible.... very horrible. nothing in the movie is real everything from start to finish is fake, not sure why this is even being considered a good movie. this movie should get negative stars."
  },
  {
    "rating": "5/5",
    "review": "This is by far Demi Moore's best performance yet! Can't wait to see her on future projects. Margaret also really did a really great performance as Sue. The storyline is just superb. I love how the movie touches on social issues that were impacted by mostly women in the industry. Also, the practical effects were amazing. As a body horror fan, it was *chef's kiss*!"
  },
  {
    "rating": "1/5",
    "review": "Worst movie I have ever watched !! I cannot believe anyone would think this movie is good. Demi Moore must have been desperate to even read this script. This movie is pure garbage !! I wouldn’t even give it 1 star"
  },
  {
    "rating": "3.5/5",
    "review": "This is not easy to watch. It's a film about the horrific lengths an aging actress goes to be young again. It is disturbing and gross, but Demi Moore is really good in this movie."
  },
  {
    "rating": "1/5",
    "review": "Not especially clever “Portrait of Dorian Gray” re-telling. Maybe I’m just less a fan of breasts than other reviewers"
  },
  {
    "rating": "4.5/5",
    "review": "At first I thought it was just a normal movie just for fun to watch, until it became a competing for 5 Oscars. I must say that everything in the story was very impressive, whether it was the mocking or satire of people's thoughts, the characters' expressions, facial expressions, giving a hidden thoughts, design of the scenes that parodies from other movies to fit the mood in many parts, the use of very little CG so there were only handmade props that looked very realistic. Coupled with the thought-provoking rhythm of the story and the relatively new content that no one else had done, it turned out to be a fairly good work. However, it feel a bit rushed at the end part and the ending was a bit weird."
  },
  {
    "rating": "4/5",
    "review": "Really liked it. Can see the obvious influences of 80's John Carpenter and 90's David Cronenberg. Think movies like Carpenter's The Thing and Cronenberg's Existenz, and you get the special effects and overall tone of this movie. Also reminded me of the 1980's classic, The Re-Animator, right down to the glowing green fluids being injected with huge needles. Add a sprinkle of Monty Python style food gross outs. Huge squirm factor. Good stuff!"
  },
  {
    "rating": "2/5",
    "review": "What started off as a promising film, reminiscent of the plot of Death Becomes Her, fell apart. It nosedived spectacularly into a plotless string of increasingly more implausible scenes. I can only imagine the writers quit half way through and someone’s children were given access to the special effects. This ushers in 30 minutes of madness that results in my favourite part: the end. Save yourself the time and stop watching halfway through and imagine the rest."
  },
  {
    "rating": "5/5",
    "review": "i don't understand what all the bad reviews are on about. i don't even like body horror usually, and i still loved it. this movie was hilarious and heartbreaking, and demi moore is a baddie"
  },
  {
    "rating": "3/5",
    "review": "Entertaining and great performances and cinematography, but too many plot holes and confusing dream sequences for me."
  },
  {
    "rating": "4/5",
    "review": "It's a fun movie, but you need to turn on your suspension of disbelief."
  },
  {
    "rating": "1/5",
    "review": "The premise is intriguing and I was willing to suspend disbelief for about 2/3 of the movie. The cinematography was interesting as well. But that last 1/3 was just stupid and ruined any chance that I could like this movie."
  },
  {
    "rating": "5/5",
    "review": "A great horror film about beauty and what it means to age as a woman."
  },
  {
    "rating": "0.5/5",
    "review": "The fact that this movie has such high ratings on both rotten tomato and metacritic truly makes me have no trust in those ratings for any movie. This movie was a comical disaster to say the least. The two female roles were played well, Ill give it that. Interesting concept overall. Last 20 minutes of the movie they either didn't care or let some 6 year old boy write it. It turns into a mixture of old school alien horror with \"Carrie\" the movie type blood. 3.5 out of 5 is generous until the final 20 minutes then its laughably brought to a 0 for me. Dont waste your time. Dont be fooled by what i can only assume are paid or fake reviews"
  },
  {
    "rating": "4/5",
    "review": "Daring and visually stunning, The Substance comes at you with fierce audacity, but the underlying thread is a bit too didactic and formulaic to really let it fly."
  },
  {
    "rating": "4/5",
    "review": "I recommend if u have a quirky sense of humour and a strong stomach. Demi is great!"
  },
  {
    "rating": "0.5/5",
    "review": "The worst movie I have ever seen in my entire life. The beginning has a lot of unnecessary nudity, but it was still interesting and maybe a little different from what I had seen before. However, from the middle to the end, it became horrible, impossible to watch too many gore scenes and crazy stuff. Anyone who liked this movie must be insane. The actresses are great, but the director is terrible, and the plot is awful. I lost 2 hours of my life and my sanity. THE WORST MOVIE I HAVE EVER WATCHED IN MY ENTIRE LIFE (AND I WATCHED SHARKNADO)."
  },
  {
    "rating": "0.5/5",
    "review": "I finally found the worst movie of all times. Congratulations"
  },
  {
    "rating": "2.5/5",
    "review": "I really enjoyed about 85% of The Substance. It was heartbreaking to watch Elisabeth, still absolutely stunningly beautiful, look at herself and see ugliness. It was infuriating to watch Harvey treat her so dismissively in his gluttonous, slimy way. Demi Moore was fantastic, authentic, sincere, relatable. Dennis Quaid was perfectly despicable. He really gave off Coriolanus Snow vibes from The Hunger Games. And Margaret Qualley was wonderful as the perfect beauty queen everyone wants to see while also harboring a dark, sadistic side. There is a bit of nudity, but for once it wasn't gratuitous. There was a purpose. They could have scaled some of it back, but it explicitly showed the real 50 year old body of Elisabeth versus the nearly unrealistically flawless body by comparison in Sue. The horror movie aspect was truly disturbing. From the creation of Sue to the deterioration of Elisabeth. It was realistically detailed from both up close and from a distance intentionally making the audience squirm to witness the unimaginable lengths one would go through to maintain beauty and admiration. And then Sue tried to use The Substance. And the monster, well, that's when they lost me. While the whole movie is based around in implausible premise, they went about it in a hyper realistic way. Except the monster at the end. It had all the realism of a monster blob out of a bad 80s horror movie. Or an 80s comedy even. I was reminded of Pizza the Hut from Space Balls or the monster that the bully brother was turned into in Weird Science. It turned an otherwise entertaining modern horror movie into a sad joke. It wasn't scary. It wasn't disgusting. It was disappointing and really ruined the entire end of the potentially more-than-decent movie. I originally gave The Substance a 3.5 Star Prediction. For about 85% of the movie, it was at about a 4. The last bit completely wiped all that out resulting in another disappointing 2.5 Stars for another Oscar Nominated Best Picture movie."
  },
  {
    "rating": "3.5/5",
    "review": "Overall I think its worth a watch and was a cool plot idea. I feel like it was little to long getting lost at times and some scenes made me cringe with how gory they were which is good but was hard to watch at parts like that."
  }
]