[
  {
    "rating": "5/5",
    "review": "The movie was fun and exciting"
  },
  {
    "rating": "4/5",
    "review": "Ones of the best Marvel movies in a long time. It does feel like a setup movie, but definitely worth a second watch"
  },
  {
    "rating": "3/5",
    "review": "Not bad, surprised by the depth marvel goes into."
  },
  {
    "rating": "4.5/5",
    "review": "Nice balance of action, humor and quality storyline."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed how Marvel addressed mental health issues for our youth in a “back door” kind of manner without being in your face. How someone’s depression and anxiety can take them to a dark place or their trauma interferes with living their daily life, Great job! The real super hero was BOB."
  },
  {
    "rating": "4/5",
    "review": "Fun , action filled, great characters!"
  },
  {
    "rating": "5/5",
    "review": "Great movie. Marvel has returned to its roots - good characters, good storytelling and action!"
  },
  {
    "rating": "4/5",
    "review": "pretty good, got weird at the end. showed the best parts on the previews"
  },
  {
    "rating": "4.5/5",
    "review": "Great chemistry among the leads, and a villain arc that has to be one of the most emotionally profound of the MCU films."
  },
  {
    "rating": "4/5",
    "review": "Unless you're a die-hard fan, you won't recognize these characters, but what you will recognize is people dealing with trauma. I deeply enjoyed this film as a long-time Marvel fan along with my wife (who has zero knowledge of this stuff) because the themes are relatable. Each character deals with grief, irrelevance, regret, disappointment, and loss in a way that resonates with the audience. I read some really harsh reviews, but I actually enjoyed the film a lot more than I thought I would. It's not a perfect film, by any means. However, it does keep a really tight grip on the plot and doesn't muddy the waters too much with the ensemble cast, instead (wisely) choosing to focus on the three main leads. Their arcs are compelling, emotional, and real. I do wish that some of the characters had more time to bond and that some of the plot devices weren't so obvious (such as visible countdown timers for traps and easily located bomb power supplies), but they don't detract from the emotional beats. I liked that they take their name from Yelena's childhood team, the \"Thunderbolts,\" a soccer team that \"never won a game.\" Phrasing is important -- it's not that they're losers, it's just that they've never won. To date, each character is dealing with 'victories' that are either morally gray or pyrrhic, so they all feel like underachievers. As underdogs, it's hard not to root for them."
  },
  {
    "rating": "4.5/5",
    "review": "Best human touch hero movie"
  },
  {
    "rating": "5/5",
    "review": "This was so funnnn to watch but still a marvel heroe movie em n general"
  },
  {
    "rating": "1/5",
    "review": "Why did it exist? Oh my goodness, what happened to Marvel?! Who is gonna see the new avengers who r actually boring and cringy d-vengers?! The jokes r cringy and the fighting scenes r completely mediocre. Not single one character is likeable and charismatic! Again, what happened to Marvel?!"
  },
  {
    "rating": "5/5",
    "review": "Thunderbolts* has an amazing way of uniting heroes that have made many mistakes to show them that they are not defined by their pasts and that they can always start over and be better people. This movie is basically a mental health awareness movie."
  },
  {
    "rating": "5/5",
    "review": "Absolute masterpiece, keeps the original marvel charm while also keeping it emotional and yet it is funny without removing the main feeling of the action"
  },
  {
    "rating": "4.5/5",
    "review": "The movie was a roller coaster. It gives you a really emotional ride comparable to the real world."
  },
  {
    "rating": "5/5",
    "review": "Not what I was expecting... Yet I'd say a much more edgier, I liked it"
  },
  {
    "rating": "3.5/5",
    "review": "Really good plot Some action Good to see"
  },
  {
    "rating": "5/5",
    "review": "this is putting marvel movies in the right direction"
  },
  {
    "rating": "4/5",
    "review": "Taskmaster taken out way too soon. Could have been Rated R hit."
  },
  {
    "rating": "5/5",
    "review": "Best marvel movie in a long while! Worth every second"
  },
  {
    "rating": "4/5",
    "review": "I missed Olga Kurylenko. Not enough Bucky. It was Yelena and Alexi's movie."
  },
  {
    "rating": "4/5",
    "review": "I thought this was a lot of fun, had a surprising amount of heart, and included important setup references for the upcoming Fantastic Four and Avengers movies."
  },
  {
    "rating": "5/5",
    "review": "loved it! it is a fun ride 😃 well done ✅"
  },
  {
    "rating": "5/5",
    "review": "Pleasant surprise! Unexpected indeed! Great fulfilling superhero movie with heart!"
  },
  {
    "rating": "4/5",
    "review": "I liked the action and how whenever they went into the void we got a deeper background on what they had to went through"
  },
  {
    "rating": "5/5",
    "review": "Amazing, entertaining high octane fun!"
  },
  {
    "rating": "5/5",
    "review": "One of the best Marvel movies!! The story line was so interesting and the chemistry between all the characters was amazing. It had tear jerker moments, fantastic marvel fight sequences and it was hilarious."
  },
  {
    "rating": "5/5",
    "review": "What was not to love! Marvel with heart is always 5 stars"
  },
  {
    "rating": "4/5",
    "review": "The build-up until the climax was pretty well put together. However, once that climax started, the movie was quite entertaining!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was crap. Fingers crossed for Fantastic Four."
  },
  {
    "rating": "5/5",
    "review": "Unexpectedly funny, and deals with mental health in a thoughtful way. Highly recommend this film."
  },
  {
    "rating": "4.5/5",
    "review": "Better than I expected"
  },
  {
    "rating": "1/5",
    "review": "what did i just watch?"
  },
  {
    "rating": "5/5",
    "review": "This is the 3rd time my daughter and I watched it! Thunderbolts is a fulfilled movie with classic Marvel action and humor. Just go, have a good time!"
  },
  {
    "rating": "2.5/5",
    "review": "Lots of character development, and storytelling, but action scenes seemed far and few between and the ending seemed a bit rushed. Built up as \"The best Marvel movie of all time.\" But I probably would not have it in my top 10 in the MCU even."
  },
  {
    "rating": "4/5",
    "review": "could do without all the stupid swearing and foul language. not everyone is a hethen."
  },
  {
    "rating": "5/5",
    "review": "There’s nothing to dislike.. Great movie."
  },
  {
    "rating": "3/5",
    "review": "The antagonist was kind of weak, Bob. He felt kind of like a cross between Inception and some low-end troubled villain who is misunderstood. And so he has all of the powers and is better than everyone, like even better than Thanos? Even the writers seemed to laugh at it in the movie when BSentry says, so I am better than a god...Overall I liked the Thunderbolts team but the naming of them as the New Avengers felt kind of unusual. Like what about Hulk, Ant Man, Spiderman, Dr Strange...Are they out? What about Captain Marvel, or Thor? Overall it was fine, better than the new Captain America but not a favorite."
  },
  {
    "rating": "5/5",
    "review": "I like the fact that it showed people they are not alone"
  },
  {
    "rating": "1/5",
    "review": "Needed more action and better and exciting storyline"
  },
  {
    "rating": "1/5",
    "review": "Loved David Harbour, otherwise very confusing and hard to understand what was going on."
  },
  {
    "rating": "5/5",
    "review": "Marvels never fails!! Movie was funny, full of action and did not disappoint."
  },
  {
    "rating": "1.5/5",
    "review": "First, I have to admit I am not a fan of most Marvel movies (However, I do love Guardians of the Galaxy 1 and Deadpool). Thunderbolts got great reviews so I decided to check it out. However, I was disappointed in this movie. The overall plot was just so inane. One bright spot was Florence Pugh's performance--she was great."
  },
  {
    "rating": "5/5",
    "review": "I loved the movie, the story line was great, we havent had a good marvel movie in awhile but this one I loved and it was just incredible"
  },
  {
    "rating": "3/5",
    "review": "The whole talk about depression was just boring to me"
  },
  {
    "rating": "4.5/5",
    "review": "Amazing. Best superhero movie of all time."
  },
  {
    "rating": "3/5",
    "review": "It was good movie overall ending was kinda stupid."
  },
  {
    "rating": "5/5",
    "review": "MUST SEE!! This has to be one of the best Marvel Movies yet. There was action, drama, so much comedy! It’s a must see! Finally some good movies are coming out. Great cast! Awesome visual effects!! So great to watch! Thank you!"
  },
  {
    "rating": "4.5/5",
    "review": "There was just the right amount of action, drama and some comedy sprinkled in. Enjoyed the movie from beginning to end."
  },
  {
    "rating": "5/5",
    "review": "The first Marvel movie in a while that took advantage of the fact the all the characters had been introduced before. We already knew them and so we already cared about them. Then they put them in a situation we can all relate to. Feeling alone and like no one really cares. Also made me laugh and tear up multiple times. Any movie that does that is very good in my book."
  },
  {
    "rating": "5/5",
    "review": "Movie was very entertaining! Good action and humor!"
  },
  {
    "rating": "4.5/5",
    "review": "Good fun enjoyable movie."
  },
  {
    "rating": "3.5/5",
    "review": "Very solid film, good entry for the MCU"
  },
  {
    "rating": "2/5",
    "review": "The Movie was very underwhelming!"
  },
  {
    "rating": "3.5/5",
    "review": "The film is in many ways similar to Guardians of the Galaxy or Suicide Squad. It was entertaining, funny, and had some interesting twists. However, the movie felt like it didn’t dig deep enough. Into the characters, into the “villain”, into the story, into the darkness that the characters are feeling. There is the foundation of a great movie, but they just didn’t spend enough time giving it an impact. The focus on regrets and loneliness is too shallow to make the audience feel the characters’ pain."
  },
  {
    "rating": "0.5/5",
    "review": "NOPE. NOPE. NOPE. NOPE. Total disappointment. Marvel HAS to do better. I wonder if its because of Disney? Im not sure but Thinderbolts aint it."
  },
  {
    "rating": "4.5/5",
    "review": "Moments of levity, action, and interesting characters made the movie good. What I disliked was that Bob's superpower seemed to be depression which kind of gave a depressing theme to the movie. Never thought I would see clinical depression used as a superpower is Prozac the Kryptonite? Other than that we liked it."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is as absolute trash"
  },
  {
    "rating": "5/5",
    "review": "Beautifully done, great message"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie, it was funny, awesome, Incredible, and taught us what life is after those depressing times, and it's okay, also it was entertaining. 100/10 go see it."
  },
  {
    "rating": "5/5",
    "review": "I was not going to see this in theaters but one of my friends who saw it said it was worth it. I really enjoyed it even though the only character I really liked going into the movie was Bucky. At the end I like all of the characters more now and story and the action was actually really cool. Not sure if I liked it so much because of how disappointing a lot of stuff has been recently from marvel and it was a breath of fresh air. Or if it’s actually good on its own. I feel like if this released before endgame it would be lower tier but because it’s after endgame it’s definitely the best one other than Spider-Man no way home."
  },
  {
    "rating": "1.5/5",
    "review": "Unsurprisingly an F tier cast of characters and a D tier script yield mediocre results."
  },
  {
    "rating": "5/5",
    "review": "great movie I see potential with this so long as they dont do to much in the future movies"
  },
  {
    "rating": "5/5",
    "review": "Serious, sad, funny, deep, entertaining. What else you can ask for a movie? 9/10 I’m my book."
  },
  {
    "rating": "5/5",
    "review": "Amazing!!!!! Powerful messages! Didnt expect it to be this good!"
  },
  {
    "rating": "5/5",
    "review": "Best Movie this year"
  },
  {
    "rating": "5/5",
    "review": "loved it! It was a movie about battling mental health that used super heroes to explore and delve into it. Great metaphors. So much better than I expected."
  },
  {
    "rating": "3.5/5",
    "review": "Great film, worth the watch !!"
  },
  {
    "rating": "3.5/5",
    "review": "I thought it was entertaining. At times a bit sappy, but as far as marvel movies go, it's been a while since one has been worth the time to watch it, and this one was."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie. Even if you don't know Marvel, you would still like this movie. Looks awesome in 3D IMAX too."
  },
  {
    "rating": "4.5/5",
    "review": "Good movie! Would watch it again"
  },
  {
    "rating": "4.5/5",
    "review": "Amazing movie. Had one complaint but it was a personal preference. Great experience in the movie theater."
  },
  {
    "rating": "2/5",
    "review": "I love a good Marvel movie. When I saw the cast was excited to see it. Ummm...I'm not sure where the high ratings are coming from. Mediocre at best. Cheesy and kind of boring. I really wanted it to be good but no..."
  },
  {
    "rating": "3.5/5",
    "review": "It’s worth a watch. One of the better ones since Infinity War. I’d say they’re definitely losing their touch on the end credit scenes though. Hopefully we’ll get to see a good Planet Hulk/World War Hulk film now."
  },
  {
    "rating": "5/5",
    "review": "Be sure to watch The Falcon and the Winter Soldier on Disney + before hand. Another great MCU movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Loved the humor and action, kept me on my toes the whole movie"
  },
  {
    "rating": "5/5",
    "review": "Amazing action pack film! will see it again"
  },
  {
    "rating": "4/5",
    "review": "A good feeling story of redemption, courage, and getting up off the mat. A little corny but we could use a little of that these days."
  },
  {
    "rating": "3.5/5",
    "review": "I'm often a super hero movie skeptic. The worst super hero movies wind up being the all powerful hero versus the indestructible villain gallavanting through a city causing massive destruction amounting to nothing. Thunderbolts* felt like the antithesis of this. Every one of the characters was very human and very flawed. None -- even the powerful villain, was indestructible. And much of the movie actually focused on the very real issue of mental health. Multiple of the characters were grappling with mental health making them feel all that more real and human. On top of this, the writing was pretty humorous. Florence Pugh and David Harbour had the best characters, constantly throwing out witty one liners. And Julia Louis-Dreyfus was surprisingly good as Tulsi Gabbard -- I mean the evil CIA director. I never remember any of the broader plot lines from the Marvel universe and there were definitely a lot of references back to things that happened that I no longer remember from past movies. But it never felt like it mattered that I didn't remember. Overall it was a well put together, humorous movie that seemed to have a much more meaningful point than many vacuous superhero movies."
  },
  {
    "rating": "4.5/5",
    "review": "I like it because it's my birthday."
  },
  {
    "rating": "4/5",
    "review": "It was filled with action and had a great story about real life"
  },
  {
    "rating": "4/5",
    "review": "Good character building, entertaining story."
  },
  {
    "rating": "5/5",
    "review": "Fun & full of heart!"
  },
  {
    "rating": "4/5",
    "review": "Thunderbolts is a strong, surprisingly grounded entry in the MCU that reminds us just how good Marvel can be when it actually leans into character, humor, and tight storytelling. With a cast of familiar faces and morally gray heroes, the film strikes a great balance between gritty action and sharp wit. The acting is consistently solid across the board, with returning characters like Yelena Belova and Bucky Barnes stealing scenes with both emotional depth and comedic timing. The chemistry between the team is believable, messy, and entertaining—just what you’d want from a group of reluctant allies. The writing is smart and refreshingly character-driven, with enough humor to keep things light without undercutting the stakes. Action sequences are punchy, well-choreographed, and serve the story rather than overwhelm it. Thunderbolts may not reinvent the genre, but it doesn't need to. It's a reminder that Marvel still knows how to deliver a fun, engaging, and well-made superhero movie when it stays focused. A solid win that earns its place in the lineup."
  },
  {
    "rating": "4/5",
    "review": "It was an excellent film showcasing the Marvel sidekicks' collaborative efforts."
  },
  {
    "rating": "2/5",
    "review": "Tbh sentry story is one of the best stories in the comics and they changed it into some bullshit why would they change a masterpiece story"
  },
  {
    "rating": "5/5",
    "review": "Didn't think I'd enjoy it considering the characters but it was very entertaining. Great story and intro to Bob."
  },
  {
    "rating": "2.5/5",
    "review": "Movie was slow,and kind of \" choppy\". Story wasn't good. Not alot of action. Sentry character was lame. Not the worst Marvel movie but it's close,in my view. VERY DISAPPOINTED in this. Was looking forward to seeing this movie since the first trailer"
  },
  {
    "rating": "4.5/5",
    "review": "It was a good watchinawgile from Marvel."
  },
  {
    "rating": "4/5",
    "review": "Good starting point for rebirth of the Avengers with some comedy thrown in"
  },
  {
    "rating": "0.5/5",
    "review": "Whack !!! Why can’t anybody make any good movies anymore??? Does every movie have to be so corny!!!"
  },
  {
    "rating": "5/5",
    "review": "great character development, great story and set up for doomsday is amazing 👏"
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed it as a good movie, not just a good Marvel movie. The writing and acting were so solid I felt like I could have watched a whole extra act it was a self-contained story that left me excited to see more from this group of characters."
  },
  {
    "rating": "5/5",
    "review": "Everyone’s performance in this movie was great. Feel like marvel has returned with this movie."
  },
  {
    "rating": "5/5",
    "review": "the best Marvel movie I have watched in a while. The acting was great, and the new team was awesome 👌"
  },
  {
    "rating": "5/5",
    "review": "It was a great movie"
  },
  {
    "rating": "5/5",
    "review": "Feel like the old MCU"
  },
  {
    "rating": "5/5",
    "review": "Great fun, well paced Marvel movie."
  },
  {
    "rating": "5/5",
    "review": "Best marvel movie in awhile . Just go watch it"
  },
  {
    "rating": "5/5",
    "review": "It was a really fantastic and very well done Marvel live-action movie. It had very well done cinematography, really sensational performances, really incredible characters, really cool special effects, really astonishing action, really phenomenal humor, really great drama, really extraordinary music, really magnificent costumes and a really fascinating story. In my opinion, I think it’s one of the best Marvel movies of 2025. I extremely recommend this film to Marvel fans of all ages."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I’ve ever seen! Don’t waste your money. My husband and grandkids all agree with me. It was boring as anything and it seemed the writer was filling it in with one ridiculous fight after another. Plot didn’t exist either!"
  },
  {
    "rating": "4/5",
    "review": "It was a great film. Emotional and story driven. Great cast. You can see and feel the chemistry of the team. Definitely recommend watching it."
  },
  {
    "rating": "5/5",
    "review": "I’d go see it a hundred times (just like Sinners) if I had 15 bucks to shell out everyday of the week! Definitely got action, some moments to tug at your heart strings and some great laughs!"
  },
  {
    "rating": "3/5",
    "review": "ok not bad for using less popular charas. I enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "Best Marvel movie ever! Fantastic character development, writing, acting and action"
  },
  {
    "rating": "5/5",
    "review": "A very creative way to introduce a new group of super heroes Not trying to build off of the Avengers we have grown to love over the years, but created an original and wonderful storyline for the new Marvel superheroes."
  },
  {
    "rating": "5/5",
    "review": "I Loved this film!!! If I could give it more stars I would. The story line was so well developed. Marvel did a great job in developing the characters into 2025. They all seem to work very well together and felt very comfortable. I can’t say enough about the visual effects were some of the best I’ve ever seen. Great job Marvel ! I loved this film. Looking forward to watching them develop into the future Avengers."
  },
  {
    "rating": "5/5",
    "review": "The Thuderbolts was outstanding performance & I can’t wait to the new Fantastic Four first steps on July 25th at the Thornton place"
  },
  {
    "rating": "5/5",
    "review": "A new take on the new Avengers."
  },
  {
    "rating": "3.5/5",
    "review": "Very hard to replace the original revengers"
  },
  {
    "rating": "4.5/5",
    "review": "Realmente adorei o filme, achei que ia ser um filme mais ou menos mas foi maravilhoso, esse filme recuperou minha esperança na Marvel"
  },
  {
    "rating": "3/5",
    "review": "Needs more action, but story was good."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. It had so much more to it than action. I literally just walked out of the theater and I want to go back and watch it all over again. The kinship between the characters, the message behind it all was so encouraging."
  },
  {
    "rating": "0.5/5",
    "review": "Feels like a fanfic written by a 50 y/o marvel fan"
  },
  {
    "rating": "2/5",
    "review": "The ending was terrible. Flashbacks were a waste of time"
  },
  {
    "rating": "4/5",
    "review": "Hard to say without spoilers but it shows how you can work together to beat a seemingly invincible foe and it’s not always about who has more strength."
  },
  {
    "rating": "3/5",
    "review": "Better than expected from Marvel… David Harbour carries this movie! Aside from him, most of the jokes fall flat with the addition of an overt ‘girl boss’ vibe throughout the film. With the exception of Bucky all the men are either evil, inept or weak. Typical Marvel mediocrity."
  },
  {
    "rating": "5/5",
    "review": "Loved it so much that I had to go see it twice. Not as much action as some of the other Avengers movies, but still very well made and great storyline."
  },
  {
    "rating": "5/5",
    "review": "good acting, story, fun"
  },
  {
    "rating": "4.5/5",
    "review": "Made me laugh, made me tear up, and made me jump. Classic Marvel."
  },
  {
    "rating": "3/5",
    "review": "Not enough strong characters but expected. Movie about the B team with no members of the A team. Winter Soldier was the senior member. Marvel movie can’t be better than the villain. And there was no strong villain character."
  },
  {
    "rating": "1/5",
    "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
  },
  {
    "rating": "5/5",
    "review": "Great movie - better than expected - cant wait for the next one"
  },
  {
    "rating": "2.5/5",
    "review": "My buddy & I thought it was great! I highly recommend if you want to sleep and/or scroll on your phone. It was the same story line, but in different circumstances and places."
  },
  {
    "rating": "5/5",
    "review": "Loved!!! Florence Pugh carried. Yelena gets better with every appearance in the MCU. Love bob too."
  },
  {
    "rating": "5/5",
    "review": "Marvel is back. Love the story line, love the social commentary, love the new villain."
  },
  {
    "rating": "4/5",
    "review": "Much much better than I anticipated. Very funny but also very dark. I’ve how the represented the dark thoughts we all have in our head. The Void is real."
  },
  {
    "rating": "5/5",
    "review": "I say I thoroughly enjoyed it unlike some of the most recent Marvel movies. This one has heart, a great story and some phenomenal directing"
  },
  {
    "rating": "4.5/5",
    "review": "Held true to the Avengers theme . But became quite dark and in some areas , close to innapropriate for a younger audience ."
  },
  {
    "rating": "3.5/5",
    "review": "It’s a great movie lots of laughs"
  },
  {
    "rating": "5/5",
    "review": "She really told him who could do it better."
  },
  {
    "rating": "4/5",
    "review": "Depression episode of Avengers"
  },
  {
    "rating": "4/5",
    "review": "Good movie if youre Marvel fan OK if youre not."
  },
  {
    "rating": "5/5",
    "review": "Great message about mental health. As well as decent action."
  },
  {
    "rating": "4/5",
    "review": "One of the best MCU Films in the longest time. The mental health analogy is great. Absolutely loved it."
  },
  {
    "rating": "4/5",
    "review": "Marvel is back! David Harbor and Florence Pugh great chemistry. Sebastian Stan brings the gravitas and US Agent’s smugness gets a tone-down"
  },
  {
    "rating": "1.5/5",
    "review": "Movie final destination bloodlines on fand"
  },
  {
    "rating": "5/5",
    "review": "Making the boblena a reality"
  },
  {
    "rating": "4/5",
    "review": "It’s was okay for a mic movie !"
  },
  {
    "rating": "3/5",
    "review": "I didn’t like the conflict resolution with the main villain i sorta feel cheated"
  },
  {
    "rating": "5/5",
    "review": "I felt it was one of Marvels better movies. I enjoyed the action and story line."
  },
  {
    "rating": "4.5/5",
    "review": "the movie was really good and the comedy was great. also hit with the emotions"
  },
  {
    "rating": "5/5",
    "review": "Loved the movie. Finally some of that good stuff from marvel after such a long time! Fantastic post credit scene haha!"
  },
  {
    "rating": "5/5",
    "review": "I loved it there was humor as well as action and heart"
  },
  {
    "rating": "4/5",
    "review": "Loved the movie. Well written, directed and acting. The movie doesn't disappoint and the action is fast paced. It doesn't waste tons of time in exposition which is what you want from a superhero movie. The only thing I take away from the movie is the stupid Thunderbolts* / New Avengers title swap. Possibly the stupidest marketing gimmick ever."
  },
  {
    "rating": "5/5",
    "review": "the single greatest film I've ever film especially superhero film"
  },
  {
    "rating": "5/5",
    "review": "It’s been the best Marvel movie in a while"
  },
  {
    "rating": "5/5",
    "review": "Thoroughly enjoyed this film! I found the characters relatable and the story compelling."
  },
  {
    "rating": "0.5/5",
    "review": "Not the avengers awful movie!"
  },
  {
    "rating": "4/5",
    "review": "Short Review: I liked it. Long Review: Moved fast for being over 2 hours and it was an original take on the characters while still being true to the source material. Not sure how much rewatchability it will have due to depressing subject matter."
  },
  {
    "rating": "5/5",
    "review": "What scared me about Thunderbolts is that, it felt like I was watching myself, specially from 2021/22. Those were my darkest days, the most I’ve ever felt alone in my life up till now. It doesn’t help that I’m also the youngest of a sister duo. Lol. I felt numb. Cold. .. helpless. Stayed in my room. Threw myself in my art & writing. I had no friends to talk too truly about how I felt in my head or thoughts of .. ending it. It wasn't a coincidence that the film was also released during mental awareness month or that each character has had their fair share of pain and trauma. from the writing to acting, I wanted more. I crave more from the dynamic. This type of misfit team up, reminiscent of the Avengers 2012 film, is exactly what's been missing especially since guardians are no more. My only issues was, I wanted more Bucky, I wanted to see more of his life, home, job. Bucky is constantly getting the short end of the stick. (Just to clarify my sis is still alive, lmao)"
  },
  {
    "rating": "5/5",
    "review": "promising look for marvel's future installments. don't screw it up."
  },
  {
    "rating": "3/5",
    "review": "The Mental health theme of this movie was really powerful until the final fight scene where I felt like the good writing left and they decided to break it down Barney style for any of the audience who didn’t understand it up to that point. Pough and harbor’s relationship gets the full shine it deserves and then some. Enough good in this movie to make it worth it and I hope this encourages more of these themes in major comic book movies."
  },
  {
    "rating": "5/5",
    "review": "a different style of super hero movie, with a great commentary on mental health, trauma, and depression."
  },
  {
    "rating": "3.5/5",
    "review": "The best Marvel movie in a long time. By this point that's probably only like saying your bowels are back to normal after a particularly nasty stomach bug, but to give it it's due, it's not bad. Overwrought and clunky in places but tonally darker with greater depth and at least they're trying again, which has to count for something."
  },
  {
    "rating": "5/5",
    "review": "incredible. Best movie since ENDGAME TRULY. This is the Marvel I've missed!"
  },
  {
    "rating": "4/5",
    "review": "This film is unlike any other Marvel film I’ve ever seen. It’s an group of unlikely heroes going on an emotional journey while stopping the antagonists of this film. Although tears and praise come out of me, I have to admit there are a few improvements this movie could take: 1. When the rest of the team enters the Void, it doesn’t show any scene development, rather than suddenly appearing while Yelena and Bob were in the attic. You could add how they got into the Void, face their fears, so that the plot thickens. 2.Taskmaster was killed off too fast, we haven’t gotten to known her entire story, if she had survived, we would have gotten to explore the character’s personality and embrace her into the MCU. 3. In the post-credits scene, there is a scene where the Fantastic Four ship appears in Earth-19999, this however spoils some of the details of the upcoming movie “Fantastic Four: First Steps”. Marvel Studios shouldn’t have been too eager to show that to the audience as to add suspense and thriller.  So after my essay review of this movie, I would rate an 7.8/10, which would mark up to IMDb’s standards."
  },
  {
    "rating": "5/5",
    "review": "One of the best post-Endgame MCU installments"
  },
  {
    "rating": "4/5",
    "review": "The movie was decent, but nothing original. Fandango's platform is the real problem."
  },
  {
    "rating": "5/5",
    "review": "I believe that Thunderbolts* is one of THE best Marvel movies/projects since Avengers: Endgame in 2019. This movie hits you right in the inside and allows you to make emotional connections with the characters throughout the movie. I'm excited to see where these characters go from here, more than likely will reappear in Avengers: Doomsday. If you didn't like the previous marvel films, I would recommend that you give it one last chance and experience this movie"
  },
  {
    "rating": "4/5",
    "review": "Its a comic book movie. Its fun, its entertaining, and emotional as well."
  },
  {
    "rating": "4.5/5",
    "review": "Great funny and touching movie to watch with the family."
  },
  {
    "rating": "3/5",
    "review": "It was ok I wouldn’t see it again or buy it but it was ok. Decent action some comedy."
  },
  {
    "rating": "5/5",
    "review": "Florence Pugh and David Harbour were outstanding, and the whole movie was 9/10."
  },
  {
    "rating": "5/5",
    "review": "LOVE IT .. Florence is the MVP and Bob!!!"
  },
  {
    "rating": "1.5/5",
    "review": "Was not a normal Avenger movie. Became soft hallways through and lost me with the plot"
  },
  {
    "rating": "5/5",
    "review": "This movie along with the newest Captain America, demonstrates that Marvels Studio has been paying attention. If you like the Marvels collection, this movie will be worth the time."
  },
  {
    "rating": "5/5",
    "review": "I was pleasantly surprised at how great this move was. Good action, story, comedy, message. I felt Jesus Christ was used a bit heavy but as a follower Im more sensitive to it. But I was engaged the whole time and it had me almost tear up at times. Definitely recommend it!"
  },
  {
    "rating": "5/5",
    "review": "Best Film in the MCU and a real human story. The only demerit is that it’s best viewed post introduction of each of the characters via there own shows / movies. As per usual marvel. Fantastic film regardless"
  },
  {
    "rating": "3.5/5",
    "review": "I agree worth a watch but too fast and hated how they killed off task master so easily."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie. Just go watch it youll laugh youll cry youll have a great time"
  },
  {
    "rating": "1/5",
    "review": "boring and unimaginative."
  },
  {
    "rating": "4/5",
    "review": "The MCU is finally back."
  },
  {
    "rating": "2/5",
    "review": "My Review - Thunderbolts (Average)In not a Marvel fan. So when I like a superhero movie you know it’s good. I really wanted to like this movie. The beginning of the movie bored me and I was on my phone. I did pick up halfway, but there was nothing original, and even with my 3D glasses it didn’t make it better. I liked the characters. There was good acting. However, the script was bland. Marvel fans will love this. However, for me, I would rather see the cat flying Captain Marvel than this movie."
  },
  {
    "rating": "4/5",
    "review": "Great start to a new cast of characters. I loved Bob. Im looking forward to the next one."
  },
  {
    "rating": "3.5/5",
    "review": "Marvel has finally redeemed itself after The Endgame. Yelena’s character really stood out."
  },
  {
    "rating": "4/5",
    "review": "Finally, the MCU is starting to do some projects again that are more grounded to some extent & not overly woo woo with legendary gods of destruction or whatever. This project, along with the return of DareDevil is really freaking good. Real human emotions, real stakes & something that’s not the end all of a film that’ll take a decade to reset interest in (see the last Avengers Films, they were so big that so many of the projects after just felt flat by comparison. Keep a handle on the bar so it doesn’t go so high nothing else in its own universe can compete). I unexpectedly & happily really liked this Film. It’s a perfect team of losers who aren’t OP’d & the focus is on their relationships & inner struggles, not any special powers. It’s really freaking great. Good writing, great acting. Interesting & engaging overall without getting lost in out of context scenes."
  },
  {
    "rating": "5/5",
    "review": "new avengers era, it will be great 👍"
  },
  {
    "rating": "4.5/5",
    "review": "With little CGI and jokes that are actually funny, Thunderbolts is a really good movie focussing on depression, tauma and regret. The acting from Florence Pugh and Lewis Pullman are Oscar worthy, esspecially Pullman. My only gripe would be the way they handled Taskmaster. Why in the movie about second chances does the character who arguably deserves a second chance most of all get merced within 10 minutes. With the original,plan for Taskmaster out in the public eyes I beleive that it would have made the movie even better and given Ghost a bit more to do. But that's my only gripe with the movie. A return to what the MCU was before Disney"
  },
  {
    "rating": "5/5",
    "review": "This movie was amazing. Definitely in my top 5 Marvel movies period. 👏👏👏"
  },
  {
    "rating": "4.5/5",
    "review": "like Avengers but somehow more traumatized."
  },
  {
    "rating": "5/5",
    "review": "I liked the movie a lot! the story actually made sense and the characters had great character development! better than most of the marvel movies that have come out lately which was a refreshing because lately marvel has been trying to hard to make monumental movies which make the overall story bad but this movie is just right and has a good story!"
  },
  {
    "rating": "5/5",
    "review": "First time in a long time I’ve come out of a Marvel movie talking about how much I enjoyed it! If Marvel keeps cooking like this good things are ahead!"
  },
  {
    "rating": "5/5",
    "review": "Great story and nice to see the unlikely heros"
  },
  {
    "rating": "4.5/5",
    "review": "That was one of the best Marvel movies Ive seen in a long time! Well done Thunderbolts!"
  },
  {
    "rating": "4/5",
    "review": "For one of these marvel movies, this was actually pretty good, and I didn’t leave stupider then when I arrived. It had a plot, pretty well defined characters, was funny at times with a comic relief character, and and entertaining action. Overall, I recommend, even to those that these movies aren’t normally your thing (like me)."
  },
  {
    "rating": "2.5/5",
    "review": "Effects and action scenes were decent, but I didn't like the plot."
  },
  {
    "rating": "5/5",
    "review": "Primera película de Marvel desde hace mucho que me gusto, volvieron al humor que me encanta👌"
  },
  {
    "rating": "3/5",
    "review": "Best of the worst. And the best movie since Spider man's no way home."
  },
  {
    "rating": "5/5",
    "review": "Must see movie, loved it"
  },
  {
    "rating": "5/5",
    "review": "What an entertaining, funny and well written marvel film. We are finally back to the era of marvel we missed dearly!"
  },
  {
    "rating": "5/5",
    "review": "This is one of the best marvel films of all time!!! Hands Down!"
  },
  {
    "rating": "4/5",
    "review": "Good first summer movie, expected a bit more though."
  },
  {
    "rating": "4.5/5",
    "review": "The best Marvel movie I've seen in years! Hits the right Marvel alchemy of emotional moments, good fight scenes, humor, tie into the rest of the universe and a plot that made sense. It also doesn't drag along (only 2 hours) and had some great acting by Florence Pugh especially."
  },
  {
    "rating": "5/5",
    "review": "Loved it! It was a bit dark but if you get it you get it. I highly recommend seeing this movie especially if you are a Marvel fan."
  },
  {
    "rating": "5/5",
    "review": "Welp I was already set to give it five stars for being a fun but also complex superhero flick, when they hit me with an actually well done exploration of trauma?!"
  },
  {
    "rating": "4.5/5",
    "review": "An actual fun time! Could the MCU be returning to form finally? I guess we’ll see."
  },
  {
    "rating": "2.5/5",
    "review": "We want the real avengers? Don't you get it?"
  },
  {
    "rating": "3/5",
    "review": "My least favorite from the Marvel universe -Too much talking, not enough action"
  },
  {
    "rating": "4.5/5",
    "review": "Thunderbolts was sooo goood! It wasn’t what I expected it to be, especially with that central mental health and loneliness message. Plus the importance of being there for someone when they are at their lowest point. Florence Pugh is star of the movie and I quite like the action scenes. Unfortunately there wasn’t enough Bucky action scenes."
  },
  {
    "rating": "5/5",
    "review": "I really liked the movie it was really good there were barely people so it was quiet and peaceful I could enjoy it"
  },
  {
    "rating": "5/5",
    "review": "Thunderbolts* is incredible!!! The messages it has and the use of practical effects. Everything. 10/10. This movie is a MUST see for any marvel fans."
  },
  {
    "rating": "1/5",
    "review": "Thunderbolts arent likeable"
  },
  {
    "rating": "5/5",
    "review": "good marvel movie. would watch again"
  },
  {
    "rating": "5/5",
    "review": "A must see from the MCU. One of the best marvel movies I have seen in a while. With a wonderful cast and a great theme. The movies surpasses all expectations. Great job MCU"
  },
  {
    "rating": "4.5/5",
    "review": "I thoroughly enjoyed thunderbolts the new avengers. This movie did not disappoint. It was non stop action.And I loved that the bad guys were turned into the new superheroes."
  },
  {
    "rating": "4/5",
    "review": "Even someone who hasnt really followed the MCU will enjoy this movie. It had great action, interesting characters, and lots of laughs. I thoroughly enjoyed it!"
  },
  {
    "rating": "5/5",
    "review": "A fun film, as long as you don't expect Iron man or Avengers level, but still a fun movie for me. Enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "WOW just wow. An unexpected phenomenal movie! Perhaps the best movie since Endgame... wow!"
  },
  {
    "rating": "5/5",
    "review": "it’s the beginning of the good marvel movies again"
  },
  {
    "rating": "5/5",
    "review": "best movie after deadpool and wolverine"
  },
  {
    "rating": "4.5/5",
    "review": "the second half of the film carried so hard. It was kinda boring at the beginning but it got better towards the end. Yelena and Bucky were the best members of the thunderbolts. I honestly think Taskmaster should’ve been left out of the film."
  },
  {
    "rating": "0.5/5",
    "review": "Sucks big time. Another Disney flop!!!"
  },
  {
    "rating": "3/5",
    "review": "Movie was better than expected (not saying a lot from the current Marvel movies). It was refreshing from the usual slop that the MCU usually put out. I really enjoyed the entire ‘Sentry’ arc, but the movie in general really lacked a sense of good storytelling. I feel like Marvel felt tired of the flops and just came back to making a basic superhero movie and I believe this one finally paid off. Let’s hope the future is brighter (no pun intended)."
  },
  {
    "rating": "3/5",
    "review": "It was a fun watch. Its really just a somewhat typical marvel movie: super soldiers punching and kicking their way through problems with a bit of situational humour. Really, the bar is on the floor for Marvel movies. I'd say it didn't suck, it didn't amaze, but it was an easy watch and fun so thats something. Its likely ill forget about it in 6 months but it got me out of the house and that counts for something."
  },
  {
    "rating": "3.5/5",
    "review": "A bit confused with the ending but it was a solid watch"
  },
  {
    "rating": "5/5",
    "review": "An actual storyline worth investing in. A delve into mental illness that culminates with the introduction into the rest of the MCU."
  },
  {
    "rating": "1/5",
    "review": "Whats happening? Am I the only one who thinks Thunderbolts is actually really terrible? Come on!. I don't even know where to begin. The character switch of Bob, from 'victim to villain in just a few scenes, and then back...plus everything else....if i was told it's a movie for teens and kids then i'd understand, but saying this is one of Marvels best....wow...i'm stumped"
  },
  {
    "rating": "5/5",
    "review": "Movie has several well timed jokes. Felt like a nice reset of the MCU after the slop they have given us for the past few years. New costumes in end credits scene looked really good hopefully they stick around for a bit and not change the very next time we see them."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie, I was excited to see some marvel action, the same humor we expect but maybe too short, would’ve like to see more action more storyline and perhaps cameo from one of the other avengers but overall great movie"
  },
  {
    "rating": "4/5",
    "review": "The Thunderbolts * was AWESOME!! This movie was its own thing and not trying to The Avengers!! Everyone was on their A game! I think Stan Lee would've been happy to make a Cameo!! Also, an AWESOME post credit scene!!"
  },
  {
    "rating": "5/5",
    "review": "Saw it a second time, I really enjoyed it!"
  },
  {
    "rating": "4.5/5",
    "review": "This movie was amazing! Best marvel movie since endgame, although I really like No Way Home. Family doesn’t have to be blood, you are not alone."
  },
  {
    "rating": "4.5/5",
    "review": "It’s one of the best Marvel movies in a while. Great storytelling, acting, and writing. Good message, funny, and great action! A must see for all Marvel fans."
  },
  {
    "rating": "5/5",
    "review": "Classic Marvel!!! Great action, great story, great laughs!"
  },
  {
    "rating": "4/5",
    "review": "Personally, I'd see just about anything that David Harbour is in. That aside, it's a pretty good movie. At 2 hrs, it's a bit long. Most of the 2nd half is just dialog, no action. But all in all, it's worth the ticket price and great to see \"Avengers\" on the screen again."
  },
  {
    "rating": "4.5/5",
    "review": "I was a good movie a bit dark towards the end & a bit off. But I did like it. If you like those type of movies or avengers go."
  },
  {
    "rating": "4/5",
    "review": "Fun, emotional, sets the stage for what’s to come"
  },
  {
    "rating": "5/5",
    "review": "A silly little Marvel movie with great characters and quite the interesting plot. Love most of the actors that played well. 9.5/10"
  },
  {
    "rating": "4.5/5",
    "review": "A bit sleepy at first but stick around the movie is brilliant and delves into the human psyche in ways that no other marvel story has."
  },
  {
    "rating": "4/5",
    "review": "Best Marvel in awhile."
  },
  {
    "rating": "4/5",
    "review": "A very interesting script. More like a psychological thriller with character background immersion. The choreography was amazing. Love Florence Pugh! A refreshing new spin on the reluctant hero."
  },
  {
    "rating": "4.5/5",
    "review": "It’s been a while since a team up marvel movie and this was great!"
  },
  {
    "rating": "2.5/5",
    "review": "While there was a few good action scenes and good special effects, most of the movie was too “woke”. Plot went in too many directions with no cohesion. Too much touch feely, feelings, etc. For me, this was a miss."
  },
  {
    "rating": "5/5",
    "review": "A fun action and funny movie"
  },
  {
    "rating": "5/5",
    "review": "This was one of the better Marvels since Endgame."
  },
  {
    "rating": "3.5/5",
    "review": "One of the better Marvel movies in a few years. Fun, great character development, and focusing on what makes the MCU work - characters to cheer for along the way."
  },
  {
    "rating": "4/5",
    "review": "Just watched it! I really enjoyed the movie. Even though several recent mcu movies weren't what I had hoped thunderbolts did not disappoint."
  },
  {
    "rating": "3/5",
    "review": "It's just ok, action scenes are good but do i need to watch this ever again, no. Acting isn't the best at times and lot's of strong independent woman stuff and making the male characters look dumb, but was ok."
  },
  {
    "rating": "4.5/5",
    "review": "Best marvel movie of the last 2-3 years."
  },
  {
    "rating": "4.5/5",
    "review": "Enjoyable film that’s definitely worth watching, and honestly made much more sense after watching it a second time as stuff is missed in a single viewing. Still unanswered did Valentina really avoid impeachment?"
  },
  {
    "rating": "3.5/5",
    "review": "Me Pareció Un Poco \"Disney\" el Momento donde Abrazan a Bob, Pero no está Mal, Hay Acción y no decepciona 09/10 Y God"
  },
  {
    "rating": "5/5",
    "review": "Bob is the Best!! #NewAvengers"
  },
  {
    "rating": "2.5/5",
    "review": "Nothing special. Decent plot but critics rated it so high because it dives slightly into mental health. From a fan standpoint not that great"
  },
  {
    "rating": "4/5",
    "review": "The movie was definitely fantastic it was up and down between the action scenes and explanations of the story but overall the film exceeded expectations. I personally enjoyed the story telling from a comic fans perspective as well as a marvel fanatic."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. It was great to see Marvel give a touch to mental health and see how certain characters deal with it!"
  },
  {
    "rating": "4/5",
    "review": "Super fun with a lot of heart!"
  },
  {
    "rating": "4/5",
    "review": "Great addition to marvel franchise! Gets you ready for the next one!"
  },
  {
    "rating": "2.5/5",
    "review": "Just ok for me! Ok so if this would have done well how could they have kept the cast looking young? The choices in cast have been questionable for sure, especially after Harrison Ford Hulk! Idk maybe I’m reaching! Movie was just ok!"
  },
  {
    "rating": "5/5",
    "review": "This movie is a must-see! It’s comedic, action-packed, and even a little emotional at times. I can’t wait to see it again!"
  },
  {
    "rating": "5/5",
    "review": "Yelena and the rest of the team are great together. Love that it dives into mental health, but still has humor and great action."
  },
  {
    "rating": "5/5",
    "review": "Great acting and action. Storyline was clear as well."
  },
  {
    "rating": "5/5",
    "review": "Hello! This movie is absolutely great! I watched the movie and liked it very much. I had incredible experience in cinema. You made that I really wanted from Marvel movies anf from other movies at all. You made excellent emotional story with deep meaning. İn old Marvel movies creators used rude jokes that I didn't like it and other viewers too. But in this film jokes aren't rude and they are really kind and funny, also make movie better. Visual effects and stunts made on high level, this was incredible work. Run time is good 2 hours 6 minutes. İt is important, because if it become 3 hours, not all people can watch it. For example, I didn't watch Avengers:Infinity war and Avengers:Endgame. Run time was long and too many long boring scenes. But in this movie all scenes are interesting. This movie's age rating is PG-13, especially for thematic elements and action. But we can advise this movie to watch with family and children elder six years, everyone will enjoy it. Actors are great, roles played excellent, characters are amazing. Especially we must note soundtrack. Music is absolutely great, which adds to film all characters' feelings. That's why you feel all actions even without 4DX. And I liked chemistry between characters, it was better than in other Marvel projects. Team worked really hard on this project. And the most important thing was humanity feeling in our characters, their soul pains and becoming hero, because they want to help people, how they can. Kindness and importance of humanity feeling than superpower, makes movie one the best of all time. I never could choose the best Marvel movie for myself (I was between Iron man and Spider-man), but now I know. For me it is the best movie from Marvel Studios. Thank you very much for this amazing movie! Can't wait to see Thunderbolts* in Avengers: Doomsday and Avengers: Secret Wars, and in next movies. Let's go New Avengers! Thank you again!"
  },
  {
    "rating": "4/5",
    "review": "I liked it but it got dark and really touched on mental health unexpectedly."
  },
  {
    "rating": "3/5",
    "review": "disneys marvel at its mental state, derivative"
  },
  {
    "rating": "4.5/5",
    "review": "Exactly what you would want in a marvel movie. Everyone is on point and Julia Louise Dreyfuss is perfect leaving you wanting more of her. Great movie and fun characters with a nice twist on the villain."
  },
  {
    "rating": "4.5/5",
    "review": "One of the best Marvel movies post end game"
  },
  {
    "rating": "5/5",
    "review": "Probably the best marvel movie since endgame, besides black panther 2"
  },
  {
    "rating": "4/5",
    "review": "It was ok. I liked it. That is all."
  },
  {
    "rating": "1/5",
    "review": "If this was a \"reboot\" to keep interest in the Marvel franchise, they failed - it is the same plot and rehash of all the other movies. Fell asleep twice hard to watch \"super heros\" doing therapy on screen."
  },
  {
    "rating": "3/5",
    "review": "Thunderbolts: A six part episode event on Disney + ⬅️ What this movie felt like. Let me spoil the ending for you, the gang beats the bad guy with a hug. 🙄 I was really excited for this one, especially after the brilliant marketing they had for it. Regrettably, I wish I would've seen The Accountant 2 instead. 🤷‍♂️"
  },
  {
    "rating": "5/5",
    "review": "Em resumo, Thunderbolts é uma grata surpresa para os fãs do gênero. Um filme que entrega entretenimento de qualidade e ainda levanta reflexões sobre segundas chances e o verdadeiro significado de ser um herói."
  },
  {
    "rating": "3.5/5",
    "review": "I did not expect much of anything going into Thunderbolts. Even though friends who had already seen it were telling me how great it was, I still did not have many expectations. Now that I have seen it, I can say that the movie is good but I would not say it was amazing. I feel like people have just been really starved for a good movie from Marvel. Also, everything (or mostly everything) that has come out before this in the MCU hasn’t been very good so the bar is pretty low right now. But it still definitely worth the watch. The performances are solid, with Florence Pugh and David Harbour standing out, and the action sequences are satisfying to watch. The movie never really drags either and has good pacing, and it tackles some interesting themes not seen often in the MCU."
  },
  {
    "rating": "3.5/5",
    "review": "First off this is a very entertaining movie especially compared to recent mcu releases. However this film was slightly overhyped in my opinion. There wasn’t really character development or exploration of most of the thunderbolts. I get it supposed to be about Yelena and her becoming a prominent character in the universe but it felt like at times the rest of thunderbolts where just there. Also there was a character who they did go into their backstory but I feel like they still could’ve done a better job at exploring the character. It’s definitely a fun watch and has a great message but the character development could’ve been better."
  },
  {
    "rating": "4/5",
    "review": "Looks great in theaters. Deft one of the best marvel movies."
  },
  {
    "rating": "5/5",
    "review": "They are a rag tag group of misfits, has-beens and wash-outs. And instead of hanging up the towel, they decided to ringe it out one last time. And man, did Marvel deliver with this one. I did not go into the theater with high hopes. Since endgame, I have been half paying attention to what has been going on. Florence Pugh is absolutely wonderful in this film. I cannot applaude her enough. Her acting was so of the best in the movie. Her monologue scenes were magnificent. Lewis Pullman... man, your characters life story plus your range in acting... man, I felt like you had gotten ahold of my journal. Thank you for this piece of art man. You encapsulated everything it meant to be a better version of yourself. And how to get there.... is never a path walked alone. The other actors. David Harbour's Alexei was another wonderful entry to his already astounding resume. I expected him to shine bright, and man, he really did. As a father myself, his emotions during the lowest and highest moments of the film. Just peak cinema. Over the top. Good on you sir. It was an amazing movie. Please go see it. Oh, and PS Son Lux delivered an absolute master class in sound engineering in this film"
  },
  {
    "rating": "4.5/5",
    "review": "Good storyline with a good amount of action to go along with the character evolvement. Everyone has said how quick the movie felt even though it was 2 hours long. I did feel that it was a bit anticlimactic as it ended with what I felt needed more. Great acting, visual effects were back like the old days and fun!"
  },
  {
    "rating": "3/5",
    "review": "Generally pretty good Marvel movie. I think fans will like it. Looked great, slow start. A bit formulaic as usual. I was entertained but don’t need to see it again."
  },
  {
    "rating": "4.5/5",
    "review": "Thunderbolts* leans heavily and creatively into its characters. Does it also feature cool fight choreography and top-notch special effects? You bet it does! But it is the characters and their arcs who will make you care about what happens, and stellar acting brings those characters to life. Thunderbolts* made me fist pump, shed a tear, laugh out loud and applaud (sorry, yes, I'm one of those people)."
  },
  {
    "rating": "4/5",
    "review": "Best Avengers Marvel Universe movie in a while, lots of humorous banter and touching character building scenes."
  },
  {
    "rating": "4/5",
    "review": "Its Marvel! Ms Pughs character always steals the show. A bit dark, but good"
  },
  {
    "rating": "3.5/5",
    "review": "I thought it was the best Marvel movie since Avengers Endgame. It has a realistic & relatable central topic centered around mental health which was a good change up from the usual punch and shoot format."
  },
  {
    "rating": "4.5/5",
    "review": "This movie brings back what Marvel movies had with the charisma and the character development with great writing.Thunderbolts* is about depression and isolation and it represents it with its characters very well.The characters bring so much more life into this movie Yelena and Bob carry this movie and the rest of the characters all have their moment to shine.Overall its an amazing movie and I cant wait for more appearances of this team."
  },
  {
    "rating": "5/5",
    "review": "This one surprised me. I didn't expect a marvel movie to be so grounded and character-driven. The performances were wonderful, the effects were practical, directing on point, and the soundtrack is great. The film covers heavy themes with a mix of heart and laughter. By the end of this movie I wanted to see more of this ragtag group. I'm a sucker for lovable misfits."
  },
  {
    "rating": "4/5",
    "review": "Adopting a darker tone than its light-hearted MCU counterparts, Thunderbolts* offers a refreshing departure from the franchise's traditional formula."
  },
  {
    "rating": "1/5",
    "review": "The actors did a solid job with what they were given but honestly the material just didn’t hold up. The last 20 minutes were the only part that actually felt interesting. There was something deeper there, some Carl Jung style exploration of the shadow self. But it came way too late. The rest of the movie, like a full hour and 45 minutes, was just nonstop banter and silliness. No one was playing the real stakes of any situation. It’s like every Marvel character now has to sound like they’re in a Deadpool movie or some Thor Love and Thunder spinoff. Who at Marvel decided that’s the only way these movies can work? It’s exhausting. The thing is, humor can work really well in these films but only when it comes from character and from real emotion. Like with Robert Downey Jr.’s Iron Man. When he made a joke it felt earned. It came from pain or stress or just trying to stay sane in the middle of chaos. But now it’s just quip after quip for no reason and it kills any tension or emotional weight. Bottom line, I left the theater more annoyed than anything. There was potential but most of it was buried under cheap jokes and lazy writing."
  },
  {
    "rating": "4.5/5",
    "review": "I absolutely adored this! This film carries you though a super engaging storyline and is packed with fun action. I laughed and cried throughout watching this band of B-team avengers get together. I have loved some of these characters for years and I am beyond excited to get to know the new ones."
  },
  {
    "rating": "5/5",
    "review": "Filme excelente!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Thunderbolts is truly fantastic. I laughed, cried, cheered, and had a fantastic time. Absolutely LOVED the team dynamic!"
  },
  {
    "rating": "4.5/5",
    "review": "Thunderbolts is an impressive film with a standout cast, especially Florence Pugh, who delivers a deeply emotional performance. The tone of the movie is notably darker compared to other Marvel films, giving it a unique and gritty atmosphere. The story skillfully builds sympathy for these former villains, making the audience truly connect with their journey by the film’s end. Overall, Thunderbolts offers a fresh, compelling take on the superhero genre that resonates on both an emotional and narrative level."
  },
  {
    "rating": "5/5",
    "review": "For longtime Marvel fans and newcomers alike, Thunderbolts offers a refreshing take on the superhero genre. The film stands out with its strong character dynamics and an impressive ability to balance heartfelt sincerity with sharp, well-timed humor. Rather than leaning too heavily in either direction, it allows its characters to shine through genuine emotional moments and light, engaging dialogue. Many reviewers agree that Thunderbolts brings a renewed sense of fun and energy to the Marvel lineup, offering a more enjoyable and memorable experience than some of its recent predecessors. In short, it’s a reminder of what makes Marvel stories resonate—don’t miss it."
  },
  {
    "rating": "4.5/5",
    "review": "A significant shift in tone and quality from many ill-received installments that plagued MCU long after Endgame, Thunderbolts* may still pale compared to pre-Infinity Saga installments but it still serves as a refreshing reversal to quality Marvel flicks."
  },
  {
    "rating": "3/5",
    "review": "Absolutely carried by Florence Pugh's performance, as well as the performances of Julia Louis-Dreyfus and David Harbour. It was a fun watch but nothing special. Much better than most of the boring trash Marvel has been putting out. It was a big smorgasbord of ideas done better elsewhere, giving a product that was a tolerable watch, if not a little boring."
  },
  {
    "rating": "4/5",
    "review": "Finally, an actual movie"
  },
  {
    "rating": "5/5",
    "review": "Very well done and entertaining! I didn't look at my watch even one time!"
  },
  {
    "rating": "2/5",
    "review": "The story lacked details. Bucky Barnes is thrown in here to help pull in fans. The casting was spot on for the characters but from beginning to end we don't get enough backstory/details about them and the entire story seems insignificant once you get to the credits. Overall, the marketing for the movie OVER HYPED it completely by claiming \"Marvel is back\" when that clearly is just a marketing gimmick to lure in viewers. Disappointed."
  },
  {
    "rating": "5/5",
    "review": "Loved it! Great as a classic marvel action movie, with great acting, humor, and plot. But the best part is that it's truly a unique marvel movie in its focus on mental health. Really really liked it."
  },
  {
    "rating": "4/5",
    "review": "Only critique is that it could have used a better soundtrack. I hope Marvel Studios now realizes that a decent story beats CGI/Green screen nonsense all the time."
  },
  {
    "rating": "5/5",
    "review": "Yelena rocks as usual!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Stupid slop that couse brainrot."
  },
  {
    "rating": "5/5",
    "review": "it's a decent coming together of a new team...each member has their own issues but when a situation arises they put that all aside and rise to the occasion"
  },
  {
    "rating": "2/5",
    "review": "Disappointed with the storyline."
  },
  {
    "rating": "5/5",
    "review": "Felt like a classic throwback marvel movie!"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie. It reminds me of the golden age of Marvel in the 2010s. Great writing, great action, well paced, a plot you can get invested in, and thematically relevant to the current day in a good way. Can’t recommend highly enough."
  },
  {
    "rating": "5/5",
    "review": "Great movie! Love the Marvel movies. Funny and dramatic. Must see."
  },
  {
    "rating": "4/5",
    "review": "I liked the comedy. I miss the original Avengers."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie! Looking forward to future movies."
  },
  {
    "rating": "4/5",
    "review": "Tight story, fun to watch and brought back some of the old Marvel magic. We laughed and enjoyed the chemistry of the actors."
  },
  {
    "rating": "5/5",
    "review": "It’s so so good. Bob (played by Lewis Pullman) omg, jaw dropped and locked. The plot is genuinely really good and sets a good stage for the new beginning for the MCU."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed the overall vulnerability message. The actors especially Lewis Pullman and Florence Pugh has great comedic and sweet chemistry."
  },
  {
    "rating": "5/5",
    "review": "Salvan con el poder de la amistad, pero super fundamentado a diferencia de la del capitán américa."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is great even if you arent a Marvel fantheyv they really did a fantastic job covering mental health, trauma, and different coping mechanisms. Throw in some funny one-liners and some action, youve got yourself a really great movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Really good film solid storyline and performances my one gripe 90% of all actors are unemployed why oh why Is Elaine from Seinfeld here? All I see when she's on screen is Elanie."
  },
  {
    "rating": "3/5",
    "review": "Fun & entertaining!! Expectations were set too high I think… so a bit let down."
  },
  {
    "rating": "5/5",
    "review": "A great movie, combining action with a great script/story and excellent acting. I would love to see more like this."
  },
  {
    "rating": "0.5/5",
    "review": "Waste of money! I only saw it because supposedly everyone said it was good. It was a terrible, corny, and cringe movie. Im convinced disney buys audience reviews now too because I dont get how people like this movie. Its another formulaic mcu movie, they have no faith in good writing so they just sprinkle it with corny cringe jokes everywhere"
  },
  {
    "rating": "5/5",
    "review": "not enough Bucky but still great!"
  },
  {
    "rating": "0.5/5",
    "review": "Terrible, corny, and cringe movie. Im convinced disney buys audience reviews now too because I dont get how people like this movie. Its another formulaic mcu money"
  },
  {
    "rating": "4/5",
    "review": "Equal parts action and adventure fast moving and kept my interest throughout"
  },
  {
    "rating": "5/5",
    "review": "It was not at all what I expected, it was so much better."
  },
  {
    "rating": "4/5",
    "review": "Good movie. Not the action packed, special effect extravaganza like some other Marvel movies. I am not a huge Marvel fan but Wyatt Russell's second string Captain America was a great character and I wish they did more with the Red Guardian. Seems like it was a decent origin movie for better sequels to come."
  },
  {
    "rating": "4.5/5",
    "review": "Thunderbolts: una joya oculta en el universo Marvel que merece una oportunidad En tiempos donde Marvel ha experimentado altos y bajos en sus películas y series, Thunderbolts se presenta como un respiro fresco y humano dentro del universo. Esta película no es la típica historia de superhéroes invencibles, sino un relato sobre personajes con cicatrices profundas, que enfrentan sus propias batallas internas. Aquí no verás solo héroes con poderes y trajes espectaculares, sino personas que luchan con sentimientos reales: la soledad, el arrepentimiento y ese vacío que puede consumir hasta al más fuerte. Thunderbolts muestra el lado más humano y complejo de los héroes, aquellos que intentan encontrar sentido y redención en medio de un mundo que parece pedirles que sigan un camino que ni ellos mismos eligieron. Si sientes que el Marvel actual no termina de conectar contigo, dale una oportunidad a esta película. Te sorprenderá cómo logra contar una historia profunda y emotiva, que va más allá de los efectos especiales y la acción, y que puede tocar fibras que no esperabas."
  },
  {
    "rating": "2/5",
    "review": "not good as captain America brave new world"
  },
  {
    "rating": "4.5/5",
    "review": "Peak Marvel honestly. I was skeptical going into it but it was great. If you haven’t seen it go see it."
  },
  {
    "rating": "4/5",
    "review": "Solid and emotionally deep. The climactic finale fight is more inventive than a lot of hero movies -- not as much as Dr. Strange but great to see new stuff happening."
  },
  {
    "rating": "5/5",
    "review": "Marvel does it again! Near perfect movie! A must see in 3D"
  },
  {
    "rating": "3.5/5",
    "review": "Florence Pugh, of course. I don't usually go to Marvel movies. But because Florence was in it, I bit the bullet. Her compelling physicality, timing, and acting carried the movie. I can't imagine how she had the courage to jump off that impossibly high building. Kudos, too, to the actor who played Bob. One thing baffling thing: the contrast between good and evil and how it's portrayed. Very odd. Now you have to see it!"
  },
  {
    "rating": "5/5",
    "review": "Really great! I can’t wait to see where they go from here with so much in the air now. I really loved Florence Pugh performance as yelana this time around her character really got expanded."
  },
  {
    "rating": "5/5",
    "review": "It was mind blowing amazing. I loved it 10 out of 10."
  },
  {
    "rating": "3/5",
    "review": "Marvel is getting played out"
  },
  {
    "rating": "5/5",
    "review": "Must see in Imax!! i’m obsessed with this movie thank u marvel 🥹"
  },
  {
    "rating": "4/5",
    "review": "In the top 5 or 6 for MCU movies post Endgame."
  },
  {
    "rating": "3/5",
    "review": "A good unique take on a superhero movie and it felt fresh, which I appreciated. Would've considered giving it 3 and a half stars but Julia Louis-Dreyfus calls another character \"good girl\" 2 too many times."
  },
  {
    "rating": "5/5",
    "review": "I loved the action & suspense.The actors were all fantastic"
  },
  {
    "rating": "4.5/5",
    "review": "It's a really good movie, I just missed the Sentinel, but other than that it was great."
  },
  {
    "rating": "5/5",
    "review": "Love this movie. It was easy to follow and had a clear message while being funny. Plans to see it again!"
  },
  {
    "rating": "5/5",
    "review": "Felt like an OG avengers movie again"
  },
  {
    "rating": "3/5",
    "review": "Marvel is trying to go into the psyche of their heroes and meddle with the mind which is rather silly but nevertheless an OK watch."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. There were some really touching moments and hilarious ones, too. I was not disappointed other than not seeing Stan Lee in the movie :(. He will be missed."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was a good movie, loved the humor that it brought as well as the action."
  },
  {
    "rating": "0.5/5",
    "review": "It was nothing but noise. It stunk. No plot. No witty banter. It was awful. Noise and explosions."
  },
  {
    "rating": "2.5/5",
    "review": "A little slow for my taste. Didnt keep me quite as engaged as other Marvel movies."
  },
  {
    "rating": "5/5",
    "review": "I loved it!! Feels like a combo of old avengers and guardians"
  },
  {
    "rating": "0.5/5",
    "review": "If toy liked Love & Thunder you will probably love this. I did not. Hoped for more, even after the new Captain America. Goodbye Marvel, you are going nowhere I wish to go"
  },
  {
    "rating": "5/5",
    "review": "Great story line. I really enjoyed the back stories on the characters."
  },
  {
    "rating": "5/5",
    "review": "Depois de Guardiões da Galáxia 3, esse é o melhor filme da Marvel. a abordagem sobre o vilão Vácuo, leva em consideração o problema dos jovens de hoje, a Depressão. Foi sensacional a jogada, espero que a Marvel continue."
  },
  {
    "rating": "3/5",
    "review": "The elevator pitch: Just a movie about a sad boy's depression getting super powers and fighting a few slightly less depressed people, who need to get over their own depression to show the sad boy he can be less depressed. By the end, everyone is medium to severely depressed."
  },
  {
    "rating": "5/5",
    "review": "Great team movie and brings back the Marvel feel. I really enjoyed it and I want to see more. I wanted to see more of the rooms for Ghost, John Walker, and Red Guardian, but I know the movie would have lasted too long. I believe Marvel has found footing for this next phase"
  },
  {
    "rating": "5/5",
    "review": "I thought it was great I’m not the biggest marvel fan but this was one of them movies I would actually praise, it was entertaining and felt like a more darker approach than the standard marvel film."
  },
  {
    "rating": "3.5/5",
    "review": "So begun is there era of cheesy action movies. I don’t feel the Red Guard was given enough action, he (to me) was the mascot of this whole thing. Theme and tropes are cliche but still inspiring!"
  },
  {
    "rating": "4/5",
    "review": "This movie was unexpected. It has a totally different tone than I anticipated. Thats not really a good thing or a bad thing. It just is a thing. A vast majority of the movie worked very well for me. I think it succeeds at what it sets out to be. Without spoiling anything, I feel that I can say the performances in this movie are excellent. There is only one that I had any qualms about. The action is great. There are some good jokes. The visuals are very good. All in all, Marvel did a great job here. I do think it was overhyped for me, which might be why I feel a little let down even as I am giving it 4 stars."
  },
  {
    "rating": "3.5/5",
    "review": "It was OK. I don't believe that it was as good as the previous Marvel movies. I would probably just see it at matinee price."
  },
  {
    "rating": "4/5",
    "review": "Thunderbolts* is the movie that not only gives you great action sequences and funny moments, it goes for your heart. These characters are broken, but they all find each other and like some weird superhero support group, manage to do the one thing that superheroes stopped doing in these films... they save the people. They're not looking to stop some cataclysmic, world ending event or cut the head off of a maniacal villain. Meanwhile dealing with real issues that haven't been touched upon very much (if at all) in these type of films. Trauma, self-harm, abuse, etc. Honestly, I haven't teared up in front of a superhero film since Black Panther. Lewis Pullman steals the show and his chemistry with Florence Pugh is a cinematic chef's kiss. There's laughs where they belong as well, with David Harbour nailing ever bit he was given. There are some things that could've been left out and naturally some things that needed further exploration. Like Julia Louis-Dreyfus who should've played a straight-laced hard case instead of Selina Meyer 2.0 Maybe there's an extended cut that delves more into the experiences of Ghost and Red Guardian, we don't get enough of their backstory. This is due to the fact that you're expected to know already. For the record, I don't care for the connected universe trope. Especially when we have to do our homework to know what's going on. That being said, I've been riding with Marvel from year one, so I know what's going on. Thunderbolts* falls short on a few things but it hits everywhere that truly matters and that's enough for me."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies in the MCU! Sebastian Stan nails Bucky Barnes once again (no surprises here). Florence and David are perfect as Yelena and Red Guardian (again, no surprises). John Walker never did anything wrong, ever! But the big surprise is of course BOB. Lewis Pullman was the perfcet choice for the role (thank god Marvel's first choice drop the project), no other actor could deliver this complex character like he did."
  },
  {
    "rating": "5/5",
    "review": "Great actors and actresses with a great story line. Just enough humor with the action expected from Marvel."
  },
  {
    "rating": "3.5/5",
    "review": "Fun and entertaining. Takes me back to the OG marvel movies."
  },
  {
    "rating": "5/5",
    "review": "Haven't felt this good about MCU .. since Loki season 2"
  },
  {
    "rating": "4.5/5",
    "review": "Thunderbolts* was not what I expected, and I mean that in the best possible way. The writing is exceptionally witty and the actors live up to the accompanying expectations. Additionally, the handling of dark overtones and plot twists are enough to give this branch of the MCU its own distinct character instead of feeling like \"Great Value Avengers.\" Well done."
  },
  {
    "rating": "4/5",
    "review": "Very entertaining good story a little to much humor but overall good movie with good characters"
  },
  {
    "rating": "5/5",
    "review": "This Movie was the best MARVEL film in a long time. If they keep this course, we are in for a lot fun. Loved the lack of villain-shaming. Like in real life: everybody is (sometimes) a villain. I just wish they would take a note from the James Gunn playbook & include some banger music and not that generic composer score stuff."
  },
  {
    "rating": "4/5",
    "review": "*Rough thoughts* 79% - 85% A Pretty good to good movie definitely overrated. It isn’t the greatest Marvel movie ever made. It was cool with ghost coming back that filled in a plot hole she was missing and her character arc was great. The negatives you have the comic book clichés with the city in peril. They disposed one of the characters there was nothing giving to that character. Another cliché that the amnesia it’s like almost in every anime and wolverine has that. Positives character moments you get there, father daughter, dynamic, red guardian and Yelena. creative how they show the flashbacks with Sentries powers to get to see in their heads. The messages what makes a hero, facing trauma, facing your demons. Finding your place in the world. Another negative Walker I don’t get why everyone said they loved him. He’s a supposedly fan favorite. Cinematography in one scene particular when century is in the prison, they have evil Elaine from Seinfeld is talking to him and he had this great visual on this orange lighting. Some landscape shots are really nice. When Valentina is in the building when you see the pillars in the background as a cool shot. The action there’s awesome hand to hand combat fighting. The aesthetic is a grimy look similar to the Boys but a PG-13 version. The definite delight of the film, red guardian, funny and brings energy into the film. Yelena Sarcasm and ghost they double teamed, and took down Walker."
  },
  {
    "rating": "4/5",
    "review": "\"Thunderbolts\" or \"The New Avengers\" is a funny action packed comedy with a couple of good laughs here and there. After the recent tank in box office ratings with the newer Marvel movies it was nice to see a Marvel movie that wasn't too bad. Now is it worth a watch, well that question could be debatable because on one and it's funny and on the other it's a bit depressing, however you will need to watch this movie if you are planning to watch \"Avengers secret wars\". But in my own opinion I found this movie to be a good 4/5 Stars."
  },
  {
    "rating": "5/5",
    "review": "Loved it, the usual battles but had a good storyline also!"
  },
  {
    "rating": "4/5",
    "review": "I think the movie was decent overall. To me the chemistry the characters develop was written well in my opinion. One thing I liked about the movie was that it also had some relatable moments and dialogues. Would watch again."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Loved the actors. Florence Pugh was amazing."
  },
  {
    "rating": "1/5",
    "review": "This movie under-delivered. All the best scenes were in the trailer. I couldn’t tell if this was an action movie, or a campaign for mental health. Walker needs a reality check and maybe a punch in the face, Ghost was indeed a Ghost with her 2.5 lines, Bucky needs to hang up the politics and get a better arm, Bob needs antipsychotics, and Yelena needs a hug, a really long and tight hug. Best character was Red Guardian because of the humor and half the time, it wasn’t even what he said, it was how he said it. Furthermore, the movie felt like an extended promotional advertisement for Fantastic 4. And WHY was the scene of them climbing up that damn wall so long? BORINGGGGGGGGG. That’s what I would call this movie. If this is suppose to be the new avengers, bring me back to 2012. The originals would never allow this."
  },
  {
    "rating": "5/5",
    "review": "Clever, charming, great action."
  },
  {
    "rating": "5/5",
    "review": "LOVED IT! Great staff and great sound and screen. People were a little rude. Wish someone would come in and manage the theatre. Some immature people ruin the movie talking and making jokes trying to be funny. Other than that GREAT MOVIE"
  },
  {
    "rating": "5/5",
    "review": "loved the movie but the experience was 2nd to none"
  },
  {
    "rating": "5/5",
    "review": "Great kickoff to the next fantastic MCU mega-series."
  },
  {
    "rating": "5/5",
    "review": "One of the best movie after end game!"
  },
  {
    "rating": "4.5/5",
    "review": "Es buena eleccin .super lo recomiendo"
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this film. The characters, the story, the action, the heart. Everything just clicks for me with this one."
  },
  {
    "rating": "3/5",
    "review": "Very Funny! I like the action. But the New Nasty Boss Lady should have died in the end, or at least went to Prison for her crimes! ( or been a villain on the run, ei- Lex Luther."
  },
  {
    "rating": "5/5",
    "review": "Best film since Endgame"
  },
  {
    "rating": "5/5",
    "review": "If you enjoy the MCU, and you're a member, you have got to see this movie. It is intense to be sure, but really good. I'm a fan. Stay for the after credit moment. Enjoy!"
  },
  {
    "rating": "5/5",
    "review": "The chemistry among the cast."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed the film with all the dark twist and humor!"
  },
  {
    "rating": "5/5",
    "review": "The movie was awesome!"
  },
  {
    "rating": "4/5",
    "review": "Nice to see a marvel movie not rely on comstant over the top action scenes to be entertaining."
  },
  {
    "rating": "1.5/5",
    "review": "repetitive. louis Dreyfus looked ridiculous in the role. David Harbour was obnoxious and over the top. Florence Pugh must have referenced or tried to be the therapist to Bob for at least 45 minutes of the movie. Just stupid and juvenile."
  },
  {
    "rating": "1.5/5",
    "review": "Feel like I got fooled. The previews looked silly. Popcorn rating very high though so I figured, there must be more to it. Nope just silly. The writing seems like what would happen if you fed chat GPT the marvel universe, and asked it to kick out something adjacent to The Boys combined with Stranger Things. No fault of Jake Schreier’s for directing. The action sequences were cool. The upside down, inception, dream world scenes were pretty cool. Joanna Calo brought the humanized struggle I’m guessing. That was a good touch and a nice departure from superhero land. The rest of the writing was trash. Storyline, dialogue, most everything. Not crazy about the production. They don’t seem to care anymore. Anything Marvel smashes the box office so their quality control standards seem none existent."
  },
  {
    "rating": "4.5/5",
    "review": "Florence Pugh is terrific!! Bob is great!! Marvel put out a good one here."
  },
  {
    "rating": "5/5",
    "review": "Es una gran película que nos hace ver el vacío que todos llevamos dentro y la lucha interna de cada persona por más que ante el mundo aparentemos una felicidad todos luchamos contra algo internamente, e incluso solo necesitamos saber que hay personas con las que podemos contar"
  },
  {
    "rating": "3/5",
    "review": "Thunderbolts is fresh and entertaining. Read my review at http://tonymacklin.net/content.php?cID=1041"
  },
  {
    "rating": "4/5",
    "review": "It was better than I thought it would be. The only thing is the ending was a little anticlimactic."
  },
  {
    "rating": "5/5",
    "review": "I was impressed with how the team wrote this movie and it really impressed me. I wish they had this type of story on some of the phase 4 movies. Worth the hype"
  },
  {
    "rating": "2/5",
    "review": "Had potential, way too many bad jokes and just flat. Bob gets the stars."
  },
  {
    "rating": "4/5",
    "review": "I was surprised by Thunderbolts! Not just a good Marvel film, but a good film period. Great chemistry between the cast and a thoughtful message. Really struck a chord with me. If I have one critique it’s that I could’ve used more time with the cast before the big finale. Other than that, solid stuff."
  },
  {
    "rating": "4/5",
    "review": "Enjoyed the movie - lots of action sequences and entertaining, wasn’t ‘exactly what we expected — still very much seeing! Maybe even a second time, with so much action - certain some was missed!"
  },
  {
    "rating": "4/5",
    "review": "I think this is the best marvel movie after infinity war Avengers, all films except Eternals and Thunderbolt aren’t good films!!"
  },
  {
    "rating": "5/5",
    "review": "I really liked the action and coming together of the team and willingness to put aside their differences and they actually showed emotion and I liked that."
  },
  {
    "rating": "5/5",
    "review": "Me sorprendió!!!, no esperaba que fuera ser tan entretenida👍🏾"
  },
  {
    "rating": "3.5/5",
    "review": "\"Pressured\" to attend this one (\"Thunderbolts*\") by my son's friend and his dad, there certainly wasn't any negativity going in, but more indifference. Yes, I watched Star Wars on the daily during my formidable years, but Marvel never made it on the radar. This said, what a good, family friendly time I had watching the ever so stunning Florence Pugh. . . kick a$$, Julia Louis-Dreyfus notably perform as the #badguy, and David Harbour offer up a sizable chunk of the comedic value of the film. Action aplenty, what some would call a group of \"disposable delinquents,\" we call a fun foot forward of Avengers, best served with popcorn and preferred candy."
  },
  {
    "rating": "4/5",
    "review": "Fun and took a refreshing path for a superhero movie."
  },
  {
    "rating": "5/5",
    "review": "I really like the movie because of the action and the people and this guy name Bob that has like 3 different versions of him and stuff and I really like the girl that turn invisible and I like all the characters my phone is about to die so I wish I can tell you more but I can't so bye😁"
  },
  {
    "rating": "2.5/5",
    "review": "It was good but half way changed over more to mental illness in my opinion"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was trash. This movie has nothing to do with avengers like anything. Garbage."
  },
  {
    "rating": "5/5",
    "review": "Nossa, o filme foi incrível🤩"
  },
  {
    "rating": "4.5/5",
    "review": "This movie reignited the MCU. We’re SO back! Loved the cast’s chemistry, the writing, the cinematography, all of it. Absolutely smashed it!"
  },
  {
    "rating": "5/5",
    "review": "OMG it was such a fun and thrilling movie. I so look forward to seeing where the NEW Avengers go with this. Plus stayed for the very end to see what they had to show and it's going to be a great new series."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie! Marvel is back with The Thunderbolts! Great story, action and humor!"
  },
  {
    "rating": "5/5",
    "review": "Would see over and over again!!!!!!!!!"
  },
  {
    "rating": "4/5",
    "review": "I kept myself from spoilers and it worked. This film was unexpected in so many aspects. I never thought a Marvel could be about depression and mental health and nail it so well. The end was extraordinary and carried so much emotion. The film is well written and the buildup works effortlessly. The cast was great, with a special mention for Florence Pugh and Lewis Pullman. Besides, it had some great scenes, with good staging et good shots, although the longest part of the buildup was more or less the ordinary kind. It had not so many action sequences, but I didn't care and I didn't miss it. Not the best Marvel, but definitely one to remember."
  },
  {
    "rating": "4.5/5",
    "review": "Excellent, very enjoyable movie. Has an interesting take on relating to depression and working through it that actually provides a solid message and helps give the movie more weight. Florence Pugh is great. David Harbour adds a helpful amount of levity and comedy to the movie without going overboard and being distracting."
  },
  {
    "rating": "4/5",
    "review": "Thunderbolts is a compelling film that marks a departure from the cheap comedy typical of its immediate Marvel predecessors. For the first time, it successfully blends high-octane action with a deep exploration of human vulnerability. The narrative unfolds in a way that allows viewers to connect with the characters on a more personal level, revealing their struggles and emotional complexities"
  },
  {
    "rating": "4/5",
    "review": "At last - a Marvel movie I can enjoy again!"
  },
  {
    "rating": "4.5/5",
    "review": "Amazing movie ! This what Marvel should be all about not just action but adding realism to the mix and deep character development! I think the whole purpose for any action movie is to make you forget that it’s just fantasy, you want it to enthrall and captivate you ."
  },
  {
    "rating": "4/5",
    "review": "Great movie fun everyone even if you arent a Marvel fan."
  },
  {
    "rating": "3.5/5",
    "review": "Gostei sim deste filme, mas na real não é tão bom como estava sendo dito, o trailer dava um impressão de absolute cinema, e as avaliações dava impressão de filmaço, mas não é tudo isso não. Mas dentre os últimos filmes da Marvel, com certeza este filme é bom sim. A história e desenvolvimento dos personagens é MT interessante, e quando o filme acaba vc nem percebe então na real é um bom filme, numa escala de 1 a 10 dou 6,5 a 7 E a cena pós crédito, principalmente a última é melhor que o filme em si Mas não acho o melhor após ultimato não, homem aranha e Deadpool são melhores"
  },
  {
    "rating": "5/5",
    "review": "This movie exceeded my expectations! I was pleasantly surprised at how well this movie was directed based on its story, message, characters, and their development. I will not spoil anything, but I will say that after quite a few disappointing Marvel movies and series (with a few exceptions), Thunderbolts*, in my book, should be considered as one of the best Marvel movies of all time! What really cinched the deal for me was Bob. Watch the movie and you'll see what I mean. You should watch it right away! It is 1000% worth it!"
  },
  {
    "rating": "5/5",
    "review": "Love the banter of the characters. This story had a pretty deep meaning and it was great to see a new \"team\". Love that Lewis Pullman used the name \"Bob\" just like Maverick. Not sure if that is on purpose, but I am sure it is."
  },
  {
    "rating": "5/5",
    "review": "You gotta go see this movie!! I didn’t think this movie was gunna be this good but they killed it. When you have incredible acting & good writing, you end up with an absolute masterpiece. This film has brought the MCU back to life. Can’t wait to see future Marvel films with the thunderbolt cast."
  },
  {
    "rating": "4/5",
    "review": "Cons: I'd say there was a bit too much forced humor which took away from scenes that were supposed to be intense. Also, I would have liked to see more from Bucky in this movie, and while Yelena is great, Marvel needs to be more careful about which characters they give the most lime-light to. Just because a big name actor plays a character (Florence Pugh), doesn't mean that character has to be the lead (another great example of this was Emilia Clark's G'iah). It hurts to think about how this movie deprived fans of a Bucky-lead film which is what I think everyone was hoping for to an extent. Unfortunately, I don't think Bucky is going to last much longer in the MCU, and I hardly doubt he'll be in another movie that would give him the chance to play that titular character. Again, while Florence Pugh's Yelena was great, that doesn't mean she has to lead a film in which there is another clear character (Bucky) who should have been the lead and deserved to be at this point. Pros: This is definitely one of the best Marvel movies I have seen in a while. It was heartfelt, emotional, and fun. I even found myself crying at one point which has only every happened to me 3 times before while watching a Marvel movie (Avengers: Endgame, Guardians of the Galaxy Volume 3, and Spider-Man: No Way Home). The action was on point, especially towards the third act. Also, the soundtrack was great."
  },
  {
    "rating": "5/5",
    "review": "Surprising really good and a wild emotional ride!"
  },
  {
    "rating": "4/5",
    "review": "Good cast chemistry. Underdog & loner story with twists!"
  },
  {
    "rating": "2.5/5",
    "review": "The Marvel collection has gone down the drain and evolved with plot points that are thrown against the wall hoping they will stick. They usually provide lackluster plot moving forward. it is mild satire and the story wanders around instead of moving forward. one would hope for solid filmmaking not half assed attempts. the Bob character is the best."
  },
  {
    "rating": "4.5/5",
    "review": "This movie was amazing and I can’t wait for the next one. With the real avengers and not the avengerZ lol"
  },
  {
    "rating": "3/5",
    "review": "Not worth the hype. Decent Marvel movie but Marvel still has to work at finding stronger likeable characters if that want to try and recapture the previous Avengers era. Hopefully Fantastic 4 pushes them more in the right direction."
  },
  {
    "rating": "0.5/5",
    "review": "Sorry They tried but missed the mark. For me needed more information on who each hero was. Plot hard to follow. However i wish the movie well."
  },
  {
    "rating": "5/5",
    "review": "The movie was so relatable and had all the action you would want in a superhero film. It's just like an old marvel film from the end game days but better."
  },
  {
    "rating": "5/5",
    "review": "A good return for Marvel, one of the good ones since Endgame"
  },
  {
    "rating": "4/5",
    "review": "Love Bob and the message in his story. Great movie"
  },
  {
    "rating": "4.5/5",
    "review": "The MCU is back! After several disappointing offerings, Marvel brilliantly figured out how to reboot one of the most engaging cinematic phenomena of all time using secondary characters filled with much of the same doubt about their success that we have had, and drew them into an emotionally compelling and oftentimes humorous narrative."
  },
  {
    "rating": "3/5",
    "review": "A somewhat different style for Marvel, definitely chasing after Suicide Squad. However, much of the humor does not land, and most of the characters lack charisma. Yelena is the dominant character, but is not a very likeable character like her on screen sister had been. The only one with an ounce of likeability is David Harbour's character. Overall it was an \"ok\" movie, but not a great movie."
  },
  {
    "rating": "5/5",
    "review": "red guardian was funny and brought the team together"
  },
  {
    "rating": "5/5",
    "review": "It was a good continuation of the MCU. Cannot wait until next one is released."
  },
  {
    "rating": "4.5/5",
    "review": "Thunderbolts* was just the jolt the MCU needed to give its narrative a heartbeat again. I always enjoy the MCU, and while not all entries can be the best one yet this one leads it all in the right direction. I thoroughly enjoyed almost every moment of this movie. Which is way more then I can say about the previous entry (Brave New World). Nothing here seemed repetitive in story telling and recycled without acknowledgement. Florence Pugh does a fantastic job bringing character and warmth to the what could be cookie cutter material. She digs in without over doing it and delivers her dialogue with great nuance. The rest of the cast is fleshed out beautifully. I was excited to see Wyatt Russell back in the MCU as well as Hannah John-Kamen (Ghost). This unique lineup that was not forced played out beautifully. Some cheeky cliche moments occurred, but you have to sometimes accept that. They weren't bad moments and give you hope for more moments to come. Plus some great nods to previous MCU moments. I appreciated the setting of this back in New York and at the Avengers/Stark/Watchtower. They are leaning into building a history for this site very well! Lewis Pullman has become a new favorite actor of mine and seeing him come into the MCU as the Entry/Void was perfect. The overused trope of Villain within the walls of the story was getting frustrating, but the Sentry story I became very open to. Lewis Pullman may have had a lot to do with that. Not having a formal villain to rid the earth of can often lead to an unsatisfying result (Brave New World) and is best works for Marvel TV shows, not the movies. This time was perfect. It might have been the build up for the future of the MCU and Avengers movies that helped also move this along or inspire greatness, but Ill take it and look very much to seeing this team again. The downfall if you really look at is this is its a repeat of Avengers: Age of Ultron. Just different characters and an updated story. We have our Ultron/Vision arc much repeated here but motives and reasons why things were happening is where things differ. I don't mind this, you don't really notice it unless your like me and really dig into the story. There is only so many reasons for scenarios to exist, its recreating them that becomes the interesting part and Thunderbolts* did so very well. Lastly....ill never get sick of seeing Bucky in the MCU. Sebastian Stan is wonderful and they continue to write him in in such subtly appropriate ways to not exploit his character and for that Im appreciative. Any scenes with Bucky certainly stood out bridging the old and new that creates distinct moments for this long time character of the MCU!"
  },
  {
    "rating": "5/5",
    "review": "Surprised me. Marvel might be coming back"
  },
  {
    "rating": "3.5/5",
    "review": "Totally went in expecting a comedy and was a good bit disappointed. Perhaps I am not a fan of the franchise enough, but this was a highly depressing movie dealing with \"Bob\"'s past trauma's and current feelings of loneliness."
  },
  {
    "rating": "5/5",
    "review": "The best family marvel move ever."
  },
  {
    "rating": "5/5",
    "review": "The MCU is fun again!"
  },
  {
    "rating": "5/5",
    "review": "Funnier than I expected. Frances Pugh has a great story line and gives a fabulous performance. A fun movie!"
  },
  {
    "rating": "5/5",
    "review": "crap title, good movie."
  },
  {
    "rating": "5/5",
    "review": "Great movie with a FANTASTIC ending!"
  },
  {
    "rating": "4/5",
    "review": "The power of friendship will always win! 🤣"
  },
  {
    "rating": "4/5",
    "review": "Very enjoyable from start to finish. Worth seeing in the theater."
  },
  {
    "rating": "5/5",
    "review": "Este es el Marvel que puede hacer las cosas bien, incluso con bajo presupuesto o con personajes no tan conocidos o aclamados"
  },
  {
    "rating": "4.5/5",
    "review": "Generally, a good movie:l. For MCU/super hero flicks, top shelf"
  },
  {
    "rating": "3/5",
    "review": "A more grounded MCU entry, relatively speaking. Carried by performances rather than the story itself trying to tell."
  },
  {
    "rating": "5/5",
    "review": "Incredible story and good action sequences!:-)"
  },
  {
    "rating": "3.5/5",
    "review": "The plot was a bit cringey but it was very funny and I loved it and would definitely recommend it"
  },
  {
    "rating": "4/5",
    "review": "A very fun movie with a creative way of facing the conflict."
  },
  {
    "rating": "4/5",
    "review": "Thunderbolts* may not be everyone’s idea of a good time at the movies, but I appreciated it for doing something (mostly) different and making me feel something I rarely feel about superheroes: compassion.  Like Guardians of the Galaxy Vol. 3, it takes you to emotional places you never thought you’d go in a superhero movie.  Recommended. detroitcineaste"
  },
  {
    "rating": "5/5",
    "review": "May 13 /2025 I just which it and it was the blass and it was funny at the some time nice and my favorite villain is going the be the voild"
  },
  {
    "rating": "5/5",
    "review": "movie is actually pretty good Yelena and Red guardian stole the whole movie the action is good and story is not perfect but is good"
  },
  {
    "rating": "4/5",
    "review": "Huge roles for RG & Yelena. Story was really well thought out and the action is there too. Much like the story of this film, this team shouldnt work but, it really works well."
  },
  {
    "rating": "4/5",
    "review": "Dark and grittier than typical Marvel movies and it worked really well. Ended up liking the characters a lot. Good movie."
  },
  {
    "rating": "5/5",
    "review": "I had no real expectations for the movie. It had a good lineup of excellent actors, but even those type of films can tank. This cast just really seemed to Synch, and pulled out a well done overall movie. I think Florence Pugh creates a persona for Yelena that you just have to like. She was awesome thusfar in Dune and I think will take this character far. Of course, David Harbour pulls off every character he does. Also, like Wyatt Russel's characters and Hanah John-Kamen pulls off Ava excellently. Just great and enjoyable cast and movie."
  },
  {
    "rating": "5/5",
    "review": "I was not keen to see this . As it turns out, there were some slow stretches but the creative avengers team came through brilliantly. Guess were off to alien defense but I hope the internal threats at home are not neglected. Go see it!"
  },
  {
    "rating": "5/5",
    "review": "Thunderbolts* – A Surprisingly Sharp, Gritty, and Grounded Marvel Entry Thunderbolts* might just be the shot of adrenaline the MCU needed. It trades in the world-ending sky beams and multiverse chaos for something grittier, more personal, and refreshingly human. What I loved most is how the film manages to feel *grounded*—while still delivering the action and spectacle you’d expect from a Marvel production. The cast absolutely clicks. The chemistry between these morally grey, damaged characters is electric, and it’s fascinating to watch a team of antiheroes try (and often fail) to work together. It’s not about perfect heroes saving the day—it’s about broken people trying to find redemption in a world that’s already written them off. Every character is given space to shine—no one fades into the background. Whether it's Yelena's sharp wit and emotional complexity, Bucky's inner conflict, or Red Guardian's layered mix of humor and regret, the film nails the ensemble dynamic without ever feeling overcrowded. The tone is darker, yes, but never dull. There’s weight to the decisions, actual consequences to the action, and the tension doesn’t come from magical MacGuffins—but from the characters themselves, their pasts, and their uneasy alliances. It feels like a Marvel movie for grown-ups—without being grim for the sake of it. The action is tight, brutal, and real. There’s a physicality to it that makes it hit harder than most recent MCU entries. It’s not just noise—it’s storytelling through combat, and it works. In short, Thunderbolts* is bold without being loud, emotionally resonant without being melodramatic, and action-packed without losing sight of its characters. It might not be the flashiest Marvel film, but it’s one of the most mature, well-balanced, and compelling ones in recent years. Highly recommended—especially if you’ve been waiting for Marvel to take a risk that *pays off*"
  },
  {
    "rating": "5/5",
    "review": "Thunderbolts* aka *The New Avengers was great. I love the characters, the story, the acting everything is well done! The message of the movie is well done! Marvel yet again showcases how their characters are for everyone and can showcase representation for so many dynamics. The Thunderbolts* characters are representation of everyone that could feel that they've failed in life and have a hard time making a life for themselves. There's some of us that spend a lot of time struggling in life and on the wrong side of where we want to be and sometimes find it extremely hard to get our life together. These are our characters to connect to. My personal favorites are definitely Ghost, Yelena, The Sentry and Bucky The White Wolf. We really need to hear the rest of the MCU learn that codename for Bucky besides the Wakandans because it's a really cool codename and The White Wolf is a really cool character."
  },
  {
    "rating": "3/5",
    "review": "storyline wasn't as good as we thought.."
  },
  {
    "rating": "5/5",
    "review": "This movie was so deep and dark but so relevant and hilarious. Loved it"
  },
  {
    "rating": "5/5",
    "review": "Great movie and soundtracks actually hit hard AF, Bob was god tier as well 10/10🙏😭"
  },
  {
    "rating": "5/5",
    "review": "Finally.. Happy to have you back, MCU."
  },
  {
    "rating": "0.5/5",
    "review": "A Total waste of time this movie doesn't have any character depth or any emotion and makes the movie looks like thor dark world 😭"
  },
  {
    "rating": "5/5",
    "review": "Love the character development, old school MCU humor and action! Keep it going"
  },
  {
    "rating": "5/5",
    "review": "Owwwwwl its ah Pheeenixxxxx 🐦‍🔥. Thanks for this Movie fr cmnig b4ck !"
  },
  {
    "rating": "5/5",
    "review": "they did a good job bringing in the new avengers"
  },
  {
    "rating": "0.5/5",
    "review": "Its kinda boring on the second half and not that much enjoyable and what is the new avengers I don't know I can't even accept these some kind of super soldiers can be the next avengers disappointed and totally trash"
  },
  {
    "rating": "3.5/5",
    "review": "It was okay overhyped by reviews movie fell flat in the end and cast was just so new didn’t have big names but overall a fun movie don’t expect life changing stuff"
  },
  {
    "rating": "0.5/5",
    "review": "So bad. Probably worse than The Eternalswhich up to now had been one of the worst movies I have ever seen."
  },
  {
    "rating": "4/5",
    "review": "Movie was solid, lots of action. Was acted well on all parts. Looking forward to the cast in Future Marvel movies."
  },
  {
    "rating": "5/5",
    "review": "More Bucky please! This was a great comeback movie for Marvel. Between Yelena & Bucky, every scene with them was a winner. Looking forward to watching more of them!"
  },
  {
    "rating": "4/5",
    "review": "The decadent and mediocre state of the MCU is no secret and I have seen this particular movie described a \"breath of fresh air\" among its other formulaic flicks. I agree completely. This movie actually has a heart and soul, meaning, great performances, and relatable characters. The story's structure could have been a bit better, some sequences feel mildly rushed and some characters are unfortunately left on the backburner compared to others, but it was still convincing enough and made sense in the end. I'd love to see more of our ragtag team of misfits in the future!"
  },
  {
    "rating": "4/5",
    "review": "One of the best releases from Marvel in a long time. Great fights, attempt at character development and the blackest black."
  },
  {
    "rating": "5/5",
    "review": "Such a funny and action packed movie."
  },
  {
    "rating": "5/5",
    "review": "great movie, funny tons of action."
  },
  {
    "rating": "5/5",
    "review": "Amazing! So fun and loved the emotional theme!"
  },
  {
    "rating": "5/5",
    "review": "movie was entertaining from beginning to end. Flo Peugh really shown through as a leading superhero. Other cast members were great but Flo appeared to be the glue that held them all together. Action fight scenes were classic and the cgi were pretty stellar. The portrayal of Bob's mental health and drug dependency made for a good subplot."
  },
  {
    "rating": "5/5",
    "review": "Great to have Marvel back - TRULY BACK! Cant wait for the follow up movies!"
  },
  {
    "rating": "5/5",
    "review": "Phase 4s first banger"
  },
  {
    "rating": "0.5/5",
    "review": "bad action scenes, barely any action, barely any superpowers shown, horrible plot"
  },
  {
    "rating": "5/5",
    "review": "This was the most relatable MCU (superhero) movies I've seen... The while idea of the villain being the darkness that we all fight to some extent at various degrees... The talk about loneliness and pointlessness, and the darkness there tearing us down... The silhouette could be different, but that void and darkness is familiar. Having had coworkers lose the battle against their own Void because the person/people who could have been 'the people that come' in time of need, were too busy. This movie is a reminder that we could all be that new avenger to someone in need."
  },
  {
    "rating": "5/5",
    "review": "It was so refreshing from Marvel. Right amount of action and right amount of laughter."
  },
  {
    "rating": "5/5",
    "review": "Interesting storyline and loved Yelena's dad. He was too funny."
  },
  {
    "rating": "4/5",
    "review": "Very good movie. Definitely worth seeing. One of the best MCU projects since End Game (though the bar is low for the most part). Funny and at times tugs at the heart."
  },
  {
    "rating": "4/5",
    "review": "Marvel is back with the best movie in a while. Heavier themes like loneliness, depression and self-doubt make it less kid-friendly, but adults can relate to the themes and will be entertained by the action and laughs."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie. Very engaging characters and their relationships/interactions, great acting. Excellent action sequences, and the story will really make you feel things. Will watch again"
  },
  {
    "rating": "1.5/5",
    "review": "Marvel’s did not deliver on this one, only reason why I gave them 2 stars is because they had me in the 1st half. One of the reporters should have asked which one of them is responsible for making them face their fears, but instead they all got a round of applause after making everyone go through such traumatic event, instead they were introduced as the new avengers in the end I don’t get it."
  },
  {
    "rating": "5/5",
    "review": "Great Marvel movie not as much action as expected but good story."
  },
  {
    "rating": "4/5",
    "review": "Very fun - liked background stories- great action scenes. Very good script"
  },
  {
    "rating": "5/5",
    "review": "Amazing story, characters, actors. Everything about this movie was wonderful and is a great starting point for what is to come in the Marvel Universe."
  },
  {
    "rating": "3/5",
    "review": "A fun but ultimately tired retread of MCU mainstays, Thunderbolts is an entertaining but ultimately unremarkable experience at the theater. When I went to see this movie, I wasn’t waiting for the next Avengers or Iron Man. My expectations were low, and I really just wanted to have a fun time seeing bad guys get beat up. I certainly had those expectations met, but I can’t help but want more. The themes of trauma and facing depression are appreciated, but the journey of Bob as century along this road seems underdeveloped and rushed at the expense of action set pieces that, while admittedly fun, are derivative of so many Marvel action set pieces that we’ve seen before. I liked this movie. It was a good watch. However, if I likely will never watch it again, only because there are many MCU films that do what this movie does, but better."
  },
  {
    "rating": "4/5",
    "review": "Fan of the movie /series franchise, but don’t read the comics. I have to see which series on Disney+ or movie I missed about the Ghost character. Getting a little hard to keep up., but I like these characters and the actor’s portraying them . Loads of humor in this one, so very entertaining."
  },
  {
    "rating": "5/5",
    "review": "I absolutely enjoyed all the actors and actress that were involved in this movie. I absolutely adore Florence Pugh and her movies. Everyone did a fantastic job!!"
  },
  {
    "rating": "5/5",
    "review": "Enjoyed the action.Always a big fan of the Avengers"
  },
  {
    "rating": "5/5",
    "review": "Nothing like a Great Superhero Movie👏🏿👏🏿👏🏿"
  },
  {
    "rating": "0.5/5",
    "review": "Waste of my Money Terrible movie"
  },
  {
    "rating": "3/5",
    "review": "Solid movie even if it didn't have an epic action scene that brought it all together, solid emotional pay off at least."
  },
  {
    "rating": "3/5",
    "review": "Mental health soap opera, not the action flick I expected."
  },
  {
    "rating": "5/5",
    "review": "It’s a true Marvel movie to enjoy"
  },
  {
    "rating": "4/5",
    "review": "I wasn't sure what to expect when I went to see the Thunderbolts since the last Marvel film I liked was Guardians of the Galaxy 3. I was pleasantly surprised by how much I enjoyed the movie, perhaps I enjoyed it because I wasn't familiar with the source material. Thunderbolts is a fun way to spend a few hours."
  },
  {
    "rating": "2.5/5",
    "review": "Very unusual story line. Hard to really understand what was going on sometimes."
  },
  {
    "rating": "5/5",
    "review": "This movie was a great movie, but it dragged in some spots. It was a little too loud, but it’s OK if there was a lot more people than three people in the theater."
  },
  {
    "rating": "5/5",
    "review": "A amazing movie. They did a great job with Yelena’s character, especially when she helps bob."
  },
  {
    "rating": "5/5",
    "review": "Brilliant Marvel Cinematic Universe script and lovable characters."
  },
  {
    "rating": "5/5",
    "review": "The best Marvel film since GUARDIANS 3. Really awesome movie!"
  },
  {
    "rating": "4.5/5",
    "review": "Thunderbolts* was a refreshing take on the superhero genre that felt surprisingly grounded. I really enjoyed the psychological depth and was caught off guard by how funny it was. The character interactions were a highlight — they felt real and added a lot to the story. I also appreciated that the cinematography supported the narrative without distracting from it. I want to see more movies like this — in fact, I liked it so much that I made an account just to rate and review it."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie. This is a must watch Marvel is so back 🔥"
  },
  {
    "rating": "4/5",
    "review": "Fun movie. Best think marvel has put out in years."
  },
  {
    "rating": "4/5",
    "review": "Great movie but not a fan of the ending."
  },
  {
    "rating": "4.5/5",
    "review": "One of the better Marvel movies as of late and very much worth seeing in a theater. Pace and most of the characters are great. I'd definitely recommend this movie!"
  },
  {
    "rating": "5/5",
    "review": "Ame y me recordó lo que era Marvel antes, pero el plus fue el tema de salud mental y continuar el camino de la vida. Entretenida, efectos, fotos y personajes bien desarrollados ✨"
  },
  {
    "rating": "5/5",
    "review": "If you’re looking for movie night fun then this film has it all: a bodacious bleach blonde , a rambunctious Russian, a meth head that is just there, the power of friendship, and poop."
  },
  {
    "rating": "3.5/5",
    "review": "Good message about believing in yourself and working with others. Lots os gratuitous violence."
  },
  {
    "rating": "3.5/5",
    "review": "The action was tops as was the comedic exchanges between the actors / actresses. The only thing to dislike? The extended dynamic of the depressed dark inhibitions of a person and providing them a \"koum-by-yah\" moment to bring them back from the brink. I could have done without that."
  },
  {
    "rating": "4.5/5",
    "review": "Who else but Marvel could create an insightful and compelling Super Hero movie about depression and still bring the fun. Florence's Yelena has become essential to the MCU and Pullman's Bob is a refreshing new character. Each character gets its due (save one: which is where the 1/2 star comes in.) Thirty-six movies and counting! The MCU delivers for its fans once again."
  }
]