{
  "movie_name": "Transformers: The Last Knight",
  "reviews": [
    {
      "rating": "5/5",
      "review": "AH QUAL É ESSE FILME FOI LINDO CARAMBA EU QUERO A CONTINUAÇÃO!"
    },
    {
      "rating": "2/5",
      "review": "Great Action but Plot is one of the worst in Hollywood"
    },
    {
      "rating": "4/5",
      "review": "Amazing movie! Its a real Micheal Bay. Its sad that they dont make a Sequel."
    },
    {
      "rating": "3/5",
      "review": "Idk just like why ig. It was a lot better the second time but still not that good 7.4/10"
    },
    {
      "rating": "5/5",
      "review": "The best transformers film. Loved the first two and the last one, but this is by far my favourite. Many good laughs, nice historical links, and an amazing soundtrack. Enough to forgive any minor cringe moments."
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst movies in history! Michael Bay and Marky Wahlberg pretty much just ruined this once beloved franchise."
    },
    {
      "rating": "1.5/5",
      "review": "Transformers: The Last Knight is a complete disaster of a movie. The plot is an incoherent mess, jumping from King Arthur’s time to modern-day chaos without any real logic. Optimus Prime, the face of the franchise, is barely in the movie, and when he does show up, he’s brainwashed for most of it. The dialogue is cringeworthy, the humor feels forced, and the action—while visually impressive—is just a loud, CGI-filled blur with no real weight. Instead of an exciting sci-fi adventure, we get a bloated, overlong film that cares more about explosions than storytelling. It’s no surprise this movie has one of the worst scores in the franchise"
    },
    {
      "rating": "1.5/5",
      "review": "they only good parts are the fights and the robots antegenist underweliming megatron great but wish was the main antegenist but geat cgi at least worst transformers movie and a disipontment"
    },
    {
      "rating": "1/5",
      "review": "The only good thing about this movie are the robots, but even still the plot is not consistent. In the 1st movie they say the robots JUST arrived on earth, but in this movie they say they've been on earth for thousands for years?? Gotta love the consistency... also, pardon the bias but, cade was soooooo annoying, the part with nemesis prime and bumblebee fighting? Cade get out of the way, you're doing nothing other than shouting nonsense, bumblebee was able to bring prime back on his own. Anyways, wouldn't honestly recommend this movie unless you're insane and just like seeing robots"
    },
    {
      "rating": "3.5/5",
      "review": "I feel like the writing could’ve been better, they could’ve focus more on how the comics books was. And took some note from the animation.they killed off every big name autobot, then try to make a new story of transformer m. But other than that the action in this movie is amazing. Classic Micheal bay movie,classic transformer fights love it. But the movie story line was completely all over the place. After transformers 3 they should’ve kept the same characters and brung out the biggest threat ever which is unicron.its like Micheal bay didnt know what story to give us so he mashed up a couple said F it. Because how do we go from Old fashioned transformers to being samurai’s then to being knights ?? And bumble bee didn’t come to earth til the 80s apparently so how was he fighting in WW2 with the American army 😂"
    },
    {
      "rating": "0.5/5",
      "review": "If you have watched all of Michael Bay's Transformers movies and have eagerly watched this one, I ask, do you really have nothing better to do with your life?"
    },
    {
      "rating": "0.5/5",
      "review": "This movie Have a lot of good Ideas but It does nothing with them This movie is lazy and Michael bay He did not try with this movie It's like that he just gave up after age of extinction"
    },
    {
      "rating": "5/5",
      "review": "Some may say that this was the film that might of ruined the transformers franchise or completely messed up the timeline of the previous events, but personally I absolutely love this film and the entirety of the transformer films the fight scenes are always amazingly animated and the light comedy that the film adds is hilarious. I understand that when watching the film it may seem like everything is going too quick but the film was meant to be at least a few years after the last one which is why a lot has changed but to me everything aligns perfectly from where it ended off. This is my personal opinion but I think this film will always be one of my favourites and worth watching and deserves more than 3 and a half stars, so please give this film a chance !!!"
    },
    {
      "rating": "0.5/5",
      "review": "This is the worst movie I ever watched as a kid and my number worst of all time"
    },
    {
      "rating": "2/5",
      "review": "Es muy mala y no es como la primera"
    },
    {
      "rating": "5/5",
      "review": "Good Movie!!! Recommended!!! A+ 🍿🎥🍿"
    },
    {
      "rating": "1.5/5",
      "review": "Grossly shot, messy plot and all over the place. The weakest installment of the franchise."
    },
    {
      "rating": "0.5/5",
      "review": "Nope, why did they DO THIS"
    },
    {
      "rating": "5/5",
      "review": "Eu minha sincera opinião eu gostei do filme."
    },
    {
      "rating": "2/5",
      "review": "'Transformers: The Last Knight' is normal service resumed. I shockingly loved watching the prior 'Transformers: Age of Extinction', no idea how but I truly did. This sequel, however, is more akin to those other movies in the franchise, it's minutely better than - but still as bad as - series worst 'Transformers: Dark of the Moon'. It's another entry that lasts for just short of 150 minutes, which is again too long. You do have to respect how much the filmmakers fit into such long run times though, like (bar last time) it's mostly all underwhelming but you can't exactly say there are any proper lull moments in there. The whole English knights construction of a plot here just went through one ear and out the other, admittedly these flicks are nonsensical as it is so I guess this overly entwined plot does feel right at home. On the cast, Mark Wahlberg isn't as fun, though I did mildly enjoy Anthony Hopkins. I still don't get truly annoyed by these movies, even though I properly should. I think it's because there is an essence of the flat-out action that I can find enjoyment in, so things never truly get mind-numbingly dull. With that said, they are most certainly disappointing films (usually)."
    },
    {
      "rating": "0.5/5",
      "review": "The Worst Movie of Transformers"
    },
    {
      "rating": "5/5",
      "review": "Nice English movie which shapes history a little more a bit of comedy made it better and I loved the appearance of Mark Wahlberg and Anthony Hopkins"
    },
    {
      "rating": "3/5",
      "review": "Although I can’t say that I wholeheartedly enjoyed this movie, it did do way better with me than its predecessor. This movie is a mess as well, but it is at least fun in the way it does it, kind of like the first three. The humor is on-point, the visuals are much better again, the music isn’t half-bad, and the feel of the movie returns to its roots. It is not anything groundbreaking, of course, but it does get back into that feeling the first few movies had, and I respect it for that. However, the movie is quite boring at the same time, and barely gets anywhere until the second act. But Mark Wahlberg is good in this one, Anthony Hopkins is absolutely great as usual, and I liked the robot butler, so not all is bad in this one."
    },
    {
      "rating": "1.5/5",
      "review": "This is probably my least favorite Transformers movie (that's right, even worse than Revenge of the Fallen) and this was the only Transformers movie I hadn't seen yet. Whose decision was it to make the Decepticons come across as comedic and foolish toward the beginning?? They're supposed to be the serious bad guys that are intimidating! Where did Megatron come from out of the blue again?? Why is he still around?? Plus, connecting the transformers to human history and making them exist for hundreds of years of it beforehand barely worked at all compared to the simple and more grounded plot of the original installment, even the 2 movies after that. Sure Optimus Prime had some cool moments and some of the apocalyptic stuff portrayed at the end was somewhat neat, plus the beautiful and sexy Laura Haddock, but I'm talking about very small things/small moments here. Plus that twist mid credits ending that made me roll my eyes? PLEASE!"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is just plain bad, the whole plot is so bad, and don't get me started on that thing in the plot where the transformers have been in every event in human history scene because that just makes the whole Bayverse timeline a mess, the only thing that is saving this movie is the Robot action scenes and the soundtrack composed by Steve Jablonsky, overall this movie is such a huge mess"
    },
    {
      "rating": "0.5/5",
      "review": "The worst Transformers movie"
    },
    {
      "rating": "1.5/5",
      "review": "Damn, this movie is really bad, its too long, but atleast has fun moments"
    },
    {
      "rating": "1/5",
      "review": "waste of time not worth the watch since they can't stay consintan"
    },
    {
      "rating": "1/5",
      "review": "One of the worst films I've ever seen. A case study in how to screw up a film. So long and disjointed with rambling nonsensical dialogue. Totally bored watching this. If I wasn't watching at home, I would have walked out. Its a criminal waste of time."
    },
    {
      "rating": "1/5",
      "review": "Overlong and boring. Michael Bay and Paramount should've just stopped at 3 films but instead we got this and the equally terrible fourth film which have hurt a lot of this franchise."
    },
    {
      "rating": "2/5",
      "review": "There are so many great actors in this movie and yet it fails to deliver anything interesting. The concept of the Last Knight is interesting in itself but instead the story is all over the place and gets boring fast."
    },
    {
      "rating": "1.5/5",
      "review": "This movie is garbage. The story doesn't make any sense. Lacks continuation from previous movies."
    },
    {
      "rating": "1/5",
      "review": "One of the worst fucking movies i've seen in my life its soo FUCKING STALE AND DRY"
    },
    {
      "rating": "1/5",
      "review": "Managed about 10 minutes of this drivel, which is about five minutes more than any other Transformers film I've watched. No idea what was happening. The story was nonsense, the visuals were so frenetic it's pointless trying to keep up. Absolutely total crap"
    },
    {
      "rating": "4.5/5",
      "review": "\"Transformers: The Last Knight\" is a film that attempts to expand the already vast Transformers universe but ends up getting lost in its own ambition. The movie starts off with a sense of mystery and grandeur, delving into the ancient history and mythology that ties the Transformers to Earth. The visuals, as always, are a major highlight. The detailed renderings of the Transformers, whether it's the familiar Optimus Prime or the new and menacing villains, are a sight to behold. The battle scenes are large-scale and filled with explosive action. Cities are destroyed, and the Transformers clash with each other in a display of raw power and advanced weaponry. The special effects team has done an excellent job in creating a believable world where these giant robots coexist with humans. However, the story is where the film stumbles. It is overly complex and convoluted, making it difficult for the audience to follow. There are too many plot threads that seem to be thrown in without proper resolution. The connection between the past and the present is muddled, and the attempts to introduce new elements like the Transformers' role in Arthurian legend feel forced and out of place. The character development is also lacking. The human characters, such as the lead played by Mark Wahlberg, seem to be going through the motions without any real growth or depth. Their relationships with the Transformers are not well-defined, and it's hard to feel any emotional connection or investment in their fates. The film also suffers from pacing issues. There are long stretches of exposition that slow down the momentum of the action, and then sudden bursts of intense battles that feel disjointed. The dialogue is often cheesy and filled with one-liners that don't add much to the overall narrative. Moreover, the movie tries to be both a fun action blockbuster and a profound exploration of themes like sacrifice and the meaning of heroism, but it fails to strike a balance. It ends up being neither a satisfying character-driven drama nor a straightforward, exciting action film. In conclusion, \"Transformers: The Last Knight\" has the potential to be a great addition to the franchise with its impressive visuals and ambitious scope. But its overly complicated story, underdeveloped characters, and pacing problems prevent it from reaching its full potential. It leaves the audience with a sense of confusion and disappointment, as it fails to deliver a coherent and engaging cinematic experience. While it may still have some moments of entertainment for die-hard Transformers fans who are simply looking for more giant robot battles, it falls short of being a memorable and well-crafted film that can appeal to a wider audience. I usually use these two sites for more free movies and short dramas.If you have a better website, please recommend it to me. Thank you https://omnishort.com/？utm_source=rottentomatoes https://nightgod.tv/？utm_source=rottentomatoes"
    },
    {
      "rating": "5/5",
      "review": "Muy buena la película pero la gente se queja de todo"
    },
    {
      "rating": "0.5/5",
      "review": "literally feels like clickbait. everything about it makes no sense and the cast seem to have no clue what is going on either, substituting overacting and exclamation for any kind of understanding of what is physically around them or what is going on"
    },
    {
      "rating": "5/5",
      "review": "I love this movie.. definitely way better than Age of Extinction and the rest of the sequels. This movie portrayed a whole new atmosphere and understanding between the Autobot's and Deceptions… Seeing how earth once trusted and betrayed the Autobot’s, but soon relying on their help to save Earth once again, we can never lose our love and respect for them, as they engage in badass but yet emotional battles that get us jumping out of our seats. The Transformer series has been one of the best franchises i’ve watched, and this movie has definitely been the CLIMAX of the whole thing. What bothers me about ‘critics’ is that they judge on the quality of the movie, but never understand the value and depth it brings to the audience. Enjoy the movie."
    },
    {
      "rating": "1/5",
      "review": "I can't even explain how bad this movie is. Again way too long. The acting is again very bad. It's so overplotted and you can't tell where the story's going. But once again the cgi is eye widening and the action is entertaining."
    },
    {
      "rating": "5/5",
      "review": "This movie is the best of the Transformer saga. Full or history and absolute outstanding effects and cast."
    },
    {
      "rating": "3.5/5",
      "review": "Just like the last one it's too long of a movie but still worth watching. The fight between Optimus and Bee is worth watching. Tim Treakle"
    },
    {
      "rating": "5/5",
      "review": "Amazing movie, great narrative and story"
    },
    {
      "rating": "5/5",
      "review": "Nice movie, i love it"
    },
    {
      "rating": "1.5/5",
      "review": "Transformers The Last Knight is bad.Very bad in fact.The characters are superficial and remain underdeveloped and get on your nerves.The action is poorly edited and confusing.The final battle is disappointing.The movie breaks the rules it set up in the first 4 movies.The movie is really boring and that's no lie but the first time i saw the movie with my brother he fell asleep after almost an hour.Quintessa is no threat at as a villian and they really wasted Anthony Hopkins just so he could poke out exposition.The only positive thing about this movie is that the CGI which as always looks very good and BumbleBee works a bit better than in the fourth movie and Megatron has a cool design.Transformers The Last Knight is a disaster.The absolute low point of the franchise.I hate this movie and i will never see it again"
    },
    {
      "rating": "3/5",
      "review": "Definitely some unfinished moments in the film, but if you can look past them you can actually have a good time."
    },
    {
      "rating": "3.5/5",
      "review": "Direção: Bom Atuação: Ok Roteiro: Ok Caracterização: Bom Soundtrack: Ok"
    },
    {
      "rating": "2/5",
      "review": "Optimus as a villain was an incredible concept. Only problem is he is barely in the movie, and all Bumblebee does to make him good again is say “it’s me, Bumblebee.” An absolute waste of potential. 3.7/10"
    },
    {
      "rating": "1.5/5",
      "review": "I found it weak from the first time I saw it"
    },
    {
      "rating": "4/5",
      "review": "Hurrah! A film in the franchise (aside from the first), finally delivering the goods. This has all the elements in harmony, with a good story holding it together. The casting is a real pleasure, with a script that supports such talent. Could do with being shorter, to give it more focus in places, but it is good"
    },
    {
      "rating": "1/5",
      "review": "This final Michael Bay's transformers is absolutely the worst and gets way worst it's the aspect ratio in IMAX it's really annoying and it makes my eyes hurts and I know Michael Bay wants to be like Christopher Nolan and James Cameron to filmed on IMAX and changed the aspect ratio but this this is the bad idea to filmed multiple ratios in IMAX you only have to change only one aspect ratio not 3 or 4 ratio only one and the story still as terrible than the 4th transformers."
    },
    {
      "rating": "5/5",
      "review": "As good as the others. Which I'm somewhat biased as a weird transformers fan who loves transformers too much to not like these movies"
    },
    {
      "rating": "3/5",
      "review": "Not the best of the Transformer series and not the greatest plot."
    },
    {
      "rating": "0.5/5",
      "review": "We do not talk about this film"
    },
    {
      "rating": "0.5/5",
      "review": "This movie SUCKS! A complete waste of time."
    },
    {
      "rating": "2.5/5",
      "review": "One of the most forgettable movies ever put to screen. Forgettable Characters, Forgettable Action, and very forgettable expository story telling. You can tell Michael Bay didn't care, so why should we? F"
    },
    {
      "rating": "1/5",
      "review": "This movie is a complete waste of time ⏲️ and money 💰, and a big crate of rotten tomatoes 🍅."
    },
    {
      "rating": "5/5",
      "review": "Transformers: The Last Knight is an epic thrill ride that masterfully blends action, mythology, and stunning visuals. Michael Bay delivers a visual spectacle with jaw-dropping effects and intense battle scenes that push the boundaries of blockbuster filmmaking. The film’s bold narrative, weaving together history and sci-fi, adds depth to the franchise, while Mark Wahlberg and Anthony Hopkins bring energy and charm to their roles. Critics may call it chaotic, but that’s the beauty of it—this movie is a celebration of cinematic excess, making it an unforgettable experience. The negative reviews are missing the point and are overly exaggerated. Transformers: The Last Knight is pure entertainment at its finest!"
    },
    {
      "rating": "4/5",
      "review": "Finally a better transformers movie. I really enjoyed this one. I feel like this was a turn in the right direction for the franchise."
    },
    {
      "rating": "5/5",
      "review": "I have always enjoyed all of these movies for what they are and I think over time these movies will find the right audience and people that will like them for what they are"
    },
    {
      "rating": "3.5/5",
      "review": "I stopped going to see Transformers at the theaters after the 3rd movie. I refused to see this monolithic, nonsensical movie in the theaters when it was released. Last night I caught the whole movie on YouTube. If one accepts the silly, out-of-left-field, mythic fantasy ill-woven into the story and the ridiculousness of the entire premise, then the movie is fairly entertaining. Once one accepts the absurdity of the whole plotline, then it's easier to watch the movie. Still not a good movie, but much better than Rise of the Beasts, which was an utter mess."
    },
    {
      "rating": "3.5/5",
      "review": "It’s okay i guess….."
    },
    {
      "rating": "5/5",
      "review": "The Last Directed By Michael Bay In Transformers Movie this Time!"
    },
    {
      "rating": "2/5",
      "review": "This movie is only worth watching if you like Transformers or Anthony Hopkins. I like both so I like this movie, but it's a complete mess."
    },
    {
      "rating": "5/5",
      "review": "I'm a huge fan of the movie."
    },
    {
      "rating": "0.5/5",
      "review": "Al director se le acabaron las ideas la historia no tiene casi sentido me u viera gustado que Optimus Prune tuviera más tiempo en pantalla"
    },
    {
      "rating": "0.5/5",
      "review": "Oh no. What type of film is this?"
    },
    {
      "rating": "1.5/5",
      "review": "Wow, this movie is bad. 2.4/10."
    },
    {
      "rating": "0.5/5",
      "review": "Horrible secuela los productores y el director Michael Bay ya no querían continuar con esta saga todo es feo lo único bueno es la pelea entre Optimus y Bumblebee y el soundtrack del final."
    },
    {
      "rating": "5/5",
      "review": "The Fifth Film, The Dinobots returned, Alien Robot Dragon, And The cast of Dark Of the Moon, Also There's Scene Revenge of The Fallen, Dark of the Moon, And Age of Extinction"
    },
    {
      "rating": "1/5",
      "review": "what even is this movie? this is a cardinal sin for the fan base mark Wahlberg still killed it as cade but optimus was done so dirty throughout the whole movie"
    },
    {
      "rating": "2/5",
      "review": "I don't really have any words to say exactly it's just bad, probably my least favorite out of all transformers movies"
    },
    {
      "rating": "1.5/5",
      "review": "Cash grab and painful to watch. Makes you wonder why the franchise went this direction?"
    },
    {
      "rating": "1/5",
      "review": "When I finished this movie. I stared at the empty tv. And sighed. It was a sigh of pain, and exhaustion. The Micheal transformers franchise started on fire. And then the fire just died. This movie isn't so bad it's good. It's just so bad. And that's all I'll say about this movie."
    },
    {
      "rating": "0.5/5",
      "review": "A poor movie compared to the previous movies."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie, Michael Bay killed it! Don't understand all the hate for this movie, made me shed tears at the end. I will always love you Michael Bay!"
    },
    {
      "rating": "4/5",
      "review": "Really Enjoyable! Vivian is so Gorgeous. Mark Walbherg with his over the top acting is good as usual and the CGI is amazing. the fight choreography is amazing even though it was short-lived, Nemesis Prime was Cool and the Design. My Only Gripe with this movie is that the King Arthur/Merlin Stuff I Don't really care about and Quintessa u don't even care for. Also the mid credits scene didn't really make sense as it obviously led to nothing. Anthony Hopkins' Character's Death was so funny! Overall this movie is so underrated and overhated."
    },
    {
      "rating": "3/5",
      "review": "Her hee. If you went to this movie to try to find a coherent plot, you deserve what you got. If you went to this movie to watch things blow up continually and loudly, you deserve what you got."
    },
    {
      "rating": "5/5",
      "review": "Although I love them all this is possibly the best Transformers movie. Incredible mixture of genres, imaginative storyline, and enormous special effects. Michael Bay swung for the fences with this one. It’s deeply artistic and makes a bold statement for a Hollywood blockbuster."
    },
    {
      "rating": "3.5/5",
      "review": "Hate on me all you want, but I think this movie is alright, the story is a bit weird, cogman is basically if a child and a adult were combined, and nitro zeus is one of the best characters."
    },
    {
      "rating": "2/5",
      "review": "This movies storyline sucked…But it was entertaining, and the special effects were cool. It was pure entertainment, nothing more."
    },
    {
      "rating": "1.5/5",
      "review": "I thought it will be a good movie but i prefer the 2023 transformers movie. sorry guys."
    },
    {
      "rating": "3/5",
      "review": "In my opinion it isn't as bad as reviews say, characters and plot where good. But everything was happening too fast and it was starting to get confusing. CGI is not bad. I wished thus movie focused nore on prime, not care or the other autobots."
    },
    {
      "rating": "5/5",
      "review": "I honestly love it i know people say it was bad but i like it"
    },
    {
      "rating": "4/5",
      "review": "Good................"
    },
    {
      "rating": "1/5",
      "review": "WTF was that that wasn't transformers what the hell we were completely false advertised and that really sucks for a transformers fan like myself glad the next 2 films were good but damnit this film was a complete misfire for paramount and transformers in general don't watch it 2/10"
    },
    {
      "rating": "5/5",
      "review": "Hello! I'd like to review this movie. I loved it very much because of some scenes such as when they introduced the character such as Onslaught (who needs a bigger door). Another thing I absolutely loved was the fact that Bumblebee somehow so randomly got his voice back and that made Optimus Prime not violently epicly awesomenessly murder Bumblebee into shreds. I also love the scene where Dreadbot said \"I am dreadbot\"!!!!!!!!"
    },
    {
      "rating": "2/5",
      "review": "Pretty Awful, do not recommend.💀😬"
    },
    {
      "rating": "0.5/5",
      "review": "I felt so disconnected with this movie. The movie itself felt this way and I felt detached watching it. Having not seen the previous films for a while, maybe that was part of it. But I felt like I was dumped in an already started film and it also left with an open ended finale. And what I saw just felt like a waste of time even thought monumental things were happening to the world. I didn't like how the scenes jumped around in a disconnected, unfinished way. There was a lot of backstory of ancient history with the Transformers on Earth that was just a bunch rushed exposition. It didn't feel like there was that much connection with the Autobots and the human characters this time around. One character was introduced then pretty much out of the picture for a large chunk. (Which was fine with me because I wasn't that excited about her, it was just strange.) I will say that what I did like was that the fighting scenes of the robots were pretty clear. None of this shaky cam where you can't even tell what you're looking at. There was some cool slow motion shots with that. Strangely enough the moment in the film that I enjoyed the most was seeing Optimus and Bee driving out of disaster in truck/car form. Anyway I just didn't enjoy this one."
    },
    {
      "rating": "2.5/5",
      "review": "the worst transformers movie ever, i am an hardcore transformers fan but this is a nightmare to watch, it doesn't feel like a transformers movie most of the time and the villain is horrible, the only good things were the nemesis prime and bumblebee battle, every scene where megatron is in"
    },
    {
      "rating": "2.5/5",
      "review": "I went in the film thinking that Michael Bay was gonna go out with a bang instead barely nobody was in the theatre. The enjoyment I had with the first four films was NO LONGER THERE. this wasn't just labeled as The Final Chapter of Bay's Transformers, Bay's Transformers delivered a boring killing blow."
    },
    {
      "rating": "1/5",
      "review": "Worst cgi, worst story, and worst movie of the entire series"
    },
    {
      "rating": "0.5/5",
      "review": "1) How the hell did this movie get the greenlight after the massive failure of Extinction 2) Whoever wrote this script needs a career change 3) I have never rolled my eyes or threw up my hands in the air in confusion in my entire life 4) Make it stop, please"
    },
    {
      "rating": "0.5/5",
      "review": "So bad and terrible why"
    },
    {
      "rating": "0.5/5",
      "review": "This is how you failed with a franchise 😔"
    },
    {
      "rating": "3.5/5",
      "review": "They improved it! The 4th movie is kind of meh, but this one is 3x better."
    },
    {
      "rating": "2.5/5",
      "review": "I have a soft spot for the transformers films and a love for Mark Wahlberg so this was already going to get a decent rating from me but the LENGTH of all these films is WAY too long. Some else said it best. This and the other films are just long trailers. I think if you like the others you'd like this but don't bother if you don't like the others"
    },
    {
      "rating": "1.5/5",
      "review": "Well annoying characters are back but the action was fair but definitely far from perfect"
    },
    {
      "rating": "2.5/5",
      "review": "Honestly the worst installment in the series. Sadly, even the good stuff in it doesn't make it up for me unlike Revenge of the Fallen or Age of Extinction. And a sad shame cause it leaves so many unanswered questions that will never get solved since this killed the Bayverse. But after a rewatch a month or two ago, it's a so bad it's good movie in my eyes, so I had some enjoyment watching it. Pros -Like the previous films, amazing VFX -Transformers are still awesome, including new ones like Cogman, Hot Rod and Dragonstorm, as well as the returning ones such as the main AOE group, Megatron and Barricade. -Sound design is great -Nemesis Prime is a very threatening character -Some humor is a bit funny -Return of some recognizable characters from the previous films, most notably Lennox -The final battle and Nemesis Prime vs Bumblebee are pretty good. -Music is great CONS: -Very messy story and plot, with a lot of stuff not making sense and becoming very confusing. -Very shaky camera work and the aspect ratio changes too much. -I don't mind Micheal Bay reusing scenes, but during the submarine scene, they crash and reuse the scene where Megatron crashes into a sub after reviving in ROTF, which they didn't even bother to edit it out, it made me laugh so hard. -Various unnecessary scenes that weren't really needed -Humor is hit or miss -Not much good action packed scenes compared to the previous films. -Quintessa was a… okay villain, also a part of me wished Nemesis Prime was a separate Transformer rather than mind controlled Optimus -Left lots of questions that will never get resolved (ex: how did Galvatron become Megatron again? Sam Witwicky's fate. And Unicron is still around, what will hapoen then?) -The movie marked the end of the Bayverse, which can be upsetting to some since DOTM could have been the end, or the fact we won't get a definitive ending of the franchise."
    },
    {
      "rating": "3.5/5",
      "review": "Rating: 7/10. 77/100"
    },
    {
      "rating": "2.5/5",
      "review": "I can't even stop thinking about the time I was in a theater with two little kids barely anyone was in there. Bumblebee had a sold out showing when I seen it and Rise of the Beasts had enough people in the theater. While watching, the enjoyment from the first four was no longer there."
    },
    {
      "rating": "0.5/5",
      "review": "Thats it. Bayformer movies are over. We had the most satisfying ending in Dark of the Moon until one funded movie ruined it all. We have moved on. The only good things in it were Hotrod, Dinobots, and nitrozeus. But I almost knew none of the movie cause I left barely during the end of the first half."
    },
    {
      "rating": "0.5/5",
      "review": "I just like the movie it's OK that people enjoy it but I still dislike it and focus way too much on the humans and it was really boring"
    },
    {
      "rating": "0.5/5",
      "review": "Michael Bay Ruined Transformers, none of his transformers movies are good"
    },
    {
      "rating": "2/5",
      "review": "This was just not good bay should of did something else and not bring Megatron back"
    },
    {
      "rating": "1/5",
      "review": "Transformers: The Last Knight is an incomprehensible and convoluted mess that abandons any semblance of coherent storytelling, instead opting for a haphazard mishmash of historical references and robot battles, leading to a mind-numbing and disjointed cinematic experience that epitomizes the franchise's declining quality."
    },
    {
      "rating": "2/5",
      "review": "Nothing new here except a new villain to continue the franchise. Way too long."
    },
    {
      "rating": "0.5/5",
      "review": "Transformers 5 poteva essere decente solo se Bay avesse dichiarato che era un troll molto simpatico"
    },
    {
      "rating": "0.5/5",
      "review": "Throw it in the trash"
    },
    {
      "rating": "0.5/5",
      "review": "Although I consider myself a fan of the \"Transformers\" franchise, I found \"The Last Knight\" to be simply unwatchable; I walked out of the theater and saw \"Baby Driver\" instead."
    },
    {
      "rating": "1.5/5",
      "review": "It was painful, took me 4 whole days to watch this, omg."
    },
    {
      "rating": "1/5",
      "review": "very boring and the film was way too long."
    },
    {
      "rating": "5/5",
      "review": "I love this movie I don't understand why people hate it!!"
    },
    {
      "rating": "2/5",
      "review": "I mean it was a LITTLE better than the fourth film…"
    },
    {
      "rating": "2.5/5",
      "review": "Better than The Age of Extinction, and Revenge of The Fallen! But it's still boring in the first and second act, but the Third Act and Finale is the one I was looking forward to this movie"
    },
    {
      "rating": "1/5",
      "review": "Not going to say why this one is awful because it is."
    },
    {
      "rating": "1/5",
      "review": "Such a terrible waste of effort with this installment in the Transformers series. Why does Mark Wahlberg sound like he is always out of breath when he talks? Michael Bay does his usual routine of creating explosive visuals that translates well across multiple viewing demographics."
    },
    {
      "rating": "0.5/5",
      "review": "Very very boring story"
    },
    {
      "rating": "0.5/5",
      "review": "Probably the worst movie I have ever seen"
    },
    {
      "rating": "3.5/5",
      "review": "The worst bayverse movie, really chaotic story, still cool fights"
    },
    {
      "rating": "0.5/5",
      "review": "This so called \"Transformers\" movie, these movies should be called Bayformers, nothing than meets the eye. 2/10 F"
    },
    {
      "rating": "1/5",
      "review": "The movie that kills off the already dying Bayverse is The Last Knight. This movie is worse than Age of Extinction and fails to give us anything good or new plot or character wise."
    },
    {
      "rating": "4.5/5",
      "review": "a fitting and emotional and brilliant end to the Michael Bay Transformer series. the Music is outstanding, the CGI is gorgeous and this is one of the best looking movies I've ever seen and I love the new actors they hired for this film. 9.5/10. these Michael Bay Movies are all underrated and deserve way more love."
    },
    {
      "rating": "5/5",
      "review": "Loved every part of this movie!"
    },
    {
      "rating": "1/5",
      "review": "This movie is so bad. This is a stain on the transformers franchise. It's better than AOE because it's kinda funny bad."
    },
    {
      "rating": "2/5",
      "review": "This movie completely destroys and blows up the foundation that Michael Bay laid when he made the first Transformers live action movie, the story of the all the previous moves goes out the window, this film feels like more of a standalone movie rather than a continuation of the Transformers live action movie line, with it's eye straining cuts from 16:9 ratio to full screen for what feels like every 10 seconds, this movie is what I would like to call Bay's playground, due to him basically not caring for the story and throwing Transformer characters into the movie, Transformers: The Last Knight a movie just to past the time and nothing else, I feel sorry for the entire team that worked on this movie, for all their hard work and talent to be wasted on a movie that drove the live action Transformers movie line into the dirt"
    },
    {
      "rating": "5/5",
      "review": "It isn't the worse movie, but more explanation could made it better , but it holds up somewhere in my heart about robots , villains , action an music"
    },
    {
      "rating": "5/5",
      "review": "I really did enjoy this movie and I don’t get the hate for it either like most people do and I love Laura Haddock in this movie too she did a great job in this movie and she is a beautiful gorgeous actress too and I give this movie a 10/10 stars love this movie."
    },
    {
      "rating": "1/5",
      "review": "Bad movie not enjoyable overall it's to much an it's boring"
    },
    {
      "rating": "1.5/5",
      "review": "I want to likeit because I'm a huge transformers fan but I just can't it's not good. There are parts I like but bay just decides to blow up any previously established continuity in this movie"
    },
    {
      "rating": "0.5/5",
      "review": "This movie's writing, acting, and dialogue are atrocious. The plot is all over the place. The Decepticons are working with humans for some reason which is totally out of character. WHAT? Decepticons don't negotiate. They kill anyone who stands in their way. The writers also gave transformers blood in this one. Apparently they can bleed out now? Except they are robots? Even if I were to ignore that this is a Transformers movie, it's still bad by movie standards. Main characters we're very unlikeable and poorly written. The plot also doesn't make any sense. Apparently transformers fought in various wars in history and this was all covered up by the Witwikies family. One of the worst movies I've ever seen."
    },
    {
      "rating": "5/5",
      "review": "An absolute banger to watch, this movie offers the most heartshaking moments and settings ever seen. The story connected with a historical vibe and properly portrayed the end of the world. It also struck hearts with tensive battles."
    },
    {
      "rating": "2/5",
      "review": "the worst in the franchise. there is too much things happening and the timeline gets a little weird, but the cgi is great"
    },
    {
      "rating": "0.5/5",
      "review": "A waste of time and money, Transformers the last knight is just as bad the previous entry, but this time it lacks any new gimmicks to pull in the money. The film feels unfinished and even more than previous entry, simply waved away it unfulfilled promises stating \"they'll get ‘em next time\""
    },
    {
      "rating": "4/5",
      "review": "Transformers: the last knight is a good movie, sure 1. The movie god negative reviews by both fans and critics and Hershley flopped at the box office and 2. The movie is not as good as it's predesasors transformers, transformers: revenge of the fallen, transformers: the dark moon and transformers: age of extinction, but dispute all of this, in my opinion, transformers: the last knight is still a great sequel to 2014's transformers: age of extinction, hope you all understand my opinion about the movie"
    },
    {
      "rating": "0.5/5",
      "review": "Only because this movie can't be rated as a zero. The worst. There is nothing redeemable in this movie. Convoluted and nonsense plot, lack of proper transformers action, more CGI noise for the final battle and ridiculous retconning of prior movies and lore. DON'T. WATCH. THIS. MOVIE."
    },
    {
      "rating": "1.5/5",
      "review": "Ok. This movie makes Age of Extinction a Masterpiece. There are more Subplots than plot holes, and there are a LOT. Galvatron is somehow Megatron, what happened to the AllSpark, How is Earth Unicron with out anyone noticing, Quintessa is the creator? I thought they were made of flesh and multiple. what happened to Cybertron's size? It was 4x larger than earth and now it is 1/4 the size. Oh, and now Optimus is evil. Oh actually, bumblebee's voice turns him good again. Optimus said he hadn't heard it since the war. BUT HE HEARD HIM IN THE FIRST MOVIE! I feel like no one on the production team remembered that. Oh well the last 30 minutes is actually pretty good. not worth watching though"
    },
    {
      "rating": "2.5/5",
      "review": "The only reason I think this movie is mid but I only liked the bumblebee vs Nemesis prime fight really hit the heart strings to me cause he was having to fight us leader and his friend and the final battle was ok it wasn't the best fight act of the film but this movie isn't really that good I'd give it a solid 3/10 I only liked the fight scenes"
    },
    {
      "rating": "1/5",
      "review": "Pretty much everything accept the effects seemed to have no effort put into this movie, the rest of the bayformers movies were no masterpieces and this one even makes age of extinction slightly passable, unfocused, convulsed and messy, that's what this film is."
    },
    {
      "rating": "2/5",
      "review": "When Bay focuses on spectacle over story/character, the movie works. Unfortunately it doesn't make it very memorable"
    },
    {
      "rating": "3/5",
      "review": "Movie was good in my opinion but the story felt lack lustered. Action scenes was cool. Less humans !"
    },
    {
      "rating": "1.5/5",
      "review": "This movie went through the grinder in the editing room. The pacing's souped up like it was on speed or coke, leading it to feel like several stories/episodes of a fragmented \"movie idea\". There are interesting plot points, but this monstrosity was all over the place. When you think you're just about getting the rhythm of the storytelling, another sideshow opens up and calls your attention to try to understand what's going on. It was a weird experience and the magic of watching a cartoon to live action movie seemed like it was purposely replaced by a gattling gun of experiments on how to tell a transformers story. You will not be able to breathe to form an opinion on how the story's going, it will mentally shove you to keep on going forward."
    },
    {
      "rating": "3.5/5",
      "review": "It's not perfect, I mean could have been better. But not the worst movie I've seen. It will be fun. At least try for those who haven't (after seeing the other 4 Transformers Movies)."
    },
    {
      "rating": "5/5",
      "review": "The greatest 02 hours: and 28 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "1/5",
      "review": "Transformers: The Last Knight is a confusing clump of badness. While it does have impressive visual effects and fight scenes, it completely crashes due to its many confusing plot points and unnecessary moments. The Worst of the franchise for sure. Rating: 12%"
    },
    {
      "rating": "1/5",
      "review": "Sure, the effects are still exceptional, (And arguably at their best here) but that's about the only appeal of Transformers: The Last Knight. It's more of the same we've come to know about Bay's Transformers regurgitated once again at our dismay. Same stuff, different disc."
    },
    {
      "rating": "3/5",
      "review": "Probably the best transformers movie since the original film."
    },
    {
      "rating": "1.5/5",
      "review": "Don't watch this film just don't watch it please."
    },
    {
      "rating": "3.5/5",
      "review": "I love the Voice Acting. CGI is best. Megatron was ok I hated Quintessa. Writing was ok-good. Story/Plot, I loved Bumblebee's story from being a Nazi fighter with Hotrod to being a global protector. Casting could have been better. I loved the characters (other than Quintessa). Adventure the world was literally gonna end. I love the ending the final battle was kick ass in my opinion way better than Transformers 4."
    },
    {
      "rating": "1.5/5",
      "review": "Everything dosent feels like anything when everything is a joke, the humor is just everywhere and so dumb and i dont feel like watching this for anything of a plot, just for loud/mindless action"
    },
    {
      "rating": "2/5",
      "review": "Transformers: The Last Knight (2017) has good-looking effects and good action, but the story and characters are super lackluster and generic."
    },
    {
      "rating": "3.5/5",
      "review": "this Transformers was enjoyable. I didn't have high expectations going in, but it was your typical Transformers movie. Anthony Hopkins was a fantastic addition to the cast, as he always is to any film. The fact that Optimus Prime appeared in the film for less than five minutes and played the antagonist for even less time raises my only two concerns. Optimus was supposed to be the villain in this movie, but he didn't do much to merit the hype. Additionally, the entire King Arthur story didn't appear to match the mould for this genre. Even if it didn't make much sense, it was nice. The new Autobots were great."
    },
    {
      "rating": "0.5/5",
      "review": ".............GOD NO."
    },
    {
      "rating": "3.5/5",
      "review": "It's a Transformers movie and therefore shouldn't be taken too seriously. It's fun in its own way and great to see many of those beloved characters again for another outing. In this context, Transformers 5 is an enjoyable movie."
    },
    {
      "rating": "1/5",
      "review": "Camera gives a close up on Megatron: a Megatron automatically: Helmet closes"
    },
    {
      "rating": "1/5",
      "review": "This makes no sense and it's really boring."
    },
    {
      "rating": "1/5",
      "review": "A pesar de que soy un gran amante de los transformers no puedo negar que esta es la peor que hay, la historia de que los tranformers estuvieron desde hace años en la tierra es una total fumada por parte del director, las unicas 4 veces que la he visto siempre ando pidiendo que termine lo antes posible."
    },
    {
      "rating": "3/5",
      "review": "The animation top tier as always. But story was meh.."
    },
    {
      "rating": "1.5/5",
      "review": "Silly, bloated and ridiculous. I laughed so hard at the dialogue."
    },
    {
      "rating": "3/5",
      "review": "This movie has great action and all, but the movie itself made no sense at all. The plot I think should have focused more on nemesis prime because all of the movie posters have nemesis prime in it but he only lasts for about 6 minutes before he turns back to Optimus."
    },
    {
      "rating": "5/5",
      "review": "Ages 13 and older!!!!!!!!!!!!! The greatest 02 hours: and 28 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie and terrible plot"
    },
    {
      "rating": "0.5/5",
      "review": "Nope... Terrible movie right here. Great visuals. Horrible plot and story delivery. Acting was non existent. Just a complete and utter failure. Disrespectful to fans that they delivered this garbage and called it a competent movie"
    },
    {
      "rating": "4/5",
      "review": "People loved the first live-action Transformers movie, what went wrong with the rest? Why didn't they like Revenge of the Fallen, Dark of the Moon, Age of Extinction, and the Last Knight? What went wrong?"
    },
    {
      "rating": "0.5/5",
      "review": "Bay is Uwe Boll with a bigger budget."
    },
    {
      "rating": "0.5/5",
      "review": "This was the worst story and dialogue of any of the Michael Bay Transformers films, and that is saying something. The style of the Transformers was all wrong from the start."
    },
    {
      "rating": "1/5",
      "review": "While the premise of the movie is one that has a lot of potential, this movie manages to mess it all up consistently. With long and boring dialogue that becomes irrelevant almost right after it is said, and every character having the same personality of shooting off one liners and acting on every cliché in the book, the movie does not do a good job of holding your attention. The effects look good, but everything else manages to bring this movie down. If you are a fan of the previous Transformers movies, you should probably skip this movie. If you are a fan of Transformers, you should really evade this movie like your life depends on it. If you are a casual movie goer, you can probably spend your time and money more wisely by sitting outside of the theater and just looking at the movie poster for Transformers the Last Knight for two and half hours."
    },
    {
      "rating": "0.5/5",
      "review": "As bad as almost all of the franchise so far."
    },
    {
      "rating": "5/5",
      "review": "👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍🌟🌟🌟🌟🌟"
    },
    {
      "rating": "1.5/5",
      "review": "After the disappointment that Age of Extinction was, my hopes from this franchise had fallen to zero. However, I still had one ray of hope - it couldn't be worse than that, right? The story is already bad, the characters are no longer interesting, the continuity doesn't matter anymore, and hey, just one more movie is left after which I'll get to watch the super-awesome Bumblebee, so let's just tolerate one more movie. And boy, was I wrong when I didn't take one more factor into account: At least the cinematography was good in all the previous movies. Here even that fails. The most distracting thing in this entire movie is the continuously changing aspect ratio. There's a very important rule in filmmaking, that your jump cuts should be so seamless that the audience shouldn't realise when the jump cut takes place. Look at Marvel movies. When Black Widow fights there are like a gazillion jump cuts in just one somersault. If that is supposed to be silently moving across the room, the jump cuts of The Last Knight are like dragging an almirah across the room hoping no one would notice. You can literally see the jump cuts happen! And speaking of jump cuts ruining the mood, whenever the jump cuts happen in the same scene it feels like it is a completely different scene. Like in the scene where they are in the elevator and they see the butler bot over there, it feels as if the scene outside the elevator is a completely different place. The lighting is also so bad, it doesn't even feel like there's continuity until the jump cut happens again and the camera goes back to Cade and company. Apart from that there is also a scene where Cade stops his car in front of the sheriff and when he's stopping the car there's a lot of dust. But when the jump cut happens the dust is all gone. And while he's still stopping his car his voice starts coming. Like, he isn't even moving his mouth and the words are coming out louder than the car's engine. Another time the ADR ruins the mood is when the butler bot is playing the piano when the story of the Transformers is being narrated. He is asked to stop playing... Twice! A bad joke is repeated twice in just fifteen seconds! Then of course there's the fight between Optimus Prime and Bumblebee, the legendary fight for which everyone came to watch it. Because the movie had been advertised by saying that Optimus Prime is the bad guy in this movie. And guess how their fight ends? Martha! No, not by saying those exact words, but something similar. Just as Optimus is about to stab Bumblebee, he says, \"I'm Bumblebee. I'll lay my life before you!\" And that changes Optimus Prime's mood. First of all, why did it change his mood? He's a robot not a human. Emotions can't alter his programming. And secondly how on earth did Bumblebee suddenly start speaking? It's not like his voice suddenly fixed. It was permanently damaged. It's kinda weird that in this movie the humans are not the bad part. In fact I really liked its starting, where they were showing Merlin take help from the dragon Transformer to win the battle. I also liked how those kids were collecting spare parts to survive. Even showing Optimus Prime on his planet looked so cool. The way it began I was really wondering why on earth this movie has such bad reviews. If the movie focused on either of the two things it could have been a great movie. I really wanted to like it, but the jump cuts were making me laugh even on the serious scenes. I'm sorry, Michael Bay. But I think you've ruined a good movie by hiring a bad cinematographer."
    },
    {
      "rating": "1/5",
      "review": "Unfortunately, Transformers The Last Knight is a complete disaster, Michael Bay has to leave the franchise immediately two tragedies followed by Age of Extinction and The Last Knight, the script of this 5 is HORRIBLE and still disrespects the story that was previously told in the first 3 films and not even the action scenes are saved since the cameraman has Parkinson's, the only good scenes are the fight between Bee and Optimus Prime and of course the scene where Optimus says: MY NAME IS OPTIMUS PRIME. (1.5/10)"
    },
    {
      "rating": "0.5/5",
      "review": "Transformers 5.... Where do I even start with this movie? When we saw Transformers 4 in cinemas 2014, everyone was deeply disappointed. When they thought things couldn't get any worse, they did once Transformers 5 was confirmed. What did we get? Terrible cast performances, especially from newcomer Laura Haddock. Excessively long runtime Little character development Embarrassingly pointless humor You could watch this movie over and over again and still be able to point out all of the flaws. It's that kind of movie that would make you refuse to eat your popcorn even whilst watching it the first time over. Transformers 5 is a funny joke, but with a bad punchline But the funniest part is that I used to think of Transformers 2, 4 and 5 as the best Transformers movies. But I can see the clearer side."
    },
    {
      "rating": "5/5",
      "review": "it was amazing especially the final battle"
    },
    {
      "rating": "3/5",
      "review": "The camera work is awful, the last battle is epic."
    },
    {
      "rating": "5/5",
      "review": "Its jennifer lawrence for me"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is so horrendous. Doesn't work in the timeline, and a mountain of plot holes. 260 million dollar budget but none of it went towards the writing."
    },
    {
      "rating": "0.5/5",
      "review": "What the heck is this movie? It's even worse than The Last Airbender movie and The Room. In every scene, someone cusses for no reason. The visual effects is just ok, but the plot of this movie is completely terrible. Don't see why the government needs to hunt down the Autobots. They've saved the world and you want them dead for it? The director must've been fresh out of ideas and decided to change the plot and make everything terrible. The budget for this movie is less than a YouTube video and the setting is crap. This is a terrible movie and I don't want to watch this ever again."
    },
    {
      "rating": "0.5/5",
      "review": "Maybe it’s best to leave this to rot. plot makes 0 sense at least the other ones were better."
    },
    {
      "rating": "0.5/5",
      "review": "What did I watch? Unless you are twelve the movie was a total mess! If they REALLY want to continue this franchise make it somewhat believable. Lose the kids in the film! What are they there for comic relief? Big stars reciting forgettable lines? Again why? This was about the end of man-kind and we have jokes??? Where is all the metal coming from to build odd structures that do NOTHING! Dinobots having offspring? Merlin being a drunken fake? I'm sure Red Riding Hood was in there somewhere. Or maybe Doctor who will figure it all out, and wake up the kid having this nightmare of a dream. This was made for FLUSHING!"
    },
    {
      "rating": "4/5",
      "review": "Despite the poor ratings, I thought this was an excellent cast and great storyline in the series of the Transformers. Can't wait for the next installment"
    },
    {
      "rating": "4.5/5",
      "review": "9.0/10. I don't get how these films are treated so poorly. they're fun, enjoyable, contain great action and epic final battles."
    },
    {
      "rating": "0.5/5",
      "review": "I loved this franchise, this was my childhood. This film kills my love and passion for this franchise. The film that the director just does not care anymore."
    },
    {
      "rating": "2/5",
      "review": "Huge disappointment for a finale like I'm a huge transformers fan and this is how it ends it was not good at all"
    },
    {
      "rating": "0.5/5",
      "review": "Should've stayed where it belongs, in my memories"
    },
    {
      "rating": "2.5/5",
      "review": "Leggermente meglio rispetto al precedente capitolo grazie ad un paio di personaggi reinseriti e a qualche scena di azione molto spettacolare. Per il resto, ennesima trama troppo simile alle precedenti e dopo 5 capitoli non se ne può più di vedere gli \"umani\" schierati dalla parte sbagliata."
    },
    {
      "rating": "0.5/5",
      "review": "It's Michael Bay, people!!! -1000/10: DON'T WASTE YOUR MONEY!!!!!"
    },
    {
      "rating": "2/5",
      "review": "So much talking and we get to see once again how stupid humanity and they finally drag the Autobots down to their level. ;)"
    },
    {
      "rating": "4/5",
      "review": "I love this movie, but the one thing that kinda throws it off is the story line, I think that there's too much backstory. Overall the movie was fantastic."
    },
    {
      "rating": "5/5",
      "review": "Honestly love the storyline, really hope they continue it."
    },
    {
      "rating": "3.5/5",
      "review": "Chaos but I liked it"
    },
    {
      "rating": "2.5/5",
      "review": "Well it could be better, it has some flaws but not a terrible movie but kinda boring 😶"
    },
    {
      "rating": "3/5",
      "review": "There are a lot of head-scratching moments. However, it mostly delivers popcorn-flick fun."
    },
    {
      "rating": "1.5/5",
      "review": "Wow this movie was so bad. So long for no reason. I don't even remember what it was about. Bumblebee talking was too convenient but ends up being the best part of the movie."
    },
    {
      "rating": "1/5",
      "review": "Another bad transformers movie, that focuses too much on the humans.This movie has plenty of racism and has all the usual Michael bay things and is overall just bad."
    },
    {
      "rating": "5/5",
      "review": "Like transformers suppose to be"
    },
    {
      "rating": "5/5",
      "review": "I Loved this movie so much they CGI is so good, and everything is so real. The story is so good but it doesn't make sense that originally they can for the cube but now it is for the staff, but that doesn't change my mind at all. When I watched this in cinema it was the best cinema experience ever, I hope they do another transformers movie but with more Megatron screen time as he is my favourite character in these movies but he always haves such little screen time. this movie in insane"
    },
    {
      "rating": "5/5",
      "review": "The critics went out of their league to criticize this movie. But they fail to see this movie for what it is. A thoroughly entertaining and funny experience with absolute Bayhem! You can't analyze and think too hard on what you see. This is meant to be two and a half hour with amazing special effects, epic music and ridicolous moments. This movie looks so grand and epic on the big screen in cinema, thanks to Bay filming it almost entirely with IMAX 3-D cameras. After an very intriguing prologue set in medieval times with catapults casting fireballs and big armys clashing together in \"Gladiator\" style, we also see Stanley Tucci as drunk Merlin pleading with transformer knights. The crazy tone is set after the first 5 minutes. The movie is like the previous ones, hyperactive and fast paced. There are explosions and fighting, and very few quite character moments. But the few that are work well, especially the \"father-daughter\" set-up with Cade Yeager and Izabella. They have tough love but strong chemistry, and I wish we would see more of them together and more of Izabella, because she was the best actor in this movie. All the other well-known actors seem to know they are in a Transformers movie. They don't take it too seriously, it is all about acting over-the-top and bonkers. The ones that do that best is Anthony Hopkins with his hilarious robot butler \"Cogman\". I think simply they're presence made this movie the funniest out of the 5. The plot is very bloated and stuffed, altough the story is generic and similiar to the previous ones. It is all about finding Merlin's staff, that in Quintessa's hands will rebuild Cybertron and destroy Earth. Earth who is revealed to be Unicron, the ancient enemy of Cybertron. The talisman that Cade gets from a dying knight will lead to the staff. And cybertron is approaching earth rapidly, while also Megatron collaborates with the \"TRF\" who is the new rogue military force. And I haven't mentioned that Optimus Prime gets brainwashed by Quintessa and turns bad. So I could see why this is too much for someone, it was clearly an answer to \"too much of everything\" from the writer's room. But it worked for me. The middle act in London is the most crazy and ludicrous. The final act is an massive showdown of earth shattering preposterousness. An workable ending for the Bayformers, but then we get the stupid cliffhanger which should have been cut out. Personally I would've liked a more grounded movie with less subplots, who is more focused. We could follow the kids we meet at the beginning instead of Viviane and Cade troughout the movie and I would have liked more of Nemesis Prime. This movie clearly had a lot of talent and merits behind the screen, and although the movie is pretty forgettable and hated by many, I still found it to be worth watching. It captured a sense of escapism and if you want to experience a big-budget massive summer blockbuster that also is fun, this is the movie for you. Roll out!"
    },
    {
      "rating": "1/5",
      "review": "The worst of the franchise.after four films this one falls the most with cheesy story and action."
    },
    {
      "rating": "1/5",
      "review": "Eek! Slow narrative, confusing battle camera, extremely lazy script."
    },
    {
      "rating": "0.5/5",
      "review": "What did I think of Transformers: The Last Knight? Check out my full review below: https://open.spotify.com/episode/1ylG7AdqpU9tlGHO54DBfI?si=j3F-Eo4TTViT8kTqmiA56g"
    },
    {
      "rating": "2/5",
      "review": "transformers 5 is a bullshit"
    },
    {
      "rating": "1/5",
      "review": "you know you touched rock bottom when you willingly watch transformers 5. what a piece of garbage -Dialogue as if the writers hadn't talk to a kid in their life (or another human being for that matter) -aspect ratio changing EVERY SINGLE SHOT, not every scene; EVERY. SHOT. -camera movements without reason -cuts and framing that would be nice if it was a PARODY of an action movie and that would make anyone with eyes cringe. -random vignetting like they don't know how to use a fucking lens -no character development... no characters at all... -no reasoning behind the character's actions -awful pathetic attempts of \"comedy\" -lines that you can feel the actors hurt while delivering them... but on the bright side, if you don't understand what \"having a motive\" for everything in your scenes mean, every frame of this 2 hours and a half \"film\" is a perfect example of what not to do. the spectacle is the same as always and the only reason its not just half a star, a few things have improved since the previous ones which is not saying much, and the sexualisation of characters, even when it hasn't disappeared, its less prominent in this one. it is a scream of glory for the vfx artists but nothing beyond that, and i have to clarify that some scenes keep being nonsensical visual noise, and shortcuts in the transforming part of a movie called transformers leaves some things to desire in that area too, but some effect filled scenes were actually interesting."
    },
    {
      "rating": "3/5",
      "review": "Good picture quality, a decent ending, and an interesting, albeit continuity destroying, story ancient astronaut theorists would love doesn’t make up for the constant changes in aspect ratio that had zero artistic purpose. Majorly distracting!"
    },
    {
      "rating": "1/5",
      "review": "Utter crap. Other 4 were fantastic so I had high hopes for this, but what a waste of time. Absolutely terrible film."
    },
    {
      "rating": "1/5",
      "review": "I thought this was a ridiculously long movie compared to the others and thought it must have passed 3 hours and 30 minutes. Then i found out it was 2 hours and 22; the shortest. Well."
    },
    {
      "rating": "3/5",
      "review": "Pretty bad a bit interesting not bad action"
    },
    {
      "rating": "1.5/5",
      "review": "TRANSFORMERS: THE LAST Bro. I hope so."
    },
    {
      "rating": "3/5",
      "review": "When it comes to the voting up and down system on Google, I wish I can downvote this and upvote this at the same time. I saw the long climax of The Last Knight on TV, but today I watched the whole movie. Wow. The editing, acting, the pacing, the list goes on, the movie is a little offensive and again tries to put in curse words and for what? This is well half of the film. The second half, all the battles towards the end, the climax is where it gets better, and the sound gets better. The sound in the other part of the movie was just low. So I give this a alittle over three but not exactly three and a half but getting there maybe."
    },
    {
      "rating": "2/5",
      "review": "This fifth Transformers movie was the worst of them all. Mark Wahlberg, Anthony Hopkins, Josh Duhamel, Tyrese Gibson, and the rest of the cast did a decent job in this movie. The plot to the movie was pretty tedious and dull. The movie wasn't as thrilling as the previous four movies. In my opinion, the cast and crew tried too hard to make this movie great and failed in the process. If you haven't seen this movie yet, don't waste your time. It's not worth seeing."
    },
    {
      "rating": "5/5",
      "review": "Some of it is bad but it's good"
    },
    {
      "rating": "2/5",
      "review": "The movie is a lit long, and with too many symbolic messages. Too over. Go back to those transforming characters with action styles may be better."
    },
    {
      "rating": "3.5/5",
      "review": "Honestly this movie isn't bad the cgi is good and the whole plot of main guy being evil but this plot when down the drain the story isn't good what do u expect from Micheal Bay this kinda ruins the first movie for me but hey I still enjoyed this movie"
    },
    {
      "rating": "1/5",
      "review": "I'm not even sure what is going on in this movie but geez was it the worst transformers ever. Bumblebee gets his voice back and automatically snaps Optimus out of this trance. Reminded me of Superman and Batman with the whole Martha thing."
    },
    {
      "rating": "0.5/5",
      "review": "i got a headache from this movie, even revenge of the fallen was better."
    },
    {
      "rating": "1/5",
      "review": "Talk about an absolute mess. There's not much redeeming about this. The story is bloated, there are too many characters, things don't make sense, and it's kind of boring."
    },
    {
      "rating": "5/5",
      "review": "Transformers The Last Knight, I have waited a couple of years to watch due to the negative reviews but I must have watched another movie cause I loved it ! a fun ride with spectacular special effects , great story and my favorite Transformers movie the critics must just not understand the story or must just hate Michael Bay and anything he does , Michael Bay has down an amazing job with the 5th installment of the Transformers franchise. I have two words for this movie ABSOLUTELY AMAZING and one word for the reviewers disappointments I am so \"disappointed\" with your reviews but the movie is excellent to me."
    },
    {
      "rating": "2/5",
      "review": "Transformers: The Last Knight It is a movie full of multiple absurd plots, a totally illogical script, a story that is not convincing, a rhythm that is either too fast or too slow. A bad closing for the films directed by Michael Bay."
    },
    {
      "rating": "4/5",
      "review": "Es un poco más de lo mismo , lo que no se discute don los efectos es un espectáculo... Hay sabe gastar en efectos , Mark Wahlberg bien. Estaría bueno que para la próxima lo metan Labeouf"
    },
    {
      "rating": "3/5",
      "review": "I think the low overall rating is a bit harsh. The special effects are pretty awesome and overall the film was reasonably enjoyable. I guess its faults are: The whole Merlin storyline is rubbish, the Megan Fox look-a-like is a bit too obvious (nothing wrong with her acting mind you) and some of the script is incredibly wooden. I also had a huge dislike to the US Army being the enemy and chasing the hero's of the film. Its also a long film. Seemed to reasonably quickly, but it's long."
    },
    {
      "rating": "5/5",
      "review": "I liked it a lot too the story is good and the new Transformers hoping to see another Transformers movie."
    },
    {
      "rating": "1.5/5",
      "review": "This movie is terrible. Like I couldn't believe how stupid and dumb this movie is. Now mind you I don't watch these movies for the story or the plot however, this plot is absurd. The action isn't all that great with all the jump cuts and editing. Optimus Prime is barely in the movie. That little girl who had her own trailer is barely in this movie. This movie sucks. Do not waste your time. I'm glad this is the last Michael Bay transformers movie because even though I can watch them and enjoy the action they aren't all that great. The first one is the best one and that one has issues but this movie is awful."
    },
    {
      "rating": "2/5",
      "review": "Virtually unwatchable... Not enough action, weird, incongruent styles/storylines (heavy dialogue renaissance type story, military mission, the human/transformer relationships, & random transformers standing in the background). I can't even tell if there is insufficient story and they just put a whole bunch of visuals to distract from that... or if they just tried to cover way too much story ideas and were unsuccessful at all(?). Pushed thru the 2+ hours to see if there was a payoff. THere was a bit of action, but not worth all the investment."
    },
    {
      "rating": "3.5/5",
      "review": "I thought that the story was interesting. The 3rd act is one of my favorites from the Transformers movie series"
    },
    {
      "rating": "0.5/5",
      "review": "If you love eating tuna and icecream, I doubt you'll enjoy a bowl mixing both!"
    },
    {
      "rating": "0.5/5",
      "review": "Slightly better than \"Extinction\", but still, it was a pain to sit through. I'll rather have diarrhea than watch this train wreck ever again!"
    },
    {
      "rating": "1.5/5",
      "review": "The movie was really bad. NEVER MIX ROBOTS THAT TURN INTO VEHICLES WITH ARTHURIAN LEGENDS! The two redeeming features of this movie are Anthony Hopkins' character and Cogman. Any science buff would agree that the physics in this movie are trash."
    },
    {
      "rating": "1/5",
      "review": "A disappointing sequel with worse acting and dialogue than ever before, action scenes than are not as impressive as before, and bizarre narrative choices that prove this franchise should have ended a long time ago."
    },
    {
      "rating": "1/5",
      "review": "TF5 is just so bad, boring, loud, long and everything you'd not want to watch in a summer blockbuster."
    },
    {
      "rating": "0.5/5",
      "review": "I like to pretend that this and the 4th movie don’t exist"
    },
    {
      "rating": "2.5/5",
      "review": "Action to action sequences, that happen fast."
    },
    {
      "rating": "1/5",
      "review": "I didn't think a Transformer movie could be this bad. It was like watching multiple unorganized movies at one time. For it to have such a high budget and A list actors this was a shock. Don't waste your time watching it."
    },
    {
      "rating": "3/5",
      "review": "At best this film is an art house experiment with explosions; dynamic and kinetic, it's Hideo Kojima and Christopher Nolan on acid with a crack-cocaine chaser. It's got a genuinely superb, bonkers but weirdly poetic opening with shots and editing that suggest to me that the formula of these movies, distilled and refined over time has more to offer than just new font and new toy designs. It's got Undead Robot Skeleton Knights, it's got a comedy montage where Megatron brokers a deal to release his gonzo robot henchman from human incarceration, it's got Laura Haddock basically playing Lara Croft, it's got a gunfight at Stonehenge, it's got some of the best cinematography, and high-budget fantasy/science fiction visuals ever displayed, it leans full-tilt into it's fantasy. I unashamedly love this movie, and I don't know why, maybe it's the best of a bad bunch and getting the goofiness and character-less robots and homophobia and uncomfortable female performers, and endless desserts and shoehorned romances, and loud screaming sidekicks out of the way, has allowed for a half-decent film about robots kicking ass over Europe. Is the plot utter shit, yes. Is it a complete an utter blast in ever frame in every regard? Yes. Except maybe the aspect ratios, those shifts are inexplicable and ugly, although the IMAX shots are staggering. Which brings me to the 3D which is THE BEST hands down that I've ever seen at home. It's staggeringly good, the image quality with non-active-shutter is sublime and the 3D both in in front and behind the window effects are second-to-none. It's a real shame when you watch a film like this, to acknowledge that the home video experience of 3D has died a death, because a film like this has stars added to it for the love, care, attention, and quality put into this experience. Bay exits the franchise (possibly) after directing his absolute best Transformers film."
    },
    {
      "rating": "2/5",
      "review": "Cade suddenly is this special person who was meant to save the world?? Really??"
    },
    {
      "rating": "1/5",
      "review": "If you love the bay transformers, this is a movie for you. but for a classics G1 fan like myself. this movie is horrible, the plot is terrible and it's very hard to follow along to... the bay films have flaws, and alot of them. the women are mainly used for sexy shots, they are an insult to the g1 cartoon, and the plot and jokes are horrible."
    },
    {
      "rating": "3.5/5",
      "review": "My 5th favorite Transformers movie"
    },
    {
      "rating": "3/5",
      "review": "Although it was visually impressive, it was far too long and the plot was ridiculous. I am starting to understand why these newly styled Transformers are lame."
    },
    {
      "rating": "4/5",
      "review": "Once again a very fun and exciting transformers movie that is best enjoyed on Blu-ray with surround sound for all of its awesome scenes especially the fight of bumblebee and Optimus prime would watch for good fun witch I can say for all the transformers movies"
    },
    {
      "rating": "1/5",
      "review": "This movie makes no sence, the pacing is all messed up, the story is extremely last-luster, and it basically put all it's budget on otherwise really good looking CGI. Yes, i'm here for the action between Autobots and Decepticons but I'm not gonna neglect the story and the dialouge! As a whole \"pentilogy\" of films from 2007 to 2017, they are all bad, Michael Bay should just stop directing movies, because no matter what, they'll be bad."
    },
    {
      "rating": "3/5",
      "review": "This movie was ok. It was not what I thought it was going to be."
    },
    {
      "rating": "4.5/5",
      "review": "As a fan of this series, and growing up with it, I have come to love this franchise. This movie gets a bad rap for being too rushed and long at the same time. However, this is a fun ride if you've seen the other instalments and enjoyed them. This is a good finish to this universe of Transformers (if you ignore the end credits), and is quite a fun ride. The reason this isn't a fu;; five stars is because the middle gets slow and you almost forget it's a Transformers movie. Mark Wahlberg and his chemistry with Laura Haddock keeps this section interesting. Overall, this is a fun addition (and now finale) to the main continuity of Transformers films."
    },
    {
      "rating": "2.5/5",
      "review": "This movie was extremely long and felt like 10 movies mixed into one, making this Micheal Bay movie a failure. Bay's usual awkward humor and pointless explosions were expected, but the absence of Optimus Prime throughout the first act was a major unexpected blunder. However, the CGI in this movie is at it's best along with the action sequences."
    },
    {
      "rating": "1.5/5",
      "review": "Que alguien le esconda la coca al Bay por favor...y que alguien llame a guionistas de verdad! Dios..."
    },
    {
      "rating": "0.5/5",
      "review": "As a long time apologist of Michael Bay's Transformers franchise, I was shocked how abundantly awful this movie was. Honestly, why was this movie even made? There was no reason after Age of Extinction to make another. It starts off with King Arthur, then for some reason we have these kids involved and must team up with the Transformers. The acting is Razzie level, the action sequences can't save it, the massive exposition scenes drove me insane (in between countless yawns). As I watched this movie, I kept saying the same thing over and over. Where was Optimus Prime? Why was this...you know what...I'm ending this review because this is the worst one of the franchise."
    },
    {
      "rating": "2/5",
      "review": "All over the place , plot too difficult to engage with, that's my experience as an adult , I can see this being entertaining for children."
    },
    {
      "rating": "1.5/5",
      "review": "Jesus H f*ck! This movie starts off being decent but then goes down the hill after 20 Min! This film makes Age of Extinction and Revenge of the fallen looks like citizen kane!"
    },
    {
      "rating": "0.5/5",
      "review": "Here we go again, NO NO and NO!"
    },
    {
      "rating": "1/5",
      "review": "It took me 2 years to watch it and i will always regret watching it. Surprisingly, The Last Knight is a even bigger piece of crap. This franchise died on the first movie. Why did they think it was a good idea to make a 5th one."
    },
    {
      "rating": "1/5",
      "review": "3 hours of disappointment. most of the entertaining scenes can be seen in all Transformers 5 trailer, the rest is stuffed with prolonged human plot, forced comedy, WWII nazis, and tons of advertisement which is more than the total transformation throughout the movie. The Last Knight not only has no connection with the previous Transformers trilogy, it also has no connection throughout the movie itself. As usual, Michael Bay and his screenwriters decided to add in cliche jokes and a lot of explosions. and somehow the explosions doesn't cause any damage to anyone. As Optimus Prime drifting in space, he probably infected with some amnesia virus, which makes him forgot Cybertron was destroyed during the Chicago War. But TF5 needs an antagonist that Prime can blame on destroying his planet, that's why Quintessa made a Cybertron replica and ready to slap Prime in the face. You are probably thinking: as a Prime, leader of the Autobots and Mr. Leader of Free Galaxy, he will go through immense pain and suffering to get his brain twisted and turned evil, what we get is Quintessa giving a good hard slap on Prime's face and giving some low level brainwashing speech, VOILA! Nemesis Prime is here! Galvatron seems to regain his full consciousness and turn back as Megatron, but there's no back story about how he get his name and classic transformation style back (Michael Bay is stepping up his guessing game in this movie and we have to reason up what is actually happening throughout this movie). He looks like the leader of gangster more than leader of the Decepticons, and his crew members are filled with racial stereotypes and amusing crime records(bank robbery? really?). and why would Megatron chose Mohawk over Berserker? he's supposed to rule the Earth, not just doing some street crimes! but all of these bullsh*t seems to be reasonable in Bay's TF movies, as all the Autobots, who saved Earth from Decepticons and other threats get brutally shut down by the government. However, the Decepticons who destroyed half of the United States and killed millions, gets to live in comfy, hi-tech prison, have the right to negotiate with the government, get some street tattoos and gold chains, and rob a frickin bank. Zero character development, most of the character was unnecessary(or not supposed to add into movie), I was expecting Isabela Moner to actually represent the strength and reliability in this movie like Laura in Logan. What we get was Greta Thunberg ripoff, shouting for no reason, opposite of helpful and try hard to be intelligent and reliable(and of course, it didn't work out). As the movie goes on, we get to know unnecessary information such as Hound doesn't have a father, Vivian is a well developed female with zero experience about love(wtf), and her mom and aunts keep nagging about when will she get married, Hot Rod wasting time to pronounce his name with his French accent, TRANSFORMERS KILLED HITLER? and other fuckery awaits. The idea of getting the staff to take over the world is oddly similar to Night at the Museum 2. After the Iacon Knights guarded the ignition chamber for 1600 years, their eyes must be covered with rust so they can't see and kill a human properly. as an ancient robot race with various choices of high tech weapon: turn into a massive metal skeleton with rusty swords as weapons (still looks cooler than Que and Mohawk). He's back, he's alive, Nemesis Prime is here to chop some knights! after Nemesis Prime had gone rogue, we finally have some decent fight scene to watch! Nah, it lasts shorter than the time used by Hot Rod pronouncing his name. What did Bumblebee do to break Quintessa's curse? The voice of friendship, of course! as the movie was about to end in 30 minutes, so all the Decepticons have to die in 10 minutes, and 30 seconds for Infernocus, at least Infernocus has a quick death, unlike Megatron has to get kill, decapitate and revive throughout the TF movie franchise. After Quintessa get shot in the spine and disappear, the movie has finally come to an end, where Optimus Prime giving inspirational speech, human and robot hugging each other, and watch the sunset until the credits roll. And nope, this is not the end, Unicron and Quintessa probably going to fight in the next Bayverse TF movie and the entire human race are going to hate Transformers even more. Michael Bay should cast Gerard Butler for the next TF move (If there is another) so he has proper reason to save United States every time and slap an American flag on the audience's face for every minute. I pay to watch a Transformers movie, what I got was a bad parody made by some weird Youtube channel(with tons of ad placements) with insulting story line. The CGI model of Transformers was good tho."
    },
    {
      "rating": "0.5/5",
      "review": "I got lost 15 minutes into the movie. Didn't understand what was happening except for catching notice of the scene changes and watching people and robots with bad designs fight over a staff in a time space of + 2 hours or so. This movie is so bad that I don't know why I watched it in the first place."
    },
    {
      "rating": "5/5",
      "review": "People don't see the complex storylines behind the transformers franchise 1-5"
    },
    {
      "rating": "0.5/5",
      "review": "movie with a bad story stupid humor, an typical bayformer mvie and not a transformer movie!"
    },
    {
      "rating": "5/5",
      "review": "Megatron : We were Brothers Once Optimus Prime : Once"
    },
    {
      "rating": "0.5/5",
      "review": "Wow ! Did Michael Bay even saw some of the transformers cartoons.... just not it non of them... only like Transformers the first one that’s it.... this one can’t watch any more than and hour... bad bad bad."
    },
    {
      "rating": "3.5/5",
      "review": "If you like movies with giant robots, this is for you."
    },
    {
      "rating": "3.5/5",
      "review": "I enjoyed this movie. It was big, action packed, and non-stop. A very big spectacle. Anthony Hopkins committed to the role and didn’t just deliver a half hearted performance to lend his name to the credits. Some of the silliness that were in prior entries in this franchise were minimized, seemingly cognitively. The plot was absurd but concise and while there were some holes, it wasn’t a huge distraction. I think going into this, you have to remind yourself that it’s a Transformers movie directed by Michael Bay. Don’t take yourself so seriously and go have some fun."
    },
    {
      "rating": "2/5",
      "review": "Standard Michael Bay: slo-mo, swirling cameras, helicopter shots, obnoxious product placement. Standard Transformers sequel: incoherent action, incoherent plot, waaay long, needlessly complicated. One bright spot: Anthony Hopkins is a hoot."
    },
    {
      "rating": "0.5/5",
      "review": "Explosions are cool and all but my god I didn't think they could ever be made boring."
    },
    {
      "rating": "0.5/5",
      "review": "B A D B A D B A D B A D. left the theater laughing. so so bad. so. so. bad."
    },
    {
      "rating": "1.5/5",
      "review": "Disappointment and waste of time."
    },
    {
      "rating": "0.5/5",
      "review": "I hate this movie and it is a disgust to it's franchise"
    },
    {
      "rating": "1/5",
      "review": "I could barely stand 40 minutes of this flick and I had to quit. It was just downright boring and silly. Special effects cannot save a bad movie. I just streamed some more intelligent sci-fi of another free movie on Amazon Prime. Not surprised the critics panned this flop. Wished I had my 40 minutes back . . ."
    },
    {
      "rating": "1.5/5",
      "review": "Transformers The Last Knight in my opinion had some crazy potential but was killed but awful writing. This entire story just sucked but the concept of the Decepticons plan could have been huge. This entire franchise needs a major rejuvenation and breath of fresh air."
    },
    {
      "rating": "1/5",
      "review": "A giant mess. Easily the worst film Michael Bay has ever done. There is nothing enjoyable about this overlong toy commercial. Garbage CGI, bland characters, terrible acting, no story, no memorable scenes. 2 hours and 35 minutes of my life that I'll never get back. Please avoid this movie at all costs."
    },
    {
      "rating": "0.5/5",
      "review": "With the first four movies as bad as they are it at least felt like they were trying to make a good movie. Trying and failing, but trying nonetheless. This movie however it doesn't even feel like they are trying. I went into this movie thinking it possibly couldn't be any worse than Transformers 4 but Michael Bay never seems to disappoint. 1/10"
    },
    {
      "rating": "2.5/5",
      "review": "Amazing CGI as usual but the plot seems like it is made up as the movie progresses."
    },
    {
      "rating": "1/5",
      "review": "O filme em si é bom mas a Megan Gox estraga"
    },
    {
      "rating": "3.5/5",
      "review": "It was cool how Optimus took down Infernocus and people should give more rotten tomatoes!!!"
    },
    {
      "rating": "1.5/5",
      "review": "Uggg painful, even for a huge transformers fan."
    },
    {
      "rating": "5/5",
      "review": "My family and I loved this movie! I thought it kinda got off track but was still really enjoyable. If Paramount makes a 7th movie we would certainly buy it!"
    },
    {
      "rating": "2/5",
      "review": "So many wtf moments. The editing really is distracting once you realise the aspect ratio keeps changing sometimes from shot to shot. So many plot points dont really make sense and the jokes are often cringey."
    },
    {
      "rating": "0.5/5",
      "review": "I watched this abomination of a film in theaters. I had zero expectations for it, and it still managed to let me down. Nothing in this film works. Decades from now, this movie, and this franchise as a whole, will be used in film courses as an example of how not to do cinema. Absolutely disgusting to watch as a Transformers fan."
    },
    {
      "rating": "0.5/5",
      "review": "Please stop making transformers movies"
    },
    {
      "rating": "1/5",
      "review": "The Bayformers train should have stopped with Dark of The moon, but yet we have this turd in the wind."
    },
    {
      "rating": "1.5/5",
      "review": "This was worst then transformers 3"
    },
    {
      "rating": "1/5",
      "review": "It was the worst movie ever. It was like they put the story and the awesomeness of the Transformers in a blender, drank it, and threw it up. No flow to the story, choppy cinemagraphy, so disappionted. Loved the series since I was a child and to see it like this is heartbreaking. They had great actors but they screwed it up. Couldn't finish the movie because it was so horrible."
    },
    {
      "rating": "5/5",
      "review": "The Last Knight is Michael Bay's last transformers movie, and it is surprisingly really entertaining!"
    },
    {
      "rating": "1/5",
      "review": "The money spent on making this over bloated, confused monstrosity could have been used to build a hospital. Or save the rhino. Either option would have been infinitely better."
    },
    {
      "rating": "0.5/5",
      "review": "Bumblebee saved this rudderless noisy franchise where Michael Bay thinks he is appealing to audiences with lots of explosions horrid sexual politics and just more and more noise with actors looking lost or In the case of Anthony Hopkins producing more ham than a large bacon sandwich. If you want a headache then this is the film for you. Me I hope the template of Bumblebee will be followed."
    },
    {
      "rating": "4/5",
      "review": "not sure why everyone is pissed off. i liked the movie, not often do i like a movie that is not a comedy."
    },
    {
      "rating": "3/5",
      "review": "The Last Knight is flawed. But it's the 2nd best in the series and is an improvement over Age of Extinction."
    },
    {
      "rating": "0.5/5",
      "review": "Horrendous! The story was all over the place. Really hard to follow."
    },
    {
      "rating": "1/5",
      "review": "Where do I start? so your going to just thrown in some thinly based plot with the worst back story you could think of and call this a movie. This is garbage."
    },
    {
      "rating": "0.5/5",
      "review": "Michael Bay's movies are a joke...filled with pre-pubescent humor, all the stuff you tell teenage boys not to say or do alongside hypersexualizing young women who always need to be rescued and peppered with the stereotypical mexicans, asians and Arabs from the 80s"
    },
    {
      "rating": "0.5/5",
      "review": "What a friggin mess,"
    },
    {
      "rating": "1/5",
      "review": "Michael Bay at his \"best\"."
    },
    {
      "rating": "0.5/5",
      "review": "If you thought Transformers 2-4 were gutter trash that could only appeal to the lowest common denominator then you haven't seen anything yet Transformers: The Last Knight is a film so horrendously bad that only the most simple minded could derive any enjoyment from it. This is basically 2 hours and 35 minutes of random moving images incoherently sewn together in a completely non-sensical way. The basic plot (which is incredibly basic) is easy to follow but all the hour and half of padding is just completely random and illogical and filled with 'jokes' that only Michael Bay and a 3 year old could possibly find amusing. This feels like it was written by an small child that just wanted to throw a load of flashy (and dull) action sequences together but had no idea how to tie everything together. It really is a mess. It isn't even a film that's so bad it's funny, it's just plain awful and a candidate for the title of the worst film ever made. A film this bad should see Michael Bay blacklisted from Hollywood forever. Sadly it won't although the commercial bomb that this was, this will hopefully be the final Transformers film that Hollywood's biggest man child is allowed anywhere near."
    },
    {
      "rating": "2/5",
      "review": "This movie is horrible. It destroys the transformers franchise, it has a very bad plot. the movie tried to add new things to the franchise, but it fails terribly, it also doesn't feel like a transformers movie, even worse that age of extinction, the only good thing is CCG and Megatron's design, this is just a mess of a movie. the trailers showed a different movie but at last is just a very popcorn movie to see only one time"
    },
    {
      "rating": "1/5",
      "review": "By far, the worst in the franchise. Even people that I know who are fans of the live action movie series hate this. This is Todd Frazier swinging and missing at the ball in the next zip code bad. Sure was the easiest pass I ever made, though I had to see for myself when it came out for home release cause I'm a sucker for pain."
    },
    {
      "rating": "3.5/5",
      "review": "thought the movie was overly long, some bad lines, and scenes. A couple cool moments in and there, but nothing special."
    },
    {
      "rating": "5/5",
      "review": "Freakin Awesome movie! Best movie since the original in 2007! Must watch, must own! When is transformers 6 coming out Micheal Bay?"
    },
    {
      "rating": "5/5",
      "review": "OPTIMUS PRIME RODE A 3 HEADED DRAGON!!!!!! IF THATS NOT BADASS THEN I DON'T KNOW WHAT IS"
    },
    {
      "rating": "5/5",
      "review": "Whoever said and I quote \"the best Transformers yet.\" I agree with them."
    },
    {
      "rating": "5/5",
      "review": "Love it make another pls I love you and the movies like the biggest fan ever so pls make another one or else I will be very heart broken so pls for me... And bumblebee (b127)"
    },
    {
      "rating": "2/5",
      "review": "The good: -Soundtrack by Steve Jablonsky can't get too much better than that.... as usual.... -Special effects were solid. -Some callbacks to the previous Transformers films. Bad: -Some characters (Eg: Grimlock, Slug, Daytrader) come and go really fast. Where did they come from? Where did they go? -Optimus/Nemesis Prime had very little screentime. -No clear explanation as to how Megatron reverted Galvatron. -The little girl could've been so good but she was W A S T E D. -Inconsistencies GALORE. Eg: Bumblebee's voice, the history of the Transformers. Verdict: This is the WORST Transformers film BY FAR."
    },
    {
      "rating": "1.5/5",
      "review": "Jablonsky doesn't disappoint, but how many calls to the cosmos is Bay and company going to make?"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is the second worst movie i've seen in my life. It is so boring, so confusing, and so terrible. If I wasn't with a person watching this movie, if you can call it that, I would have left the theater."
    },
    {
      "rating": "3/5",
      "review": "It is doo-doo compared to the other films in the franchise but is entertaining enough to want to watch again."
    },
    {
      "rating": "2/5",
      "review": "It is a little loud and a little too long, the action is there like always, but it's the same thing all over again and it's much much much worse."
    },
    {
      "rating": "0.5/5",
      "review": "How does Michael Bay do it? He manages to outdo himself by making each successive film worst than the last, which is no mean feat when you consider the quality on offer in the previous installments. This one is so dull that even my girlfriend - who somehow enjoyed all the other ones - found this boring and bloated and so we turned it off with just under an hour to spare. If only people would stop going to see Bay movies then perhaps cinema wouldn't be at its lowest right now. Please stop making movies Mister Bay, just retire and go away. 0/5*"
    },
    {
      "rating": "5/5",
      "review": "Greatest transformers movie ever awesome action and amazing act"
    },
    {
      "rating": "4/5",
      "review": "I love Transformers movies. Maybe this one is not the best one. But the history of Transformers is awesome. Good ending for the Bayverse, But I wish they can do the six one. 4/5"
    },
    {
      "rating": "0.5/5",
      "review": "The worst movie ever."
    },
    {
      "rating": "5/5",
      "review": "I loved it regardless of storyline"
    },
    {
      "rating": "1/5",
      "review": "This is the only transformers movie I didn't like, or at least enjoyed. It had the worst action in the franchise, it was very cringy at points and so many of the human characters were unneeded. The opening scene could have been awesome, but thanks to bay's use of fireworks for explosions, that took away. Also, I thought Optimus was going to be the villain. Not only was he barely a villain, but he was barely in the movie at ALL. It made his screen time in ROTF feel like his screen time in AOE. I give it one star for the visuals and score (those were good)."
    },
    {
      "rating": "0.5/5",
      "review": "Sadly this movie is total shyt. It had an irrelevant black dude, a pointless hispanic girl, a slew of the staple lackluster white cast that had no real point or impact on a terrible storyline. It’s as if the cast was filled out to try an make it a ethnically diversified picture but only succeeded in checking a box. The only one I felt pity for was Sir Anthony Hopkins who had to have his career slighted by this crapfest of a production."
    },
    {
      "rating": "1.5/5",
      "review": "\"The bigger they are, the harder they fall\". Never has this statement been so accurate than with the fifth installment of Bay's Transformers franchise. From a convoluted and contradicting plot that in an attempt to set-up further films, ruins the one's before it, to amateur and jarring editing by this films one hundred editors, The Last Knight is the anti-thesis of the original Transformers trilogy Bay conjured up-It truly is action without heart. The only redeemable factor of this film is its score, as usual by Steve Jablonsky lives up to expectation. Even Optimus Prime can't save this one from Extinction."
    },
    {
      "rating": "0.5/5",
      "review": "This one deserves a 0. It's just so bad, boring, loud, long and everything you'd not want to watch in a summer blockbuster."
    },
    {
      "rating": "1/5",
      "review": "Pretty much all the criticisms that I had for the last film applies to this film. It's overlong, convoluted, and worst of all, BORING! It's still better than Age of Extinction and Revenge of the Fallen, but that's hardly a compliment. It doesn't try as hard as either of the movies to be funny, but like every other Michael Bay movie, there were bad attempts at humour and shitty one-liners. There were some nice use of slow-mo shots and this makes it easier to follow the action. There were only two good scenes in the entire film. The car chase scene in London and the fight scene between Bumblebee and Optimus Prime. Speaking of Optimus Prime, he's barely in the film. In this 2 and a half hour movie (which is pretty typical for a Transformers movie), I would say that Optimus Prime had a total of 15 minutes of screentime. He's essentially The Joker from Suicide Squad. A lot of fans have defended the limited screentime that The Joker had in Suicide Squad because he's a supporting character, but Optimus Prime has always been an important character in the franchise. Why did we need John Turturro, the black guy, and the bad child actor more than Optimus Prime? I've never been a Transformers fan, but Optimus Prime has always been the best part about the franchise. And like every other Transformers movie, there's a very long and boring third act action set-piece followed by a monologue from Optimus Prime to end the film. Even when you're starting to enjoy the action, it's ruined by not only bad jokes, but constant changes of aspect ratio. Usually, a big budget movie would film entire scenes (usually important scenes) in IMAX before reverting to its original aspect ratio to make the transition as unobtrusive as possible. But the way Bay uses IMAX, the aspect ratio changes in the same scene with each cut, some of which aren't even a second long. Even shot reverse shot changes aspect ratio. It's distracting and pretty hard to ignore. The same visual mess can be seen in Revenge of the Fallen. It's as if Michael Bay is completely talentless. I know people enjoy the Transformers movies for the junk food that it is and would ridicule me for expecting decent writing. I've given that up since Revenge of the Fallen. For the past four films, I've tried to enjoy Transformers as a mindless action flick, but Michael Bay has been doing the same thing for all of these films. It's really not too much to ask for more substance when Logan, Wonder Woman, and Guardians of the Galaxy 2 offers much more than mindless visuals and loud explosions. Even Fast & Furious 8 does mindless action way better than Transformers. It's a one star for the two good scenes in the entire film."
    },
    {
      "rating": "1/5",
      "review": "Why does this movie exists, i can explain about Transformers: Revenge of The Fallen existing but this movie is just painfull."
    },
    {
      "rating": "4/5",
      "review": "Underrated as f**k so good I loved it I definitely recommend it definitely better than the last and this deserves a B+"
    },
    {
      "rating": "1/5",
      "review": "F*CKING MICHAEL BAY!!!!!"
    },
    {
      "rating": "1.5/5",
      "review": "About what is expected from a bogged series, The Last Knight is just another Michael Bay film. And what is interesting about the Witwicky motto is when one considers its irony. Michael Bay never seizes to sacrifice his ways of making Transformers films. That, perhaps, is why they're generally so terrible."
    },
    {
      "rating": "0.5/5",
      "review": "“Age of Extinction was really bad”........ The Last Knight: “hold my beer.”"
    },
    {
      "rating": "2.5/5",
      "review": "Why did Anthony Hopkins take a role in this???"
    },
    {
      "rating": "0.5/5",
      "review": "I hate michael bay nos... and TOO MUCH EXPLOSION!"
    },
    {
      "rating": "0.5/5",
      "review": "this was the only film in the franchise to which I was old enough or with the minimum possible level of understanding of the next almost 3 hours of film, and I confess that I still saw hope for this last installment directed by Michael Bay. I thought he could redeem at least in some way for all the previous failures, but I was mistaken ... the film is just a reflection of what originated the great and numerous problems that only came to be repeated with time"
    },
    {
      "rating": "1/5",
      "review": "Worst movie I have ever seen. Too much elements going on, it's basically a movie about explosions."
    },
    {
      "rating": "5/5",
      "review": "yesss this will get a sequel loved this one"
    },
    {
      "rating": "3/5",
      "review": "Plot is murky, but the special effects make it worth a watch."
    },
    {
      "rating": "0.5/5",
      "review": "I just joined this site because this movie was so bad that i actually felt it as a duty to give this movie the lowest rating possible. Good god"
    },
    {
      "rating": "0.5/5",
      "review": "it's the \"the last jedi\" of transformers movies, the only difference is the movies before it were not that smart either, but this movie is reaching a new low"
    },
    {
      "rating": "4/5",
      "review": "I donï¿ 1/2 1/2(TM)t see anything majorly wrong with this film. We were treated to a extroadinary and fantastic storyline. All of you critics just think Michael Bay is weak and therefore can abuse all you like. We got the return of Megatron which is what the fans wanted. Whatï¿ 1/2 1/2(TM)s better than earthï¿ 1/2 1/2(TM)s greatest protector turning against his allies to resurrect his planet by attempting to destroy another. I agree that the characters were slightly blunt and boring. But i believe this film is great."
    },
    {
      "rating": "1/5",
      "review": "The story was lacking in motivation, character development and cohesion. It dragged on and on and didnâ(TM)t bother to give explanations to information it dragged out of its buttocks. âWhere did X come from?â? âOh, hereâ(TM)s an explosion, donâ(TM)t worry about that.â?"
    },
    {
      "rating": "5/5",
      "review": "Tomatometer off as always in this spectrum. Get off your f-ing high horse as if you could write, direct and produce something better. For a 5th installment, decent. Better than anything RT could produce."
    },
    {
      "rating": "5/5",
      "review": "dont understand the hate towards this film"
    },
    {
      "rating": "5/5",
      "review": "This movie was the greatest movie of all time. I do not understand how people find the plot unclear because they clearly mention it several times throughout the movie."
    },
    {
      "rating": "1/5",
      "review": "I've heard people talk about how bad the transformers movies are, but I've never seen any of them, and I thought \"how bad can they really be\". Bad. Really bad. I don't know if this Movie is like any of the others, but it's got to be one of the worst movies I've ever seen. Can someone please explain what happens in this movie, because I have no idea. Thankfully, I watched this on Amazon Prime, so I could just stop watching right in the middle. I had better ways to spend my time. This movie looks kind of cool. That's the only positive thing. It would be a great screensaver."
    },
    {
      "rating": "4/5",
      "review": "Es mejor que revenge of the fallen Los decepticons tienen mas dialogos Tiene refrerencias a las 4 anteriores La pelea de bee vs optimus fue buena pero corta"
    },
    {
      "rating": "5/5",
      "review": "Travis knight save the transformer there will be number 7 in the future I like the movie it was awesome"
    },
    {
      "rating": "5/5",
      "review": "The best movie I have seen"
    },
    {
      "rating": "2/5",
      "review": "THE LAST KNIGHT is a serious downgrade compared to AGE OF EXTINCTION, which, frankly speaking, means this movie isn't much. Probably the worst TRANSFORMERS movie of the entire franchise. Even Mark Wahlberg can't save this one."
    },
    {
      "rating": "0.5/5",
      "review": "Scriptwriter: Sir, Age of Extinction sucked ass, how do we make Last Knight better? Michael Bay: Make it so it's all explosions and no plot. Scriptwriter: Great Idea sir, after all, the people only watch movies for the special effects."
    },
    {
      "rating": "2.5/5",
      "review": "Although there is way to much action and the plot isnt the best it gives great special effects. But what was once a great franchise is now a mess"
    },
    {
      "rating": "0.5/5",
      "review": "La película de alto presupuesto más forzada que he visto en mi vida."
    },
    {
      "rating": "1/5",
      "review": "I'm huge fan of the first one(2007), But definitely the last knight is worst of the series."
    },
    {
      "rating": "1/5",
      "review": "A movie with no plot or structure, just a strange mish mosh of things happening fast paced, to the point where I had no idea what I was watching."
    },
    {
      "rating": "0.5/5",
      "review": "not only the worst transformers movie ever, but one of the worst movies ive ever seen..."
    },
    {
      "rating": "0.5/5",
      "review": "Wow they just keep getting worse. I'm almost impressed now."
    },
    {
      "rating": "5/5",
      "review": "one of the greatest movies ever , also why is it listed so low ??"
    },
    {
      "rating": "0.5/5",
      "review": "Worst. Took my son to see it we both hated it"
    },
    {
      "rating": "5/5",
      "review": "Great Movie. I really enjoyed ther Last Knight part"
    },
    {
      "rating": "4/5",
      "review": "While it is definitely not the best movie to come out in 2017 I very much enjoyed watching transformers the last knight.I feel like critics are being too harsh on the movie.there were so many epic scenes to enjoy.My favourite being the part where Cade Yeager literally takes a sword and blocks a transformer swinging a sword.Many epic scenes hidden throughout the film are a testament to Micheal Baes ability as a director to craft scenes of epic proportions that will literally make your skin crawl with goosebumps.Now in my book any movie that gives you goosebumps is a movie done right. Despite all this there are some critisicms that can be made about the movie.However I am not going to touch on that since almost everybody has made the drawbacks of this movie very clear and have in fact gone out of their way to highlight them. I However believe that despite the movie being far from perfect the great things about this movie far outweigh the bad things about it."
    },
    {
      "rating": "5/5",
      "review": "Interesting and exciting. Effects are awesome and the story is so great. Love it."
    },
    {
      "rating": "1/5",
      "review": "Not very realistic and logical that it is so easy to say that the movie is terrible"
    },
    {
      "rating": "0.5/5",
      "review": "AGGRESSIVELY terrible. Only a good movie if you've never seen any other movies ever made. Humor almost always fell flat except for when Anthony Hopkins was on screen. Story, shot to shot continuity, and some vfx are insultingly awful. Any scene where CGI and people interact sucks you right out of the world. One scene comes to mind when I think how bad the CGI is in this movie; theres a scene where one Transformer is in one shot, then they cut to a wide angle and the VFX team didn't even bother putting the CGI in. It was a plastic mold and no body. Audiences aren't blind anymore. I'm glad this series is dead. Only gave it a half star because no stars wasn't accepted."
    },
    {
      "rating": "4/5",
      "review": "Exactly what I expect from a transformers! plenty of fighting robots and I actually enjoyed the strory. Was a bit of fun, good watching if you want to switch off and veg out"
    },
    {
      "rating": "5/5",
      "review": "pretty slow film but dont worry at the end it beckmes the fastest trasformer film! and also brings a chance for characters like unicron and primus and quintessa in the sequel but they might reboot which will be dissapointing."
    },
    {
      "rating": "5/5",
      "review": "every transformers film have something special like tf2 had combiner tf3 had shockwave tf4 dinobots tf5 unicron and i really do hope tf7 dont get cancelled."
    },
    {
      "rating": "2/5",
      "review": "I did not hate this movie but it was a huge disapointment AND THE WORST TRANSFORMERS FILM EVER. The movie was about Mark Wahlberg not the evil Optimus who we rarely saw as evil and this movie focused more on humans than the transformers. And the decepticons aside from Megatron were all horrible and killed off in minutes. It is very good that Travis Knight saved this series with the bumblebee movie."
    },
    {
      "rating": "5/5",
      "review": "i liked it the action scenes and cgi was done great"
    },
    {
      "rating": "2/5",
      "review": "Featuring a Dan Brown-esque plot and deliberate homages to both Ridley Scott and Roland Emmerich, this is definitely the weirdest of these movies. At times \"The Last Knight\" almost feels like it could work,again the plot is bananas and Bay seems to have abandoned some of his worst impulses but ultimately he just doesn't put the work in to make something that could have been enjoyable. And that is what makes this franchise such an oddity. There are five movies that are entirely the vision of a single auteur who just never cared."
    },
    {
      "rating": "5/5",
      "review": "this one is closest to the g1 to be honest 5 stars"
    },
    {
      "rating": "3/5",
      "review": "Transformers the last knight is nothing new but it’s fun. I was never bored I was loving the action and there characters aren’t half bad. Mark Walhberg is good as Cade Yeager and Anthony Hopkins is also good, he’s funny and his butler Cogman is awesome, also the little girl is really good but the script and plot are terrible but this is a mixed bag for me. I’m gonna give transformers the last knight a (B) but from a critic prospective a (C-)"
    },
    {
      "rating": "5/5",
      "review": "i loved optimus prime vs bumblebee and also megatron vs optimus prime it was short 30 second battle but it was beautiful cant wait to see unicron rising and fighting primus critics dont understand unicron and also some transformers fans can they be called fans they havent even seen g1 transformers thats crazy"
    },
    {
      "rating": "1.5/5",
      "review": "Even worse than Age of Extinction... Rating: 1.6/10"
    },
    {
      "rating": "5/5",
      "review": "loved it megatron looking close to g1 look"
    },
    {
      "rating": "3/5",
      "review": "Depending on where you stand with bay and his transformers movies, this movie will either make you sick or further appreciate the next and most likely final walhberg chapter in the saga."
    },
    {
      "rating": "0.5/5",
      "review": "0/10 A complete and utter failure on every single level."
    },
    {
      "rating": "1/5",
      "review": "No clear understanding in what is going on. Basically I thought I was watching a demolition derby more then a Transformers movie. They spent all there time with action and explosions and no thought was put into anything else."
    },
    {
      "rating": "5/5",
      "review": "this film is okay better than 3 but thats about it"
    },
    {
      "rating": "0.5/5",
      "review": "Not even as 10% good as 1st Transformer. It will be my last transformer movie"
    },
    {
      "rating": "3/5",
      "review": "Transformers: The Last Knight is a tired, cluttered, and unfocused instalment in the series, going through the motions with little narrative drive, and in its search for a fresh plot tramples all over the Transformers mythology. Fortunately, it's not as mean-spirited as some of the previous films, it doesn't end with yet another city getting trashed, and it's given a different flavour by the English locations, a sociopathic robot butler, some of the best special effects yet, a twinkly-eyed Anthony Hopkins, and, um, Merlin."
    },
    {
      "rating": "2/5",
      "review": "Worst transformer movie"
    },
    {
      "rating": "3/5",
      "review": "Compared to previous Transformers movies, This one is kind 'better'. confusing/complex storyline, resurrections [the franchise]. The only thing I liked about this one was the upper atmosphere fight scene"
    },
    {
      "rating": "1/5",
      "review": "It is simply a barrage of noises."
    },
    {
      "rating": "0.5/5",
      "review": "Really suuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuucked"
    },
    {
      "rating": "1/5",
      "review": "Hands down the worst movie of the franchise and the most bland and idiotic of all of them."
    },
    {
      "rating": "1/5",
      "review": "This movie was fucking terrible, watched it for the first and only time the other day. Why is Ghidorah flying around in a movie about Transformers, its not a damn dinosaur its a freaking Japanese Kaiju. Story was terrible, Optimus Prime just instantly snapped out of his trance, fallen sucked and why don't they ever quickly kill optimus instead of toying with him."
    },
    {
      "rating": "0.5/5",
      "review": "I didn’t think this franchise could get any worse. I was wrong."
    },
    {
      "rating": "1/5",
      "review": "I usually like movies that turn a good guy bad, but this is one of the worst. The beginning was historically inaccurate, the characters showed almost no character growth, and the movie was an all out war."
    },
    {
      "rating": "1/5",
      "review": "This film was the worst of the franchise. The aspect ratios change so much that it is distracting thing, some characters changed from the previous film and others are introduced out of nowhere. There is also a sequel set-up yet it doesn't make any sense. The one thing I can say is that Anthony Hopkins knows what kind of film he's in and his butler makes this film bearable."
    },
    {
      "rating": "1.5/5",
      "review": "It was pretty bad tbh."
    },
    {
      "rating": "5/5",
      "review": "After watching the movie I thought Anthony Hopkins played a wonderful part, I was entertained and it made me think of just the scale this movie spanned with warships, and entire fleets of jets, alot of effort went into making such a movie, I always have had a heart for movies that take history with a sense of imagination, the notion that sometimes the history we are told isnt always the history that could have taken place intrigue me, It was artistic, and creative."
    },
    {
      "rating": "1/5",
      "review": "After watching, I would who keeps giving Michael Bay money to continue this franchise, because I'm pretty sure those people are fucking idiots."
    },
    {
      "rating": "5/5",
      "review": "Overall it wasn't the best of the franchise. The Editing was very fast and hard to keep out, but everything was blast. I loved the Secret History. Can't wait for the Sequel Hook. Sad to see Michael Bay leave. He has such a talent for such fast paced action."
    },
    {
      "rating": "3/5",
      "review": "Long and confusing plot. Just watch it for the special effects and you're good."
    },
    {
      "rating": "5/5",
      "review": "nemisis prime was great why is megatron strong then they got crap decepticons which they are not helping him"
    },
    {
      "rating": "5/5",
      "review": "this is amazing cybertron sucessfully connecting with earth unicron and plenty of action nemisis prime what else do you want!"
    },
    {
      "rating": "0.5/5",
      "review": "This was the worst movie that has ever been made."
    },
    {
      "rating": "1/5",
      "review": "It should be obvious, to the one person who probably follows my reviews on RottenTomatoes (since I haven't reviewed a film in this franchise on Letterboxd yet), that I've never been a big fan of the Transformers franchise. I'll be honest, I thought the first movie (at the time) was solid popcorn entertainment. But that was still before we were bombarded, figuratively and literally, by these movies. Summer blockbusters have always been about casual, popcorn entertainment, but I do think that there weren't many movies, at the time, like the original Transformers. So, in a way, you could say it stood out and, again, at the time, it was an entertaining movie. With that said and, now, four sequels later (three of which I've seen), I don't know if I could go back and say that the original was a good movie, if I were to watch it again. But, yes, for all intents and purposes, I enjoyed the original movie at the time. 2009 marked the release of the second film in the franchise, Transformers: Revenge of the Fallen. Revenge of the Fallen, in my opinion, has been one of the worst movies I've ever seen in an actual movie theater. I absolutely loathed that movie. It got one star one RT because the special effects were still excellent. If it wasn't for that, I'd have gladly gone half a star, that's how bad Revenge of the Fallen is. It was so bad that I decided to give myself a break and completely skip the the third installment, Dark of the Moon, entirely. I haven't gone back to watch that movie and I likely never will. What would be the point??? Enough time has passed between when I saw Revenge of the Fallen (almost TEN years ago) that Dark of the Moon, as a continuation, would make absolutely no sense to me. Though, if I am honest, it's not like you'll be able to make much sense of this even if you DO follow this franchise's narrative closely. At least that of the \"original\" trilogy. Honestly, I don't know why I came back to the franchise with Age of Extinction. But I suppose the fact that it was a 'new' start with a new cast of (human) characters and it wasn't so tied to the original trilogy. I knew that much was not gonna change as long as Michael Bay was still leading the franchise. And, as much of an improvement Age of Extinction was over, it was still a bad movie. This brings us to The Last Knight which is, hopefully, the last time Michael Bay will ever make us suffer through one of these again. Ok, so, first things first. I know how it's gonna look, giving this film the score I did when I gave xXx: The Return of Xander Cage a positive rating and review. Firstly, at the very least, while there are flaws with its narrative, xXx is fairly cohesive from beginning to end. You know what the goal is for Vin Diesel and his team at all times. Secondly, I liked the cast and the characters ended up growing on you. Thirdly, Donnie Yen. That's all I got. Seriously though, xXx: Return of Xander Cage was definitely silly, but it was fun, for the most part. The Last Knight, on the other hand, is the same type of overwrought, overstuffed and bloated nonsense that you've seen for eleven years now. Not even an astrophysicist could understand even a third of what's going on here, much less decipher any meaning or purpose. Perhaps that's a bit of an exaggeration, but I am not lying when I tell you had trouble discerning anything about the story. I know that Cybertron is on a collision course with earth in order to heal itself. Cybertron healing itself will lead to millions of deaths on earth. That much is fine, it's everything in between that gets you from point A to point B that is so largely terrible. There's something about Merlin's staff that only a direct descendants of his can wield, there's this talisman that attaches itself to Cade for, really, no real reason other than when it's absolutely convenient for the movie to use it, there's this street urchin that is introduced for, again, no reason whatsoever and serves no actual tangible purpose in the narrative of the movie other than to give Cade someone to care for, there's generic military dudes doing generic military things, there's this engineer (played by Tony Hale) who's trying to warn the suits that there's imminent danger here. This character was never given a name, he's just referred to as a JPL engineer in the X-Ray for this on Prime Video. Two-time Emmy Award Winner Tony fuckin' Hale can't even get a name for his character, that's how inconsequential he is. Oh, Optimus Prime is turned evil by his creator. Cade and Vivian, naturally, develop a romance because of course they do, despite not having anything in common or, really, even knowing each other. Megatron comes back and never has he been less effective than he has been in this movie. For SOME reason John Turturro's character returns here, except he's in Cuba, there is this sociopathic transformer Butler that is, actually, the best character in this franchise's history, playing off a cranky Anthony Hopkins. Hopkins and this butler, Cogman, are the best parts of this movie. I was legitimately entertained by the two. Regardless, the point is to make you see how there's so much shit in this movie. Honestly, I wouldn't be surprised if I missed a couple of things. I don't take notes for movies, that's just not how I do things, so I may have missed more than a few things. But, again, there's no rhyme or reason to anything that's happening. The film does not let you think in the slightest. Everything is an attack on your sight and your ears. This might be one of the loudest movies I've ever seen. This is, obviously, by design, given that if they throw all this shit at you, you won't bother to think about how bad the script actually is at putting together a cohesive and satisfying narrative. And, I know what you're gonna say, that nobody who's a fan of this franchise comes to it for a story. Fine, that's fair, but then what is the point? Why is everything happening??? If they made the effort to, at the very least, tell a coherent narrative with a clear beginning, middle and end with no bullshit, maybe they wouldn't hate this fucking franchise so much. As it stands, it's like the script was purposely put together out of order and filmed this way. Like they just grabbed pages at random and that was the way the script was structured. Because nothing really flows from one scene to the next. It's all justifying the next major set piece. The thing is, though, that the only thing taking them to the next set piece is, umm, a set piece. There's dialogue in between these set pieces, but never have I ever paid less attention at dialogue in a Transformer movie as I did with this one. Well, unless it was involving Burton (Hopkins' character) and Cogman, that was the only time I paid any attention. The humans, naturally, are uninteresting so, of course, they focus more on them than on the fucking giant alien robots that transform into vehicles and other objects. I wonder if there's a transformer vibrator. That's a story I could get into. Things happen and you don't even remember them five minutes later. How many of you forgot that Burton died and Cogman, after honoring his 'master', was never seen again??? Come on now, be honest. It has to be in the high 60s, maybe even in the 70s. Nothing has any weight. The film can't have a poignant moment between, literally, the only two characters I've enjoyed in this franchise, because they're worried that the death might not have enough explosions. I mean, it's a Michael Bay movie, so why Burton couldn't have spontaneously blown up is beyond me. Nothing makes sense in this universe, why should death? Izabella, after being introduced, also disappears into the ether and, again, her character (who could have been cool) amounts to next to nothing, because she serves no real purpose in the long run. Optimus Prime is, really, quite a non-factor in the movie. He's turned by Quintessa into Nemesis Prime and, after that, he isn't seen for a BIG chunk of the movie. Because, for one reason or another, the screenwriters think that people care about these human characters. They don't, they're just talking heads. They're there to deliver the lines that you have on your script. I feel like having people talk in Michael Bay's Transformer franchise is a concession he made because he couldn't just put on explosion, after explosion, after massive robot fight, after explosion without just a little bit of context. I honestly don't know what would be preferable. Because while a lot of the unnecessary fat would have cut out, this ultimately still a poorly-structured action movie. There's nothing wrong with a movie being all-action and no story. The Raid did this and it has gone to be revered (by me) as one of the best action movies of all time. The thing is that you have to know how to structure and edit your action so that everything you're seeing makes sense in how it's choreographed and pleasing to the eyes. The last thing that Transformers is is pleasing to the eyes. I mean it's a very pretty movie when it's standing still, it has that Hollywood shine and gloss all over it, but when it's in movement and when the Autobots and Decepticons are fighting each other, all hell breaks loose. All you see is metal clanking against metal and it's all just a blur. You have no idea what you're seeing at any time. They think that throwing everything AND the kitchen sink at you is what you want. No, not really. Well, not that that can't help, but I feel like a more subdued approach would work so much better than this. Black Panther is a recent example, while the film had action (and it was very good), I feel like they used it sporadically so that when they did use it, it meant more and it had more weight behind it. Then again, Black Panther also has one of the best and most complex characters in the MCU and the most complex character in this movie is, say, well, nobody. Another thing is that the film is shot in THREE different aspect ratios, so expect to see Bay rapidly shift between each in the same scene. It's such an awful and jarring effect. I honestly have no idea what the point of it was. It's like three different personalities tried to direct this movie. But, really, the joke's on them, that's just how Michael Bay really is, he's that stupid to actually shoot the film on three different aspect ratios and then rapidly shift between each constantly throughout its bloated run time. I didn't wanna say stupid, because I feel like that's too personal, but I can't think of any other way to describe it. It's stupid and it's not satisfying to see. The movie, even when it's standing still, can't let up with trying to be jarring, hence the three different aspect ratios. It was awful and I hope nobody ever does this again. Not saying it can't work, but use it tactfully and make sure it's to the actual benefit of your film's visual style. Don't just make another attack on the senses. Is this the worst Transformers movie? Honestly, I don't know. Revenge of the Fallen was an awful experience. I don't know if this can surpass that. What I do know is that if it is not the worst, it is the second worst. It's worse than Age of Extinction and worse than even I could have possibly imagined. I think I've made my thoughts on this perfectly clear. This is the same overstuffed, bloated and overlong bullshit that the Transformers film franchise has been since the beginning. The narrative is a bunch of nonsense and is poorly put together. The characters are awful (minus Burton and Cogman). The action is an incredibly loud mess. If this is what you love, then by all means, watch this movie. But this is still very terrible and with it being the least-successful entry in this franchise, I sure hope that this is the last we get of this goddamn franchise. I'm fine with Bumblebee prequel, which is being directed by the same guy that made Kubo and the Two Strings (a movie that I loved). It's a completely different team and I'm hopeful that they're able to inject some life and, most importantly, quality into this franchise. The main Transformers franchise, however, can fuck off. And, if this is the final nail on its coffin (which it probably won't be, given that studios want to compete with Marvel and the MCU), then good fucking riddance."
    },
    {
      "rating": "5/5",
      "review": "i loved it to bits please dont reboot i need unicron"
    },
    {
      "rating": "3.5/5",
      "review": "Great movie action wise. Really enjoy the first half of this movie and the second half final battle is epic."
    },
    {
      "rating": "5/5",
      "review": "It is a very good movie"
    },
    {
      "rating": "1.5/5",
      "review": "Wow. That was a complete disaster. You could literally look away for 10 minute stretches and not miss anything. Way too long and drawn out. Confusing scenes. Piece of junk!"
    },
    {
      "rating": "1.5/5",
      "review": "I gave it 1 and a half star review cause it feels dry feels like it is the same movie over and over"
    },
    {
      "rating": "1/5",
      "review": "way too fast paced, too many cuts. one scene particularly is in a run down town in a desert, the next cut is of them running through an abandoned city, then it cuts back to a desert town... wtf. Was it just me? Or did every camera change also mean the height of the scene was changed? I watched on amazon prime so maybe that was the issue..."
    },
    {
      "rating": "0.5/5",
      "review": "Made no sense at all. Did not explain anything and had too many storylines"
    },
    {
      "rating": "5/5",
      "review": "Guys pls stop hating on these films I like them all"
    },
    {
      "rating": "1.5/5",
      "review": "What did I just watch?!"
    },
    {
      "rating": "0.5/5",
      "review": "this movie is the worst transformers movie"
    },
    {
      "rating": "0.5/5",
      "review": "The worst of the worst... no plot...forced humor... poorly executed"
    },
    {
      "rating": "0.5/5",
      "review": "I spent years getting a bachelor's in biology education, master's and PhD in biology. This movie is the exact opposite of all of that. No where in this plotless, incoherent frame sequence could there be anything considered close to a rational thought. All of us who have watched it are now dumber for having watched it. I award Mr. Bay no points and may God have mercy on his soul."
    },
    {
      "rating": "3/5",
      "review": "Over the top as fuck! A hell of a mess. Too many characters, too many transformers. Shitty cut scenes yet still in my opinion NOT THE WORST TRANSFORMERS FILM. That will always be Transformers 3"
    },
    {
      "rating": "1.5/5",
      "review": "When a movie is successful the studio inevitably tries to keep milking the cash cow. The next step to the udder of box office revenue is a sequel followed by a trilogy and if possible the Golden Fleece of cinema, the full-fledged franchise. while the horror genre is infamous for the sheer volume of reaching that level along with an unusual measure of longevity. A close contender must be action flicks. Several examples have even been resurrected after decades of inactivity creating a new archetype, the action hero with an AARP membership. One of the more recent popular franchises is the career-defining movies by director, Michael Bay. He took a popular line of toys from Hasbro, resurrecting its spinoff cartoon television show into a series of movies that have become the epitome of action films defined by excessive, over the top special effective with an unavoidable lack of plot or even a modicum of originality. The line of toys that enabled such a substantial collection of movies to exist was 'The Transformers'. Although they seemingly appear to be mundane vehicles running the gamut from big rig trucks to Volkswagen beetles, they are sentient extraterrestrial warriors fighting to keep the universe, particularly planet earth, safe from their evil counterparts, 'The Decepticons'. Both groups routinely rearrange their configuration transforming into anthropomorphic warrior robots. In most franchises a phenomenon referred to diminishing returns is in effect. Each successive instalment of a franchise receives predictably lower critical assessment to the point where film considered here, 'Transformers: The Last Knight', received an aggregate score of around 15%. What guaranteed the continued support of the studio is the fundamental fact that the franchise remains profitable. This latest offering did loss a considerable portion of the investment, but the bottom line oriented executives understand that the income from cable TV, streaming services and home media will likely make up the difference. Using the popular analogy of cinema as a dining experience there are time when you need a fine, five-star meal but other times the guilty pleasure of fast food fills your craving. It, might be the proverbial 'all sizzle and no steak' but it does appeal to the inner child lurking within. There is a certain degree of liberation for a filmmaker such as Mr. Bey when his best-known work has become synonymous with bad movies driven by extraordinary special effects. He realizes that the normal constraints applying to maintain continuity no longer represent a professional or artistic criterion. All that matters is to satisfy the puerile expectations of the target demographic, teenage boys, augmented by adult men still dreaming of a carefree youth in the dark of the neighborhood theater. To this end, Mr. Bey threw caution, and plot consistency, to the wind taking the audience back in time to 484 CE, the period of the legendary King Arthur (Liam Garrigan). The King is shown leading his valent knights against the Saxons. To ensure their victory Merlin (Stanley Tucci) seeks the assistance from the Knights of Iacon, a group of twelve Transformers that were hidden on Earth. Apparently, our planet is a favorite place for sentient machines to hide. The Knights bestow on Merlin yet another powerful extraterrestrial artifact, staff. The Knights then change, combining themselves into a giant dragon with an appropriate Medieval name, Dragonstorm. With the creature's assistance Merlin is victorious over the Saxon. Before the conclusion of this prologue, the Knights warn Merlin that one day something very evil will seek the staff. This is a standard plot device that conveniently connects the past to the present. The story resumes two years after The Battle of Hong Kong; the climactic special effects showcase from the franchise's previous installment. 'Transformers: Age of Extinction.' Resulting from those events all the world governments have renounced the Transformers declaring them outside the protection of the law. The enforcement of this was given to the Transformer Reaction Force (TRF), formed to eradicate all Transformers and any alien robots. The TRF used members of the former elite CIA black ops unit known as Cemetery Wind. Any fan of the genre can easily predict the outline of the next pages of the script. Enormous metallic horns begin appearing around the globe. Near the battle ruined Chicago, a group of kids stumbles across a spaceship that contains one of the knights. As a TRF surveillance drone is about to locate them, a survivor the battle, Izabella, an orphaned girl, rescues the children and Transformers. She is with by her two faithful Transformer companions, Sqweeks and Canopy. They are small versions of Transformers constructed by sundry parts. The primary function of these characters is comic relief and toys ideally suited for marketing. They make their way to one of the persistent human characters, Cade Yeager (Mark Wahlberg). At this point, some of the pertinent cast members are inserted. The tracking device of fan favorite Transformer, Bumble Bee and a squad of Decepticons including Nitro Zeus, Dreadbot, Mohawk, and Onslaught. They were being detained, but their services were requested by Megatron, the brother of the leader of the Decepticons, and the brother of the Autobot leader, Optimus Prime. This sets the pieces on the board prepared for action. Normally this plot development is referred to as setting the chess board. Considering the over-simplicity of the storyline a checkerboard would be more actuate. As is often the case with franchise degradation, the initial outing represents a sufficiently well-crafted movie to gather a core group of loyal fans. When the first sequel hits the cineplex, the quality is often close enough to its progenitor that with the story directly following the initial that the fans can allow themselves the relative luxury of self-delusion regarding the increasing downward spiral; This movie is considerable down that slippery slope of mediocrity that ultimately is given a perpetual among worst movie lists and notable Razzie winners. When a story possesses such a dearth of original material that a directorial choice to judiciously edit the movie to a concise account could have provided a substantially better experience. Instead the infamous Bay Bloat with a running time of 165. The theater tickets should have included a complimentary tube of Preparation-H. It is certain that only a minuscule portion of the estimated $216 Billion budget allocated to acquiring the services of a professional script doctor. Over six hundred of the closing credits are dedicated to Special Effects and Visual arts with close to a thousand more listing representing stuns, lighting and sound. The regrettable conclusion that is inevitable is that sitting in the dark watching that seemingly endless list of names scroll by is significantly more coherent and arguably more entertaining than the movie. The film is little more than a demo reel of the special effects companies that managed to secure their immediate financial security by winning the contracts to participate in the movie. Considering the expanded profit opportunities afforded by the numerous forms of home entertainment it is feasible that this is not the end of the franchise or Michael Bey's commitment to the financial security of special effects wizard"
    },
    {
      "rating": "3/5",
      "review": "i didnt hate The Last Knight i hated Age of Extinction"
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie I have ever seen."
    },
    {
      "rating": "0.5/5",
      "review": "A shittier version of part 3 and part 3 was pretty bad too."
    },
    {
      "rating": "1.5/5",
      "review": "We all know the Transformers franchise is a dead horse at this point and, despite the cool looking trailer, the fact that we'd all officially had enough of giant alien robots fighting other giant alien robots by the time Age of Extinction came out on DVD and Blu-ray meant that, for anyone who didn't mind a fourth film, the franchise finally overstayed its welcome. The box office grosses certainly do a good job of backing me up on that statement. Same old, same old and NC was right. Well-done special effects and sound design with the humans' performances being ironically, more robotic than the actual robots with decent voice acting. All while Michael Bay and the screenwriters mistake robots cursing and Austin Powers-esque sex jokes for classic comedy. The action sequences aren't even that thrilling anymore and I didn't care what happened to anyone regardless of their benevolence or malevolence. This movie also has terrible editing as well. I could barely comprehend what was going on thanks to the editors jumping from the US to Cybertron to England. Coupled with an annoying change in aspect ratio that aren't even to witness something visually stunning like with Interstellar and Tron: Legacy. It's even when Merlin is trying to reason with a Transformer knight. The continuity has become really convoluted at this point. I may not jump on the Bay-phobic bandwagon but I will agree this movie is awful. Let's hope Travis Knight can do a good job with the Bumblebee spinoff seeing how he already directed one amazing animated movie."
    },
    {
      "rating": "4/5",
      "review": "To be fair, this is not the most complex plot ever invented for a movie of this type. I have watched it twice now, and I must say that it is a very enjoyable and entertaining film to watch. I congradulate Michael Bay for a well-produced and fun cast that delivers one of the better movies of the Transformers genre. Hopkins is an excellent choice to develop all the King Arthur story line is short order. Wahlberg and Haddock provide very enjoyable interactions throughout the entire film. I find the criticism of this film on par with the current misjudgment and mistrust of many critics reviews. It seems they approve the movies that provide funding for themselves far greater than objectively reviewing films with integrity. Many films in the 2017 era can be seen to have a wide disparity between critics and audience scores. This film was an exciting story that, despite some flaws, was an enjoyable movie to watch."
    },
    {
      "rating": "0.5/5",
      "review": "I want to give this movie ZERO stars. I dont expect tons of character development or the most logical of plots. But this has nothing even close to any of it. This is like they took an idea board for all the previous movies, put a twist on them and just do them all in one movie. Absolutely abysmal"
    },
    {
      "rating": "2.5/5",
      "review": "Although this movie was kinda bad, I did actually like it. It had great action scenes, the humor was okay. But it was said that this was the last in the series so this would be a good movie if you focused more on the robots then the humans. And instead of Unicron being earth, the earth could become the Omega Lock and we could finally see returning characters from the old films. But it was an entertaining ride to sit through."
    },
    {
      "rating": "0.5/5",
      "review": "Didn't spend a dime of my money on this when it was in theaters but someone explain to me why I am so angry watching it on Hulu?? Must be because it wasted an hour of my life! Complete garbage on top of garbage! Couldn't finish it didn't want to finish it!"
    },
    {
      "rating": "0.5/5",
      "review": "Zero acceptable dialogue, oh my holy goodness!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Bay can't make movies. It's a good thing that he finally stopped, for good this time. -100/10 B's (never see a movie directed by Michael Bay, because they all suck)"
    },
    {
      "rating": "5/5",
      "review": "i like this film in the franchise"
    },
    {
      "rating": "0.5/5",
      "review": "Possibly the worst movie I've ever seen. I'll never get that 90min of my life back"
    },
    {
      "rating": "0.5/5",
      "review": "A lot of money was spent to make a terrible movie."
    },
    {
      "rating": "3.5/5",
      "review": "enjoyable, great action sequences"
    },
    {
      "rating": "0.5/5",
      "review": "Urg.... its amazing I even sat through this entire thing. Pure garbage."
    },
    {
      "rating": "1/5",
      "review": "Ok, so I have tried to watch this. No character development. I really just don’t get most of it. An unfortunate disappointment given the cast."
    },
    {
      "rating": "2/5",
      "review": "Better than the last one. Prime is barely in it."
    },
    {
      "rating": "0.5/5",
      "review": "The Half Star goes entirely to the Special Effects Professionals, as I have always thought the transformers look kind of cool. Otherwise this movie is practically unwatchable. Literally, it moves so fast and the characters are practically speaking another language they're so out of tune."
    },
    {
      "rating": "0.5/5",
      "review": "This story should be stopped on the third part."
    },
    {
      "rating": "0.5/5",
      "review": "even worse than age of extinction!"
    },
    {
      "rating": "0.5/5",
      "review": "absolutely Terrible. omg worst Transformers movie ever."
    },
    {
      "rating": "1/5",
      "review": "I thought its predecessor Age of Extinction was one of the worst movie ever made, this one is worse. How can they waste over 200 million dollars in making this? Can't say even one good thing about the movie, the direction, editing, script, dialogues and acting, all were just horrendous."
    },
    {
      "rating": "5/5",
      "review": "Interesting if you hold to the standards of a Michael Bay film but tedeous if you expected more"
    },
    {
      "rating": "0.5/5",
      "review": "I had the bad luck of catching it on hbo. unwatchable."
    },
    {
      "rating": "4.5/5",
      "review": "This was the best Transformers movie. The others were entertaining but just ok. This one had a great story and enough breaks in between the action to catch your breath."
    },
    {
      "rating": "1.5/5",
      "review": "Super disappointing. So many inconsistencies, and story/ scenes that didn’t make sense. And horrible acting. Marky Mark can’t carry leading role."
    },
    {
      "rating": "2/5",
      "review": "The best part of this movie is the action, the story was very lack luster. I think it had potential with a good cast including Anthony Hopkins, but the writting always falls short in these movies. You can watch it over and over for the action, you just might scratch your head at certain spots."
    },
    {
      "rating": "1/5",
      "review": "Take 15-20 Transformers toys, 5 matchbox cars, and 3 dinosaur action figures. Stick them in a Ninja Blender. Hit Frappe for 2 1/2 hours. That's what this is. This is not a movie. This is a headache."
    },
    {
      "rating": "0.5/5",
      "review": "This wasn't even a movie."
    },
    {
      "rating": "0.5/5",
      "review": "I was completely lost. It reminded me of a film that was put together by junior high students at best."
    },
    {
      "rating": "0.5/5",
      "review": "Half a star is too many."
    },
    {
      "rating": "0.5/5",
      "review": "Was this edited by a three year old? Maybe it an adult on meth? This movie made absolutely no sense keeps jumping from storyline to storyline with no backstory making no sense whatsoever. this show was an absolute turd!"
    },
    {
      "rating": "0.5/5",
      "review": "Utter piece of crap. I only watched it because it was free on Amazon Prime."
    },
    {
      "rating": "1.5/5",
      "review": "Okay lets start with the good part, it has an amazing and seamless visual effects, its an improvement to the last one (age of extinction), it has a good musical score, and that's all, now lets go to the bad part, it has a bad story, bad plot and has a lot of plot holes, a lot of nonsense subplots/military subplots, a lot of side characters and clichéd characters, cringe worthy humour but its less cringe worthy than the previous ones, i didn't hate the last knight, its still entertaining especially for normal movie goers, the ending is entertaining but is still bad and the new bumblebee is really good, Mark Wahlberg is better in this one and his chemistry with Laura Haddock is amusing, but in the end this movie is basically just the same as the previous ones, oh i also want to mention the changing of aspect ratio in the movie, it annoys me so much"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is terrible. So terrible I created an account just to say this movie is terrible. :)"
    },
    {
      "rating": "0.5/5",
      "review": "This has to be one of the worst movies ever made. Everyone involved should be ashamed. It's like a poor man's National Treasure but with no redeeming value."
    },
    {
      "rating": "2/5",
      "review": "Transformers 5 good, it's good but not so good, good plot, good special effects, I do not like something that gives much importance to humans, but it turned out to be something better than the fourth installment"
    },
    {
      "rating": "0.5/5",
      "review": "I think Michael Bay wanted to put everything he could think of in the movie. And he did. To properly make this movie, it would have to be about 6 hrs long."
    },
    {
      "rating": "5/5",
      "review": "The transformers movies always seem to be disliked because for some reason they use a large amount of special effects. But how would movies about robot aleins with fighting eachother be any good without tons of special effects. Besides this one has the best story and cast in my opinion. You got Hannibal Lecter in it(Anthony Hopkins) and other famous actors in the film. What makes this a good transformers movies as it's much different than the last four. Transformers the last knight is awesome."
    },
    {
      "rating": "5/5",
      "review": "i loved this film i want a conclusion you cant do this to transformers"
    },
    {
      "rating": "2.5/5",
      "review": "The only redeeming part of this movie is Sir Anthony Hopkins deciding he's just going to do whatever he wants, both in the story and in the real world in taking all of these bonkers roles. Listen, we all knew what we were getting into when we sat down to watch this movie. Mark Wahlberg being Mark Wahlberg, Michael Bay level shitty explosions, and a vague attempt at a plot that seems relevant to the world today. I'm not mad, I'm just disappointed in myself for falling yet again. This franchise has gotten about $100 from me in total, and that's a new level of masochism few have reached."
    },
    {
      "rating": "3.5/5",
      "review": "Transformers: The Last Knight is an exciting apocalyptic adventure, Michael Bay style. After leaving Earth to find his creator Optimus Prime returns to Cybertron and finds it completely destroyed but meets a powerful goddess who promises that she can restore it; meanwhile a British secret order assembles a team to recover a lost Cybertronian weapon that can stop a coming apocalypse. Anthony Hopkins joins the cast and delivers a pretty strong performance, and Laura Haddock has a lot of charisma and good chemistry with Mark Wahlberg. Additionally, a couple of cast members from the original trilogy return; provoking some nice series continuity. And as always, the special effects and fight sequences are exceptionally well-done. One of the better entries of the series, Transformers: The Last Knight is a thrilling, big-budget sci-fi film."
    },
    {
      "rating": "0.5/5",
      "review": "total crapfest. only good acting is done by Anthony Hopkins. this movie is directed w/all the subtlety of fingernails on a chalkboard."
    },
    {
      "rating": "2.5/5",
      "review": "Cheesy. Michael Bay explosions. Exactly what you would expect.(50%)"
    },
    {
      "rating": "1.5/5",
      "review": "JUST QUIT!! Grade: C-"
    },
    {
      "rating": "2/5",
      "review": "What a hot mess for a movie! Incomprehensible, fast paced and bloated, two stars because we always enjoy Optimus kicking ass."
    },
    {
      "rating": "1.5/5",
      "review": "I'm sorry but despite the Mark Wahlberg brilliance and English humor it was hard to bare. There was too much going on at any time and most of the jokes were used before, it was too long and too complicated."
    },
    {
      "rating": "5/5",
      "review": "i really enjoyed this dont understand the hate towards this film"
    },
    {
      "rating": "2/5",
      "review": "I wanted it to be good but it was a mess. Stop making these movies Bay"
    },
    {
      "rating": "4/5",
      "review": "It could of been better because Optimus prime was in there for 5 minutes."
    },
    {
      "rating": "5/5",
      "review": "Throughly enjoyed this movie!! Much better than Age if Extinction. Love the fact Megatron was a badass again in this movie!!"
    },
    {
      "rating": "3.5/5",
      "review": "it was a great movie love it its my opinion i love the baysformers movies this is my personal favorite"
    },
    {
      "rating": "3.5/5",
      "review": "Clearly the Transformers series has overstayed its welcome (it probably did that by the 2nd installment) for this the fifth(!!) film is an abomination. The narrative is pretty much one thing: Giant robots punching one another as hapless humans flee for their lives but what is shocking is that even these CGI ridden overloaded set pieces stop making sense after about ten minutes in. In fact, most kids (or anyone brave enough to go watch this) will have a hard time telling who is fighting who. Even by Transformers standards this one stinks to high heaven, and that is saying something."
    },
    {
      "rating": "3.5/5",
      "review": "I actually liked it."
    },
    {
      "rating": "3/5",
      "review": "Almost like a tourist rollercoaster ride through ancient artifacts from museums to old castle homes, and famous old site visitation like The Stonehenge that somehow remained undamaged from an avalanche of bulletfire and bomb attack. Excellent 4k bluray sights and sounds, but jumpy with the occasional blackbar non-IMAX scenes. Enemy has weakness and strength- a weakness of removing the 12 guards protecting the female robot villain too preoccupied on planet reconstruction and she never showed much in defending herself."
    },
    {
      "rating": "0.5/5",
      "review": "I love transformers but this was the worst movie ever."
    },
    {
      "rating": "3/5",
      "review": "6/10 better than the rest... still childish"
    },
    {
      "rating": "5/5",
      "review": "people may think its bad but its not about megatron now its about unicron"
    },
    {
      "rating": "0.5/5",
      "review": "Transformers has been a huge disappointment all together. Its a shame. Good childhood memories."
    },
    {
      "rating": "0.5/5",
      "review": "The Last Knight? More like Hopefully the last one"
    },
    {
      "rating": "0.5/5",
      "review": "Sin relevancia, un film que no cuenta con ningun punto fuerte,aburrida y mal dirigida mal actuada mal montada, simplemente un chiste completo."
    },
    {
      "rating": "0.5/5",
      "review": "Transformers: The Last Knight shows that there is suprisingly more to the Tranformers franchise. More to ruin that is"
    },
    {
      "rating": "5/5",
      "review": "I loved the movie a lot"
    },
    {
      "rating": "3/5",
      "review": "The original Transformers went big. Every minute of it was packed with action. I was eager to know what would happen in the next minute. Revenge of the fallen which followed next suffered from the writers' strike prevalent at the time. And so began the downhill. They dropped Megan in a prequel comic. Dark of the Moon was only a massive explosion. I believe they suffered from an urgency to go bigger. They needed to outdo themselves. In 2007 when the first film came, they didn't need to go bigger than anything, they just went for it. Disaster struck when Shia and everyone we knew were dropped in the fourth film. Mark is no bad actor, just that transformers franchise never needed a no-nonsense badass guy who always tried to act tough. Shia had all the elements to retain the lightheartedness. Introduction of Mark gave the idea that the franchise is taking itself too seriously. And we have come to this. It is saddening to see what has befallen a series that started with a film which still remains my most favourite film."
    },
    {
      "rating": "1.5/5",
      "review": "The Transformers truly deserve better. Michael Bay directs the fifth installment in this lackluster series, starring Mark Wahlberg who would rather be anywhere else, and Anthony Hopkins who is just having fun being in a dumb popcorn movie. The plot is a jumbled mess, with era's changing and plot lines making no sense, it was clear multiple stories were just thrown together without care. The visual effects sometimes are great but overall are awful, Continuity errors with the Transformers for some reason. The aspect ratio changes nearly every shot and it's annoying, the acting is awful, the comedy is cliche and terrible. The music is alright, but utilized horribly. Optimus Prime is barely in the movie. Him being evil is lackluster and doesn't live up to what a Nemesis Prime could be. The villain is interesting but never explored. This film doesn't make sense as being apart of 4 other movies. The transformers are very good however, Peter Cullen and Frank Welker do an incredible job as Optimus Prime and Megatron. The new additions such as Isabela Moner are horribly written and not utilized well at all, there's literally a line where they ask her \"what are you doing here?!\" and she says \"I don't know!\" This movie is a guilty pleasure it's laughably bad, and I highly recommend watching this train wreck of a Transformers film."
    },
    {
      "rating": "0.5/5",
      "review": "PLEASE GOD NO. PLEASE NO, NO."
    },
    {
      "rating": "5/5",
      "review": "people give hate but i understand everything and micheal bay does a great job"
    },
    {
      "rating": "1/5",
      "review": "Horrible in every way. This movie is for dumb people."
    },
    {
      "rating": "2/5",
      "review": "Transformers: The Last Knight (2017) Plot: Our world's greatest hero becomes our fiercest enemy when Optimus Prime launches a mission to save Cybertron by destroying Earth. Now Bumblebee and Cade Yeager (Mark Wahlberg) must lead the Autobots against their former ally in the ultimate battle to save mankind from annihilation. Review: This epic movie certainly looked amazing and the attention to detail was great but from an entertainment point of view, it was a total let down. The storyline was all over the place, and the human characters became extremely annoying after a while, except for Anthony Hopkins (Sir Edmund Burton), and his reliable robot Cogman, voiced by Jim Carter. Mark Wahlberg (Cade Yeager) didn't seem like he wanted to be there most of the time, and Laura Haddock (Vivian Wembley), the Angelina Jolie lookalike, didn't suit her role. Stanley Tucci (Merlin) made me laugh and Josh Duhamel (Colonel William Lennox) played a convincing soldier but I didn't see the point to the little girl Isabela Monet (Isabella), who seemed to get in the way most of the time. Anyway, with the Autobots still at war with the Decepticons, as usual, the humans are out to capture all of the Transformers, and with Optimus Prime gone, they are all in hiding with Cade helping them to survive. Optimus Prime finds his dead home planet, Cybertron, and meets his alleged creator, Quintessa, who tells him that he needs to get Merlin's staff to absorb Earth's energy to restore their home-world. Meanwhile, Cade is given a precious mechanical talisman from a dying Autobot Knight, and while he is battling against the TRF drones, he is approached by Cogman who invites him to the UK to meet his employer, Sir Edmund Burton, who shows him the history of the Transformers and the power of the staff. To get to the staff, he needs the help of Vivian Wembley, who is a English Literature Professor and has the power to control the staff, so they set of on there mission, with Optimus Prime close behind them. Whilst battling against the TRF and Quintessa's soldiers, there is a race to get to the staff before it destroys earth. There was much thought behind the storyline but I personally thought that it was a right mess. It also lacked wit and there wasn't much depth to the various characters. With that aside, the action scenes were half decent and the transformers looked great but it wasn't enough to save the movie. I really think that they need to go back to the drawing board with this franchise, because all of the movies haven't been that great, and they seem to be getting worse. If they do decide to release another Transformers, they really need to think about character building, more than the CGI content, even though it made a decent profit at the box office. Average! Round-Up: This movie was directed by Michael Bay, who brought you the Bad Boys franchise, The Rock, Armageddon, Pearl Harbour, The Island, The Transformers franchise, the great Pain & Gain and 13 Hours. With so many hit movies behind him, I'm not surprised of the scale of this movie but I still wasn't impressed with the outcome. The corny script and poor acting has been the main problem with the whole franchise but they all seem to make a lot of money, for some unknown reason. With another Transformers movie in the pipeline, due to be released in 2019, I hope that they choose another director for the project, who will give it a fresh concept, and hopefully a decent cast. Budget: $217million Worldwide Gross: $605.5million Genre: Action, Adventure, Sci-Fi Cast: Mark Wahlberg, Anthony Hopkins, Josh Duhamel, Laura Haddock, Santiago Cabrera, Stanley Tucci, John Turturro, Isabela Moner, Jerrod Carmichael, with the voices from Peter Cullen, John Goodman, Ken Watanabe, Jim Carter, Steve Buscemi and Omar Sy. 4/10"
    },
    {
      "rating": "0.5/5",
      "review": "Watch genius Michael Bay explode a junkyard down your throat!! TRANSFORMERS: THE LAST KNIGHT I have endured many bad things in my life. However, having to watch Michael Bay self-promote himself every time I went to see an IMAX movie in the last 4 months might be one of the worse. It is the fifth movie of the franchise. Last time, I had to sit through 3 hours of a glorified toy commercial. But this time, it's different! This time it has knights! If you couldn't spot the irony in the last sentences, you might be capable of writing a screenplay for a Transformers movie, congrats! I do have to say that consistency is key and this film sits alongside Moon and Extinction to create a shiny metal catalog of what NOT to do in a movie. With next-to-rubbish performances, a latina character that since Logan can be considered token, misused nazi imagery, repulsive script with the usual dose of racism, the blatant and constant shifts in aspect ratio which wouldn't allow me to be pulled into the movie, etc, etc. The only thing I'm not as mad this time around is with the cinematography, which I have to admit as having less blues and oranges and a saturated color pallet to a more crisp image (sometimes). In a lot of ways, this film is the epitome of what can be done in visual effects as the titular creatures have never look greater. Yet, as usual, they are trapped in a movie critic's nightmare. It would be a truly out of body experience if I could turn off my brain and enjoy this film but the movie simply won't allow it. This is what happens when you give too much power to a director that likes to have it his way. Of course he'll want to shoot it from 20 different angles, he has the money to do so and absolutely no point of view to choose just one! And of course the editing is going to keep those same 20 angles because if you keep cutting, the audience will be entertained, right? What annoys me the most is that an action movie will continue to have its action overcut and disorientating in the fifth try! There is no order, no excitement and no enthrallment if you can't understand what's happening. Is cinema just noise and explosions? It seems like the original cut of this film had 3h and someone came in and said \"No, take 5 seconds out of every shot, that'll do it!\". Furthermore, Hopkins is a dud, it's revolting to see such a great actor so desperate for a fat paycheck and the whole templars/middle age storyline is so uninteresting and disconnected and it's sad that no one could have scrapped that out. In about 30 years, what movies will be chosen to tell our story? Judging from the current state of our political and social panorama, I would say that this testosterone-filled, rushed chicken feed and unimaginative piece of \"film\" might just make us justice."
    },
    {
      "rating": "5/5",
      "review": "watched it in cinemas had no problems with it only megatron and decepticons were weak"
    },
    {
      "rating": "5/5",
      "review": "i have no problem if hey make 70 more they get better and better"
    },
    {
      "rating": "2.5/5",
      "review": "The only reason that I think that this movie is bad is that it's a disappointment more than anything. When you go to see a transformer movie, you expect to see giant robots fighting, but instead you get a history lesson about King Arthur. But otherwise, I thought it was passable."
    },
    {
      "rating": "1.5/5",
      "review": "Drawn out, overly long utter drivel, with the occasional spectacle of CG sensory overload. If a movie ever had HADD this it. Makes no sense, and never settles on anything long enough to even try."
    },
    {
      "rating": "0.5/5",
      "review": "This movie does not live up to 2018 standards."
    },
    {
      "rating": "5/5",
      "review": "I liked it a lot it was a good popcorn movie"
    },
    {
      "rating": "0.5/5",
      "review": "The most confusing, chaos-driven and illogical installment in the Transformers franchise - and that's saying something. From the sheer absurdity of the plot and narrative, to the mashup of several different myths and religious stories, this is a classic example of what you can expect from a Michael Bay movie. Let's keep our fingers crossed it's the last."
    },
    {
      "rating": "0.5/5",
      "review": "If it's not the worst \"Transformers\" film to date, it definitely has the worst story."
    },
    {
      "rating": "0.5/5",
      "review": "Another painful transformers movie. Boring, slow paced and not fun"
    },
    {
      "rating": "2/5",
      "review": "The movie transformers : The last Rider, has disappointed Manu people , including me. It brings a lot of repetition from previous films anded up being predictable. Lidiane de Camargo e Leonardo Pivetti 2°ano D"
    },
    {
      "rating": "0.5/5",
      "review": "Useless and Forgotten. Transformers The last Knight is boring and time wasting."
    },
    {
      "rating": "3/5",
      "review": "I like Optimus Prime Bumblebee Dragonstrom and Aliens style i not fan micheal bay i don't like junk clothing or some ugly shots and Yeah"
    },
    {
      "rating": "1/5",
      "review": "Damn, this movie was a huge piece of garbage. None of the characters made any sense, and the whole story was stupid. This was a waste of a movie, it gave me a physical cringe that I couldn't shake for the rest of the evening. Please, no more transformer movies."
    },
    {
      "rating": "0.5/5",
      "review": "Wow - this was a hot mess of a film. It's been said that good storytellers use \"therefore\" and \"meanwhile\" as the glue between scenes while the hacks just say \"and then...\" ad infinitum. You could rightly have titled this film, Transformers: And Then..."
    },
    {
      "rating": "1/5",
      "review": "Just the absolute worst."
    },
    {
      "rating": "5/5",
      "review": "It is a good movie, worth the time."
    },
    {
      "rating": "1.5/5",
      "review": "\"Transformers : The Last Knight\" Wasn't Even Fun. It Was Cringy, Poorly Edited And With A Truly Awful Script. Anthony Hopkins And Mark Wahlberg Were At Their Weakest Performances And The Only Thing That Michael Bay Could Do, At Least Decent ( The Action Sequences) Were Bad, Poorly Edited And Cringy. The Question Remains : Why Keep Making This Movies?"
    },
    {
      "rating": "2/5",
      "review": "One word - HORRIBLE!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely awful film. The plot is ridiculous add the whole story is a complete mess. The acting is also fairly dire, Sir Antony Hopkins what were you thinking? The robots are still pretty awesome, but if I was you I would find something much more interesting to do with 2 and a half hours of your life!"
    },
    {
      "rating": "4/5",
      "review": "Preferred this film to all of the others. Still confusing during battle scenes as to who is who but the story was more interesting and they turned down the cheese........ Only a little."
    },
    {
      "rating": "0.5/5",
      "review": "Feels like a script written by a committee rather than anyone who knew the source material"
    },
    {
      "rating": "5/5",
      "review": "The movies kind of grow on you the more you watch them."
    },
    {
      "rating": "1.5/5",
      "review": "Over long. Another mind numbing entry by Michael Bay. It just has just loud explosions. A plot that is not only terrible and just undermines everything that went on before. Michael Bay should never direct another film ever."
    },
    {
      "rating": "0.5/5",
      "review": "An absolute mess. Michael Bay couldn't tell a story if his life depended on it. How are they still financing these piles of pig crap"
    },
    {
      "rating": "4/5",
      "review": "Great movie. Captivating human characters with humorous interaction with the alien machines. I felt the ending was a cacophonic mash of confused scenes. And one CORRECTION - Namibia is not in West Africa"
    },
    {
      "rating": "0.5/5",
      "review": "I would put 0 stars but, unfortunately that mark does not exist"
    },
    {
      "rating": "2.5/5",
      "review": "Insipid and incomprehensible in the way only a Transformers film can be. This one, I think, in particular panders to 13 year old boys - which is fine! Play to your demographic, because aint no one else buying this shit anymore. It's entertaining from a detached perspective, mostly because of the constant awe of seeing exactly what Michael Bay can make his Cohen Bros. cast (and Anthony Hopkins) do for cash. Transformers 5 is anti-art, but as a MOVIE - for idiots (the only fans left) - it's as \"sure that was fine I guess\" as it gets."
    },
    {
      "rating": "4.5/5",
      "review": "Not as good as any of the other ones. But It's still a great action movie that's so entertaining. Mark Wahlberg was great in this movie just like the last one. Loved it. So much fun to watch, and great experience to enjoy."
    },
    {
      "rating": "1.5/5",
      "review": "this is the worst transformers movie ever displacing age of extinction . the visuals were okay but the storyline was bad , indeed bad"
    },
    {
      "rating": "0.5/5",
      "review": "This film was a complete disgrace to the Transformers franchise. It is indeed the worst movie directed by Michael Bay"
    },
    {
      "rating": "4.5/5",
      "review": "This and AOE I watched in the theatre, the first ones I did watch there. And that's why they're always gonna be my faves of the 5. AOE is my No. 1, but the final fight in this... good god, where to start. The gyroscopic action because of the crumbling Chamber, the epic 'We Have To Go' song by Steve, hearing Prime and Megs original Latin American dub actors from the trilogy back into their roles after they're absence from the 4th blasting through the speakers (I watched in Spanish, yes), each and every single one of the aspects of this final fight is a monument to the amazing cinematic universe created by Michael through these 10 years and I'm hurt that Hasbro canceled all future proyects except for Bumblebee. But these films forged my love for action, special effects, epic music, explosions and of course Linkin Park. These are not to be viewed as Shakespeare proyects, never were and never will be. They're fun and entertaining movies to spend a while with your friends and family. Critics look to dismember these as 'the disasters they are' and, frankly, I also have my gripes, but they don't take away the fun factor. I enjoy them everytime and will never get tired of watching them.?"
    },
    {
      "rating": "0.5/5",
      "review": "No. Just no. I despise this movie and Michael Bay along with it."
    },
    {
      "rating": "1.5/5",
      "review": "What The F***ing s*** is this piece of garbage."
    },
    {
      "rating": "3/5",
      "review": "Ya es la numero 6 y empieza a ser mas de lo mismo 6/10"
    },
    {
      "rating": "4/5",
      "review": "When watching this movie, every action seemed to be cut short and seemed unfinished. Wish they would have drawn on the story they already had instead of making up more nonsense especially when the lore set into the canon was retconned by Bumblebee"
    },
    {
      "rating": "1.5/5",
      "review": "Movie at the lowest level... Not worth your time..."
    },
    {
      "rating": "5/5",
      "review": "please dont do a reboot thisis my childhood and now just ahhhhhh"
    }
  ]
}