{
  "movie_name": "Star Wars: Episode VI - Return of the Jedi",
  "reviews": [
    {
      "rating": "5/5",
      "review": "More action packed and intense than the empire strikes back."
    },
    {
      "rating": "5/5",
      "review": "One of my favorite Star Wars movies. Nothing to complain about."
    },
    {
      "rating": "5/5",
      "review": "My second favorite Star Wars film"
    },
    {
      "rating": "4/5",
      "review": "\"Star Wars: Episode VI - Return of the Jedi\" concludes the story of one of cinema's greatest and most complex characters; Anakin Skywalker, while simultaneously bringing the original trilogy to an explosively epic conclusion."
    },
    {
      "rating": "3.5/5",
      "review": "Not bad, especially the ending, the best of the original, the biggest minus is that Jabba is a slimy pile of wormy rubbish!!!! Greetings from Poland 🇵🇱😘"
    },
    {
      "rating": "4/5",
      "review": "The most fun and my favourite of the original trilogy. Far more epic and engaging than the first two films."
    },
    {
      "rating": "4/5",
      "review": "Good movie. The chemistry is back! The character development is back! Leia in a slave bikini helped awaken a generation of men and women with....interesting tastes. I don't like the redesigned Sarlaac Pit and Bobba Fett is a big ol' b***h. Luke watches Yoda die as Yoda verifies what Luke already learned in the prvious movie...that was fun. There's another Death Star and it's bigger. Their time on Endor is.....fine. Care Bears help rebels blow up a shield generator, Vader throws Palpatine into a massive hole, Luke returns to his friends and everyone lives happily ever after......until The Force Awakens comes out which canonized the fact that it all went to sh*t again like 20 years later."
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing, and an awesome conclusion to an epic trilogy. I definitely recommend it!"
    },
    {
      "rating": "4/5",
      "review": "This movie, along with the rest of the original trilogy, is peak cinema. The original trilogy has the three best movies in sci-fi history. This is a classic that future generations should continue to watch. But you must watch the original version!!!"
    },
    {
      "rating": "5/5",
      "review": "best villain amizing story and the adorible ewokes with the great dules name it as one of my most liked films"
    },
    {
      "rating": "4/5",
      "review": "great finale to the original saga fantastic story great acting fun characters absolutely love it I would rate it 89%"
    },
    {
      "rating": "4.5/5",
      "review": "Esse filme encerra muito bem a trilogia. Esse filme é excelente"
    },
    {
      "rating": "5/5",
      "review": "Return of the Jedi was a great way to end the original trilogy! Plenty of action, crazy monsters, romance, space battles, and plenty of lightsaber fights."
    },
    {
      "rating": "5/5",
      "review": "A perfect ending to a perfect trilogy."
    },
    {
      "rating": "4/5",
      "review": "Really good an almost perfect conclusion to the star wars saga."
    },
    {
      "rating": "4/5",
      "review": "Bolstered by the demonic emperor Ian McDiarmid and serene Jedi Mark Hamill, ROTJ make its case for a serviceable but not compelling end to the trilogy. There’s too many Ewoks, too much cuteness, too much poor dialogue and a complete lack of inventiveness by Lucas in presenting yet another planet killer for the Rebels to destroy. It’s a distant third when compared to ANH and ESB and over time has been overtaken by Rogue One. Watch it for Hamill and McDiarmid but skip the Ewoks."
    },
    {
      "rating": "5/5",
      "review": "The Best star wars movie"
    },
    {
      "rating": "5/5",
      "review": "The type of movie you could watch a million times. My favorite of the Star Wars films—a movie filled with nostalgia that leaves us with hope and reminds us of how good outweighs bad."
    },
    {
      "rating": "3.5/5",
      "review": "Everyone knows that Return of the Jedi is the weakest of the trilogy, but it is still a good movie. The Darth Vader/Luke storyline alone is a five-star experience. Everything else--the odd beginning, the uneven pacing, the half-hearted acting of some--dampens down the experience but does not erase it."
    },
    {
      "rating": "3.5/5",
      "review": "The weakest of the Originals, but is still pretty darn good."
    },
    {
      "rating": "4/5",
      "review": "Todo está muy bien echo para ser un película de 1983 es bien echa los efectos se ven algo chafas pero tiene un final feliz con los ositos"
    },
    {
      "rating": "4/5",
      "review": "Perfect ending for the original trilogy. The only thing I really didn't like was the ewoks defeating the empire soldiers. But I know what Lucas was going for, nature beat technology."
    },
    {
      "rating": "4/5",
      "review": "Clearly the weakest of the original Star Wars trilogy, Return of the Jedi is still a lot of fun. It has great performances, the father-son dynamic between Vader and Luke is given a satisfying conclusion, and the final confrontation with the Emperor is one of the most epic moments in film history worthy of a place alongside the final confrontation in the Empire Strikes Back. Unfortunately, Endor and its Ewok inhabitants, as iconic as they are, are not as engaging as the rest of the film. Furthermore, the first act of the movie is much the same, iconic but just not as engaging as the rest of the trilogy. Overall, Return of the Jedi is a solid conclusion to the trilogy, Luke’s journey to becoming a jedi, and Darth Vader’s story."
    },
    {
      "rating": "5/5",
      "review": "Star wars é incrível"
    },
    {
      "rating": "4.5/5",
      "review": "Not perhaps as good as its predecessor, but nonetheless a valiant effort at a brilliant film giving closure to the original trilogy. The opening act on tatooine at jabbas palace drags on a bit, but the part on endor is amazing. Well done you, filmmakers from the 80's!"
    },
    {
      "rating": "5/5",
      "review": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "The true conclusion to Star Wars. The visuals and plot are simply fantastic and I love all the characters. From the reveal of Luke's green Light Saber to the brilliant space battle. The lightsaber fight between Luke and Vader is the best of the Orignal Trilogy. And the best of all - Darth Vader's redemption by saving Luke and killing the Emperor. The perfect ending to a perfect Trilogy. 5 stars."
    },
    {
      "rating": "4.5/5",
      "review": "Kind of a muppetish sequel, but still the best out of Star Wars had to offer."
    },
    {
      "rating": "4/5",
      "review": "If I was a Professor at a Film College and had to give a seminar about how to end a Film Trilogy, this would be the example of a Perfect Ending that I would use."
    },
    {
      "rating": "4.5/5",
      "review": "Best end to a trilogy that you can image"
    },
    {
      "rating": "5/5",
      "review": "This movies awesome! I personally think this movie is better than A New Hope and is almost as good as The Empire Strikes Back."
    },
    {
      "rating": "5/5",
      "review": "After wathcing all the 6 original movies, this is the best closing to any franchise ever. While the first act in tatooine felt out of place, it was still a great way to see the whole team in action. The story of the Sith winning, and the good guys loosing, to the new generation fighting the battle of the previous generation, and winning it for them is just such a nice good feels ending. Anakin's story came full circle, and he fulfillled the prophecy of the chosen one. The third act, where the battle of endor happened was just amazing. The ground battle, the dogfight in space, and vader vs luke vs sidious was just amazing. What a movie, and what a perfect trilogy."
    },
    {
      "rating": "4.5/5",
      "review": "This is the weakest of the trilogy in my opinion, but still amazing! This movie is a must watch just for the ewoks alone. Darth Vader and Luke are perfect in this. Go watch it!"
    },
    {
      "rating": "4/5",
      "review": "Muy buena conclusión, debo decir que hicieron mal uso de efectos especiales en algunas escenas y gran parte de la película se siente de relleno, pero los personajes no dejan de ser entrañables y el final es lo que rescata toda la película, de los mejores finales que he visto en una saga."
    },
    {
      "rating": "5/5",
      "review": "Maybe it is the least epic of the three from the original trilogy, but it is anyway incredibly good. A perfect ending for the Skywalker Saga."
    },
    {
      "rating": "4/5",
      "review": "Direção: Ok Atuação: Ok Roteiro: Bom Caracterização: Bom Soundtrack: Bom"
    },
    {
      "rating": "5/5",
      "review": "My favorite Star Wars film and the true conclusion to the franchise"
    },
    {
      "rating": "4.5/5",
      "review": "82%. 10/31/24. Thought it was the worst of the first three but still good. The tribe bear animals were pretty funky at first but ended up being cool with how they helped the gang. Yoda dies of natural causes early. Luke surrenders himself believing Vader has good in him and is proven right when the emperor almost kills Luke and then Vader saves him then dies. Didn’t love how it’s a similar plot with a new Death Star built and this time there’s just a defense shield around it and the gang needs to destroy it so the rebels can attack the Death Star. Overall a good film. 3.5/5 rewatch"
    },
    {
      "rating": "4/5",
      "review": "Very good, with some missing stuff. I think the ending it's too rush, but I liked it. After watching the prequel trilogy, the final shot of Luke cremating Darth Vader gains more visual power."
    },
    {
      "rating": "4.5/5",
      "review": "Definitely the weakest of the original trilogy, but still really fun and an amazing great time!"
    },
    {
      "rating": "2.5/5",
      "review": "Not as good as the first two. Brings resolution to the trilogy. However too many pc changes to the original by disney. For instance: at the end the ghost of obiwan is old but that of darth vader is young. Either both old or both young."
    },
    {
      "rating": "3.5/5",
      "review": "Un film dalle profonde riflessioni e quadri che formano in atmosfera naturale è un po’ sobrio. La sequenza iniziale è un po’ noiosa ma introduce al meglio il protagonista attraverso le sue doti. Lo svolgimento per una collaborazione finale ha reso ogni metafora stanca e incosciente. Lo scontro finale è qualcosa di un po’ piatto, ma uno scontro all’ultimo sangue decente. 8/10"
    },
    {
      "rating": "5/5",
      "review": "Amazing movie respecting all the lore!!"
    },
    {
      "rating": "4.5/5",
      "review": "Fantastic end to the saga: 1.The Empire Stricks Back 2.Return of the Jedi 3.New Hope"
    },
    {
      "rating": "4.5/5",
      "review": "Weaker than the previous movies but still amazing and wraps up the original trilogy perfectly"
    },
    {
      "rating": "4/5",
      "review": "While the inherent magic of the original trilogy is still as wonderful as ever in this film, Episode VI relies on its predecessors too heavily, and thus gravitates to rehashing familiar ideas and plotlines."
    },
    {
      "rating": "4.5/5",
      "review": "overhated. gets progressively better. 9/10"
    },
    {
      "rating": "5/5",
      "review": "The last movie of the best trilogy in the galaxy. This is the final stand against an evil empire, where the emperor pulls the strings to achieve the ultimate battle, good against evil, father against son. But a father's love can defeat any evil even with the cost of his life. Pain, mistakes, anger, and finally redemption. The circle is complete, Anakin's soul is finally free, and among the other great Jedi masters. This is the end of the greatest trilogy of all time!"
    },
    {
      "rating": "5/5",
      "review": "Incredible! A great way to close off the original Star Wars trilogy!"
    },
    {
      "rating": "4.5/5",
      "review": "75% of this movie is 5 stars. The gap between Jabba's death (spoiler alert, a**hole) and Luke's surrender is an afterthought (speeder bike scene is awesome), but a more exciting, tense journey to find the field generator would have been nice."
    },
    {
      "rating": "5/5",
      "review": "What an epic conclusion to the best sci-fi trilogy of all time!"
    },
    {
      "rating": "5/5",
      "review": "Probably my second favorite Star Wars movie!"
    },
    {
      "rating": "5/5",
      "review": "marvelous movie, every character the writing, flawless"
    },
    {
      "rating": "4/5",
      "review": "The end of Luke Skaywalker's jorney! One of the most incons of movies and one of the bests movies of series! Retun of Jedi one excelent conclusion of one of the bests triology of movies in the world!"
    },
    {
      "rating": "5/5",
      "review": "Star Wars: Episode VI - Return Of The Jedi is my favourite Star wars movie. It is emotional, epic and a great conclusion to the one of the best trilogies ever made."
    },
    {
      "rating": "5/5",
      "review": "One of my first star wars experiences, the movie that made me fell in love with this franchise, plot, actors, scenography is better then you can dream of, every time i watch this masterpiece it gives me same dose of humor and satisfaction, definitely best movie of George Lucas and one of best in the history."
    },
    {
      "rating": "5/5",
      "review": "Perfect ending to such a great trilogy! 👍"
    },
    {
      "rating": "4/5",
      "review": "The third film in an almighty trilogy. Some silly characters but it is an all ages audience. Some iconic scenes and dialogue. A great end to a marvellous trilogy."
    },
    {
      "rating": "5/5",
      "review": "Best of the originals and up there for the best with Revenge Of The Sith. This is just a great movie that you have to see."
    },
    {
      "rating": "5/5",
      "review": "Return of the Jedi is one of the most important pieces to the Star Wars puzzle. A great epic conclusion to the original trilogy, which was lightning in a bottle. Still to the stay my favorite Star Wars movie! A absolute Must see! 5/5"
    },
    {
      "rating": "5/5",
      "review": "Good old Star Wars magic! Thank you George and cast!"
    },
    {
      "rating": "5/5",
      "review": "Nothing gets better than this. Nothing. With the exception of Dune Part II there has been no other sci fi film that has come close to this trilogy. If you are hating on this all you want is attention. this movie is a masterpiece"
    },
    {
      "rating": "5/5",
      "review": "End of one of the best trilogy of sequels ever created"
    },
    {
      "rating": "4/5",
      "review": "The ewoks are painful and endings are notorious for never ending quite right. A fitting end to the classic saga."
    },
    {
      "rating": "5/5",
      "review": "A very, very good movie. Lives up to its predecessors for sure."
    },
    {
      "rating": "4.5/5",
      "review": "Best part by far is the part when Anakin shows finally that he is the chosen one that will bring balance to the force, by returning back to the light."
    },
    {
      "rating": "5/5",
      "review": "Well after, these one ..... all was gone..."
    },
    {
      "rating": "5/5",
      "review": "OT star wars is what grabbed us all, and no matter what disney does, will keep us here."
    },
    {
      "rating": "5/5",
      "review": "A fantastic end, with the battle between good and evil."
    },
    {
      "rating": "4/5",
      "review": "Not only has Luke mastered his Jedi training, mark Hamill has mastered his acting craft, the saga is wrapped up neatly"
    },
    {
      "rating": "4/5",
      "review": "The original trilogy had a simple, yet good, plot about good and evil. Personally I like the prequels more for their plot, however the execution was better in the original trilogy, excluding the effects and fights, which could use a makeover."
    },
    {
      "rating": "4.5/5",
      "review": "Good ending. A bit over the top. Great trilogy. Thanks George Lucas!"
    },
    {
      "rating": "5/5",
      "review": "Muy buena película, aunque las pasadas dos películas dejaron la vara muy alta, sigue siendo muy buena película y cierre de la primera trilogía."
    },
    {
      "rating": "5/5",
      "review": "Very good movie, good acting and story with the big happy end."
    },
    {
      "rating": "5/5",
      "review": "Comparing to the first two movies in the franchise, the concluding chapter of the Star Wars Trilogy might have been overshadowed by the success of the first two films, But Episode VI, while lacking the intricate plot of The Empire Strikes Back, provides a very heartwarming, very satisfying ending to this trilogy."
    },
    {
      "rating": "5/5",
      "review": "Without a doubt the best of Star Wars in my opinion"
    },
    {
      "rating": "5/5",
      "review": "Jedi is a great end to the Trilogy. The visuals, music are very entertaining."
    },
    {
      "rating": "5/5",
      "review": "If you knew he was your brother whyd you kiss him??🤔🤔🤨"
    },
    {
      "rating": "5/5",
      "review": "Weakest of the OG trilogy, but still a Star Wars classic."
    },
    {
      "rating": "5/5",
      "review": "The original trilogy and Rogue One are the only movies I consider actual Star Wars Canon. I just rewatched all four films and it just bring home how bad recent Star Wars content has been. I liked that the story is a straight up good vs evil story. I dont understand some of the recent decisions to diversify Star Wars, it has always been diverse. What drew most of the fans in was a good story told well. Something the people in charge of Star Wars seems to have forgotten."
    },
    {
      "rating": "5/5",
      "review": "Still one of the best Star Wars movies ever made."
    },
    {
      "rating": "5/5",
      "review": "This is my favourite star wars movie by far ,the space battle was like nothing I've seen before when I first watched it ,the fight between vader and Luke was very good ,how vader used Lukes sister to provoke him back into battle then at the end you see vader as not the bad person anymore but a father who loves his children and saves his son by throwing the emperor to his doom ( don't watch the disney movies they completely ruin everything)"
    },
    {
      "rating": "5/5",
      "review": "Return of The Jedi is a culmination of all 6 movies from Episode 1- Episode 6 as it left us with what Luke was going to do in the EU."
    },
    {
      "rating": "4.5/5",
      "review": "Något av det bästa STAR WARS har att erbjuda, älskar att REX syns snabbt i bakgrunden."
    },
    {
      "rating": "5/5",
      "review": "When Star Wars was worth something! Disney managed to destroy the biggest movie franchise!"
    },
    {
      "rating": "4/5",
      "review": "8.5 out of 10. Should be a 10, but kind of a letdown in certain parts."
    },
    {
      "rating": "5/5",
      "review": "From the desert of Tatooine to the forest moon of Endor... Loved it. Character development, strong personnalities and... Better prosthetics that allowed the Mon Calamaris, it had everything. They teased Mara Jade but there have been no follow up on her unfortunately... And that is one of the movies that hired the most unusual actors, save for Willow and Tod Browning's Freak. You want to know about Star Wars ? That is a must see."
    },
    {
      "rating": "4.5/5",
      "review": "After re watching for the fifth time, it amazes me what they were able.to accomplish back then in the movie world."
    },
    {
      "rating": "4/5",
      "review": "Still great, but the Imperium keeps in stumblin a bit before it falls."
    },
    {
      "rating": "4.5/5",
      "review": "The anniverdary edition checks all boxes, but could've used a bit more of the modern technologies"
    },
    {
      "rating": "3.5/5",
      "review": "The start of the movie is filled with weird alien creatures, not many humans, so a little weird at first. The movie does get better though, and you also get to see Princess Leia’s ridiculous body quite a bit as she wears hardly any clothes for a good chunk of this movie. Definitely an unexpected turn from how she was viewed in the first 2 movies. What a sight to see."
    },
    {
      "rating": "5/5",
      "review": "Best of Star Wars movies"
    },
    {
      "rating": "4.5/5",
      "review": "It’s one of the first three Star Wars movies, of course it’s great. Mandatory movie for any cinefile."
    },
    {
      "rating": "5/5",
      "review": "One of the best in George Lucas saga , loved it"
    },
    {
      "rating": "5/5",
      "review": "Classic. Storytelling and plot development done correctly."
    },
    {
      "rating": "4/5",
      "review": "My least favorite of the original trilogy. But still my 4th favorite after Empires, A New Hope, and Revenge of the Sith."
    },
    {
      "rating": "3.5/5",
      "review": "You could tell Lucas was in a rush to finish up his story which resulted in a lot of changes to his original plans including making Leia Luke's sister. We didn't need a second Death Star or Ewoks it should have been Wookies.) Satisfying conclusion. Too bad he kept going back to make additional changes."
    },
    {
      "rating": "5/5",
      "review": "My dad saw the original in theaters when he was a kid and told me it was a great movie and it would have been a good ending to a whole franchise than the new ones with Rey."
    },
    {
      "rating": "4/5",
      "review": "80% A great ending to an amazing series of movies"
    },
    {
      "rating": "5/5",
      "review": "Just the good. Fjjfjfjf"
    },
    {
      "rating": "5/5",
      "review": "One of my favorite scenes in is the space Battle of Endor scenes. The last movie in the best trilogy ever to be made. The John Williams score fantastic as always especially during Luke and Vader's lightsaber scene. Ian McDiarmid is the best as the Emperor. 10/10 EPIC FANTASTIC. My second favorite Star Wars movie."
    },
    {
      "rating": "5/5",
      "review": "Honestly it’s my favorite Star Wars movie. Beautiful resolution for the narrative, and perfect resolution for the characters. The best way to end off the trilogy."
    },
    {
      "rating": "5/5",
      "review": "Even to this date, it mixes amazing affects, with great story telling, George Lucas is a movie Einstein"
    },
    {
      "rating": "5/5",
      "review": "なんだかんだこれが1番好きかも。古いからこそ逆に良い。音楽も俳優も内容も演出も含め大好きです。スターウォーズはこれで完結してます。"
    },
    {
      "rating": "4.5/5",
      "review": "This movie is just the BEST!!!!! And it is a perfect conclusion to Star wars. But i can,t call it a conclusion anymore, becuse of the sequels"
    },
    {
      "rating": "5/5",
      "review": "A perfect conclusion to a perfect saga. The character arc of Anakin Skywalker and Luke Skywalker is by far some of the best I've ever seen in cinema."
    },
    {
      "rating": "5/5",
      "review": "amazing movie, nostalgic"
    },
    {
      "rating": "4.5/5",
      "review": "A very good film, with an ending that the star wars franchise deserved. It is satisfying to see Luke not have to stray, yet for the emperor to (supposedly) meet his end. Though I would say there are some scenes in Jabba's Palace which are a little tedious, they manage to magnify the impact and memorability of the Saarlac scene. And Endor, as a planet and a mood, has become its own icon."
    },
    {
      "rating": "5/5",
      "review": "Not as good as it's predecessor, but still one of the best."
    },
    {
      "rating": "3/5",
      "review": "Overall plot lacks engagement as the story moves along. Acting lacks the most of the original trilogy. However, you still get the enjoyment if you are a Star Wars fan."
    },
    {
      "rating": "3.5/5",
      "review": "To be considered the weakest of the Original Trilogy, this is not as bad as say Phantom Menace nor Attack of the Clones. As a matter of fact, I don't remember much about this particular movie even when I've seen this as a kid or as a teenager. Can say the first act does drag on due to many detours. The middle is well paced since it does share scenes that has you understand where Luke is feeling with emotions flowing through him with Yoda, Darth Vadar and even Leia, as learning about his family history. The climax of the third act may not be impressive, but you have to admit it is hilarious when it comes to the ewoks and the rebels fighting against the storm troopers in the form of nature vs. technology while the conflict between father and son were the more interesting parts with the Emperor present. I do say this was indeed the weakest of the Original Trilogy, but not the worst of all Star Wars movies. Sure most parts can be forgettable, but a decent ending to the Original Trilogy before the Sequel Trilogy that sets itself tens of years later. 7/10."
    },
    {
      "rating": "4.5/5",
      "review": "The only negative review this film gets are the ewoks which aren't even that bad."
    },
    {
      "rating": "5/5",
      "review": "I'm so glad to have got to see it in theaters as a kid. I remember falling in love with princess leia. the Ewoks could be dumb but I loved them anyway. instant classic!!"
    },
    {
      "rating": "4/5",
      "review": "fitting end to the old trilogy"
    },
    {
      "rating": "5/5",
      "review": "Amazing classic movie brought back to life on the big screen. For those not fortunate enough to see this movie in a cinema when it originally aired (such as myself), being able to experience it in theaters was amazing. George Lucas's Star Wars was beautifully represented through this movie and it helps people realize why Star Wars is more than just \"Disney Star Wars\"."
    },
    {
      "rating": "5/5",
      "review": "The Star Wars movies are the best movie franchise ever made hands down!"
    },
    {
      "rating": "4.5/5",
      "review": "While it is weaker than its last 2 movies, the movie still brings everything to a satisfying conclusion, and nothing really needs to be added to the franchise."
    },
    {
      "rating": "4/5",
      "review": "What a way to conclude the Original Star Wars Trilogy. An action packed movie released in 1983, this movie is yet another masterpiece from the world of Star Wars. It of course brings back the original cast yet again to deliver a worthy sequel to the previous 2 movies. This movie has an excellent plot, excellent characters and excellent cast and demonstrates that with how it's choreographed, directed and written. Although this movie isn't as good as the previous 2 movies, this movie is still iconic, especially for scenes such as the party at the ewok village, the Vader and Luke's final fight and the explosion of the 2nd Death Star. Overall an outstanding movie that definitely still holds up over 40 years later. 4/5"
    },
    {
      "rating": "4.5/5",
      "review": "9.3/10- I don’t understand why this has the lowest rating of the trilogy. I think it slaps. The beginning at Jabba’s palace is iconic."
    },
    {
      "rating": "5/5",
      "review": "🍅 10/10 My absolute favorite of trilogy it takes an emotionally satisfying conclusion. One of my favorite films ever. And yeah I don't care I love the Ewoks I love the battle of Endor I love the rescue at the beginning and I love Papa palps. There is so much going for this film, and it's all made so well. a beautiful conclusion with amazing action, sequences and top-notch character development. Just perfect. Grade A+"
    },
    {
      "rating": "5/5",
      "review": "Der Abschluss der Originalen Trilogie, der einen Abschluss würdig ist."
    },
    {
      "rating": "4/5",
      "review": "<i>Return of the Jedi</i> is a crowd-pleasing ending to the original trilogy, while there may be some sub-plots some can find weird, it's perhaps the one film that delivers the best set designs, lightsaber duels, with emotional payoffs, making it an entertaining conclusion delivering on the epic space opera promises of the franchise."
    },
    {
      "rating": "3.5/5",
      "review": "The last film in the original trilogy is the messiest. It's a little awkwardly paced toward the middle and several elements I dislike take up a lot of screen time (the Ewoks primarily). Return of the Jedi still gets most of the important things right though, the central conflict reaches a satisfying climax and the final space battle is very entertaining - a worthy end to the trilogy."
    },
    {
      "rating": "5/5",
      "review": "Absolut Cinema! Que obra fantástica é Star Wars, para qualquer cinéfilo é indispensável acompanhar a está obra."
    },
    {
      "rating": "5/5",
      "review": "*speaking with earpiece* cheong hor ivor:lando calrissian!! this is ivor im in death star II!! luke duels darth vader and i found palpatine!! keep going to destory death star II!!"
    },
    {
      "rating": "4.5/5",
      "review": "A great and satisfying conclusion to the Original Trilogy with a beautiful redemption architecture of the best villain of Pop Culture. This movie jmhas the 2nd best lightsaber fight behind Revenge of the Sith's Vader v. Obi-Wan. The only issue is with how the movie portrayed Fisher at the beginning. 9.5/10."
    },
    {
      "rating": "4.5/5",
      "review": "This is probably one of the best threequels ever made."
    },
    {
      "rating": "5/5",
      "review": "This movie does almost every beat right. The pacing is great, theres a fair but of action and strategy. It wraps up the story in a satisfying way! My only complaint is that the Ewokes are way to effective against an organized military, but thats a minor complaint."
    },
    {
      "rating": "5/5",
      "review": "This is the Classic and it's the Best movie in Star Wars saga, the Saddest part is the ending scene that make sad. What a Best Movie Ever😭🍿"
    },
    {
      "rating": "4.5/5",
      "review": "one of the best star wars made, all the story was really cool and i like most of the film"
    },
    {
      "rating": "4.5/5",
      "review": "\"Return of the Jedi\" is a worthy conclusion to the classic trilogy! Jabba the Hutt and Emperor Palpatine are thoughtful additions to the franchise. The Ewoks are cute and capable in the Battle of Endor. The battle scenes are as good as the ones in Episodes 4 and 5. This is an absolute classic, even if it doesn't measure up to its predecessors!"
    },
    {
      "rating": "5/5",
      "review": "Third best movie of all time"
    },
    {
      "rating": "5/5",
      "review": "This movie is absolutely perfect in every single way"
    },
    {
      "rating": "5/5",
      "review": "It's just so amazingly done and has a fast pace throughout the movie. Should be the ending of the saga but sadly disney ruined it."
    },
    {
      "rating": "5/5",
      "review": "it is my favorite of the Og trilogy"
    },
    {
      "rating": "4/5",
      "review": "Not as good as 4 and 5, but still a very good movie."
    },
    {
      "rating": "4.5/5",
      "review": "While slightly held by by a bizarre side quest in the middle, it's overall a great conclusion to the trilogy that, despite what others have said, has not been cheapened over time."
    },
    {
      "rating": "4/5",
      "review": "A great, classic movie, however it fails to reach the heights of it's predecessors."
    },
    {
      "rating": "4/5",
      "review": "The story, acting, special effects and settings all are remarkable."
    },
    {
      "rating": "5/5",
      "review": "\"Star Wars Episode VI: Return of the Jedi\" delivers a thrilling conclusion to the original trilogy, seamlessly blending epic action with heartfelt character moments. Director Richard Marquand masterfully navigates the intricate plot, bringing closure to the saga's central conflicts while introducing captivating new elements. The film's visual effects continue to astound, particularly in the climactic battle sequences. Mark Hamill shines as Luke Skywalker, showcasing a newfound maturity and depth as he confronts his destiny. With its iconic moments, memorable performances, and resonant themes of redemption and hope, \"Return of the Jedi\" successfully brought closure to the series, while leaving room for future prequels and sequels to expand the Star Wars universe."
    },
    {
      "rating": "3/5",
      "review": "\"Super Easy Short Edition\" movie reviews... Return of the Jedi... There is this jedi who \"returns\" and who has to deal with these hokey silly Ewok guys! 6.5 out of 10."
    },
    {
      "rating": "5/5",
      "review": "Epic. The Star Wars saga marked my life."
    },
    {
      "rating": "5/5",
      "review": "My favorite of the original trilogy, I really enjoyed the whole movie and the ending especially the music was perfect"
    },
    {
      "rating": "5/5",
      "review": "In my opinion, the best Star Wars of them all (as well as Empire Strikes Back)."
    },
    {
      "rating": "3/5",
      "review": "Anakin finally making sense. Satellite explosion???"
    },
    {
      "rating": "5/5",
      "review": "Still my favorite all time Star Wars film to this day! I mean there's Ewoks! But seriously it's the best! It brings it all together! Happy ending!"
    },
    {
      "rating": "5/5",
      "review": "This was the best ending to the original trilogy I'm glad that the trilogy had ended with a sad but happy and heroic ending"
    },
    {
      "rating": "4/5",
      "review": "The greatest flaw with Return of the Jedi is the accelerated way in which the plot progresses to the final attack plan following the completion of the Jaba the Hut storyline and Luke returning to Dagobah. It isn't really wholly compatible with the situation as it existed at the end of Empire. Some additional exposition on this front explaining that while losing the war, a limited opportunity had presented itself, which ended up being the critical opportunity which was needed in that the Emperor personally visited the new Death Star. It is also a bit unclear what exactly Luke's plan was with Jabba, but this isn't really a major hinderance to the film. Lastly, of course, the Ewoks will always be controversial. It is still a very good and classic film though and a fine conclusion to a brilliant trilogy."
    },
    {
      "rating": "4/5",
      "review": "Great end to the trilogy, worth watching"
    },
    {
      "rating": "4.5/5",
      "review": "A near perfect ending to the Star Wars saga."
    },
    {
      "rating": "4/5",
      "review": "Star Wars: Return of the Jedi is the 3rd and final film in George Lucas' original Star Wars trilogy. Return of the Jedi won 5 Oscars (4 Oscars for visual/art and sound effects in addition to John Williams' 3rd Oscar for his Star Wars original scores!) from 1984's Academy Awards. Having grown up with Star Wars, maybe my earlier opinions of the previous SW movies are tainted by how young I was when I first saw A New Hope and The Empire Strikes Back. The storytelling in Return of the Jedi feels like a rehashing of the first movie, and the battles between high tech and low tech camps are comically optimistic. The thing was made a little worse when Anakin was re-aged at the last moment we see him by Lucas, and the original is harder to find. Lucas' re-edits are understandable, but his wiping away the film history of his monumental Star Wars accomplishments (Oscars aside, many SW accomplishments) for the rest of us to enjoy has made me a little sad now and then. At 4 years old I was included on a \"girls movie night\" with my sister and my mother during the first theatrical run in our hometown of A New Hope. I've been a fan ever since. I like the poetry. I get that history may not repeat, but it definitely appears to rhyme. I understood all that by the time the prequels came to town. I'm grateful for this series, for all the stunningly choreographed lightsaber duels across the series, for the story about how Warwick Davis got his Star Wars toys, and for all the Light & Magic I got from this series over my lifetime! Return of the Jedi is a nearly perfect ending to a nearly perfect Science Fiction space opera. It's so good that I want more, but the story is over. What more could I possibly want from the Skywalker Saga?"
    },
    {
      "rating": "4/5",
      "review": "I thought this movie was good. I liked the characters and the execution. It was a fun journey I thought the final showdown was good."
    },
    {
      "rating": "5/5",
      "review": "*I think it is amazing. It really ties all the loose ends from the other movies. You gotta see it!"
    },
    {
      "rating": "4/5",
      "review": "It's not as good as it's predecessors, but that's an almost impossibly high bar. Rewatched recently though, it is a good film in it's own right and a worthy end to the trilogy. Compared to what came after it's a classic for the ages."
    },
    {
      "rating": "4/5",
      "review": "Great way to end the original trilogy"
    },
    {
      "rating": "4/5",
      "review": "It certainly dispenses of some of the elements that made its predecessor so good, but still concludes the trilogy on a reasonably satisfying note."
    },
    {
      "rating": "3.5/5",
      "review": "A fittinh end to the original Trilogy. Amazing film, wish it was made in modern times with great CGI."
    },
    {
      "rating": "5/5",
      "review": "Star Wars ended here."
    },
    {
      "rating": "4/5",
      "review": "Loses one star for the Ewoks. I know George Lucas thinks its for children but not only children are going to watch star wars and the ones who saw the first movie are 6 year older...."
    },
    {
      "rating": "3.5/5",
      "review": "If I had to choose the least good of the original trilogy, it could be this one. But it's important to note that it's not the worst, just the least good. The first trilogy is now complete, bringing closure to one of the greatest stories ever told in the history of cinema, in my opinion. This trilogy was iconic and deserved an iconic ending, which George Lucas certainly delivered. Points for the final confrontation and the scenes between Luke and Vader/Anakin that are truly poignant. It's a great film, and I would recommend anyone to watch it."
    },
    {
      "rating": "4/5",
      "review": "Very good and iconic moments with a beautiful closure to this saga. The problems with pace and choice of some characters exist, but they're perfectly ignorable considering everything else."
    },
    {
      "rating": "5/5",
      "review": "a all time classic, not as good as \"empire \" but still fun, and phenomenal , the themes and motifs that have been bult up threw the story so far, in my top 20 films of all time"
    },
    {
      "rating": "2.5/5",
      "review": "This film is a curious case, I don't think George Lucas's directing ability is very limited, There's no sensational action scene or super well-directed acting, it just delivers the basics, the tone of this film is very silly for the end of a great trilogy like this, the third act of the film is incredible, but... I really can't see any more positive points, the \"silly\" tone in a large part of the film bothers me a lot, a lot of scenes that weren't necessary (why have Luke being trapped by a cute bear in a net?) full of inconsistencies e boring, rating 5.5/10."
    },
    {
      "rating": "4.5/5",
      "review": "This Film is very great, the Depth, the Action, and Storytelling of the Previous Installments is still there, but the story concludes the Skywalker Saga, with the greatest Redemption arc of Darth Vader, and the victory of The Rebel Alliance, This is the true Ending of the Star Wars saga... 9/10"
    },
    {
      "rating": "4/5",
      "review": "As a die-hard Star Wars fan, I can confidently say that Return of the Jedi is the grand finale we all deserved! This epic conclusion to the original trilogy is a true masterpiece that solidifies Star Wars as the greatest sci-fi franchise in the galaxy! First things first, the witty banter and clever dialogues in Return of the Jedi had me grinning from ear to ear. Han Solo's snarky remarks and Luke Skywalker's Jedi quips were on point, adding that extra layer of entertainment to an already thrilling adventure. Who can forget the iconic line, \"It's a trap!\" delivered by Admiral Ackbar? Classic! Speaking of entertainment, Return of the Jedi delivers it in abundance. The epic space battles between the Rebel Alliance and the Galactic Empire had me on the edge of my seat, cheering for the Rebel fighters as they bravely took on the Death Star. And let's not forget the nerve-wracking lightsaber duel between Luke and Darth Vader, the ultimate clash of good versus evil. The action sequences in this film are nothing short of spectacular! What sets Return of the Jedi apart from many other sci-fi films is its ability to stand the test of time. Despite being released decades ago, the visual effects and practical craftsmanship hold up remarkably well. From the intricate creature designs to the breathtaking worlds like Endor and Tatooine, the attention to detail is simply astounding. It's a testament to the passion and dedication of the filmmakers that this movie continues to captivate audiences of all generations. In conclusion, Return of the Jedi deserves its place among the stars as an unforgettable and triumphant conclusion to the original Star Wars trilogy. With its witty dialogues, captivating action, and timeless appeal, this film proves why the Star Wars saga remains the pinnacle of science fiction. So, grab your lightsaber, don your Jedi robe, and embark on this galactic adventure that will transport you to a galaxy far, far away. May the Force be with you!"
    },
    {
      "rating": "5/5",
      "review": "i WANT TO SHOVE MY LIGHTSABER UP dARTH vADER'S ass."
    },
    {
      "rating": "4/5",
      "review": "it's a great movie, but it's convoluted, the arc on Tatooine is unnecessarily long, Han and Leia's arc isn't very interesting, but what makes the movie excellent is Luke and Darth Vader's arc, if it weren't for the sequels, it would be the perfect ending to the saga."
    },
    {
      "rating": "4/5",
      "review": "This film is a satisfying conclusion to the trilogy. Improve son the failures of the first two in most ways, but is still held aloft bythe massive Star Wars cult following today. Impactful at first, but choreography is lackluster compared to the prequels and even the sequels. Worth watching more than the others."
    },
    {
      "rating": "5/5",
      "review": "An iconic trilogy deserved an iconic ending, and George Lucas certainly understood that assignment."
    },
    {
      "rating": "5/5",
      "review": "A strong finish to the OG trilogy"
    },
    {
      "rating": "5/5",
      "review": "Star Wars how we all love it without the hassle of bad writing and writers who know little about Star Wats lore."
    },
    {
      "rating": "3.5/5",
      "review": "YEPP!!!! best way to end 3 movies imo"
    },
    {
      "rating": "4.5/5",
      "review": "es el cierre perfecto para la saga rebelde, un look maduro y enfocado en la fuerza a vencer su contraparte Vader, su padre, manipulado durante años por palpatine, logra vencer Look sin el uso de la violencia, atacando algo que no podía manipular el emperador, en lo profundo del exotraje de vader, su humanidad en la fuerza."
    },
    {
      "rating": "0.5/5",
      "review": "it was ok not my favored movie would be 2 stars but know my brother is yelling LUKE I AM YOUR FATHER and hitting me with his stick. half a star"
    },
    {
      "rating": "4.5/5",
      "review": "If I had to pick least good of the original trilogy, it might be this. The circle is now complete. One of the greatest stories ever told in cinematic history."
    },
    {
      "rating": "5/5",
      "review": "While not being quite as good as the previous one, this is still a great ending to this trilogy."
    },
    {
      "rating": "4.5/5",
      "review": "Great ending for the original trilogie i enjoyed it very much"
    },
    {
      "rating": "4.5/5",
      "review": "Best space battle in film. The most epic showdown of light vs dark in film. Brought down a little by teddy bears. Perhaps not enough critical voices around George at this point. Worthy ending of the epic series."
    },
    {
      "rating": "5/5",
      "review": "A masterpiece that ties everything up in the end!"
    },
    {
      "rating": "3.5/5",
      "review": "Nearly not as good as it's a 2 other films before it, it does pretty well with the saber fights. I just thought that Endor was really boring. Also the fact that as a kid the movie was played out since channels had it playing 24/7. The most enjoyable part was probably only Luke and Vader."
    },
    {
      "rating": "5/5",
      "review": "Perfect ending to a trilogy, good to know there was a time where sequels didn't leave you disappointed by giving poor explanations of questions in previous movies. Yoda, Luke, Vader…what's not to love."
    },
    {
      "rating": "5/5",
      "review": "The fact any of the sequels are rated higher than this is appalling"
    },
    {
      "rating": "5/5",
      "review": "Return of the Jedi is another masterpiece. All the cast are great and the action is amazing. The Emperor is a great villain. Perfect ending to the original trilogy and I highly recommend this movie."
    },
    {
      "rating": "4.5/5",
      "review": "Its reputation has deservedly increased over the years. The movie is endlessly imaginative (lots of great puppets and creature designs) and boy did Lucas strike gold in casting McDiarmid as the Emperor. This is the true end of the franchise and, even though I like some of what follows, everything else is fan fiction."
    },
    {
      "rating": "4.5/5",
      "review": "My personal favorite Star Wars movie, although on an objective standard I still have to admit it has a couple issues. The plot and pacing isn't as tight as Empire Strikes Back, and the tone is slightly uneven at times. Nevertheless, the relationship and final battle between the hero villain is absolutely incredible, and in my opinion the battle and ending is the very heart and fulfillment of Star Wars."
    },
    {
      "rating": "4/5",
      "review": "The film is flawed and sometimes even uninspiring, but ultimately rescues itself in the final act. The Luke/Vader/Emperor scenes are sensational and not only redeem the movie, but also go a long way in bringing the trilogy to a very satisfying end."
    },
    {
      "rating": "5/5",
      "review": "From beginning to end, Star Wars: Episode VI Return of the Jedi reminds viewers what made us fall in love with the galaxy far, far, away. We are treated to the strongest points in the series in this film. From Luke becoming a full-fledged jedi, a light tone of guerilla warfare, the space battle over Endor, and of course ewoks. ROTJ may have had major changes over the decades, one thing remains true, it was and still is the most fitting ending to the Skywalker Saga."
    },
    {
      "rating": "5/5",
      "review": "Final perfeito para primeira trilogia"
    },
    {
      "rating": "5/5",
      "review": "In my opinion, the best Star Wars movie! The perfect end to the Skywalker saga."
    },
    {
      "rating": "5/5",
      "review": "Fantastic movie, watched it a billion times as a kid and really appreciate it more and more as an adult, the Luke/Vader/Emperor scenes are breathtaking"
    },
    {
      "rating": "4.5/5",
      "review": "It is an amazing movie good characters an amazing music but the only thing I did not like was that Darth Vader died but it is still an awesome movie"
    },
    {
      "rating": "5/5",
      "review": "THIS IS MY FAVORITE MOVIE OF ALL TIME some may say the ewok stuff is boring but its the calm before the storm its just building up to the 3d act which is AMAZING, and just perfect for me. just watch this thing"
    },
    {
      "rating": "5/5",
      "review": "Return of the jedi is sad at the end and has a great lightsaber duel between father and son. I love this movie"
    },
    {
      "rating": "4.5/5",
      "review": "Return of the Jedi takes the action of the first two films and cranks it up to a ten. The story of Darth Vader and Luke Skywalker could not have ended better."
    },
    {
      "rating": "4.5/5",
      "review": "Embora não seja tão bom quanto os filmes anteriores, esta entrada de Star Wars ainda é uma das melhores. O filme é simplesmente incrível e o final do arco do personagem de Darth Vader é lindo."
    },
    {
      "rating": "4/5",
      "review": "Who would've guessed that 3 movies into this trilogy, Return of the Jedi and Empire Strikes Back would be just as good as A New Hope. This has got to be one of the best movie trilogies of all time."
    },
    {
      "rating": "5/5",
      "review": "What else needs to be said?"
    },
    {
      "rating": "4/5",
      "review": "Star Wars VI: Return of the Jedi was an amazing movie. Before the end, I was going to write that this movie is the worst original Star Wars movie. Then I released that isn't true. Star Wars 6 had a very powerful story, about much more powerful than the other movies. I'm realizing now that this film is one of the best original Star Wars movie and the first Star Wars made ( Star Wars IV: A New Hope ) was the worst original. Star Wars 6 was a very interesting movie, and I was actually impressed of the computer animated singing slug in the movie. Star Wars 6 was an amazing movie. What a good movie. I give this a 81%."
    },
    {
      "rating": "5/5",
      "review": "I can't believe it's really been 40 years since this film was released. This is indeed a timeless classic."
    },
    {
      "rating": "4.5/5",
      "review": "Hooooly shit this is a masterpiece (worst of the OT tho)"
    },
    {
      "rating": "5/5",
      "review": "return of the jedi is a such a satisfying conclusion to one of the greatest trilogies of all time."
    },
    {
      "rating": "4/5",
      "review": "Great but not as good as the previous 2. 8.4/10"
    },
    {
      "rating": "5/5",
      "review": "Some movies just do it for you. And while this isn't Empire, RotJ still takes me back to 10 year old me and makes me smile."
    },
    {
      "rating": "5/5",
      "review": "To me, Return of the Jedi was the better of the original trilogy sequels. It introduced some of the most beloved and recognised film characters ever in the STAR WARS cinematic universe, it reveals the face behind the Darth Vader mask, it finally gives us a look at one of the best villains ever created - Darth Sidious and has some of the best visual/special effects I've ever seen on my television. It was amazing."
    },
    {
      "rating": "4/5",
      "review": "Thrilling opening. Best acted movie of the trilogy. Could have done with more screen time for the Emperor and the Ewoks were unneeded."
    },
    {
      "rating": "4/5",
      "review": "Suitable ending to the trilogy, good story, outstanding visual effects, but I think I was getting too old to take the Ewoks seriously. Not an absolute joy killer, but detracted from the movie a little."
    },
    {
      "rating": "5/5",
      "review": "My favorite movie in the saga. It does a great job of tying a bow on top of the gift George gave us. Such great performances from all the core actors as well as showing us the dark side of the star wars underworld with creatures, aliens, and all kinds of other fun a kid falls in love with! MUST SEE"
    },
    {
      "rating": "4.5/5",
      "review": "This movie was another solid Star Wars film by George Lucas. It was such a great way to end the original trilogy. I always have a good time when I watch Return of the Jedi."
    },
    {
      "rating": "4/5",
      "review": "One of my favourite Star Wars"
    },
    {
      "rating": "4/5",
      "review": "Return of the Jedi brings the original trilogy to a satisfying conclusion, seamlessly blending spectacle, emotion, and redemption, wrapping up the epic Star Wars saga with a thrilling and heartwarming finale."
    },
    {
      "rating": "5/5",
      "review": "I was so happy to see my favorite movie in theaters I loved Star Wars since I was 5 Mr and my dad saw this in theaters for the 40th anniversary I loved it."
    },
    {
      "rating": "4/5",
      "review": "Star Wars 6 è la degna conclusione della trilogia originale, anche se poteva risultare migliore di quello che è"
    },
    {
      "rating": "5/5",
      "review": "The true ending to the greatest film franchise."
    },
    {
      "rating": "4/5",
      "review": "This film is great. The only let down is some of the CGI hasn't aged very well. Overall still a great film!"
    },
    {
      "rating": "4.5/5",
      "review": "What this film lacks compared to the previous two it makes up in pure entertainment value and cinematic spectacle"
    },
    {
      "rating": "5/5",
      "review": "My personal favorite Star Wars movie, Return of the Jedi is a fantastic ending to the Original trilogy. The characters are all at their very best, and their interactions are incredible. There's action, jokes, and sacrifice. An unbelievable film."
    },
    {
      "rating": "4/5",
      "review": "Return of the Jedi is a reasonably good ending for the Original Trilogy. It still has the fun of the previous 2 movies and I think it's the most creative one of the three. However, there are some disappointments that I think are the result of chasing deadline. For instance, the \"death\" of Bobba Fett (He was actually not dead though as later explained in The Book of Fett show.) was too sudden. Another example is how the Emperor was defeated. Overall, it's not as good as Empire Strikes Back and A New Hope but still a great movie. Perhaps it's the most humorous one of the three."
    },
    {
      "rating": "5/5",
      "review": "Best Star Wars movie there is"
    },
    {
      "rating": "4/5",
      "review": "A classic film that hasn't aged very gracefully, but is nonetheless a great film."
    },
    {
      "rating": "2/5",
      "review": "Hot take! I don't think this movies is that good. Darth Vader and Luke's arc is good, but the jabba the hutt and Ewok storyline is boring."
    },
    {
      "rating": "4.5/5",
      "review": "Ewoks. Still a great movie, but man...Ewoks."
    },
    {
      "rating": "4.5/5",
      "review": "Not only is it a great and fitting end to the trilogy, but a great movie on its own. It has my favorite scene in the entire Star Wars franchise (Darth Vader's redemption and death), and it tells its audience to look for light in everyone. It also really defies expectations how audiences of the earlier movies would have predicted that Vader's death and defeat would come with celebration, but it actually shows Luke mourning the good man that Vader once was."
    },
    {
      "rating": "3.5/5",
      "review": "A great conclusion to the trilogy, but it's much sillier and more childish than the previous one."
    },
    {
      "rating": "5/5",
      "review": "One of the Best Movies ever."
    },
    {
      "rating": "4.5/5",
      "review": "My favorite Star Wars film of all time. Great story, great acting, and great way to end a saga."
    },
    {
      "rating": "3.5/5",
      "review": "Fun very very fun I like the final old one"
    },
    {
      "rating": "5/5",
      "review": "So good. Lets start from the beginning and the rescue to save Han from Jabba the hut, it's perfect Leia and chewy trying to rescue him but then needing now Jedi master Luke to help save them. Then the battle with the rancor the the battle on the sail barge never missing a beat. Now to the forrest moon of endor for the greatest battle in the original trilogy, Han, Leia and Chewy on the moon Lando and the other republic fighters in space then Luke on the death star, and now the battle between farther and son. The choreography was magnificent and when they teamed up to fight Palpatine. Magic!"
    },
    {
      "rating": "4.5/5",
      "review": "Return of the Jedi was So Good, I loved it."
    },
    {
      "rating": "3.5/5",
      "review": "SPOILERS This final film in the original trilogy begings with Luke and the gang infiltrating Jabba's palace to free Han solo, who is still frozen in carbonite. Once Jabba is strangled by a sexy Princess Leia and all his goons fed to the Sarlacc, the team heads to destroy the Empire's second Death Star. Han and Leia must disable its protective shield on Endor, while Luke confronts his father and is emotionally manipulated by the Emperor. In the end, the second death star is blown up, Darth Vader, The Emperor and Yoda dead. While watching this movie I could not for the life of me get into it. It definitely felt its age more-so than the last two somehow. The green screen in the Sarlacc sequence, the close ups of Jabba's animatronic face, flying bike chases on Endor - I had such a hard time getting past the old time stamp embedded throughout the film. I didn't feel this way about the first two, not entirely sure what the difference was. Another aspect I felt seriously lacked in the film was emotional resonance and impact. The film was full of character moments trying to evoke emotion - Yoda dying, Han and Leia reuniting, Luke discovering the truth about his father and sister, confronting his father, battling within himself, the death of his father - I mean it seriously tried to be an emotionally powerful film. Unfortunately, none of these events got through to me. I honestly found myself laughing through most of them due to the corniness. I dont think anyone in the film did a great job acting these deep character moments, and most of them were just Hamill making a shocked face any five year old can make. Han solo is equipped with an arsenal of one liners this movie that seriously dont make his character relatable or personal in any way. Yoda's death is incredibly abrupt with almost no emphasis, and once again Hamill's acting this scene is less than good. The action sequences felt pretty lacklustre and failed to captivate me throughout. I really wanted to be invested in the final battle between Luke and his father. I just again, couldn't get past the corniness man. Luke is walking with him and referring to him as 'father', and Vader giving him some life lesson calling him 'son'. I just feel like the entire thing is overdramatized, like, this is NOT how you'd speak to someone you just found out is your father, and who is incredibly evil. Like I get hes his dad, but there is no relationship built up to this point, so the name calling feels, well, cringy. It just didn't work for me. I will however admit that Vader dying tugged at my heart a little, more than the rest of the movie anyway. Death stars really need to have better systems in place. I mean, this massive, inconceivably advanced technological marvel capable of destroying planets is being built in space, and can be blown up that easily? One shaft that is a strait shot to its core? Okay. Not to mention this plot point already happened two movies ago, and was done better. I can't help but feel the unwavering love for these original three films falls into the umbrella of nostalgia for most. Most people watch these movies as kids, and being old with less-than-stellar tech, there is something grounding and comforting about them - it takes us back to an older time. As we grow up, we hold onto the memories of love and fascination around the franchise, its characters and immense, intergalactic world. There is also no denying what Star Wars has done for Sci-Fi and films as a whole. It redefined its genre, and all movies after it, regardless of genre - it set a new benchmark in world building. The practical effects and early-stage VFX were revolutionary and captured the awe of audiences everywhere. They brought us some-of the most well known and loved fiction characters ever, and without going on, changed everything that came after. I have immense respect for these movies and what they have done culturally, technically and creatively, but all I'm saying is they may be a tad overrated. The quality of story in these movies is embellished due to its practical effects, VFX, world building, production design, eclectic characters and pioneering. Thats a good seg-way into the brilliance of the world design, set pieces and creativity involved. Throughout these films, the imagination of the different creatures and characters has captivated me, and I love the immense world created. The Sarlacc, Rancor, Jabba's minions, the Ewoks - and thats just to name a few this movie. The variety of planets is awesome, and I love how the story planet-hops, rather than stay stagnant. Its like space itself is our central hub, and the different planets are like different ships we are temporarily on. The sets created are extremely impressive and detailed, from the interior of spaceships to Jabba's palace. This franchise is an incredible and inventive space - story, and its an awesome premise to a franchise. The fact that most of it was done by hand is mind-blowing, wether it holds up today or not. Event though this film may not have been my favourite, I look forward to watching the next one. Overall, Return of the Jedi failed to capture my interest in terms of characters and story, but as always shines through imaginative creatures and production design. The practical effects and sets are mind-blowing, wether they hold up today or not."
    },
    {
      "rating": "5/5",
      "review": "Great way to bring back anakin and a great ending"
    },
    {
      "rating": "4/5",
      "review": "Not as strong as the first 2 movies (it is a high bar though) but still entertaining. A good ending to this trilogy."
    },
    {
      "rating": "4.5/5",
      "review": "After 40 years, this film still holds up. A nice tribute to a beloved film released 40 years ago from the brilliant mind of George Lucas."
    },
    {
      "rating": "4.5/5",
      "review": "amazing conclusion to the original trilogy."
    },
    {
      "rating": "5/5",
      "review": "Return of the Jedi is the best one out of the original trilogy and features one the best space battles and Luke is a fast paced jedi night and the ewoks I didn't really mind"
    },
    {
      "rating": "5/5",
      "review": "where the skywalker saga should end..."
    },
    {
      "rating": "5/5",
      "review": "Well needed remaster. The story has nothing change to a woman is it complex story made by George Lucas himself with oppressive visual effects still to this modern day. If you haven't watched Star Wars by now, I'm concerned, but you really need to get all the time and understand what it means to be a Star Wars fan. Have I given this movie a watch if you haven't already watched it, you will be blown away by how well the stories"
    },
    {
      "rating": "5/5",
      "review": "Better then the Disney squeals."
    },
    {
      "rating": "4.5/5",
      "review": "It was magical to see it on the big screen, but I wish they'd rerelease the original one with original effects or at least limit the changes to the old Special Edition."
    },
    {
      "rating": "5/5",
      "review": "Best Movie Ever. No Exaggeration. Also Warwick Davis's debut film"
    },
    {
      "rating": "4.5/5",
      "review": "Aquí debió acabar... ¡¿por que?! ¡¡¿por que tuvieron que hacer las demás películas?!!!"
    },
    {
      "rating": "3.5/5",
      "review": "40 years later and we all thought this was the end of the beloved, successful legacy of Star Wars George Lucas had envisioned 'A New Hope' got the ball rolling followed by 'Empire Strikes Back' that would build upon it The third entry directed by Richard Marquand in the original trilogy attempts to wrap up this story with the final battle between good and evil of the Rebel Alliance and the Galactic Empire Picking up after the previous film Luke Skywalker is about to become a Jedi knight with much more confidence and experience but first he must confront Darth Vader again whom he discovered was his actual father But he must also resist the dark temptations of the Emperor avoiding falling to the dark side of the Force lest he become an agent of evil Leia, Lando, Chewbacca, R2-D2, and C-3PO attempt to save Han Solo from the clutches of Jabba the Hutt The final confrontation finds our heroes taking out the generator shield for the second Death Star on the forest moon of Endor But they also get assistance from the locals called Ewoks who seem cute but are sharp toothed being they prefer nature based tactics as opposed to machines Many see this as lesser than the previous films as it goes for a more lighter, cutesty feel Plus the beginning taking too many detours and an over reliance on the Ewoks, the dialogue is also still kinda stilted This does has some of the best effects by Industrial Light & Magic from the speeder bike chase to the Ewok battle and the most dramatic moments though from Yoda passing to Leia finding out her sibling relationship to mainly between Luke and Vader constantly going back and forth about their paths they should take Their confrontation is physical but also psychological Ian McDiarmid is pitch perfect as the Emperor being so imposing, dark, delightfully sinister, and uses that right amount of seduction hungering for power spitting out hate and manipulation Plus the final battle more than makes up for the minor flaws with three battles going on simultaneously even if it feels a bit jumbled Fans also remember the appearance of Boba Fett unjustly tossed aside but thankfully we'd see him again in future projects John Williams' score always heightens the excitement and sells the emotions in the storytelling as usual 'Jedi' wraps up Luke's story completing his arc of his journey while also giving Vader his redemption making it one of the most iconic moments in the franchise…the once proud Jedi prophecized to bring balance truly returned True the action scenes are not as thrilling as before but it's more about emotional payoffs than anything for all the characters still retaining the swashbuckler feel Many of the themes still reside in loyalty, decency, redemption, self-sacrifice, friendship, and family for a fitting finale Little did we know this wouldn't be the end of the beloved franchise; Lucas and company forever made their mark in film, science-fiction, geek even thevpop cultural landscape, and modern filmmaking techniques thanks to ‘Star Wars’"
    },
    {
      "rating": "0.5/5",
      "review": "So boring story, the special effects are too bad to watch now."
    },
    {
      "rating": "3/5",
      "review": "My all time favorite star wars movie i just love the 3rd act with space land and a light start battles all going on at once"
    },
    {
      "rating": "5/5",
      "review": "What an experience. It was life-changing to see that film in theaters. I'm so glad I got too see this and it is now in my Top 2 Star Wars films."
    },
    {
      "rating": "5/5",
      "review": "💝💗💝💗💌💞💌💌💞💌💝💗💌💖💌💌💌💝💌💝💌💝💗💌💝💌💌💝💌💌💝❤️‍🔥💟💔💟💛💛💟🩷💟❣️❤️‍🔥🩷❣️❤️‍🔥❣️❤️‍🔥💟❤️‍🔥🩷💟❤️‍🔥💟❤️‍🔥💟🩷💟🩷💔💟🩷💔💟🩷❤️‍🩹💟💔🩷💟🩷💔❤️‍🩹💟💔❤️‍🩹🩷💟💔🩷🩷💔💟❤️‍🩹🩷💟💔❤️‍🩹🩷💛🩷💛💔❤️‍🩹🩷💔💛🩷💛❤️‍🩹❤️‍🩹💔💛❤️‍🩹💛🩷❤️‍🩹💛❤️‍🩹💛🩷💔💛❤️‍🩹🩷🩷❤️‍🩹💔💟❤️‍🩹💟💔💔💟❤️‍🩹💝💟💟💝💟❤️‍🩹"
    },
    {
      "rating": "5/5",
      "review": "While I could've done without some of special edition mess, it was still awesome to see a classic Star Wars in theaters for the first time. The final confrontation in this movie is still some of the best Star Wars ever created."
    },
    {
      "rating": "5/5",
      "review": "Part of the original 3, my least favourite of the first 3, but it still makes the must watch. Episode 1,2,3,7,8, and 9 are all forgettable."
    },
    {
      "rating": "5/5",
      "review": "Still good 40 years later."
    },
    {
      "rating": "5/5",
      "review": "A Classic, so off course a must see. Watched it when it premiered in German theaters in 1983, watched it several times again. The Movie is a very good ending to the Trilogy, what made it for me so annoying when Lucas started to film his Episode-Trilogy, with not much to tell, lame tricks, bad cast decisions... Viewing it today with really good extensions of the Star Wars Universe like The Mandalorian its at least for me harder to watch the Special Effects and think of it very nicely, but the movie luckily has more then that, cool characters, action, humor, emotions...and Ewoks...a blockbuster for the whole family :) I like the new trilogy starting with The Force awakens but Jedi is off course where this all comes from and its still worth a look in 2023."
    },
    {
      "rating": "5/5",
      "review": "Needs a sixth star to rate this movie.. Oh wait Ewoks.."
    },
    {
      "rating": "5/5",
      "review": "Best star wars movie EVER still holds up great to see it back in theaters again."
    },
    {
      "rating": "4.5/5",
      "review": "The perfect end to a flawless trilogy"
    },
    {
      "rating": "5/5",
      "review": "I love it, it is truly a great ending to a great era, i honestly believe it shouldve ended here. (shows like mandalorian and bobf are okay of course) it had an interesting opening to keep me interested, in the middle it slowed down a bit and than it was awesome again, and the final confrontation and scenes between luke and vader/anakin is truly hartwrenching. its a great movie and i advise anyone to watch it."
    },
    {
      "rating": "5/5",
      "review": "Never gets old, the legacy never dies. Legends live on. Always a joy to see Star Wars with your passion."
    },
    {
      "rating": "5/5",
      "review": "Trilogian päätös, joka oli huikea"
    },
    {
      "rating": "5/5",
      "review": "Great to revisit a feel good movie."
    },
    {
      "rating": "4/5",
      "review": "i love it but yuzzam are ugly and princess leia's outfit is to sussy"
    },
    {
      "rating": "5/5",
      "review": "Love it!!!!!!! Star Wars! 🙌🏼🙌🏼🙌🏼🙌🏼"
    },
    {
      "rating": "4/5",
      "review": "A satisfying ending but the first half was boring"
    },
    {
      "rating": "4.5/5",
      "review": "Return of the Jedi id still amazing age very well"
    },
    {
      "rating": "5/5",
      "review": "I haven't seen Return of the Jedi on the big screen since the 80s and this was great fun!"
    },
    {
      "rating": "5/5",
      "review": "I had the privilege to watch this classic in theaters for the first time. This was probably my favorite movie theater experience in my lifetime. From hearing the opening Star Wars theme, listening to the iconic soundtrack by John Williams, and seeing the emotional fight between Vader and Luke. Most importantly though… I was able to see Hayden Christianson as Anakin Skywalker during the last moments of the movie. That moment is one of, if not my favorite moment in the entire franchise. It gets me so emotional every time and to see it in theaters was a dream come true. Yes, this movie has some flaws like its pacing at points, but this movie and this franchise as a whole will always hold a special place in my heart. This Star Wars rewatch was so worth it… may the force be with you."
    },
    {
      "rating": "5/5",
      "review": "Enjoy yourself. A great movie underpinned by deep mythos, utterly fantastic."
    },
    {
      "rating": "5/5",
      "review": "My favorite Star Wars movie!"
    },
    {
      "rating": "5/5",
      "review": "At last, a 'Disney' owned movie in the Theatre worth watching, it's a shame that this was not promoted better by Disney & that it is being shown in only a limited amount of theatres. A great family movie that outshines most, if not all, of their current efforts, and is a great ending to an amazing trilogy, with the only question being left was what would happen next for Luke Skywalker. A wider release for this movie would have been like printing money, one can only hope that the 50th Anniversary of the whole original trilogy are treated better with a decent worldwide release starting in 2027."
    },
    {
      "rating": "5/5",
      "review": "Saw it again in the theater this weekend. Such a breath of fresh air."
    },
    {
      "rating": "0.5/5",
      "review": "The original film was amazing. These new edits ruin so much."
    },
    {
      "rating": "4.5/5",
      "review": "A fitting conclusion to a near perfect trilogy! While it is great seeing the cast together again, the inclusion of the ewoks are questionable, and the only reason behind my 4 1/2 star rating for this otherwise perfect film!"
    },
    {
      "rating": "0.5/5",
      "review": "The movie gets worse and worse the more I watch it. The Ewoks and the fight scenes took jumping the shark to a new low. It also brings up the question why do stormtroopers were armor it sticks and rocks can kill them? Luke is a master Jedi in maybe 5 years with little to no training? What do the rebels’ battle cruisers do? They don’t fight."
    },
    {
      "rating": "5/5",
      "review": "Great to see real Star Wars in the theater again. Lucas Star Wars is the only movies I want to see. So glad we went to see this classic."
    },
    {
      "rating": "5/5",
      "review": "Another era has come and gone. STAR WARS: RETURN OF THE JEDI is an incredible conclusion to the original trilogy, which means that there are lots of fantastic adventures beyond the horizon."
    },
    {
      "rating": "4.5/5",
      "review": "Watching this in theaters again shows how much George Lucas is missed in the Disney era Star Wars."
    },
    {
      "rating": "3.5/5",
      "review": "What I like about the original Star Wars trilogy is each installment feels like a self-contained episode in a very short television series. It sucks that George Lucas decided to redo many edits and visual effects in the original three movies with modern CGI effects and random inserts of actors who did not appear until the later installments in the series. Regardless of the alterations, it is still fun to go back and re-watch Return of the Jedi for the sake of simple enjoyment."
    },
    {
      "rating": "5/5",
      "review": "Sure Ewoks are annoying but rest of it is amazing"
    },
    {
      "rating": "5/5",
      "review": "It was so surreal seeing Jedi on the big screen. The Death Star explosion never gets old! Had an absolute blast!"
    },
    {
      "rating": "4/5",
      "review": "Wouhh! la nueva carátula conmemorativa es una pasada, me encanta :)"
    },
    {
      "rating": "4.5/5",
      "review": "simplemente una obra de arte casi perfecta"
    },
    {
      "rating": "5/5",
      "review": "Nostalgia! The Return of The Jedi's unique style is timeless. The final scene is a masterpiece."
    },
    {
      "rating": "5/5",
      "review": "The greatest 02 hours: and 11 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring Mark Hamill as Luke Skywalker, Harrison Ford as Han Solo, the late Carrie Fisher as Luke's sister Leia Skywalker, the late Kenny Baker as R2-D2, James Earl Jones as the voice of Darth Vader, and the voice of Frank Oz as Yoda!!!!!!!!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "The music hits different in theaters 👌🏻"
    },
    {
      "rating": "5/5",
      "review": "Peak cinema you must rewatch"
    },
    {
      "rating": "5/5",
      "review": "The best movie since 1983 today I went to see the 40th anniversary everyone celebrating the re-release of this movie it came out in the 1980s"
    },
    {
      "rating": "3.5/5",
      "review": "I saw Return of the Jedi 40 years ago, when it was in theaters the first time. It was thought to be the conclusion of the Star Wars trilogy, and the end of a new era in film history. The film was good on that basis, although the least satisfying of the three original films. I am not sure anyone contemplated that the next 40 years would deliver a series of new and continuous projects around the Star Wars character and properties. This one held up. It is not the best or the worst of the Star Wars films. It has some great moments and some great emotional content. It held up on the big screen, and while there are not many changes or additions the film seems enhanced, rather than aged-so it looks good. Some of the Endor special effects are dated, but the rest is engaging and a fun time. It was nice to see it in a full audience with people that were not alive when the original series played on the big screen."
    },
    {
      "rating": "5/5",
      "review": "What a great movie! George Lucas is a genius!"
    },
    {
      "rating": "5/5",
      "review": "good stuff, he was his father, surprisingly"
    },
    {
      "rating": "5/5",
      "review": "Just as good as when it first came out in cinemas in 1983"
    },
    {
      "rating": "3.5/5",
      "review": "Despite more stumbles than its predecessors, Return of the Jedi brings the original Star Wars trilogy to an epic, iconic, and satisfying conclusion in the grandest Star Wars story yet, with the father son story of Luke and Vader capping it off."
    },
    {
      "rating": "4/5",
      "review": "I think this was a great movie! However, there were a few things I didn't like. First, I think it was a big mistake (letdown) to remove Vader's mask, only to find a Mr. Potato head under there. I think Vader's look should have remained mysterious. Now when you see Vader making his entrance in New Hope it's not as ominous, scary, or mysterious. We did not have to know what Vader looked like under the mask. At best, they should've left his look under the mask mechanical, but even that would have ruined it. Also, Ben turned out to be a liar using deceptive tactics and language you would expect from the dark-side when he says \"a certain point of view\" nonsense. Well, from a \"certain point of view\", maybe the Emperor and Sith are right. Ben obviously thought Luke was old and mature enough to go to Alderaan with him, but not old and mature enough to know the truth. Also, I definitely missed Han and Chewie running the Falcon, but it is what it is. The music was great! John Williams is a master at what he does! One last thing, I never liked Jabba the Hutt. With all the talent and creativity at Lucas' disposal, I know they could've created something (or someone) much better. This movie is certainly better than Empire Strikes Back by a long shot. So, yes it's worth the price of a ticket. Go see it!"
    },
    {
      "rating": "3.5/5",
      "review": "The second best star wars movie I've watched(note: I only watched episodes 1,2,4,5 and 6)"
    },
    {
      "rating": "5/5",
      "review": "Personal favorite of the original trilogy. The resolution of a story that shows the effects of growth across all of the characters that we've followed since A New Hope."
    },
    {
      "rating": "4/5",
      "review": "The beginning of this movie is good and the ending is phenomenal, the best third act in the trilogy but the middle is boring."
    },
    {
      "rating": "5/5",
      "review": "STAR WARS: EPISODE VI -- RETURN OF THE JEDI is the amazing finale to the original trilogy of the Star Wars franchise. Once again it's dark, entertaining, and has some even more emotional scenes!"
    },
    {
      "rating": "4.5/5",
      "review": "The end of a great trilogy!"
    },
    {
      "rating": "4/5",
      "review": "Star-Wars: Return of the Jedi closes out the original trilogy in entertaining fashion, expanding nearly everything about the galaxy from a long, long time ago. Rating: 80%"
    },
    {
      "rating": "3/5",
      "review": "Massively overrated movie. Poor planning led to George Lucas creating about a million essential plot points that should have been established from the first or second movie. The \"leia is my sister\" line is the worst of the original 6 movies. I've watched all of them dozens of times, so I've pretty much memorized every scene of each movie. The Ewoks were the minions before there were minions, and the Death Star shouldn't have been reused. If you watch the movies 1-6, it's glaringly obvious that the choreography isn't nearly as good in this movie as it was in any of the prequels. In spite of all of this, it has many positive aspects. The final fight with Vader is one of the most emotional in Star Wars, and the final defeat of the emperor is oh so satisfying. Vader's redemption felt genuine, and the parallel between the rebellion's celebration and Luke mourning the death of his father is brilliant. For the time, the visual effects are extremely impressive, and it's easy to see why so many enjoyed it so thoroughly. Overall a satisfying -albeit flawed- conclusion to George Lucas' brilliant 6 movie saga. So glad some big company like Disney didn't go and buy it up and make 3 terrible sequels that ruined the first 6 that George Lucas carefully crafted, or something like that."
    },
    {
      "rating": "4.5/5",
      "review": "A triumphant return of our favorite characters in their best form yet to take on the Galactic Empire. A story of redemption and hope that good can triumph over evil."
    },
    {
      "rating": "4.5/5",
      "review": "So I love Episode IV for introducing the SW story and giving birth to SW and V because Obi-Wan comes back to life as a Force Ghost. I and I love Episode VI because in my opinion it carries the story very well. Action, I love the action really good and I love it so much because its just the best no one can really say anything different. Acting is always prefect in Star Wars. CGI, for the time the CGI is great. Villain, I said this before and I'll say it again Vader is one of the greatest villain of all time a lot of villains across all franchises are great but Vader is in top 3 in my opinion. Writing, I think that the writing is great but in some scenes it could have been slightly better. Story is great SW always manages to make the story perfect. Casting is perfect. Characters, I really like the Ewoks I think that they are cute characters and should be used a bit more in SW. Adventure is perfect it really is SW always travels though space which is really nice. Ending I love the ending but I don't know how Luke could have beaten Vader. His speed would help him but Vader especially in the Obi-Wan show is shown with immense power and I don't understand how Luke could have beaten him or how Vader could have some how gotten weaker."
    },
    {
      "rating": "5/5",
      "review": "While perhaps not as slick as Its predecessors, the third installment the original trilogy is a more than satisfying end to the story begun \"A New Hope\". It provides all you've come to expect, with great moments of action, suspense, and emotion. It's honestly quite hard to hate this franchise, well up until this point at least. George Lucas made something truly special, which will never be replicated, and I'm okay with that. Once more, you deserve your flowers, George."
    },
    {
      "rating": "4/5",
      "review": "Only negative is that there is way to much Ewoks, but that's all, everything else is beautiful."
    },
    {
      "rating": "5/5",
      "review": "Great end to the Skywalker saga. Great acting love the emperor if we thought Vadwr was bad this guy was kick ass an amazing film. Good comes though in the end."
    },
    {
      "rating": "5/5",
      "review": "Why have I've watched the saga so many times for some many years I don't understand 🥰😂🥰🙏"
    },
    {
      "rating": "5/5",
      "review": "I loved Star Wars for most of my life, I could recite all three movies of the top of my head…. Fantastic film"
    },
    {
      "rating": "4/5",
      "review": "The weakest of the Original trilogy, but still a very good movie. Charismatic characters and interesting dialogues between Luke and Darth Vader. Satisfactory ending that should've been left alone instead of being vandalized by the sequels."
    },
    {
      "rating": "5/5",
      "review": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD good 🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻"
    },
    {
      "rating": "4/5",
      "review": "Even though it might not be as good as the first two, it still holds up. With even more world-building and the introduction of the grandmaster of every evil thing in the world, this film is excellent. It has an exciting story that captivates your mind while also keeping you in suspense. A great conclusion to the trilogy, an emotional plot, and (get this) more surprises. They never stop coming. Truly a classic. Keep it up, George."
    },
    {
      "rating": "4/5",
      "review": "Return of the jedi is a really good ending to this trilogy. Its a fast moving movie. While there is flaws. The ewoks are cute and the ending is good. It just doesn't hit as right as some of the others do."
    },
    {
      "rating": "4/5",
      "review": "this is an iconic end to one of the all-time best trilogies in all of cinema. Luke's arc of not giving in to evil, which ultimately redeems Vader is great. while the emperor doesn't really do much, I do like how Palpatine believes that evil is tied to blood and how people are either born good or evil, but that Luke believes that everyone is able to overcome evil. Leia and Han also have a great story around taking down the shield and revealing their feelings for each other. As well I like how Lando gets redeemed by taking down the second death star. The only problem is that the first segment of the movie on Tatooine does drag but it is still an incredible end to this trilogy."
    },
    {
      "rating": "5/5",
      "review": "The final film in the Original Trilogy and possibly the best one, as we embark on an adventure that we will remember for the rest of our lives. Memorable performances by Hamill, Fisher, Williams and Ford truly stand out."
    },
    {
      "rating": "4/5",
      "review": "Not as good as the other 2. But still a nice way to end the originals"
    },
    {
      "rating": "4.5/5",
      "review": "Not quite as good as the first two but finally seeing Luke become who a Jedi. Was great!"
    },
    {
      "rating": "5/5",
      "review": "This is my favorite. Finally encountering the Emperor on screen for the first time, the wild base of Jabba the Hutt with the classic monsters there, the death of Yoda, the redemption of Vader—the scope of Return of the Jedi is unmatched and brings home the epic themes and storylines from the first two movies. This was the complete emotional and narrative end to the saga, and where they should have left it. The originals were self contained with a beginning, a middle, and an end. Everything since has been trying to recapture the magic and inevitability falling short. But that doesn't take away from the greatness of this one. A true classic in every sense."
    },
    {
      "rating": "5/5",
      "review": "Absolute classic, great end to the Skywalker saga"
    },
    {
      "rating": "5/5",
      "review": "a guarantee, a must see you will never forget"
    },
    {
      "rating": "5/5",
      "review": "The third film in the Star Wars original trilogy. Lots of fun and wraps up the story line very nicely. On par with the original two films, wrapping this up as one of the best movie trilogies ever. I absolutely loved all three films."
    },
    {
      "rating": "5/5",
      "review": "Was always my favourite as a kid! Still is a great end to the original trilogy."
    },
    {
      "rating": "3.5/5",
      "review": "Hard fall off from the previous two. Terrible pacing with two insanely bad subplots (ewoks and han rescue). Amazing ending with one of the best battles in the series."
    },
    {
      "rating": "3/5",
      "review": "this movie is ok a nice end of this trillogy bat isn't perfect"
    },
    {
      "rating": "5/5",
      "review": "I think it's the best star wars movie of all time"
    },
    {
      "rating": "4.5/5",
      "review": "Great conclusion to the series. Amazing cast and great story"
    },
    {
      "rating": "3.5/5",
      "review": "I do like this movie but it moves kind of slow but the father son lightsaber dule is amazing."
    },
    {
      "rating": "4.5/5",
      "review": "Amazing close to the trilogy/saga"
    },
    {
      "rating": "5/5",
      "review": "This in the Empire strikes back are tied for me but I think I like this one just a tiny bit more for the exciting conclusion of the original trilogy 10/10"
    },
    {
      "rating": "4.5/5",
      "review": "\"Star Wars: Episode VI- Return of the Jedi\" is a solid science fiction/adventure film but one that is not quite on the grand level of \"Star Wars: Episode IV- A New Hope\" (1977) and \"Stars Wars: Episode V- The Empire Strikes Back\" (1980) but one that is still a fitting conclusion to the original trilogy and the finale for the series as a whole. While the latter trilogy would come close to this level they never quite fit with the darker and more auspicious original trilogy in scope and atmosphere. Our primary protagonists see fitting ends to their stories here, Han Solo (Harrison Ford), Luke Skywalker (Mark Hamill), and Princess Leia (Carrie Fisher) all see their destinies fulfilled. Many story arcs are brought to fitting conclusions and heroes are formed and villain's vanquished all with wonderful storytelling and composure in it's final act."
    },
    {
      "rating": "5/5",
      "review": "The final chapter of the greatest film trilogy of all time!"
    },
    {
      "rating": "4.5/5",
      "review": "This has some of the best starwars moments, but the only reason ai didnt give it 5 stars is because of the beginning of the jabbas palace part. It was really wierd and childish. But apart from that this movies legendary, the batle of endor is outstanding!"
    },
    {
      "rating": "4/5",
      "review": "Although not quite as versatile as its predecessors, it's still a magical sci-fi picture with epic scenes, that balances our favorite characters perfectly, while being an appropriate conclusion to this legendary trilogy altogether."
    },
    {
      "rating": "4/5",
      "review": "Luke Skywalker's attack on the Death Star marked the conclusion of \"Star Wars.\" We went after Luke and Luke by himself. At the climax of \"The Empire Strikes Back,\" there were two distinct streams of action: Leia and Han fought for their freedom, and Luke Skywalker faced off against Vader. There were three divisions in \"Return of the Jedi\": Endor, Death Star, and rebel fleet. And guess what? \"The Phantom Menace\" breaks up the climactic action into FOUR streams. Things will get absurd if this tendency persists. They have already."
    },
    {
      "rating": "4.5/5",
      "review": "It all comes down to the Ewoks: either you're okay with them, or you hate them. For me, they're alright, maybe because I was 9 when I saw this movie on first release. Anyway, if you can get past that, there's a lot to love: epic space battles, Luke's final temptation and showdown with Vader, and the great first act on Tatooine. One gripe: Leia doesn't have much agency in this movie, showing less drive and leadership as she did in the first movies, and showing no hint of the commanding military presence she'd have in the sequels."
    },
    {
      "rating": "4/5",
      "review": "Undoubtedly a worthy ending."
    },
    {
      "rating": "4.5/5",
      "review": "Warning: Spoilers So what made this movie a step down than its two predecessors? Well, forgive me for nit picking, but I didn't think the humour is as strong as it was in New Hope and Empire Strikes Back. Plus, while it was evident, the romantic elements weren't as developed either. However, putting these flaws aside, it is still enormously entertaining, thanks to the elaborate set pieces and the well choreographed battles(the final battle especially was a knockout). And I will say that it is a vast improvement over the prequels. The plot is still fast paced and sophisticated, and the screenplay while not as fun still is as imaginative as ever. I have heard many complaints about the Ewoks. I think it depends on your perspective whether you like them or not; maybe a delight to younger audiences, maybe too sickly cute to an adult. Being a 17 year old female, I thought they were very cute. The acting is still very impressive, with Mark Hamill spontaneously likable in the lead. Frank Oz is a perfect Yoda and his death scene is heart rending, and Ian McDairmund also steals his scenes as the Emperor. Harrison Ford, in an inspired bit of casting is great again as Han Solo, Carrie Fisher is still vivacious and Alec Guiness the great actor that he was is brilliant as Obi Wan. But my favourite is James Earl Jones as the voice of Darth Vader, his majestic booming voice is very ideal for a dark menacing villain. And I must mention John Williams's music, brilliant and innovative, unquestionably one of the best film scores of all time. All in all, while my least favourite of the original trilogy, Return of the Jedi makes for essential viewing. 9/10 Bethany Cox."
    },
    {
      "rating": "5/5",
      "review": "Best of Movies/TV Series Collection"
    },
    {
      "rating": "4/5",
      "review": "Superb fun sequel. Completes the original trilogy perfectly. Prequel trilogy and sequel trilogy are optional."
    },
    {
      "rating": "4.5/5",
      "review": "When I was my favorite of the trilogy but as I got older it became less and less and while the other 2 became two of my favorite films ever. I just watched this again for the first time in quite awhile and I have to say I may have been too harsh on this when I was younger. The acting is good overall though not as strong as the other 2 films (Especially Harrison Ford who feels more like he's going through the motions). The highlight is clearly the Emperors acting. The action is very well done although just a step below the other 2 in my opinion.The editing and pacing has some minor issues joining the first and 2nd half together. The editing and pacing hold up much better than I remember as it does feel like the Jabba's Palace scene and the rest of the film feel like there 2 different movies combined but it still works. And my biggest thing I didn't like the Ewoks while I still wasn't a fan it wasn't nearly as bad as when I was younger. My biggest complaint would be that the 2nd half is just mainly a retelling of Star Wars (1977) but it was still well done (The highlight is the fighting between Darth Vader, Luke & the Emperor). Overall it is a classic Science fiction Movie/classic 80's movie and a great way to end the trilogy and the problems it has are all marginal that still make it a classic of its genre but not a all time great like its predecessors."
    },
    {
      "rating": "4/5",
      "review": "A very good ending to the OT. Had a great space battle and an iconic final dual and confrontation."
    },
    {
      "rating": "5/5",
      "review": "A Childhood Classic of Mine. Some people dislike It But I really Love this Film."
    },
    {
      "rating": "4/5",
      "review": "A satisfying conclusion to an iconic trilogy with some great emotional payoffs definitely give it a watch although there are some plot holes and lack of logic in the first act that do lower the filns overall quality but people often overlook that due to it being exciting so make of that what you will depending on how you approach films. Despite the first acts short comings the plot is genuinely consistent and the characters are arguably at a all time high and you feel as though the saga has reached its conclusion. TLDR; it's great loved it"
    },
    {
      "rating": "5/5",
      "review": "An EPIC conclusion to the best movie trilogy of all time. We start out strong with the absolutely excellent sequence that is the Battle of the Great Pit of Carkoon. A.k.a. the Sarlaac Pit. The setting of the multiple desert skiffs and Jabba's Sail Barge created an excellent set for an epic battle. Then we finish it off with a final battle so large, that it's on three fronts at the same time. With the Rebel Alliance fighting the Empire in space while they hold out for the ground assault to disable the second Death Star's shield. Meanwhile, we have Han Solo, and Leia Organa leading the Rebels and Ewoks against the Imperial Bunker. Within this battle we've got the Ewoks beating on the legs of the giant AT-STs with small wooden and stone clubs and throwing rocks at Stormtroopers and hijacking the Imperial speeder-bikes. On top of that, we have a fantastic duel of Palpatine manipulating Luke to harness his anger and use it to fight his father. Until he realizes that he's being manipulated and that Palpatine is trying to turn him to the dark side. All of this culminating in Darth Vader making the ultimate sacrifice and throwing the Emperor down a bottomless pit to his death in order to save his son, thus bringing balance to the force and fulfilling his prophecy as the chosen one. 10/10"
    },
    {
      "rating": "3.5/5",
      "review": "Not as good as the first two the movie is a bit boring but still a good movie"
    },
    {
      "rating": "3/5",
      "review": "Music was bumping throughout the whole movie, definitely a highlight. Boba Fett was much lamer than I remember, he barely did anything throughout the trilogy. Under used character that could of brought much more interest to the movie. Hard to believe the tiny Ewoks did as much damage as they did against the storm troopers and such. Too much screen time was spent on them, got a little annoying. Plots great except the standard Star Wars blowing up a Death Star part."
    },
    {
      "rating": "3.5/5",
      "review": "I think most consider this to be the weakest movie of the original trilogy, and it is, though it's not bad either. It has lost half a star for additions to it post prequel trilogy, one of the worst of which turns that disgusting Sarlacc creature (sand beast that devours people dropped into it) into Audry from the Little Shop of Horrors, and some other additions. I forgot about that particular addition, and it made me rage again upon seeing it when recently watching the movie on Disney+. It's original version was far more impressive, as a giant thorny hole in the sand, and much more menacing as a result. In addition I didn't much care for adjustments to the entertainment in Jaba the Hut's base, those moments seeming to be particularly disjointed. With respects to original elements, the Ewoks, while cute, do seem to be something of a mistake, in that they occupy too much movie time, with no meaningful amount of Ewok character development - there was indeed a regular one that popped up more often than the others, but they didn't go to any lengths to make that really resonate. Endor also seemed a location that had little meaning, in so far as that new death star's development was concerned - I suppose it would have been a tactically discrete location for construction, and testing maybe, but it didn't make all that much sense either, in terms of ramping up the stakes! Had it had its sights set on Tattooine, for example, the stakes may have elevated a good deal more."
    },
    {
      "rating": "5/5",
      "review": "a classic, a must watch for everyone."
    },
    {
      "rating": "4/5",
      "review": "My rating for the film is a 8.7/10"
    },
    {
      "rating": "3/5",
      "review": "With an unprecedented task of following up the two previous entries, Return of the Jedi tries its best live up to its expectations. Sadly the film only manages be serviceable, with sprinkles of greatness here and there."
    },
    {
      "rating": "4.5/5",
      "review": "worst of the original trilogy, but just barely. The worst of this trilogy is better than anything in the other two trilogies by far."
    },
    {
      "rating": "5/5",
      "review": "Empire Strikes Back and Return of the Jedi are my all-time favorite movies ever!"
    },
    {
      "rating": "5/5",
      "review": "Weakest of the original trilogy but still one heck of a film. This tops off the greatest trilogy in movie history. This movie caps off Luke Skywalker and the redemption story of Darth Vader."
    },
    {
      "rating": "4.5/5",
      "review": "While sure it might not be as good as it's predecessors it still is an entertaining film."
    },
    {
      "rating": "4/5",
      "review": "Although this movie isn't as good as the last two and Luke's plan makes no sense whatsoever and Han Solo's character isn't as good in this movie. I still love it so much. It has so many fun and engaging sequences and an epic final battle that wrapped up the series perfectly."
    },
    {
      "rating": "3/5",
      "review": "Well, what else can I say that everyone else hasn't already said. It is just a pretty good movie. Nothing ground-breaking like Episodes 4 and 5, leagues above 1 and 2, and just a bit better than 3."
    },
    {
      "rating": "4.5/5",
      "review": "Return of the Jedi is no quite as good as the first Star Wars film, New Hope and Empire Strikes back. The Ewoks are not my cup of tea. But I think everyone will like this movie. And this movie serves as a great ending for the trilogy."
    },
    {
      "rating": "4/5",
      "review": "Best of the original trilogy."
    },
    {
      "rating": "5/5",
      "review": "This is a great conclusion to the series, i sure do hope Disney doesn't ruin it!"
    },
    {
      "rating": "5/5",
      "review": "While frankly, I do have some issues with this film like little Ewoks with sticks as weapons managing to take down the most powerful empire in the entire galaxy is a bit strange. The Luke & Vader scenes are really what makes this film great, just their chemistry in this one is amazing. And this is really the first time we have seen Darth Sidious in person and he really was great in this, just becoming another iconic Star Wars character. This film is a great conclusion to the original trilogy."
    },
    {
      "rating": "5/5",
      "review": "Absolutely amazing yes it has some flaws like Ewoks and Han arc is not as good here as it was in Empire Strikes back,but Luke and Vader last confrontation and Vader redemption arc and Palpatine demise is just amazing,the fight scenes and action are great,the pace is fast the characters are interesting and dynamic,the cinematography and practical effects look great and hold up well. The ending is emotionally satisfying and ties the entire franchise perfectly. This is what I would like to consider real perfect finale for movie franchise. Luke Skywalker becoming an actual jedi master and a leader that can sacrifice himself just to save his father is just incredible storytelling. 10/10 a great ending to original trilogy and emotionally and narratively satisfying in all ways it's entertaining and a great movie throughout even with minor flaws."
    },
    {
      "rating": "5/5",
      "review": "thoroughly cracking stuff!"
    },
    {
      "rating": "5/5",
      "review": "a good finale to the original trilogy and a very good ending"
    },
    {
      "rating": "4.5/5",
      "review": "Yeah, this is better than CATS."
    },
    {
      "rating": "3.5/5",
      "review": "I don't really like this movie, The teddy bears are annoying. Action is good, Plots- ok Final rating- 7.72/10"
    },
    {
      "rating": "5/5",
      "review": "Here's my Review Rated: PG Release Date: A New Hope: May 25, 1977 The Empire Strikes Back: May 21 1980 Return of the Jedi: May 25 1983 Storyline: A New Hope: After Princess Leia, the leader of the Rebel Alliance, is held hostage by (main villain) Darth Vader, (main heroes) Luke and Han Solo must free her and destroy the powerful weapon created by the Galactic Empire. The Empire Strikes Back: (main villain) Darth Vader is adamant about turning (main hero) Luke Skywalker to the dark side. Master Yoda trains Luke to become a Jedi Knight while his friends try to fend off the Imperial fleet. Return of the Jedi: (main hero) Luke Skywalker attempts to bring (main villain) Darth Vader back to the light side of the Force. At the same time, the rebels hatch a plan to destroy the second Death Star. -The directors George Lucas, Irvin Kershiner and Richard McQuarmand did an amazing job. George also directs \"American Graffiti\" and \"THX-1138\". Irvin also directs \"Robocop 2\". They're awesome The actors Mark Hamill (plays as Luke Skywalker), Harrison Ford (as Han Solo), Carrie Fisher (as Princess Leia) and James Earl Jones (voiced as Darth Vader) are so awesome in the trilogy. They did fantastic It's a Live-Action one It's Action packed, Science-Fiction and Fantasy Movie My favourite Scene is the Space Battle bits and Lightsaber fights I've watched it on DVD, cinemas and Disney+ I saw it with my family I love this trilogy because these are really awesome, I started to watch this trilogy when I was 10 years old after it came out on DVD. My favourite characters are Darth Vader, Luke Skywalker, Princess Leia, Han Solo, Chewbacca, C-3PO and R2D2 I love the Lightsaber fight scenes I love the Space Battle scenes because it's Heart-Pounding I love the Characters because they're awesome The costumes are so cool The composer John Williams is really great The sound effects are really cool The special effects are really awesome A New Hope: 10/10 The Empire Strikes Back: 10/10 Return of the Jedi: 10/10 Total: 10/10"
    },
    {
      "rating": "4/5",
      "review": "A pretty good follow up to Empire but not the greatest. It could be better if the Ewoks where nerfed a bit. I mean they are teddy bears taking down walking tanks. Everything revolving Vader, Luke, and Palpatine is absolutely perfect. Just the Ewoks are the worst part of the film and if they were removed it would be a 4.5/5"
    },
    {
      "rating": "5/5",
      "review": "best star wars movie yet"
    },
    {
      "rating": "4.5/5",
      "review": "Though it has it's flaws, this movie is still 10 times more enjoyable than the rise of skywalker"
    },
    {
      "rating": "5/5",
      "review": "Love this movie. So much better than todays \"movies\""
    },
    {
      "rating": "5/5",
      "review": "My all-time favorite movie!!! An undeniable MASTERPIECE!!!"
    },
    {
      "rating": "5/5",
      "review": "Very Very Very Good. Huge Star Wars Fan"
    },
    {
      "rating": "4/5",
      "review": "Could had been better."
    },
    {
      "rating": "5/5",
      "review": "Omg It is just amazing. Another star wars film to recommend!"
    },
    {
      "rating": "5/5",
      "review": "What a way to cap off what I call the perfect trilogy of OG Star Wars films. Although \"worse\" than the other two movies in the trilogy, George Lucas still delievered hard. There are some amazing moments during the movie that I absolutely cherish. The characters having astonishing arcs all throughout the film, too. Perfect finale of the original and perfect trilogy."
    },
    {
      "rating": "4.5/5",
      "review": "Not as good as V but still a worthy end, there's no way the evil sorcerer coule survive that ... yes :)"
    },
    {
      "rating": "4/5",
      "review": "not as good as Star Wars and Empire Strikes Back"
    },
    {
      "rating": "5/5",
      "review": "In May of 1983, I was seven years old. ROTJ rocked!"
    },
    {
      "rating": "5/5",
      "review": "Thanks to its incredible plot, Return Of The Jedi is a great story that concludes the classic trilogy"
    },
    {
      "rating": "4.5/5",
      "review": "My personal favorite of the OT, great characters, great ending."
    },
    {
      "rating": "4/5",
      "review": "This was an okay movie. 🤛"
    },
    {
      "rating": "4.5/5",
      "review": "The story is just great, a satisfying end to the best trilogy of Star Wars."
    },
    {
      "rating": "5/5",
      "review": "A brilliant ending to the original trilogy. This is one of my favourite films ever but still only ranked 3rd in the whole of Star Wars for me which just proves how great the Star Wars films are (until the Force Awakens was released). This final scene with Darth Vader's force ghost reuniting with Yoda and Obi-wan Kenobi as Anakin Skywalker is fantastic and it just couldn't be more heart warming. Everything about this film from the opening scene on the death star to the Final duel between Vader, Luke and the evil Darth Sidious is perfect. A film you cannot miss."
    },
    {
      "rating": "4.5/5",
      "review": "The weakest of this incredible trilogy but still a blast. It felt like there was a lot of filler leading up to the Luke/Vader confrontation. It was also great to see Anakin's story be closed out, truly one of the best character arcs ever."
    },
    {
      "rating": "4.5/5",
      "review": "The best in the original trilogy."
    },
    {
      "rating": "0.5/5",
      "review": "All I have to say is this is the most boring movie ever made in the history of movie making"
    },
    {
      "rating": "5/5",
      "review": "absolute great finale of these classic movies"
    },
    {
      "rating": "5/5",
      "review": "A true ending to the Original Trilogy. George Lucas gives the audience something to watch their eyes on and know that once again peace and freedom have been finally achieved."
    },
    {
      "rating": "5/5",
      "review": "best movie ever you should watch twice"
    },
    {
      "rating": "3.5/5",
      "review": "Coolest Luke. What heroes are supposed to be"
    },
    {
      "rating": "4/5",
      "review": "A good film, despite being inferior to its predecessors"
    },
    {
      "rating": "3.5/5",
      "review": "Always a classic. I have so much nostalgia from this film."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is undeniably fun"
    },
    {
      "rating": "4.5/5",
      "review": "Star Wars 6 is the worst of the original trilogy but still a fun film. Luke has the best ark in this film and you get to see Luke and Vader"
    },
    {
      "rating": "3.5/5",
      "review": "Good film, but not unforgettable."
    },
    {
      "rating": "4.5/5",
      "review": "An epic finale to one of the best trilogies ever made. Only complaint I have is that there's a bit too much ewoks."
    },
    {
      "rating": "5/5",
      "review": "We know that ending with a flourish is never easy. Good. George Lucas does not know and closes with a flourish all the same, this chapter is one of the most action-packed, phatos and a lot of charisma of the whole saga, the fight and the redemption of Anakin in the end give that feeling of emotion that is not expected and an ending that I challenge anyone who does not touch a masterpiece of special effects, acting, phatos and charisma."
    },
    {
      "rating": "5/5",
      "review": "A great conclusion to a fantastic trilogy. Mark Hamil's gives his best performance of the franchise, and every character gets a satisfying character arc. The music and action are spot-on and the ending is a perfect scene. There is some weak acting and unnecessary moments, but the same can be said for A New Hope. 10/10."
    },
    {
      "rating": "5/5",
      "review": "My favorite of the six main star wars movies. Luke has come into his own here, Leia strangles Jabba the Hutt. My favorite thing though is Han's face when Leia's all \"he's my brother\" and she kisses him, and Han can't reacte to that because he's still processing. It's priceless. I love the Ewoks, the Ewoks are awesome."
    },
    {
      "rating": "3.5/5",
      "review": "I won't say the ewoks ruined the movie, if they had gone with the original plan and set it on Kashyyyk I doubt it would make much of a difference, but it really feels like the time spent was Endor was an after though. It would have also been nice if Han's rescue was tied into the rest of the film. Overall it's a lot of fun even if it doesn't reach the heights of the previous two installments."
    },
    {
      "rating": "5/5",
      "review": "Very good movie, amazing ending to the trilogy. Well written story as well as characters, good action"
    },
    {
      "rating": "4/5",
      "review": "a nice ending to the original trilogy"
    },
    {
      "rating": "3.5/5",
      "review": "I enjoyed it, but have two gripes. First, they blew up the Death Star in Episode One. So unimaginative to simply have them have to blow it all over again. Second, the Ewoks -- ugh."
    },
    {
      "rating": "4/5",
      "review": "Just barely shaving off any greatness from its predecessors, Return is probably the most fun Star Wars movie out there. It's got so many visually memorable moments. That being said, it gets bogged down by a couple goofy moments and loses some steam in the middle because of it. Despite this, it more than makes up for it by the end, with some great, emotionally heavy moments later on. I loved this movie so much as a kid and I still do; it's obvious Lucas was going for my age group with this movie, but it made me a fan nonetheless. Thankfully, there's so much fan service and emotionally satisfying moments by the end, you won't care that it's probably for kids."
    },
    {
      "rating": "3.5/5",
      "review": "I enjoy Return of the Jedi probably most out of the original trilogy, but it is also the most flawed movie out of the three."
    },
    {
      "rating": "5/5",
      "review": "This was my first Star Wars film that I watched in cinemas as a child. I had seen ANH and Empire on TV (42cm CRT) and was already a huge fan, but after seeing it on the big screen I was hooked! This was a great way to finish the OG story and say goodbye to the characters. There was room for sequels, but they should have been done in the 2000's after the prequels were finished, not so late that Luke looked like a great grandfather. That way they could have used the EU as direct source material. That being said, I enjoyed the sequels for what they were, and am loving what Disney is doing with expanding the galaxy on Disney+. More Star Wars is never a bad thing."
    },
    {
      "rating": "5/5",
      "review": "My favorite out of the original three movies. Just a really awesome movie."
    },
    {
      "rating": "5/5",
      "review": "Best of the star wars movies!"
    },
    {
      "rating": "5/5",
      "review": "Return of the Jedi doesn't seem to be regarded as highly as the first two originals, but it has the phenomenal action and impactful character arcs we love from star wars, as well as one of the best endings to a trilogy—let alone a movie—ever. This one stands as my favourite of the original trilogy."
    },
    {
      "rating": "5/5",
      "review": "Weirdly enough after watching the original trilogy as a whole I am unsure which I prefer this film or A New Hope but I do have a knack for enjoying the less celebrated Star Wars entries more than the acclaimed films. That being said I despise the sequels but this film was just so much fun. From the opening sequence to the final battle this film was pure satisfaction. That being said I do have my criticisms. I am going to focus on a few topics, the overall vision issues, originality, and what I am going to call the Porg problem. Lets start with the originality, this film features both a new death star complete with another space battle with a satisfying destructive pay off, an opening fight that resolves and sets up parts of the previous film and current film, Luke going to Dagobah and splitting off from Leia and Han, and final fight with Vader, While the destruction of the death star is done better in the first film I will give the film credit the confrontation of Jabba was more entertaining for me then the battle of Hoth and it was a cool way to update the audience on the ways in which the characters have changed. Additionally it was a cool reinvention of Tatooine and an extremely captivating and sleazy environment. The Dagobah scenes are important in shooting the arrow towards Luke's final arc and the showdown with the Emperor and Vader but the reveal of Leia as Luke's sister was however well handled in this film something that should have been chosen from the start because it makes some scenes in previous movies fairly uncomfortable. The final fight with Vader was also reinvented in the most compelling way possible and seeing Luke prove the Emperor wrong was immensely satisfying especially since we have seen him succeed over and over again from the prequels until this point. Now that we have tackled the first two issues I am going to move on to the Porg Problem. I did not hate the Ewok's. They were a strange addition but they were cute. They did feel a little too cartoony at times as well and also it was kind of messed up to see the Ewok's get taken advantage of by the rebels in order to win the battle. They are seduced by C3PO and his stories and essentially become a fan club of soldiers for the rebellion and its really sad especially in one scene to watch an Ewok clutching the body of one of his own. I also found it kind of distasteful to have the them believe C3PO was a god because he is essentially in a position of power over them. Its clear that the film wanted a fuzzy lovable toy selling tribe of Teddy Bears and while I took a great amount of joy watching the Empire get emasculated by a bunch of Care Bears with spears I think it would have been much cooler if instead of Endor the Empire built their base on Kashyyyk. That way we could explore a little bit of Chewbacca's species and history and have his people tear the arms off of some Stormtroopers. It would feel more like they were fighting with a goal in mind and actually have the respect of the rebels rather than be looked down upon plus it would have been pretty awesome. Still the final battles were incredibly satisfying from the Ewok's fighting the Stormtroopers and the destruction of the base, to Lando's assault and destruction of the second death star. But finally this film makes the prequels feel like their actually part of the story and the lore. Luke's showdown with the Emperor is pretty awesome and builds its tension well as we see Luke give in to the dark side but then after cutting off Vader's hand realizes he is becoming like him and turning to the dark side so he unlike his father defeats his temptations and puts his negative emotions aside. Because of this the Emperor tortures and tries to kill Luke but as we know Vader cares about his son even if he won't admit it just as he cared for Padme and in his emotional turmoil destroys the Emperor at the cost of his life. In his last moments he redeems himself thanks to the love he had for his son. The culmination of all three of these moments results in a giant party with fireworks and the conclusions to everyone's arcs as Lando regains cloud city from the Empire. Luke completes his training and becomes a Jedi Knight. Anakin is redeemed by his son and becomes one with the force. Leia and Han resolve all their tension and begin their romance officially and the entire galaxy celebrates their freedom. The film also makes changes to itself to fit into the future films with Anakin's actor in the prequels playing his force ghost and a few added scenes of Coruscant and Naboo. I commend these changes although I can understand why those who hate the prequels and grew up with the original trilogy may despise them. Overall the ending is extremely satisfying and gave me goosebumps. Honestly I received all the closure I needed and this is a perfect end to this trilogy and a perfect end to the saga. Honestly I am not opposed to new Star Wars films but after seeing the original trilogy for the first time in a decade or so I refuse to acknowledge that any of the sequel trilogy exists in this timeline. I loved this movie and despite a few flaws it wrapped up the trilogy with a note of triumph that left me with great happiness."
    },
    {
      "rating": "5/5",
      "review": "The last 45 minutes are incredible. While the middle part is a little boring, it's worth it to get to the end."
    },
    {
      "rating": "4/5",
      "review": "It's not consistently as powerful and visually stunning as it's predecessors, but there is plenty to like here. A very satisfying ending that neatly tied everything together, even if the emotional depth is lacking at times."
    },
    {
      "rating": "4.5/5",
      "review": "More amazing than I remember last time I watched it, finishes of the Skywalker Saga perfectly."
    },
    {
      "rating": "5/5",
      "review": "A good finale to the saga, sequel trilogy was unnecessary."
    },
    {
      "rating": "4.5/5",
      "review": "The worst of the OG trilogy but still an amazing film that has one of the best character arch redemptions in the history of film. ( only to be ruined by Disney)"
    },
    {
      "rating": "4/5",
      "review": "Dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun..."
    },
    {
      "rating": "4.5/5",
      "review": "Luke: Tells Leia he's her brother Leia: I've known, I've always known. Me thinking back to The Empire Strikes Back when she kissed him: Really? You've ALWAYS known?! That was the only reason I didn't give this movie full five stars."
    },
    {
      "rating": "4.5/5",
      "review": "Not as good the first two movies, but a great finally that wraps up the skywalker saga!"
    },
    {
      "rating": "3.5/5",
      "review": "Feel like Star Wars finally hit its stride with this movie. This is the best version of Luke out of all the Star Wars movies."
    },
    {
      "rating": "4/5",
      "review": "Fast-paced, great first and final acts, great special effects (for the most part), iconic outfits (the gold bikini), despicable villains, large space battles, and cute characters (the Ewoks), Return is a great movie in the series. The movie was my favorite in the series as a kid and still holds up really well now but is still a little corny in parts - something that would become sadly more commonplace with future installments. I absolutely love this movie though and can't say it's not great because the action sequences and everything else already mentioned are just so good. You may cheer at the end especially if you watched all the movies that are chronologically before it."
    },
    {
      "rating": "5/5",
      "review": "Beautiful. Perfect in every way."
    },
    {
      "rating": "4/5",
      "review": "A great conclusion to one of the best trilogies ever made, \"Return of the Jedi\" is yet another timeless classic that wraps up the original \"Star Wars\" trilogy with fabulous fashion. The final fight is very emotional and intense, and the action is done much better in this film. The worldbuilding continues to be superb, and the CGI continues to be great for its time, though it does fail to hold up to today's standards. However, where I think this film is worse than its predecessors is in its story and plot with the second Death Star, which feels unoriginal and familiar. There are also many more plot holes throughout the film when compared to the previous installments and the film have a few more clichés in it. However, I still mostly loved it and it does a perfect job at wrapping this iconic trilogy up."
    },
    {
      "rating": "1/5",
      "review": "better than first movie, good for some young children. Full of religious philosophy and characters taken directly from the main religions, not a problem, just an observation"
    },
    {
      "rating": "4.5/5",
      "review": "great film Great moments. The throne scene with vader luke and palpatine is peak star wars. But it was flipping between that, and the ewoks and stormtroopers. I was so emerged with Luke Vader and Palp, that I did not care about the silly jokes and fighting going on at all. Ruined the mood a bit. Loved the beginning."
    },
    {
      "rating": "4/5",
      "review": "Molto molto molto bello"
    },
    {
      "rating": "5/5",
      "review": "Not as great as its two predecessors, but still a damn good movie. Not the CGI edition. The CGI editions suck."
    },
    {
      "rating": "4.5/5",
      "review": "While this movie isn't as perfect as the first two, it is genuinely excellent, contrary to what many would say (for reasons I'm not entirely sure). The characters are every bit as well-written and likeable as in the preceding films, the story is still engaging (if just a bit thin, as it's ultimately an extended Third Act of the over-arching story), the villains are still immensely intimidating, the music is still wonderful and the action sequences are still awesome. Heck, from an action standpoint, this might be the best of the three, as the Climax is very long, featuring both a Ground Battle and a Space Battle, alongside a third based on Story Resolution, and despite the >30 minute duration, this climax NEVER loses momentum. While this movie doesn't have the depth of the first two, it does escalate everything that worked before, and because of this, the emotional catharsis from the climax of this movie is sublime -- I honestly can't think of any other Action series that ends with such a perfect emotional satisfaction. It's well-written, well-directed and has both adrenaline and sincerity, and apart from an overlong first act, I cannot think of a better way this borderline-perfect Trilogy could have ended."
    },
    {
      "rating": "4.5/5",
      "review": "Great and fun movie. Not as bold as Empire, but a good conclusion to the trilogy"
    },
    {
      "rating": "3.5/5",
      "review": "I've reached the final instalment of the Original Trilogy. And in my opinion, Return Of The Jedi still holds up to my childhood standards. As a kid, I loved this one the most. Seeing Luke being a master, the whole crew back together and defeating the empire is just satisfying that they finally won. Seeing the emperor and showing how powerful he actually is still gives me the chills. Once again, the set pieces, special effects and costume design are top notch. This is a good, and quite satisfying ending to the Original Star Wars Trilogy."
    },
    {
      "rating": "3.5/5",
      "review": "In few words: a well done end for the Luke's Saga. 7/10"
    },
    {
      "rating": "5/5",
      "review": "Yeah this is in my opinion the best of the trilogy. It's able to carry on and complete the journey's for the characters established in in the pervious film while still having the big spectacle the A New Hope had. Making this a complete movie with the big galaxy stakes and the character moments. The conclusion to Vaders journey with what we know from the prequels makes this so satisfying to see and it was great seeing Luke cement his destiny as a Jedi. Yeah this is just a fantastic end to the trilogy."
    },
    {
      "rating": "3.5/5",
      "review": "A death has caused this rating, will forever be missed. Also doesn't compare to some of the older ones in my opinion. But I still loved it as I love all the star wars shows, and movies that I have seen."
    },
    {
      "rating": "5/5",
      "review": "Great movie even the ewoks couldn't ruin this great movie"
    },
    {
      "rating": "3.5/5",
      "review": "This movie can make for a fun watch but is easily the weakest from the original trilogy. It has moments where it's fun, even some of the best moments in all of star wars but as a whole, this film is just a weaker empire strikes back."
    },
    {
      "rating": "5/5",
      "review": "This film is a phenomenal ending to the trilogy and a ending to a classic heroes journey."
    },
    {
      "rating": "4/5",
      "review": "Good and memorable scenes"
    },
    {
      "rating": "4/5",
      "review": "Its a good movie, can get boring but overall great, except the Ewoks (Hate Them)"
    },
    {
      "rating": "4.5/5",
      "review": "This movie was better than some people realize. It had the most consistent action, along with some compelling dialogue and revelations about Luke and his family along with a wholesome ending to the OG trilogy."
    },
    {
      "rating": "5/5",
      "review": "Great film. I didn't care for the Ewoks but other than that it was a awesome."
    },
    {
      "rating": "5/5",
      "review": "The best Star Wars movie for me with a satisfying ending to one of the greatest trilogies ever made and Vader sacrificing himself to save his son and another reveal as we find out Leia and Luke are brother an sister which is a bit gross when you remember when they French kissed each other."
    },
    {
      "rating": "5/5",
      "review": "The best out of the entire saga imo. I love how Marquand was able to get 3 different arcs running concurrently in the final act that culminates in the climatic Battle of Endor to bring a satisfying conclusion to the saga."
    },
    {
      "rating": "4.5/5",
      "review": "It completed the hero's journey and the restoration of Anakin Skywalker was unexpected."
    },
    {
      "rating": "5/5",
      "review": "A classic among classics, the true end of the star wars saga!"
    },
    {
      "rating": "4.5/5",
      "review": "fun and sharming... I love it works like a perfect positive ending for an amazing fantasy saga."
    },
    {
      "rating": "4/5",
      "review": "Nostalgia prevents me from giving this a lesser score. But its not a truly great movie. Ewoks helping take down the Empire sucks. Repeat Death Star is not good either."
    },
    {
      "rating": "5/5",
      "review": "An AMAZING EMOTIONAL AND FITTING END TO THIS AWESOME SAGA!!!"
    },
    {
      "rating": "5/5",
      "review": "A great finish to a fantastic trilogy."
    },
    {
      "rating": "5/5",
      "review": "A true rocket ride of a saga! This movie helped the saga hit new heights. If only Thrawn had been around..."
    },
    {
      "rating": "4/5",
      "review": "Now before you rush ahead and quickly mark my review unhelpful, hear me out alright? Return of the Jedi is the only movie of the trilogy I had no hopes from. I had heard of people saying that it's the worst in the series. But considering I got bored from A New Hope and The Empire Strikes Back I thought this one is going to be even worse (why I got bored of them, that's written on their reviews. But still if you're too lazy to check it's because I always somehow get bored watching old movies). So I had absolutely no expectations from it. Turns out it has the most story of all the Star Wars movies. The movie began with answering the question as to what happened to Han Solo. He gets rescued by Luke and Leia. We even get to see the iconic Boba Fett in that scene. Later on we get to see Lando. Even though I haven't heard about him and I actually had to look up his name while writing this review, he looks pretty iconic. I don't know if this was a popular look or this movie made the look popular, but I guess the latter is true. There were many other NPC characters throughout the movie, but for me the selling point were the Ewoks. And I don't care what all the \"die-hard Star Wars fanboys\" say. The Ewoks are so adorable! I wanted to pull their cheeks. Their scenes were so cute and funny. The way they fought the Stormtroopers or treated C3PO like a messiah was really wholesome. I really wanted to see that kind of stuff in Star Wars movies. Just because it's set in space doesn't mean it always has to blast out laser guns or have huge flying ships. After all, it's set long long ago in a galaxy far far away. There could be many tribes living over there as well. And seeing them hold up makes me believe they still exist somewhere in today's time, having evolved into becoming teddy bears as advanced as humans. And finally Darth Vader's final fight scene in this movie, in my opinion, was way better than The Empire Strikes Back. We actually get to see what Darth Vader looks like, and he hasn't cut Luke's arm for this. This is the correct way of drawing out emotions. The one who is making the audience emotional should be in pain, and not the one being made emotional. Darth Sidious was really intimidating, and I really wanted more of him rather than the trash that Palpatine was. Star Wars: Episode VI is even today my favourite Star Wars movie. It doesn't matter what others say about it, it's gonna be the most OP in my opinon. In just 2.5 hours it managed to tell more story than the entire sequel trilogy combined. And the best part - the spoilers from this movie aren't even as popular as Episode IV or V, so I could watch it without already knowing what I'm about to watch. I'd absolutely watch it again."
    },
    {
      "rating": "4.5/5",
      "review": "A great finale for the original trilogy of Star Wars that had yet another intriguing story and had a brilliant story and atmosphere to it."
    },
    {
      "rating": "5/5",
      "review": "Plenty of emotion, plot twists, and action make this my personal favorite out of the Original Trilogy."
    },
    {
      "rating": "5/5",
      "review": "Uma conclusão épica para um filme fantástico. Apesar dos Ewoks, tudo de Luke e Vader é perfeito."
    },
    {
      "rating": "5/5",
      "review": "Makai loves it. And the rest of the Star Wars series."
    },
    {
      "rating": "4.5/5",
      "review": "The beginning of Return of the Jedi is certainly not among the best moments from the Star Wars saga. The lack of screen time for Boba Fett is lackluster but Luke was able to show how much he had grown in becoming a Jedi. The movie was made much better due to Anakin's return and the death of Darth Vader. The entire sage revolves around Anakin and his story so it should end with his redemption and destruction of the sith."
    },
    {
      "rating": "4.5/5",
      "review": "To finish of the original trilogy, the film concluded luke's journey going from farm boy to jedi. We finally get to see the emperor and get to see the lengths of his power compared to vader, furthermore, we also see vader's transition back to the light and redeem himself. The inclusion of ewoks was a fun addition to the story as well as the many great performances by the actors made the film so great and such a great end to the trilogy."
    },
    {
      "rating": "4.5/5",
      "review": "A perfect ending to the original trilogy (and the whole saga in my opinion) of Star Wars. Literally everything about this movie is iconic and I adore every single frame of it, however, I can still pinpoint it's minor flaws. It all comes full circle, and I'll never get tired of watching that final scene. Simply put, this is the best conclusion to any movie franchise ever, and that's a fact."
    },
    {
      "rating": "3.5/5",
      "review": "It's a little overrated in my opinion. The film's first sequence doesn't further the plot in any way, the acting is wooden, and a big chunk of the film is spent in build a bear workshop. But what this film gets right, it really gets right. The ending might be the most satisfying ending to any movie ever made. The protagonist Luke, has a beautifully illustrated internal struggle that we the audience can see. Honestly, this is just a perfect finally, even thought it isn't a perfect movie."
    },
    {
      "rating": "3.5/5",
      "review": "7.25/10. 'Return of the Jedi' is the weakest of the original Star Wars films. Where the first two pushed boundaries and innovated, 'Return of the Jedi' was content to do little more than end the story in uninspired - albeit entertaining - fashion. There isn't anything inherently wrong with making a simple, breezy, popcorn-ready flick, but being anything less than ground-breaking like it's predecessors were is a recipe for disappointment. The plot doesn't seem to have any forward thrust; after a thrilling first act, the story settles into well-troden territory by following the blueprint of 'A New Hope' - a gang of rebels must defeat the empire and it's giant destructo-ship. It's unfortunate that the creativity and character development from 'The Empire Strikes Back' couldn't carry over. The movie was still quite entertaining, as any fan of the effects-driven action sequences, so viscerally brought to life by a top-notch technical crew, can attest. Another familial twist and the final redemption arc that sees peace restored to the galaxy are interesting nuggets, and Ian McDiarmid as the Emperor is a scene stealer. 'RotJ' wraps up this trilogy with technical wizardry and fun, but opted for safe, crowd pleasing mundanity instead of creative daring. It could and should have been much more, but ultimately stands as a testament to the complacency that often follows success, and foreshadows the overarching creative issues found in Lucas' prequel trilogy."
    },
    {
      "rating": "4/5",
      "review": "A very well done conclusion to the original trilogy. However, poor narrative choices and some sloppy direction leave this film a few steps behind the far superior first two films of this legendary trilogy. 8/10"
    },
    {
      "rating": "4.5/5",
      "review": "The first decision in this movie made by Luke to risk sacrificing his loyal druids was very weird and questionable to me. Also, the plan to rescue Han felt really weird, it was very uncoordinated. The death of Boba Fett was unspectacular and disappointing, a really good built-up character died within seconds. Overall I liked the battle at Jabbas basement. The first 40 minutes are really well done. Luke making it up to Han, which saved him just like he did in this movie. A really good callback. Yoda´s passing scene together with Luke was very sweet, and a great way to say goodbye to an iconic character. Seeing the group of Han, Leia, Luke, Chewie, R2D2, and C3-PO going for possibly one last adventure was great and a real nostalgic factor, which I totally loved. On a critical note, I have to add the speeder fights, which did not age well at all. The fight in itself wasn't that bad, but the pictures and effects looked very bad, just signs of the time. I dug the whole jungle set, though, which in my opinion were a good different location compared to the other movies. R2D2 once again saving the group by helping them to escape from the trap in the jungle was another proof that R2D2 is the goat. C3PO being the god of the Ewoks was a bit weird at first, but I liked it in the end. Luke´s reveal that Leia is his sister felt very well done and well-written. In another epic moment, Luke first meets Darth Sidious which was a super important moment, and felt like that, too. I was not the biggest fan of the fact that 6 guys and a group of Ewoks are equal in a battle against AT-STs and a couple of hundred stormtroopers. Really epic was the fight between Luke and Darth Vader though. And it felt like it's a tradition to lose an arm in a battle in Star Wars. Vader finally betraying Sidious felt soo good and also was great as a moment. The space battles in the last act are visually spectacular reflecting back to this time. Anakin's goodbye to Luke was emotional by a well-surrounded score, lovely moment. I loved the look on Han´s face when Leia told him that Luke is her brother, brilliant. It was a brilliant way to end this trilogy, I really loved it."
    },
    {
      "rating": "5/5",
      "review": "It is totally perfect, but it is a bit boring in some parts of endor, although it is a good closing for the skywalker saga and it is the definitive one, here everything actually ended in star wars, let's not look for it anymore because this is the true closing of this incredible saga."
    },
    {
      "rating": "4.5/5",
      "review": "While its lows are worse then Empires lows, the highs in this movie like Luke vs Vader and Jabba the hutt are some of the best moments in star wars. What more can I say of this now almost 40 year old movie that hasn't been said already other then its amazing"
    },
    {
      "rating": "2.5/5",
      "review": "Famous for being the weakest of the original trilogy films, but with the best space battle of the three."
    },
    {
      "rating": "5/5",
      "review": "The ending of a perfect trilogy with a lot a badass action sequences, a lot of fantastic characters moments and the best finale possible."
    },
    {
      "rating": "3.5/5",
      "review": "This movie really passed the time it's not a favorite of mine."
    },
    {
      "rating": "5/5",
      "review": "a wonderful conclution to the original trilogy"
    },
    {
      "rating": "5/5",
      "review": "So many people think this is the weakest of the original trilogy, but I still love it. I mean I love anything star wars obviously."
    },
    {
      "rating": "4.5/5",
      "review": "I think this might actually be my favorite Star Wars film. Out of the original trilogy this is the one with the most polish throughout, even the much maligned ewoks don't ruin my enjoyment, and the emotional impact of the throne room segment never fails to get me."
    },
    {
      "rating": "4.5/5",
      "review": "an amazing film and a amazing ending to wrap up the original trilogy and a very sad ending."
    },
    {
      "rating": "3/5",
      "review": "22.03.2021 ---------"
    },
    {
      "rating": "4.5/5",
      "review": "Valid criticism to the plot structure and much of the on the ground Endor scenes, but this movie is still very entertaining, groundbreaking, and as much a classic as the other Star Wars films. Everything that takes place on the 2nd Death Star in the 3rd act is perhaps the greatest storytelling ever to come to film. Luke Skywalker is in his prime here and he had the best character arc out of everyone in this trilogy. Han Solo felt kind of wasted for a good bit but he was kinda pointless not bad. Doesn't downplay Harrison Ford's acting. Darth Vader's redemption story is the thing that ages well the most of this movie. The score for that whole final battle was truthfully masterful, and the space battle of Endor was one of the best we've ever gotten. The Pit of Carcoon and the whole battle at the Sarlacc pit was a very good action sequence and we've all got our thoughts on slave Leia. Not essential to the plot and pretty wild for a kids movie but overall they didn't overdo it. This movie shows how little planning their was for the whole trilogy but it still wrapped up the trilogy very finely and solidified this as one of the best movie trilogies ever made"
    },
    {
      "rating": "5/5",
      "review": "The best of the OT! Need I say more?"
    },
    {
      "rating": "4.5/5",
      "review": "The iconic Star Wars original trilogy ends with an exciting, heartwarming, deep, and uplifting movie. It shows what love can do and perfectly wraps up Star Wars."
    },
    {
      "rating": "5/5",
      "review": "It may not be as great as the 2 movies that came before it, but ROTJ is a spectacular conclusion to the trilogy."
    },
    {
      "rating": "5/5",
      "review": "Otra obra de arte de George Lucas, termina bien una trilogía y lo hace de la mejor manera posible, mi parte favorita es cuando Luke le dice que es un jedi como su padre antes de el."
    },
    {
      "rating": "4.5/5",
      "review": "Return of the Jedi was always my favourite Star Wars movie as a kid. A satisfying conclusion to the original trilogy."
    },
    {
      "rating": "5/5",
      "review": "Yet another GREAT piece of art made by George Lucas!!"
    },
    {
      "rating": "4.5/5",
      "review": "To complete the end of the original trilogy, the emperor has ultimate power and gives the audience a certain sense of domination. The relationship between Darth Vader and Luke is an interesting dynamic and the story is told well"
    },
    {
      "rating": "5/5",
      "review": "One of the best movies ever made to close off an amazing trilogy. Story telling like it should be without the social justice politics and humiliation of male role models that the Disney trilogy offered under the horrible leadership of Kathleen Kennedy. George Lucas we miss you."
    },
    {
      "rating": "5/5",
      "review": "Solid movie and a great finish to the original trilogy."
    },
    {
      "rating": "3.5/5",
      "review": "don't get me wrong I love star wars, but they almost KILLED of my favorite character Boba Fett luckily (spoiler for people who have not watched the Mandalorian) he is alive and well. Another thing I don't like is how Han likes Leia so much. Over all I will be nice and give it 3.5 stars."
    },
    {
      "rating": "5/5",
      "review": "Epic conclusion to an epic trilogy. The saga that revolutionazed movies industry. The trilogy that started Hollywood as a the factory of dreams, adventures and massive entries. The one and only, blockbuster. Star Wars, amazing! Thanks G. Lucas, You may not have changed the world, but definitely You made it a better place. You should not be reading reviews, you should be watching this trilogy right now!!! Go, nobody is going to blame you, as a fact, invite us!!!"
    },
    {
      "rating": "4/5",
      "review": "Yah, it's post-Disney Star Wars, but I'm thankful that they ended this trilogy appropriately, maintaining the trilogy's legacy as a whole."
    },
    {
      "rating": "5/5",
      "review": "This is kind of underrated. For some reason, I like this my second favorite, which is an unpopular opinion. I like Vader's sacrifice. That was satisfying."
    },
    {
      "rating": "4/5",
      "review": "Arguably the weakest (comparably) of the original trilogy, yet 'Return of the Jedi' is still an excellent film! Mark Hamill, Harrison Ford and Carrie Fisher remain a thoroughly enjoyable trio. I did find parts of the plot a little similar to 1977's 'Star Wars', due to the Death Star stuff, but overall I unquestionably enjoyed the 135 minutes. The score is great again, while the new bunch of characters are cool. There are some memorable moments in there, as we see the first spate of films come to a close very nicely. I'm very intrigued to see where things go with the prequels, hopefully they continue to hit high marks."
    },
    {
      "rating": "5/5",
      "review": "Star Wars: Episode VI - Return of the Jedi is my second favourite Star Wars movie to date. It is an amazing movie with great characters, a great score, great actors and a great story with a deep, captivating emotional core between Luke and Vader. The best parts about this movie is the third act, the conclusions given to the characters and the whole final confrontation between Luke Skywalker, Darth Vader and The Emperor (played by Ian McDiarmid). Return of the Jedi is one of the best Star Wars movies and if you ask me and it is the perfect ending to the Skywalker Saga as a whole."
    },
    {
      "rating": "5/5",
      "review": "A wonderful end to the trilogy! Quite fun and dazzling"
    },
    {
      "rating": "4/5",
      "review": "An awesome movie that has its flaws like the Ewoks, but if you ignore that this is a great movie."
    },
    {
      "rating": "4/5",
      "review": "Review: While it suffers from plodding first and second acts, Return of the Jedi features possibly the best Star Wars third act of all time. The ewok battle goes on too long, but the Death Star space battle is amazing and visually marvellous, and everything in the Emperors Throne Room is incredible, best of the franchise stuff. The music is still great, and the sets and effects are great, but the story does become episodic, with some weak pacing in the Ewok Village and Jabba's Palace. However, its always entertaining and rewatchable, and for all its flaws, Return of the Jedi is still a great adventure and a throughly satisfying end to the Original trilogy, with many best of the franchise moments. | Grade: B+"
    },
    {
      "rating": "5/5",
      "review": "\"It's me the the emperor of the empire\"- The emperor When Jar Jar died I cried. Jabba is my role model"
    },
    {
      "rating": "5/5",
      "review": "Tam bir kült. Harika bir serinin üçüncü filmi. İlk üçleme sonrası gelen filmler o kadar iyi olamasa da bu sonraki filmlerin çok kötü olmasından değil, ilk üç filmin çitayı göklere çıkarmasındandır. Özellikle de çekildiği yıl için inanılmaz bir hayal gücü ve bu hayal gücünün o günler için inanılmaz görsel efektlerle birleştirilmesinden kaynaklı bir seviyeden bahsediyoruz. Hele ki oyunculuklar da yanına öyle güzel oturmuş ki tadından yenmiyor. En iyi üçleme ve en iyi filmler. Umarım bir gün bu kaliteye yakın Star Wars filmleri izleriz. Mutlaka izlenmeli bu üçleme."
    },
    {
      "rating": "5/5",
      "review": "Wow! Amazing. Love the scene with Luke, Vader and Palpatine, Love Obi-Wan 'Ben' Kenobi's, Yoda's and Anakin's Force Ghost at the End. Definitely the second best after The Empire Strikes Back! 5 STARS! 🌟"
    },
    {
      "rating": "4.5/5",
      "review": "Gives an amazing conclusion to the original trilogy, gives one of my personal favorite villains of all time, Darth Sidious. My grade: A"
    },
    {
      "rating": "4/5",
      "review": "Great end to the original trilogy. Definitely a solid movie."
    },
    {
      "rating": "4/5",
      "review": "Lesser than the previous films, but still good."
    },
    {
      "rating": "5/5",
      "review": "This one is my favorite film from the original Star Wars trilogy (from 1977 to 1983). For me, it was the perfect ending for this trilogy. I loved the final attack from the Rebels, the fight between Darth Vader and Luke, and the ending, as I said before, is just so good. That final scene with Yoda, Obi-Wan and Anakin in ghost forms was the cherry on top of the cake. Absolutely amazing! I don't even mention the music or the effects anymore, because we all know that they are amazing."
    },
    {
      "rating": "5/5",
      "review": "It has a nice finish but not sure if it is as amazing as the rest of the Star Wars films. Maybe just drawn out more than rest but still with good segments throughout."
    },
    {
      "rating": "5/5",
      "review": "An awesome finale to Star Wars! Amazing. 10/10"
    },
    {
      "rating": "5/5",
      "review": "My favorite of the Star Wars Franchise. Love it so much. The best opening in movies"
    },
    {
      "rating": "5/5",
      "review": "The showdown between Vader and Luke with the emperor is pure movie magic."
    },
    {
      "rating": "4.5/5",
      "review": "The return of jedi is a great film with some aspects bringing it down , like the ewoks and some of the silliness.All the parts with Luke skywalker and his development of his character is perfect. I think the critics need too rate it higher it's so clear the audience like it more than the critics, it shouldn't be a 82 maybe more like a 87 or possibly 90"
    },
    {
      "rating": "4/5",
      "review": "This was always the one I watched the least growing up, likely because my attention span gave out somewhere during the first two, but serves as a perfectly satisfying conclusion to what are arguably the greatest, and definitely most popular, first two legs of a trilogy in the history of film. 8.5/10"
    },
    {
      "rating": "3.5/5",
      "review": "it's not as grand as its predecessor, but it manages to finish the trilogy very well"
    },
    {
      "rating": "5/5",
      "review": "Great movie would recommend"
    },
    {
      "rating": "5/5",
      "review": "It is an extremely great end to the original trilogy!"
    },
    {
      "rating": "5/5",
      "review": "Masterpiece ending of the trilogy"
    },
    {
      "rating": "4/5",
      "review": "Finding out Luke and Leia are related was creepy and unnecessary. Otherwise ‘Return of the Jedi' is a great movie to end the series – l really wish it had stopped here-, continued world building, which is inferior to only very few franchises, and further exploration of the ‘Force' was entertaining. Overall ‘Return of the Jedi' is very much an entertaining movie."
    }
  ]
}