{
  "movie_name": "Clown in a Cornfield",
  "reviews": [
    {
      "rating": "2.5/5",
      "review": "Right in the middle on this one. Very straightforward small town slasher movie with Clowns. Don't regret seeing it but can't say I'd go back for a rewatch"
    },
    {
      "rating": "1/5",
      "review": "My son dragged me to this. I figured out the plot almost immediately, give or take a few things, and I've seen better acting at High school plays. The guys making out at the end was just to be \"so original \". Wasn't scary at all, I wouldn't even watch it for free."
    },
    {
      "rating": "2.5/5",
      "review": "Above average for a slasher. The petite hero could actually pass for a high schooler, unlike the others. Fair warning: hints are dropped that could set up a sequel."
    },
    {
      "rating": "3/5",
      "review": "Typical teenage flick but, very entertaining. Keeps you guessing on who the real killer is. Good movie for those who love slasher films that make you track clues from beginning to end."
    },
    {
      "rating": "3/5",
      "review": "Typical teenage horror slasher plot Was Lacking"
    },
    {
      "rating": "3/5",
      "review": "Its honestly a very interesting ride and there is a twist in the move where honestly it does work but very predictable and some people wont like it as much as others for me the movie is alright at most i was expecting more, the acting at times is shaky"
    },
    {
      "rating": "3/5",
      "review": "The movie was pretty cool. I thought it was going to be more of a scary movie like the trailer depicted. But it was more of a killer clown movie. The actors were great but I think the story line could of been a bit better."
    },
    {
      "rating": "3/5",
      "review": "A very fun modern day slasher film"
    },
    {
      "rating": "3/5",
      "review": "It’s not a bad movie just wasn’t scary in anyway. Actually laughed a couple times but it was interesting and had good actors."
    },
    {
      "rating": "0.5/5",
      "review": "Movie was boring and cheesy plus the theater sucked"
    },
    {
      "rating": "4/5",
      "review": "4.5* Very Entertaining! See it on the big screen!"
    },
    {
      "rating": "0.5/5",
      "review": "I thought the plot was stupid"
    },
    {
      "rating": "4.5/5",
      "review": "Loved it wish it jus a bit scarier"
    },
    {
      "rating": "5/5",
      "review": "20/10 would watch again🔥🔥"
    },
    {
      "rating": "3/5",
      "review": "It should be a Halloween Movie. I didn't understand the plot of the movie."
    },
    {
      "rating": "3.5/5",
      "review": "Honestly this movie wasn’t bad at all. It’s exactly what you expect from a cheesy horror slasher with some comedy built in. Good jump scares. Some nice creepy scenes and a typical slasher storyline. Worth a watch. Not really scary but definitely has its moments!"
    },
    {
      "rating": "5/5",
      "review": "So much fun! I can’t wait till the sequel! Oh yes, a three book set. How can there not be some more clowns in a cornfield?"
    },
    {
      "rating": "3.5/5",
      "review": "Slow in the beginning but picked up towards the end and was a pretty enjoyable watch overall"
    },
    {
      "rating": "3/5",
      "review": "Fun but nothing special 6/10"
    },
    {
      "rating": "0.5/5",
      "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
    },
    {
      "rating": "5/5",
      "review": "Loved it. Great 80s throwback but with a modern vibe."
    },
    {
      "rating": "3/5",
      "review": "Some gore and laughs"
    },
    {
      "rating": "3.5/5",
      "review": "Good lead character and good enough to recommend"
    },
    {
      "rating": "1/5",
      "review": "Slasher movies are fine. This was not one of them. Terrible plot and shallow backstory. Not theater worthy."
    },
    {
      "rating": "4/5",
      "review": "I went in with low expectations, but it genuinely surprised me. It felt like a high-quality B movie—definitely worth watching. I’d even consider watching it again."
    },
    {
      "rating": "5/5",
      "review": "A Clown in a Cornfield is the emblem of the security, hope and innocence of childhood, which a man can spend his life seeking to regain. It is the green light at the end of Gatsby’s pier; the leopard atop Kilimanjaro, seeking nobody knows what; the bone tossed into the air in “2001.” It is that yearning after transience that adults learn to suppress."
    },
    {
      "rating": "2/5",
      "review": "My Review - Clown In A Cornfield (Average). I went to a 10:40 showing. This was supposed to be a new midnight cult movie which satirize slasher-movies. I was so excited, I went to a late showing. Unfortunately, it missed its mark. It’s a standard slasher film. You saw it before and done better. The big gimmick in the movie was Frendo the clown, but unlike Art in Terrifier, they never developed the character for you to care. This is another ‘If you saw the trailer, you saw the best parts’ movie. There were a few laughs, but not enough to stay up late for. Wait for Netflix for this one."
    },
    {
      "rating": "3/5",
      "review": "Decent movie. It was a bit different from the other scary movies but the plot isn't too strong. The best of the film is that you don't know who is behind everything. I like the acting, music and tone of the movie."
    },
    {
      "rating": "1/5",
      "review": "The characters and plot were totally cliché—maybe intentionally so—but it wasn’t executed in a way that made it funny or clever. That’s what’s so disappointing, especially since I really enjoyed Tucker and Dale vs. Evil. That movie was smart, original, and hilarious. This, on the other hand, felt lazy and flat. There was nothing new here: the kills were uninspired, the gore was minimal, and the overall execution felt recycled from a dozen other forgettable horror flicks. Then they threw in some last-minute “woke” messaging—lecturing adults about destroying the environment and disrespecting the next generation and their ideas, plus a forced bit about being gay—which I’m guessing is what helped boost the critic scores. These themes felt shoehorned in, not earned, and definitely didn’t make the movie any better. In the end, it wasn’t scary, it wasn’t clever or original , and it certainly wasn’t worth the time. I wish I’d seen something else."
    },
    {
      "rating": "0.5/5",
      "review": "More killer clowns. Men. Its been done. Pass."
    },
    {
      "rating": "0.5/5",
      "review": "this is the first movie i have EVER walked out of. acting was terrible and the plot was not great. i even got d-box seats expecting it to be decent. sad that i wasted money on these tickets."
    },
    {
      "rating": "3.5/5",
      "review": "Who doesn’t love killer clowns"
    },
    {
      "rating": "4/5",
      "review": "Great entry level horror movie definitely love Frendo some of the jokes fall flat but definitely worth the watch"
    },
    {
      "rating": "4/5",
      "review": "Decent movie but felt it could have been a little bit better"
    },
    {
      "rating": "3.5/5",
      "review": "this movie didn’t reinvent the wheel, but I thought the kills were solid. The story I could really follow so if they decide to make a sequel I wouldn’t mind it"
    },
    {
      "rating": "3.5/5",
      "review": "So thrilling and lots of suspense. If you’re into clowns, then it’s worth a watch."
    },
    {
      "rating": "3/5",
      "review": "Was a bit of an eye roll the reason the movie gave for the killings, but overall was just decent enough. Maybe not cinema worthy but itll fit right in with the many films made straight for streaming. A one time watch Id say"
    },
    {
      "rating": "1/5",
      "review": "So I went to watch this movie thinking it would be something like Heart Eyes or Thanksgiving… so I didn’t have high expectations but I thought at least It’d be a good time. It was worse 😭 A few funny moments, but overall just a waste. It had great potential but was boring for the most part and no cool twists and turns. Booo"
    },
    {
      "rating": "2.5/5",
      "review": "Nothing too special to see in the theater but worth a stream in a few weeks"
    },
    {
      "rating": "0.5/5",
      "review": "Not interesting enough to be scary. Not cheesy enough to be funny. Made Heart Eyes look like a Lexus."
    },
    {
      "rating": "2/5",
      "review": "Was okay… Nothing to write home about acting was very lacking… Story was decent though. Not theater worthy in my opinion. Wait for it to go to streaming save your money."
    },
    {
      "rating": "4/5",
      "review": "It was fun movie almost all teens i didn’t like wanted to see clown get them not sure if that was intentional three teens in movie I like rusty, cole and daughter of father who is doctor I never said this in horror movies I was cheering on clown get them I didn’t like any of teens like t was fun remind of children of corn, hot fuzz, get away without twist ending , phone rotary part how anyone does not know how to work it it’s almost self explanatory finger in hole move it they moved it little , and teen girl all she cared about was Wi-Fi when they moved there get life more to life than Wi-Fi as long you can call out talk to people on phone you don’t need Wi-Fi., It was fun to watch fan of horror movies I recommend giving this chance to see"
    },
    {
      "rating": "3/5",
      "review": "Not a bad watch at all. Pretty decent"
    },
    {
      "rating": "3.5/5",
      "review": "'Clown in a Cornfield' is a fun slasher that contains the right amount of gore, humor and modern flair."
    },
    {
      "rating": "3/5",
      "review": "There's not really anything new to see here overall. It was still a decently fun time, and some of the commentary is necessary for the times. Still, the pacing and editing were awkward at times, and the acting/dialogue is hit or miss."
    },
    {
      "rating": "4/5",
      "review": "Somehow Clown in a Cornfield feels like a horror movie beamed in from the 90s — in the best way possible. Its rare to see a modern slasher that pays homage to that era without being overly nostalgic or gimmicky. From the gritty, almost voyeuristic cinematography that echoes The Blair Witch Project to the sharply delivered dark comedy that channels Scream. this movie leans into vintage horror vibes while still feeling fresh. Its funny, brutal, and smarter than it lets on. Beneath the killer clown chaos is a pointed bit of social commentary — about generational divides, moral panic, and how horror itself is evolving. Its got that modern flair without abandoning the fun, making it self-aware but never smug. The humor actually lands, which is rare in horror-comedy, and the pacing keeps things tight and engaging. Sure, a few side characters feel undercooked, and the satire couldve pushed even further, but overall this feels like a film that knows exactly what its doing: delivering thrills while saying something. A slasher with style and a brain, for sure."
    },
    {
      "rating": "5/5",
      "review": "Surprised by how much we liked this. Group of 7 all loved it. Funny and campy and was not expecting that. Definitely will watch again. It was a really fun group outing."
    },
    {
      "rating": "0.5/5",
      "review": "Dont waste your money on this one! This was honestly one of the worst movies Ive seen in a long time. My daughter watched it with her friends after one of them recommended it, and even they all agreed—it was terrible."
    },
    {
      "rating": "2.5/5",
      "review": "Long set-up, a couple of decent scares, stupid plot"
    },
    {
      "rating": "5/5",
      "review": "Great movie will see again"
    },
    {
      "rating": "3.5/5",
      "review": "Reminded my and my son of the Scream series. Not too bad."
    },
    {
      "rating": "4/5",
      "review": "A mixture of horror and comedy. The performances were all solid and the characters were well defined. An enjoyable movie,"
    },
    {
      "rating": "4.5/5",
      "review": "One of the best horror movies I’ve seen in a while"
    },
    {
      "rating": "5/5",
      "review": "I thought it was a clever and spooky film that reminded me of Halloween 🎃 LOVED IT 💚"
    },
    {
      "rating": "2.5/5",
      "review": "More of a comedy, doesn’t take itself seriously. Acting needs a lil help but lines are delivered. Go with some friends that yall are down to whisper your thoughts to and it’ll make it for a funner time"
    },
    {
      "rating": "4/5",
      "review": "Slashers seem to think they have to be meta to survive in 2025, although the movie falls victim to this mentality it does it tastefully and it’s an overall good movie"
    },
    {
      "rating": "4/5",
      "review": "I thought it was a fun watch. The kills were good & the plot was decent. I never read the book so I didnt know what to expect."
    },
    {
      "rating": "5/5",
      "review": "Oh, this is an infinitely better marauding-psychos-in-a-backwater-town-terrorize-people-they-dont-like-because-theyre-different-than-them movie then Sinners."
    },
    {
      "rating": "1.5/5",
      "review": "It was a teen scream movie , unfortunate that you can predict everything that was going to happen and you can see everything that was going to happen in the preview"
    },
    {
      "rating": "0.5/5",
      "review": "If it comes out that AI wrote this, I wouldn’t be a bit surprised. It’s like someone knew all the components of the genre, but had no idea how they’re supposed to work together. This movie had no idea what it wanted to be. Equal parts unironic slasher knockoff, superficial critique of the gulf between generational value systems, and an 18 year-old’s definition of clever one-liners, I wanted the lead protagonist to be the first to get the chop. Not enough booze on earth to make a good time out of this."
    },
    {
      "rating": "2/5",
      "review": "That should have been straight to streaming platform. It was not worth the movie ticket. It was boring. I actually love that it did not follow any typical plot twist, but they could have done a better job. And not much horror at all."
    },
    {
      "rating": "0.5/5",
      "review": "A failed attempt at the throwback slasher flick. Based on a YA “horror” novel, there is nothing to see here. Tired tropes and terrible story make this one you can skip. The actors really tried but they had nothing to work with. Will Sasso was good. Eli Craig’s “Tucker and Dale vs Evil” is a million times better. Watch that. This movie is garbage."
    },
    {
      "rating": "4/5",
      "review": "A fun original Slasher flick. Great Cast and some really fun effects."
    },
    {
      "rating": "3/5",
      "review": "Pretty corny.... lol"
    },
    {
      "rating": "5/5",
      "review": "it was entertaining and enjoyed the clown doing what clowns do... scare people"
    },
    {
      "rating": "5/5",
      "review": "I, absolutely love this movie it end up being one of my new favorite slasher movies. This movie is really great."
    },
    {
      "rating": "4/5",
      "review": "A strange and unexpected film that turned out to be a lot of fun"
    },
    {
      "rating": "2.5/5",
      "review": "Acting was a bit weak but enough jump elements to kept me entertained"
    },
    {
      "rating": "5/5",
      "review": "Best horror movie ever !!"
    },
    {
      "rating": "2/5",
      "review": "A little longer running time could have fleshed out the characters more. I re-read the book before seeing the movie and was a bit disappointed where the movie differed from the book at times. I recommend reading the books (3 in the series so far) but the movie was a let down for me."
    },
    {
      "rating": "5/5",
      "review": "Really fun movie! Practical effects really well.done and acting better than the norm. Will Sasso is on this.and he's a hoot!"
    },
    {
      "rating": "4.5/5",
      "review": "Not the best movie I’ve ever seen but it was fun! Had some good comedy moments and the acting was done well, with a bigger budget this could have been a 5 star I think."
    },
    {
      "rating": "4/5",
      "review": "This movies was fun and nostalgic because it remember me the old slasher movies and i even If I prefer Heart eyes and this movie have some flaws/problems it still a fun movie Movie vote 7/10"
    },
    {
      "rating": "4/5",
      "review": "Nothing beat a good and old slasher movie"
    },
    {
      "rating": "3/5",
      "review": "was decent for a slasher, very gory I did like the storyline to an extent"
    },
    {
      "rating": "2/5",
      "review": "Loved the campy 90's slasher vibe but would have been cool if the clowns were real monsters instead of people. very slow and boring"
    },
    {
      "rating": "4/5",
      "review": "A fun and entertaining, plus well shot horror film. It feels like 90s slasher with 80s gore. Want a midnight horror movie thats very rewatchable and at times laugh out loud funny? This is that film."
    },
    {
      "rating": "3/5",
      "review": "Interesting concept, some cheesy parts. Some plot holes but it seems it shoud have been direct to streaming kind of movie. I liked it though. not much to think about."
    },
    {
      "rating": "4/5",
      "review": "It was okay! I just would think it would be scary not just people dressing up as a clown and murder people!!"
    },
    {
      "rating": "0.5/5",
      "review": "This was the first movie I ever walked out of."
    },
    {
      "rating": "4.5/5",
      "review": "gret book adaptation kills in it are a must see for any slasher fan out there."
    },
    {
      "rating": "1/5",
      "review": "Horrible movie, made no sense so mad I wasted my money on it. Please do not watch"
    },
    {
      "rating": "4.5/5",
      "review": "had a blast watching this one. exactly what I love about horror comedies"
    },
    {
      "rating": "3/5",
      "review": "Middle of the road. Not great. Not bad. I enjoyed myself throughout the film, but definitely not the horror fest that it seemed to promise."
    },
    {
      "rating": "2/5",
      "review": "It's not a movie I will watch again. Soon to fade away from my memory. To me it was a very typical slasher type horror movie that felt all to familiar!"
    },
    {
      "rating": "4.5/5",
      "review": "If you like slasher films with a side of comedy then you’ll like this movie. Also, book fans I think will be happy by the movie’s adaptation."
    },
    {
      "rating": "1/5",
      "review": "Movie Review: Clown in a Cornfield (2025) Rating: 0 (out of 5) Okay, first of all, I didn’t want to watch this movie. I tried to avoid it. But I needed to prove my bravery, so—there I was, sitting in the theater, trapped in the seat from paralyzing terror. I wasn’t watching a movie, I was entering my worst nightmare. And for those who don't know, I am a little afraid of clowns. I’d rather be trapped in a pit full of spiders than even look at a single clown face. The film starts off as expected. A clown, in a cornfield, killing. Just like the trailer. Just like the title. Clown in a Cornfield. Then, BAM, out of nowhere, clowns. Plural. Bursting from every direction and not just in THE cornfield. They were everywhere. And killed everyone in the most violent ways possible. I’m not talking about \"hey, I’m here to juggle\" clowns. These are nightmare clowns. You know, the kind who look like they were rejected from \"Scream\" movies for being too creepy. And they just kept coming. I swear, they multiplied like some sort of evil circus virus. The clowns in this movie didn’t just kill—they terrorize. They had squeaky shoes. Chainsaws. And every time one of them made eye contact with the camera, my soul left my body and I in fact met my ancestors. They had this uncanny ability to make every small movement feel like a personal attack on my nerves. Literally, every time I close my eyes, I see them in my nightmares. I honestly lost track of the plot because every time a clown appeared on screen, I started convulsing from terror and clutching my friend’s arm like it was a life raft. The acting and the lines? Hilarious. Very “teen movie” in that respect. The plot resolution? Oh, you bet the clowns are defeated. But only after an hour and a half of nonstop terror. It's like if someone put a horror movie and a circus performance in a blender and hit \"puree.\" There’s no stopping it once it starts. And I’m still recovering. Would I recommend it? Well, if you hate yourself and enjoy a good mental breakdown, sure, go ahead. If you're like me and experience existential dread at the sight of anything resembling a clown, run. I’m still wondering if I need therapy now. Final verdict: The only thing scarier than this movie? The fact that someone thought this would be a good idea."
    },
    {
      "rating": "3/5",
      "review": "Not what I had expected however, it was not bad. The reason driving the storyline was weak."
    },
    {
      "rating": "2/5",
      "review": "felt rushed and the kills were pretty mid there was no woah factor for me and the story needed more work and they made it obviously who was going to be the killer not fav and it ain’t bad but it wasn’t good enough"
    },
    {
      "rating": "2/5",
      "review": "Started off okay but just kept getting worse and worse, the plot was really lame. The only reason i’m giving it 2 stars is because of Rust."
    },
    {
      "rating": "4/5",
      "review": "A VERY FUN MOVIE — A LITTLE JUVENILE BUT FUN — SORT OF LIKE AN EXTENDED EPISODE OF “RIVERDALE” —THE CHARACTERS WERE WELL-DEVELOPED, THE HUMOR WAS ON POINT AND THERE WAS PLENTY OF GORE — I’D RECOMMEND IT TO THOSE LOOKING FOR A LITTLE ESCAPISM & FUN!!!"
    },
    {
      "rating": "4/5",
      "review": "Kills were great, fast paced and the characters are likeable there are a few common horror stereotypes but it works for the movie and it balances out with the non horror stereotypes I would definitely recommend watching it"
    },
    {
      "rating": "3.5/5",
      "review": "Clown in a Cornfield seems like just another basic slasher flick, but it is far from it. I felt like I was watching an ep of Tales from the Crypt. This film encapsulated what made 80s-90s slasher films so awesome. I think Fundo is a strong addition to horror cinema’s insane clown posse. Laugh till ya die, the killer clowns are out there!"
    },
    {
      "rating": "5/5",
      "review": "Such a super fun, well executed film! I laughed out loud multiple times! Cheers to the producers on this one. We all need a silly horror every now and then!!!"
    },
    {
      "rating": "3/5",
      "review": "Sure, there’s some standard fare in this flick, but overall it was a pretty nice watch. Miss Douglas does a good job carrying the film, and once all hell breaks loose has some iconic lines, including, “That’s a lot of Frendos,” delivered in a droll but funny tone. I would have given this film a solid four out of five, except for what this director did at the very end of the film, placating a certain generational cohort. When will these directors, and Hollywood in general, take their cues from massive blockbusters like Mission impossible? You don’t see any of any of this social nonsense going on. I hope the whole industry starts to understand that the younger generation is not necessarily their target audience. It’s those of us who have been going to movies forever. And love the experience. We just don’t want to be force fed any of those shenanigans like what happened at the end of this film. Still, I give it a thumbs up. Overall, it was not only entertaining and funny, it was a decent horror movie."
    },
    {
      "rating": "5/5",
      "review": "It was a great Harvest/Fall themed horror movie."
    },
    {
      "rating": "2/5",
      "review": "We've seen this movie before in better versions. Clown in a Cornfield was pretty dumb. And I'm sorry, but with Art the Clown out there, Frendo just seems kind of idiotic."
    },
    {
      "rating": "3.5/5",
      "review": "Very well done. Eli Craig said he didn't want this to be comedy, but it really was, with numerous one liners and super silly moment, but the kills and twist to the story more than made this a pretty fun flick. Props to the Katie Douglas as Quinn and Aaron Abrams as Glenn, who were stand outs for me."
    },
    {
      "rating": "3/5",
      "review": "Not sure I was going to like it halfway through. I mean, talk about offensive cliches! But in the end it was full of pleasant surprises! Looking forward to reading the books now."
    },
    {
      "rating": "2.5/5",
      "review": "It has some legit fun moments but it is hindered by its social commentary. That said it's the good cheesy fun kind of B horror."
    },
    {
      "rating": "0.5/5",
      "review": "Gen Z garbage riddled with that cohorts social commentary. Boring, uninspired and a waste of time. Mind numbing stuff."
    },
    {
      "rating": "3/5",
      "review": "wasnt terrible just was a movie I would watch once"
    },
    {
      "rating": "3/5",
      "review": "It was fun. You’re not going to see it for a jawblowing movie that adds something to the horror narrative. It is simply a fun movie."
    },
    {
      "rating": "0.5/5",
      "review": "By far the most boring slasher horror movie you will probably see all year. The ending reveal is one of worst I can remember. It should be just called “Clowns”"
    },
    {
      "rating": "2.5/5",
      "review": "Listen, I could write some fake long review full of crap, but I wont. Me and my girl skipped the movie and made banana splits at home together, had a great time. Not even sorry. Movie looked mid at best, scary clown, killing, jumpscares.. ahhhh, run."
    },
    {
      "rating": "3.5/5",
      "review": "Just a slasher. I thought it was nice but it was no where near as scary as i was hoping. a teensy bit corny. i enjoyed it tho"
    },
    {
      "rating": "4/5",
      "review": "If you don’t take it seriously it’s a good movie. Has some funny moments"
    },
    {
      "rating": "3.5/5",
      "review": "This was a decent classic slasher movie. Better than the video game one that recently came out, I’m really liking what Shudder is putting out these days. Cheesy? Yes. But like all good slashers are."
    },
    {
      "rating": "1/5",
      "review": "Not scary kinda cringe"
    },
    {
      "rating": "5/5",
      "review": "I liked it, it gave me throw back killer/thriller movie. Hoping there’s a sequel!"
    },
    {
      "rating": "2.5/5",
      "review": "Very corny and very predictable."
    },
    {
      "rating": "4/5",
      "review": "I had fun, it was good and i definitely want a sequel."
    },
    {
      "rating": "3/5",
      "review": "\"Frendo\" the clown is coming to Kettle Springs for \"Clown In A Cornfield\" and you don't want him at your children's birthday party. Never mess with \"Frendo\"! After all the fear of clowns is a real thing, it's called \"Coulrophobia\", so imagine a Killer Clown in a frickin' cornfield. This is one of Stephen Kings fave rural places to freak people out. \"Coulrophobia\" is an intense, irrational fear of clowns and it can manifest as strong anxiety or panic when encountering clowns in person, through images, or even videos. It worked for \"IT\" and many other horror movie box office hits. So, why not riff on this popular device? This movie opens with a horrific scene from 1991, then flashes forward to the present in town where the surviving adults could do with a semester at charm school. History has it the one and only local factory burned down in a horrendous fire ruining the towns economy and costing a few lives. Local teenagers were naturally suspected, because you just can't trust those pesky, hormonal, Tik Tok obsessed kiddies. It's a bit of a cliche, but the first of the town teens group to die is a black youth. Which begs the question, \"will there even be a survivor girl?\" Watch out for: creepy Jack in the Box type toys that signify another death just around the corner and the funny analogue phone scene. Another cliche is the Foundation Day Parade. What could possibly go wrong? The kills are inventive and some original. At one point there are multiple \"Frendos\" with the head clown channeling Batman's \"the Joker\". I'm sure DC's lawyers are already onto it. The action takes place over one confusing night when local heroes are outed and pitchforks get a work out. \"Clown In A Cornfield\" delivers what it says on the box. It's not trying to be anything more than a tribute to the teen 80/90's horror/slasher flicks and it does this well. It will find its audience and maybe even some Generation X'ers who remember those good times. All I can say is vote one Glenn Maybrook for Mayor proudly sponsored by Baytown Brand Corn Syrup."
    },
    {
      "rating": "4/5",
      "review": "Honestly wasnt expecting it to turn out as good as it was. Trailer didnt do the movie any justice"
    },
    {
      "rating": "5/5",
      "review": "It was scary, funny, and sweet! Loved it!"
    },
    {
      "rating": "4/5",
      "review": "A little bit of a cheesy horror film but it was fun overall"
    },
    {
      "rating": "2.5/5",
      "review": "98% of the movie is nothing but old slasher movie tropes from the 80s and 90s with the exception of one character stereotype that was not killed off by the villain. The moment in this movie when the teens do not know how to make a call with a rotary phone was the most hilarious joke of the entire film."
    },
    {
      "rating": "2.5/5",
      "review": "it was alright the main actor was forcing too much but wished it showed what happened to Arthur Hill"
    },
    {
      "rating": "4/5",
      "review": "A Bloody Good Time with a Few Stumbles. Eli Craig's Clown in a Cornfield (2025) isn't just another slasher flick; it's a surprisingly clever and wickedly fun ride that carves out its own niche in the horror-comedy landscape. What makes this film particularly engaging is its ingenious use of the generational divide in the storytelling, a refreshing approach that feels both timely and genuinely integrated into the mayhem. The setup is classic slasher territory: a group of teenagers in a seemingly sleepy small town, a dark local legend, and a series of gruesome murders. However, Clown in a Cornfield elevates this familiar framework with well-developed characters that you actually root for. Katie Douglas delivers a standout performance as Quinn Maybrook, the new girl in town with a troubled past. She embodies a resilient and resourceful spirit, hinting at a potential future scream queen in the making. Her interactions with Cole (Carson MacCormac) and his group of friends feel authentic, and their dynamic provides both comedic relief and genuine emotional stakes as the body count rises. he filmmakers clearly had a blast dreaming up creative ways for the sinister Frendo to dispatch his victims, ranging from the brutally direct to the darkly comedic. These moments are visceral and entertaining, satisfying the slasher cravings while never taking themselves too seriously. Adding another layer of intrigue are the well-placed slasher reveal twist. Just when you think you have a handle on the mystery, the film throws a curveball, effectively subverting expectations and adding to the overall suspense. These reveals are earned and contribute meaningfully to the unfolding narrative. However, the film stumbles somewhat in its final act. The ending feels rushed and tonally inconsistent with what came before. It's as if the filmmakers had a different, perhaps more impactful, conclusion in mind but were forced to pivot. While the final confrontation has its moments, it lacks the same level of polish and satisfying resolution that the rest of the film delivers. This slightly deflated ending prevents Clown in a Cornfield from reaching its full potential. Despite this misstep, Clown in a Cornfield remains a highly enjoyable and original horror-comedy."
    },
    {
      "rating": "4/5",
      "review": "Killer clowns are a little uncommon nowadays as they are in the fun, even from underrated bad horror/slasher films. I've seen my fair share of killer clowns from Killer Klowns from Outer Space, Stitches, the IT franchise, old and new, and the Terrifier films that I'd started getting into and they were a fun time. What they always have in common are laughs and carnage along with the story being simplistic and having a cast that can go in both ways. Ranging from seriously interesting and fun or funny, one-noted and stupid. With a movie involving a killer in a clown costume under a low budget, Clown in a Cornfield is somewhere in the middle. It's technically fun on its own terms in account of the story, the humor, and the carnage. I'm not too familiar with Eli Craig except for a famous movie he directed, called Tucker & Dale vs. Evil, which I might give that a watch in the future since I like a little comedy and horror as long as it's done great. This might as well be my introduction because of what I've said earlier. His idea of a clown in a rural town surrounded by a cornfield, Children of the Corn, eat your heart out, stalking a group of teenagers who are partying. Yes, it's one of those kinds of movies that I remember from other horror movies that range from bad to okay. With a new kid in town who'd moved in with her dad, who is the new doctor in town. Now Quinn, played by Katie Douglas, is a fun character, along with being the final girl. Her dad, played by Aaron Abrams, is also fun for being an overprotective father while growing as a character nearing the end. You also have the rest of the cast ranging from the adults who hold their role in tradition. You also have teenagers who are just playing teenagers who would party, drink, and post YouTube videos involving Friendo the Clown. Yes, they are pretty much your usual troupe of high school kids in a clique, but they are fun to see them through the end, whether dead or alive. It's a horror/slasher movie at the end of the day. For the adults, they're also like a troupe, but they're also having fun with it like teenagers. Now let's talk about Friendo the Clown, who is a fun killer. Both in the carnage and the humor department. Reasoning with why Friendo is going around is a bit odd, yet it's all about the laughs and the blood being spilled. Basic kills as the suspense of the movie works well when the kids are figuring out why there is a wild Friendo that isn't in their YouTube videos, killing them off one-by-one. The ending was honestly a good send-off, even for our survivors. This is based on a book of the same name and would like to see the sequels, being two of them according to when I was looking up information of the books and where it all ends. Might even read the books after seeing the first film and before the sequels come to the big screen. For all the fun that I had with this, I give this movie eight killer clown lurking behind the cornfield out of ten. 8/10."
    },
    {
      "rating": "3.5/5",
      "review": "It’s mid but good 6/10"
    },
    {
      "rating": "2/5",
      "review": "the movie was alright....really didnt show much violence and not very scary at all...id say mehhh"
    },
    {
      "rating": "3/5",
      "review": "It's a fun movie. The twist was a little more obvious than it needed to be, but it was pretty fun overall."
    },
    {
      "rating": "5/5",
      "review": "This movie was a bit of EVERYTHING. Thrilling, funny, scary, but it was such an amazing movie. Definitely 5 of 5 !! If I could give it more I would!!"
    },
    {
      "rating": "4/5",
      "review": "Back to the classic slasher and lots of fun!"
    },
    {
      "rating": "2.5/5",
      "review": "Some decent nods to 80s slashers but the ho-hum climax turns it away from a traditional slasher and doesn’t work. Despite some suspense it doesn’t feel very scary. The gore was campy, which was fine with me since I prefer suspense over gore, but at some point it stopped being suspenseful. But if you lower your standards going in there is some fun to be had."
    },
    {
      "rating": "3/5",
      "review": "Connor here with Chills & Thrills podcast, so just got out from seeing Clown in a Cornfield. Without spoiling to much, the characters were basic but pretty fun, the film had some good moments of tension and soundtrack and took a different spin on the clown horror films that we are accustomed to. The film had a good father and daughter dynamic and some good carnage candy and gore for all of you coming to see this film for the kills. All in all I thought it was a fun and interesting film that you will either appreciate and have fun with or this just won't be your flavor of film. Everything said and done I would give this film a 6.5/10! If you have seen it let me know what you thought of this film!! #ClownInACornfield"
    },
    {
      "rating": "2.5/5",
      "review": "Very mediocre. Not bad, but not special. I’d skip it."
    },
    {
      "rating": "1/5",
      "review": "I don’t have high hope before watching. But this is below average. Not recommended."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is so bad it made me create a Rotten Tomatoes account just to express how disappointed I was watching it. The acting feels like a parody, I honestly couldn’t tell if they were aiming for a comedy/slasher or if it was meant to be serious. Truly one of the worst I’ve seen lately. Don’t waste your time or money"
    },
    {
      "rating": "4.5/5",
      "review": "Really entertaining movie! Kept me interested & wanting more hoping there’s a sequel!"
    },
    {
      "rating": "4/5",
      "review": "It did what it needed to do. It was mostly faithful to the book and the movie itself was fun. A great call back to the old slasher films."
    },
    {
      "rating": "1.5/5",
      "review": "It wasnt all that. The acting was terrible and the plot was overall predictable"
    },
    {
      "rating": "5/5",
      "review": "Great movie, very suspenseful…"
    },
    {
      "rating": "4/5",
      "review": "Clown in a Cornfield is a refreshing, adrenaline-charged slasher that delivers exactly what horror fans crave. The story steadily builds suspense before erupting into chaos, and the strong, resilient teen protagonist gives the film a solid emotional core. The supporting cast holds their own, and the chase scenes are fast, frantic, and fun to watch. While the kills could’ve been more creative, there’s clear franchise potential, and I’m genuinely excited to see where it goes next. Slashers are back—and this one proves the genre still has teeth."
    },
    {
      "rating": "3/5",
      "review": "could be better, barely a plot and barely any deaths. it was made by shudder so it's either average horror or bad."
    },
    {
      "rating": "3/5",
      "review": "The title is the easiest thing for a horror film like this A cast of unknown teenagers live in a farm town in Missouri There's a legend of a killer clown Frendo and they treat it like a joke since two people were killed in 1991 The town celebrates its founders day of corn syrup every year but the kids have turned it into a local legend But once they learn Frendo is real they start getting hacked off one by one Can they escape this killing nightmare? The film is very basic in its setup It's also quite funny in spots and has its meta moments filled with humor There's some terrific gore too A majority of the adults in this are just unlikable pricks and it could’ve concluded on a higher note A lot of the teenagers aren’t that deep or memorable Yet there’s also commentary on people silencing others than listening to them, saving a community from being poisoned by previous generations, being unable to deal with change, sticking to tradition, cleaning up and starting over, burning the world to the ground when it doesn’t meet our expectations It’s more of being concerned about the youth of today’s world if it can get used to the times long past still hanging over their heads It’s pretty basic like I said yet feels like a throwback to early 2000s horror it’s just that you won’t retain a lot Still makes fair use of making clowns scary"
    },
    {
      "rating": "4/5",
      "review": "Classic slasher night out movie. Worth going to see."
    },
    {
      "rating": "3/5",
      "review": "It was basically an 80's horror movie set in 2010."
    },
    {
      "rating": "1.5/5",
      "review": "So bad. I left the movie 20 minutes early. I just couldn't eat anymore"
    },
    {
      "rating": "2/5",
      "review": "I've seen a lot of bad horror so I don't know why this was so disappointing. The whole thing felt like the Steve Buscemi \"fellow kids\" meme. And the political preaching was over the top. Lame, but not the lamest."
    },
    {
      "rating": "5/5",
      "review": "Excelente película 👍"
    },
    {
      "rating": "5/5",
      "review": "If you like horror comedy, then this will be your jam. An utterly entertaining movie from start to finish"
    },
    {
      "rating": "1/5",
      "review": "It only used easy jump scares in the beginning. Not good. The middle got simple and obvious. Bad. The end got lamely social-political. Really bad."
    },
    {
      "rating": "4/5",
      "review": "A fun slasher with some decent twists and kills to keep you interested."
    },
    {
      "rating": "5/5",
      "review": "Very good pacing and the kills were exceptional"
    },
    {
      "rating": "5/5",
      "review": "It was the typical horror movie plot was pretty good and tons of jump scares"
    },
    {
      "rating": "5/5",
      "review": "Great fun horror movie"
    },
    {
      "rating": "1.5/5",
      "review": "Really a poor slasher of a horror movie that again Hollywood wants to play geopolitical themes here. Nothing new! Nothing game changing! I expected a more newer version of killer clown movie….THIS AIN’T IT! Save it for streaming or wait till it broadcasts on cable"
    },
    {
      "rating": "3.5/5",
      "review": "What happened to the other kids at the party? 😂 but I enjoyed it overall!"
    },
    {
      "rating": "4.5/5",
      "review": "A above average old fashioned slasher"
    },
    {
      "rating": "0.5/5",
      "review": "I wish I saw this BEFORE reading the book because I set my expectations too high. This movie was SO weak. How are you going to completely leave out one of the best plot twists in the book?! It couldn't have been an issue of run time because it was a fairly short movie. Book lovers prepare to be disappointed."
    },
    {
      "rating": "2/5",
      "review": "I went to see this with my horror loving family after reading and article stating this movie would give Terrifier a run for its money. That's horribly wrong. Just because it has a clown(s) does not mean it's anywhere remotely the same. If anything it's more like Thanksgiving than anything. The movie is very generic as a whole with a few funny meme worthy moments, there was some gore but honestly, it wasn't much. As a whole the movie just lacked any real depth and was a sad attempt to rip off many different movies and characters. Perhaps that is what they were going for but it just missed the mark. Would I watch it again? Probably not by choice but if someone played it and I was in the room, I think I could deal with it."
    },
    {
      "rating": "1/5",
      "review": "if you voted for a particular person in 2024 you’ll like the movie!"
    },
    {
      "rating": "5/5",
      "review": "Love a good founders day small town horror film"
    },
    {
      "rating": "5/5",
      "review": "oh what fun it is to slay in a cornfield full of hay"
    },
    {
      "rating": "1/5",
      "review": "This is probably one of the WORST movies if ever seen in my life. It was so bad it was good. I was laughing hysterically throughout it. My god was it BAD."
    },
    {
      "rating": "2.5/5",
      "review": "More satire than horror it made me laugh hard a few times."
    },
    {
      "rating": "5/5",
      "review": "Really fun movie. Had really great pacing. And a few twists and turns that were unexpected."
    },
    {
      "rating": "1/5",
      "review": "It’s awful even for a slasher film. Weak kills, no tension/scares, too comedic and has a stupid plot twist. Only 1 cool kill involving a gym set and that’s it."
    },
    {
      "rating": "4/5",
      "review": "Look, it's called Clown in a Cornfield, you get what you expect. A tiny predictable, but overall, lots of fun."
    },
    {
      "rating": "2/5",
      "review": "Acting was not so great, some by the numbers horror cliches. So much potential but it didn’t live up to it."
    },
    {
      "rating": "1/5",
      "review": "Movie was very predictable."
    },
    {
      "rating": "5/5",
      "review": "Loved it,but didnt expect it he outcome!"
    },
    {
      "rating": "0.5/5",
      "review": "Clowns* in a Cornfield lacked the game changing moment that could have set it apart from the already over saturated genre. Nothing memorable was taken away when I left my seat. The acting was stiff and uninspired. overall ends up finalizing as another missed opportunity in the genre."
    },
    {
      "rating": "4/5",
      "review": "This movie was good But it has some flaws/difects like its nothing new to the genre But my god If it was nostalgic because its soo like old slasher movies wich i prefer to others But again nothing new But nostalgic, But for me even If this movie was fun the best horror/slasher movie of this year is Heart eyes But it fights with sinners wich i love Movie vote 8,5/10"
    },
    {
      "rating": "3/5",
      "review": "Pretty serviceable horror with some fun twists."
    },
    {
      "rating": "3.5/5",
      "review": "Thought it was going to be a typical slasher. Kinda was but then the end was satisfying. Sheldon’s dad was in it"
    },
    {
      "rating": "4/5",
      "review": "Doesn't take itself seriously and it shows! Such a fun movie that had me laughing the whole time. Don't expect it to be a scary serious movie. It was a perfect comedy/horror movie that I am eager to watch again."
    },
    {
      "rating": "2/5",
      "review": "The first half was good. Great jump scares. The second half felt rushed and messy! Overall not very scary and just dumb at times."
    },
    {
      "rating": "4/5",
      "review": "Reminds me of the 80s slasher films only with a twist!"
    },
    {
      "rating": "3/5",
      "review": "Standard slasher fare. Nothing particularly newly, inventive or even that exciting. No real scares to speak of, even jump scares. It did have clowns and I hate them so....rental at best. If clowns scare you, rent the Hell House movies."
    },
    {
      "rating": "5/5",
      "review": "Didnt expect to enjoy this movie as much as I did. Had me on the edge our seats the whole time."
    },
    {
      "rating": "1/5",
      "review": "I mean I figured itd be bad, based on the title, but this was terrible! Dont waste your money."
    },
    {
      "rating": "3/5",
      "review": "The trailer looked a lot better, as to be expected of course but the movie felt very corny."
    },
    {
      "rating": "4/5",
      "review": "it wasn’t Art the clown or Pennywise but I enjoyed the story & the humor. Definitely a movie I’d own."
    },
    {
      "rating": "1/5",
      "review": "Not worth going to the theaters!"
    },
    {
      "rating": "4/5",
      "review": "A quirky, funny, slightly scary movie."
    },
    {
      "rating": "5/5",
      "review": "It totally turned the mass killer trope on the head"
    },
    {
      "rating": "5/5",
      "review": "Love it. Really you can feel the almost taste of the 90’s nostalgic vibe in the movie. Second movie of the year that I really find appealing."
    },
    {
      "rating": "4.5/5",
      "review": "Never a dull moment. The plot takes a while to unfold, and takes a few unexpected turns along the way. A rare mix of comedy and horror."
    },
    {
      "rating": "3/5",
      "review": "Fairly entertaining slasher film"
    },
    {
      "rating": "5/5",
      "review": "Funny movie about Frendo the Clown who will provide many kills. Shot well and follows the formula well given its source material. The people of color next to me didn't seem to like it though. They called it Caucasian."
    },
    {
      "rating": "1.5/5",
      "review": "If you read the book before you will not enjoy it much. Read the book first and the movie is missing a lot of crucial scenes and a twist in the book would’ve been better in the movie. If you’re going to watch it do not read the book first you’ll enjoy it more."
    },
    {
      "rating": "1/5",
      "review": "A Gen Z'er wrote a story depicting the unsubstantiated nostalgia that Gen X and previous generations have for movies of their era and before...he only substantiated the nostalgia. I prefer an unapologetically bad movie, like you didn't have the budget, decent actors, or a good writer(like this movie), not one that tries to conceal those flaws with a political agenda. I feel like the clowns from Killer Clowns From Outer Space and Pennywise are sarcastically saying to Frendo, \"Really, this is what you think I do\"? The only way this movie resembles any of its predecessors is in a \"fun house mirror\". At best, this movie is a student entry into the AfterDark, ScreamFest, or Fright Night festivals of the 90s (but not a winner). They used to say, \"Those who can't do...Teach\". To Adam I say, \"Those that can't write...Don't be mad UPS is hiring\"."
    },
    {
      "rating": "0.5/5",
      "review": "Literally worst movie ever it’s not a horror movie."
    },
    {
      "rating": "5/5",
      "review": "Great fun slasher movie. Not what I'd call scary but very fun to watch with friends and I loved the music! (something I'd normally never pay attention to). Definitely go see it with a few friends and try going in blind."
    },
    {
      "rating": "5/5",
      "review": "Everything about the movie was amazing! Funny horror movie! Graphic death scenes and a happy ending lol WATCH THIS MOVIE!!"
    },
    {
      "rating": "5/5",
      "review": "90s style horror love it"
    },
    {
      "rating": "1/5",
      "review": "Plot made zero sense"
    },
    {
      "rating": "2.5/5",
      "review": "Thought the actors did good with what they had to work with. It was a cheesy slasher movie. Did decent but hated the ending just to many corny lines. 6/10"
    },
    {
      "rating": "5/5",
      "review": "I thought this was going be a supernatural pacific type of viewing. Instead, it was very realistic! I did enjoy it!"
    },
    {
      "rating": "0.5/5",
      "review": "lol this movie was so trash. Not only did they put the b-team in for the cool kids, any classic slasher horror like Friday the 13th beats the kills and suspense. Like how hard is it? You literally have the scripts. And the lead? A 4ft girl with a fake deep lorde singing voice? My god, just stahp lol."
    },
    {
      "rating": "2/5",
      "review": "Well definitely not the worst of the year, it may be one of the most disappointing. Creating your own story is difficult, but when the good book is right there and you remove and change random things for the absolute worst, then it's a problem. Unmemorable characters with mostly forgettable kills. And the story can't even be bothered to wrap up well, with a main antagonist that just leaves in the middle of the climax and never returns. That being said, the slasher cliches it does take from are alright"
    },
    {
      "rating": "2/5",
      "review": "I expected more from it"
    },
    {
      "rating": "1/5",
      "review": "This movie could have been something… but I’m still not sure what it was trying to be. It looked like someone started filming on their phone and just kept going. A few moments were unintentionally funny, which might’ve been the point, or not? I can’t recommend it, unless of course, you’re doing a bad movie night and need a conversation starter that begins with, “What was that?’"
    },
    {
      "rating": "3/5",
      "review": "There was a story that could have been great but it was not developed. The horror, jump scares and comedy do not work. The producers seem lost what to do with this and the writers apparently hit a wall and had to introduce almost a dozen clowns instead of the focus being on one clown that terrorizes the town on founders day to get the story to the final climax.The language was too much and the same results could have been achieved without it."
    },
    {
      "rating": "3/5",
      "review": "It was eh The music was bad, the acting was bad, the plot was bad. I read it was funny. The only funny parts were how bad it was during the killings. Somewhat predictable as to who were the bad clowns. I was hoping for funny outtakes at the end but no."
    },
    {
      "rating": "2/5",
      "review": "Love the cast but it's clunky story telling and bad writing predictably was to much definitely targeted for younger cast felt more like a horror YouTube video more than a feature length film a absolutely star studded cast but it wasn't enough to watch this movie definitely not worth paying to watch on the big screen"
    },
    {
      "rating": "1.5/5",
      "review": "I wanted to like this movie because of the handful of actors I like starring in it but I wanted to leave the theatre 30 min in. Slow, too much back story that I did NOT care about, extremely predictable, lackluster character deaths. Best character was the dad and I spent most of the movie feeling bad for him."
    },
    {
      "rating": "1/5",
      "review": "I would have enjoyed it more if not for the underlying and unnecessary messaging."
    },
    {
      "rating": "4/5",
      "review": "Saw Clown in the Cornfield today and really enjoyed it for what is - a slasher with a great sense of humor and real heart. It loses some of the depth and nuance of Cesare’s novel, but I enjoyed the tight storytelling. I sincerely hope that the next 2 novels also become films and we get to see Quinn’s arc."
    },
    {
      "rating": "3.5/5",
      "review": "Though it could have been longer, Clown in a Cornfield is a funny, bloody horror film with a stacked cast that subverts expectations in creative ways."
    },
    {
      "rating": "3.5/5",
      "review": "Great movie, spooky and fun!"
    },
    {
      "rating": "4/5",
      "review": "good movie, fun to watch, horror comedy with a 90's vibes"
    },
    {
      "rating": "1.5/5",
      "review": "This slasher film follows a dad and his daughter as they move into a small Midwest town, setting the stage with an eerie rural atmosphere that really works. The clown character, Frendo, was absolutely unhinged-his gory kills were crazy but I wish there were more of the clowns killings. The story quickly turns into a showdown between the teens and the adults, but honestly, the teenagers were so cringe-worthy that found myself rooting for the adults... or even the clowns. While the film had some strong visual elements and atmosphere, the pacing dragged at times, and the ending fell flat due to weak modern character development. It was all too predictable in the end. A few standout moments, but overall, it's a decent slasher flim but the modern twist was the downfall."
    },
    {
      "rating": "5/5",
      "review": "Definitely one of the better modern teen slasher films & it is not your average clown movie either. I was just looking for something to do today, checked what was playing right now & figured i’d check it out. I went in totally blind & came out texting ALL of my friends about it. It was proper balance of being hilarious at moments & gruesome, but had good storytelling without it all dragging on too long. The premise is simple & i enjoyed the overall metaphor & message it had by the end. Go check it out!"
    },
    {
      "rating": "5/5",
      "review": "Loved it to bad it didn’t really do the book justice though was kinda sad about that but all in all great watch"
    },
    {
      "rating": "0.5/5",
      "review": "If you enjoy watching sexually confused teen boys making out, then watch this movie and then go punch your clown. The way the various murders happened were not at all clever. It just wasn't very fun apart from some occasional laughs."
    },
    {
      "rating": "3.5/5",
      "review": "The ending could have been better left with a lot of questions than answers."
    },
    {
      "rating": "5/5",
      "review": "This movie was awesome it had a few laughs, gore, and overall I think it is well on its way to eat a seat by Art the clown and Pennywise!"
    },
    {
      "rating": "4/5",
      "review": "A really unique movie and a great twist"
    },
    {
      "rating": "3/5",
      "review": "Trippy and fun! Good twists on old tropes"
    },
    {
      "rating": "4/5",
      "review": "Pretty good killer clown movie, with a pretty crazy twist I honestly didn’t expect that at all but it was a perfect fit 👍"
    },
    {
      "rating": "4.5/5",
      "review": "CLOWNS R CRACIEEEEEEE"
    },
    {
      "rating": "4/5",
      "review": "Surprised by how much we liked it. It was a great laugh and even better gore. It was definitely worth the watch."
    },
    {
      "rating": "0.5/5",
      "review": "This has to be the most barebones, uninspired, pretentious horror movie I’ve seen in a long time. I knew nothing about it going into it, nor anything about the book series it got adapted from but honestly this film has no redemptive qualities. I left the theater thinking “wow, this was such a waste of time” but I also didn’t realize it was a shudder film and those can get very hit or miss. The characters aren’t very good, it’s way too on the nose and self aware many times, being way overly cheesy and stereotypical through out the movie, no jokes land, kills are extremely basic but lackluster even beyond that if that even makes sense to you and the whole movie story when you get it all tied together is extremely predictable and honestly a super lazy route to me. Me being a horror fanatic I am should’ve had some of this expectation but I really wanted to go in with a blank open mind and that honestly made the experience worse for me. I could maybe see people who have dry taste in horror finding this to be a good movie, but to me this was just an awful attempt at making a new slasher movie that barely even scratches the surface to that category in the first place, and lastly there’s just a few very unnecessary additives to this movie that really left a sour taste in my mouth as well, and maybe you’ll pick up on it like I did, but I can’t not recommend this enough to people who enjoy horror and slashers like I do, and aren’t just “causal” fans."
    },
    {
      "rating": "1.5/5",
      "review": "It’s really tough to recommend this movie. The storyline is so preposterous and ridiculous I can only say, wait for streaming."
    },
    {
      "rating": "5/5",
      "review": "So funny with gruesome kills this hit so hard in a packed theater!"
    },
    {
      "rating": "3/5",
      "review": "Made for TV horror movie"
    },
    {
      "rating": "5/5",
      "review": "Slasher horror we need. Too many super natural movies. Love a good serial killer running around killing people. Was a lot of fun. Hope they do a 2nd."
    },
    {
      "rating": "3/5",
      "review": "A little corny, but entertaining."
    },
    {
      "rating": "0.5/5",
      "review": "WARNING IS A COMEDY HORROR MOVIENOT A HORROR MOVIE WITH BAD ACTING 👎"
    },
    {
      "rating": "5/5",
      "review": "Having grown up on cheesy 80s slashers, I thought this was great. Expectations are subverted. Enjoyable to watch"
    },
    {
      "rating": "2/5",
      "review": "Good plot but horrible directing. Like other movies similar it was rushed and corny and a waste of money and time. Had a good laugh but wouldn’t recommend for a serious thriller… co"
    },
    {
      "rating": "0.5/5",
      "review": "This movie genuinely let me down, I had at least decent hoped it wouldn't be too bad but OOF - it's genuinely terrible. Truly don't understand how anyone could enjoy this film for even a second, even if they are into campy horror flicks. Don't buy a ticket and don't waste your time watching this, choose a screening for anything else! 0.5/10"
    },
    {
      "rating": "4/5",
      "review": "An entertaining movie, youll have fun for sure."
    },
    {
      "rating": "5/5",
      "review": "Amazing horror film that combines elements of 80s and 90s horror with good social commentary from today. Definitely a film that should be the next clown franchise like Terrifier. 5 stars Clown in a Cornfield!!!!!!!!!"
    },
    {
      "rating": "3/5",
      "review": "acting was alright , everything happened so fast"
    },
    {
      "rating": "1/5",
      "review": "Just what we needed, another clown psycho movie. Clowns used to be cool, funny, and kids loved them until Hollywood ruined their reputations."
    },
    {
      "rating": "0.5/5",
      "review": "Horrible cheesy movie wish i could get my money back. Smh"
    },
    {
      "rating": "4.5/5",
      "review": "It was fun and entertaining"
    },
    {
      "rating": "3/5",
      "review": "Felt it was trying to be too funny of a horror movie."
    },
    {
      "rating": "1/5",
      "review": "I’m struggling to come up with a worse movie i may have seen in my life. I can’t. This is it. The plot was grotesquely stupid, the acting was worse, and the script was written by a third grader. Most people don’t have high expectations for slasher movies, but this was below even well below the low standard set for this genre. See Sinners. One if the best “spooky” movies I’ve seen in a long time. Not only did this movie suck, they shoved a bunch of social messages down you throat. Pass on this one."
    },
    {
      "rating": "5/5",
      "review": "Good vibe for a fun horror movie."
    },
    {
      "rating": "2/5",
      "review": "The only thing massacred in this movie was its source material. The movie is a good generic teen slasher. But by the time it got finished hacking and slashing the source material, all semblance of a strong message and relatable characters were left on the cutting room floor. The actors do their best with what theyre given, but the movie takes what was one of the best modern horror books and turned it into a forgettable pre-summer romp. Its worth a watch but not much more."
    },
    {
      "rating": "1/5",
      "review": "It had a couple moments. I thought it was supposed to be humorous. When you’re being threatened by a gen X killer clown cult I guess you need a speech about how we (they) don’t care about the earth 🙄"
    },
    {
      "rating": "5/5",
      "review": "Very unexpected and like that it was not cheesy. Literally had some scary parts and funny too ."
    },
    {
      "rating": "1.5/5",
      "review": "Clown in a Cornfield, ⭐️ R 2025 ‧ Horror/Crime ‧ 1h 36m Zzz. Not scary Not funny Not gory Cheesy Don’t waste your time I can’t recommend it."
    },
    {
      "rating": "2/5",
      "review": "I honestly don’t know how this movie got anything over 35% rotten tomatoes. It’s a horror film that is probably more funny than scary. Not something I’ll spend money to see at the movies, something I’ll see at home. I’ll give it a D+ rating."
    },
    {
      "rating": "5/5",
      "review": "It was absolutely amazing, the kills were creative, plot and the dialogue was amazing. Katie Douglas’ performance is absolutely amazing. She pulled it off and it was just unbelievable! The story between Cole and Rust was unpredictable! The reveal of the killers was so amazing I don’t think it could be better. Definitely would see it again!"
    },
    {
      "rating": "1/5",
      "review": "Super corny . The effects were pretty bad too."
    },
    {
      "rating": "3.5/5",
      "review": "❤️ this movie.. 80s, feel for sure. fun.fun.fun.."
    },
    {
      "rating": "3/5",
      "review": "A slasher comedy horror film that may appeal to enthusiasts of the genre could be enjoyed in a cinema setting. While the filmmakers attempted to pay homage to classic 90s and early 2000s slasher films, the execution falls short of expectations. There are a few notable moments of violence, but the overall narrative lacks substance, resulting in a rather unengaging experience. The acting performances exhibit a polished yet lifeless quality reminiscent of Netflix original productions, and the climax ultimately undermined the film’s impact. Horror films should prioritize entertainment rather than political commentary. Audiences seek escapism and avoid films that serve as reminders of contemporary issues. Given the prevalence of this approach, I suggest delaying its viewing on streaming platforms."
    },
    {
      "rating": "3.5/5",
      "review": "Lot of fun. Got better as the movie went on. Would watch it again 👍🏻"
    },
    {
      "rating": "0.5/5",
      "review": "terrible not worth it"
    },
    {
      "rating": "4/5",
      "review": "\"Clown in the Cornfield,\" a chilling new horror film, hit theaters in May 2025. While the movie explores some dark themes, it strikes a balance that ensures it remains engaging without overwhelming the audience with excessive gore. The director skillfully crafts jump scares and maintains a captivating rhythm that keeps viewers glued to their seats. The writing adds depth to the film, particularly during the pivotal reveal that ties the plot to a legacy, adding layers to the clown's character. The storytelling is commendable, providing an intriguing experience that keeps the audience guessing. There are moments where you might think you've figured it out, only to be blindsided by unexpected twists that pull you back into the narrative. The casting choices were exceptional. The ensemble cast created a dynamic chemistry that was enjoyable to watch. The main character, Quinn, portrayed by Katie Douglas, convincingly embodies the \"final girl\" trope. Carsen McCormick's portrayal of Cole, the mayor's son with a hidden secret, adds complexity to his character, even if the secret feels somewhat unnecessary. However, the filmmakers wisely chose not to dwell on it, allowing the story to flow without distractions. Supporting characters Janet and Ronnie bring their own flair to the film. Janet, the seemingly polished \"mean girl,\" manages to maintain her edge without becoming overly aggressive, while Ronnie is the adventurous spirit, unafraid to dive into any situation. Their interactions are a highlight of the film. Tyler and Tucker fulfill similar roles in the boyfriend group, contributing to the overall dynamic of the ensemble. When the entire group of seven comes together, their chemistry shines. Vincent Muller's character, Rust, adds an element of unpredictability; viewers will find themselves questioning his motives and whereabouts throughout the film. Other supporting roles are well-cast as well, including Will Sasso as the sheriff, Aaron Abrams as the town's doctor, and Kevin Durand as the mayor. Each actor brings their character to life without overshadowing one another, focusing instead on creating a compelling story. With the potential for sequels, the friendly clown who serves as the mascot for the syrup could very well become a staple in horror cinema if the franchise is handled with care."
    },
    {
      "rating": "1/5",
      "review": "Awful. This is supposed to be in a small town in MO ...I used to live in MO...but the costumes and hairstyles are all wrong. Plus...where are the tattoos and piercings teens would have today? Also...the teens have zero personality. Not funny or scary. And where are the MO accents??"
    },
    {
      "rating": "3.5/5",
      "review": "Starts very slow but if you make it past the first 30 minutes you will be rewarded with a movie that is part humorous part horror and even part social allegory. Probably safe to say not a horror classic but also not a dud."
    },
    {
      "rating": "4/5",
      "review": "A brilliant, perfect, popcorn slasher that keeps you laughing and while clowns are slashing. This is the kind of killer camp that brings me pure joy. Clowns. Cornfields. Great delivery from the cast. Katie Douglas is a star. Eli Craig nailed it and I am ready for more killer clown sequels/prequels/series ...give it to me please!"
    },
    {
      "rating": "0.5/5",
      "review": "This was the most cliched mess I’ve ever seen. Every trope is here along with some of the cringiest lines. I found the twists predictable and telegraphed."
    },
    {
      "rating": "3/5",
      "review": "It was okay. Seemed like a lot was happening but also nothing was happening at the same time. Worth a watch anyway."
    },
    {
      "rating": "3.5/5",
      "review": "This is just good 80s horror fun with pretty good production quality and definitely not low budget ala Pooh. Bonus pts for no eye rolling twist ending."
    },
    {
      "rating": "1/5",
      "review": "Absolutely terrible movie from start to finish. No real horror or scary moments as everything is predictable about what is going to happen and the \"twist\" of the storyline was weak and made the movie even worse. The acting was also pretty terrible minus Kevin Durand at the end of the movie. If you really want to see it, wait until it comes out on streaming, but your time would still be better off watching something else even then."
    },
    {
      "rating": "0.5/5",
      "review": "acting was bland and a very predictable story and plot. It’s been done a billion times. The Sonic movie was better than this unoriginal writing."
    },
    {
      "rating": "4/5",
      "review": "I've heard \"Clown in a Cornfield\" referred to as \"my first horror movie\" and I believe that is a great compliment. Great kills that aren't too gory, some decent scares, funny as hell, and the lead actress absolutely kills the role. It does a fairly good job adapting the book, shaking things up slightly so there's still surprises for those who read the books. A future \"cozy\" favorite. Hope there's a franchise!"
    },
    {
      "rating": "2/5",
      "review": "Weak storylinecrossed the silly lineno scares..overall a bad horror film..2 stars may be too kind!"
    },
    {
      "rating": "3.5/5",
      "review": "I wanted this to be better. I do think it is worth a watch if like slasher movies as this one plays with the classic tropes. I also feel it would been better being released in October. The ending is probably the weaker point in the movie."
    },
    {
      "rating": "2.5/5",
      "review": "Great characters and scary clowns but weak plot. Nothing unique."
    },
    {
      "rating": "2.5/5",
      "review": "Was a fun movie but the second half dragged on."
    },
    {
      "rating": "3/5",
      "review": "it was ok didnt like the end with the boyz kissin but it was good all the way until end which was lack luster i give it a 3 it is good to watch one time but thats it"
    },
    {
      "rating": "4/5",
      "review": "If you are looking for a FUN scary movie this is it !! Not the best slaher movie I've ever seen but if you go in with an open mind and are in the mood for a fun scary movie this is it ! If you looking for texas chainsaw massacre kind of feel you won't find it in this one ...this one is for fun !!!"
    },
    {
      "rating": "3/5",
      "review": "This is not a bad film, but definitely not an ART the Clown or Pennywise. The first 20 minutes is kinda slow and the movie really feels like it is for young adults (which books are for) and not the older mature horror crowd. It almost feels like an anthem for the youth to rebel against the older horror viewers. One of the biggest misses for me was the music. Had an excellent opportunity to throw some old 80's early 90's grunge music and new modern well known music as well. It feels like Frendo and this movie stole from Thanksgiving, Scream, and a few other horror movies. Overall worth watching, but probably not a top ten this year in a year of bad horror overall minus Sinners and Companion."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible beyond belief"
    },
    {
      "rating": "3.5/5",
      "review": "This is a type of movie I'll have in my history of movies I saw and the writer gets to the point were there is a lack a blood and a Chainsaw Massacre chase scene is on the back of my spine and this a fantastic horror movie."
    },
    {
      "rating": "5/5",
      "review": "It's just a fun slasher movie. Just relax and enjoy."
    },
    {
      "rating": "5/5",
      "review": "Nearly perfect slasher!!! Funny as hell!!!"
    },
    {
      "rating": "3/5",
      "review": "Very decent slasher, with a ok story and characters. Good kills and some that’ll make you laugh. Interesting twists too. Worth a rental"
    },
    {
      "rating": "4/5",
      "review": "Fun movie! Creative and original. Funny and scary too."
    },
    {
      "rating": "3.5/5",
      "review": "For me, the gimmick was unexpected, which gave the movie an edge. It was a decent watch, but nothing to write home about. The sudden (b)romance at the end felt completely out of left field and didn’t contribute anything to the film, it was there simply because it could be."
    },
    {
      "rating": "4/5",
      "review": "Very entertaining and it pokes fun at itself a couple of times. Well done!"
    },
    {
      "rating": "5/5",
      "review": "Incredibly fun - rollercoaster to watch in theaters. So glad I saw this"
    },
    {
      "rating": "3.5/5",
      "review": "Certainly uneven, but has so much charm! It’s genuinely laugh-out-loud funny, and has some spectacular kills. Our lead final girl has some real talent, especially when it comes to delivering comedic lines during intense situations, she made me laugh so hard throughout! The whole theatre had a blast. Give it 20-25 mins— that’s when it shifts into banger mode"
    },
    {
      "rating": "5/5",
      "review": "Great super cheesy horror movie loved it"
    },
    {
      "rating": "4.5/5",
      "review": "the clown was to scary and it scared me very evil kills"
    },
    {
      "rating": "3.5/5",
      "review": "With a higher budget this movie would have succeeded even more. Overall great for a slasher, just some poor acting and bad audio quality in most scenes."
    },
    {
      "rating": "4.5/5",
      "review": "Clown in a Cornfield hits the big screen today. It’s the perfect teen slasher to kick off summer. Bringing equal parts mystery, teen drama, and comedy. In fact, it’s a bit of a shame that they went for the R rating, given that this would be a great horror movie for most teenagers who, because of that upgraded rating, might miss out. And given that the book it’s based on is YA. There is copious swearing and gore, but nothing too scary. The movie handles the exploration of youth chafing against the status quo refreshingly and differently. The teens of this movie don’t just rebel for rebellion’s sake. They have dreams and purpose. But also a need to break a few rules because they are teenagers, after all."
    },
    {
      "rating": "0.5/5",
      "review": "Terribly overrated. Predictable, poorly acted, an underwhelming \"villain reveal,\" uninteresting characters."
    },
    {
      "rating": "2.5/5",
      "review": "Is this a bad movie, no. Is it good, let's say good-ish. This is a film that harkens back to 80's slashers with a big dose of tongue in cheek vibes. The pacing starts out slow but the way it gets going is a bit off as a few of the kills are scenes that come up as random set pieces just slapped together and inserted into the film on a whim. They are also very obvious scenes where said character will be sliced and diced. The main characters themselves are OK for the most part but are also played off purposely as cliched which fits the tone this film is going for. There are a few good funny moments here but just not enough of them. The kills are extremely lackluster for a slasher flick with most recently Thanksgiving as an example completely outshining the offings here by a mile. For those complaining this wasn't as good as Terrifier, please stop. Two completely different movies that should not in any way be compared and even so that opinion is subjective at the very least. The secret here in the plot was given away a bit too early for my liking which detracted from the final act a bit. Also once that was revealed the movie became extremely predictable, however to its credit remains a fun romp to some good tongue in cheek moments and comedy. This is not a movie that takes itself seriously, nor should it. It's a fun night out at the movies if you keep your expectations in check, especially if you think you are going to be seeing a scarefest."
    },
    {
      "rating": "4/5",
      "review": "Snappy, quirky, and entertaining. Great acting from cast. It was a pleasure to see Will Sasso on the big screen again."
    },
    {
      "rating": "5/5",
      "review": "Great Movie , Good Plot"
    },
    {
      "rating": "5/5",
      "review": "it was a fun slasher movie. book was probably better but it had it moments of scares and gore that was awesome to watch."
    },
    {
      "rating": "5/5",
      "review": "loved the book, loved the movie 🍿🤡"
    },
    {
      "rating": "2/5",
      "review": "There were things I appreciated, but there just wasn’t enough…for a bit longer than I would’ve liked.🍀"
    },
    {
      "rating": "0.5/5",
      "review": "This film is the worst horror film of 2025! As a huge fan of Tucker and Dale Vs Evil I hoped for a similar level. Sadly this incredibly weak cast and painfully predictable and transparent flop makes this film one of the biggest wastes of time ever. Everything is so obvious at every step and the very fact people mention this in the same breath as Cabin in the woods is a huge insult. The film comes across as painfully self indulgent thinking it's hilarious and so smart but the funniest thing about this film is that you gave up time of your life to watch this trash. It's not even so bad it's good, it's just Meh. I can't warn people enough to skip this film, don't fall for the self promotion and buzz articles saying it's like other great horror comedies or it's clever, it's not, it's bad and dumb and actually pretty homophobic as when 2 men kiss it prompts another character to announce \"well this is the end to a very weird day!\" Avoid this trash and thank me later."
    },
    {
      "rating": "0.5/5",
      "review": "I felt like this was a bad Amazon prime original movie which went straight video and streaming plot was weak and acting terrible movie was more funny and not scary maybe that’s the way they wanted it to be very predictable who the clowns were I would have been ok watching this free on a streaming service but not paying for it in a theatre I wanted scary not a comedy"
    },
    {
      "rating": "3/5",
      "review": "terrifier is better, dont waste your money on this crap of a movie"
    },
    {
      "rating": "0.5/5",
      "review": "Not scary or as clever as it wants to be. The first half drags on for way too long and the fake town just didn’t feel believable. It feels like this would have been more successful as a pg-13 horror because all of the “humor” is very juvenile and the characters don’t have depth."
    },
    {
      "rating": "1.5/5",
      "review": "the concept was there it could've been been so good but the main actor and a lot of the script was so bad. she does this weird mouth thing along with the way she looks at characters in the movie and I have no clue why the girl was breaking her back on the jail chair but yk. also the kissing scenes almost was trying to look like some pornio type stuff over all not a good watch."
    },
    {
      "rating": "2/5",
      "review": "A fading midwestern town in which Frendo the clown, a symbol of bygone success, reemerges as a terrifying scourge. Pros: 80's style slasher. Decent kills and gore. Cons: Predictable plot. Whiney teen characters and shitty adults made it impossible to root for anyone. The attempt at social commentary and humor all fall flat. The antagonists motivations were silly."
    },
    {
      "rating": "1/5",
      "review": "Took a fun book…… and ruined it. The entire first act felt so rushed. Zero character development. No believable relationships formed. Just laughable logic problems. Sorry why were they locked up? The book gives you a reason. The movie, not really. There’s just so much wrong with the film. Bad acting, bad storytelling, bad production design. I just reaaaally disliked this film."
    },
    {
      "rating": "4/5",
      "review": "Gory, fantastic fun that doesn’t take itself too seriously"
    },
    {
      "rating": "0.5/5",
      "review": "This was scary mess of a simplistic plot that I guessed from the very beginning in the first 15 minutes. It was stupid and I do not recommend it at all."
    },
    {
      "rating": "2.5/5",
      "review": "It gets better toward the end. Not a great horror move but had some twists and some ok gore. Acting wasn't great and most humor wasn't good. Kinda goofy but watchable overall."
    },
    {
      "rating": "5/5",
      "review": "What a movie experience! This is the elevated horror version of dead alive but with a clown. It’s absolutely a blast and extremely well made. This is a movie that punches well above its weight and a guaranteed classic and future franchise in the making!"
    },
    {
      "rating": "4/5",
      "review": "A solid, entertaining slasher flick!"
    },
    {
      "rating": "5/5",
      "review": "Love how they stayed true to the book but made the slasher aspect fun"
    },
    {
      "rating": "4.5/5",
      "review": "It was different. I enjoyed the feeling of watching an old horror film with just gore and comedy. I loved it!"
    },
    {
      "rating": "3/5",
      "review": "I had SUCH high hopes for this movie given the book was amazing and Tucker and Dale vs Evil is still my favorite slasher film of all time. If they would have stuck to the book, this movie could have been great; as it was, I thought it was just ok. The acting was decent. The plot felt rushed with the the things they decided to cut, and characters' motivations didn't feel as compelling with the changes. There wasn't enough lead time for us to start caring about the characters before they got to the \"fighting for their lives\" stage, so I didn't find myself caring over-much when/how characters died, especially when I realized they weren't sticking to the book in that aspect. Which is a shame, because I think Cesare's kills would have been just as visually thrilling and made more sense to the story. Overall an ok film, but do yourself a favor and read the book."
    },
    {
      "rating": "4/5",
      "review": "Dumb slasher fun. Beautifully shot, high production values. For a slasher, the acting is quite good. There are a few twists n turns that caught me off guard. If you love 90s slashers, this is your jam."
    },
    {
      "rating": "3.5/5",
      "review": "What could go wrong? I'm watching a movie literally titled \"Clown in a Cornfield\". I admit, I had a good time once I got past the opening scene. I'm sure it was shot as an homage to \"Jaws\", but it played like a ripoff of Chrissy running down the beach and into the cornfield, er, ocean. Basically, \"Clown\" contained the basic horror-slasher tropes (chasing teenagers, can't get the car started, etc.), but damned if I wasn't entertained. There was a lot of good here poking fun at certain tropes, like running through said cornfield away from clowns. It reminded me of the Geico spot. But my favorite, (spoiler alert) is when today's youth can't figure out a rotary phone. Big chuckle there! Overall, this is a film worth a look. I probably would rate it higher had I not seen the ending telegraped halfway through the movie. Will there be a second cornfield? Only time will tell."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was so bad i wanted to claw my eyes out"
    },
    {
      "rating": "4/5",
      "review": "Expecting a cringe horror movie, but had a story with characters. It was fun horror movie that I enjoyed. I loved the generation differences that was in the background throughout of the movie."
    },
    {
      "rating": "3.5/5",
      "review": "This flick was awesome. Such a fun time. Deff go with some friends on a weekend and have a bloody good time movie. The cast even being made up of mostly unknowns were cool. Some ideas they implemented to screen were cool. The kills were cool. It is just a fun horror movie. Reminds you of the good old days. It is exactly what it is supposed to be. It is very aware of that and executes it well. I hear people saying the reveal sucks. I did not think so. What i will say is that the movie/ reveal goes in an absolute diff direction then i thought was coming. I have never read the books. So had no idea what to expect or if the reveal is the same.] Like i said i did not see it going that way but i did not mind it. I will say, though. Once one particular scene happens. It told me everything. I knew what they reveal would be, and why. This was the most fun i have had at the movies in a while, and one of the better horror flicks of this year. Deff go check it out peeps"
    },
    {
      "rating": "5/5",
      "review": "A bloody Good time! A horror Instant classic. The slasher film for this generation. Loved that it felt very early 90's or 2000's with practical effects. We need more!!!"
    },
    {
      "rating": "5/5",
      "review": "This was a fun romp of a horror flick. Got to watch in a crowd and it was a great vibe with laughs and some scares. Will watch another time in theater while it's out. I'm a friend of Frendo!"
    },
    {
      "rating": "3.5/5",
      "review": "“Clown in a Cornfield” makes a clown out of me with a clever and mildly entertaining throwback to its seemingly traditional B-movie slasher tropes. It may not be a top-tier reflection of its commentary and formulaic narrative, and the movie's first act might take a bit to unleash its delightful chaos. However, its focus on being a fun horror-comedy mashup that’s bearable, funny, and even competent in its meta-humor makes it a worthy addition to the everlasting horror catalog. More importantly, it marks a solid start to this year’s summer of horrors amid the crowd of high-budget blockbusters. The cast was decent in their roles, and Eli Craig’s direction and script delivered a solid balance of meta-comedy and slasher gore, even if the scares were underwhelming. Despite that lack of effective frights, the film’s execution will likely make slasher fans giggle with glee like a clown for the right reasons."
    },
    {
      "rating": "3/5",
      "review": "A Lean, Mean Teen Slasher"
    },
    {
      "rating": "5/5",
      "review": "Katie Douglas is goated. Frendo is up there with the best horror clowns. And knowing there is a whole book series, I can't wait for the sequel."
    },
    {
      "rating": "0.5/5",
      "review": "Whack. Not original at all"
    },
    {
      "rating": "3.5/5",
      "review": "Went into this movie blind and it was just alright in my opinion. Extremely campy, fairly predictable, but it did have some unique plots. Sets it up to become a franchise film, don’t think it’s worth seeing in a theater"
    },
    {
      "rating": "3.5/5",
      "review": "\"Clown in a Cornfield\" is another slasher and yet another clown-based horror movie. Even though both of these things have been done plenty of times, I have to say this movie still felt enjoyable. It goes through familiar slasher moments but also has moments where it subverts expectations, which makes it a fun watch. I do think the movie feels a bit more indie, but I also think that gives it some charm, and I was impressed by how intense some moments were and how much fun it was to watch. There are moments where the acting and dialogue could have been a bit better, but this has been a trend in slasher movies since the beginning, so I'm not going to be too critical of it anytime soon. Overall, it is actually a pretty solid addition to the slasher genre, and I think it is a fun time for fans of this horror subgenre."
    },
    {
      "rating": "2.5/5",
      "review": "Not bad. Not good. Suitable slasher film for teens and young people in their early 20’s."
    },
    {
      "rating": "3.5/5",
      "review": "It really nailed the campy vibes, even more than anticipated. Quite fun slasher overall"
    },
    {
      "rating": "5/5",
      "review": "I really loved this movie, the suspense and the awesome terror and I loved everything"
    },
    {
      "rating": "4/5",
      "review": "the story was good, and the acting ok. overall, this was a fun ride."
    },
    {
      "rating": "5/5",
      "review": "Clown In A Cornfield Was my jam! Having read the book I knew what was coming & found the films way of unfolding those events really enjoyable. Real solid mix of gore & humor. The killer clown space might be crowded but Frendo finds his own refreshing path to shine!"
    },
    {
      "rating": "3.5/5",
      "review": "I thought it was really good!! There were some plot holes but literally every character was extremely hot so it made up for it 😍💕"
    },
    {
      "rating": "4/5",
      "review": "Smart, funny, and self-aware enough without pushing the edge into gimmicky. Perfect evidence that just because tropes are well-worn doesn't mean they can't still be executed well. An entertaining entry into the modern slasher pantheon."
    },
    {
      "rating": "5/5",
      "review": "Solid crowd-pleasing horror film. Surprisingly very entertaining. Had the nearly sold out screening cheering, screaming and laughing out loud. Very witty script. Horror fans check it out. This one delivers the goods."
    },
    {
      "rating": "4/5",
      "review": "They did the book justice! Acting was sub par but overall I’m happy with it!"
    },
    {
      "rating": "5/5",
      "review": "This was actually a better movie than I expected. it had a decent amount of kills. Nice story. I definitely recommend this If you like slasher, movies"
    },
    {
      "rating": "3/5",
      "review": "It was a fun movie to a degree. But I was a little disappointed halfway through it. Could've been better."
    },
    {
      "rating": "0.5/5",
      "review": "The worst slasher movie I’ve ever seen. Don’t waste your time or money. Rated R movie with the most PG-13 kills and Disney channel dialogue."
    },
    {
      "rating": "3.5/5",
      "review": "Nothing new. I’m a regular film theater goer but I wish I would have waited at home to watch this."
    },
    {
      "rating": "2/5",
      "review": "Beautiful young actors doing their best with a worn slasher theme- the deaths were gruesome and the plot followed suit- if youve got time to waste and a hankering for theatre popcorn, have at it-"
    },
    {
      "rating": "5/5",
      "review": "Movie was peak. After watching the average mess \"until dawn\", this completely made up for it."
    },
    {
      "rating": "2/5",
      "review": "It is nothing like the book wich was absolutely amazing so if u r a fan of it u r gonna be very disappointed"
    },
    {
      "rating": "3/5",
      "review": "Ummmm what the helly 😀 why did they kiss I thought they were brothers ??!? 😭"
    },
    {
      "rating": "5/5",
      "review": "Absolutely outrageous campy slashy fun!! A must see for horror lovers!"
    },
    {
      "rating": "5/5",
      "review": "So shocked by how actually good this film was. I expected it be entertained but not this much. 10 out of 10 would recommend. No notes. Great script, great cast. Perfect mix of scares and humor."
    },
    {
      "rating": "5/5",
      "review": "A throwback subversive slasher. I caught this at a special screening with no idea what to expect and was very pleasantly surprised. It's not exactly \"scary\" but it's got great kills and some very very funny lines. Definitely a movie to see in a jampacked movie theater. Loved it."
    },
    {
      "rating": "5/5",
      "review": "Clever kills to be modest, gore and comic relief, this smart horror film pokes fun at society, its jokes hit at the heart of our culture. Only we can laugh at we and we are all screaming and laughing. The Director nails it with the subtle touches you see throughout... Some people might miss how smart this one is. A must see over and over."
    },
    {
      "rating": "5/5",
      "review": "Going to see as soon as it comes out very exciting"
    },
    {
      "rating": "5/5",
      "review": "Definitely can't wait to go see"
    },
    {
      "rating": "5/5",
      "review": "Everything is gonna be so exciting and crazy I can’t wait to see who is able to come out the night alive and survive this crazy assss clown"
    }
  ]
}