{
  "movie_name": "Transformers: Revenge of the Fallen Reviews",
  "reviews": [
    {
      "rating": "4.5/5",
      "review": "One of the best Action Movies of all time. Underrated and waaay to overhated.."
    },
    {
      "rating": "2.5/5",
      "review": "Average at best. Typical Michael Bay."
    },
    {
      "rating": "5/5",
      "review": "Unlike most this is my favorite movie, the end fight, the forest fight with Megatron, the story and buildup, love it all, 10/10"
    },
    {
      "rating": "3/5",
      "review": "Skidz and mudflap was still the funniest part of the movie"
    },
    {
      "rating": "5/5",
      "review": "These reviewers are trippin. This movie is almost peak. Its like #1 but even better. Deviststors so cool bro what the crud 9.8/10 Joshy Boy 6,000's sigma movie award:🗿"
    },
    {
      "rating": "1.5/5",
      "review": "Filme bacana, o roteiro é bacaninha, o elenco é bom, e alguns melhoram o filme, as cenas de ação são bacaninhas, os personagens que pouco renderam para o filme, e a história foi mais ou menos, e o filme poderia ter cenas bem melhores."
    },
    {
      "rating": "3/5",
      "review": "The CGI is amazing but really what revenge is the fallen getting and also too much sex and balls"
    },
    {
      "rating": "2/5",
      "review": "great cgi but doumb villan tomeny nuts jokes and not enuf octimus prime but a decent plot and megatrons disin is the 2 and that best keep it frum a 1 star"
    },
    {
      "rating": "0.5/5",
      "review": "The whole movie is basically a nightmare. Shia Lebeouf making creepy faces and female robots disguised as humans who seduce men. You have to wonder why anyone gives Michael Bay a cent for how he butchers the Transformers mythos."
    },
    {
      "rating": "1/5",
      "review": "The plot doesn't make sense, too much screen time about humans (not enough about the robots) and Bays sexual preferences. Action is good and I love the transformations. Can't really recommend, don't want to watch again."
    },
    {
      "rating": "2/5",
      "review": "Meh, to sexual, otherwise good"
    },
    {
      "rating": "2.5/5",
      "review": "'Transformers: Revenge of the Fallen' is much like the original for me, in that I never got hooked into what was being portrayed in front of my eyes; I was more just processing the events, rather than actually absorbing anything. Don't get me wrong, neither flicks are bad, just not good in my opinion. I personally have a hard time differentiating all of the robots, even main dude Optimus Prime. Their designs aren't eye-catching to me, I don't feel like I'm looking at anything other than metal and tiny little light up eyes. The wall-to-wall action doen't help either, what with them just clattering into each other constantly. With that said, the aforementioned carnage does help in regards to the pacing and run time. 150 minutes is way too long, though to be honest it flows well for a movie of that length and I was never desperate for the end credits to arrive. I just wasn't properly enjoying myself at any point. Shia LaBeouf works, a competent and well chosen lead no doubt. Megan Fox really is only there to look beautiful though, eh? No dislike directed at Fox at all, more so at those responsible for the lack of tangible character development offscreen. The rest of the cast are alright, Tyrese Gibson is quite underused though. The voice cast are slightly better than those behind LaBeouf/Fox. I watched that first film just over five years ago, I hadn't realised until recently that they had made seven (!) of them; plus that bonus one last year. As if I'm going to watch them al... of course I am. I'm bound to like at least one, right?"
    },
    {
      "rating": "5/5",
      "review": "Transformers 2 is a really fun movie, one of the best fun movies in the world"
    },
    {
      "rating": "3/5",
      "review": "The second installment of the Bayverse Transformers movies comes as an underwhelming mess. The movie is all over the place and rewrites the lore in the original constantly, while killing off and keeping one of the greatest characters of the franchise out of the film for most of the runtime. The humans are also in it more than almost any of the Transformers, there are parts of the plot that are completely unnecessary and out-of-the-blue, and the movie feels clunky in general. However, the visuals are still absolutely amazing as usual, it is still a very funny film, the sound design is just as good as the first, and there are moments in this movie that makes the watch worth it. The first half of the movie, in my mind, is better than the second half, but the last battle of the movie is also very good. It really is just a big mess with good moments between the bits they didn’t know what to do with."
    },
    {
      "rating": "4/5",
      "review": "A little bit better than the first"
    },
    {
      "rating": "2.5/5",
      "review": "This is one of those movies that every family had and probably hated it,I don’t think it’s that bad it definitely has some of the best action sequences in the movie franchise (Forest Battle,Desert Battle) but holy moly the sex jokes are so unfunny this film wastes so much on Sam’s college drama to the point where this film feels like the worst in the series but then theirs so many moments that make it one of the best overall:Revenge Of The Fallen could’ve been good but was held back by not having a script,Unfunny jokes,Horrible Villain,(sometimes) Bad Acting the only thing holding it up are the actual transformers and Simmons and Leo (those 2 are great together we need a spin-off)"
    },
    {
      "rating": "1.5/5",
      "review": "I would give this no more than a 48% and no less than a 35%. Movie had so much potential. It’s good if you’re a fan but if you’re not and just watch it then it would be MID at most. Lots of scenes which seemed straight up unnecessary. Storyline is bad and could have been way better. It was very in your face and lots of things going on at once."
    },
    {
      "rating": "4/5",
      "review": "You have to understand the story to understand the movie. It was good"
    },
    {
      "rating": "3/5",
      "review": "It was ok. The storyline was too much. It was enjoyable, but not a good storyline. I would give it a 54%"
    },
    {
      "rating": "3/5",
      "review": "I kinda liked this movie. but you didn't know what was goin' non"
    },
    {
      "rating": "2.5/5",
      "review": "This movie was a mess, story was all over, action was and CGI was so muddled you couldn't tell who was fighting who. Human transformer is all you need to know that this was a terrible sequel. Oh, and Transformer Heaven that Sam was able to go to..."
    },
    {
      "rating": "2/5",
      "review": "A downgrade from the first movie. The acting is very weird and the story is very messy. But the cgi and action makes it another fun time."
    },
    {
      "rating": "1/5",
      "review": "Liked the movie, the CGI was great! I thought the robots were really cool. The sex scenes between the two army men were pretty fucking weird? What does that do with transformers? At least the skeleton was kinda cool."
    },
    {
      "rating": "4.5/5",
      "review": "A great follow up to the 2007 film. Although a little long of a movie it is it's still a Worthy sequel. Tim Treakle"
    },
    {
      "rating": "3.5/5",
      "review": "This is the only film that I remember out of the transformers movies ."
    },
    {
      "rating": "2/5",
      "review": "This movie is so needlessly silly in so many scenes with so many characters and it would've been so much better if it was more serious and even made to make more sense in so many different scenes. The first half of the film is so cringe and plus, Sam and his girlfriend survive way too many explosions toward the end while trying to get to Optimus to revive him. The humor landed maybe only 5-10% of the time. In a positive note though, the actual transformers and fights/action between them were pretty cool and the production and look of the film is high quality, I am more than willing to give Michael Bay and his team credit for that. Really quality CGI and special effects. Toward the end it was undoubtedly entertaining! Overall though While not all bad, not as good as Dark of the Moon or the first installment. Too unnecessarily stupid."
    },
    {
      "rating": "3/5",
      "review": "Transformers Revenge of the Fallen is clearly not good.A couple of characters just get on your nerves and Fallen is a really bad villian but as silly,fun guilty pleasure it works.The CGI looks very good once again as with its predecessor.The final battle in Egypt is intense.As fun trash the movie is actually entertaining.I have a soft spot for Revenge of the Fallen but its definitely not a good movie."
    },
    {
      "rating": "3/5",
      "review": "There hasn't been this much guttural screaming since I sat down to watch 10 cloverfield lane, which is one of the worst movies I have ever seen. Sweet cars and megan fox rules though. I appreciate that Sam Witwicky and I share a love for the original cloverfield movie, my head canon is that Mr. Witwicky passed before having to see 10 cloverfield lane because I think he too would have thought it was bad (Outside of John Goodman's stunning performance)"
    },
    {
      "rating": "2.5/5",
      "review": "The movie lacks consistency and there are certain scenes which go on for far to long and certain scenes that deserve double the time."
    },
    {
      "rating": "4.5/5",
      "review": "Direção: Bom Atuação: Bom Roteiro: Ok Caracterização: Bom Soundtrack: Bom"
    },
    {
      "rating": "2.5/5",
      "review": "The designs, the special effects and (some of) the fights look great, the issue? the script, it's like it was put together by a 5 year old that doesn't know how teens act and doesn't have a fucking clue as to how to make a compelling story, I literally just watched it for a fight scene which was dissapointing at best, the fight was Optimus Prime vs Megatron and The fallen (who is supposed to be the big bad). The fight is absolute garbage in comparison to Megatron's fight in 2007 since The Fallen got absolutely destroyed as soon as Optimus got a little upgrade and dies with Optimus giving us a bs line \"I rise, you fall.\", what were they thinking whilst making this? Hopefully the sequel to Rise of the Beasts isn't as bad as this."
    },
    {
      "rating": "2.5/5",
      "review": "Michael Bay's direction is bad, the fight scenes are chaos and many times you can't understand what's happening or even differentiate the robots, but it's a movie that I like because of the cars, the music, the explosions, and some memorable scenes, but the script and direction are bad."
    },
    {
      "rating": "4/5",
      "review": "A decent movie. 7.3/10"
    },
    {
      "rating": "4/5",
      "review": "Una película increíble, en efectos especiales y escenas de acción, como dijo Michael Bay acertadamente, la película es \"diversión buena y sana\"."
    },
    {
      "rating": "3/5",
      "review": "film with a lot of action and epic moments but with a slightly weak story"
    },
    {
      "rating": "2/5",
      "review": "If you only watch the first 45mins, and the last 20mins, you'll catch all you need to from the movie's story to be able to make sense of it. The poorly constructed, lengthy second instalment to the Transformers franchise doesn't come close to the impact made by its predecessor. Boring and at times tedious"
    },
    {
      "rating": "1.5/5",
      "review": "The movie focus way to much on the humans"
    },
    {
      "rating": "3/5",
      "review": "I forgot almost everything in this movie. The only thing I remember is the forest battle."
    },
    {
      "rating": "4/5",
      "review": "I wish we could get more bad good transformer movies from the bayverse"
    },
    {
      "rating": "1/5",
      "review": "so much potential, wasted."
    },
    {
      "rating": "2.5/5",
      "review": "For the most part, Transformers: Revenge of the Fallen misfires by adding unnecessary, concerning humour and an over long runtime that doesn't help the film develop. However, the high octane action and visual effects make this film worth one watch. Rating: 42% 🟢"
    },
    {
      "rating": "1.5/5",
      "review": "Transformers: Revenge of the Fallen is a staggering misstep in the franchise, epitomizing the worst excesses of modern blockbuster filmmaking. The convoluted plot is nearly impossible to follow, drowning in contradictory storylines and unnecessary subplots that leave viewers bewildered and frustrated. The titular villain, The Fallen, suffers from horrendous character development; his motivations for exterminating humanity are flimsy and poorly articulated, rendering him unthreatening and forgettable. Shia LaBeouf delivers a solid performance as Sam, capturing his character's youthful energy and determination, yet his efforts are largely undermined by an atrocious script that feels hastily written and riddled with cringe-worthy dialogue. The military characters serve as average archetypes, contributing little to the narrative's depth, while Megan Fox's character is disappointingly sidelined, lacking agency and purpose. The film's tone leans heavily into crude humor and sexual innuendo, creating an uncomfortable sense of horniness that permeates nearly every scene. This is epitomized by the bizarre moment of Wheelie humping Mikaela’s leg, which distracts from the plot and undermines any seriousness. Adding to the overall weirdness is the female character who transforms into a robot; her overtly sexualized presentation feels jarring and gratuitous, amplifying the film's unsettling sexual undertones. Even more perplexing is the depiction of robot testicles, which contributes to the film's strange fixation on crude humor and objectification. Instead of enhancing the narrative, these elements create a disorienting atmosphere that suggests the filmmakers prioritized shock value over coherence. While the Autobots’ voice acting remains a bright spot, consistently delivering strong performances, it cannot salvage the film’s numerous flaws. The humor largely falls flat, relying on desperate gags that lack wit, and characters like Leo, played by Ramon Rodriguez, are more irritating than entertaining. The twin characters further exemplify cringe-worthy racial stereotypes that detract from the viewing experience. Amidst this chaotic mess, the one redeeming aspect is the forest battle featuring Optimus Prime, which stands out as a rare moment of clarity and excitement. Ultimately, Revenge of the Fallen stands as the one of worst Transformers movie and an insult to the franchise's legacy that leaves viewers yearning for a more coherent, respectful, and engaging narrative."
    },
    {
      "rating": "1/5",
      "review": "That movie sucks just like the first one."
    },
    {
      "rating": "3/5",
      "review": "Another trip to a world full of non stop action that's even messier than the first. LaBeouf, Fox, and Duhamel led the movie just fine, but had NO character growth whatsoever. The Sound Design, and Art Design was still impressive. The Crass Toilet, and Sexual Humor was very unnecessary. I'd thought I'd hate it, and I didn't, but I'll probably never watch it again. D"
    },
    {
      "rating": "3/5",
      "review": "The movie could of been better, maybe making it shorter and removing some parts that didnt need to be there but outside of that I still enjoy it and it's very nostalgic since this was when the franchise peaked"
    },
    {
      "rating": "5/5",
      "review": "Transformers: Revenge of the Fallen is an action-packed spectacle that amps up the excitement with bigger battles, stunning effects, and relentless energy. Michael Bay delivers a movie that's pure adrenaline, with jaw-dropping scenes that push the boundaries of what blockbuster entertainment can be. The film’s global scale and epic confrontations between Autobots and Decepticons make it a thrilling ride from start to finish. While some may criticize its chaotic pace, Revenge of the Fallen embraces its wild side, delivering exactly what fans crave—non-stop action and mind-blowing visuals. It’s a rollercoaster of epic proportions that never lets up!"
    },
    {
      "rating": "5/5",
      "review": "I think over the years every time I've seen it it never gets old for enjoy it every time"
    },
    {
      "rating": "4/5",
      "review": "I remember this whole movie like the back of my hand, especially that girl she cannot compare to Megan Fox😂😂😂… Optimus prime no but I’m glad he’s back. I love this cast so much."
    },
    {
      "rating": "5/5",
      "review": "Me gusto mucho el combate final, aún que si hubo muchos agujeros"
    },
    {
      "rating": "5/5",
      "review": "Pretty Great Sequel after Transformers 1"
    },
    {
      "rating": "0.5/5",
      "review": "Hard to stay awake, bad story, worse acting"
    },
    {
      "rating": "4/5",
      "review": "We all get it: The movie has bad writing and plot of the story... But can't say no to The CGI, The CGI is amazing and brilliant than Marvel or DC somehow. Love the CGI, but it is ridiculously long."
    },
    {
      "rating": "3.5/5",
      "review": "The forest fight alone makes this movie worth it. But this movie has too much human story going on, not enough robots."
    },
    {
      "rating": "5/5",
      "review": "I love this movie so much 10/10"
    },
    {
      "rating": "2.5/5",
      "review": "No está buena pero está entretenida aparecen personajes que no conocemos"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this can we bring back Mr Labouf please Hollywood I say please bring him back , I often find myself watching this over and over Excellente is all I can say about this one."
    },
    {
      "rating": "5/5",
      "review": "Great Sequel For My Type"
    },
    {
      "rating": "0.5/5",
      "review": "The sequel to 2007's Transformers is rather dull and forgettable story with little narrative structure, uninteresting characters that shared no signs of development and some rather awkward sequences and editing."
    },
    {
      "rating": "5/5",
      "review": "First Of All The Soundtrack Is Awesome! I commend this movie for being made through the great WGA Strike in 2009 and this movie had to get rushed out but I Enjoyed this movie a great amount and it's better than the first. Shia LaBeouf is incredible and the humour is on point. The CGI is still great and Leo & Agent Simmons are funny in this. Overall Transformers: Revenge of the Fallen is an amazing Sequel which needs more love because this movie gets The Amazing Spider-Man 2 treatment."
    },
    {
      "rating": "3.5/5",
      "review": "This film still shares the same tone and atomosphere of its predecessor, but lacks its eumph. The plot is not very uniform throughout, due to the writer's strike that went down at the time of its production, but still interesting enough to follow. The effects and action are, as always, brilliant and riveting. The titular villain of this film is also a treat. Overall, this film is the least of the original Transformers Trilogy but still miles better than both Age of Extinction and The Last Knight."
    },
    {
      "rating": "2.5/5",
      "review": "No creí que fuera a sentir algo de nostalgia al volver a ver estas películas, pero me trajo muchos recuerdos y sentimientos de cuando terminaba de ver estas películas en el cine con Linkin Park en los créditos, se sintió bonito."
    },
    {
      "rating": "4/5",
      "review": "Good follow up, plenty of action"
    },
    {
      "rating": "3/5",
      "review": "It was a very dragging movie, but it was a cool story, that was just somewhat flawed, as well as there being a lot of bad side characters like the ugly twins, who where flawed by there bad character traits."
    },
    {
      "rating": "2.5/5",
      "review": "despite it being my 2nd favorite transformers movie this was a kick to my ass and was a very mid movie but the final battle in Egypt was the only good part of the movie also I was traumatized by Sam getting raped by a decepticon like what the F***!!"
    },
    {
      "rating": "2.5/5",
      "review": "The actions are amazing, the script is not very good but it's still worth to watch in my opinion"
    },
    {
      "rating": "3.5/5",
      "review": "Round 2!! Epic, fun, and a perfect new installment for the Transformer franchise."
    },
    {
      "rating": "3/5",
      "review": "Non-stop sci fi action between the heroic auto-bots allied with humans against the bad auto-bots. A bit long, but special effects all the way."
    },
    {
      "rating": "3/5",
      "review": "Eh. I don't hate it and I don't love it. The story in production went through hell and back and it shows. There isn't a lot here as far as legitimate movie stuff goes. Don't watch it if you're expecting a great \"movie\" movie. BUT, the forest fight scene is amazing and is peak action in the franchise. If you watch this, only watch it for that fight."
    },
    {
      "rating": "1.5/5",
      "review": "Lacking a narrative structure other than explosions here, explosions there; \"Transformers: Revenge of the Fallen\" is passable at best."
    },
    {
      "rating": "4/5",
      "review": "9/10 criminally underrated"
    },
    {
      "rating": "1.5/5",
      "review": "Transformers: Revenge Of The Fallen is the sequel that is nothing but a time waster, all of the heart, empathy & action-packed adventures of the first film were certainly long dead."
    },
    {
      "rating": "0.5/5",
      "review": "As if a 12-year-old had written the script and directed the movie."
    },
    {
      "rating": "3.5/5",
      "review": "It wasn't that good compared to the first and third but it was worthwhile. I really liked the filming locations and the idea that transformers co-existed with us many years ago."
    },
    {
      "rating": "2/5",
      "review": "Humor me what is the significance of Leo Spitz's character in this sequel? Also I thought this is a transformers movie, not a soap opera scenario. LMAO"
    },
    {
      "rating": "4.5/5",
      "review": "A lot of good fights in this movie, although I did hear it was a bit rushed."
    },
    {
      "rating": "2/5",
      "review": "The storyline was terrible, but cool special effects!"
    },
    {
      "rating": "4/5",
      "review": "Good................"
    },
    {
      "rating": "3/5",
      "review": "Similar pros & cons with Transformers 2007. For a movie subtitled \"revenge of the fallen\", the fallen is barely in this movie!"
    },
    {
      "rating": "1/5",
      "review": "It's long, it's boring. Human characters are written poorly, unneeded scenes, not funny, and very extreme stereotypes. Did I mention a Decepticon had a penis, and another had balls?"
    },
    {
      "rating": "3.5/5",
      "review": "Mediano. A história deixa a desejar. Algumas cenas forçadas"
    },
    {
      "rating": "1/5",
      "review": "Worst Transformers movie and one of the worst films I've ever seen in my life."
    },
    {
      "rating": "5/5",
      "review": "this is my 3rd favourite transformers movie ever and its probably the funniest one of all 9 movies,and the characters,plot,pacing and everything was perfect"
    },
    {
      "rating": "3.5/5",
      "review": "This film's biggest problem is it was written during a writers strike, inferior to the first film, but enjoyable to watch. Thank God we got Bumblebee and Rise of the Beasts"
    },
    {
      "rating": "4/5",
      "review": "Revenge of the Fallen is probably the most memorable installment in this franchise for me as I probably watched this movie more than the first as we dive more into the lore of Transformers and find out that they've been on Earth for centuries. One of the reasons I think I loved this movie so much as a kid was because this movie had that adventure aspect added to it with finding the Matrix like it was Indiana Jones while also keeping that military movie kind of tone. This movie definitely got more cheesy when it came to the college scenes which I remember laughing so hard at as a kid but now I might chuckle and cringe a little. This is also the first Transformers movie where I genuinely felt scared for the characters as I cried twice while watching this movie as a kid, when Optimus was dying and when Sam almost died. I also was terrified when it came to Rampage for some reason, and as I'm now older, I still feel the threat and the tension that I felt when I was 6 years old. Some of the kills in this movie as well are just ruthless, especially when Optimus is resurrected. But again, I think this movie was just a little too cheesy, especially with the twins mudflap and skids who I didn't even think were funny as a kid. Overall, Transformers: Revenge of the Fallen is another awesome installment in the franchise in my personal opinion as the story is captivating and keeps you invested, while also making you feel the threat level within the story as there are some jaw-dropping visuals within the movie with a badass one-liner from Megan Fox that I died for as a 6 year old. This movie might not affect others like it affects me, but that's okay because Revenge of the Fallen in my opinion gets an A-."
    },
    {
      "rating": "2.5/5",
      "review": "Not terrible, yeah story isn't good, but it s entertaining"
    },
    {
      "rating": "5/5",
      "review": "Best movie I have ever seen!!"
    },
    {
      "rating": "3.5/5",
      "review": "I recognize that many people didn't like it, but I don't really see why. Albeit it's not as good as its predecessor, it's still an enjoyable watch."
    },
    {
      "rating": "3/5",
      "review": "It could've been better"
    },
    {
      "rating": "4/5",
      "review": "Great movie. Enjoyed it so much!"
    },
    {
      "rating": "4/5",
      "review": "This movie was was good I just think the first one was better."
    },
    {
      "rating": "3.5/5",
      "review": "Better than the first film I think. Just the same problem as the first, it's WAY too long. The CGI is REALLY good especially for 2009! I probably wouldn't recommend these films unless someone loved the transformers cartoon from the 80s or loved these films"
    },
    {
      "rating": "4/5",
      "review": "Now: 8/10. 85/100. | As a Child: 8/10. 88/100"
    },
    {
      "rating": "0.5/5",
      "review": "I came in hoping for 7689 explosions and I only got 7688 explosions."
    },
    {
      "rating": "2/5",
      "review": "Barely three star I liked it but the action got a little worse from the first . the characters got more annoying but the cgi and story are relatively the same"
    },
    {
      "rating": "1.5/5",
      "review": "Very stupid. The only plus in the film is the forest battle. Fallen doesn't even look like a villain"
    },
    {
      "rating": "5/5",
      "review": "This movie was sick! Fricken Megatron Megatronning all over the place inside of Optimus's mouth and then Optimus gains black power and messes up The Fallen. Was the writing bad? WHO CARES? I DON'T! Who watches a Michael Bay movie for its writing? Nobody should. This movie has the best action of all the Transformers movies because they didn't care about the writing most likely due to the writers strike that was happening at the time. Beautiful movie overall."
    },
    {
      "rating": "3.5/5",
      "review": "This movie would have been better if it wasn't written during the writer strike. But it's the action that stands out."
    },
    {
      "rating": "2.5/5",
      "review": "It's alright I would only watch if you're watching all the transformers movies"
    },
    {
      "rating": "0.5/5",
      "review": "Michael Bay Ruined Transformers, none of his transformers movies are good"
    },
    {
      "rating": "2/5",
      "review": "Transformers: Revenge of the Fallen is an overblown and disjointed mess that sacrifices coherent storytelling for excessive action and juvenile humour, leaving viewers frustrated by its convoluted plot and (once again) needless over-focus on human characters, making it a disappointing entry in the franchise."
    },
    {
      "rating": "1/5",
      "review": "Transformers 2 è pieno di figa, effetti speciali ed esplosione, ma manca dell'unica cosa che conta veramente: il cinema"
    },
    {
      "rating": "5/5",
      "review": "Its actually my favourite movie to date. I enjoy movies that are less think and of a deep plot but with good action and with enjoyable and inetersting characters. Revenge of the Fallen was filled with many action scenes, and also had many interesting plots that amde it a good transformers movie."
    },
    {
      "rating": "1.5/5",
      "review": "flat out bad just stick to the first movie i remember seeing this in theaters its just a bunch of noise waste of time."
    },
    {
      "rating": "2/5",
      "review": "It has some things going for it, but there's so much that just does not work."
    },
    {
      "rating": "3/5",
      "review": "Simplemente es muy disfrutable"
    },
    {
      "rating": "4/5",
      "review": "Great sequel. The Optimus fight scene in the woods is peak Transformers action."
    },
    {
      "rating": "2/5",
      "review": "Fico me perguntando o que leva um estúdio ou atores aceitarem um papel num filme como esse. Todo errado, desde as cenas explicativas aos novos personagens, passando pelos conflitos chatíssimos dos já mostrados no anterior. Como se não bastasse, viagens absurdas pelo mundo, direção esquizofrênica, robô que solta pum e humano que vira robô. Que delírio!"
    },
    {
      "rating": "1.5/5",
      "review": "Com a greve dos roteiristas em seu auge naquela época, Trasnformers 2 é possivelmente um dos piores filmes de sua década, seja pelo roteiro horroroso ou pela direção confusa e sem graça, nada parece ter salvação aqui. Como citado anteriormente, é inegável que a greve dos roteiristas afetou na produção desse filme, no entanto, também é inegável que Michael Bay pouco se importou em fazer o melhor pelo filme, pois grande parte dos problemas aqui são culpa dele. Nem mesmo o elenco se salva, com raros momentos engraçados, a história nos envolve em situações de pura breguice, cheio de cenas vergonhosas e nada inspiradas. O terceiro ato é uma tortura de se assistir, além de ser totalmente frenético, não da pra entender praticamente nada por conta dos cortes excessivos e explosões a cada 2 segundos."
    },
    {
      "rating": "1.5/5",
      "review": "I think the Idea wasn't even that bad ,but it was almost the same Movie as the first but even worse ,I mean if u wanna see farting and horny Transformers then u would like it but no gonna rewatch ,way too long"
    },
    {
      "rating": "2.5/5",
      "review": "I'm not sure what happened with the script, but fell short of the first. Great action, but hollow humor simply doesn't work. Sad to see this sequel get this shallow treatment."
    },
    {
      "rating": "1.5/5",
      "review": "Forgets basically anything that made the first movie fun by increasing the negative aspects of practically everything and having it last even longer."
    },
    {
      "rating": "5/5",
      "review": "Even better robot death fights then in the first film"
    },
    {
      "rating": "2.5/5",
      "review": "A movie that doesn't compare to its prequel. The lazy writing, the horrible comedy, and overall hard to follow plot, this movie doesn't bring much besides the Transformers."
    },
    {
      "rating": "4/5",
      "review": "Another great follow up to the original. although not as good as the other movies, it's still a blast, I love that they're going to a completely different environment as before with Egypt. Great Music as always, the human characters are a lot of fun and tells a more focused story . 8.5/10"
    },
    {
      "rating": "5/5",
      "review": "Revenge of the Fallen is my favorite movie, as it was the last I saw with a friend, who later died of cancer."
    },
    {
      "rating": "5/5",
      "review": "Transformers Revenge of the Fallen, what an incredible movie! It's tremendous, folks. The Autobots and Decepticons are back, and they're bigger and better than ever. The special effects are absolutely fantastic - explosions, robots transforming, it's like nothing you've ever seen before. Optimus Prime is a true leader, a real winner! The action is non-stop, and it'll keep you on the edge of your seat. A must-see for all who love action-packed entertainment."
    },
    {
      "rating": "0.5/5",
      "review": "I'm the kind of person who gets hooked into any movie, always has to see the end, when there's a TV on in the background, I struggle not to get drawn on - and I've never fallen asleep in front of the TV. Yet despite watching this at the cinema, during the day, I actually struggled to stay awake. Worst film I've ever seen in a cinema for sure, possibly anywhere. The plot is just a toy used to loosely string together endless action scenes, and despite most of the movie being light-hearted they suddenly try to change the whole tone at the end for this emotional finale that just falls painfully flat as a consequence. How does Michael Bay get to make movies? I'll never know. I could've done better - I really mean that."
    },
    {
      "rating": "5/5",
      "review": "The best Transformers movie ever made hands down"
    },
    {
      "rating": "5/5",
      "review": "as i watched this absolute piece of cinema history, slurping on my milk with ice, i got into a heated debate with my friend (now enemys) on the ethics of clone intercourse. if you had a clone, would you have soft taccos with it? put your answers in reviews."
    },
    {
      "rating": "5/5",
      "review": "Can this film get a little raunchy with comedy.. sure. However. Whenever I watch this movie. It's way darker and emotional then people give it credit for. It's an action packed adrenaline ride with a great musical score. And not to mention how suspenseful the film is with terrifying elements. Lots of death in this film like humans, and autobots both. Definately love whenever this film is serious. Awesome movie."
    },
    {
      "rating": "2.5/5",
      "review": "While the robots still look as good as ever and the film has some exhilarating action sequences, Transformers: Revenge of the Fallen is often too loud, annoying and thinly plotted."
    },
    {
      "rating": "3/5",
      "review": "it is alright. the only thing that makes this movie watchable is the forest battle, everything else is a little boring and stupid"
    },
    {
      "rating": "5/5",
      "review": "The cgi was awesome! Super underrated"
    },
    {
      "rating": "3/5",
      "review": "I really wanted to like this sequel, the first hour was amazing, but then the momentum falls apart and the story drags into a messy cgi finale. I would have appreciated a tighter movie, with more focus on Sam and Micheala, and the bots. Twins were wayyyy too annoying. The fallen felt like a cardboard cutout with his quick dismissal, and Megatron too. Bay has a problem with ending these battles in a satisfactory manner."
    },
    {
      "rating": "4/5",
      "review": "For a sequel it was great. Better edition than most with lots of funny parts and action galore. It's a Sci-Fi alien movie."
    },
    {
      "rating": "2.5/5",
      "review": "Though nowhere near as bad as some of the franchise's latter installments, \"Transformers: Revenge Of The Fallen\" is most certainly inferior to its predecessor, what with its grating humor, confusing plot and a third act that's just absolutely devoid of any memorability. My issue with Michael Bay's direction in this is the action, of course. It's just so difficult to trace what's going on for the bulk of every set piece. So many Transformers are thrown our way in this one that it left me feeling like a 55-year-old dad taking his kids to see this. \"Which ones are the Decepticons again?\" \"Who's shooting at who?\" \"Is that Megatron or Starscream onscreen right now?\" Every action scene feels needlessly impersonal, with so many repeated beats and visual cues. I cannot tell you how many times characters will run towards the camera in slow motion, with explosions/Transformers following them from behind. All that said, there's some charm here and there — all of it mostly nostalgia-based, by the way — and a few impressive effects (considering this thing is nearly 15 years old now). Make no mistake, though, this is bottom of the barrel fare and not what blockbusters should be like."
    },
    {
      "rating": "3.5/5",
      "review": "10 years ago when CGI battles were not as common it was quite good. Nice CGI, hot actresses, simple and easy to follow plot and some jokes sprinkled on top and you had a nice movie for teenagers. Unfortunately the movie aged poorly and CGI gets you nowhere these days."
    },
    {
      "rating": "4/5",
      "review": "It had flaws to the movie but I loved the movie and the action scenes"
    },
    {
      "rating": "3.5/5",
      "review": "Ok even with all the flaws in this movie. I gotta say this is one of my guilty pleasures."
    },
    {
      "rating": "3.5/5",
      "review": "great start but the pacing was slow"
    },
    {
      "rating": "5/5",
      "review": "The greatest 02 hours: and 29 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "1.5/5",
      "review": "Transformers: Revenge of the Fallen has a couple great moments. But apart from that, there's nothing else good. From racist autobots, to outright unnecessary scenes, this film is a robotic mess. Rating: 27% Action: 7/10 Comedy: 1/10 Horror: 2/10 Drama: 2/10 Suspense: 2/10"
    },
    {
      "rating": "3.5/5",
      "review": "A mixed bag. It has some really unnecessary things but has some great moments. However, it's a great popcorn film. PROS: -Like the first film, amazing VFX, especially when Devastator assembles! -Awesome actions scenes, some of my favorites are Prime fighting Demolisher, the forest fight and Prime vs The Fallen. -Some humor was pretty good. -Some human characters are pretty good. -Transformer characters are awesome, new and old, and some new ones have some cool and unique looking designs -Awesome sound design. -Great soundtrack as well as Linkin Park being a great addition. CONS: -Story is pretty messy -Lots of unnecessary scenes, mainly relating to humor, speaking of humor… -Lots of humor missed, lots of unnecessary jokes and sexual innuendos that really no one cares about or comes out disgusting or immature. -Casual viewers may have trouble following what's going and have difficulty identifying who is who (a simple sentence of advice from Captain America: \"If they're shooting at you, they're bad.\") -Some Transformers were wasted, most notably The Fallen (which is saddening cause I really liked him)."
    },
    {
      "rating": "2/5",
      "review": "Bigger and (most certainly) badder than then its predecessor, Transformers: Revenge of the Fallen is a noisy, horny mess full of over-bloated exposition and a blasphemous plot that destroys everything previously built upon."
    },
    {
      "rating": "5/5",
      "review": "This movie was pretty good. It had a lot of action impressive CGI and it was really action pack, enjoyable. I really enjoyed this movie one of the best transformer movies I ever watched the story and the plot we're OK. But I really enjoy it. It holds up for the time. The final battle at the end was pretty cool and all of the designs that they've put into. The characters are pretty cool in my opinion, and how they introduce some of the newer characters."
    },
    {
      "rating": "4.5/5",
      "review": "This movie have good-great action. Great-perfect acting/voice acting. It has good CGI. Megatron was weak in this movie it's like every movie after TF 1 Prime gets 50x more powerful but I did like The Fallen he was powerful. I liked the writing. Story/plot was perfect. Great casting. I loved Jetfire, Sideswipe, and The Fallen. Adventure was really good. I love the ending it's the best part Jet Power Optimus Prime, his speech, and the final fight. IDK why a lot of people don't like this it's a very good movie."
    },
    {
      "rating": "2.5/5",
      "review": "It's amazing given the amount of explosions, gunfire, hot women, and robot mortal combat how boring this gets. This is badly paced in a uniquely Bayish way. There is so much action that drags scenes out and when you get to the ending you've already seen so much of it that you just stop caring and want it to end. On top of that we've already seen a lot of the fight scenes before in the first one, so its nothing new on top of that. The editing is not good either. The first half feels like a coming of age college comedy that is completely out of place with the rest of the plot. This film also lacks a focused character to keep the story focused. Prime & Sam kept the first one focused the whole way. By the last 20 minutes I had no idea who was the main characters. The oversaturation of action scenes and unfocused plot is not helped by acting that is ok but a step down from the first. Sam isn't as charming as he was in the first with some dumb brain blast scenes, Megan Fox basically has no character in this aside from breaking up and getting back together again while looking hot, and the soldiers from the first one barely have any screentime and are barely focused on. The new characters aren't that interesting especially his roommate Leo and lack any depth. None of the jokes in this work either as their all juvenile sex jokes or the two new autobots who are supposed to be comedic relief. There is no chemistry really in this either between anyone and not really any character development for a sequel. It's just the Transformers fighting again for a energy source. finally the cinematography is ok with very forgettable locations, dumb scenes like dogs & robots humping, and action scenes that are so numerous you lose track of all the action scenes. The special effects which were incredible in the first are still decent here but the lighting isn't as good and some of the effects you can tell they just wanted to try and top the first one and get mixed results. The plot is basically a retelling of the first in a sense and the new villain is forgettable. Skip This and stick to the first one."
    },
    {
      "rating": "1.5/5",
      "review": "this is what happens if you let some guy like bay make a movie without a script"
    },
    {
      "rating": "3/5",
      "review": "I didn't have high expectations for the first movie given prior Michael Bay movies, but I was pleasantly pleased by its visually arresting storytelling and well crafted characters. Unfortunately, there was a serious chemical imbalance in Revenge of the Fallen. Unfortunately, this sequel's fight scenes were only longer, louder, and less inventive than the highly praised ones from the first film. Although Shia la Boeuf's performance in this movie was once again laudable, I wouldn't completely recommend it. The majority of the battle scenes were filmed in slow motion since the filmmaker needed to provide a more dramatic effect, however after nine or ten of them, it can start to grow tiresome before becoming humorous."
    },
    {
      "rating": "2/5",
      "review": "I'd say \"the lack of writers really shows\", but considering all the following movies HAD writers...I guess this was pretty typical."
    },
    {
      "rating": "5/5",
      "review": "I know people hate this movie but I think it's still awesome everyone👍🏻"
    },
    {
      "rating": "2.5/5",
      "review": "Transformers: Revenge Of The Fallen (2009) suffers from the same amount of problems as the first but it manages to be even worst."
    },
    {
      "rating": "4/5",
      "review": "Great action and fun continuation"
    },
    {
      "rating": "3.5/5",
      "review": "It is not such a great movie. but it is still fine."
    },
    {
      "rating": "2/5",
      "review": "It's kept delaying the inevitable end and that made the movie king and boring and over the top not much character development at all"
    },
    {
      "rating": "1/5",
      "review": "The first time I watched this I actually kind of liked it when I rewatch it I realize how bad it was it's definitely entertaining to a Point where it just gets obnoxious and the humor is terrible and I really don't wanna rewatch 2 hours and 29 minutes Worth of Michael Bay isms and also they totally butchered my man jet fire he looks terrible in the film but he's so good in the TV show and they basically just ruined him in it I don't know why they really stuck on this poor jet fire did not deserve this and also very sexist 2/10"
    },
    {
      "rating": "1.5/5",
      "review": "Even bigger, dumber, and more action-y than the first. Forget there is supposed to be a storyline and try to enjoy the effects, if you can."
    },
    {
      "rating": "3.5/5",
      "review": "This movie should've have been written."
    },
    {
      "rating": "3/5",
      "review": "Transformers Revenge of the Fallen is a down grade to the original. Some parts of the film where unnecessary. But it still holds off alright with the shanghai, forest and pyramid fights being the most iconic to this movie."
    },
    {
      "rating": "5/5",
      "review": "The Best Transformers movie in my opinion"
    },
    {
      "rating": "1.5/5",
      "review": "Not even the surprisingly well CGI or the few great action sequences are enough to save \"Transformers: Revenge of the Fallen\" from being a lousily written, lazily acted, and bafflingly stupid movie that tries too hard to live up to the expectations set up by the original film."
    },
    {
      "rating": "5/5",
      "review": "I like the technology in the movie. I like the transforming of it. The actors were doing a good job."
    },
    {
      "rating": "5/5",
      "review": "Ages 13 and older!!!!!!!!!! The greatest 02 hours: and 29 minutes ever!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "2.5/5",
      "review": "Transformers revenge of the fallen is a let down compare to the first but still there is a lot of fun things about this film such as the forest fight which is the best action sequence after the battle of Chicago in the entire franchise."
    },
    {
      "rating": "3.5/5",
      "review": "Not bad to be honest. Compared to some other entries into this franchise this was decent."
    },
    {
      "rating": "3.5/5",
      "review": "The Second Installment in the series, and the first of four sequels, Transformers Revenge of The Fallen has its parts and some flaws, but is an average action film. The Action Sequences receive high praise. 7.3/10"
    },
    {
      "rating": "1.5/5",
      "review": "Revenge of the Fallen is already been fallen by the movie is too much going on terrible writing, bad jokes, Shia's weird finger injuries and too many lenes flairs including Michael Bay's bad filmmaker."
    },
    {
      "rating": "1.5/5",
      "review": "Too much computer generated noise. Poor acting, non-existent story."
    },
    {
      "rating": "4.5/5",
      "review": "This movie is so batshit crazy but that's what it so damn entertaining, A heavily enjoyable watch to just turn your mind off too and sit down and enjoy."
    },
    {
      "rating": "2/5",
      "review": "When this movie tries to be dramatic, it's laughable, and when it tries to be funny, it's juvenile. These are just a couple of the issues with Transformers: Revenge of the Fallen. Sure, it has cool explosions and some impressive visual effects, but the story is overly complicated and the dialogue is just bad. I'm not a fan of this mechanical mess of a movie."
    },
    {
      "rating": "5/5",
      "review": "? I know what people say about this movie, but I personally think the story is followable. I'm personally a fan of stupid humor so some of it unironically did make me laugh. Not everything has to be extremely serious, I grew up loving transformers and enjoyed this movie the most of the five. I love the action scenes, and the dynamic camera angles during most of the fighting, the soundtrack also further elevates this movie. This movie unlike most kids who said they loved it when they were little but can't stand it now, still holds up for me as one of my favorites, why not just have fun with it, ya know? I still love this movie for what it is, Despite the flaws I will definitely admit exist."
    },
    {
      "rating": "2.5/5",
      "review": "The movie was overly sexual for no reason at all."
    },
    {
      "rating": "1/5",
      "review": "Bad movie good cgi bad explosions good Optimus Prime"
    },
    {
      "rating": "3/5",
      "review": "It was actually a good movie. Too underrated by critics and deserves better props than it has. I mean I'll be honest, it was the best one by far enough. The first one was really terrible, this one was actually good, third one was so so I just think it could have been done better, and then four and five were also so so it's just that they were a little weird."
    },
    {
      "rating": "0.5/5",
      "review": "Better than the first Michael Bay installment, but still terrible. The style of the Transformers was all wrong."
    },
    {
      "rating": "2/5",
      "review": "I saw this when I was seven and I've seen it like 10 times. I definitely had no idea wtf was going on when I first saw it as a kid. As I've seen it today, the plot is incredibly stupid. There is so much horniness packed into about 30 minutes of this film and I could just vomit. But when the Transformers are on screen, I'm blown away. They're not your simple, clean, iconic G1 designs, but they're still incredible to watch the blazing glory type action scenes. Shanghai and the forest fight are still awesome. The conclusion leaves a lot to be desired, but if you turn your brain off and ignore Skids, Mudflap, and Wheelie, this movie is actually kinda fun for how stupid it is."
    },
    {
      "rating": "4/5",
      "review": "Despite the reviews of this movie, I personally enjoyed it. It wasn't as good as the first Transformers, but it was still a great movie in general. 4/5."
    },
    {
      "rating": "1.5/5",
      "review": "There are few objectively bad cinematic experiences that I like as much as the Michael Bay Transformers movies, but Part 2: Revenge of the Fallen, is the one I will never rush to defend. It's aggressive, it's loud, it's obnoxious, it's WAY too long, and I never thought I'd say this about a Michael Bay movie, but: It feels Lazy. This last one is the biggest oddity in regards to this movie, as Michael Bay's biggest problem has always been that it feels like he Directs and Edits after drinking a double-dosage of RedBalls Energy Drink (for those that watched Chapelle Show), but half of this movie looks like Bay just Directed it after taking Melatonin, as the cinematography is surprisingly plain, the stunts less intense than his usual work, the action blocking is a lot less intricate than with any other movie of his, and there's so much in this movie that simply did not need to exist that it felt like Bay was shooting most of this out of obligation. Let's throw in the fact that this movie is simultaneously the Most Comedic yet Least Funny entry of his Transformers movies, and you also have a movie that suffers greatly from inconsistent tone (a problem the others suffered from as well but not nearly to the degree here). The one distinctly good moment in this movie is a desperate fight in the forest between Optimus Prime and several Decipticons, as it's one that plays out with genuine stakes, has weighty consequences, ends on a powerful note and feature's excellent cinematography, choreography and sound design. It's a shame as this bit is genuinely great, the sole legitimately shining moment in a movie that balances between low-tier mediocrity and the outright awful."
    },
    {
      "rating": "5/5",
      "review": "bruuhhhh i think this one is maybe better than the first. the ACTION bro plus the comedy was so good."
    },
    {
      "rating": "5/5",
      "review": "👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍🌟🌟🌟🌟🌟"
    },
    {
      "rating": "3.5/5",
      "review": "When I had heard everyone say that Transformers movies keep getting worse as time moves on I was actually very hesitant to watch this. I really liked the first movie so there was no way I could believe that THIS franchise could possibly be bad (although I did see that later on, I didn't see it here). In my review of the first movie I said how I got interested in the Transformers franchise after watching it, since I didn't know this was actually a toys company and not an anime series. If that movie was just the introduction, this was where the real action takes place. I saw Revenge of the Fallen on Amazon Prime soon after the first one. I only had one week left before my Prime subscription would expire, so I had only decided to dedicate this time to watching all the Transformers movies so that I could understand what this franchise is all about. Unlike the future movie this one actually expanded on what was established at the first movie. Although the human characters were not as interesting as the previous movie and the story was also pretty much empty, the action scenes completely made up for it. As usual the CGI and action was very good. The new characters introduced were fun to watch. I really like to see it when new characters are brought in and given their own character development as they transform into cool cars. However not everything about this movie was good. Like I said above the human characters were not as interesting. The entire blood about Sam going to college and his parents continuously pestering him was very annoying. This was the last time we got to see Mikaela, which is also something very sad IYKWIM. This movie was able to explain very well the entire concept of Transformers, something that the prequel fail to do so. Before I used to think that Autobots and Decepticons are supposed to be cars, but now I know that they are actually robots which can turn themselves into whatever they see in front of them. I would definitely give a rewatch afterwards sometime in the future whenever I have to show this franchise to a new generation."
    },
    {
      "rating": "5/5",
      "review": "This may be controversial, but I believe Transformers: Revenge of the Fallen is one of the best films in the franchise. This film is slightly messy, but only if you don't pay attention. The movie isn't finished yet, and you can tell; there are some funny awkward jokes strewn around, and there are a few minor narrative holes here and there, but I can see where they're heading, and I LOVE it. The plot is very interesting to explore, including the history of Transformers and the lasting effects of that legacy that transcends time. Also you will not find better action in any other film than in this one; the action is nonstop and visually appealing and it will keep you at the edge of your seat. All in all, my childhood favorite and an actually enjoyable watch."
    },
    {
      "rating": "3.5/5",
      "review": "The film follows the success of the first one, with fun and comedy on the rise, but it is already beginning to show some fatigue that will show up throughout the saga. (7/10)"
    },
    {
      "rating": "5/5",
      "review": "Truly a work of art. Amazing"
    },
    {
      "rating": "1.5/5",
      "review": "Complicated plot but good visual effects"
    },
    {
      "rating": "4/5",
      "review": "Honestly, the plot is shit, but the movie overall is pretty good. Don't fucking crucify me."
    },
    {
      "rating": "1.5/5",
      "review": "Transformers: Revenge Of The Fallen is just 2 hours of exposition and loud noises."
    },
    {
      "rating": "3/5",
      "review": "while a lot people don't really like this movie I still at least enjoyed it"
    },
    {
      "rating": "3/5",
      "review": "while many people don't like this movie I still at least enjoyed it, the transformers them selves were all pretty cool but this movie was way to long"
    },
    {
      "rating": "0.5/5",
      "review": "The mom was super annoying"
    },
    {
      "rating": "1.5/5",
      "review": "Revenge of the Fallen does everything that it's predecesor did but longer, bigger, and... much worse. More doesn't always mean better."
    },
    {
      "rating": "4/5",
      "review": "8.5/10. I love this film even more than the first one."
    },
    {
      "rating": "5/5",
      "review": "Qnd criança gostava muito desse filme mais agoro eu adorooooo dms marco minha infacia"
    },
    {
      "rating": "4/5",
      "review": "In my opinion one of the bests of the saga, this was a good hit by Michael Bay as well as the first, a good story, but it still has to improve the Transformers fight scenes, more slow motion and less cuts"
    },
    {
      "rating": "2.5/5",
      "review": "Nella prima parte ci si diverte e ci si distanzia dal primo capitolo; purtroppo col passare dei minuti la trama diventa sempre più simile e anche le ambientazioni non aiutano particolarmente; seppur spettacolari, troppo simili al primo atto. Il finale è davvero terribile, costa al film tanta credibilità."
    },
    {
      "rating": "1/5",
      "review": "It was a unique kind of bad. I do not see the point of watching this film unless you want to give your grandma a headache."
    },
    {
      "rating": "3.5/5",
      "review": "It's not the best out of all of them, but I am very biased when it comes to transformers. The best part of the movie is closer to the end, that's where most of the action is."
    },
    {
      "rating": "0.5/5",
      "review": "Las películas de Michael Bay se caracterizan por básicamente no tener historia."
    },
    {
      "rating": "3.5/5",
      "review": "Not as good as the first one"
    },
    {
      "rating": "2/5",
      "review": "Worse than the first"
    },
    {
      "rating": "0.5/5",
      "review": "A 150 minute borefest"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible characters, terrible effects, terrible story, terrible jokes, tonally inconsistent, poor direction, bad acting, it's honestly astounding how bad it is."
    },
    {
      "rating": "1.5/5",
      "review": "A film that is all over the place with the pasting and action scenes that are confusing. Also not enough transformers"
    },
    {
      "rating": "0.5/5",
      "review": "When I was a kid, I thought to myself: Free Willy 2 is the first sequel which makes the original better. Now, finally a sequel comes along which makes the first movie worse."
    },
    {
      "rating": "5/5",
      "review": "COOOOOOOOOOOOOOOOOOOOL"
    },
    {
      "rating": "5/5",
      "review": "GREAT MOVIE LIKE IT RIGHT NOW"
    },
    {
      "rating": "5/5",
      "review": "why do people hate this movie"
    },
    {
      "rating": "5/5",
      "review": "lol better than new mutants and mulan"
    },
    {
      "rating": "5/5",
      "review": "COME HERE BOY!!!!!!!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "a really cool movie lol"
    },
    {
      "rating": "5/5",
      "review": "MEGATRON!!!!!!!!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "i actually liked this"
    },
    {
      "rating": "5/5",
      "review": "great movie in all honesty"
    },
    {
      "rating": "5/5",
      "review": "i like it a lot tbh."
    },
    {
      "rating": "2.5/5",
      "review": "For those who watched the 1st film, it will be VERY repetitive. It is basically the first, but with another story. It is the most definitive concept of \"More of the same\". It is a very long and tiring film."
    },
    {
      "rating": "3.5/5",
      "review": "It's an action movie with robot-aliens that turn into cars. Bumblebee owns my heart."
    },
    {
      "rating": "4/5",
      "review": "transformers 2 is good"
    },
    {
      "rating": "3/5",
      "review": "A very mixed bag of a movie, I still hold that nostalgia from seeing this at age 7 at my first midnight screening. I love this movie."
    },
    {
      "rating": "2/5",
      "review": "Michael Bay has resurrected the Transformers franchise with his mega-blockbuster hit in 2007. Two years later that success has remained the same, except the sequel Revenge of the Fallen was not so critically well-received. Years after the first movie, Sam (Shia LaBoeuf) gains visions of Cybertronian codes from a tiny AllSpark shard and is pursued by the Decepticons, under the command of The Fallen. During one battle, Optimus Prime (Peter Cullen) dies, leaving it up to Sam, his girlfriend Mikaela (Megan Fox), his college roommate Leo (Ramon Rodriguez), and former agent Seymour Simmons (John Turturro) to retrieve the Matrix of Leadership in Egypt to revive the last living Prime Autobot. Transformers fans pick on Revenge of the Fallen for the tremendous amount of continuity errors, plot holes, and dumb stereotypes. I say that's true, except this is a movie based on a line of Hasbro toys directed by a man less concerned with story and more with spectacle. With that said, Transformers: Revenge of the Fallen is a noisy technical exercise with an overly complicated story, annoyingly stupid characters like Sam's bipolar mother (Julie White), and way too much bathroom humor even for a film aimed at teenagers. On a positive note, the visual effects are the best parts in it, not just from the pyrotechnics, dust bombs, and explosions, but the mathematics on the light and shadows on the giant robots. Beyond that, you know how P.T. Barnum coined the phrase, \"a sucker is born every minute?\" Well, Michael is the modern day equivalent of that because Revenge of the Fallen and the other Transformers movies that followed get worse and worse, yet these movies keep shaving more green skins. (2 Dogs Humping out of 5)"
    },
    {
      "rating": "4/5",
      "review": "‪It’s dumb, bloated, and kinda out there, but it’s still got a decent spark of entertainment value.‬"
    },
    {
      "rating": "1.5/5",
      "review": "a bit interesting and pretty clever but it is pretty bad"
    },
    {
      "rating": "1.5/5",
      "review": "The action is a bit bad but sometimes it's good"
    },
    {
      "rating": "2/5",
      "review": "Even dumber than the first one, and with less plot. Transformers continues to be nothing more than big, dumb, incoherent action."
    },
    {
      "rating": "2/5",
      "review": "I give this 45% Rotten Tomatoes!"
    },
    {
      "rating": "2/5",
      "review": "This was a downgrade from the first movie it was not entertaining the movie went so slow and optimus barley was in the movie they had potential on making this movie better but that went to waste"
    },
    {
      "rating": "2/5",
      "review": "The first one was really fun and had a simple plot with a cast of characters you can like. This time the characters are back but this plot is too boring and just drags out. Plus the new characters added to the film are annoying beyond imagination. The juvenile humor is the rotten cherry on top."
    },
    {
      "rating": "1/5",
      "review": "Yikes. Since when can decepticons become humans? A sorry excuse for a movie pleasing only those overlooking terrible writing to see flashy cars, sexy girls, and big explosions."
    },
    {
      "rating": "1.5/5",
      "review": "Micheal Bay just ruined the franchise with this waste of time."
    },
    {
      "rating": "3/5",
      "review": "Transformers: Revenge of the Fallen is a movie with an inconsistent script, a far-fetched and unoriginal plot, with a slow and boring rhythm, a lot of attention to human characters and a humor that becomes stupid in the case of humans like in the Transformers. However, it has an aesthetic, special effects and CGI battles that somewhat compensate for its lack of originality and creativity."
    },
    {
      "rating": "2/5",
      "review": "Transformers Revenge of the Fallen is a movie I struggle with watching all the way through. Every time I watch it what keep me engaged are the autobots but what pulls me out are the humans. And there are way too many human characters to me. They take away from the Autobots and the Decepticons and most of them aren't that interesting. Every time I start to get into this movie they cut to the humans like Sam in college. And to be quiet frank I don't care about Sam and his college scenes. I don't. I'm watching this movie for the Transformers and they don't get enough to do especially when Optimus Prime dies. Like as soon as he dies this movie becomes unbearable. The dialogue is super cringe and awkward. The jokes aren't funny at all and the plot is absolutely garbage. For a movie titled Revenge of the Fallen the Fallen doesn't get enough screen time and what he wants to do and why he is angry at the humans don't make any sense to me. Does it have entertaining action? Yes, but not enough to make this movie watchable and once they kill Optimus this movie becomes really really terrible."
    },
    {
      "rating": "5/5",
      "review": "More cooler then ever before and I was crying at the battle part and I liked it a lot."
    },
    {
      "rating": "1.5/5",
      "review": "It's overly long and bloated, yet nothing seems to happen. There are offensive characters, a terrible romantic subplot, and even the attempted laughs are forced and unfunny. There's decent action, though."
    },
    {
      "rating": "0.5/5",
      "review": "This is not worth your time I rather watch Age of Extinction and The Last Knight over this"
    },
    {
      "rating": "0.5/5",
      "review": "silly movie. dialogues are idiots"
    },
    {
      "rating": "3/5",
      "review": "With explosive and loud action, cool visuals and engaging soundtrack, but some irregular acting, convoluted narrative and clumsy dialogue, it may be the worst of the franchise if it wasn't for the terrible sequels"
    },
    {
      "rating": "1/5",
      "review": "Boring, Bad Writing, Terible use of jokes, Constant explosions there and here, what more do you expect. Transformers: Revenge of the Fallen put me to sleep in the bedroom watching it on a Blu Ray. Like, how did this film get made? Just to keep the franchise alive, that's what."
    },
    {
      "rating": "2.5/5",
      "review": "Lazily made movie relying on overblown VFX action to cheat audiences into believing they're watching a summer blockbuster."
    },
    {
      "rating": "2.5/5",
      "review": "Not the best, but definitely not the worst of the series either"
    },
    {
      "rating": "1/5",
      "review": "Not so much a movie as a garbled collection of scenes, characters, and explosions. (1/5)"
    },
    {
      "rating": "3/5",
      "review": "The transformers return for another movie."
    },
    {
      "rating": "5/5",
      "review": "The sequel is much better than the first one"
    },
    {
      "rating": "3.5/5",
      "review": "This second installment of the Transformers series wasn't as fantastic as the first one but it was still pretty good. Shia LaBeouf, Megan Fox, and the rest of the cast did a great job in this movie. The plot to the movie was pretty good and the action scenes were pretty cool. A lot of people didn't like this movie, but I did and I would recommend it."
    },
    {
      "rating": "4/5",
      "review": "Good if ur a transformers fan..."
    },
    {
      "rating": "1.5/5",
      "review": "Screw this movie. This is a high budget trash can. Action(explosions) was okay but it was appeared as it was cut together by a 12 year old."
    },
    {
      "rating": "2.5/5",
      "review": "Okay For One time Because Of Visualization But Not Greater Than Part One"
    },
    {
      "rating": "1/5",
      "review": "Lazily made movie relying on overblown VFX action to cheat audiences into believing they're watching a summer blockbuster."
    },
    {
      "rating": "3.5/5",
      "review": "My least favorite Transformers movie"
    },
    {
      "rating": "4/5",
      "review": "Transformers Revenge of the Fallen is the most violent of the franchise. This movie has so great visual effects, the characters they look so real. Perhaps if they can put much more robot interaction it would be perfect. I would have put fewer unnecessary scenes from Sam's life and maybe add more scenes about the autobots and decepticons since sometimes they lose prominence. Still the adventure is always present and I simply jumped in excitement with the final battle."
    },
    {
      "rating": "3.5/5",
      "review": "I thought this movie was entertaining and I love all the transformers had many great moments and amazing effects"
    },
    {
      "rating": "2/5",
      "review": "This movie fails to be as good as the original and is extremely pointless. This movie is missing emotion, humor, and enjoyment and is extremely long and boring. However Optimus Prime's fight scene at the end left a mark, even though he was absent for the majority of the film which is another major problem with this sequel."
    },
    {
      "rating": "4.5/5",
      "review": "I love the transformer series!!"
    },
    {
      "rating": "1.5/5",
      "review": "Only the forest battle was the most enjoyable scene of the movie."
    },
    {
      "rating": "0.5/5",
      "review": "The first one was no Citizen Kane, but this one is just plain trash."
    },
    {
      "rating": "2/5",
      "review": "Transformers 2 is when the franchise started to go down hill and goes on fire. The acting is awful the characters are very annoying and it is so boring and repetitive at times."
    },
    {
      "rating": "1.5/5",
      "review": "I just watched this movie and boy was it bad. I know watched it alot of times before but this time when I really paid attention to this idiotic movie, I realized I wasted alot more than I should have spent. Utterly and undeniably the worst movie ever."
    },
    {
      "rating": "2/5",
      "review": "Not great at all, and after this moviet it's getting worse. Bayformers not transformers"
    },
    {
      "rating": "5/5",
      "review": "My son said he was a transformer after watching this movie and tried to contort himself into a car. He has two dislocated legs and had to get an arm amputated. He has been in the hospital for the last 10 years, still in a coma. I love you Joe"
    },
    {
      "rating": "1.5/5",
      "review": "worst sequel i have ever watched. the first movie was decent, but this?? such a disappointment"
    },
    {
      "rating": "2/5",
      "review": "This movie is hot garbage. But it's fun hot garbage. The action scene in the forest is the best in the series. Still, it's not a good film by any means. Makes for good background noise if they're playing it on FX."
    },
    {
      "rating": "3/5",
      "review": "Meh, is all I have to say. I mean robots fighting is what you want and it's what you get. The human development is literally non existent."
    },
    {
      "rating": "0.5/5",
      "review": "Literally one of the worst Transformers movies I've seen all year. Nothing was interesting and exciting, none of the characters shown true emotion, and the dialog was such a scrunched up piece of paper, that I couldn't figure out what was going on except for giant robots hitting each other. The 'comedy' wasn't funny, the jokes are over-the-top garbage, and the cinematography was sloppy. Michael Bay gave us the laziest piece of cinematography of all time"
    },
    {
      "rating": "2/5",
      "review": "This movie alright you know it could have been way better it had it’s flaws but I left the theater very disappointed and I’m going to give this a D+"
    },
    {
      "rating": "3/5",
      "review": "It works. Just enough..."
    },
    {
      "rating": "0.5/5",
      "review": "Worst Transformers movie ever"
    },
    {
      "rating": "2/5",
      "review": "The acting in this is so poor, it is laughable"
    },
    {
      "rating": "3.5/5",
      "review": "The second Transformers movie is ok, not good, but a popcorn summer movie. It has an ok plot, there are many unnecessary and silly scenes. the backstory showed is great, sadly the film didn't care of that. The action sequences are amazing, the human plot is ok."
    },
    {
      "rating": "3/5",
      "review": "It's not as good as the first movie, and did foreshadow the complicated messes that were to come in the form of more sequels. But honestly, it's at least watchable and they at least tried to bring Transformers lore into the movies (though it could've been done much, much better)."
    },
    {
      "rating": "2.5/5",
      "review": "The effects and action are still top-notch, and I don't think it's as bad as everyone says it is. However, it's still not very good, either. The story is just more of the same, and some characters (the parents, Mudflap, and Skids) are ear-gratingly annoying."
    },
    {
      "rating": "3.5/5",
      "review": "Ok. I know this movie gets a lot of flack for its creative choices, and that's understandable. But, this movie is still extremely entertaining. The production is grand, the visuals are astonishing and still hold up, and the action sequences, especially the forest battle, are phenomenal. Would it have been nice to see more of the Transformers in this movie? Absolutely. But, when they were on screen, the movie was fucking great. It may be average overall, but it's still enjoyable to watch."
    },
    {
      "rating": "0.5/5",
      "review": "As good as could be expected as a sequel to Bay's transformers, in other words bad."
    },
    {
      "rating": "2.5/5",
      "review": "We know that Michael Bay got a director's strike, but they could have to worked alot more."
    },
    {
      "rating": "1/5",
      "review": "Loud, obnoxious, forgettable, and beyond annoying. 1/5 - Awful"
    },
    {
      "rating": "2/5",
      "review": "Obnoxious and unbelievable. While there can be some decent scenes and some spectacular action and visuals, Revenge Of The Fallen is where the series started to go downhill. Its worse than you can remember."
    },
    {
      "rating": "0.5/5",
      "review": "Transformers: Revenge of the Fallen is a great example of a continuation that instead of learning and reworking the mistakes of the previous one, it only suggests the formula for the success of its predecessor while stumbling on the limits of a humorless, badly directed scenes with an incoherent script , taking everything bad from the first film and raising it to the extreme cumulative of the ridiculous. There are so many holes in the script, uninteresting characters and a path of pious decisions with the characters that make you want to forget every second you spent watching."
    },
    {
      "rating": "5/5",
      "review": "Probably the most Underrated and Bad Reviewed Movies I’ve seen"
    },
    {
      "rating": "1.5/5",
      "review": "A Terrible action movie, with ridiculous moments and a script write of very bad"
    },
    {
      "rating": "0.5/5",
      "review": "I added a 1/2 star for Megan Fox's tits"
    },
    {
      "rating": "3.5/5",
      "review": "Fun and cool CGI the next chapter of the transformers franchise needed a bit better plot."
    },
    {
      "rating": "5/5",
      "review": "Dis movie gr8 all u h8rs go die and then we can watch this movie at your funeral I h8 u"
    },
    {
      "rating": "4/5",
      "review": "best of all transformer movies. FOR ME."
    },
    {
      "rating": "4/5",
      "review": "The funny transformations of these robots in Transformers: Revenge of the Fallen are dizzying, but very cool. Except for dazzling, the scene has no real purpose, but as long as you look at it, its purpose is enough - because there are advertisements in it. This implant is too hard, a bit eye-sore, and it would be better if it could be removed."
    },
    {
      "rating": "1/5",
      "review": "the only good thing about this movie is the theme song"
    },
    {
      "rating": "1/5",
      "review": "Probably the worst of the Transformers movie franchise, Revenge of the Fallen's story is extremely uninteresting and illogical during most of the movie. While there are a few outstanding action scenes, it is not nearly enough to save this movie from the criticism it recieves."
    },
    {
      "rating": "3/5",
      "review": "This movie has great visual effect and big scale, but there are no reasonable plot and sturcture. But this is one of my guilty pleasure movies. My score would be 6/10"
    },
    {
      "rating": "0.5/5",
      "review": "And amazing testament to what my fellow nerds will pay to see... But in all fairness it was before we understood that it was all going to be garbage after the first one."
    },
    {
      "rating": "2/5",
      "review": "Bad sequel. Still watchable though"
    },
    {
      "rating": "5/5",
      "review": "A cool, funny. action-packed, and exciting adventure that will equil the sucess of the original."
    },
    {
      "rating": "3/5",
      "review": "A sequel that repeats the success of the first but lowers the bar in the humor and character development department."
    },
    {
      "rating": "4.5/5",
      "review": "Plenty of fighting robots and T&A ??"
    },
    {
      "rating": "5/5",
      "review": "this one is amazing it dont deserve a 19 atleast a 50%"
    },
    {
      "rating": "5/5",
      "review": "Awesome now we got right down to battles and war so that makes me happy"
    },
    {
      "rating": "5/5",
      "review": "This film is actually amazing fallen is great megatron is great"
    },
    {
      "rating": "5/5",
      "review": "a worthy sequel to the first its no 19% but its a 60% audience core close enough"
    },
    {
      "rating": "2/5",
      "review": "First transformers movie I watched so it holds a special place in my heart but that doesn’t help the fact that this is my least favourite transformers movie and just a really bad movie over all. This movie ruined all the good things from the last one Sam is annoying Optimus isn’t in the movie that long bumblebee was probably the only stand out in this movie. This movie does have a great action scene in it the forest battle was awesome but that is pretty much it. Transformers: Revenge Of The Fallen is a movie that holds a special place in my heart but is still a bad movie I’m ganna give Transformers: Revenge Of The Fallen a (C-)"
    },
    {
      "rating": "5/5",
      "review": "This is my favourite movie of the transformers franchise first off we got a badass fight scene best in the transformers movies and megatron gets ressurected fallen is just amazing can it get any better"
    },
    {
      "rating": "2/5",
      "review": "Terrible and disappointing sequel. The twin Autobots were pretty annoying and racially offensive (typical for a Michael Bay film to have some racist humor). The plot was dumb and didn't make sense. The writers and Bay totally ruined Jetfire by making him an old fuck and a Decepticon. In the G1 series he was an Autobot and wasn't some old fuck. The Fallen was a terrible and disappointing villain with no real character development and was a waste of Tony Todd's talent. Tony Todd was completely wasted as the voice of the Fallen. He had a great and perfect voice for the Fallen but the role was terribly written. The human characters are still horrible and hog up too much screentime away from the Transformers who are the titular characters. The only good scenes from this movie were the forest fight scene, the Bumblebee vs. Ravage fight scene, and the final battle scene. This sequel had so much potential and could have been a great film that was even better than the first live-action Transformers film, but it ended up being terrible. Michael Bay is the master of art of ruining people's childhoods. I really hate Michael Bay so much. WHY DOES THIS GARBAGE HAVE A 57% AUDIENCE SCORE? So Hulk has a 29% audience score but this terrible, terrible Transformers movie has a 57% audience score? Why does Daredevil (2003) have a lower audience score than this terrible, horrible, shitty Bayformers sequel? Daredevil (2003) looks like a masterpiece compared to this steaming pile of horseshit. The Bayformers sequels clearly don't get enough hate, they seriously need a lot more hate. I live in a world full of idiots who like mindless, senseless, brainless, stupid action popcorn flicks directed by that idiot Michael Bay who just loves ruining people's childhoods. Michael Bay raped my childhood. How anyone can like these god-awful Bayformers sequels is beyond me! Rating: 2/10"
    },
    {
      "rating": "5/5",
      "review": "Action packed loved the stsr ending was okay but rushed"
    },
    {
      "rating": "4/5",
      "review": "Good movie had some very good action scenes.I would rate this movie a fresh tomatoes with a solid 80 %"
    },
    {
      "rating": "5/5",
      "review": "this one is the best for me only because of its comedy acting and also action its a fun film to watch."
    },
    {
      "rating": "1.5/5",
      "review": "Michael Bay needs to be charged for making such abhorrent films. An abomination of a movie even by the standards of the series, Transformers: ROTF is a joke of a movie bestowed upon us by Michael Bay. Everything that happens on the screen is so blurry and confusing you never know who is fighting who, or for that matter who is who. All the actors from the previous installment are on hand to collect a paycheck for acting in front of a bluescreen. At least the earlier film made some sense. This is an abomination. Avoid."
    },
    {
      "rating": "1.5/5",
      "review": "n abomination of a movie even by the standards of the series, Transformers: ROTF is a joke of a movie bestowed upon us by Michael Bay. Everything that happens on the screen is so blurry and confusing you never know who is fighting who, or for that matter who is who. All the actors from the previous installment are on hand to collect a paycheck for acting in front of a bluescreen. At least the earlier film made some sense. This is an abomination. Avoid."
    },
    {
      "rating": "3/5",
      "review": "Human characters are worse, but it's still one of my biggest guilty pleasures."
    },
    {
      "rating": "2/5",
      "review": "Wow. Terrible. Michael Bay does a fantastic job with special effects but his story telling .... terrible."
    },
    {
      "rating": "3.5/5",
      "review": "It was okay Not my favorite tho"
    },
    {
      "rating": "3/5",
      "review": "This is a sequel that feels rushed and unfinished. Several of its jokes are crude or plain unfunny, and scenes meant to be momentous fall short, with a final battle that's surprisingly uninvolving. Also, Optimus Prime and the Autobots feel too ruthless - the way they hunt down and execute Decepticons suggests that despite what they say, freedom is not the right of all sentient beings."
    },
    {
      "rating": "1/5",
      "review": "The movie equivalent of getting run over repeatedly by a gas-guzzler. One long mindless headache-with RiffTrax serving as the much needed Tylenol."
    },
    {
      "rating": "5/5",
      "review": "you may give hate but you cant deny that the forest fight was outstanding"
    },
    {
      "rating": "5/5",
      "review": "love the concept of 2 main villians and one survives for the next one"
    },
    {
      "rating": "2.5/5",
      "review": "Probaly the worst of of the series but I still love all of them. Most nostagic for me but it is a bad movie but fun."
    },
    {
      "rating": "1.5/5",
      "review": "An abomination of a movie even by the standards of the series, Transformers: ROTF is a joke of a movie bestowed upon us by Michael Bay. Everything that happens on the screen is so blurry and confusing you never know who is fighting who, or for that matter who is who. All the actors from the previous installment are on hand to collect a paycheck for acting in front of a bluescreen. At least the earlier film made some sense. This is an abomination. Avoid."
    },
    {
      "rating": "5/5",
      "review": "PEOPLE ARE STILL HATING ON THIS MOVIE"
    },
    {
      "rating": "1.5/5",
      "review": "its almost cringeworthy to watch"
    },
    {
      "rating": "1.5/5",
      "review": "A bad movie where you have no idea what's going on."
    },
    {
      "rating": "3.5/5",
      "review": "Fairly significant drop after the first"
    },
    {
      "rating": "1.5/5",
      "review": "An abomination of a movie even by the standards of the series, Transformers: ROTF is a joke of a movie bestowed upon us by Michael Bay. Everything that happens on the screen is so blurry and confusing you never know who is fighting who, or for that matter who is who. All the actors from the previous installment are on hand to collect a paycheck for acting in front of a bluescreen. At least the earlier film made some sense. This is an abomination. Avoid."
    },
    {
      "rating": "1.5/5",
      "review": "An abomination of a movie even by the standards of the series, Transformers: ROTF is a joke of a movie bestowed upon us by Michael Bay. Everything that happens on the screen is so blurry and confusing you never know who is fighting who, or for that matter who is who. All the actors from the previous installment are on hand to collect a paycheck for acting in front of a bluescreen. At least the earlier film made some sense. This is an abomination. Avoid."
    },
    {
      "rating": "2.5/5",
      "review": "Mindless action. Fun movie."
    },
    {
      "rating": "2/5",
      "review": "So when I saw the first one I thought it was not the best one so I didn’t have a good feeling about this as well with out Megan Fox the 3 one will not be good she is a good Actress to have"
    },
    {
      "rating": "2/5",
      "review": "Revenge of the fallen (2009): An abomination of a movie even by the standards of the series, Transformers: ROTF is a joke of a movie bestowed upon us by Michael Bay. Everything that happens on the screen is so blurry and confusing you never know who is fighting who, or for that matter who is who. All the actors from the previous installment are on hand to collect a paycheck for acting in front of a bluescreen. At least the earlier film made some sense. This is an abomination. (Better to go rent Jurassic Park instead)."
    },
    {
      "rating": "1/5",
      "review": "An absolutely horrible film. Michael Bay should be ashamed that he isn't capable of toning down his over-the-top action, concentrating a LITTLE on the story and, when doing a film marketed to kids, leave out all of the sex, drug and racist material."
    },
    {
      "rating": "0.5/5",
      "review": "Wow... You can do better"
    },
    {
      "rating": "1.5/5",
      "review": "This Film Could've Been Good, But Is FILLED With Stupid Jokes And A VERY Messy Script"
    },
    {
      "rating": "0.5/5",
      "review": "Revenge of the fallen hope I had for this movie"
    },
    {
      "rating": "3.5/5",
      "review": "I AM MEGATRON!!!!!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Improv based filmmaking during the writers strike and it shows how plot less, derivative, and non sensical this franchise gets."
    },
    {
      "rating": "2/5",
      "review": "\"Transformers: Revenge of the Fallen\" is an unripe mess of a film."
    },
    {
      "rating": "0.5/5",
      "review": "Utter rubbish. Shocking that it took so many people to write this film. Michael Bay once again shows why he is a terrible director. Shia is once again annoying as hell. Will never watch again."
    },
    {
      "rating": "1/5",
      "review": "2/10 Unfunny, horribly plotted, and extremely boring, Revenge of the Fallen is clearly the film that sent this franchise on a path to hell. But the special effects are great. Too bad they were wasted on this piece of crap."
    },
    {
      "rating": "5/5",
      "review": "ABSOLUTELY AMAZING!! I can't believe this movie got bad reviews. I mean how is it bad? It's not. It's such a great movie. It's DEFINITELY much better than the first one. It has a lot more action, and it has a much more fun story that is so entertaining. One of the best!!!"
    },
    {
      "rating": "2/5",
      "review": "Downhill from the first one"
    },
    {
      "rating": "3/5",
      "review": "Not the best. Acting and imagery are flawless, but the writing fails at points. I just think they could have done better. And again too many humans not enough 'bots."
    },
    {
      "rating": "0.5/5",
      "review": "I will never forgive this sequel that had so much potential and ends up being a flop, it was garbage, boring, stupid scrip, the first one was a lot better"
    },
    {
      "rating": "1.5/5",
      "review": "No interesting plot. Fucking stupid. Watch the first one"
    },
    {
      "rating": "5/5",
      "review": "dont know why critics and fans hated this i enjoyed optimus dying by the hands of his brother"
    },
    {
      "rating": "5/5",
      "review": "tf2 forest fight is probalby one of the most memorable fights in transformers films or even transformers history"
    },
    {
      "rating": "1.5/5",
      "review": "Being a Fan of Dark of the Moon, Age of Extinction, The Last Knight, and the 1986 Movie, The one film I cannot stand in the Transformers franchise is the release of Revenge of The Fallen. It wastes so much time with human bull, stupidly offensive jokes, and making the human characters so uninteresting, over-the-top, and downright terrible acting. Not even the Transformers are safe: Many were given the worst characterization lines in the history of the Transformers Series (all afar from the movies), and much more were just wasted. The visuals would of been so breathtaking if they were not so wasted, and even the visuals displease me. This film, Transformers Revenge of the Fallen, is the worst Transformers movie by a long shot."
    },
    {
      "rating": "1.5/5",
      "review": "I still, to this day, mention one of its scenes as the worse thing I have ever seen in any movie ever. There was some really shiny stuff in this movie though so + 1/2 star for that I guess."
    },
    {
      "rating": "2.5/5",
      "review": "Revenge of the Fallen is a film that sends you to sleep, though the overuse of the noisy action sequences force you to stay awake or leave the theatre. The issue is that Michael Bay always seem to put his brain on the visual effects and action sequences rather than construct a decent storyline so that the audience are completely aware of what is occurring."
    },
    {
      "rating": "2/5",
      "review": "Just stop making these movies."
    },
    {
      "rating": "2/5",
      "review": "Below par and disappointing considering how well the first film started the series."
    },
    {
      "rating": "5/5",
      "review": "In the 2nd Film of the franchise our heroes travel to Egypt to stop the Fallen. I really enjoy the Autobots even more in this movie, as i go for the first 2 Transformers, while in dark of the moon and age of extinction i really hated the secne where they kill my favorite Autobots as they were killed off. so this is why i go for the first 2 Transformers so after Revenge of the Fallen they will live on in my opinion, (and hopefully in the Godzilla and Transformers Crossover Movie.)"
    },
    {
      "rating": "5/5",
      "review": "Its a very fun ride!"
    },
    {
      "rating": "4/5",
      "review": "Another great \"Transformers\" movie!"
    },
    {
      "rating": "1/5",
      "review": "Great CGI. That's it. Everything else is pretty trash."
    },
    {
      "rating": "0.5/5",
      "review": "The fist movie I ever walked out of.. It was hard to top the first installment but this one was worse than the first film. Was too long, drawn out, pointless action and explosions. And not a fan of the blurry SFX."
    },
    {
      "rating": "1/5",
      "review": "I can't believe this movie was made. The only good thing is the forest battle."
    },
    {
      "rating": "1/5",
      "review": "Michael Bay has a great consistency of making bad movies. Money is the only probable reason to make Transformers movies."
    },
    {
      "rating": "5/5",
      "review": "The best sequel ever, people can love how Michael Bay has done to all of the perfect action, sadness, and comedy to this."
    },
    {
      "rating": "1/5",
      "review": "https://crazydiscostu.wordpress.com/2017/02/05/why-transformers-the-movie-1986-is-the-only-transformers-film-that-matters/"
    },
    {
      "rating": "0.5/5",
      "review": "Literally the worst movie ive ever seen."
    },
    {
      "rating": "0.5/5",
      "review": "People sure are into bad movies."
    },
    {
      "rating": "5/5",
      "review": "Great sequel to a movie I really enjoyed and it kept things fresh in all the right ways. 5/5"
    },
    {
      "rating": "1/5",
      "review": "Literally the worst movie I've ever seen. The plot is retarded."
    },
    {
      "rating": "0.5/5",
      "review": "Boring, bad jokes, and a plot that straight up makes no sense. This series is just so lazily written that I'm willing to bet I can put more thought into this movie then Bay did."
    },
    {
      "rating": "3/5",
      "review": "All the action scenes are explosive. Optimus prime's death scene upsets me and sex jokes are confusing. The visual effects are good."
    },
    {
      "rating": "2.5/5",
      "review": "I say a bit good it's just more on Sam's life and less about the transformers and too much love"
    },
    {
      "rating": "3/5",
      "review": "A huge and falloff from the first movie. Still had its funny moments and great action, and cool Transformers, but a lot I didn't like about the movie. I hated the Terminator transformer, the racial Transformers were terrible, both of Optimus's and Sam's deaths and coming back to life got old and repetitive, and not a complaint, but they played the Megan Fox card as hard as they could."
    },
    {
      "rating": "3/5",
      "review": "My least favorite Transformers movie. It's okay but it's not that good of a movie."
    },
    {
      "rating": "1.5/5",
      "review": "The second Transformers flick made nearly half a million dollars at the box office, but don't let that fool you. The film lacks heart and a decent story. It's primarily a CGI show that overstays its welcome. The only positive is the fact that most of the original cast has returned to make it somewhat digestible. I couldn't even finish the last 30 minutes. (1.5/5)"
    },
    {
      "rating": "3/5",
      "review": "Like I said in my review of the first Transformers movie \"You can't really get critical on a movie based on a toy line.\", though this one's hard not to. Something I didn't like about the first was it concentrated on the humans more than the Transformers. What did they do in this one? CONCENTRATED ON THEM EVEN MORE! There's only two or three fights with the Transformers in the entire 150 minute runtime. Though I sound like I hated it, I didn't. The special effects are really good, and the last fight was actually kinda cool. Not a horrible movie, but not very good."
    },
    {
      "rating": "1.5/5",
      "review": "This movie is a complete insult. The \"Revenge Of The Fallen\" title didn't really match with the actual movie. So yeah, more focus on the humans, more racial stereotypes, more obnoxious characters...DO NOT GET ME STARTED WITH THE DEVASTATOR!!! And perhaps this movie has one of the most racist, yet one of the most worst characters in the Bayformers franchise: Skids and Mudflap. The way Bay treated the characters like Jolt, the Constructicons, even the Fallen himself, was just unexcusible. The Fallen didn't do anything in the movie, except \"serving\" as a \"master\" for Megatron, and of course die, the Constructicons we're just wasted in the film, as well as Jolt; overall, it was bad. Now to the film's credit, I did like Jetfire in the movie, Ironhide and Bumblebee, as well as Optimus still have their personality as always to keep some veiwers interested, even Sideswipe had some personality. But unfortunately, that wasn't enough to save the film. But at least it's better than the film 5 years before it, Age of Extinction."
    },
    {
      "rating": "1/5",
      "review": "So dumb I feel dumber."
    },
    {
      "rating": "4.5/5",
      "review": "Best Transformers movie super action packed"
    },
    {
      "rating": "3/5",
      "review": "kinda boring still kinda liked though"
    },
    {
      "rating": "3/5",
      "review": "Good action and Sideswipe is very awesome, but a very not understandable and a confusing plot"
    },
    {
      "rating": "5/5",
      "review": "Did a lot better than the first. Megatron comes back to life, which makes a lot more action than I thought there would be. The first movie started off with bumblebee, just the car, but then showed what REALLY was wrong with the car. But why, where did the old camaro go? I know It didn't come back, though it should've. But why does Megatron come back to life, he lost a leg which came back somehow. At the end of the first movie, Megatron's chest did not look how it was supposed to be. But the cube actually gives the power to come back to life (resurrection) and have more power than you did. Why?? Because cube gives lots of power. But so far so good. Optimus does die but resurrects? Doesn't matter still good."
    },
    {
      "rating": "2/5",
      "review": "A confusing and lazily written plot surrounded by boring government conspiracy scenes, loud, annoying characters, and distasteful and childish humor. Its only redeeming quality that actually makes it worth watching maybe two or three more times is the battles and special effects, even though during these entertaining battle scenes the main characters are over-dramatic and loud while they scream constantly at everything. Not a very good sequel, but still enjoyable at times if you can get past the boring government conspiracies and scenes that contribute nothing to the overall story."
    },
    {
      "rating": "2.5/5",
      "review": "Transformers: Revenge of the Fallen has its moments, mainly with its stunning visual effects and Hugo Weaving's vocal performance as Megatron. I kinda enjoyed Tom Kenny's vocal performance as Wheelie as well. The sound design, like the first film, is pretty good as well. Sadly, all those who claim that this was the weakest Transformers film in the Bayformers franchise are probably right. Overlong, loud, thinly scripted, racist, unfunny and bolstered by melodramatic performances from the live actors (oh, and a lack of Optimus Prime compared to the first film), Transformers: Revenge of the Fallen is not only overloaded with action and Michael Bay's trademark explosions to the point of having their novelty worn off but also seems to be so emotionless that it ends up being barely below-average. *sigh* My problem is, as you can see with the 2.5/5 stars, that I'm too soft. I mostly try to see the positive aspects of the film, that's all. Even Bay and Shia hated the film. And we all know how the former usually doesn't care about what the critics says. If you were disappointed with this film, blame it on the Writers Guild of America. That little going on strike of theirs messed up what Bay could've potentially planned to make. This one sucks...most of the time."
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst movies ever made"
    },
    {
      "rating": "5/5",
      "review": "My favorite Transformers movie ever!!!!!!!!! Love the humor and characters!!!!!!!! This will always be my favorite Transformers movie!!!!!!!"
    },
    {
      "rating": "4.5/5",
      "review": "In my opinion, 2nd best in the franchise. The story is good, and the action is phenomenal."
    },
    {
      "rating": "2.5/5",
      "review": "A very dumb, yet very fun movie that by far surpasses age of extinction. Watching this movie and expecting ay thing but fun sequences is a really unreasonable thing do. Surprisingly, it actually succeeds with delivering you the backstory of the antagonists and protagonists and sort of engages you with the plot in the second act. despite the fact that it captures a plot, it is basically just meant to give you an idea of what the characters want to do, and doesn't make all this mess sound so coherent. With all these being said, this is a fun mess that doesn't give you a headache, but doesn't take you to the wonder land either."
    },
    {
      "rating": "2.5/5",
      "review": "The worst Transformers movie. I know, I know. That's like saying that's the worst piece of monkey turd I've ever tasted. I like this movies. They are terrible and they are my guilty pleasure. These and the Twilight movies. I love Optimus Prime, the one thing they got totally right. And they made Bumblebee cool. I was thought he was kind of weak in the cartoon. Speaking of which, don't understand the pedestal they put those cartoons on. I love them but they are just as bad as the movies."
    },
    {
      "rating": "1.5/5",
      "review": "WHAT I LIKED: A sequel to the thoroughly below-average 'Transformers,' this second installment does nothing to improve over its predecessor, and is actually even worse as a result. Don't worry though, it is undoubtedly another movie that you can sit and drool at without engaging your brain, which can certainly be appealing if a) you're 5 years old, or b) you're after a dumb action movie to eat popcorn and think about other things to. That's totally fine, and there's certainly plenty here to allow all that as Michael Bay delivers yet more mindless action and huge spectacle-sequences backed up by a great score from Steve Jablonsky. WHAT I DIDN'T LIKE: Sadly though, copy and paste is really all this movie is, and in emulating all the flaws of its predecessor, it winds up even less inventive or exciting. As a result, there's again absolutely nothing to engage you here - the characters are vastly under-written and have less life than the robots that dominate the screen (which really is saying something), the story is an over-serious and terribly complicated maze of un-interesting sub-plots that noone really cares about, and the product placement of actual products is almost as startling as the placement of women, who may as well be 'products' in the eyes of the film itself. As a result, you'll end up truly disengaged, uninterested and slightly wincing as the film proceeds for the entirety of its hugely overlong run-time here. VERDICT: Another exceedingly dull and uninteresting film for me; 'Transformers: Revenge of the Fallen' does nothing to shake things up after its predecessor. Come on Michael Bay, you can do better than this"
    },
    {
      "rating": "2/5",
      "review": "This would've been better without the unnecessary comedy, but lots of cool scenes."
    },
    {
      "rating": "5/5",
      "review": "Great fun and critics are really dumb"
    },
    {
      "rating": "2.5/5",
      "review": "A mindless action movie with no script. In 2009 there was a writers strike that affected this movie. There is loads of exposition and so much action and new annoying characters that it's hard to keep up with he movie."
    },
    {
      "rating": "5/5",
      "review": "Transformers revenge of the fallen is a great sequel to a great film"
    },
    {
      "rating": "5/5",
      "review": "Transformers revenge of the fallen is a great sequel go a great film also the forest fight is amazing"
    },
    {
      "rating": "0.5/5",
      "review": "We need to lower these ratings.... This belongs as follows: Critics- correct as is, viewers-23 percent!!!!"
    },
    {
      "rating": "0.5/5",
      "review": "Definitely the worst Transformers movie ever"
    },
    {
      "rating": "1/5",
      "review": "Transformers: A Vingança dos Derrotados - Wtf?, Filme dirigido pelo Michael Bay, ou seja muita explosão! a direção do filme é ruim, (Minha opinião), com takes de câmera girando em 360° dando até uma agonia, câmera sempre virada pro sol refletindo nos personagens pra dar um ar mais épico (oque nem sempre é), mixagem de som fantastica, o filme é cheio de piadinhas sem graças e chatas, o tipo de humor que você ver chegando, elenco em geral e suas atuações não surpreende, Megan Fox só ta nesse filme pra correr e balançar as tetas!, um destaque maior pro Shia LaBeouf como o Sam, que ele tenta mas o roteiro sempre passa a perna nele, falando em roteiro..., a historia não sabe pra onde vai, e perde muito tempo com coisas desnecessárias, trilha sonora: Link Park. Parte boa são as cenas de ação oque chegam a salvar um pouco do filme deixando-o mais divertido e pipoca :) Nota: 2.5"
    },
    {
      "rating": "4/5",
      "review": "This movie has a lot of flaws, from the cringe-worthy dialogue to the lack of screen time for a villain that seemed incredibly promising to the countless annoyingly bad jokes, but I'm not going to nitpick. I had a blast watching this film and the visual were just impeccable."
    },
    {
      "rating": "2/5",
      "review": "Did Bay just press the rewind button? This is the exact same thing a before."
    },
    {
      "rating": "2/5",
      "review": "It wastes the trashy fun of the first one for a recycled and rushed version that focuses on testicle jokes and the sexuality of Megan Fox rather thank making a fun movie."
    },
    {
      "rating": "0.5/5",
      "review": "The Transformers have one rule. \"Never destroy a planet with life\". So they land on earth, step on a few humans kick a tiger or 2 build a super weapon and then have a civil war over if it should be turned on or not."
    },
    {
      "rating": "2.5/5",
      "review": "Taking the fun, campy tone that made the original so good and throwing it in the incinerator, Revenge of the Fallen is a step down so big the landing temporarily broke Shia LaBeouf's ability to act. The CGI is still fantastic, and the battle between Optimus and Megatron, Starscream, and the third Decepticon (whose name I forget) is awesome. Unfortunately, the quality of the rest of the film can be summed up in two words: robot testicles."
    },
    {
      "rating": "0.5/5",
      "review": "What the hell happened here..."
    },
    {
      "rating": "5/5",
      "review": "Can't believe this got 19% should get more"
    },
    {
      "rating": "5/5",
      "review": "A great sequel to a great film"
    },
    {
      "rating": "5/5",
      "review": "I came in thinking this movie would be terrible, but I loved it! Everything was on point, and I don't understand why people don't like it."
    },
    {
      "rating": "4.5/5",
      "review": "Transformers: Revenge of the Fallen is an incredible film to watch :)"
    },
    {
      "rating": "1/5",
      "review": "Far worse than the first film (which is saying something), Revenge of the Fallen looks and plays out like a pre-teen boy's wet dream. It wouldn't surprise me to find out it has been written by one of them."
    },
    {
      "rating": "3.5/5",
      "review": "why does everyone hate this"
    },
    {
      "rating": "5/5",
      "review": "This is second place because of the action and also the plot it was magnificent"
    },
    {
      "rating": "2.5/5",
      "review": "Ugh, this one was plain terrible compared to the first. That said, it can be enjoyed somewhat."
    },
    {
      "rating": "0.5/5",
      "review": "The second worst film I have ever seen. 0.5/10"
    },
    {
      "rating": "5/5",
      "review": "I remember watching this in the theatre I was entertained and when I watch it now still entertained"
    },
    {
      "rating": "5/5",
      "review": "I liked the starting and the ending"
    },
    {
      "rating": "1/5",
      "review": "This movie was not good I'm not a fan boo"
    },
    {
      "rating": "5/5",
      "review": "The second best in the series because of fallen and also the forest scene"
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this the most because of the forest fight it was so great"
    },
    {
      "rating": "5/5",
      "review": "My favourite scene was when megatron killed optimus and when he came back and killed fallen and damaged megatron"
    },
    {
      "rating": "5/5",
      "review": "The second best out of 4 the forest fight was epic"
    },
    {
      "rating": "2.5/5",
      "review": "Though the whole movie overall could have been improved greatly, TRANSFORMERS: REVENGE OF THE FALLEN still delivers the excitement, and thrilling action scenes that the original had to offer."
    },
    {
      "rating": "2/5",
      "review": "A robot fighting movie has to be awesome, right? Wrong. At least in the hands of Michael Bay, who cares more about crass attempts at comedy and flashy explosions rather than having a coherent story, likable characters, or action scenes you can actually follow."
    },
    {
      "rating": "5/5",
      "review": "Megatron once again he was great in the story he even killed his brother optimus prime"
    },
    {
      "rating": "3/5",
      "review": "it was ok. not very exciting. but yea its not bad either."
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this film fallen was great megatron was weak"
    },
    {
      "rating": "5/5",
      "review": "I guess I am one of the few people who actually enjoyed this movie"
    },
    {
      "rating": "5/5",
      "review": "I hope that the last knight film is good like the first transformers"
    },
    {
      "rating": "5/5",
      "review": "Megatron was weak in this one I hope he is strong as first one in the last knight"
    },
    {
      "rating": "5/5",
      "review": "Not bad but does not deserve a 19% I think it deserves over 40 at least"
    },
    {
      "rating": "5/5",
      "review": "Megatron was injured from the first transformers film but he still killed optimus that's what I really like about this film"
    },
    {
      "rating": "5/5",
      "review": "Great film when optimus prime died and fallen rised I got so happy megatron was my favourite character in this film he was so amazing"
    },
    {
      "rating": "5/5",
      "review": "Great film it should be scored higher"
    },
    {
      "rating": "5/5",
      "review": "Great film makes sense when you watch first one"
    },
    {
      "rating": "5/5",
      "review": "Star scream was great and also bumblebee and megatron and optimus prime"
    },
    {
      "rating": "5/5",
      "review": "Watched it in cinemas great I liked it alot"
    },
    {
      "rating": "5/5",
      "review": "Great film with great fight scenes"
    },
    {
      "rating": "5/5",
      "review": "My opinion best transformer film"
    },
    {
      "rating": "3/5",
      "review": "Not quite as good as the first, but nonetheless, it's still a big, loud, funny, action-packed adventure with too many sexual jokes."
    },
    {
      "rating": "2.5/5",
      "review": "See review for movie #1. It's about the same."
    },
    {
      "rating": "2/5",
      "review": "It's good movie to watch"
    },
    {
      "rating": "1.5/5",
      "review": "I only recommend watching this movie if you are really interested in finishing the movie series entirely. The acting was god but the story was total crap."
    },
    {
      "rating": "0.5/5",
      "review": "This may be the worst movie I've ever had the (dis)pleasure of suffering through. A nonsensical plot combined with terrible humor and acting leads to a terrible cinema experience. I started checking my watch about 5 minutes into this mess of a film, and I couldn't wait for it to end. Thankfully my wish was granted, but not after enduring this drivel for almost 2 and a half hours (that I'll never get back.) Do not buy this movie. Do not rent this movie. DO NOT EVEN ILLEGALLY DOWNLOAD THIS MOVIE AT NO COST. For no reason should you ever watch this garbage. I think I'd rather use pliers to cut my nails than watch this again. You've been warned."
    },
    {
      "rating": "1/5",
      "review": "Easily the worst Transformers movie and one of the worst films ever made, as entertaining as the forest battle scene is."
    },
    {
      "rating": "2/5",
      "review": "Even though it has great visuals this movie is a loud explosion more than anything. Fails to tell a good story in any way with terrible performances and lacking cinematography. I refuse to review any other Transformers movies."
    },
    {
      "rating": "1.5/5",
      "review": "Although it looked like the franchise could head in the right direction, the sequel is filled with less sensibility, unlikable characters, racist robots, and a whole lot of mess. Two years after saving the world with the Autobots, Sam Witwicky (Shia LaBeouf) is away at college when an ancient Decepticon named \"The Fallen\" returns to Earth on a mission of vengeance. With the Allspark destroyed, the Autobots lose all hope of returning to their home planet of Cybertron, and begin working with an elite military known as NEST to hunt down any remaining Decepticons. But even as they fight for humanity alongside Major Lennox (Josh Duhamel) and USAF Master Sergeant Epps (Tyrese Gibson), the Autobots are acutely aware that not all humans are thrilled by their presence on planet Earth. Being a big fan of the first film, I remember being excited to see this film. But after seeing this film more than a handful of times, it still seems to lack a lot. Although I don't absolutely hate it as much as everyone else does, it still has its plethora of problems and issues that can't go unnoticed. Shia LaBeouf is still a fantastic actor, even to this day. I really do appreciate his talent and although his character is more spazzy and irrelevant at times, it doesn't disregard the fact that LaBeouf is a great actor. He has a lot of talent and it's a shame that people disregard him because of the lack of quality these movies possess, but he's still great none the less. Megan Fox is more or less the same in this film, but she does have a couple of decent moments. Her character is still underutilized and Bay still doesn't know how to put a respectable female character on screen due to his oversexualization of women. John Turturro's character was even more annoying in this movie, and was controversially given a much larger role. I'm surprised they stuck with his character despite the lack of likability. The parents in this movie, although not necessarily bad actors, were more annoying and infuriating. They came off as ridiculous rather than smart and it really is Bay's portrayal of these characters that makes them lackluster. The effects in this movie are still fantastic and the CGI is still amazing. It does have some improvements since the last film and I was still stunned by what the editing team did. They still deserve a lot of credit for the work they do behind the scenes, as they really do make this movie a new experience. On the other hand, Bay's use of firework explosions gets even more tiring in this film. There are explosions around every corner and they seem to get less sensible with every pull of the trigger. I get it, he loves his explosions, and he probably even masturbates to explosions, but the overuse of those effects gets really tiring, considering they're insensible and placed at bad moments. The story in this movie was even more head scratching than the last. At least the last story was simple enough, but this one was just ridiculous. The finale was exciting enough but the conclusion of all of it was the most lazy thing I've ever seen. \"The Fallen\" was a weak villain that none of us will remember. He did less than any villain in recent memory. Bay also always starts his movies with some historical background, and you'll see that present in every \"Transformers\" film. In this film, it felt like unnecessary exposition that did a poor job of setting up the true tone of this film. Bay struggles creating a consistent tone and he really needs to clean up his screenplays. The overuse of sunset shots in this movie also wasn't enough to eclipse the sheer racism that was more present. There are some events, lines of dialogue, and characters in here that are all clearly stereotyped. In these \"Transformer\" films, there are always stereotypical gripes against women, Japanese, African Americans, and more. It gets tiring after a while and the jokes aren't even funny. In the end, the sequel was more than disappointing, and probably the worst in the franchise."
    },
    {
      "rating": "1/5",
      "review": "One of the worst action movies ever made. Megan Fox is hot as hell but that's Revenge of the Fallen's only redeeming factor."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie 2nd favourite"
    },
    {
      "rating": "1.5/5",
      "review": "Revenge of the Fallen is an overlong sequel with a messy plot that makes less and less sense as the film goes on. It even manages to leave some of the more lovable characters of the first film in a more annoying light this second time around."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie and how optimus prime dies is brutal"
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed the movie fallen especially"
    },
    {
      "rating": "1.5/5",
      "review": "To be honest, I actually kinda liked this movie, in an entertaining way. Not for a plot or anything, it's just entertaining. This movie is just entertaining. And that's it. The special effects look great but that's nothing new. This movie has no plot though. If the people that made this movie learned anything about the first movie, they learned what we don't want to see in a transformers movie. I don't recommend this for anyone who wants a plot because this movie doesn't really have one. C-"
    },
    {
      "rating": "3/5",
      "review": "it's an alright movie good action scenes but terrible plot"
    },
    {
      "rating": "2/5",
      "review": "If you you had a fuck ton of fun with the first Michael Bay transformers movie like I did, then you were probably incredibly disappointed with it's sequel. the twins are meant to bring comic relief to the audience but turned out to be racial stereotypes like jar jar binks in the star wars prequels. being someone who is white myself, my intelligence was insulted at times. the film is dumb fun at times and the visuals are fine. the acting wasn't horrible, but you could tell everyone was just phoning it in. Owens grade: C-"
    },
    {
      "rating": "5/5",
      "review": "Loved it, Really fun movie to watch."
    },
    {
      "rating": "1/5",
      "review": "Made me try to blow my house up. Thanks a lot Michael Bay."
    },
    {
      "rating": "3/5",
      "review": "Not bad. Not great. Doesn't deserve a 19% though."
    },
    {
      "rating": "2.5/5",
      "review": "Watching it as a kid, really loved it. Watching it now, wishing that I was a kid again. What happened?"
    },
    {
      "rating": "5/5",
      "review": "I don't care what anyone says, It's my favorite Transformers movie ever."
    },
    {
      "rating": "1.5/5",
      "review": "Ok so not my favorite movie let's take a nap"
    },
    {
      "rating": "0.5/5",
      "review": "So.......everything has been said about this one"
    },
    {
      "rating": "5/5",
      "review": "I really liked how they changed the setting of the final battle from the City in the last movie to the middle of Egypt in this sequel. And the author kept constant suspense within the movie at all times, from Wheelie spying on Mikaela to the revival of Optimus Prime. In my opinion, it was a great movie!"
    },
    {
      "rating": "4/5",
      "review": "Transformers: Revenge of the fallen one of the best movie ever with a good storyline and a awesome and yet amazing action sequences. The graphics and visual effects in this movie was tremendous and this movie was so much better than the first one. My favorite transformer is Optimus Prime, Bumblebee, sideswipe, ironhide, megatron and starscream. This movie has lots of actions and deserves to have more hits."
    },
    {
      "rating": "1.5/5",
      "review": "Worst of them all. Great CGI, but I never thought action could get irritating. Just watch the forest battle on YouTube."
    },
    {
      "rating": "4/5",
      "review": "Not really into sci-fi but the storyline is just great and both megan fox and shia laboeuf make this film even more special"
    },
    {
      "rating": "5/5",
      "review": "This movie was awesomeplease make more might go play please make more"
    },
    {
      "rating": "2/5",
      "review": "Transformers: A Vingança dos Derrotados Consegue ter um roteiro confuso,uma historia ridícula e atuações porcas e horríveis,Desnaturaram esse filme."
    },
    {
      "rating": "2.5/5",
      "review": "Total drop off from original . But still exciting watch"
    },
    {
      "rating": "5/5",
      "review": "Transformers: Revenge of the Fallen is action packed. This movie has a lot more action than the first one. This movie has a great plot. This movie is brilliant. I would very much suggest this movie."
    },
    {
      "rating": "2/5",
      "review": "Non è cambiato molto rispetto al primo film, questo è solamente più stupido, con una trama e una sceneggiatura ancora più esagerati e ridicoli. Gli ottimi effetti speciali permangono, ma tutto ciò che fa da contorno viene trattato con superficialità, come se il prodotto finale fosse destinato solo ad un pubblico infantile. Certo Michael Bay sarà una macchina da soldi, ma pare che lo faccia più per denaro che per passione."
    },
    {
      "rating": "1.5/5",
      "review": "awful acting with to much action. There was no plot. So I give Transformers Revenge of the Fallen a D+"
    },
    {
      "rating": "1.5/5",
      "review": "Filled with cgi, and a terrible story. I did find it, somewhat, entertaining, but not as much as I hoped. Transformers: Revenge Of The Fallen is a movie for those people who love action and don't care about the story."
    },
    {
      "rating": "2.5/5",
      "review": "I really liked it still kept transformers alive"
    },
    {
      "rating": "2/5",
      "review": "Shia carried the team"
    },
    {
      "rating": "5/5",
      "review": "esta es la mejor de la saga de transformers por los chiste que me han gustado con unos mejores efectos visuales"
    },
    {
      "rating": "1.5/5",
      "review": "It is pure Bay styled with innuendos in it. Its a robotic sexual comedy."
    },
    {
      "rating": "3/5",
      "review": "Unlike the first instalment of the series, no amount of SFX, explosions. nostalgia could cover the fact that this is a lousy movie."
    },
    {
      "rating": "2/5",
      "review": "What was once something semi-interesting is now just Michael Bays (visually interesting) explosion commercial."
    },
    {
      "rating": "1/5",
      "review": "A horrible script drags down an already, at best, decent cast making for a mindless exercise in bombastic effects that more often than not leaves the viewer checking their watch."
    },
    {
      "rating": "1/5",
      "review": "What can I really say that hasn't already been said about this unfortunate franchise. You just sit around and wade through all the corny-ness in between huge explosions and video game robot fights."
    },
    {
      "rating": "3/5",
      "review": "it's a OK movie with more transformers 6/10"
    },
    {
      "rating": "1.5/5",
      "review": "Oh my god, i am a transformers fanboy and even i hate this movie, so this means : Dont even think about seeing this crap !"
    },
    {
      "rating": "1/5",
      "review": "Perhaps not the worst film, but certainly my most despised."
    },
    {
      "rating": "2.5/5",
      "review": "Basically the epitome of \"mindless action\"."
    },
    {
      "rating": "3/5",
      "review": "It feels it lost it color from the first movie"
    },
    {
      "rating": "2.5/5",
      "review": "popcorn movie .. ahaha .. anyway .. at least good effects .."
    },
    {
      "rating": "0.5/5",
      "review": "Grade: F Rating: 1.5/10"
    },
    {
      "rating": "1/5",
      "review": "F+ (Terrible Movie)"
    },
    {
      "rating": "5/5",
      "review": "optimus comes back to life at the end."
    },
    {
      "rating": "0.5/5",
      "review": "While revenge of the fallen may have the most intriguing plot of the first four movies, it manages to be one of the worst of them. Featuring even worse dialogues, an overflow of mindless action and some really bad camera work, this movie is just hard to watch and insults both your eyes and ears with tons of CGI and no human touch whats or ever."
    },
    {
      "rating": "0.5/5",
      "review": "this movie can be used asan example to avoid.the plot sucks,the actings sucks and NO NO f*** it ,this movie didn't have a reason to exist in the first place"
    },
    {
      "rating": "1/5",
      "review": "The Transformers would've been dead meat right here, but luckily, they survived a movie that's worth millions of dollars to waste."
    },
    {
      "rating": "0.5/5",
      "review": "What the hell was this?!!"
    },
    {
      "rating": "1.5/5",
      "review": "This movie fails to capture the charm of the original. Its plot is long and drawn out, though the special effects and action scenes are still dazzling."
    },
    {
      "rating": "3.5/5",
      "review": "I like this movie a lot more than it's predecessor. The action is cooler, Sam offers more to the story than attempts to get laid, and there is somewhat of a hopeless feeling throughout. As well as that, the plot is much more interesting than the first place movie, and it's not like the Transformers just show up midway through the movie. However, there are some more screw ups. Number 1, Megan Fox is involved in the series still. Number 2, Starscream has not bean taken advantage of as a character. Number 3, Sam's parents are as dumb as ever. I should probably mention the twins while I'm here. I know a lot of people are saying that the twins are racist and set blacks back 50 years or something like that, but I never thought of the twins as black stereotypes, just dumb robots. If you think the twins are supposed to be black, I think it says more about your racism than Michael Bay's. Also it's not worse than the first movie, because the first one had Bobby Bolivia and his car store. I don't know it'd people were nostalgic or something, but Transformers 2 is better than Transformers 1."
    },
    {
      "rating": "0.5/5",
      "review": "Please do not watch. Large waste of time."
    },
    {
      "rating": "2.5/5",
      "review": "The weakest in the the transformers film series. A recycled plot from the 1st movie, a weak villian, uninteresting characters, an incoherent storytelling."
    },
    {
      "rating": "1/5",
      "review": "An Abomination to Tv based Film. There was literally a bad plot in every level had so many plot holes as big as a bee hive and I really liked the first one. This is too much terrible acting and awful directing from Bay. This was Unnecessary compared to the first movie, There was an exploding exposition. I can't believe how michael bay directed bad boys 2, I wanted to like it but you can just laugh at how bad the movie was. Not With Transformers: Revenge of the fallen because I didn't laugh at all. Score: 1/10"
    },
    {
      "rating": "4/5",
      "review": "the movie was amazing"
    },
    {
      "rating": "1/5",
      "review": "Don't understand the hype.."
    },
    {
      "rating": "0.5/5",
      "review": "Speilberg regurgitates a Saturday morning kiddie contest in dire seriousness, again. I can't believe after watching the first one I watched this piece of crap too. Must have been the ice cream and that it was on cable. The violence that the robots do to each other in Revenge of the Fallen is even worse than the first one. If the robots were people, the film might get an X rating for violence. It makes me wonder if Mr. Spielberg is completely... I don't know how to put this. I can't emphasize not watching this movie as much as possible, the amount of violence and the character's attitude towards it are truly deplorable. There is one thing, though. I think people keep watching these movies with the hope that to of the movies most annoying characters will meet a painful, and fatal demise. One of the characters, Megan Fox, apparently isn't in the other sequels so at least that can be crossed off people's bucket list. That must explain the progressive decline in viewership from one sequel to it's successor. If the other character is eliminated from any further Transformer movies, I would think no one will watch the sequels, then again if that annoying guy IS in a sequel it might scare people off too."
    },
    {
      "rating": "0.5/5",
      "review": "Complete garbage, One of the worst movies I had ever seen. I regret wasting money on this thing that they call a \"Feature Film\"."
    },
    {
      "rating": "3.5/5",
      "review": "The Forest Battle Was The Best Part But The Rest Was Lack Luster"
    },
    {
      "rating": "1/5",
      "review": "A complete failure of a sequel. Michael Bay decides that the audience will rather have special effects and explosions every minute instead of character development. This film does nothing but cater to 12 year olds who seek loud explosions and shots of half nude women."
    },
    {
      "rating": "0.5/5",
      "review": "I think I just threw up a little"
    },
    {
      "rating": "1/5",
      "review": "I had a very bad time watching this."
    },
    {
      "rating": "0.5/5",
      "review": "Nonsense,explosions,more nonsense,product placement,everything you'd expect from Michael Bay."
    },
    {
      "rating": "1/5",
      "review": "An endless collage of mindless action, sexist and racist characters, and bad writing, Transformers: Revenge of the Fallen is a showcase of all the bad in blockbuster filmmaking without any of the good."
    },
    {
      "rating": "2.5/5",
      "review": "This movie was decent. The 2 robots were extremely racist."
    },
    {
      "rating": "3.5/5",
      "review": "It is not as better as the first, but marks big action and big storytelling with great dialogue from the digital characters."
    },
    {
      "rating": "2/5",
      "review": "After a solid start to a potentially great franchise, Revenge of the Fallen is a miss everywhere the first film was a hit. The destruction and chaos is simply too much, the story goes nowhere, and the humor is absolutely forced and not funny. LaBeouf once again leads the charge and does his job, but the supporting cast and the awful writing fail to help his cause."
    },
    {
      "rating": "1/5",
      "review": "Almost Everything that made the first movie exciting has all of a suddenly disappeared here. Instead replaced by a slow dragging movie with non stop cussing, too many suggestive Adult jokes, too many loud stuff, and over the top toilet humor. You may want to quit watching the movie before it ends."
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst movies I have ever seen, awful acting, cringe worthy attempts at humour and destroying iconic characters from the 80's"
    },
    {
      "rating": "1/5",
      "review": "After some promise the first film left us, Revenge of the Fallen feels like a kick in the nuts with how insulting it is."
    },
    {
      "rating": "2/5",
      "review": "Oh god. Oh dear god. What did I do to deserve to watch this movie? The plot is stupid and once again focuses on a character we don't care about instead of being what the show is about: ROBOTS KICKING ASS! Megan Fox is once again objectified by Michael Bay and the director seems to be adding more explosions and less of a substance."
    },
    {
      "rating": "3.5/5",
      "review": "The acting is so mediocre. I mean, realistically speaking, the Transformers are the best actors. The action is really good. I still think it was better than the 3rd Transformers with Shia (or whatever his name is). The girl can't act. \"Lucky Charms\" is better, but he can't act either. And nobody will ever mistake Marky Mark for being a great actor. Hopefully, the second Transformers brings in done better actors."
    },
    {
      "rating": "2/5",
      "review": "Bludgeoning audiences into submission, Director Michael Bay's high-powered rocket of action, sound, style and inadvertent product placement overly rambunctious sequel continues to value hardware over humanity. With a budget of squillions (well $200m is close enough) Bay indulges his infamous reputation of desensitising audiences with aimlessly supercharged warfare which oddly resembles a small child banging toy trucks together. Sadly, you can have too much of a good thing. This spectacular epic was stretched to the painstakingly inordinate length of 147 agonising minutes. 1 1/2 hours of overt Bay-ness is enthralling but the wow factor begins to dim when the extra hour creeps past leaving you stifling intermittent yawns with a numb bum and mind. Willing not only for the movie to finish but also the noise to stop, the relentlessly bigger and brasher crash, bang, wallop of this eardrum-assaulting second (but not last) instalment literally vibrates you where you sit. Set two years after the first, the centuries-long war between two clans of robotic aliens - Autobots and Decepticons - continues. With the fate of earth and their species at stake the human friendly Autbots team up with a covert military team called NEST to uncover any Decepticons hiding out on earth. Meanwhile, awkward teenager Sam Witwicky (Shia LeBeouf) is leaving his barmy parents (Julie White, Kevin Dunn) and stunning mechanic girlfriend (Megan Fox) to attend college. When Sam unknowingly touches and reactivates a powerful metal shard from the Allspark his brain is imprinted with a coded hieroglyphic message containing the secret location to \"the matrix\" the key to the transformers existence. Stunned, Sam drops the shard and disregards the event, until an unexpected possessed episode during his first lesson, an attack of sultry-but-nasty co-ed robot in disguise and a physical examination conducted by some newly spawned decepticon disciples brings an end to his short lived college career. The perpetrators steal the shard to awaken their leader Megatron (Voiced by Hugo Weaving) from the depths of the ocean. Megatron begins to mastermind a diabolical plan to find \"the Matrix\" to restore power to a very ancient, very evil transformer known as The Fallen. The Fallen, hell-bent on destroying earth and consuming its sun, calls to arms all remaining Decepticons on earth. Attempting to prevent the onslaught, Sam, The Autobots and NEST team up to engage Magatron and the Decepticons in an all-in royal rumble of epic proportions. Whatever performance-enhancing incentives Bay provided his technical team to create such complex and explosive visual effects were sadly all used by the time the window dressing humanoid cast appeared on set. Lebeouf is reliably dreadful and still completely disengaged from his over-tanned sexy minx Barbie doll co-star Fox. Turturro's continuance of character as the crackpot conspiracy theorist as well as the introduction of the wisecracking Jar Jar Binks style Twin robots and an ancient cockney Decepticon turned Autobot brings needed comic relief. Luckily acting is not what this movie is about; it is about satisfying that 13 year old testosterone boyhood dream of the male X&Y generation demographic. Often feeling like your watching someone else playing a really long video game, this is the pinnacle of juvenile male escapism. The Verdict: Ignoring the series correct yet redundant storyline lacking any flicker of a pulse as well as the cringeworthy dialogue and robotic acting (from the humans!) this movie for all intents and purpose was created to entertain and it does. Very Important; remember to disengage your brain and the door whilst positioning your industrial strength earplugs. Published: The Queanbeyan Age Date of Publication: 26/06/2009"
    },
    {
      "rating": "3/5",
      "review": "The Transformers movies have really grown on me! I found this one to be really inspiring. It did run longer that I felt it needed to. However, it was still very enjoyable and worth seeing."
    },
    {
      "rating": "1/5",
      "review": "it´s the worst of the franchise so far"
    },
    {
      "rating": "1.5/5",
      "review": "While the visuals still impress, Revenge of the fallen is dumber, emptier and less entertaining than it's predecessor, and suffers from extending minor flaws of the original (stereotypes, sexualization and product placement) to unbearable lengths"
    },
    {
      "rating": "0.5/5",
      "review": "Michael Bay. Nuff said."
    },
    {
      "rating": "5/5",
      "review": "In love with the movie!!"
    },
    {
      "rating": "0.5/5",
      "review": "Rating: 12% When you combine bland acting, tasteless characters, and explosions galore, you get Transformers: Revenge of the Fallen, a horribly directed sequel that doesn't improve on anything from the first film at all; in fact, it downgrades it."
    },
    {
      "rating": "0.5/5",
      "review": "Probably the most sexist movie ever made."
    },
    {
      "rating": "1/5",
      "review": "Action scenes that consist of CGI metal exploding (often literally) onto a screen do not make a good film."
    },
    {
      "rating": "3.5/5",
      "review": "a fun turn your brain off movie"
    },
    {
      "rating": "5/5",
      "review": "Great fun, but bit of a mess. Love it non the less."
    }
  ]
}