{
  "movie_name": "Another Simple Favor",
  "reviews": [
    {
      "rating": "0.5/5",
      "review": "\"Another Simple Favor,\" the sequel I awaited with the kind of breathless anticipation usually reserved for a fresh episode of Dateline where the spouse definitely did it. It was a thrill to hear Anna Kendrick and Blake Lively were reprising their roles, presumably after their characters attended a masterclass in how to systematically unlearn the art of acting. One can only assume the rest of the returning cast got a group discount. The real masterstroke, however, seems to have been handing the screenwriting duties over to our new AI overlords. The resulting script is a glorious, pixelated vomit of what a machine thinks human audiences crave after binge-watching every derivative thriller ever made. It's a meticulously calculated, yet utterly soulless, retread that has all the organic charm of a chatbot trying to express genuine human emotion. \"Insert witty banter here,\" the script probably read, \"Ensure plot twist every 7.5 minutes for optimal audience engagement.\" If you were hoping for the dark, twisted fun of the original, prepare instead for a journey into the uncanny valley of filmmaking. Written by an AI that was fed nothing but rejected Lifetime movie scripts and the diary entries of an angsty teenager who just discovered what \"plot twists\" are. The twists are telegraphed with such aggressive obviousness, you'll feel less like a detective and more like you're patiently waiting for a toddler to find an Easter egg you placed directly in their line of sight. So, I'll be over here, basking in the comforting glow of Keith Morrison's narration, patiently waiting for a movie that doesn't feel like it was conceived in a server farm. This? This was less a simple favor and more a cinematic cry for help."
    },
    {
      "rating": "0.5/5",
      "review": "The movie was a waste of time. Why do they have Blake Lively still acting?"
    },
    {
      "rating": "2/5",
      "review": "I was intrigued for the first half, bewildered the second."
    },
    {
      "rating": "1/5",
      "review": "Terrible all the way around. Terrible acting and super cringe storyline. Loved the first one, this one should have never been made."
    },
    {
      "rating": "4.5/5",
      "review": "Mantiene la Intriga pero se vuelve un poco lenta en ciertas partes."
    },
    {
      "rating": "4/5",
      "review": "So much fun! Blake Lively and Anna Kendrick are as charming as ever! The fashion is fire, and and many funny moments. If you loved A Simple Favor you will forgive a few plot holes, just to see more."
    },
    {
      "rating": "1/5",
      "review": "Awful dumb movie. Could be a relative good movie but not."
    },
    {
      "rating": "1/5",
      "review": "Terrible plot terrible acting beautiful capri"
    },
    {
      "rating": "0.5/5",
      "review": "So bad. The movie is the definition of brain rot."
    },
    {
      "rating": "4.5/5",
      "review": "I was not expecting that to be so entertaining. I turned it on as background noise and couldn't stop watching. It was a movie where you suspected everyone which was fun and the Capri setting was so gorgeous. All actors did a great job too. I actually really liked it."
    },
    {
      "rating": "2/5",
      "review": "I started it expecting to be entertained since there are huge names in the cast, but overall it was quite boring. Some convos were definitely clever and managed to make me chuckle but aside from those little moments it was really difficult to finish it, at first they dragged the premise for way too long making me loose interest and then once it finally started the pace became way too fast"
    },
    {
      "rating": "0.5/5",
      "review": "They could have done something good...and the result is ridiculous. The plot, the rapidity of the story, the characters, the ridiculous italian accent, the dialogs... OMG. It's like watching a parody of the 1st movie. The charcacters that had charism and were enigmatics are now tasteless and without any interesting sides. Next."
    },
    {
      "rating": "4.5/5",
      "review": "Fun movie that is a good pick for movie night. Even my husband enjoyed it and he hardly ever finishes movies. Acting was good and plot was interesting. The film location is beautiful and adds to the experience. I suspect many of the negative audience reviews are astroturf attacks resulting from the Baldoni legal drama."
    },
    {
      "rating": "1/5",
      "review": "If you found yourself struggling to remember the plot twist of the last movie, you aren't alone. I had to re-watch the first film. This film obviously had a larger budget as most of it had been filmed on location in the beautiful Italian riviera. There's really no new concept here and I found myself losing my interest and concentration halfway through. Anna Kendrick comes off as boring and Blake Lively as uninspiring. I don't love or hate either character....which is worse than having any emotion towards either. The movie misses every mark that the first hit. Proof that sequels are sometimes left only in the minds of the producers and never for the audience to see."
    },
    {
      "rating": "0.5/5",
      "review": "Literally so over the top and stupid. Rolled my eyes the entire time. Not nearly as fun and peppy as the first one, this one just gets dumber with every \"twist.\""
    },
    {
      "rating": "3/5",
      "review": "Kendrick's considerable charm cannot make this feel interesting or fun"
    },
    {
      "rating": "5/5",
      "review": "This whole movie was a fun ride! Really enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie both actresses were so funny, always love watching Blake and Ana they are amazing actors."
    },
    {
      "rating": "5/5",
      "review": "I loved the first movie and I loved this one too! With the way this one left off, I really hope there's a third! I'm usually pretty good at figuring out what's happening in a movie, but again, I was left stumped until Stephanie got it. I'll probably watch this one another time or two."
    },
    {
      "rating": "4/5",
      "review": "Was a good continuation of the first movie. Many twists and turns I didn't see coming and was very entertaining and enjoyable."
    },
    {
      "rating": "0.5/5",
      "review": "Watched with my family...college kids. We all agreed it was one of the worst movies we've seen. It was disjointed, bad acting, a hot mess. However many minutes long it was is time we won't get back. Minus 5 stars."
    },
    {
      "rating": "0.5/5",
      "review": "Idk what they were thinking on this one. Really silly, too silly. Almost like a long skit."
    },
    {
      "rating": "1/5",
      "review": "15 minutes in and lost interest the first one was better."
    },
    {
      "rating": "2/5",
      "review": "Beautiful scenery that I didn't see enough of. Beautiful clothing, some great looking men (a big plus at my age- just for visual appeal!) Certainly good acting- but a bit lame on writing and storyline/plot..."
    },
    {
      "rating": "4.5/5",
      "review": "Plot is totally predictable, but still a very good movie to watch."
    },
    {
      "rating": "1/5",
      "review": "The only thing worse than the absurd plot is the sandpaper dialogue."
    },
    {
      "rating": "1/5",
      "review": "Best avoided. A somewhat desperate and tragic attempt to revive careers and capitalise on a film that was only ever just above average. From the outset it relies on people already being fans of the original and understanding the strange alternate reality it is clearly set in. No one expects fiction to be realistic but this film treats the viewer as if they are completely brain dead. The writing is atrocious, the directing is lack luster, Set design is sub par, Costume is lacking, makeup is lazy and inconsistent. This films only redeeming feature is that Anna Kendrick can act... unfortunately everything I said previous to this means it's completely irrelevant."
    },
    {
      "rating": "0.5/5",
      "review": "This movie completely ridiculous. Why the 2 leads agreed to the bad writing and lack of brain cells plot is beyond me. And the heavy drinking and f bombs don't help matters. My apologies to the great Island of Capri for being dragged into this travesty of a movie."
    },
    {
      "rating": "0.5/5",
      "review": "Like other reviewers, watched for Anna Kendrick and also because we enjoyed A Simple Favour. Huge disappointment. Script is really bad at points. Like budget acting in a big budget film."
    },
    {
      "rating": "0.5/5",
      "review": "The first movie was bad enough and it didn’t need a follow up. Probably the dumbest movie I’ve seen in a while. A cheap, poorly written version of White Lotus."
    },
    {
      "rating": "1.5/5",
      "review": "Ngl I was hyped for this sequel since original movie was really good & entertaining but.. WTF did I just watched? Script is a mess and complete nonsense, that desperately aims to be Knives Out and The White Lotus but came out as cheap parody. Character development is poor, and terrible actors performances makes it even worse. If you enjoyed first movie like I am, DO NOT watch this."
    },
    {
      "rating": "0.5/5",
      "review": "I could not reason out if it was supposed to be a comedy or drama. Poorly over acted and the story line is a complete train wreck. If this is supposed to be entertaining something is wrong. No suspense and I could not care less what happens to any of the characters. The only redeeming factor is the breathtaking locale. I'd rather spend 2 hours cleaning the garage...much more entertaining."
    },
    {
      "rating": "1/5",
      "review": "\"A Simple Favor\" was much better. This one feels over the top and fails to convey the storyline clearly. The movie is filled with witless, clunky dialogue. I was tempted to stop watching halfway through, it's that bad. Truly disappointing."
    },
    {
      "rating": "0.5/5",
      "review": "Disorganized, clumsy and dumb script."
    },
    {
      "rating": "1/5",
      "review": "Bad acting and cheesy"
    },
    {
      "rating": "5/5",
      "review": "Blake Lively delivered a tour de force performance that captivated both audiences and critics alike, seamlessly blending emotional depth with effortless charisma. Her portrayal was lauded for its nuance and authenticity, earning widespread acclaim for elevating the film’s emotional core. Equally striking were her fashion choices—each ensemble a masterclass in style, curated with precision and flair. From high-fashion couture to bold, statement-making silhouettes, Lively’s wardrobe not only complemented her character’s arc but cemented her status as a modern-day style icon."
    },
    {
      "rating": "0.5/5",
      "review": "Took me 4 goes to watch it, painful to see"
    },
    {
      "rating": "1.5/5",
      "review": "The costumes and landscape do not outweigh the subpar plot line."
    },
    {
      "rating": "3.5/5",
      "review": "If you watched the first one then you know this movie isn't shooting for Agatha Christie level genius. If you enjoyed the first then you will enjoy this one. It's a fun little comedy whodunit."
    },
    {
      "rating": "5/5",
      "review": "Entairtaning, funny, and worth to watch! The first movie was better though!I"
    },
    {
      "rating": "2/5",
      "review": "Another Simple Favor takes everything that works about the first film and tries to double down on it. Unfortunately this time, instead of resulting in a solid final product, this movie comes off as an overly elaborate mess that feels right at home on streaming. Ugh. I liked this first film and hoped they would do something interesting with this one, but it’s just your standard Paul Feig streaming film that feels like Adam Sandler’s Murder Mystery movies at times. For instance, Feig directs the picture without much of a feeling for Capri, a truly beautiful location to film at, but made it look as if it was shot on a studio backlot. The movie just feels cheap and lazy. Anna Kendrick and Blake Lively lshare such playful chemistry (contrary to real life) that the laughs, zingers, and shady compliments flow effortlessly. Amidst the gorgeous Italian setting and lavish costumes, this overstuffed sequel still manages to entertain. But I have to admit, that third act really tried my patience. Far too many ridiculous twists with sluggish pacing. Too campy, too forced, not thrilling, just not great overall. Another Simple Favor essentially plays out the shift from art to “content” in real time… it’s painful to see."
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst writing, acting and movie I’ve seen in years. How a high budget production and company didn’t realize this movie was going to be that bad."
    },
    {
      "rating": "5/5",
      "review": "Fun & entertaining!"
    },
    {
      "rating": "3/5",
      "review": "Not Great Seen Worse. Glad it was FREE"
    },
    {
      "rating": "5/5",
      "review": "The outfits are giving..."
    },
    {
      "rating": "0.5/5",
      "review": "Probably one of the worst movies I ever seen, the only good thing was the location...I can't believe someone genuinely liked it. If this production succeeded in the industry, then anyone can make it, seriously. I guess this Paul Feig has a lot of connections and friends."
    },
    {
      "rating": "0.5/5",
      "review": "This movie is absolute garbage. If anybody ranked this higher than a 1, they were paid for it. It’s so bad that I want to cry."
    },
    {
      "rating": "5/5",
      "review": "Not the best movie for a logical standpoint but i laughed so much and a real entretainer!"
    },
    {
      "rating": "2/5",
      "review": "(CASTELLANO) Otro pequeño favor llega con la difícil tarea de dar continuidad a una película que, sin ser revolucionaria, funcionaba por su frescura, estilo y las interpretaciones de Kendrick y Lively. Esta secuela, sin embargo, se queda a medio camino de todo. Intenta repetir fórmula, pero sin sorpresa. Hay giros, hay glamour, hay localizaciones europeas con postales de catálogo… pero falta algo fundamental: sentido. Hollywood lleva años obsesionado con rodar en Europa como sinónimo de sofisticación, pero aquí más bien parece una excusa vacacional para el equipo. Y eso se nota. Capri está preciosa, sí, pero ¿realmente ayuda a la historia? No. Si algo lastra esta entrega es precisamente la sensación constante de que todo es forzado, de que la chispa de la original se ha perdido y de que los personajes actúan más por compromiso que por convicción. Kendrick y Lively siguen siendo lo mejor, aunque se les nota algo contenidas. La trama, en cambio, se desinfla rápido, sin rumbo claro y con un final tan absurdo como innecesario. Y lo peor es que, aun durando menos de dos horas, se hace larga. Es como cuando una serie que adorabas se renueva una temporada más y, de pronto, todo se siente innecesario. En resumen: no es un desastre absoluto, pero sí un ejemplo más de que no todo lo que tiene éxito necesita una secuela. A veces es mejor dejar un buen recuerdo que arriesgarse a estropearlo. (ENGLISH) Another Simple Favor arrives with the difficult task of following up a film that, while not groundbreaking, worked thanks to its freshness, style, and the performances of Kendrick and Lively. This sequel, however, falls short on almost every front. It tries to repeat the formula but without any surprise. There are twists, there’s glamour, there are European locations that look like postcards... but what’s really missing is purpose. Hollywood has been obsessed for years with filming in Europe as a shortcut to sophistication, but here it just feels like an excuse for a team vacation. And it shows. Capri looks beautiful, sure, but does it add anything to the story? Not really. What weighs this sequel down is the constant sense that everything is forced, that the original spark is gone, and that the characters are moving more out of obligation than conviction. Kendrick and Lively remain the best part, although they feel a bit restrained. The plot, on the other hand, deflates quickly, directionless and with an ending that’s both absurd and unnecessary. Worst of all, even though it’s under two hours, it feels long. It’s like when a show you once loved gets renewed for one season too many—and suddenly, everything feels pointless. In short: it’s not a total disaster, but it’s yet another example that not every successful story needs a sequel. Sometimes it’s better to leave things on a high note than to risk ruining the memory."
    },
    {
      "rating": "1/5",
      "review": "Disappointed.. weird acting so wooden.."
    },
    {
      "rating": "0.5/5",
      "review": "Great candidate for a Golden Raspberry Awards . Terrible movie. Two hours of my life I'll never get back. Blake Lively is always stunning."
    },
    {
      "rating": "1/5",
      "review": "The story line and plot was weak and stereotypical, the acting wooden and I found it to be reliant on wardrobe and setting - it seems Lively relies on wardrobe in order to distract from her acting, with many valuable actors in the comedy space there was opportunity beyond featuring Blake Lively twice!"
    },
    {
      "rating": "1/5",
      "review": "Another simple shit 💩"
    },
    {
      "rating": "4/5",
      "review": "This was so funny and shocking and just it was like where is this where are they going to go next with this we got a brother beep and sister beep I kind of figured it was the first triplet though but talk about sticking a knife and somebody's back they did that apparently there's going to be a sequel that I'm looking forward to what kind of craziness is going to come I'm here for it she pushed her aunt off the cliff and said she's going to be okay 🤣🤣"
    },
    {
      "rating": "1/5",
      "review": "Absolutely horrible and frankly insulting. Plot holes all over the place, disgusting incest that’s treated as a joke, terrible writing and acting. Skip it, I wish I had."
    },
    {
      "rating": "1/5",
      "review": "This movie dragged and the acting was terrible- wanna be telenovela turned movie."
    },
    {
      "rating": "2.5/5",
      "review": "Didn't the first one have a rather interesting premise of a crime thriller drama with an almost-comedic tone.. that felt like it lost the audience by the revelations and the underwritten third act? I'd call that consistency! And interesting to see a sequel at all. So! The script overall doesn't really deliver, the ending is not satisfying, and it just is a list of events that bring no character arcs or development or growth. Making the interesting people from the first a backdrop. And there's not even message or takeaway. The execution is also a series of too many little things that bring this down enough below acceptable or enjoyable. From bad pacing to a lack of tension. But putting it aside.. the acting is good, the camerawork decent, the locations gorgeous. And for once, the premise felt fresh and I didn't have a clue where it would take me! Just not enough to want to recommend this to anyone, want to watch it again, or give it a higher score. It was less than \"okay\"."
    },
    {
      "rating": "3.5/5",
      "review": "As a tandem, the \"Simple Favor\" movies stand up pretty well on their own merits. The first one was generally well-liked, but the second one isn't the bomb that the numbers indicate."
    },
    {
      "rating": "2/5",
      "review": "Had zero recollection of watching the first one, even after reading my review of it. Went into it as an Anna Kendrick fan. It would have helped to recall more of the first movie. The costumes were the best part, and the views of Capri were the second best. the saddest part was suspension of disbelief one had to sustain for the supporting characters, when one had to simply ignore them when they had served their purpose."
    },
    {
      "rating": "4/5",
      "review": "Lesbian comedy thrillers don't come along in Hollywood that often and A Simple Favour remains a delight. Thankyou Paul Feig! This sequel is a blast. Blake and Anna bring the same magic kooky chemistry. So ignore the cloutchasing Blake Lively haters currently trying to bork the reviews because they've watched too much websleuthing TikTok slop. Lesbians assemble! Let's give this film the frothy love it deserves."
    },
    {
      "rating": "2.5/5",
      "review": "\"Another Simple Favor\" is quite different from its suspense-twist driven predecessor, \"A Simple Favor\" - opting instead for a campier take, parodying the raunchy and ridiculous plot points this story has undertaken. And tbh, I was completely down for it. The first iteration was, in my opinion, too dreary and serious at times, leaving audiences slightly bored. However, this new update is able to highlight Anna Kendrick's sarcastic, laid back comedy to lead the tone of this film to great effect with similarly eclectic characters, such as Blake Lively's (aka Emily's) character, Lively plays the one minute your goofy AF bff to your quite possible maybe murder suspect, to a deliciously fun effect, alongside heightened returning characters in the love interest, Henry Golding, and new introductions, including Emily's hunky fiancé, slick mother-in-law, delirious birth mother and outspoken aunt to the fray. To note, the film can be incredibly insensitive, especially when there is a terrible mishandling of a R scene - without focusing on the gravity of the event at all - this storyline was added purely for a callback joke, which is downright disgusting and downplays real, distressing experiences. In addition, I feel like the Black sassy best friend one-note stereotype is incredibly old, and we need more dimensional POC characters. This has been said time and time again. This sequel is literally a fun murder mystery fully aware to its silly tropes, and we're here for it - best used for a digestable, quick watch."
    },
    {
      "rating": "2.5/5",
      "review": "The dynamic between the two lead actresses still works, especially in the first half of the movie, but... damn! What a mess of a plot in the second half! It's turning into such a stupid story that it ruins all the fun."
    },
    {
      "rating": "2.5/5",
      "review": "Blake et Anna sont toujours autant talentueuses, mais j'avoue que le scénario n'était pas très convaincant."
    },
    {
      "rating": "4.5/5",
      "review": "Loved the dynamic between the two main leads and loved how it made the whole plot come together without leaving any plot holes. Most of the the hate seems forced apart from what is going on in the blake lively case the movie is genuinely a fun movie watch."
    },
    {
      "rating": "2/5",
      "review": "This movie is too long with too many poorly written scenes. Has some interesting parts but movie is let down by the lines that fall flat. Pity because I love the actors and their past comedic roles."
    },
    {
      "rating": "2/5",
      "review": "While it’s popular to hate on Blake Lively, she really does give nothing to root for. Anna Kendrick carries this whole film on her tiny little back- all comedy, drama, and believable acting comes from her. While Anna and the rest of the cast try to make up for the monotonous and flat acting of Blake Lively, almost succeeding… Blake’s cringe-worthy twin (or whatever) act comes on screen and takes whatever credibility this film does have and pushes it off a cliff. Do us a simple favor and don’t make another sequel."
    },
    {
      "rating": "3/5",
      "review": "Another Simple Favor lacks the intrigue and dry wit of its predecessor, but Anna Kendrick and Blake Lively’s incredible onscreen chemistry make it an entertaining enough second caper!"
    },
    {
      "rating": "5/5",
      "review": "Loved the dialogue and I’m definitely a Blake lively fan. I hope they make a third one. It was very funny, snippy, and the plot was very sweet with a slap of crazy."
    },
    {
      "rating": "5/5",
      "review": "These one star reviews are citing cursing as a reason to give this movie 1 star? Weird. I loved A Simple Favor, and aside from one omg scene in this sequel, this was just a fun and lovely Friday movie. Cool clothes and zippy lines and silly fun. I watched it like 3 times."
    },
    {
      "rating": "3.5/5",
      "review": "Pretty simple, won't break new ground, but I genuinely laughed more than a few times. Keep your expectations low and enjoy a few chuckles. I haven't seen anything too hilarious lately so it was fun. Good comedic acting. Have to admit I have liked Pau Feig movies more than a lot of people."
    },
    {
      "rating": "3.5/5",
      "review": "Honestly ignoring the drama, the hilarious dialogue and too relaxed atmosphere of mob family crime in capri Italy is a worthy follow up to the soon to be classic Kendrick lively collaboration."
    },
    {
      "rating": "1/5",
      "review": "Possible the worst acting and dialogue i have ever witnessed"
    },
    {
      "rating": "3/5",
      "review": "Another simple favor was a good sequel. Anna and Blake did phenomenal jobs. It’s so hard trying to play twins or triplets so Blake did an awesome job. The plot was good as well. I would recommend this movie."
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst movies ever made! Not worth watching."
    },
    {
      "rating": "1/5",
      "review": "This is why we shouldn’t do sequels."
    },
    {
      "rating": "5/5",
      "review": "I have no idea why some people don’t like this film. If you watch the first movie, you know the backstory of these characters, which is important to know for the sequel. It has twist and turns that makes sense if you know what happened in the previous movie. Lively did a good job. She is chic cold and fabulous, Anna Kendrick did amazing as well that she’s not as soft as she was before but she’s a little bit tougher, which I can understand in her character. This film had twist and turns that I did not catch and it was very well done. You cannot judge a sequel. If you don’t know the first movie you need to know the first movie before you watch this one and trust me it’s worth it."
    },
    {
      "rating": "0.5/5",
      "review": "Pathetic attempt of copying White Lotus"
    },
    {
      "rating": "0.5/5",
      "review": "Beautiful location, but the film is trying too hard (in other words, boring.) Anna K. is ok, but Blake just plays herself and the scene with \"herself\" is beyond creepy."
    },
    {
      "rating": "1/5",
      "review": "Turned it off 10 minutes in. F words all over the place. You'd think it was Pulp fiction."
    },
    {
      "rating": "4/5",
      "review": "\"Another Simple Favor\" has returned with a sequel featuring Blake Lively and Anna Kendrick, and while it may not have impressed the general audience, I have to say I found it hilariously entertaining. Sure, it may not be a masterpiece of comedy, but it certainly has enough creativity to continue the story of Emily and Stephanie. I thought the first film was a solid watch, especially with its intriguing twin twist. I’ll give a slight spoiler here for those who haven't seen it: the introduction of a triplet adds a fun layer to the plot, and I appreciated the unique direction they took. In my opinion, the sequel is far from bad. I genuinely enjoyed it from start to finish. Emily's character development into a new persona while retaining her quirky charm was delightful. Meanwhile, Stephanie’s growth, despite her often frustratingly naïve behavior, still hits the right notes. I'm definitely on board for a potential trilogy; the groundwork has been laid, and I would fully support it. It's a shame this installment went straight to streaming instead of hitting theaters, especially since the first film was a box office success. Nevertheless, I had a great time watching it and wouldn't hesitate to recommend it!"
    },
    {
      "rating": "2.5/5",
      "review": "There were parts that were really very good, but then it kinda went a little flat. The repartee between Anna Kendrick and Blake Lively is what these movies is all about. It is sassy and funny. The first 1/3 to 1/2 of the movie had a whole lot of this and it really carried the movie. But then the characters kinda diverge from one another and the movie slowed down. The whodunit portion was OK but a little silly. Overall I liked it but it could have been better."
    },
    {
      "rating": "5/5",
      "review": "A Simple Favour 2 is about as funny as Anna Kendrick, Fing! Her cousin from first 1."
    },
    {
      "rating": "1/5",
      "review": "Loved the first one. They should have stopped while they were ahead. This movie was quite possibly one of the worst I’ve ever seen. Terrible, predictable plot, thirty minutes too long, with an ending that makes ZERO sense. Do yourself a simple favor and skip this one."
    },
    {
      "rating": "5/5",
      "review": "Great film , unexpected twists, recommend on a open free mind. If you like 2012 * That's my boy ) you will definitely like it."
    },
    {
      "rating": "0.5/5",
      "review": "Quite possibly one of the worst movies I’ve ever started to watch. Only made it to 15 minutes before the awful dialogue had me cringing so bad I had to switch it off. Kendrick is usually great to watch but struggled with her trying to be a ‘bad bitch’ alongside Lively’s ….well…I’m not even sure how to describe Lively outside of just awful. A budget SJP from the early SATC days, and it shows, her acting in this is abysmal"
    },
    {
      "rating": "0.5/5",
      "review": "Very boring. Anna Kendrick was good though."
    },
    {
      "rating": "1/5",
      "review": "Worst than the rating that’s already given . Waste of time , predictable plot , poor acting ."
    },
    {
      "rating": "5/5",
      "review": "This was a fun movie. I really enjoyed the first one,but hesitated with the second due to low scores. I am glad I gave it a chance. I pride myself on solving mysteries,long before the end of the film. Not this time,not even close. It has the same charm of its predecessor,without duplicating the plotline. It even rewrites the first in a way. If you think you know everything, well you don't. Similar to Happy Death Day 2,a surprising sequel that didn't harm its roots,in fact expanded . Give it a chance. Trust the critics. Over 60 percent isn't bad. I would give this film 4.5 stars. Very entertaining and fun."
    },
    {
      "rating": "1/5",
      "review": "It’s horrible, boring, like a bad school project."
    },
    {
      "rating": "1/5",
      "review": "This movie was so bad I couldn’t tell if it’s a spoof of a Lifetime movie or not. It’s so ridiculous and far-fetched. The plot was even dumber than the first one."
    },
    {
      "rating": "5/5",
      "review": "I really liked the first movie so I wasn’t totally on board with a sequel… boy, I was wrong. This was everything I wanted and even more. An intriguing story, gorgeous Capri and two potent performances from both (especially) Blake Lively and Anna Kendrick make this second chapter even better than the first one. I hope they’ll do a third movie! Five stars for sure!"
    },
    {
      "rating": "5/5",
      "review": "I LOVED it. It is even better than the first one and Blake’s performance is GREAT. Such a wild ride. Congrats to Paul and the entire cast."
    },
    {
      "rating": "0.5/5",
      "review": "The worst film I have watched in a long time. Very awkward, very stupid, makes the first film less enjoyable."
    },
    {
      "rating": "0.5/5",
      "review": "Why does Blake Lively play the same character in every movie? I do not recommend. There are some very creepy and twisted scenes."
    },
    {
      "rating": "3/5",
      "review": "Could’ve been better. The story was pretty predictable and a carbon copy of the last one’s plot/theme. However, like copies, they’re usually not as good as the original. This sequel lost the edge of the first one, and the discovery of sisters to blame murders on is getting ridiculous. I feel like I missed the episode of the Brady Bunch where they all escaped from an insane asylum and started murdering each other. Anna Kendrick brought the same talent to her character but Blake Lively’s character played it a little safe from the last time we saw her. The only thing I didn’t see coming was the cover wedding to hide Emily’s fiancé’s actual love interest. I also don’t understand introducing the FBI characters then not using them at all only to kill them off unnecessarily. I think they could get the allure of the first movie back by spending more on the writing and less on the cast, wardrobe, and shooting locations."
    },
    {
      "rating": "2.5/5",
      "review": "Blake Lively and Anna Kendrick still have chemistry, but Another Simple Favor overcomplicates its mystery with mafia drama and over-the-top plotting. Beautiful to look at, but not much else. More chaos than cleverness."
    },
    {
      "rating": "0.5/5",
      "review": "Decided to watch this movie because I enjoyed the first one and was disappointed. It started off fine but quickly went down hill as the story was going in every direction. By half way through I was pilling out my phone looking up things on line. Yeah it was that bad. I’m sorry to say, Don’t waste your time."
    },
    {
      "rating": "1/5",
      "review": "It’s boring from the beginning. It feels like the studio wanted to squeeze out a watered down version of the original just to make a few dollars. While I liked Blake in the first one, not this one."
    },
    {
      "rating": "5/5",
      "review": "I was obsessed with everything Blake wore. It was funny, twisted and had some unexpected twists like the first one. I loved it"
    },
    {
      "rating": "2/5",
      "review": "I really liked the first one but this one…. Absolutely not. I feel like it took so long to get to the actual conflict. Like an hour of this movie was not needed at all and bored me. If you liked the first Simple Favour, skip this one because it will ruin the first one for you."
    },
    {
      "rating": "3.5/5",
      "review": "This movie was a lot of fun and looked absolutely gorgeous. I felt like it did a better job at balancing the tone between murder mystery and comedy than the first. The movie does go a little off the rails near the end and there are a few plot holes, but overall, it’s still a very entertaining movie. Anna and Blake have great chemistry as well."
    },
    {
      "rating": "3/5",
      "review": "This movie is meant to be twisted and unbelievably campy. Anyone who thinks that this plot is taking itself seriously does not understand the genre. That being said, it’s a fun watch. Not the best movie ever, but certainly not terrible. Also, some of the scenery is absolutely stunning."
    },
    {
      "rating": "1/5",
      "review": "I enjoyed the first movie. The second one seemed like a parody type movie. I'm not sure if it was rushed? A lot of bad ideas made it into this movie."
    },
    {
      "rating": "0.5/5",
      "review": "2 hours of my life I can not get back. Possibly one of the worst movies ever made. Disappointed Anna would take such a role. The incest was the ridiculous cake topper. Can not verbalize how cringe this was."
    },
    {
      "rating": "1/5",
      "review": "This was one of the worst movies I’ve watched. Horrible plot, straight up cringe. Huge let down after the first."
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely terrible. Don't waste your time."
    },
    {
      "rating": "0.5/5",
      "review": "Trash! Anna Kendrick excellent. Blake lively playing herself yet again."
    },
    {
      "rating": "1/5",
      "review": "Simply awful. Hard to watch."
    },
    {
      "rating": "1/5",
      "review": "It was just soooo bad! Loved the first one."
    },
    {
      "rating": "5/5",
      "review": "THEY. DELIVERED!!!!!!! Started off slow but was pleasantly surprised by the end of the movie!!"
    },
    {
      "rating": "3.5/5",
      "review": "The first one was fun. The second one facical. Although some critics got deep into Lively and Baldoni! I watched it for the scenery and fashion. Louboutin and the red soled shoes, Capri, gorgeous and some good actors albeit in a silly film but was ok. Please god not a third but seems to have sparked a following of fashionistas."
    },
    {
      "rating": "1.5/5",
      "review": "It's pretty difficult to enjoy and stay invested in a movie when every single character is unlikable, and every point that moves the plot forward is hokier than the last. I didn't think it was possible for me to dislike characters portrayed by Anna Kendrick and Henry Golding, but here we are. This was a major downgrade from the first."
    },
    {
      "rating": "0.5/5",
      "review": "More than just a disappointment, this film was so bad it made me angry. The cynicism, the laziness on display here are an insult to film-making. Nothing makes sense, nor does it even try to. I had high hopes for this film after the camp delights of the original, but wow, what a shocker this is. Outrageous costumes and settings aren't enough, the script needs to make sense, to move us, to make us laugh or to feel suspense. This pile of crap just made my teeth ache and made me wonder how people like Allison Janney (dear god, nooooo!) can be so desperate for cash? for work? (surely not) that they lend their talent to such bilge! Next time Allison please treat yourself to some well earned time off and trust that the universe will provide. You only do yourself a disservice by lending your name to this sort of rubbish. Shame on everyone involved."
    },
    {
      "rating": "1/5",
      "review": "Garbage. Too much going on. Bad acting and outrageous plot that is not believable."
    },
    {
      "rating": "5/5",
      "review": "I didn’t want to like this movie because I am tired of Blake Lively and wish she would go walkway. I was surprised to really like the movie. It kept me interested with plot twists and humor. It is entertaining and was as good as the 1st one maybe better."
    },
    {
      "rating": "4/5",
      "review": "Please hurry with another simple favor 3"
    },
    {
      "rating": "0.5/5",
      "review": "Pushed the envelope too far."
    },
    {
      "rating": "1/5",
      "review": "Terrible plot and acting. Only watched it for Anna. What a shame. Should've left it at A Simple Favor. Simple."
    },
    {
      "rating": "5/5",
      "review": "Actuaciones bastante simples, guion simple y chistes simples, pero realmente cautiva. Aveces simple es mejor, me hacía acordar Scooby doo buscando el verdadero culpable y siempre dejando abierta para una nueva película. Creo que el estilo de Blake y la sinceridad de Anna es una mezcla bastante particular y funciona!"
    },
    {
      "rating": "5/5",
      "review": "I need at least 10 more movies, I can’t get enough of these 2!!"
    },
    {
      "rating": "0.5/5",
      "review": "A queer love story wrapped in incest. Blake Lively is giving queer people a bad image through this film."
    },
    {
      "rating": "5/5",
      "review": "so fire. anna kendrick is the bessssttt her delivery is just unbeatable. im a hard one to please with movies and this is a good one :) i expected to be disappointed cause sequels always suck. and well… blake lively lol. but anna kendrick saved the day. entertaining watch"
    },
    {
      "rating": "1.5/5",
      "review": "Steaming pile of rushed cinematic garbage. The CGI is so hokey, The plot has intrigue, but honestly the outcome was just forced. This movie didn’t need to be made. The ending geared up for a third film… Should’ve just kept it at the first movie. Don’t waste your time with this one unless you need something to play in the background while you’re doing something else 👍🏼"
    },
    {
      "rating": "5/5",
      "review": "I think most movie sequels are not good but this movie had me on my toes. Every time I thought that I knew what was going on there was another surprise. I personally thought it was really good and can’t wait for the next one. Also it was funny to me but I like this mystery/comedy genre movie."
    },
    {
      "rating": "1/5",
      "review": "The first one was fun. This just seems desperate with a lazy script. And Blake Lively seems to just be playing herself so there's that. The setting is pretty though."
    },
    {
      "rating": "5/5",
      "review": "Loved it. I didn’t know there was a sequel and found it on Prime by chance. Hoping there is another one."
    },
    {
      "rating": "1/5",
      "review": "It gave a Pretty Little Liars vibe with an incest and sexual assault bonus no one asked for. The movie needs more originality and depth rather than just mimicing Game of Thrones and Pretty Little Liars. I was waiting for them to start referring to the murderer as \"A\". The unknown twin/tripIet/sibling has been done too much and I was hoping the twist was Emily's son. Editing was sloppy at times and now knowing Blake's style of directing and creative influence, I could tell which scenes she took over behind the camera. The different styles didn't flow. Maybe that's why the plot was all over the place. I like to think of a movie as a smooth roller-coaster, not an old Chevy going 100 mph down a bumpy dirt road which leaves your butt sore afterwards. Enough with the hats already."
    },
    {
      "rating": "4/5",
      "review": "Very good movie not as good as the first one but there was whitty humour and predictable plot twist however the characters were played well and the film was entertaining"
    },
    {
      "rating": "4/5",
      "review": "Excellent...and there's another one? I can't wait"
    },
    {
      "rating": "0.5/5",
      "review": "Allison Janney deserved better. This movie is just awful. The plot does not make ANY SENSE AT ALL. It's weird (not in a good way), it's messy, uncomfortable to watch and so poorly acted. Don't waste your previous time on this one"
    },
    {
      "rating": "0.5/5",
      "review": "I really did not like the plot of the movie and did not like the incest triplet parts it made me feel queasy. I liked the first movie much better."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed it and I thought it was better than the first one"
    },
    {
      "rating": "0.5/5",
      "review": "This movie went from bad to very lame so quickly I couldn't bring myself to finish it. It's like a 1st grader wrote a ridiculous plot and gave the roles to bad actors with no experience to say all the cheesy lines. Please don't make the 3rd movie cause that was a pure torture."
    },
    {
      "rating": "0.5/5",
      "review": "This has been one of the worst movies I’ve ever seen. This must have been written by AI. Don’t waste your time."
    },
    {
      "rating": "0.5/5",
      "review": "Another Simple Favor is depraved. Everything about the movie--language, plot, visuals-, actions around children---is to normalize depravity. The world simply cannot be ok if this type behavior is shown as normal by Hollywood."
    },
    {
      "rating": "2.5/5",
      "review": "This sequel is a mere echo of the original. Sure, there are some good one-liners and a few amusing twists. But they were too few and far between. In truth, the same cinematic ends could have been accomplished in a movie that was at least a half-hour shorter. Bottom line? By the end, ASF 2.0 proved to be a bit of a yawner."
    },
    {
      "rating": "0.5/5",
      "review": "We couldn't finish it! Horrible movie. They thought they were being clever with the plot but so stupid.. do not waste 2 hours of your life. Horrid acting and terrible plot. It's like they watched \"knives out\" and then tried to write their own version but failed miserably."
    },
    {
      "rating": "5/5",
      "review": "The dynamic between Kendrick and Lively is just as magnetic and mysterious as the first film, easily capturing the attention of the audience. The storyline is just barely good enough to be intriguing, as it lacks a certain amount of realism."
    },
    {
      "rating": "1/5",
      "review": "Cringe and really hard to watch."
    },
    {
      "rating": "1.5/5",
      "review": "The first movie was good but the attempt to keep the same chemistry lacked . Plot started out fun but fell flat and also Kendrick is a natural when it comes to humor so that seemed to be held back and watered down . I won’t give spoilers , just not as well written as the first and trying to hard to keep people interested. It definitely had potential"
    },
    {
      "rating": "5/5",
      "review": "Twisted, weird and loved every minute of it!!!"
    },
    {
      "rating": "4/5",
      "review": "Not as good as the first but definitely recommend it. Witty, funny but also a little creepy and keeps you guessing. A Simple Favour was a hard movie to follow but they smashed it! Not a 5 star as I felt it was a little more predictable than the first movie and it lacked the big finale of the first movie that I was expecting."
    },
    {
      "rating": "1/5",
      "review": "I wanted to believe in the movie but unfortunately it did not deliver. Blake Lively was lackluster and did t quite deliver like her other costars, which is important since she’s in most of the scenes. The wardrobe was hit or miss for her but when she missed the mark it was really, really bad. The incest part was disgusting and reaching for a reaction that didn’t want to land. Also, quoting Brian Freedman in the movie just made light of the seriousness going around and made it about her vs everyone involved in the movie."
    },
    {
      "rating": "5/5",
      "review": "This was a really good movie. The story was good I was entertained and had humor written in well. Everyone acted good and the location was gorgeous. Lively and Kendrick have good chemistry which is party of the reason I enjoyed the film. I did also like the twist the film had, made it engaging and entertaining."
    },
    {
      "rating": "2/5",
      "review": "I will keep it short and sweet. LOVED the first movie and watched I several times. Not a big fan of Blake but did like her character in the first one. Big fan of Anna. WTF did I just watch with this sequel? It started not bad and pretty decent but then about half at through until the end the storyline just went down hill. It was stupid and disturbing not even in a funny way if that’s what they were going for. If you haven’t seen the movies I recommend the first one but don’t ruin it for yourself with this one."
    },
    {
      "rating": "0.5/5",
      "review": "Nothing makes sense, neither the plot nor the characters. It's filled with one cringe-inducing scene after another, resembling a high school play with inappropriate language. The script was so poorly written that even good acting couldn't redeem it. I watched out of curiosity, and it turned out to be worse than I had expected."
    },
    {
      "rating": "5/5",
      "review": "This film is perfection! Even better than the first. It's pushes boundaries that make you cringe, but it's done with humour. It's twisted and full of humour that makes you feel bad for enjoying this film. The plot borders on unbelievable but that's what makes it so great. Please do a third in the installment"
    },
    {
      "rating": "1/5",
      "review": "This is worse than the first movie. I love Anna Kendrick and I get there's a lot of hype because of the BS lawsuit Blake Lively filed her costar from her last movie, so I was interested in seeing this, but I have never thought Lively was a great actress. Just skip this altogether. It tries so hard and it's campy at best. Anna, don't do anymore movies with your costar"
    },
    {
      "rating": "0.5/5",
      "review": "Blake ruins everything now"
    },
    {
      "rating": "1/5",
      "review": "I thought it was cringe. It's hard to tell if it was Blake's character or her acting that gave the ick. But the storyline didnt help. It was irratically dull, which typically doesnt make sense, but it's what comes to mind. Like, random twists that were lack luster. There was one moment that perked up, where the question was, \"ooo, who is this guy?\" But after that, it lost my interest. The theme of incestuous relationships with the sense of complacency and acceptance was outright cringe worthy. I wanted to turn it off so many times but instead used it for background noise for my nap."
    },
    {
      "rating": "1/5",
      "review": "The Sequel Nobody Needed… But Somehow Got a Bigger Budget? So this was… pure ridiculousness. But like, “leave it on while folding laundry” ridiculous. I rewound three times while multitasking and still didn’t miss a thing. Oh, and if you haven’t seen the first film, good luck—this one’s bursting with winks, nods, and inside jokes on steroids. In a nutshell, the sequel serves up more fashion, more incest, more man candy, and prettier views—but somehow with less mystery, less logic, and way more Scooby-Doo-level nonsense (not in a fun way). That said, Anna Kendrick deserves an award for consistently bailing water out of this sinking ship with every ounce of her chaotic, perky energy. Bless her heart—she really tried to keep this mess afloat. And honestly, she’s the only thing that made it bearable. I even chuckled through some of the cringe, thanks to her. But also… WTF did I just watch? Turning SA into a quirky plot twist? Um hard pass."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie ive ever seen in my entire life"
    },
    {
      "rating": "4/5",
      "review": "A lot of fun, twists and turns along the way. Great performances and casting and funny! Bravo! Had a great time with this film and would watch again."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was horrible! The only things I liked were Anna and the scenery. The acting by Blake and her love interest was just bad. I could barely make it through this train wreck of a movie. The plot was not clever and predictable. Don’t waste your time, watch something else."
    },
    {
      "rating": "1/5",
      "review": "It's cringe-worthy and twisted."
    },
    {
      "rating": "1/5",
      "review": "Horrible acting by a horrible human(Blake). Anna was amazing as always. I’m glad she’s been so successful. Would not recommend to watch if it wasn’t for Anna . That’s it."
    },
    {
      "rating": "0.5/5",
      "review": "Disappointing Sequel – Blake Lively’s Acting Ruins It Again I had hopes for A Simple Favor 2, but unfortunately, it was even worse than the first. Once again, Blake Lively’s acting was flat, boring, and painfully predictable. Her performance didn’t add anything to the story—in fact, it took away from it. And having two Blake Livelys on screen (as her character’s sister) just made it worse. The portrayal of the “crazy” sister was over-the-top, unconvincing, and honestly felt like watching a kindergarten play. The only bright spot in this movie was Michele Morrone. His performance was captivating and natural, and I’d love to see him in more roles. He truly stood out among the cast. Unfortunately, the plot was just as weak as the lead performance—confusing, messy, and not engaging at all. It felt like a waste of time. I really don’t want to see another Blake Lively movie after this. Verdict: Skip it. It’s not worth your time."
    },
    {
      "rating": "0.5/5",
      "review": "First half was ok., then i was what the hell nothing made sense n everything made sense on stupid level"
    },
    {
      "rating": "2/5",
      "review": "it wants to be look like an expensive and mysterious movie but smells so so cheap."
    },
    {
      "rating": "0.5/5",
      "review": "Don't waste your time watching this movie. I'm shocked it was greenlit in the first place."
    },
    {
      "rating": "1/5",
      "review": "Feels like it is trying to mimic and ride the popularity of The White Lotus.... only poorly done. The location is stunning. The outfits outrageous enough to peak curiosity. Anna Kendrick carried this film. Blake Lively plays herself to cover her bad acting. Plot becomes more and more ridiculous."
    },
    {
      "rating": "5/5",
      "review": "Fun writing, well acted, works well as a sequel."
    },
    {
      "rating": "1.5/5",
      "review": "The charm is lost in #AnotherSimpleFavor, which doesnt benefit from the novelty of what made the original special - its tonally jarring zaniness against a quiet domestic backdrop. It tries too hard to up the ante, but making things bigger & more complicated doesn't make it better."
    },
    {
      "rating": "1/5",
      "review": "I enjoyed the original especially Anna Kendrick but this was just awful. How reviewers can say this is a good movie is shocking. It moved from ridiculous to disgusting. It forever ruin the first movie. I could not finish it - that long list of warnings before the movie began I should have read! Don't watch this if you liked the original!!"
    },
    {
      "rating": "0.5/5",
      "review": "This was one of the worst movies I’ve ever seen. The plot was dumb. The acting was terrible. I would not recommend anyone wasting their time to watch this movie."
    },
    {
      "rating": "5/5",
      "review": "This movie was honestly so good!! Loved it!"
    },
    {
      "rating": "1.5/5",
      "review": "They should have stopped at A Simple Favor. The sequel is not worth your 2 hrs. The setting is beautiful but everything else was bad."
    },
    {
      "rating": "5/5",
      "review": "Was this the first movie, no, but it was super fun and good. I had no expectations of our being the first movie. I did however really enjoy this movie. I really enjoy Blake Lively and Anna Kendrick together. They are a wonderful acting team. This came out the day after my birthday and it was so great I enjoyed spending some alone time watching this movie."
    },
    {
      "rating": "2.5/5",
      "review": "The success of the sequel relies on the formidable acting skills of the cast. More laughs keep it light but a contrived plot bogs it down. All told a glossy great looking pleasant diversion"
    },
    {
      "rating": "1.5/5",
      "review": "\"Another Simple Favor\" (2025) reunites Anna Kendrick and Blake Lively, promising more of the dark humor and twisty intrigue that made the first film a cult hit. However, this sequel ultimately falls flat, failing to recapture the engaging spark of its predecessor and delivering a narrative that struggles to hold the viewer's attention. While the film retains the stylish visuals, sharp fashion, and the undeniable chemistry between Kendrick and Lively, these elements aren't enough to compensate for a plot that feels convoluted and increasingly absurd. The initial intrigue quickly dissipates as the story spirals into outlandish scenarios that lack the grounded wit and surprising twists of the original. The attempts at dark comedy often feel forced, and the mystery at the heart of the narrative fails to generate genuine suspense. The characters, while still portrayed with a certain flair by the lead actresses, become entangled in increasingly unbelievable situations, making it difficult to remain invested in their fates. The pacing of the film contributes to the lack of engagement. Scenes often feel drawn out, and the numerous plot twists, rather than adding excitement, become tiresome and detract from any sense of realism or believability. The film struggles to maintain a consistent tone, further hindering the viewer's ability to connect with the story. Ultimately, \"Another Simple Favor\" prioritizes style and shock value over a compelling and engaging narrative. While the return of Kendrick and Lively offers some initial appeal, the film's convoluted plot and lack of genuine intrigue make it a disappointing sequel that fails to capture the magic of the first \"simple favor.\""
    },
    {
      "rating": "2.5/5",
      "review": "this movie is no where near the first movie, i'm glad they kept the same cast and the new additions i didn't mind during the movie. their were some crazy twists and turns that i didn't really see coming but ultimately this movie left me so confused they changed how she was a twin to being triplets in this movie, because they couldn't figure out who will be the murder of this movie. Anna Kendrick and Blake Lively did put on a good performance even thought it was poorly written. i gave this a 5.5 out of 10"
    },
    {
      "rating": "5/5",
      "review": "Campy fun and enjoyable, snarky absurdity. Much more comedic than the first. Great performances from Blake and Anna. I really hope they do a third installment!! Such a fun watch! :D"
    },
    {
      "rating": "1/5",
      "review": "Grossly cringe couldn’t finish this movie. Why would they even make a 2nd one? Some of the clothing choices were so absurd. A zero star review would have been my choice."
    },
    {
      "rating": "5/5",
      "review": "What a terrific film! I absolutely loved it. It was full of twists and turns, with sensational performances from Lively and Kendrick."
    },
    {
      "rating": "4/5",
      "review": "From a critical point of view I don't think a lot of acting went into the role. These were all the worst parts of Serena (which I enjoyed). The middle was a bit dry... Like Anna Kendrick took a while to really bring herself into the story but when she finally did the chemistry with Blake and Anna was there but it wasn't on screen long enough. And the FBI agent and Shawn could have been left out. Or May be the FBI agent double crosses both of them because she loves the mob guy. There was a lot of storyline potential without a lot of thought about how to leverage the media around the social conversation happening around these themes."
    },
    {
      "rating": "1/5",
      "review": "Total snoozer. Anna Kendrick cannot save a movie that should never have been made. A sequel without a plot, purpose, and without rhythm/chemistry is not one that should be made."
    },
    {
      "rating": "0.5/5",
      "review": "Gross and sick! Made me want to throw up. Don’t watch. It’s demented and surprising that the twist got past the first draft. Don’t watch."
    },
    {
      "rating": "0.5/5",
      "review": "How is this getting 5 stars? Genuinely confused. Unless people were paid or held at gunpoint, I can’t imagine why anyone would give this cringe-fest a perfect score. The movie is painfully awkward, weirdly tone-deaf, and utterly pointless from start to finish. Blake Lively plays the same character in every movie — zero range, same smirks. Anna Kendrick actually has talent, which makes it even more depressing to watch her waste it on this trainwreck. The storyline feels like it was scribbled by a 15-year-old who just discovered plot twists but forgot about logic. Total waste of time. Save yourself."
    },
    {
      "rating": "2/5",
      "review": "Another simple favor isn't a sequel I feel anyone asked for, and after watching it, it's safe to say this isn't a sequel anyone actually needed. It's pacing starts slow and then feels all too rushed half way through. Additionally, the plot feels forced, awkward and clunky and feels like it should never have left the drawing room. Personally, it's not the worst movie I've ever watched, but it certainly won't be a movie I'd recommend or bother to watch again."
    },
    {
      "rating": "0.5/5",
      "review": "a horrible movie, thats a zombie husk of the first movie which was witty and had a level of comedic charm, This is simply refried beans without the benefit of any redeeming characteristics. cleanse your ears and eyes if you are exposed or go watch paint dry"
    },
    {
      "rating": "0.5/5",
      "review": "I had to watch this movie because the trailers created some intrigue, hinting at a clever, humorous plot with some interesting characters. Unfortunately, it was like a train wreck that you can't look away from. Although Im not offended by potty words, I think it was the overuse of profanity and classless innuendos, primarily by Blake's character, that underscored the lack of originality that went into the script writing. I guess they thought it would make for a more edgy, \"sexy\" dialog between characters. But as with everything else in this movie, it was just another swing and a miss. I didn't expect much from Blake Lively, who's never exhibited much talent or personality, but her lack of chemistry with everyone in the cast made for some very awkward and insincere exchanges... Just cringe. Between the creepy, incestual relationship that came out of no where, the B-rated acting by all parties, and the pathetic attempts at humor, it was clear that no one who viewed the prescreening or movie premiere provided any honest feedback. If they had asked for, and listened to, even an ounce of unbiased feedback from an outside party before moving forward with such a chaotic, unhinged and unwanted plot line, they might have been able to create something that didn't leave the audience feeling dirty and disturbed for having watched until the end. On the bright side, at least I didn't waste my money to see this piece of garbage!"
    },
    {
      "rating": "5/5",
      "review": "This is delightful fun! It's hard to top this original but this film holds up. Worth the time"
    },
    {
      "rating": "2.5/5",
      "review": "If you enjoyed the first, you’ll be glad to see the whole cast back for this sequel — minus one 😉 But that’s about it; nothing new to see here 🧐✌️"
    },
    {
      "rating": "1/5",
      "review": "Once again Blake Lively proves she can’t act to save her soul. If it weren’t for her hair no one would give her a role. She is exactly the same in every movie and tv show. There is no acting involved. Anna Kendrick was good. Henry Golding was funny. The kid was a walking example of every spoiled entitled messed up kid we see every day in real life."
    },
    {
      "rating": "5/5",
      "review": "I need at least 10 more movies, I can’t get enough of these 2!!"
    },
    {
      "rating": "1/5",
      "review": "Honestly I thought this was just atrocious. Lacked any sense of reality and was stupid. Although Kendrick and Lively were, as always, wonderfully fun, this was ridiculous and not worth two hours of anyone's time. Most disappointingly, Allison Janney was extraordinarily unenjoyable. I still love the great C.J. Craig, but was she underwhelming in this film."
    },
    {
      "rating": "5/5",
      "review": "So fun!! This one takes all of the best elements of the first movie and adds more intrigue, twists, and... stunning Italy! Love all of the callbacks to the first movie, and the chemistry between the girls."
    },
    {
      "rating": "0.5/5",
      "review": "The plot is totally ridiculous. Blake Lively's acting is abysmal. Anna Kendrick's talent is wasted in this atrocious piece. I want 2 hours of my life back."
    },
    {
      "rating": "1.5/5",
      "review": "Felt forced to put out a sequel vs taking the time to get it right. Not surprised it never hit theaters. Cheap watch and not worth it."
    },
    {
      "rating": "4/5",
      "review": "Loved the first movie. I really enjoy Kendrick and Lively together and their acting again helps make this. The setting is sublime as is everything that goes with it from the fashion to decor to the luxury of all of it. Great to see everyone from the original movie back, although I really miss Jean Smart. Only Golding has a tedious run due to the material he was given it seems. The first was better, but this is well worth seeing. It gets crazy, but it is still fun and twisty. With all the drama and nonstop hate on BL, that no doubt infiltrates reviews, it should not. The movie is a fun watch."
    },
    {
      "rating": "3.5/5",
      "review": "Silly, fun, overly complex whodunnit comedy drama. Entertaining enough, but certainly no masterpiece."
    },
    {
      "rating": "1/5",
      "review": "So much cursing, it hurts my ears. Awful movie."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was a mess. The plot jumped around, the main character made dumb choices, and the dialogue was full of clichés. Even the twist was predictable. It felt like the filmmakers had no clear idea what they were doing."
    },
    {
      "rating": "5/5",
      "review": "I loved it. Watched the first one again straight after. Entertaining, humorous and a great way to spend a night in. I love the clothing and who doesn’t like watching a movie set in Capri."
    },
    {
      "rating": "3/5",
      "review": "Every friendship has its twists. Another Simple Favor is a 2025 American black comedy mystery film directed by Paul Feig 🎭 Not bad, but not my favourite either 😉It’s ok, but I feel mixed about this one 😉I’d recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼 Stephanie and Emily reunite on the beautiful island of Capri, Italy for Emily's extravagant wedding to a rich Italian businessman. Along with the glamorous guests, expect murder and betrayal to RSVP for a wedding with more twists and turns than the road from the Marina Grande to the Capri town square."
    },
    {
      "rating": "1/5",
      "review": "It's like trying to watch two people with no wit try to be witty."
    },
    {
      "rating": "0.5/5",
      "review": "Blake's performance is tedious, boring and painful."
    },
    {
      "rating": "0.5/5",
      "review": "This movie started out ok. The characters were less developed than the first time around and just too extra in their respective ways. The way this unfolded was plain bizarre and terrible. The plot was so bad and ridiculous. I should have stopped watching midway when I found myself bored and thinking this needed to get going. You won’t believe how terrible and sickening and disgusting the ending is. Shameful, really. Ending seemed like a bad cop out for writers who had no idea where to take this so just tried to be as extreme as possible. Thumbs down. Pass."
    },
    {
      "rating": "5/5",
      "review": "The movie was a lot of fun to watch. Kendrick and Lively’s on screen chemistry is off the charts. The pace of them by movie was ideal and I’m excited to see that the I way end credits scenes gave a nod to m a successor monly ovie? I know the strange press this and ll videos floating around about their tour made Blak e Lively not as welcomed back as “Emily” but as an audience I am looking past it because she get paid the big bucks and I feel she delivered in her promise to be true to herself!"
    },
    {
      "rating": "5/5",
      "review": "The movie kept me in suspense. Blake did a wonderful job at creating a character that is mysterious and androgynous. I loved Simple favor part one. The second sequel was seamlessly Vivacious. I’m watching the movie for the second time with friends. This is definitely a movie I will always rewatch. Highly recommend, It’s the perfect summer move. Blake reminds you why you fell in love with her in the first place! 10/10"
    },
    {
      "rating": "0.5/5",
      "review": "I ask a simple favour... could I have been told not to watch this sequel. Loved the first one but this one was truly terrible."
    },
    {
      "rating": "5/5",
      "review": "I liked the first one and couldn't wait for the next. Must see"
    },
    {
      "rating": "0.5/5",
      "review": "Someone decided \"hey we got no plot but if we boost the witty repartee & sarcasm by 200% they won't notice.\" Well, we noticed. There is no direction here and... no reason for this sequel to be made anyway. I turned it off at the 30-min mark because I realized my life shouldn't give another hour away."
    },
    {
      "rating": "0.5/5",
      "review": "This movie shouldn’t have existed! What a waste of time."
    },
    {
      "rating": "5/5",
      "review": "Love the twists! Blake did a good job balancing her role and Anna was funny. Entertaining murder-mystery vibes with comedic undertones."
    },
    {
      "rating": "2/5",
      "review": "Not as good as the orignal. It was a bit boring at times. The pace was slow and off. Beautiful everything on film. There was too many boring characters they could have left out. They changed it to a who done it in more funny crime show kind of way. There was WAY TOO many subplots. Acting was of course good."
    },
    {
      "rating": "4/5",
      "review": "I actually really liked it. It was a bit suspensful and funny. I was definitely entertainined"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is complete trash. Whoever is responsible for the story should maybe consider writing for daytime soaps. Photography, fashion was on point, Lively and Kendrick shine, but wow. Seriously worst movie I have seen in a very long time. The first one was just enough \"camp\" to make it interesting, easily a favor of mine, but as another review pointed out shock doesn't equal clever. It equals stupid. Same on anyone who gave this story the greenlight"
    },
    {
      "rating": "0.5/5",
      "review": "Hard to stay awake. If you’re looking for something to help you sleep this is it."
    },
    {
      "rating": "4.5/5",
      "review": "this movie is fucking UNHINGED. they know their audience and turn the camp level up to 100 for the gurls and gays. gorgerous costumes + Capri sceneries + beautiful men + absolutely bonker plot = a new cult classic for the gays for real."
    },
    {
      "rating": "5/5",
      "review": "Really great movie. Would watch again!"
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved it! They nailed it for sure. I’ve been waiting for a second installment and they didn’t disappoint. The banter between Emily and Stephanie made the movie funny and entertaining! 10 thumbs up and more. Thank you Amazon!"
    },
    {
      "rating": "2/5",
      "review": "1st one was good but aside from the beautiful setting this one was not so great. Blake Lively is pretty one-note actor, not much range but Kendrick is adorable and funny and Allison Janney is always fun to watch. Wish Elizabeth Perkins had more screen time. Watch for the beautiful setting of Capris."
    },
    {
      "rating": "4/5",
      "review": "This movie is hilarious, I don’t care what anyone says. I read no reviews going in. Some of the best acting I’ve seen Lively do. Great cast. Exceeds expectations!"
    },
    {
      "rating": "0.5/5",
      "review": "This is the worst film I’ve watched in the last 5 years."
    },
    {
      "rating": "0.5/5",
      "review": "Ugh. How did this get past the script review?"
    },
    {
      "rating": "1/5",
      "review": "I can't believe that people recommend this movie. Anna Kendrick tried to save the movie, but the plot was a disaster and the end of the movie is so disgusting. Don't waste your money and your precious time."
    },
    {
      "rating": "5/5",
      "review": "I loved the sequel, Anna and Blake are fun to watch together and the throwbacks to the first film I really enjoyed too. I thought Livelys portrayal as both twins was fantastic also. Also those outfits! Fun movie worth the evening in with popcorn and the couch."
    },
    {
      "rating": "0.5/5",
      "review": "I regret Watching this with all my soul, it ruin Michele Morrone.OMG the make up is bad didn't they have bouget to retouch.The Story line was very weird."
    },
    {
      "rating": "4/5",
      "review": "There's shine, there's glamour, Anna Kendrick and Blake Lively dominate the screen again, a delightful sequence."
    },
    {
      "rating": "3/5",
      "review": "I lost my attention during this film and went to bed about an hour into it. Sadly I have no desire to watch the rest of it"
    },
    {
      "rating": "1.5/5",
      "review": "Kendrick and Lively's OK acting cannot keep afloat the poor, over-the-top cringed plot."
    },
    {
      "rating": "2.5/5",
      "review": "Another Simple Favor wants to have its cocktail and spike it too. A follow-up to the fizzy 2018 original, this sequel tries to recapture that mix of glossy noir and PTA mom chaos—but somewhere along the way, the martini got watered down. Anna Kendrick returns as Stephanie, still neurotic and over-eager, and Blake Lively slinks back into frame like she never left. Their chemistry remains the film’s biggest asset—whip-smart, deliciously off-kilter, and peppered with just enough menace. But while their dynamic once felt fresh, it now plays like fan service on autopilot. The plot? Think Clue, if every card said “twist.” It’s all double-crosses and fake deaths and improbable alliances, but the stakes feel lower this time, like the film is more interested in looking clever than being clever. Director Paul Feig keeps things moving with his signature shine, but the script leans harder into camp than intrigue, and not always in a good way. To be fair, it’s never boring. There are moments of sharp humor, outfits to kill for, and the occasional flash of that first film’s biting tone. But there’s also a nagging sense that everyone’s winking a little too hard at the camera, like they're in on a joke that’s no longer quite as funny. Final verdict: Another Simple Favor is a flirty little con game that looks great on the outside but doesn’t land its final trick. Stylish? Sure. But memorable? Not so much."
    },
    {
      "rating": "1/5",
      "review": "Not very good, boring, so turned it off after 20 minutes. Never saw the first movie and watched over Blake Lively controversy. Can definately understand why it never went to the theaters. These silly, Livetime type of movies not my thing. Waste of time. Maybe others will like it."
    },
    {
      "rating": "1/5",
      "review": "Sucked. Didn't laugh once. Terrible script."
    },
    {
      "rating": "0.5/5",
      "review": "Plot was a mess. Blake can’t act. Not worth your time."
    },
    {
      "rating": "5/5",
      "review": "Anna and Blake are the best comesic duo for sure!! The \"23 and Me\" comment was so funny. Please make more movies in the future!!!!"
    },
    {
      "rating": "5/5",
      "review": "Such a fun, campy, goofy, self aware sequel that aptly plays with the tropes of a melodrama in the best way possible. Blake and Anna are their delightful selves and their relationship carries this one as it did the first. Nice to see some of the other characters come back as well. And Allison Janney is perfect. Glad to see comedy finally making its way back."
    },
    {
      "rating": "1/5",
      "review": "This movie was terrible. Please don't waste your time like I did😅"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible. I gave it a chance just for Anna, but I ended up dropping it. Also, seeing that harassing actress, who even touched a co-star without consent, disgusted me so much I couldn't continue."
    },
    {
      "rating": "5/5",
      "review": "This is a *glorious* movie. An absolute blast from nose to tail. If you get to the end credits without booking a trip to Capri, you’re a stronger person than me. 6-feet-wide hats FTW."
    },
    {
      "rating": "5/5",
      "review": "A fantastic ride! Anna and Paul never miss."
    },
    {
      "rating": "1/5",
      "review": "\"Another Simple Favor\" is awful. It amazes me that screenwriters all over the world toil in anonymity in hopes of getting their work produced. Yet this sequel, a trite joke, gets greenlit, financed & produced. No amount of female star power can save what was on the script's pages."
    },
    {
      "rating": "1/5",
      "review": "This was unwatchable Anna did a good job with what she had Blake was ridiculous and over the top."
    },
    {
      "rating": "1.5/5",
      "review": "Review: Another Simple Favor (2025) The only thing simple about this sequel is how easily it squanders everything that worked the first time. A particular kind of sequel thinks being “shocking” is the same as being clever. Another Simple Favor, the follow-up to 2018’s sleek and stylish dark comedy, falls headfirst into that trap and keeps tumbling with glee. What was once a clever, twisted, fashion-forward mystery now plays like a parody of itself, and not in a good way. This time, the story trades suburban scandal for sunny Capri, Italy. Anna Kendrick and Blake Lively return. The script gives them little to work with beyond absurd plot turns and hollow provocations. It all feels like the writers are throwing darts at a board labeled “shocking,” “sexy,” and “sinister,” hoping something lands. Nothing does. Yes, it’s campy. Yes, it’s over the top. But even campy needs structure and even outrageous twists need emotional or narrative context. Another Simple Favor confuses escalation with storytelling. There’s one scene, unfortunately, burned into my memory that aims to be edgy and daring but instead comes off as lazy, gross, and utterly unearned. I’m no prude, but provocation without purpose is just a cheap trick. By the time we reach the final act, any remnants of character integrity or tonal coherence have been tossed out with yesterday’s Aperol spritz. And yet, somehow, the film dares to believe it’s pulled off something brilliant. ***SPOILER*** Emily walks away once again, untouched, smirking like the film just won a game none of us agreed to play. Ultimately, Another Simple Favor isn’t fun, clever, or even trashy in an enjoyable way. It’s a beautiful mess without the beauty and a thriller that forgets to thrill. If you loved the first film, protect that memory. This sequel is a complete waste of time. Rating: 1.5 out of 5 martinis. Recommendation: Skip it. Or rewatch the original and pretend this one never happened."
    },
    {
      "rating": "5/5",
      "review": "Blake was outstanding once again, especially playing multiple roles. Loved all of her looks too! She and Anna are great together. Hoping there will be a part three."
    },
    {
      "rating": "0.5/5",
      "review": "Bad, worse...THE WORST high-rank actors movie YET. Capri is the ONLY highlight in the movie. The (NON) language is so vulgar, without ANY meaning, or humor..OR decency. I'M APPALED....the movie is DEMEANING to women, and man and children. If I was an American, I would be ASHAMED."
    },
    {
      "rating": "4/5",
      "review": "I was genuinely excited to see the sequel to A Simple Favor. The first film left such a strong impression on me—not only because of its clever storytelling but also thanks to the standout performances by Blake Lively and Anna Kendrick, whose chemistry and charisma truly elevated the movie. Naturally, I had high expectations for this follow-up, and I must say, it managed to surprise me right from the opening scene. Although the plot of the sequel is relatively straightforward and perhaps less intricate than the first, it doesn’t really matter. The film’s true strength lies in its undeniable charm—beautiful cinematography that captures every scene with style and flair, paired with witty, often hilarious dialogue that keeps the audience engaged. It’s a film that doesn’t take itself too seriously, and that lightness is part of its appeal. Blake and Anna once again deliver outstanding performances, their chemistry as compelling as ever. Watching them together feels effortless, and their playful banter adds a layer of fun that makes the movie all the more enjoyable. Like the first film, this sequel is peppered with twists and turns—some predictable, others more surprising—that keep the narrative lively and dynamic. Despite a few bizarre moments—such as the scene where Blake's character kisses herself—the overall tone remains entertaining and occasionally hilarious. While the plot may seem shallow on the surface, I found myself genuinely enjoying the direction it took. The story explores new facets of these characters, pushing their boundaries and revealing unexpected sides of them. That said, I did leave the film feeling a bit underwhelmed by the ending. It wrapped up some storylines but left others feeling unresolved—particularly regarding Dante’s fate, which I suspect might not be as clear-cut as it appeared. I’m curious whether the filmmakers intend to revisit this universe in a third installment, especially given the subtle hints dropped at the conclusion. I certainly hope they do, because there’s still so much more to explore with these characters. In summary, despite some flaws and a somewhat open-ended finale, this sequel manages to be a thoroughly enjoyable watch. It’s a perfect blend of style, wit, and chemistry, with enough twists to keep viewers intrigued. While I expected a bit more closure, I’m optimistic about what the future holds for these characters—and I’m definitely eager to see where the story goes next."
    },
    {
      "rating": "3.5/5",
      "review": "Although not as astonishing as the first movie, 'ANOTHER SIMPLE FAVOR' boasts of elegance and style, bringing the heat to our screens with a rather impressive direction and a perfect cast list. Although the story-telling was quite sloppy and all over the place, it did come with it's twists as much as it came with some annoying holes. This movie was however, redeemed by Anna Kendrick's and Blake Lively's chemistry that screams 'perfection'. These two brought the thunder for the sequel, with their characters leaving the past behind to face the cruel future that awaits them, Blake and Anna made a solid stand and redeemed this movie from total damnation. The humor shall not go unnoticed......"
    },
    {
      "rating": "0.5/5",
      "review": "What is this rubbish?! Half a star is too generous."
    },
    {
      "rating": "1/5",
      "review": "I was bored and sick at home during my birthday so thought I would watch this as the first one was okay. Some of the lines were very cheesy, and made me go huh?? The wardrobe as well…it seemed to not fit Emily’s character as much like the first movie did. The male actor, I can’t remember his name, but he should have added so much more intrigue to the movie and his acting fell flat for me. The acting skills of Blake Lively made it easy for Anna Kendrick to be the only shining light of this entire movie. Sequels rarely work and this one was a disappointment."
    },
    {
      "rating": "0.5/5",
      "review": "God this was extremely boring ugh, I could've done something productive with that time."
    },
    {
      "rating": "1.5/5",
      "review": "Loved the first movie. This one doesn’t work…it’s pretty clear the script is subpar and substituting a beautiful location for a competent script doesn’t work. This movie lacks all the charm of the original. Who approved this disaster?"
    },
    {
      "rating": "1.5/5",
      "review": "I fell asleep & tried to rewatch it & had to hit the fast forward through some parts. Blake was awful in the double role - so over rated."
    },
    {
      "rating": "5/5",
      "review": "I loved this movie!!! I hope there's a 3rd!"
    },
    {
      "rating": "1/5",
      "review": "I created an account to write this review because I had to do something with my anger at losing 1.5 hours of my life. [SPOILER ALERT] Late in the movie, Emily's triplet drugs her, then has some type of sex with her. Emily is awake, but can't move. This is a setup for the \"sister fucker\" joke, a call back to \"husband fucker.\" But, that is rape. It's creepy, disgusting, twisted rape, that was used as a joke. I guess we aren't supposed to be mad because it's two women and everyone likes twins doing it, so triplets are even better. But the whole twin thing is also creepy. Well, besides that, the movie felt like an AI-generated script based on the first movie. All that was good about the first movie was rehashed in a random way, to be contrived and unbelievable. Oh, there is a triplet?! OMG. AI for sure."
    },
    {
      "rating": "0.5/5",
      "review": "Expecting a fast paced, witty successor to the first. Was sadly disappointed by weak plot and the addition of so many new characters who had no development or were simply unbelievable. Without subtitle most of the movie is left to guessing what is happening in key scenes. Even the wardrobe was lacking the finesse of the first. Felt like a low budget production with a see through plot that took any fun and promise out of film."
    },
    {
      "rating": "5/5",
      "review": "I hope they make a third one! I loved both. Blake has always been one of my favorite actress’s. Anna was great too"
    },
    {
      "rating": "1.5/5",
      "review": "First movie in series was good, this one not so much."
    },
    {
      "rating": "1/5",
      "review": "I liked the first movie, but found this one all over the place. Anna Kendrick tries to save this movie but can't."
    },
    {
      "rating": "2/5",
      "review": "Another Simple Favor is a bloated, self-indulgent sequel that trades the first film’s charm for over-the-top theatrics and empty style. Blake Lively returns as Emily with all the charisma of a mannequin in couture. Her performance is hollow, robotic, and utterly disconnected from anything resembling human behavior. What once felt mysterious now feels like pure parody. The only saving grace is Anna Kendrick, who somehow manages to ground the film with humor, heart, and actual acting. Without her, this movie would collapse under the weight of its own smugness."
    },
    {
      "rating": "0.5/5",
      "review": "All over the place, very cheesy ..very immature and predictable... Cannot recommend it at all..waste of time..the only good thing was scenery at Capri!"
    },
    {
      "rating": "1/5",
      "review": "This is one of the worst movies I’ve ever seen. I forced myself to watch until the end just to see how it ended. Do not waste your time on this terrible movie."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining movie. Love Blake and Anna in this."
    },
    {
      "rating": "5/5",
      "review": "Was actually hilarious. Great movie. I went in expecting nothing and was very very glad to have watched it."
    },
    {
      "rating": "1/5",
      "review": "I like a simple favor, but I couldn’t even finish this movie. And that’s rare for me."
    },
    {
      "rating": "4/5",
      "review": "Quite a stylish little movie. All of the women in it are complex characters, more akin to real life. There’s even room for one more"
    },
    {
      "rating": "3/5",
      "review": "Nowhere near as good as the first"
    },
    {
      "rating": "1/5",
      "review": "The film loses its way mid way through and ends up messy and it made me cringe in parts, a feeling I don’t enjoy! Lazy and badly laid out film that will disappear quite quickly I think. I wouldn’t recommend wasting time on it."
    },
    {
      "rating": "0.5/5",
      "review": "There’s no story, it’s random, boring and so corny"
    },
    {
      "rating": "3/5",
      "review": "The first 30 minutes was hard to watch, wooden acting by Anna Kendrick. The rest was saved by Blake Lively who, although controversial, saves this movie and delivers a great performance. She was the highlight."
    },
    {
      "rating": "3.5/5",
      "review": "Definitely kept me hooked the whole time!"
    },
    {
      "rating": "0.5/5",
      "review": "The first movie was entertaining, this one was not. Do not waste your time, not funny, not engaging, highly predictable. No sequel was needed for this movie."
    },
    {
      "rating": "3.5/5",
      "review": "I watched it twice actually, yesterday, on prime TV, for free! I mention this fact because the far less interesting \"it ends with us\" still asks for payment, lol...I really enjoyed the movie, the actors, the acting , the plot, the scenery, everything! Pity that this comedy must suffer because of that piece of c... called \"it ends with us\"... Blake Lively is a good actress and I don't care what kind of human being she is in real life: she delivers when it comes to her job! It's all I want! Bravo, ladies and gentlemen!"
    },
    {
      "rating": "2.5/5",
      "review": "very superficial. Acting was good but it kind of left me wanting something more realistic like the first movie. It seems as if they put all extra stuff together to captivate us."
    },
    {
      "rating": "5/5",
      "review": "I loved it! Watched it twice actually. Really glad they are going to continue with the series. I will be waiting for the next one. I hope they keep Blake she was really good in this movie"
    },
    {
      "rating": "1/5",
      "review": "This movie is nothing compared to the first. It tried to be suspenseful and mysterious but it unfortunately failed. Anna Kendrick did her best to cover up bad acting by other cast mates but couldn’t save the whole movie. The only reason I continued watching was the beauty of the environment they were in. The story line started strong but became confusing and plain corny in the middle/end. I am surprised I watched the movie until the end. I do not recommend wasting your time watching this atrocious movie. It is no where near as good as the first."
    },
    {
      "rating": "2/5",
      "review": "Another Simple Favor goes too far, crossing a grossly disturbing line. A scene where one sister drugs and assaults the other—yes, incest, and it’s disgusting. This scene trivializes trauma and feels out of place, even in a film that thrives on shock value. I can’t believe more people aren’t calling this out. It’s not edgy, it’s exploitative. Sadly, the story writing is low quality too, bummer."
    },
    {
      "rating": "5/5",
      "review": "If you thought the first one was clever wait till you see Another Simple Favor! It is wicked delight of the senses and wait till the end! OMG!! I hope there is another! This is too good to end here!!"
    },
    {
      "rating": "0.5/5",
      "review": "This movie starts strong then the plot just deteriorates, from all the men dying to Blake being a triplet it’s just all a WTF Burger. I want a refund!"
    },
    {
      "rating": "5/5",
      "review": "Just when you thought your summer couldn't get steamier, Another Simple Favor crashes in like a martini-fueled mystery in heels. Anna Kendrick and Blake Lively reunite with all the snappy, sinister charm of the original — only this time they’ve upgraded to the impossibly chic coastlines of Capri, Italy. (Yes, Capri. Yes, I gasped too.) Blake Lively? Please. She’s not just acting — she’s serving runway realness in every frame. If the Oscar voters don't make a separate category for “Best Use of Silk, Sunglasses, and Suspicion,” we riot. Enter Michele Morrone and Henry Golding, turning up the heat and the tension in this deliciously twisted Mediterranean Noir. Think White Lotus meets Gone Girl, with just enough comedy to make you feel safe… right before it doesn’t. Director Paul Feig keeps things sharp, stylish, and just unhinged enough to make you question everyone’s motives — including your own. And major kudos to producer Laura Fischer for letting the characters and the wardrobe breathe. And let’s not pretend: there’s a shower \"sex\" scene that deserves its own end credits. You’ll know it when it hits -- and now I need some cake. Thrills. Laughs. Limoncello. And looks that kill. Another Simple Favor is everything you didn’t know you needed this season — and probably more than you deserve."
    },
    {
      "rating": "5/5",
      "review": "WARNING: This movie is camp. And it's done so well. The first movie was a bit different but done beautifully, if you see this one and think it's going to follow the exact same format, it won't. It's more like \"What happened to Baby Jane\", Its fun, it's camp but not overtly cheesy, unless you aren't prepared. To clarify, I don't like Blake Lively's ways of trying to climb to the top. However, she plays this role beautifully in the first film and this one (whether she's playing herself or not,, or a version she wants to be, it's up for debate) but she does it so well. This film is a cross between \"What happened to baby Jane\" mixed with a little of Agatha Christie) . It's really different than the first film which was more dark, where this takes a fun CAMPY take on what happened afterwards. And that is the warning. It's for the girls, the gays and the they's. If you like Camp movies, you will probably like this if you go into it knowing, that it is strictly CAMP. And it's so fun. Anna Kendrick had never done a movie that I didn't like her in. Blake Lively, had only done two movies I've liked her in: A Simple Favor and A Another Simple Favor. I can detach the person from the character and give praise where praise is due. She kills this role. She's so good in it and Anna is always brilliant. This was such a fun watch if you are able to suspend belief and just go with the fun because it's really a fun ride. As much as I hate Blake being so tied to fashion and being an actress (it seems in all her interviews, at least in It Ends with Us\" thats all she could talk about) her fashion sucked in that movie. This movie, I couldn't get over that flower top she wore for a good half of the first part of the movie, and that hat! I am not much on fashion when it comes to movies, didn't know I cared that much, but Blake Lively's characters outfits were breathtaking. I never care about that stuff but it was impressive here. And I hate to say it but I love her in this role. Anna Kendrick and Blake Lively together are like Velma Kelly and Roxy Hart. They may hate each other off screen, but their dynamic onscreen is undeniable. They play off each other so well. SO THIS IS A WARNING, this movie is CAMP. It's fun, ridiculous, but well crafted. The scenery and costumes are beyond incredible and they are so good together. I loved it. It was so like much What ever happened to Baby Jane kind of dark humor but more self aware to it's absurdness. This is just a fun movie for the girls, gays and they's if you know what you're getting into."
    },
    {
      "rating": "3/5",
      "review": "Unlike the first, Another Simple Favor carries a bunch of ideas and exaggerated twists that end up falling into a pit of dim light, lukewarm acting and a bitter ending. Perhaps the only things that save it are the paradisiacal settings and the striking costumes, otherwise, was it really necessary?!"
    },
    {
      "rating": "5/5",
      "review": "Super fun and entertaining! I did like the first one a little better, but I’ll definitely watch them both again."
    },
    {
      "rating": "1/5",
      "review": "Terrible! The story was all over the place and corny."
    },
    {
      "rating": "1.5/5",
      "review": "A Promising Start, A Messy Finish The first 45 minutes were actually quite enjoyable. Anna Kendrick and Blake Lively delivered their signature charm and wit, and the banter between them on brand. The tone was spot-on, and I was invested in the story. But then, things took a drastic turn for the worse. The writing, which had been clever and engaging in the first third, quickly devolved into a convoluted mess. The plot turned silly and the characters followed suit. Lots of cringeworthy moments and laughable dialogue. The last two-thirds of the movie were hard to watch. The talented cast was let down by subpar writing and editing. If you're a fan of the original, you might want to approach this sequel with caution."
    },
    {
      "rating": "0.5/5",
      "review": "Sooooo bad! Top 10 worst movies I’ve ever seen."
    },
    {
      "rating": "2.5/5",
      "review": "Stephanie travels to the picturesque island of Capri to be Emily's maid of honor — but what starts as a lavish wedding spirals into a tangled web of secrets, mafia feuds, and dark humor. Directed with a playful, irreverent tone, Another Simple Favor mixes crime, comedy, and melodrama against stunning Italian backdrops. The film leans heavily on surprise twists, sometimes sacrificing coherence for shock value. Blake Lively and Anna Kendrick remain magnetic together, carrying the story even when it stretches too thin. Visually, the movie dazzles — with lush cinematography and stylish set design — but narratively, it lacks the psychological depth that made the original 2018 film so compelling. Instead, it opts for surface-level satire of wealth and crime, offering a fun yet ultimately less resonant sequel. A colorful, entertaining ride for fans of dark comedy, though it never fully recaptures the sharpness of its predecessor."
    },
    {
      "rating": "5/5",
      "review": "This movie packs a punch! It keeps you on the edge of your seat or should I say on the edge of the cliff the entire movie! The flow of the movie mixed with the comedic timing made this a must see spring movie. It gives you some nods to the original simple favor. It also leaves you begging for the next one by the end."
    },
    {
      "rating": "5/5",
      "review": "Great movie. Loved it. Clever, sharp witted, enjoy Anna and Blake. Negative reviews are manufactured, thus is an excellent movie, well written and entertaining."
    },
    {
      "rating": "5/5",
      "review": "Stylish, gorgeous, and sassy - this is just a fun ride overall!"
    },
    {
      "rating": "5/5",
      "review": "Such a fun ride! Seeing this with friends was so hilarious. Watch it and get ready for the summer!"
    },
    {
      "rating": "5/5",
      "review": "This is such a fun romp through one of the most gorgeous places on Earth! The twists, the turns, the fashion, it's stunning."
    },
    {
      "rating": "4/5",
      "review": "I watched the movie yesterday on Prime Video. The movie was so fun, I truly enjoyed it. I should''ve watched the first movie again before watching because I didn't remember some of the characters but I still enjoyed it (probably I'll enjoy it when I watch it again after watching the first one)"
    },
    {
      "rating": "5/5",
      "review": "This (and A Simple Favor) is the first ever movie I’ve watched more than once 😭 Absolutely fire and entertaining until the end. Stemily’s relationship is so unique and definitely something I can’t quite explain but I want what they have. Hope we have A Final Favor and have them married, please Paul Feig 😒"
    },
    {
      "rating": "0.5/5",
      "review": "Just a horrible, corny adaptation of the first one. Lacking in a lot. Feels like a bunch of actors and a mediocre Lively in a pretty place,in pretty clothes with zero real reason for this follow-up. First one was great, this one is unnecessary."
    },
    {
      "rating": "3/5",
      "review": "A sequel to 2018's A SIMPLE FAVOR and director Paul Feig's first sequel doesn't quite capture the magic of its predecessor but it's still a worthy followup. Whereas the original film is based upon a novel of the same name, ANOTHER SIMPLE FAVOR is an original story continuing the hostile relationship between mothers and besties/former besties Stephanie Smothers (Anna Kendrick) and Emily Nelson (Blake Lively). The story follows Stephanie being invited to Emily's wedding in Capri to serve as Emily's maid of honor, which is rather curious judging from the way these characters left each other in the first film. During the wedding events on the Italian island, one of the wedding guests is murdered in their hotel room and Emily must once again uncover who's behind it before she herself could be the next target. Much like another recently released film THE ACCOUNTANT 2, I didn't hear anyone clamoring for a return to this property. And to be completely transparent, I had my reservations about it for 2 reasons: I rather enjoyed the original film and didn't think a sequel would deliver the same quality. In addition Amazon Prime doesn't put out quality products in my humble opinion. So imagine my surprise at how much I enjoyed this film. Stephanie's character has grown since the last time we saw her. She's not the pushover mom she once was, has found her career in solving crimes, and even writes a book about her experience in the first film. Lively is once again the powerhouse character she was the first time around: foul-mouthed, completely unapologetic with a great sense of style. Seriously, whoever's designing this character for both films is most certainly earning their keep. However, I will say the story, while interesting, isn't as tight, smart, or razor thin during its sophomore session. Although there are plenty of humorous one-liners to go around alongside plenty of colorful language. And while I'm not sure there's room here for a trilogy, but if they did proceed with a third story, I'd watch with more anticipation than I did this entry."
    },
    {
      "rating": "3.5/5",
      "review": "Anna Kendrick was the only thing that made this film worth watching. I wore my florals for her, but I don't think she'd be impressed by that. Anna doesn't care about florals. :("
    },
    {
      "rating": "5/5",
      "review": "Not as good as the first but still funny and I’m obsessed with Kendrick and lively’s back and forth"
    },
    {
      "rating": "5/5",
      "review": "Forget the naysayers who are all caught up in Blake’s legal issues, this movie was everything I wanted it to be. An excellent, decadent, over the top follow up to the original - check! Amazing bad girl energy from Anna and Blake with fabulous bitchy dialougue - check! Excellent plot - check! Gorgeous costume and sets - check! I want more! I want a franchise of movies with these bad bitches! LOVED IT!"
    },
    {
      "rating": "5/5",
      "review": "Loved it. The fast and furious for women. Blake was hilarious and Anna was perfect! Can they please get together if there’s a 3rd film???"
    },
    {
      "rating": "2.5/5",
      "review": "Read on for an unbiased and objective review of this film based solely on the film itself. I had high expectations for Another Simple Favour given its director Paul Feig (Spy, Bridesmaids) and two lead actresses Anna Kendrick and Blake Lively. Initially, I felt the original movie sat well as a standalone feature, not requiring a follow-up. Therefore, I was surprised at Another's announcement recently. I have decided to give the film a 2 & a half star rating as whilst it was watchable, I began to lose interest, I enjoyed the first half which built to somewhat of an anti-climax in the latter half, spiralling into utter insanity devoid of realism and interesting \"twists\". In my personal opinion, I feel this movie was better aesthetically, in terms of the setting and the camerawork which was stunning, showcasing the beautiful scenery of Italy. However, on the contrary, this film has more big name stars compared to A Simple Favour, although, it begs to ask the question why? It does not add any substance or contribution to the sequel. That being said, I am a huge fan of new addition Allison Janney and numerous other cast members. Having said that, the writing is poor and the story seems somewhat rushed. *Pay close attention, all creators to this paragraph* Writing is the foundation of any good story and no amount of star-studded cast announcements, marketing and/or perfected imagery will salvage that. It is transparent to fans when a story lacks quality. It is a shame as I wish the film was better and I wanted it to be just that. My biggest surprise was that the cast members are such accredited artists of whom are outstanding in previous work in an individual capacity which I may list below. Anna Kendrick (Pitch Perfect) Blake Lively (Gossip Girl) Henry Golding (Crazy Rich Asians) Elizabeth Perkins (Miracle on 34th Street) Allison Janney (I, Tonya) Alex Newell (Zoey's Extraordinary Playlist) In summary, I watched the film from start to finish. I enjoyed the first half, it began to become boring in the second half. I probably would not revisit this film again as other movies have proved much better. However, one last favour was teased at the end? If Another Simple Favour was excellent, a third would be unnecessary, however, a third may lessen the comparisons between the original and its sequel. Who knows? Paul Feig did create Bridesmaids, which remains one of the best comedy films of all time."
    },
    {
      "rating": "5/5",
      "review": "so fun, i mean equally as silly as the first but in the best way possible- they have such great chemistry- Anna and blake that is"
    },
    {
      "rating": "5/5",
      "review": "Sharp, witty, stylish. Really great cast all shines in character. Great cinematography. Idyllic locations and lots of glitz and glamour mixed with devious and delicious fun. Indeed more twists and turns than the road from the Marina Grande to the Capri town square. Very entertaining"
    },
    {
      "rating": "4/5",
      "review": "It is worth it for the few LOLs. Beautiful Capri is a bonus. Anna Kendrick comes out with some great lines like “Sister F**ker”. I like Blake Lively and I’m sorry for what she went through."
    },
    {
      "rating": "3/5",
      "review": "'Another Simple Favor' is a fun but flawed sequel that is more confidently ridiculous and stylishly absurd."
    },
    {
      "rating": "5/5",
      "review": "Another Simple Favor is a sharp, stylish sequel that recaptures the flair and suspense of the original while turning up the charm and intrigue. Director Paul Feig once again blends mystery, dark comedy, and fashion-forward elegance into a story that keeps you guessing — and grinning — until the final twist."
    },
    {
      "rating": "1/5",
      "review": "I was excited to see the sequel to the first movie considering I loved the first movie. So very disappointed. I didn't like where the story led to. The movie started off fine but such a baseless ending. They could have found a better storyline for the sequel. Waste of time!"
    },
    {
      "rating": "5/5",
      "review": "Much better than the first one, loved every second."
    },
    {
      "rating": "5/5",
      "review": "\"Another Simple Favor is the kind of twisty, stylish sequel that actually earns its second act. Blake Lively returns as effortlessly cool and chaotic as ever, while Anna Kendrick’s charm and comedic timing once again ground the madness in just enough reality. The fashion? Iconic. The plot? Delightfully unhinged. It’s part thriller, part satire, and 100% fun. If you loved the first film’s blend of mystery and dark humor, this follow-up doesn’t just deliver — it doubles down. Count me in for another favor... or three.\""
    },
    {
      "rating": "5/5",
      "review": "It’s rare these days to find a film that truly embraces comedy as a craft without taking itself too seriously and forgetting to have some fun! Like the perfect martini, Another Simple Favor has the right amount of witty bite balanced by a wash of pleasing aesthetic taste. It takes a bitter wedge of lemony revenge and twists it into hints of mystery in every scene. Its cast of characters are familiar from the first film but refreshed with the icy touch of their distrust of one another without ever watering down the inner fire of a well-timed sip. This sequel hit like that perfect second cocktail on a sunny vacation day!"
    },
    {
      "rating": "1.5/5",
      "review": "Fell asleep. Why did they go out of their way to make us dislike these characters so much? Lacks wit, suspense and most importantly any form of warmth whatsoever."
    },
    {
      "rating": "5/5",
      "review": "Loved this movie as much as the first one. However, I’m frustrated by the number of low ratings that seem to be based on external controversies rather than the film itself. The situation involving Blake Lively is complex and sensitive, and it’s disappointing to see people dismissing her work entirely based on assumptions. Reviews should focus on the movie and the performances, not personal opinions about an actor’s private life. We should be mindful of how we discuss situations where a woman has spoken out, as public judgment can become another form of harm."
    },
    {
      "rating": "5/5",
      "review": "If Another Simple Favor were a cocktail, it’d be a martini with a cyanide twist—dangerously stylish, unexpectedly sharp, and served with a wink. It’s less “whodunnit” and more “who didn’t?” The dry humor, the twists, the perfectly timed eye-roll moments—it all just works. Big shoutout to Paul Feig for making mystery feel like a high-fashion comedy of errors, and to Laura Fischer for bringing another deliciously chaotic story to life!"
    },
    {
      "rating": "5/5",
      "review": "I only recently (about 3 months ago) became aware of the A simple favor movies…. I instantly LOVED the first and couldn’t wait for the sequel! I was a tad worried if they could recapture the magic of the first and they didn’t disappoint at ALL. I don’t watch or don’t watch movies based on if I like the actor / actress as a person. I watch based on if they are a good or bad actor / actress and everyone slays in this movie. Love or hate her, Blake Lively rocks in this villainess role. And Anna Kendrick is a perfect foil to Blake’s character! The plot was engaging and fun! I think you have to take many of these reviews with a grain of salt because it seems the I h8 Blake people are flooding the reviews."
    },
    {
      "rating": "1.5/5",
      "review": "Awful?? I feel like everyone involved just signed up for the free trip to Italy and Capri."
    },
    {
      "rating": "4.5/5",
      "review": "I wanted to hate it but it was crazy like the first one and the first one was hated by critics to begin with. I’m not a fan of Blake lively but I like the movie."
    },
    {
      "rating": "5/5",
      "review": "Fun movie thank Paul"
    },
    {
      "rating": "0.5/5",
      "review": "I liked the first simple favor because Anna Kendrick is a versatile actress and there were several twist and turns that made the movie enjoyable. Another Simple favor is terrible. Bad storyline, bad dialogue, bad acting by Blake Lively and Anna Kendrick comes across annoying. This movie was hard to finish."
    },
    {
      "rating": "1.5/5",
      "review": "If Clue was written by the people who write the Ricki Lake show... with some nice scenery."
    },
    {
      "rating": "5/5",
      "review": "Absolutely in love with Blake in that movie. Good job!"
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie, I was entertained from start to end! The plot did start to go in some crazy directions, but I feel like it still aligned with the overall style of the film series. Blake and Anna were so great together, their scenes were definitely standout ones for me. And you can never go wrong with Allison Janney!"
    },
    {
      "rating": "5/5",
      "review": "Had so much fun watching it! Campy + fun, gorgeous views and great performances all around. Need a #3 please!"
    },
    {
      "rating": "5/5",
      "review": "Love it! I think it's better than the first one."
    },
    {
      "rating": "5/5",
      "review": "Lively & Kendric stun in Another Simple Favor! The ensembles alone will keep one glued to the screen. Paul Feig did a bang up job & fashion thriller lovers will not be disappointed. Seeing beautiful people onscreen can clearly be upsetting to some though."
    },
    {
      "rating": "0.5/5",
      "review": "Shallow & frivilous. Avoid this flop."
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved the film. The Blake and Anna chemistry is incredible."
    },
    {
      "rating": "0.5/5",
      "review": "I wanted to like this movie. I enjoyed the first one, but this movie was so hard to follow. The acting was high school level and the script was weak. If this movie had a good script and director maybe it would have had a chance. I really hope they don't make a third one."
    },
    {
      "rating": "5/5",
      "review": "better than the first one!!! blake is exceptional again and her chemistry with anna is off the charts! loved it"
    },
    {
      "rating": "4/5",
      "review": "I think the dialogue was forced, somewhere between laughable and theatrical."
    },
    {
      "rating": "0.5/5",
      "review": "I struggled watching this because it really was bad. The plot was dumb and all over the place - nothing like the first installment where Blake Lively’s horrific acting can be overlooked."
    },
    {
      "rating": "5/5",
      "review": "It's even funnier then the first film."
    },
    {
      "rating": "4.5/5",
      "review": "Another Simple Favor ups the stakes with another thrilling dose of mystery, dark comedy ☻️ and jaw-dropping revelations. The film dives back into the tangled friendship between Stephanie and Emily, proving that deception, murder, and high fashion still make for an irresistible combination. Anna Kendrick and Blake Lively effortlessly step back into their roles, delivering performances that are as sharp as the film’s twists. The sequel maintains the playful yet sinister tone of the original, blending suspense with biting humor and stunning visuals. Whether it's secrets lurking beneath polished exteriors or unexpected betrayals, Another Simple Favor promises to keep audiences guessing until the final shocking moment. 🍸🍸"
    },
    {
      "rating": "5/5",
      "review": "Great movie, amazing scenery and beautiful costumes Anna and Blake did great."
    },
    {
      "rating": "4/5",
      "review": "Stop reviewing movies if youre going to focus on actor’s personal lives. It’s a disservice to films and reviews. Read the critic’s reviews for anything logical. Campy, but the chemistry as always was the best part. Almost too much, plot had some timing issues, but all in all did what it needed to do: Again, i beg of you to not review if youre primary focus and reasoning is you hate Blake. Comment in a blog."
    },
    {
      "rating": "5/5",
      "review": "Here to support Blake Lively, Michele Morrone and Paul Feig. Loved the movie."
    },
    {
      "rating": "5/5",
      "review": "Great movie to watch with your family and friends."
    },
    {
      "rating": "2/5",
      "review": "Kendrik and Lively do a good job, so does Henry Golding, and as expected, Allison Janney. The script is predictable and poor, but it holds all together. I didn’t hate the movie, but it seems lazy."
    },
    {
      "rating": "1/5",
      "review": "I don't care about the drama about Blake's issue with her IEWU co-star/director so this is not a biased review. I watched the movie with an open mind and heart but oh boy! The movie was a mess. I don't know who wrote the script and whose responsible in creating this crap but it was cringe from the beginning. I can't stand the comical acting. The plot is all over the place. Blake also looks drunk on the duration of the film. Their outfits are over the top and the wigs are horrible. The first one is good and does not need a sequel. Please, don't waste your time and money on this crap."
    },
    {
      "rating": "0.5/5",
      "review": "This was genuinely painful to watch. I have watched the first one multiple times so this was even more disappointing. The acting was awkwardly poor, the story was really odd and almost hard to follow. Even her outfits were overkill this time. Rough watch and overall fail… big time."
    },
    {
      "rating": "1.5/5",
      "review": "Love Anna, Blake is just the scum of Hollywood after her law suit with Jusitin. Blake always has to be so shower like she better than everyone. NOT. I'm hope she and Ryan and nice Ryan go to jail."
    },
    {
      "rating": "4.5/5",
      "review": "Another Simple Favor is a campy and fun movie that doesn't pretend to be something else. It's perfect for everyone who likes to laugh. Just like in the first movie, Anna and Blake's chemistry is great. I also think Henry Golding was much more memorable in this movie than in the first."
    },
    {
      "rating": "5/5",
      "review": "The movie was entertaining and enjoyable. I enjoyed the twist and turns, and the “dark” humor. Blake and Anna have great chemistry, and play off one another well. I’m amazed at the 1 stars until I noticed majority were from JB’s camp and from people that have only rated BL’s films recently. Due to the immaturity, I decide to leave a review because it’s an enjoyable movie."
    },
    {
      "rating": "1.5/5",
      "review": "The first one was fantastic. This was a drastically different tone. It feels like I’m watching some creepy satire and it hurts my heart. I absolutely loved the first one. Poor Anna, I think this is beneath you."
    },
    {
      "rating": "1.5/5",
      "review": "I really enjoyed the first one. The sequel... a convoluted overblown mess. The outfits are amazing as is the scenery. Disappointing. I would not recommend."
    },
    {
      "rating": "1/5",
      "review": "Dreadful. I looked at my watch six times starting at the twenty minute mark. my watch twenty minutes in. Capri is lovely. Nice hats."
    },
    {
      "rating": "0.5/5",
      "review": "It was absolutely terrible. Blake is such a terrible actress. The movie was way cheesier than the 1st one. Dont waste your time"
    },
    {
      "rating": "1.5/5",
      "review": "It throws two great leads into cliche mom-humor dialogue into a great setting with a crap plot and too many plot-holes and bad turns to be of any interest."
    },
    {
      "rating": "0.5/5",
      "review": "Oh no thank you. I hate it."
    },
    {
      "rating": "0.5/5",
      "review": "A prime example of a film that did not need to exist. The first one was fine, fun, and enough. The scenery is beautiful and some costumes were nice, but the acting was painful to watch because the whole plot seemed forced, full of unnecessary “twists.” This film is chaotic and feels like a lingering Lifetime movie. The good? That it went straight to streaming and no one had to waste their money watching it."
    },
    {
      "rating": "3.5/5",
      "review": "Kinda predictable, a little messy but still had a lot of fun watching it. Anna Kendrick steals the show this time around."
    },
    {
      "rating": "5/5",
      "review": "Great chemistry between Lively and Kendrick and awesome cinematography for the destination locations!"
    },
    {
      "rating": "5/5",
      "review": "I loved the first Simple Favor and the second was even better. The kind of movies that take you out of your life for a minute. Very entertaining."
    },
    {
      "rating": "1/5",
      "review": "The writing was terrible, raunchy language, wasn't clever. A true disappointment as the first movie was a lot better. I kept watching hoping it would get better and it got worse and worse. Don't watch this, it's a waste of two hours. Too long."
    },
    {
      "rating": "0.5/5",
      "review": "Another Overplayed Trope. Cliche, disturbed. Please don't make another one. It's not worth wasting our time."
    },
    {
      "rating": "3/5",
      "review": "i loved the first movie but this one, idk. there are things i enjoyed about it, others felt forced."
    },
    {
      "rating": "5/5",
      "review": "Fabulous! Just as great as the first one! The lead actresses are a dynamic duo and I love the comedic timing between them. There were so many hilarious moments that paired nicely with the shocking twists! Must see and excited for more!"
    },
    {
      "rating": "5/5",
      "review": "Great sequel! More twists and turns than the original. Very goofy yet fun."
    },
    {
      "rating": "0.5/5",
      "review": "Same attitude and bullying character Blake repeats in most of her work. I was unimpressed and lost interest in the movie pretty quickly."
    },
    {
      "rating": "5/5",
      "review": "We need another, Another Simple Favor, please Paul Feig, pretty please. Loooooooooved the movie so much, I have my popcorn ready for round two. Anna and Blake, my gosh those two together is something I would watch for days. Absolute fire!!"
    },
    {
      "rating": "4.5/5",
      "review": "7 years have passed since director Paul Feig brought his dark comedy thriller Anna Kendrick and Blake Lively also return to reprise their roles as dyer frenemies Stephanie and Emily Stephanie has made a successful career being an author of her past encounters with Emily, the fashion public relations woman who played a deadly game of cat and mouse conning her husband out of life insurance and finding out she murdered her parents and twin sister Emily was sentenced to prison but she has gotten out getting engaged to a wealthy European man Dante in Capri, Italy New cast members include Alison Janney and Elizabeth Perkins attending the wedding as Emily’s relatives Emily’s ex husband Julien and her son are here too much to their reluctance But given their history Stephanie is unsure she can trust Emily ever again especially when a new murder happens creating a puzzle of whodunnit It’s an international adventure murder mystery this time around It has a feeling of Agatha Christie too making everyone a top suspect Lively still perfectly encapsulates Emily being unpredictable, unhinged, and unwilling to give up Kendrick as Stephanie is much more open, less apologetic, stern, and independent Yet she still carries around guilt for all the dead men in her life They have that repitoire that makes it crackle digging into each other with claws I didn’t expect a lot of Freudian stuff going on either The film still has much of the dark, snarky humor as well as the sharp dialogue Plenty of sharp casting as far as the supporting characters and the Italian scenery is quite beautiful to look at I’ll admit too the plot keeps building on upon itself taking all kinds of unexpected turns People do all kinds of things for money, power, family, and love I have to say this follow up is deliciously wicked and even more appealing than the original film being funny and sexy at the same time Even the costumes are excellent to behold matching the exotic location’s sleek nature Yes some of the plot twists can be absurd straining logic yet the sizzling chemistry of the two leading ladies is still what holds it together It’s hard to resist because you cannot deny it’s visually lush appeal as well as the actresses So whatever you think about Lively’s current situation in the headlines today she still brings her A-game here next to Kendrick being a combination of murder, Italian tourism, and fashion in another black comedy"
    },
    {
      "rating": "5/5",
      "review": "I'm thinking of starting a campaign to convince Paul Feig to make a third Simple favor. Incredible movie, such a fun watch, and that chemistry between Blake and Anna is something I just can't get enough of. They're both incredible, Anna with her Wits, and Blake with her Zingers, & that sexy tension that's always between their characters. These two belong on screen together. What a fun watch, over the top amazing watch, I'm actually getting ready to watch it again! Great Job Paul. Fun story line, aesthetically pleasing, Blake's outfits, perfect cast for each of their roles. Thank you!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "As I mentioned at the beginning, it's a fun and delightfully ridiculous film, which decides to go its own way and lacks the excitement and suspense of the original, but that doesn't mean that this second installment doesn't have it, it's simply another suspense and another intrigue that invites us to a film much less sensual than its predecessor, but which in the same way is a fun sequel and a decent film that manages to make you spend a pleasant time in front of the screen. We find interesting supporting characters and others wasted, and a film that has moments to shine absolutely, such as its first half and an ending that is somewhat lower than its beginning, but how twisted it ends up being makes it worth having fun with."
    },
    {
      "rating": "1.5/5",
      "review": "Could’ve been so much better, good cast, poor script"
    },
    {
      "rating": "1/5",
      "review": "Omg WTF I just watched?! Usually when the movie is bad I go along and finish bc I want to know how it ends… well not this one! The acting of absolutely all these A-list actors was so bad that I felt this movie had no script and they were just going on with it. Thank god for Amazon Prime, cause if I had to pay to watch this garbage I’d be upset. Lives the first A Simple Favor, watched several times, so trust me, this sequel was the worse decision ever and they just ruined it all."
    },
    {
      "rating": "1/5",
      "review": "I was skeptical about a sequel to A Simple Favor and I was right. This movie was so unnecessary. It was all about pretty actors and aesthetics. It does not share the same wit, charm, and suspense as the 2018 film, which was clever mystery. This new “mystery” was very predictable, vulgar, and unrealistic. The script was also cringe and too sure of itself."
    },
    {
      "rating": "1/5",
      "review": "This is one of the worst movies I’ve ever seen."
    },
    {
      "rating": "0.5/5",
      "review": "The only way this movie would have made any sense would have been if Stephanie woke up at the very end and it had all been a dream. It felt forced, contrived, and rushed for as long as the movie dragged on. Blake's acting skills also came across muddled and forced, like she forgot who the character was supposed to be."
    },
    {
      "rating": "1/5",
      "review": "This film takes the cake for the hardest film to get through for 2025. File under: Life is too short. The bad overacting by a certain blonde actress overshadows any other redeeming features of the film."
    },
    {
      "rating": "3.5/5",
      "review": "Blake Lively is amazing. Anna Kendrick is good, but the character is not as interesting as in the first one. While it’s not as fun as the original, the story is fresh, the scenery (and clothes) is stunning, and I’m always in when Henry Golding is around. I wish Jean Smart would’ve reprised her role, but at least this one has Alison Janney."
    },
    {
      "rating": "5/5",
      "review": "Loved every minute- my two favourite actresses killed it 😍"
    },
    {
      "rating": "0.5/5",
      "review": "Atrocious acting, poor script and no reason this movie was ever made. First one was OK. This one is a disgrace."
    },
    {
      "rating": "4/5",
      "review": "I laughed a few times loudly... Overall good fun. Could have been a bit better script in the last 30 mins. Anna and Blake have good chemistry."
    },
    {
      "rating": "1/5",
      "review": "Movie is dull - they act so weird and fake. First one at least felt like a mystery. Then the incest sister part is just gross. No depth just rich people parading in weird outfits."
    },
    {
      "rating": "1.5/5",
      "review": "Liked the first movie but this sequel was predictable and disappointing. It started out with promise but fell flat by the end. Wouldn’t watch it again."
    },
    {
      "rating": "2/5",
      "review": "I loved the first one and have watched it multiple times, but this one was all over the place and terrible acting by literally all of the actors and the plot was all over the place, if it even existed at all. I had to turn it off before I saw how it turned out because it was anxiety-provoking."
    },
    {
      "rating": "1/5",
      "review": "The twists for the first five minutes were cute. Then they became nothing but twists and highly irritating. All in all, there was way too much Blake Lively. She reminded me of a clown crossed with the character in Whatever happened to Baby Jane."
    },
    {
      "rating": "0.5/5",
      "review": "What an absolute waste of time."
    },
    {
      "rating": "0.5/5",
      "review": "No need for this to be made"
    },
    {
      "rating": "1/5",
      "review": "Plot is garbage!! Waste of time."
    },
    {
      "rating": "5/5",
      "review": "The film was easy to watch and entertaining. Blake and Anna were both amazing. And Dante! His chemistry with Emily was 🔥🔥🔥."
    },
    {
      "rating": "5/5",
      "review": "Sequel to the 2018 film “A Simple Favor”, “Another Simple Favor” is a mind-blowing experience. It's like being on a roller coaster: a continuous up and down without knowing which direction the story will take. Between a black comedy and a thriller, “Another Simple Favor” is a delirious and glossy sequel, between criminal families, a wedding and mysteries to solve. Blake Lively and Anna Kendrick were born for these roles. Just like in the first movie, they give us two brilliant performances and they share a great chemistry, which for the viewer is always a pleasure to see. To conclude, wonderful locations, plot twists, fast pace, intrigue, mystery and, as in the first chapter, a pinch of comedy, make this sequel irresistible. Highly recommended! It's been a long time since I had this much fun watching a movie. PS. Rewatching the first film (or watching it if you've never done it) is highly recommended."
    },
    {
      "rating": "5/5",
      "review": "blake and anna still have good chemisty and there were lots of twists and turns."
    },
    {
      "rating": "4.5/5",
      "review": "when will number 3 out will never get bored of these movies I loved it definitely recommend"
    },
    {
      "rating": "0.5/5",
      "review": "Anna and Henry is great, but there so much they can do! The plot is a mess, the third act was just ew! Blake and Michelle acting skills are subpar! The fashion is great, but this is not a MET gala."
    },
    {
      "rating": "5/5",
      "review": "As funny and fun as the first one, love the two leads chemistry"
    },
    {
      "rating": "5/5",
      "review": "If you liked the first one, you will like this too!"
    },
    {
      "rating": "5/5",
      "review": "I thought this was a pretty good sequel and liked the twists in it. Just my opinion but I also love Blake lively and Anna Kendrick"
    },
    {
      "rating": "1/5",
      "review": "Well that was a couple hours of my life that I’ll never get back. Loved A Simple Favor … clever and unique script, visually striking, especially Lively and her fits … they should have left excellent alone. Here the Vicky character added nothing, the actors sped through their lines like they had somewhere else to be (which actually would have benefitted them) … a total waste of talent and stunning scenery."
    },
    {
      "rating": "5/5",
      "review": "This is a great follow up to the hilarious and sexy first instalment. Continues rhw same look and feel as the first, with lots of twists and turns as expected. 5* all the way!!"
    },
    {
      "rating": "0.5/5",
      "review": "There was no need for this sequel. Terrible storyline, terrible acting. Not worth watching"
    },
    {
      "rating": "2/5",
      "review": "The first one was very good. This one was a lotta hoopla and fantastic production design, but with an idiotic script and plot. Lively is a good villain, tho, wonder why?"
    },
    {
      "rating": "0.5/5",
      "review": "Michele can't act. They should have stopped at the first one. This is like how sex and the city tried to have a come back but it's just lame. Wasted an hour of my life, I should have went to the gym."
    },
    {
      "rating": "4/5",
      "review": "Wedding Cinema for the Feminine Sleuth In just a few days, this movie will be released on Prime Video, and I am genuinely grateful to have had the opportunity to experience it in Dolby at Regal Cinemas. Some pictures are photographed in a way that the silver screen neither benefits nor hinders, but this isn’t one of those films. Bathed in blues and pastels, the cinematography was like a floral tapestry of Mediterranean colors, dancing around the characters in wides and ariels. While it was clear that meticulous thought went into each shot, it never felt controlled. The locations felt real, as if I watched it from a bedroom window in Italy with my own eyes. The frame never felt small, but also never too large. Capturing their moments like God’s canvas, each splash of light like another shade of flower. Whodunits are notoriously rocky, destructive little stories. Built around suspense and thrill, every beat always leading to a crescendo of turmoil. While a mystery is typically born from an unsuspected death, its consequences are rarely circumstantial. This is the standard for the genre, and yet, none of these traits can be used to explain “Another Simple Favor”. And that’s where it shines. When I took my seat, I was surprised by the number of conversations I heard between other audience members. A packed theater, barely a seat open, and over and over I kept hearing the same thing, “I didn’t know this was a sequel.” Being a fan of the first one, that worried me. Was this the audience to see this flick with? Are they going to be bored? Will they laugh? Will they tremor? Will they understand it or judge it for not knowing how to understand it? I am pleased to say that none of my anxious thoughts came to fruition. “Another Simple Favor” played like a standalone film, never force feeding you exposition for the sake of it. I walked out of the theater hearing many people saying they were going to go home and watch the first one, treating “A Simple Favor” more like a prequel. And that’s because it never pandered to the audience. This movie doesn’t just try to speak to its demographic; it converses with it fluently, always with a knowing wink and a confident nod. It knew what it was before the projector turned on, and because of that, we did too. While I had initially wondered how a sequel could be born from the first picture, I accepted it wholeheartedly by the time the inciting incident occurred—something I had rarely experienced beforehand. With banter shifting between characters at a Gilmore-esque speed, it was done more charmingly than you would expect. It never shied away from its vulgar sharpness that made the first movie so much fun to watch. Each dig felt naturally pointed. Never artificial and planted. While the tone frequently dripped with brilliant sarcasm and extreme wit, the characters also fumbled with digs at one another, as if their wit had dried up. Anna Kendrick and Blake Lively play off of one another like a stage play on its fifteenth performance, dueling with each another as if their tongues were swords. The comedy never lingers awkwardly between them—it lands clean, then cuts, triggering laughter throughout the room whenever prompted. It always held its tongue firmly pressed to the cheek. Part of me craved a crack in its smile—a moment where the mask slips. But then again, maybe that’s the brilliance. It never lets the wine spill. Once again, though, that wasn’t a detriment as this comes back to its remarkable feat of self-awareness. What Paul Feig and MGM created was a wedding film for true-crime enthusiasts, armchair detectives, and wine moms with a twisted sense of humor. It's a mystery that plays beat for beat like a razor-sharp paperback in the window of your favorite bookstore, with a cover doused in floral and blood stains. This movie may not be for everyone, but for those it’s for, you’ll be pressed to find one that knows you this well."
    },
    {
      "rating": "1/5",
      "review": "Honestly, shouldn't have made a sequel."
    },
    {
      "rating": "5/5",
      "review": "The best sequel ever made"
    },
    {
      "rating": "3/5",
      "review": "I liked the first half, the second one was a bit meh."
    },
    {
      "rating": "5/5",
      "review": "It's always hard to follow up an instant classic with a sequel just as strong. The characters are no longer fresh, the element of surprise is harder to capture. \"Another Simple Favor\" delivers another stand out roller coaster of mayhem and frienimyship. There is something zesty and moreish about the way Lively and Kendrick interact on screen. I'd have preferred if Andrew Rannells had been Kendrick's +1 though, I'd like to see more of his character next \"Simple Favor\"."
    },
    {
      "rating": "2/5",
      "review": "Another simple favor is one the wrost movies I watch this year so far"
    },
    {
      "rating": "1/5",
      "review": "It just did not compare or add value to the original, A Simple Favour. It was hard to watch and no where near as intriguing as the first movie."
    },
    {
      "rating": "5/5",
      "review": "I loved the first one and couldn’t believe my luck when I saw there was a second one out today (on Prime). Thrilled with the sequel, how good, it had all the best elements of the first movie, the fashion, the mystery, the plot twists, and the unspoken sexual chemistry between Stephanie (Anna Kendrick) and Emily/ Hope (Blake Lively). Definitely would recommend watching it and I’ll be watching it again."
    },
    {
      "rating": "0.5/5",
      "review": "LITERALLY the WORST sequel ever. The acting in beyond sub par, its painful to watch."
    },
    {
      "rating": "1.5/5",
      "review": "The main player’s personality made the first film work so for some reason they changed this dynamic? Just didn’t work!"
    },
    {
      "rating": "0.5/5",
      "review": "Story made no sense at all, the characters have no personality but are just dramatic for the sake of it. Ridiculous „twists“ that are either predictable or just weird. Would not recommend at all."
    },
    {
      "rating": "0.5/5",
      "review": "Genuinely one of the worst movies I’ve seen in a long time. Terrible and over the top acting, characters were introduced with no back story, and the storyline was both weird and predictable. A waste of 2 hours."
    },
    {
      "rating": "5/5",
      "review": "Funnier (and cuntier) than the first one."
    },
    {
      "rating": "5/5",
      "review": "This somehow exceeded the first film and the first was already amazing. Wow! I’m rattled by how great this script was written, so many little nudges to the first film. So many twists and turns that you don’t see coming. Phenomenal! Blake and Anna are a phenomenal duo once again! This was actually the best film I have seen in a very long time!! Completely unpredictable and captivating"
    },
    {
      "rating": "1/5",
      "review": "The Blake and Michele acting is terrible. The movie is cringe and the story line doesn’t make sense. Also no mobster would ever allow for their fiancé to disrespect their mother by cursing at them and calling them a C word. It makes no sense. It’s poor writing."
    },
    {
      "rating": "5/5",
      "review": "This is a wonderful sequel. It has all of the camp and venom of A Simple Favor. The use of Aviation gin at the reception was priceless."
    }
  ]
}