{
  "movie_name": "Transformers: Rise of the Beasts",
  "reviews": [
    {
      "rating": "5/5",
      "review": "Just Watched This Film For The Very First Time And Let Me Tell You What, It Was Fantastic! Can't Wait For The Transformers And GI Crossover Film If It Comes In 2026!!!! Great Job Paramount And Hasbro 👏"
    },
    {
      "rating": "3.5/5",
      "review": "Missed out on some great beasts."
    },
    {
      "rating": "2/5",
      "review": "It's a parody of avengers movie.."
    },
    {
      "rating": "4/5",
      "review": "Autobots... Maximals... Roll Out!"
    },
    {
      "rating": "3.5/5",
      "review": "It was good but idk, just not the first three, also why the crap was it JI joe amd not sector 7 the crap dude 8.5/10"
    },
    {
      "rating": "3.5/5",
      "review": "Loved the hip hop soundtrack and the characters were fine. Should have had more transparent show up at the end"
    },
    {
      "rating": "1.5/5",
      "review": "Oh my God! Spare us from another two hour fight sequence that is a Transformers movie!! Nodded off twice and didn't miss any plot. Transformers? Snore-bots in disguise 🥸"
    },
    {
      "rating": "3.5/5",
      "review": "Great ! Different from the others but super enjoable"
    },
    {
      "rating": "4.5/5",
      "review": "(CASTELLANO) No reinventa nada, pero sí consigue lo que muchas películas del género ni se molestan en intentar: entretener de principio a fin. Transformers: El despertar de las bestias se mueve al ritmo de la acción casi sin pausa, con una energía que no decae y que consigue que las dos horas se pasen volando. Es puro blockbuster, sin complejos. A diferencia de entregas anteriores, aquí se nota cierta intención de dar algo más de peso emocional. No es que sea una película dramática, ni mucho menos, pero sí tiene algunos momentos tristes que sorprenden por lo bien colocados que están en medio del caos. Y eso, en una saga acostumbrada al ruido por el ruido, se agradece. Visualmente está al nivel que se espera de una superproducción de este calibre: efectos espectaculares, batallas enormes y una puesta en escena que saca todo el partido a los Transformers. Además, la ambientación noventera y la banda sonora con toques de hip hop añaden personalidad y un punto nostálgico que funciona bastante bien. ¿Es predecible? Por supuesto. ¿Está llena de clichés? También. Pero lo cierto es que funciona. Y parte de eso se debe a un reparto que cumple con creces, con Anthony Ramos y Dominique Fishback aportando humanidad a una historia dominada por máquinas. Puede que no sea la mejor de la franquicia, pero sí es una de las más equilibradas. Sabe lo que quiere ser y no se anda con rodeos. Acción, espectáculo, y un par de detalles emocionales bien colocados. A veces, eso basta. (ENGLISH) It doesn’t reinvent the wheel, but it does manage something many blockbusters don’t even try: to entertain from start to finish. Transformers: Rise of the Beasts moves at full speed, with non-stop action and energy that never dips. It’s unapologetic popcorn cinema at its best. Unlike some previous entries, this one actually tries to inject a bit more emotional weight. It’s not a tearjerker by any means, but there are a few surprisingly touching moments that are well-placed amidst all the chaos. And for a franchise that usually goes all in on noise, that’s a welcome change. Visually, it delivers exactly what you'd expect from a big-budget production: spectacular effects, massive battles, and a scale that fully embraces the Transformers’ potential. The ‘90s vibe and the hip-hop-infused soundtrack give it extra flair and just the right dose of nostalgia. Is it predictable? Absolutely. Full of clichés? For sure. But it works. And a big part of that is thanks to a cast that brings heart to the metal, especially Anthony Ramos and Dominique Fishback, who ground the story with some much-needed humanity. It might not be the best of the saga, but it’s one of the most balanced. It knows what it wants to be and doesn’t try to be anything else. Action, spectacle, and just the right touch of emotion. Sometimes, that’s all you need."
    },
    {
      "rating": "0.5/5",
      "review": "Movie was TERRIBLE. Half the scenes i was thinking “These are worse graphics than the original TRANSFORMERS movies and those were made 15+ YEARS ago….” 35 minutes in and i just couldn’t do it anymore.."
    },
    {
      "rating": "3/5",
      "review": "It was ok I though just another transformer movie that’s all"
    },
    {
      "rating": "3.5/5",
      "review": "The best transformers film since the original."
    },
    {
      "rating": "5/5",
      "review": "Great action scenes, decent storytelling this is a great transformers movie."
    },
    {
      "rating": "3.5/5",
      "review": "I liked it! I consider it a comedy action movie, though. It works as a standalone or part of the series. The actors/actresses were really fit for their roles. I'm not a Transformers superfan, but good movie. Props to the choice of music, I knew almost all the songs. Personally, I don't get all the critical reviews, but it's fine. Good movie."
    },
    {
      "rating": "3.5/5",
      "review": "I really enjoyed it. The action and story is great and is super over hated and under rated"
    },
    {
      "rating": "1/5",
      "review": "Trash. Don't waste your time."
    },
    {
      "rating": "2.5/5",
      "review": "Its a popcorn action flick, like with all transformers films. If you switch off your brain this movie is a fun time but it doesn't have much to offer besides that. You can tell that their was care put into making the film though and because of that is definitely one of the better films in the transformers franchise."
    },
    {
      "rating": "0.5/5",
      "review": "Made it 8 minutes before saying something - about white people. America and Hollywood are done for."
    },
    {
      "rating": "0.5/5",
      "review": "If the sci fi and Disney channels created a piece of trash and made it into a movie then rise of the beasts is that piece of trash disguised as a movie. Where is teu Michael bay touch when you need it seriously why do we have robots that look fake like giant toys it’s soo stupid, the plot is uninvolving the charachters are wooden and the action ( thanks to the abscene of Michael bay ) is boring and uninspired seriously who cares anyway who is whom or what is the purpose of these charachters because none of them make sense in the end just another dull movie in the transformers franchise that hasn’t made a good one after the 2007 film ( the only good film in the blockbuster series ) do yourself a favor and don’t waste your money on this worthless and empty nonsense"
    },
    {
      "rating": "4/5",
      "review": "Probably the best transformers movie in the series. Clearly less money was spent on big stars and more money was spent on creating an entertaining movie. Rise of the beasts feels like it's much better quality, while the previous movies felt tacky. Really liked the story as it was simple but entertaining and the writing was really good. The characters were good fun and the villains were dark. It was a nice mix of drama and comedy with heaps of action. Which is all you really want from a movie about giant robots fighting each other."
    },
    {
      "rating": "0.5/5",
      "review": "I did not know if I was watching a Transformers movie or a tourist video of Peru."
    },
    {
      "rating": "5/5",
      "review": "it was the best transformers movie in the world i really enjoyed it"
    },
    {
      "rating": "1/5",
      "review": "This was the weakest Optimus prime, and with the least leadership qualities. I suppose someone may argue this to be a prequel to all other movies, but he is not even an interesting character here. Actually no character is interesting. Everyone seems bored. And the storyline is the most bland one yet."
    },
    {
      "rating": "2.5/5",
      "review": "'Transformers: Rise of the Beasts' continues this franchise's fine tradition of (mostly) underwhelming me, though to be honest it does match predecessor 'Bumblebee' in at least making its plot more than just robots smashing into each other. I wouldn't file it under 'bad', to be fair. The brotherly bond between the characters of Anthony Ramos and Dean Scott Vazquez is this movie's best element, in my opinion. I found that to be touching, even if the film doesn't utilise it as much as it perhaps could have. Aside from those, Dominique Fishback is the best of the humans. As for the voices, Pete Davidson is good in this as Mirage - I think he might be my 'favourite' robot from this whole series. Davidson is lively in the role, amusing too. Peter Dinklage is a mini positive as well, even though I would've preferred if they didn't alter his usual voice as much. Looks like I am going to have to now watch the 'G.I. Joe' franchise at some point, at least that only has three flicks. Well, for now. I best be quick before they pump them out as quickly as 'Transformers' did."
    },
    {
      "rating": "0.5/5",
      "review": "Boring, ugly & old school"
    },
    {
      "rating": "2/5",
      "review": "As is the case with most of these live action Transformers movies, they are only watchable for the action sequences. The human element is terrible. The acting is bland and hard to believe, and the humor falls flat more often than not. Mostly just rolling your eyes until the action returns. I can't imagine ever paying to watch this nonsense in a theater."
    },
    {
      "rating": "3/5",
      "review": "Pretty average addition to the Transformers Series. Best part was Pete Davidson as Mirage along with Anthony Ramos as the lead. The voice actors did a great job but the rest of the human cast were pretty meh. Dominique as the expert in antiquities was not credible. Not a memorable movie."
    },
    {
      "rating": "5/5",
      "review": "Entretenida , muy buena trama y finalmente no solo se enfocaron en una mujer guapa en la película, fue todo acción y se mantuvo en la línea."
    },
    {
      "rating": "1.5/5",
      "review": "Ninguna de las películas de la saga es buena, y está no es la excepción, mal guión, malas actuaciones, mal cgi"
    },
    {
      "rating": "5/5",
      "review": "Very underrated! It absolutely decimates everything that Micheal Bay has been giving us for 8 years! While it may be strange in some moments, the humor, heartfelt and action packed moments followed by strong acting, with great CG effects makes it definitely worth watching!"
    },
    {
      "rating": "1/5",
      "review": "No continuity with the other movies"
    },
    {
      "rating": "0.5/5",
      "review": "It kinda felt a character assassination of the Optimus Prime like isn’t he like supposed to protect earth and not be like the Mikey Bay (Michael Bay) Prime? Like his is just not a good sequel to the Bumblebee movie and yes look it up “Transformers: Rise of the Beasts” is a sequel to Bumblebee"
    },
    {
      "rating": "3/5",
      "review": "While I wasn’t such a big fan of this one, I can see the appeal as to why this shook the world. The movie’s visuals feels a little more lazy, the plot is all over the place just like a Transformers movie usually is, and the characters that they decided to focus on were probably the most uninteresting of the bunch. The movie borrowed some concepts from other movies unashamedly, more inconsistencies plagued this one, and the characters they chose to focus on weren’t the most compelling of the cast. All-in-all, it wasn’t terrible, but I found all their creative choices to be very odd and outlandish."
    },
    {
      "rating": "0.5/5",
      "review": "Uncreative Movie and a shame for the franchise"
    },
    {
      "rating": "3/5",
      "review": "There wasn't really a need for another transformers movie, but here we are. It's enjoyable enough, the dialogue can be pretty cheesy, but the cgi looks quite good."
    },
    {
      "rating": "3/5",
      "review": "The movie is quite okay to say the least, but when I watch this film I felt that some parts of the film feel quite rushed, but overall as big Transformers fan I do really like the action scenes of this film and Ron Perlman dan Peter Dinklage have some amazing perfomance as Optimus Primal and Scourge respectively, overall I give this movie a solid 7.2/10."
    },
    {
      "rating": "4/5",
      "review": "Solid Transformers movie. Fans of the franchise will definitely enjoy it"
    },
    {
      "rating": "1/5",
      "review": "What a boring and lifeless movie can’t believe the audience reaction to this snooze fest the charachters were dull the robot designs looked to cartoony for a live action setting and the storytelling was uninspired at least the michael bay films at least his first ones had good looks for a live action film like the robot designs here it just looks lifeless and the cinematography and background graphics and imagery are dull and flat the action is probably the worst to ever come in this franchise or especially the most boring bays films ( the first one and number 3 had at least exciting and well staged action where you could tell who was doing what to who here thanks to the wonky movements from the robots feel like that of a kid playing with toys crashing into each other we all thought the bumblebee ( which was a prequal not a reboot ) would redeem the franchise from the sequals which it did this is a step back from that making it even worse than the first two bay sequal sure it may not be as jeuvenile as revenge of the fallen but it still has the same repeated plot line as it. Many have put bumblebee and the recent transformers one as the best but in my opinion I stand by as the first Michael bay directed film from 2007 as the best and considering because it was meant to be a modern 21st century blockbuster links pirates of the carribean and lord of the rings that is by far the best in terms of blockbuster standards. That original is way better than rise of the beasts. Rise of the beasts is stupid and souless and doesn’t deserve any love from those who find the franchise redeemable this is just another lackluster installment in this near inconsistent franchise overall I give the cartoon disguised as a live action snooze fest that is transformers rise of the beasts a 3/10"
    },
    {
      "rating": "1.5/5",
      "review": "Generic story, low budget actors. It's watchable."
    },
    {
      "rating": "0.5/5",
      "review": "one of the worst and stupidest movies I've ever seen"
    },
    {
      "rating": "4.5/5",
      "review": "This movie has a special place in my heart for a Transformers movie. This was the first Transformers movie that I saw in theaters. I love the designs for the characters and the movie itself."
    },
    {
      "rating": "2.5/5",
      "review": "Autobots took forever to lock in, story was mid, and action was mid."
    },
    {
      "rating": "2/5",
      "review": "Lead actor was probably the worst part of the movie, since he had no face expression or acting skill.. It was hard to tell if his mother had just died, or he had gotten 1 million dollars. Autobots are pretty much the same, but the new/old prime design is \"ehh\", and they somehow manage to make them less likeable, not to mention honorable for every movie. Aside from that you get a few cheap laughs, but mostly its just another \"make them bigger\" movie, instead of focusing on good storytelling."
    },
    {
      "rating": "2.5/5",
      "review": "Transformers: Rise of the beasts was so-so. I liked Mirage, but the whole transwarp key storyline, I wasn't a big fan of. I also did not like Noah or Elena at all, as I wish they had Sam and Mikela from the first three movies. I would give it a 57%."
    },
    {
      "rating": "5/5",
      "review": "Out of all the transformer movies,this is the best"
    },
    {
      "rating": "4.5/5",
      "review": "Nice movie the comedy and the action is ok. Great reboot to the bay verse tho"
    },
    {
      "rating": "4.5/5",
      "review": "The best of the mainline of the franchise by a MILE. Still not perfect, save for bumblebee capturing that iron giant type vibe no transformers movie has managed to not mess up somewhere. But this movie is pretty great! I think introducing Beast Wars elements for a singular prequel was an interesting move, I think the human characters have souls for the first time since Megan Fox & Shia LaBeouf still looked like Jennifer Check and Stanley Yelnats, and I genuinely enjoy the story, conflicts, and themes they explored here, that while repetitive for this franchise are done better this time around. I just wish they hadn't done the GI Joe cameo, I don't need a Hasbro Cinematic Universe"
    },
    {
      "rating": "4.5/5",
      "review": "DIOS,la mejor hasta ahora, de todas las peliculas de transformers esta ah sido mi cuarta MEJOR pelicula de ellos, la emocion, la accion, puedo sentir que con los personajes te encariñas, hasta llore por la muerte de mirash, simplemente fenomenal un 8.5/10, FABULOSO"
    },
    {
      "rating": "4/5",
      "review": "This movie is not bad at all i enjoyed it mostly"
    },
    {
      "rating": "4.5/5",
      "review": "Transformers one maybe overtops this movie but this movie is still great. This movie that i realised is about ambition and sacrifice and it made a good point and i don't care what any critics says about this 9.6/10"
    },
    {
      "rating": "3.5/5",
      "review": "Overall this film is light, quite good with the concept of maximals, the relationship between humans and autobots other than bee and optimus (mirage and noah), and autobots fighting non-decepticon enemies. Unfortunately, this film runs too fast and has several plot holes such as whether the unicron in the film comes from another universe (considering the theory that transformers in the future use the multiverse concept). If that is true, then there are 2 unicrons in the film."
    },
    {
      "rating": "3.5/5",
      "review": "One of the better Transformers movies. The characters are actually engaging and well written. The action and cgi is great. And the story is quite good."
    },
    {
      "rating": "3.5/5",
      "review": "The best Transformers movie to date. Can't wait for G.I Joe crossover soon."
    },
    {
      "rating": "5/5",
      "review": "Fuck what the critics say Transformers: Rise of The Beast is awesome so does Transformers One go see these films as well as Nimoa."
    },
    {
      "rating": "2.5/5",
      "review": "Muy aburrida, no me atrapó en ningún momento y la siento innecesaria para el universo Transformers. Lo único rescatable son los diseños de los Maximals y su transformación."
    },
    {
      "rating": "5/5",
      "review": "とてもCGがすごくラストの展開はとても感動する。"
    },
    {
      "rating": "4/5",
      "review": "Just finished watching this film and I enjoyed all of it. The fights were really entertaining and the story was good. I liked the new auto-bots and I also liked the Maximals. Sound design is good and the editing is very strong, some parts looked a very tiny bit off but you barely notice it. I wasn’t to sure about how I liked the guy, Noah, getting the auto-bit armour but it somewhat fit the story. I got used to it after a while. Bumblebee is still my favourite after watching all the transformers film, he had such a cool entrance at the end. Definitely watch this film if you want to watch the others or you have seen the other films. 👏🏼"
    },
    {
      "rating": "2/5",
      "review": "Most of the dialogs shared are corny, too fast paced but boring I don't even know how that's possible but it is"
    },
    {
      "rating": "4/5",
      "review": "I know the critics didn't think this movie was too good, but in my opinion, this was actually good. Unlike some of the other tranformers movies, the story, while a bit bland, is actually an improvement. Somehow, I was engaged with the human storyline and the Maximals were pretty cool! Especially Airazor! There's still a lot for me to learn in this franchise, but I really did like this one!"
    },
    {
      "rating": "3/5",
      "review": "Just okay like all the rest"
    },
    {
      "rating": "3/5",
      "review": "Charaktere sind echt lahm geschrieben.Die Effekte sehen nicht mehr so gut aus wie in den Vorgängern.Manchmal unterhaltsam,manchmal langweilig.Hat solide Action und soliden Cast.Aber diesem Film fehlt Michael Bay und dieser Film ist genau wie Transformers 2:mittelmäßig.Trotzdem würde ich mir lieber nochmal Transformers 2 angucken weil er Michael Bay beinhaltet. Der Film ist nicht so beschissen und guckbar aber ein Film den ich in einpaar Jahren wieder vergessen werde."
    },
    {
      "rating": "4/5",
      "review": "O filme é bom,mas não é o melhor da franquia,ele tem defeitos,mas eu gostei desse filme,tem referências aos filmes anteriores e aos desenhos e gostei do noah e da Helena,e eu gostei do mirage porque ele rouba a cena,o cgi e os efeitos são bons,e que na minha opinião é nota:8,5"
    },
    {
      "rating": "3.5/5",
      "review": "Not bad. I enjoyed this movie."
    },
    {
      "rating": "4/5",
      "review": "A much better film than it's predecessors, and definitely one that doesn't feel like a cheap cashgrab, although not flawless."
    },
    {
      "rating": "2.5/5",
      "review": "**Transformers: Rise of the Beasts** - ★★☆☆☆ As a big *Transformers* fan, I was super excited for *Rise of the Beasts*. Hearing Peter Cullen as Optimus Prime again is always awesome, and Bumblebee is still my favorite! The CGI looked really good, and the Transformers and Maximals were cool to watch. The voice cast did a great job, and you can watch this as a prequel, sequel, or even on its own. The action scenes were fun and there were some funny moments too. But the story felt really thin and could have used more backstory. It got a bit boring and predictable at times, and I wish we saw more of the Maximals. That said, there were some great sequences, and the ending got me excited for what’s next. Overall, it’s not the best *Transformers* movie, but it’s definitely not the worst. If you’re a fan, it’s worth a watch!"
    },
    {
      "rating": "3.5/5",
      "review": "Not bad as far as these things go. Bumblebee was good. The other one I saw had Megan Fox. That was bad. This is somewhere in the middle. Good enough to watch."
    },
    {
      "rating": "0.5/5",
      "review": "Literally the worst of all Transformers in my opinion. So ghetto, poor acting and script writing. I do not recommend."
    },
    {
      "rating": "1/5",
      "review": "I have watched all 7 Transformers films, some many times. The first is still a masterpiece, with Shia LaBeouf and ensemble cast around him setting the bar so high that no one has matched it since. In 2007 this was all very groundbreaking. But even then a tendency to have over long action sequences when literally nothing interesting happens. Bumble Bee with Hailee Steinfield was another high water mark. the tone and her star role make this a very memorable and re-weatchable film. I note that the producers felt Bumble bee lacked the big set action that audiences need, but for me, real human interactions and this more down to earth scale was really good and they should try and capture that again. So for 'Rise of the Beasts', allegedly an opportunity to combine the human scale of BB with human characters we care about. But unforunately the actors may well be good in this, but the script does not allow them to be truly witty and deep characters. It feels like mindless action rules again. The trailer looked promising, but I wont watch any more Transformers, unless strong witty human characters and more human real scale stories take centre stage again. This one is sadly such a missed opportunity."
    },
    {
      "rating": "5/5",
      "review": "Why did Ramos cheat on his girl?? Good movie tho"
    },
    {
      "rating": "4/5",
      "review": "Loads of action and loads of special effects and if you like Transformers you wont care about the plot or script. Kids just love it and opens up even more merchandising options."
    },
    {
      "rating": "4/5",
      "review": "A lot better than expected! Overall it’s very entertaining despite the predictability. 8/10"
    },
    {
      "rating": "5/5",
      "review": "I can’t wait for the next transformers movie hopefully coming out in 2025 👍"
    },
    {
      "rating": "2.5/5",
      "review": "Not Bad, but Not My Favorite"
    },
    {
      "rating": "1/5",
      "review": "I believe it’s time for the franchise to call it in…."
    },
    {
      "rating": "4/5",
      "review": "Funny and packed with great comedy and action scenes."
    },
    {
      "rating": "0.5/5",
      "review": "Absolutely terrible movie. Cheesy lines. I realize the bar is high from the first 2 transformers but this movie wasn’t worth watching the first time much less a second or recommending. My recommendation is save your time and watch a different movie. That is all."
    },
    {
      "rating": "0.5/5",
      "review": "It seems the transformer series is becomimg dumber and dumber. Why couldnt they make a decent film. Its just silly, lousy script written by 1st graders. Incoherent plot."
    },
    {
      "rating": "5/5",
      "review": "This was my introduction to the Transformers franchise. I loved it so much that I have watched all of the theatrically released films and started collecting the merchandise"
    },
    {
      "rating": "3/5",
      "review": "Pete Davidson really shines as he displays his comedic skills. If you are a fan of Transformers, and action movies you are going to like this."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is not bad, but it’s Kinda missing the part"
    },
    {
      "rating": "5/5",
      "review": "awesome movie awesome plot amazing scenes I give it a A+ A+ A+ A+ A+ A+ A+"
    },
    {
      "rating": "4/5",
      "review": "way better than expected, better than most michael bay transformer movies"
    },
    {
      "rating": "5/5",
      "review": "If you are a Transformer fan, and Peruvian, it’s a movie must watch!"
    },
    {
      "rating": "2.5/5",
      "review": "Don’t let this movie fool you. Even a year later, this is still what I would consider the “Indiana Jones and the Kingdom of The Crystal Skull” nutcase for this bizarre, odd series. If you watch it, you’ll see what I mean."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie I grew up with both beast wars and the original transformers. The characters were written nicely. The designs for the transformers are iconic (it has my favorite Optimus prime design). And the villains and FINALLY introducing Unicron are also iconic. while the movie felt short for me it is a great movie fans will love."
    },
    {
      "rating": "4.5/5",
      "review": "I should've caught up on the backstory before watching it but really intricate and well made"
    },
    {
      "rating": "3.5/5",
      "review": "Transformers: Rise Of The Beasts is an entertaining sequel to a new era of Transformers with great action and visuals. But the poorly written dialogue and generic nature of the film keep it from being amazing. Rating: 70% 🍅"
    },
    {
      "rating": "5/5",
      "review": "The comedy was perfect!"
    },
    {
      "rating": "1.5/5",
      "review": "Boring, bland, terrible visuals and character changes."
    },
    {
      "rating": "4/5",
      "review": "Rise of the Beasts leans into it's cartoonish roots, and delivers a fun, action filled adventure with improved character moments that the Bayformers era failed to do. Anthony Ramos does really well leading the charge, and had some really good character moments in this one. Shoutout to Ron Pearlman, Michelle Yeoh, Pete Davidson, and of course Peter Cullen for some really solid voice acting. I recommend it. B-"
    },
    {
      "rating": "4/5",
      "review": "Although this film amplifies the elements that the previous films felt short on such as the Transformers screen time and story arc being the central point in the film and pays, it lacks on the aspects that the franchise is well-known for: stylish action and memorable human characters."
    },
    {
      "rating": "2.5/5",
      "review": "Lots of great action sequences and CGI Robot fights which, if we're honest, is the real reason to watch a transformers movie. Unfortuanly the plot was much the same and the human characters were bland and uninteresting. As with previous films in the franchise, the humor fell flat, especially in the case of mirage. If you're looking for a popcorn film that you can put on and enjoy without putting real effort into watching film, this is for you."
    },
    {
      "rating": "5/5",
      "review": "This movie was AWESOME. I really enjoyed it. Way better than the last two transformer movies. Which were trash."
    },
    {
      "rating": "3/5",
      "review": "Transformers: Rise of the Beasts is a solid entry in the franchise, delivering high-octane action and visually striking sequences. Yet, it falters in replicating Michael Bay’s iconic style; its attempt at chaotic energy and relentless explosions feels like a disjointed imitation, lacking the immersive coherence Bay is known for. Set in 1994, the film introduces the Maximals, with Ron Perlman’s Optimus Primal leading a team that joins forces with the Autobots, headed by Peter Cullen’s Optimus Prime, to battle the planet-devouring Unicron. Peter Dinklage’s portrayal of Scourge adds a darkly humorous edge to the villain role, but it is Pete Davidson’s Mirage who stands out with his irreverent and hilarious voice work, injecting a vibrant comedic energy into the film. Michelle Yeoh’s Airazor and Cristo Fernández’s Wheeljack further enrich the character roster with their distinctive contributions. Human leads Anthony Ramos and Dominique Fishback deliver compelling performances as Noah Diaz and Elena Wallace, infusing the film with emotional depth and reinforcing themes of family and perseverance. Despite its impressive visuals and engaging performances, Rise of the Beasts struggles to leave a lasting impact, falling short of innovation while providing a satisfying, if conventional, adventure."
    },
    {
      "rating": "2/5",
      "review": "This movie didn't fare so good as Bumblebee."
    },
    {
      "rating": "3.5/5",
      "review": "It's a good movie BUT if they focus more on the beast story I guess is gonna be the best movie and yeah is worth to watch btw."
    },
    {
      "rating": "0.5/5",
      "review": "Really nothing movie. It pads itself with really crappy jump-scares, and it's heavy handed story telling just makes what's coming incredibly obvious. Not even a good action movie."
    },
    {
      "rating": "1/5",
      "review": "Watch it if you love cringe-worthy dialogue and a story line that's beat to a pulp."
    },
    {
      "rating": "3/5",
      "review": "we waste fora Years to wait this movie."
    },
    {
      "rating": "1.5/5",
      "review": "Exceptionally boring and sauceless. Get Michael Bay back on it asap"
    },
    {
      "rating": "1.5/5",
      "review": "After watching all the Transformer films that came before Rise of the Beasts, I would say this one is probably the best. However, the film ultimately still suffers from horrible character development with the humans being forced into the situation without any personal connection to the story and with half of the autobots not being introduced or explained whatsoever. Another issue is the plot. It's just another \"save the artifact and save the world\" gig, with the ultimate bad guy, Unicron, having no motive other then to eat planets. Unicron doesnt even look cool. The pacing and action are better in this film than in the previous Transformers movies, this in the 21st century, that will only get you so many stars. I agree with other critics as well that the overall philosophy and code of ethics of the autobots is very unclear."
    },
    {
      "rating": "1.5/5",
      "review": "It gets a pass for not being as visually impressive. There really are parts that make you cringe enough to want to fast forward. It hits certain \"modern tropes\" really on the nose. Optimus Prime doesn't feel like Optimus."
    },
    {
      "rating": "3.5/5",
      "review": "While it may not have the jaw dropping visual scope of the Michael Bay series, they up the ante from Bumblebee while retaining coherent story telling with good characters. Again they do a better job at fleshing out the human characters & their motivation being involved in the story. Optimus prime has a good character arc & movie does a solid intro to the primals. They definitely borrowed designs for antagonists from Lord of the Rings. The soundtrack with heavy hip-hop from 90's was pretty dope & matched the vibe of the story. First 2 acts of movie swiftly with interesting set pieces, but slows down in the 3rd with a CGI heavy final act we are accustomed to in the past decade from blockbuster movies. However, I am genuinely interested in how they will continue to expand this storyline in the Hasbro universe they're building. Solid movie on a big screen."
    },
    {
      "rating": "2/5",
      "review": "No es lo que esperaba cómo fan de la franquicia"
    },
    {
      "rating": "5/5",
      "review": "New transformers was so special"
    },
    {
      "rating": "5/5",
      "review": "Returning to the action and spectacle that have captured moviegoers around the world, Transformers: Rise of the Beasts will take audiences on a '90s globetrotting adventure with the Autobots and introduce a whole new faction of Transformer -- the Maximals -- to the existing battle on earth between Autobots and Decepticons."
    },
    {
      "rating": "5/5",
      "review": "It’s a really good movie."
    },
    {
      "rating": "4.5/5",
      "review": "It was a great new transformers movie. Best since 2007 it had great visuals, story, soundtrack and action."
    },
    {
      "rating": "5/5",
      "review": "Transformers: Rise of the Beasts is a thrilling and fresh addition to the franchise that revitalizes the series with new energy and bold, exciting characters. The introduction of the Maximals adds an exhilarating new layer to the Transformers universe, offering fans a dynamic blend of nostalgia and innovation. The action sequences are electrifying, and the visual effects are nothing short of spectacular, making every transformation and battle scene a feast for the eyes. The film balances its epic scale with a grounded story, and the chemistry between the cast brings warmth and heart to the adventure. Rise of the Beasts is a triumphant return to form, delivering everything fans love about the series while pushing it forward in exciting new directions. It's definitely a must-watch and this is truly the best Transformers movie yet!"
    },
    {
      "rating": "5/5",
      "review": "The final is okay but the theme is I remember is arrival to the earth"
    },
    {
      "rating": "4.5/5",
      "review": "O filme e sensacional e propõe tudo que é dito, tem excelentes cenas de ação e os personagens são bons"
    },
    {
      "rating": "5/5",
      "review": "Can't beat the Transformer's!"
    },
    {
      "rating": "4/5",
      "review": "The best Transformers movie. Period. I'm a Transformers superfan and this hits the Transformers narrative better than any other movie. the action is the best in the franchise and the Characters and finally interesting for a change. However, There are too many cooks in the kitchen. This movie tries to fit in a lot of content when it should be really simple. The beast wars tie in is ultimately unnecessary. Unicron and the Terrorcons are cool to see but maybe also not needed. It's not my idea of a great Transformers movie but it's the best you can get."
    },
    {
      "rating": "2.5/5",
      "review": "It was okay. The weakest of all Transformers. Can't compete with 1 & 2."
    },
    {
      "rating": "5/5",
      "review": "The Movie with Robot Animals, and New Autobots!"
    },
    {
      "rating": "0.5/5",
      "review": "Genuinely one of the worst cinematic experiences of my life Worst writing I have ever seen. Mirage single handedly made this one of the most unbearable 2 hours of my life. I can’t remember any of the characters names."
    },
    {
      "rating": "5/5",
      "review": "I thought the film was really good no scratch that Great with even so far to go that it’s on par with bumblebee from 2018 and a great reboot of what transformers 2007 could’ve been if they were More true to the source material and actually used G1 designs while also making them look realistic and while this film does have a plethora of deleted scenes in which maybe two or three of them could have stayed in the movie which would have made it better but who knows maybe similar to godzilla minus one they may re release this films with some of the deleted scenes added in with these being the airazor maximal crest scene. The extended cave scene and a few of the extras scenes from the switchback alternate chase scene. The this can’t be real scene and maybe the transit scene and probably with some maximal scenes to explain why they remain in beast mode most of the time along with using airazor a spark as a bomb cut scene as well and maybe have those other three autobots that arrived on earth at the of the bumblebee movie with these autobots being maybe grimlock Ironhide and ratchet and maybe jazz sideswipe and some other well known autobots to show how many autobots arrived On earth during the seven years since bumblebee in maybe another post credit scene where like Optimus waiting in idk maybe Yellowstone or something for the rest of his autobots to meet up with him and wheeljack stratosphere arcee and bumblebee and when these other autobots I mentioned earlier arrive the camera does like a huge crowd shot scene showing autobots like (sorry if I’m repeating myself)[deep breath in] Ironhide grimlock drift Windblade ratchet Jazz sideswipe whirl warpath tailgate and some other well known autobots with laserbeak in the distance out of sight seeing this all happen through his head camera thing as a way to foreshadow the decepticons coming to earth now that would be a good post credit scene or a good ending cliffhanger. Either have that in a theatre re release or a extend film DVD/digital re release or something"
    },
    {
      "rating": "0.5/5",
      "review": "I actually liked the other transformers that came before this one but this one was just awful"
    },
    {
      "rating": "3.5/5",
      "review": "Me emociono ver a mi país involucrado en esta película."
    },
    {
      "rating": "0.5/5",
      "review": "Terrible acting from the female actor. She has an extremely unpleasant voice that is really hard to listen to. The movie just lacks substance"
    },
    {
      "rating": "2/5",
      "review": "This was the worst out of the franchise. I was very disappointed. It wasn’t terrible but it wasn’t great either. I’m a huge Transformer fan"
    },
    {
      "rating": "3/5",
      "review": "It’s okay. Unfortunately that’s the most you can expect from the transformers franchise."
    },
    {
      "rating": "0.5/5",
      "review": "This movie was so incredibly boring, and awful. I sat their the whole time with my sister and we agreed this was the worst transformers movie. Their were, boring fight sceans, bad CGI, awful dialog, bad music soundtrack, very bad human characters, and other wasted charecters (The only good characters were Bumblebee, Scourge, and Optimus Primal). Most of the movie the Maximals weren't in it, the beginning yes, we got like 10 minutes of them, then we go about an 1 hour without them, and the hawk one and Primal got to talk most, the cheeta had one line, the rhino didn't talk at all, and I here they didn't add a character named Rattrap. The Movie Is Called 'RISE OF THE BEASTS' FOR A REASON!!! Why did they have such little screan time!!! Also, Optimus Prime was so out of character this whole movie. He hated humans, acted like a terrible leader, he didn't value others lives except Bumblebee, he didn't give hope or wisdom to his friends just kept them in doubt, he was still brutal (People say he isn't in this movie but that ain't true \"I'm going to take away his key, then his head\". Thats just a sensored version of \"I'm getting that key then ripping off you head!\" Then later he grabs Scourge and slams his face in lava until it starts to melt, and when Scouge breaks free Optimus Prime cuts his arms off, stabs him in the head and rips his head off, and his robot spine is still connected to his head. HOW IS THAT NOT BRUTAL!?) And his design is garbage as well. They focused too much on the humans and it was sooooooo boring, the human sceans in other movies were funny and/or interesting, but this movie had awful sceans with humans. It was garbage scean to more garbage. Thier was only one good scean of the hole movie and that was Bumblebee's return scean."
    },
    {
      "rating": "2.5/5",
      "review": "It is very childish the special effects are horrible and low quality, about the story it is kind of nonsense and the dialogue it is kind of cringe"
    },
    {
      "rating": "4/5",
      "review": "Better than the last transfers film, but not a good as the originals."
    },
    {
      "rating": "1/5",
      "review": "This movie stinks worse than Bumblebee's exhaust pipes. I was glad when terrible bird bot - SPOILERS - died. Just go watch Beast Wars if you haven't yet you uncultured swine."
    },
    {
      "rating": "2.5/5",
      "review": "So much potential here, but I feel like they cut out the wrong scenes and ideas. Not the worst Transformers movie, but not the best. 5 out of ten, I'm going to buy all the Studio Series figures though."
    },
    {
      "rating": "3/5",
      "review": "I found Transformers: Rise of the Beasts to be hard to believe besides the obvious circumstances. Almost as if they would expect us not to believe that humans weren't aware that they shared the earth with such beings after all the previous films."
    },
    {
      "rating": "0.5/5",
      "review": "SPOILERS IN THE COMMENT This has to be one of the worst movies I have ever seen in my life, starting with the destruction of any timeline, like why does no one appears to know what a utobot is even tho they pretty much destroyed the world in the dark moon, oh how are they afraid by POLICE MAN when the only people that could take them were specialize forces, but one of the most annoying part was the characters, how can you tell me that a guy with a cuestionable moral (he was doing illegal stuff and robbing a car) out of the sudden, decides to save the world with the transformers, he is completely useless and has no way of helping, and he decides to leave his dying little brother for that... like really? no hesitation no nothing? is like they are emotionless, is so so bad, such a bad script, not even while even in separate days I`ve been able to finish this thing"
    },
    {
      "rating": "5/5",
      "review": "Una pelicula entretenida y me encanto el personaje mirash"
    },
    {
      "rating": "5/5",
      "review": "Didnt know a new transformers had even come out until i saw it amazon. But just watched it and it’s a great movie. The plot was great and so are the easter eggs planted throughout the film."
    },
    {
      "rating": "0.5/5",
      "review": "To be honest the movie didn't make.much sense it didn't connect to the previous movies and Optimus prime is basically hating on the human though they have saved them so many times. Let's not forgot the needless destruction. Overall the movie would have made sense if the previous transformers came to add just like the last movie and the previous"
    },
    {
      "rating": "4/5",
      "review": "Not bad, not bad at all! One of the better scripts for a transformer movie, likeable characters and voices. My son and I had a great time watching it!"
    },
    {
      "rating": "3.5/5",
      "review": "3rd best Transformers film. This one has mixed reviews, both with critics and audience, but I enjoyed it. 7.5/10."
    },
    {
      "rating": "1.5/5",
      "review": "It’s like they really need to appeal to the “modern audience” as a quota. Even though it is very subtle it is too obvious. They ignored basically the lore constructed on the first 5 films, didn’t even cared the sequence of events. Maybe the intention was a remake but it is a prequel, so they cared less. VFX are video game level, and plot nothing out of this world, not that you expect it from Sci-Fi film. A Robot with an accent just cause it is in SouthAmerica but doesn’t speak the local language makes no sense, this shows so much bad writing just like the robot suit that suddenly made Noah super powerful, poor imagination. There are some scene sequences that look strange as just pasting scenes for the sake of pasting scenes, grade level. Gave it initially 2 stars, but RT’s 2 star saying as “not bad”, was a joke. 3 is still BAD, not bad is after 3 in an “out of 5” score, so it gets. 1.5 to get te point across."
    },
    {
      "rating": "5/5",
      "review": "transformers will always be the best of all time"
    },
    {
      "rating": "2/5",
      "review": "unenthusiastic cast, worse cgi than previous movies in the franchise, and very basic premise."
    },
    {
      "rating": "3.5/5",
      "review": "This exceeded my expectations and it's way better than the previous installments."
    },
    {
      "rating": "0.5/5",
      "review": "just awfull, i never watched a movie that was that bad"
    },
    {
      "rating": "4.5/5",
      "review": "La historia es buena me u viera gustado que tú viera más tiempo en pantalla Bumblebee"
    },
    {
      "rating": "4/5",
      "review": "As someone who really disliked the Michael Bay series, this one was successful. Good casting, clean storyline and a lot of heart. The CGI has been simplified so that the fight scenes are watchable and I actually know what’s happening. And I absolutely adore Anthony Ramos."
    },
    {
      "rating": "1.5/5",
      "review": "Nice visual, but a weak story. Watch with 90% brain off to enjoy. (compared to 70% in the early installment)"
    },
    {
      "rating": "4/5",
      "review": "La película es buena te divierte mucho yo la vi con mis amigos y la verdad nos gustó mucho. Mi top personal de la franquicia Transformers. 1. Transformers Dark Of The Moon. 2. Bumblebee. 3. Transformers 2007. 4. Transformers Rise of the beats. 5. Transformers Revenge Of The Fallen. 6. Transformers Age Of Extinction. 7. Transformers The Last Knight."
    },
    {
      "rating": "4.5/5",
      "review": "Peter Dinklage surprised me by being in this movie. The voice acting was top-notch, the animation and cast perfect. However, I must take away half a star because of the G.I. Joe crossover during the end credits. Other than that, this movie deserves every bit of praise I can muster. Good job, Caple!"
    },
    {
      "rating": "4/5",
      "review": "I like how this movie set in the late 80's early 90's The Soundtrack was pumping along with the voice of Gosh can't think of his name right now but soon as I do I will edit with an update trust ."
    },
    {
      "rating": "4.5/5",
      "review": "Feels like a reboot of the original series. Love the integration of Beast Wars, grew up watching this animated series, good cast and a refreshing story."
    },
    {
      "rating": "3/5",
      "review": "Scenes similar to other movies like Lord of The Rings, and I think the environments where action and terror took place are in forests, mountains and roads around hills. If it was a city like New York\"s tallest building The Trade Center, it would definitely attract all sorts of infrastructure destruction from previous Transformer films including the military. It would be interesting to see if the next sequel will be in the city."
    },
    {
      "rating": "1/5",
      "review": "Transformers: Rise of the Beasts - A Robot Rumble That Totally Misses the Mark While Transformers: Rise of the Beasts boasts impressive visuals and some exciting action sequences, it ultimately sputters under the weight of a generic plot, forgettable characters, and an over-reliance on nostalgia. Here's what explodes: • Spectacular CGI: The film's special effects are undeniably impressive, bringing the transforming robots to life in dazzling detail. • Action-Packed Fights: The battles between the Autobots, Decepticons, and newcomers, the Maximals, are undeniably thrilling to watch on the big screen. However, these positives get buried under a heap of negatives: • Rehashed Plot: The story offers little that's new or inventive, relying on familiar beats and predictable plot twists. • Shallow Characters: Both the human characters and the Transformers themselves lack depth or development, making it hard to connect with them. • Nostalgia Overload: The film leans heavily on references to past Transformers films, which might feel pandering to some viewers. • HORRIBLE ACTING, DIRECTION and WRITING !!! • Forgettable Experience: Despite the big visuals and action, the film fails to leave a lasting impression. Transformers: Rise of the Beasts might appeal to die-hard Transformers fans looking for a visual spectacle. But for casual viewers, it's a noisy and generic experience that offers little substance beyond the special effects. This disappointing sequel earns a mediocre 2.0 out of 5 stars. NOT worth investing any time watching, let’s hope the next installment is better!!! - Matthew"
    },
    {
      "rating": "5/5",
      "review": "Great Prequel after Bumblebee, The Ending there's a G.I. Joe"
    },
    {
      "rating": "1.5/5",
      "review": "Humans sucks Robots lackluster"
    },
    {
      "rating": "0.5/5",
      "review": "Easily the worst of the series"
    },
    {
      "rating": "2/5",
      "review": "Big fan of the series but this is easily the worst one. Poor choice of actors, dialogue, and very average story."
    },
    {
      "rating": "4/5",
      "review": "A good take on the transformers series, i like the directors style and the emphasis more on action, seems to hit the spot more than previous installments. The acting may of lacked \"greatness\" but overall it was still a good watch."
    },
    {
      "rating": "0.5/5",
      "review": "Well, what did you expect? DEI instead of WOW!"
    },
    {
      "rating": "5/5",
      "review": "My favorite in the franchise. Davidson's character added much, plus the music was \"dope.\" The love & teamwork shown here adds warmth. Love the scenes in Peru!"
    },
    {
      "rating": "3/5",
      "review": "One of the weaker movies in the franchise. It was too rushed and the humans where the worst part with little development. But Unicron was the best part of this movie by far with amazing voice acting done by Colman Domingo and Scourge was ok. I think Optimus Primal was a good addition to the franchise. But it's not the best writing wise. It's definitely not one you need to watch but it's not bad."
    },
    {
      "rating": "3/5",
      "review": "Honestly, it's pretty okay. The Transformers bits are, anyway. It is literally a mashup of the plots from the other movies. The human parts honestly suck, and you can guess why, but it's not the most offensive film ever in that respect. I'm just glad I could skip through those parts."
    },
    {
      "rating": "3.5/5",
      "review": "Hace años que no catalogaba a una película como un verdadero \"Blockbuster veraniego\"."
    },
    {
      "rating": "5/5",
      "review": "This was one of the best transformer movies I saw this movie was really good a lot of 90s nostalgia it was a lot of fun like I enjoyed it it was like I was a kid again, watching the first movie"
    },
    {
      "rating": "4/5",
      "review": "A heartwarming story between 2 brothers and an entertaining climax. One of the more enjoyable Transformers films."
    },
    {
      "rating": "3.5/5",
      "review": "It was a fun movie with a good story, its only problems where there was some continuity errors like the pillars Change which one is broken and which ones aren't the entire fight at the history place. And also I didn't like wheel jacks design."
    },
    {
      "rating": "3/5",
      "review": "it's a film with a simple plot with super intuitive twists. The CGI is a little shaky in some scenes. The film would have been more enjoyable if it had lasted less as it features completely filler scenes"
    },
    {
      "rating": "0.5/5",
      "review": "This movie is so stupid, a waste of time. I don't understand why people rate this garbage so high"
    },
    {
      "rating": "3.5/5",
      "review": "The pop cultures to the movie brought back a lot of great memories to my childhood. Really enjoied the cast to the movie and the storyline."
    },
    {
      "rating": "3.5/5",
      "review": "Really damn good for what it is. Best transformers film in my opinion. It may be pretty formulaic and play it a bit safe, but there also many things that land with this film in bigger and better ways than weve seen, even if its similar. If you are interested because of the action, watch it; it goes hard."
    },
    {
      "rating": "1/5",
      "review": "Expected a lot and then got bored. This movie has a habit of repeating same action 10 times but in different places."
    },
    {
      "rating": "2/5",
      "review": "Ah. No. This movie really tried its hardest to combine the bay verse and the Bumblebee movie. It failed. The 2 were polar opposites. And the cg fights are so boring. That was the main reason anyone went to these things and they failed on that end. I see why some like it. I don't."
    },
    {
      "rating": "1.5/5",
      "review": "From the get-go wasn't that great.. lots of problem blaming and forced skewed social issues. Not something you want to see in a giant robot action movie."
    },
    {
      "rating": "0.5/5",
      "review": "The acting in this movie is terrible. Easily the worst transformer movie made."
    },
    {
      "rating": "3.5/5",
      "review": "Very Entertaining, and action packed, just don't pay attention to the continuity with the original films, because there is none. Maybe this and Bumblebee, which I also liked, are more of reboots of the franchise."
    },
    {
      "rating": "2.5/5",
      "review": "Rise of the Beasts tries to bridge the gap between Bumblebee and the Transformers movies prior, but it ends up feeling more like the prior movies compared to continuing where Bumblebee left the franchise off. Even though this was not a direct sequel to Bumblebee, I was hoping that they would take that's movies strengths and apply them to this movie, but sadly it feels like the only thing that got carried over was the Generation 1 paintjob and that is about it. But it is not from a lack of trying. You can see that they wanted to re-create what Charlie had with Bumblebee with Mirage and Noah, but the spark isn't there this time around. Mirage is more unlikable than Bumblebee due to his comedic attempts landing flat and all around irritating nature. Noah is forgettable from both a writing and performance standpoint compared to Charlie. Noah's lone wolf to team player narrative is also not as interesting to watch. Elana is also pretty forgettable and is only really there for the plot. The Maximals and the Terrocons are interesting enough additions to the mythology and do a serviceable job. The action is what you expect from one of these movies, however the third act seems way too over the top and has a few too many dumb ideas (Such as multiple death fake outs that become deus ex machinas). I am really not a fan of the proposed \"Hasbro Cinematic Universe\" teased during this final act and overall, it felt like it was losing steam as the film went along, throwing many ideas at the board and seeing what stuck. At 2 hours, it really started to drag towards the end. Overall, Transformers: Rise of the Beasts is a disappointment and I can only hope that the next entry is better."
    },
    {
      "rating": "3.5/5",
      "review": "Solid Transformers movie but unfortunately nothing really new."
    },
    {
      "rating": "0.5/5",
      "review": "Way worse than the first 5 transformers movies. Bring back Michael Bay. Characters were nowhere near as good as Sam Whitwicky or Cade Yaeger. Subpar movie."
    },
    {
      "rating": "2/5",
      "review": "The only reason I went to see it was because I had a theater subscription, and I'm glad I didn't spend money on it. Wasn't horrible, but I definitely wouldn't choose to watch it again."
    },
    {
      "rating": "5/5",
      "review": "Espero ver más de este nuevo comienzo de transformers"
    },
    {
      "rating": "4.5/5",
      "review": "VERY INTERESTING, ESPECIALLY SEEING ANIMAL-LIKE TRANSFORMERS."
    },
    {
      "rating": "5/5",
      "review": "First and foremost, this is a movie about giant robots from outer space who turn into cars; one must understand and accept this reality if they are to appreciate this masterpiece. Love this movie for what it is, an effing awesome good time that's packed with 400% more heart than it has any right to possess."
    },
    {
      "rating": "2.5/5",
      "review": "This started off poorly, with moronic stereotypes thrown in because the writers weren't capable of any character development. Once the movie progressed it got better, although it's never compelling or even interesting. It's a mildly fun movie, which is what the entire franchise is built on."
    },
    {
      "rating": "4.5/5",
      "review": "It was really good and better than I thought it would be. It combines a good plot line, the classic transformer look, and Michael Bay's action/explosions."
    },
    {
      "rating": "1.5/5",
      "review": "It's just dumb, there is nothing else to it. Though I will acknowledge the VFXs look descent and believable."
    },
    {
      "rating": "1.5/5",
      "review": "Terrible story line, cringe predictable copy and paste of the other transformer formats and yet somehow comes across cheap considering 15 years of cinematic development. Plenty of action I guess"
    },
    {
      "rating": "3/5",
      "review": "It was really cool seeing The Maximals and Unicron in a live-action Transformers film. It was better than the last couple Transformers movies (outside of Bumblebee, which was pretty good). The ending with business card made me cringe a bit, but other than that, I enjoyed the story. I would have liked Cheetor and Rhinox to have been given more personality and screen time."
    },
    {
      "rating": "5/5",
      "review": "It may be a bad movie but maybe sometimes there are 7 deleted scenes I hope the director can fix this"
    },
    {
      "rating": "0.5/5",
      "review": "Sadly there is nothing positive to say about this film. A complete disappointment across the board."
    },
    {
      "rating": "1.5/5",
      "review": "Just didn't work. I loved the idea of bringing in the Maximals, but the acting, plot and overall execution just dragged on. Felt like a C movie, not a blockbuster."
    },
    {
      "rating": "1.5/5",
      "review": "Felt like they couldn't make up their mind - a film for kids under 10 or adults who could enjoy the 80's setting. In the end - it was just a mess of both; from the terrible dialogue to the dull and monotonous action."
    },
    {
      "rating": "0.5/5",
      "review": "What a disapointment.... watched every single movie and never have i been this bored... no buildup, no climax... cant believe they did this to such an iconic franchise... very very BAD!!"
    },
    {
      "rating": "2/5",
      "review": "I want my time back."
    },
    {
      "rating": "4/5",
      "review": "Movie was pretty fun, love the ending however few things and felt pointless in this movie. There is a lot room. For. Improvement in the sequel. Hoping transformers One 2024 fix all the issue."
    },
    {
      "rating": "2.5/5",
      "review": "I've enjoyed the previous Transformers movies, love a robot ‘y know! However this one left me rather wanting. The CGI is no longer astonishing, in fact it felt very cartoony, the whole thing was like watching kids TV, not a movie. The voice acting saves it to a degree, but even the dialogue felt weak and not as sharp and snappy as previous ones in the franchise. I didn't really care what happened to the human actors either. I did watch till the end, but could easily have given up and done something more interesting like knitting the heel of a sock."
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this reboot even tho when it was announced I slated it thinking another reboot but best one yet and the link to g.i.joe I like"
    },
    {
      "rating": "5/5",
      "review": "For a movie about toy robots from space it was waaay better than it had to be. The human characters were compelling, relatable, and _relevant to the plot_. Action sequences were so rad. One scene in particular is the slickest sickest shot I have ever seen in an action adventure move."
    },
    {
      "rating": "1/5",
      "review": "I'm sure this was written by a 6-year-old."
    },
    {
      "rating": "0.5/5",
      "review": "Boring. The characters are inane and predictable."
    },
    {
      "rating": "3/5",
      "review": "Em 1994, uma estagiária de um museu descobre uma estranha chave alienígena que chama a atenção dos Autobots, que desejam usá-la para retornar para o seu planeta natal, e os Terrorcons, um grupo de transformers liderado por Scourge que querem abrir um portal para uma entidade chamada Unicron, cujo o único desejo é se alimentar de planetas. No meio disso, surgem os Maximals, transformers que adotaram a forma de animais. Este filme é uma sequência de Bubblebee que deu um restart na franquia, depois que ela se perdeu em efeitos especiais e histórias sem pé nem cabeça. O filme tem muitos acertos. Primeiro, diminuiu o número de personagens humanos, ficando praticamente reduzidos a Noah, um jovem ladrão que cai de para-quedas na história, e Elena, a responsável pela descoberta da chave. Esta obsessão de colocar personagens humanos nafranquia dos Trasnformers, acabavam por tornar os robôs em coadjuvantes da sua própria história. Aqui, eles assumem o protagonismo. Outro ponto positivo é o CGI, são muito bons, a transformação dos robôs em carro e vice-versa são mais claros e vemos para onde vai cada parte do carro. Com isso, as sequências de ação tornaram-se claras, com poucas edições, tornando claro e compreensível toda a tomada. Porém, com todas essas melhoras, ainda há alguns pontos negativos, como a toda hora o roteiro ter que achar uma desculpa para colocar os personagens humanos na ação. Ou mesmo a quantidade de robôs usados. Enquanto o grupo do Optimus Prime, praticamente, todos os personagens tem sua personalidade desenvolvida, no caso dos Maximals, tirando o Optimus Primal e a Airazor, os outros integrantes não disseram para o que vieram. A mesma coisa pode se aplicar à equipe dos vilões. Apenas Scourge tem um certo desenvolvimento, os outros são mais capangas com algumas frases. Apesar do roteiro acertar em alguns detalhes, ele peca em não causar medo ou preocupação da ameaça de Unicron para os espectadores. No final, é um filme que perde em comparação com Bubblebee, mas é muito melhor em comparação com a série anterior. Quem sabe no próximo filme, eles retirem de vez os humanos como participantes da história, deixando apenas os robôs como os únicos personagens."
    },
    {
      "rating": "1/5",
      "review": "I can’t rate a movie that high that I lose interest in early on, and feel like the music doesn’t match the scenes, the movie lacks any realistic audience’s buy-ins, and is just feels like everything stupid was thrown at the screen to see what sticks. I recommend watching it drunk or listing to the music you bring yourself and turning the movie audio off all together."
    },
    {
      "rating": "0.5/5",
      "review": "YOU KNOW HOW BAD THIS FILM IS IF U WANT A DEATH WISH WATCH THIS FILM ITS SO BAD THE CGI IS BAD EVERYTHING IS BAD IF I COULD I WOULD GIVE IT NEGATIVE 5 STARS!"
    },
    {
      "rating": "0.5/5",
      "review": "I love Transformers but this movie was terrible. Without a doubt, the worst of the franchise. I’m shocked other people like it. The acting was terrible and the story line was boring. It didn’t tie into the other movies at all and Mirage was annoying. It’s not worth watching again."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie,I enjoyed it"
    },
    {
      "rating": "3.5/5",
      "review": "Though the Rise of the Beasts is a light hearted comedy about shape shifting robots it's equipped with mesmerizing visual effects. Even with unfitting dialogues and a disjointedness in action sequences it gets negated cause of the bits such as the electrifying rebirth of the beloved bee. Excellent performances by the whole cast. Witty lighthearted dialogues was a major success of the movie. Great music that sets the mood in each part of the story. Story apart from robots lacked newness. Action sequences though were magical enough even out any gaps or holes in plot. One of the most anticipated and a well made action movie of twenty three."
    },
    {
      "rating": "2/5",
      "review": "This is a movie to just zone out on; something to have on while you are doing other things. Unfortunately, there is bad acting, uninteresting character development, and stereotypical racial tropes for the Autobots voice actors."
    },
    {
      "rating": "1/5",
      "review": "Great movie but I did not like how the movie influences POC to steal."
    },
    {
      "rating": "2.5/5",
      "review": "Poor acting, cheesy lines and the humans are no longer necessary for the storyline."
    },
    {
      "rating": "5/5",
      "review": "Defiantly leaning towards the right direction."
    },
    {
      "rating": "2/5",
      "review": "It felt like a 'made for TV' version of its predecessors. It's something to have on in the background while doing something else."
    },
    {
      "rating": "3/5",
      "review": "Só não gostei das personagens humanos, de resto, diverti-me bastante bem..."
    },
    {
      "rating": "4.5/5",
      "review": "it was good i liked the movie"
    },
    {
      "rating": "2.5/5",
      "review": "4/10 I could not get passed the voice actor of Mirage. Cringed every time. The \"blank faced\" emotions and flat delivery of the dialogue of the two human leads was unwatchable for me as well. The emotional build up at the end saved it a little and elevated my grade."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Plenty of action to keep you on the edge of my seat. And the set up for a spin off or trilogy 🤌🏼"
    },
    {
      "rating": "4/5",
      "review": "a family friendly classic"
    },
    {
      "rating": "4/5",
      "review": "It is better than the Bayverse but Bumblebee is better."
    },
    {
      "rating": "0.5/5",
      "review": "Worst movie in series, walmart version. Horrible acting and bad cgi!"
    },
    {
      "rating": "2/5",
      "review": "4/10 - It was a film. Probably not a good use of my time to watch it. I don't think I've seen a Transformers live action film yet worth my time honestly. I think Bumblebee might have been better than this, but I don't intend to watch it again to find out because I didn't think it was all that good either. I could have just watched the awesome 80s animated film again. I think in some ways, Beast Wars the tv show has aged better than this film ever will. I'm not really sure why they included so many characters that I remember only to either change their personalities completely (wheeljack, mirage) or reduce them to almost entirely non-speaking parts (cheetor, rhinox). So much of the plot focuses on the humans for some reason, but they just aren't at all interesting. The acting is fine, but if you have no script to work with there's only so much you can do. There were explosions and action, but it all felt very CGI-hollow to me. There was… pretty much no explanation of who the Maximals were unless I missed it other than \"we're from you're future and you're past\" well okay, I'm not sure who you talking to… not enough for fans and not enough for people who don't know what the heck you're on about. How the ever living hell does this have such a high audience rating? This is honestly just as bad as many of the DC super hero films that get (rightfully) slammed and far worse than some of those. I felt this was way worse than the panned Flash movie. Oh well. This is the kind of film that might be good to have on in the background while you do something like clean your room. But even then, there's gotta be something better right?"
    },
    {
      "rating": "1/5",
      "review": "Worst transformers movie ever!!!!"
    },
    {
      "rating": "1/5",
      "review": "Confusing, bad acting, lacked the potential of all transformer characters' development especially the most significant part of being a transformer which is TRANSFORMING. Felt bad how they portrayed the two Primes, such a shame how they depicted them and gave them screen time. Pete Davidson voicing Mirage was somewhat below mediocrity and fatigue from his acting career/history. Not a lot appreciation on Peter Cullens voice and character capacity. Commending Ron Perlman helping out Optimus Primal"
    },
    {
      "rating": "5/5",
      "review": "It's The Transformers. You really can't go wrong. More please!"
    },
    {
      "rating": "1.5/5",
      "review": "Good action at the first but it gets boring toward in the middle. Director has no common sense. At the end it more like watching a video game."
    },
    {
      "rating": "4/5",
      "review": "Recently watched this newest Transformers film (reboot?) and it was pretty good overall. The Transformers movies in general are as silly as stories can get, but the effects, action and acting will entertain you, for sure. The spectacular scenes near the end of Rise of the Beasts are pretty epic and well done, so to me, this seems like another solid addition to the Transformers universe. And a side note, all of these movies are fantastic on the big screen with booming surround sound."
    },
    {
      "rating": "1/5",
      "review": "As soon as the film starts, \"make sure to laugh at all their jokes—white people love that sh**.\" And just like that, it was turned off. So edgy."
    },
    {
      "rating": "1/5",
      "review": "General story and writing are on par for the Transformers series (meaning aimed at 10-16 year olds). SFX are descent. I could really do without the social narratives: complete with jabs at \"white people\" and capitalism, and how our lack of universal healthcare means poor people don't get help (which is hoarse crud; film portrays a medical institution turning away a sick child since they're \"3 months behind on payments\", I know of no major US hospitals who turn away people. Zero! You're thinking of Canada)."
    },
    {
      "rating": "4/5",
      "review": "it would be better if mark wahlburg was the main character"
    },
    {
      "rating": "0.5/5",
      "review": "Oof, this is bad. The acting and voiceovers were fine with what the actors were asked to work with. Like most movies these days, the story was just recycled, and this one suffered from bad attempts at humor too. The CGI in this one made the characters look weird, Optimus Prime was probably the worst looking. I guess the one positive is probably a decent soundtrack, if you liked 90's hip-hop."
    },
    {
      "rating": "0.5/5",
      "review": "By far the worst of the franchise."
    },
    {
      "rating": "5/5",
      "review": "This movie does an amazing job making the Transformers humanistic much like the original cartoon did. It make the transformers the stars and shows their struggle to fit into human society and Optimus struggle to relate to humans demonstrates it. The more times I watch it, the more it's my favorite transformers movie! Keep making movies like this, love the GI Joe reference, can't wait for a sequel. Thank you Hasbro."
    },
    {
      "rating": "0.5/5",
      "review": "Being a transformers fan since childhood, this movie was a huge disappointment. The two main characters were completely disconnected from acting and came across as cheezy. The cgi was terrible, and storyline and plot was simply bad. This movie wasn't worth it at all"
    },
    {
      "rating": "3.5/5",
      "review": "Ok cgi. Story is the exact same as the first one. Plot is followable and actually made sense. A welcome change from 2-6. Worth a free prime watch before they start forcing ads ."
    },
    {
      "rating": "5/5",
      "review": "Very emotional and amazing movie, and ending was awesome!"
    },
    {
      "rating": "5/5",
      "review": "This movie is a real joyride! Way better than all the previous Transformers Movies, the drama and characters were incredible relatable. The plot is unique as it explores a time and aspect of Optimus Prime that we have never seen before. This is a future classic and the cliffhanger ending… I do dream for it to come true!"
    },
    {
      "rating": "3.5/5",
      "review": "I liked the style of this one and thank God Mark Wahlberg wasn't present."
    },
    {
      "rating": "2/5",
      "review": "I couldn't sit and listen to nonsense. \"Are you a possessed car or something? No that's not real, I'm an alien\"."
    },
    {
      "rating": "3/5",
      "review": "I found the movie very predictable, as the last few movies are similar to this one, yes they have a new cast and a different story, the problem was you could tell what would happen if you have watched the last few movies but the story is different from the rest but it feels almosts like the other movies we all have different opinions"
    },
    {
      "rating": "5/5",
      "review": "Great non-stop action. Enjoyable for all ages. Restart from Micheal bay versions , like where the series is heading. Must see for the whole family"
    },
    {
      "rating": "3/5",
      "review": "Although it did have way better visuals then its predecessor, it lacked a good story and the action at times could be boring. Some scenes were still fun like the old transformers I know. In my opinion the Micheal Bay versions were better."
    },
    {
      "rating": "0.5/5",
      "review": "You call this transformers. Script was awful. would never watch again"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible in every way …storyline acting you name it … terrible"
    },
    {
      "rating": "2/5",
      "review": "Feels a bit rushed, un-interesting main characters with no background. Few laughs here and there. The massive Unicron was bypassed, could've been used a lot more. Bumblebee remains still easily the best Transformers movie."
    },
    {
      "rating": "5/5",
      "review": "I enjoyed this movie so much but strictly for the Autobots and Maximals. The voice actors were amazing. Just when I thought Bumblebee, my favorite, was going to steal the show, Maximus Prime says, “Not so fast!”"
    },
    {
      "rating": "3.5/5",
      "review": "Filme: Transformers O Despertar das Feras @transformersofficial @transformersmovie Assistido: 24-8-23 Elenco: @anthonyramosofficial @domfishback Modelo: #ficção #fiction #ação #action Duração: 2h 07m Ano: 2023 Minha opinião: Este filme se passa em 1994, antes do acontecimento do 1º filme que é luta contra os Deceptcons. Aqui como terráqueo amigo dos Autobots temos Anthony Ramos e Dominique, antes tivemos Shia LaBeouf e Megan que estiveram o 1º, 2º e 3º mas aqui sai Megan e entra Rosie (aqui foi uma das grandes mancadas de Megan na sua carreira) e depois temos Mark Wahlberg 4º, 5º em Bumblebee temos Hailee Steinfeld 6º. Grandes nomes e agora temos o menos conhecido Ramos e Dom trazendo um latino e uma afro. A grande novidade aqui são os animais Maximals que para trazer um diferencial com os Dinossauros. Oque virá no prossimo? Animais aquáticos ou Kaiju ou os Jiggers (Círculo de Fogo) ou Godzilla ou King Kong. Hoje em dia nada é impossível. Pois já tivemos Alien e Predador, Jason e Fredy,... qual a maior aposta? Mas aqui mais uma vez a Terra esta a ponto de ser destruída por um devorador de mundos. Que precisa de um artefato que os Maximals esconderam anos atrás. Mas que agora a ameaça esta de volta. E teremos Optimos Prime e toda a sua equipe mais MAximals para lutar e salvar a Terra. O ar de comico continua sendo uma de suas marcas com aquelas piadas forçadas. Os efeito são bons como em toda série, trazendo um realismo na ficção. Roteiro e enredo a receita é a mesma, com caras diferentes. Uma franquia que já tem 16 anos com 7 filmes, já esta atingindo novos fãs. Vale apena assistir? Sim, talvez para aquele que já assistiu as anteriores, diga já vi. Nota: 7"
    },
    {
      "rating": "3.5/5",
      "review": "We really enjoyed this one way more than the last couple of outings. Having it follow on from the joyful Bumblebee (seems a few folks missed that it was following that, not the previous films) made so much more sense, and yet again this feels more like a film made by someone who actually likes Transformers rather than someone who wants robots for their action movie. Anthony Ramos Jnr, is great as always."
    },
    {
      "rating": "2.5/5",
      "review": "Super generic and the humans were forced. The action was pretty good though."
    },
    {
      "rating": "1/5",
      "review": "What a waste of good material. Please make this a bad transformers dream in a different canon"
    },
    {
      "rating": "0.5/5",
      "review": "It is a terrible movie. The actors can't act, and everything was predictable."
    },
    {
      "rating": "5/5",
      "review": "best transformers movie ever"
    },
    {
      "rating": "0.5/5",
      "review": "It just doesn't sit well with me. yes it's an okay movie but it doesn't hold to the story from the original 5 movies. To many different turns why go back in time? And the end of the last knight they said unicron was earth so why did that also change? And GI Joe? Really?"
    },
    {
      "rating": "5/5",
      "review": "Transformers: Rise of the Beast is undeniably a great movie that deserves recognition. The film showcases stunning visual effects, intense action sequences, and a captivating storyline that kept me on the edge of my seat. These actors have already established strong connections with their characters, so please return them to fans and me who have grown attached to them. By reuniting these talented individuals, Transformers: Rise of the Beast has the potential to become an even greater success and reignite the franchise's magic once again."
    },
    {
      "rating": "5/5",
      "review": "This cgi in this movie is awesome, not as good as the 2007 movie, but it's still good, we see the bots a lot more in this movie and they feel like actually characters, and the human characters in this movie for once are not annoying, more transformers, Jurassic world, and godzilla movies need characters like these."
    },
    {
      "rating": "4/5",
      "review": "This is a great installment to the Transformers series. I enjoyed it! Straight up entertainment!"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible, simply terrible"
    },
    {
      "rating": "5/5",
      "review": "A nice comeback for the movie. Been loving transformers since the first movie and it still hits the same"
    },
    {
      "rating": "5/5",
      "review": "My name is optimas prime"
    },
    {
      "rating": "5/5",
      "review": "Grew up on Transformers (#80sBaby) but completely gave up on the franchise after the first installment. Michael Bay has a place film, but his interpretation of the TF IP was wildly over the top with storylines that focused on the wrong thing - the humans. TF I knew and loved wasn't about an unnecessary love story/interest/drama/triangle or father/daughter rescue storyline...it was about, erhm, the friggin TRANSFORMERS!! I stayed away from any/all installments from then on (including Bumblebee, which I've since rectified). Once I heard they were releasing a new TF movie in 2023 I groaned, but then I heard the name...could it be they finally introducing the Maximals!? I'd loved the show Beasts Wars when it was on, at the point of even being ridiculed by friends, so this was big. But also potentially yet another disaster. My disappointment from the Bay-era kept me from seeing Beasts while in theaters, but a fateful visit to my mom's house, courisority and a lazy afternoon led to a digital rental viewing experience. My expectations? Beyond low. My skepticism? Major. My momma? Ecstatic (shes loved every TF movie since 2007). Within the OPENING SCENE, I was already hopeful. It was them. The Maximals. Optiumus Primal. Wow. The special effects, voices. Everything, it was there (welp, except Rattrap) It only got better from the title screen - being set in the 90s allowed for a great prequel storyline (+epic music choices) and the ability to try and mend the pain of the overly-everything Bay-era. Probably would've made a few minor tweaks, but I legit laughed out loud mutilple times, arms-in-air cheered more than once and even teared up a few times. This movie gave me everything I didn't know I wanted or needed, and than gave me more with not 1 but 2 end credit scenes! To say I enjoyed it would be an understatement and ended up purchasing it once the rental expired. This movie was so good, I ended up watching the entire franchise (all for the first time except the 2007 OG) which 1000% confirmed my belief the Bay-era was horrendous and franchise deserve better. Bumblebee started it, Beasts continued it and I am now excited and hopefully to see where it goes from here. Side note - This whole review might sound dramatic, but please believe I'm very serious, lol. If you've made it to the end, thanks for reading"
    },
    {
      "rating": "4.5/5",
      "review": "Don't care transformers rise of the beast is one of the best movies of 2023"
    },
    {
      "rating": "1.5/5",
      "review": "Worst transformers movie ever (and there have been some bad ones in the past). The acting, horrible. The graphics, horrible. Optimus Prime is a wimp..? Couldn't get through the first 30 minutes before I had to turn it off."
    },
    {
      "rating": "4/5",
      "review": "Explosive and enjoyable"
    },
    {
      "rating": "3.5/5",
      "review": "Maybe not as original as some of the earlier movies it's still got heart and energy."
    },
    {
      "rating": "3.5/5",
      "review": "Steven caple jr probably made one of the best tf movie along the bumblebee movie and transformer 2007, but honestly i was especting a lot more characterization on the transformers, and more uses for the terrorcons like battletrap and nightbird and for the maximals, but knowing how much they cutted from this movie, i hope to see those contents on the sequel along a better production from the director, and plz for god, take a new good writer who works along steven to write a better new story with a proper new style for this reboot, instead of trying to keep the bay legacy from the first five movies. Overall, a absolute banger to see, and the best thing, its really light as a movie"
    },
    {
      "rating": "5/5",
      "review": "Was disappointed initially as was hoping for this to have purely Beasts in it like in Beast Wars, and not having Rattrap in was a big bummer. Was convinced \"Mirage\" would introduce himself as \"Rattrap\", but... it is probably the best Transformers movie released to date. Hoping for more Beasts in the future. And.. Rattrap :)"
    },
    {
      "rating": "5/5",
      "review": "Best transformers movie, full stop!"
    },
    {
      "rating": "3/5",
      "review": "It's a transformer movie. lmao."
    },
    {
      "rating": "5/5",
      "review": "Fantastic film, great storyline, the characters were believable and the action scenes had as all on the edge of our seats. Although not for the little ones, ours watched it and loved it too! The critics are way too harsh, as this is the best one by far!"
    },
    {
      "rating": "1/5",
      "review": "I thought it was a parody… could not believe the movie can be so bad"
    },
    {
      "rating": "4/5",
      "review": "Out of all the transformers movies this one most felt like the cartoon. I'm shocked that there is such a low credit score. This show had heart, comedy, action, and a decent plot to keep everything together. I thought the pacing was good, but overall I would have to sum this movie up in one word and that would be FUN. Not every movie has to be an Oscar worthy film. But this is the type of movie to get the family together for a good time over a bucket of popcorn."
    },
    {
      "rating": "5/5",
      "review": "Love these movies. Never gets old."
    },
    {
      "rating": "1.5/5",
      "review": "There are like dozens of writers and producers involved in this project and result is...I can't come up with the right word to express my disappointment."
    },
    {
      "rating": "4/5",
      "review": "It wasn't polished but yet the film has a ton of shining moments. The human characters blend in perfectly with the Transformers themselves and you enjoy the time spent on both. No more clumsy tumbling sloppy robots rolling around on the ground. No these transformers are very authentic and are way closer to the source material. I didn't think they could outdo the Bumble Bee spin off but it seems like they did? I don't like Rock or Rap music playing during action scenes in a movie, I like actual scores so the music placement could have been better. However theres not much for me to hate with this one. It's well worth the $5.99 to rent or buy ."
    },
    {
      "rating": "2/5",
      "review": "Watched this with my 7-year-old nephew. It is a typical Transformer movie with not many twists in the story. I found it interesting as I watched my little nephew jump at certain points in the movie, and thought about how desensitized I am when it comes to action movies providing me those jump-out-of-your-seat moments. I thought the dialogue was practically non-existent and the setup to the conflict was very weak. I give it two stars because, in the moment, I was interested in watching it."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie I 100% recommend seeing this I also liked the cameo of G.I Joe in the movie. It proved that they were both Jin the same universe I also enjoyed the duo Noah and Mirage because it showed the bond and friendship growing between the two. I also really loved the Maximals in the movie. But overall I enjoyed the whole movie, I hope for more future projects like rise of the beasts in the Transformers universe."
    },
    {
      "rating": "5/5",
      "review": "This movie made me go wow I though we were not get any transfomer movies but I did not expected to continue after bumblebee movie but okay I will go with it because I love redo movies that are better than the orignal but this takes the cake I love how it focus more on the transfomer part than the human part and I like how scourage has been working with unicron and the return of the michel bay autobot arrival music"
    },
    {
      "rating": "5/5",
      "review": "Una película con una buen ritmo en la trama y con muchas referencias para los fans de los Transformers clásicos 1000% recomendable para ver."
    },
    {
      "rating": "5/5",
      "review": "a fun watch, takes all the fun elements of transformers and cranks it to 100. I love it ."
    },
    {
      "rating": "0.5/5",
      "review": "Definitely the most forgettable Transformers movie. You can clearly see an amateur director was in charge of this movie, pushing his own interests into the movie trying to make it \"hip\". Terrible acting, poor storytelling, bad character development and little to no background. This movie would have been perfect if there were zero humans involved. The voice actors did all the work and made the movie worth watching while half asleep. You cannot even remotely compare this movie to the absolute classic first transformers movie directed by legend Michael Bay. This is just another movie that proves there are no decent producers and directors left."
    },
    {
      "rating": "3/5",
      "review": "The movie was too quick and to the point. Not a lot of deaths for this to feel like a major important movie."
    },
    {
      "rating": "0.5/5",
      "review": "It's time to put this franchise to bed, poor script, poor acting. Even the cgi was not upto the previous films. Sorry, this is a no go for me..."
    },
    {
      "rating": "1/5",
      "review": "Comparing to the past transformers franchise, this is the worst ever... I really expected more to do with the future. The troublesome part is how they made Optimus prime look like a cartoon.... Please get the old film crew back"
    },
    {
      "rating": "4.5/5",
      "review": "Film yang bagus dengan drama yang cukup.... Rating : 9/10 Almost Perfect Follow my Instagram : @yudhasatria955"
    },
    {
      "rating": "2/5",
      "review": "There's some cool parts to this movie but all in all a lot of money was spent to create pure stupidity."
    },
    {
      "rating": "2/5",
      "review": "Another transformers movie where the humans are the worst part and if they just focussed on the transformers in an hour and 30 minute run time you will get a much better film."
    },
    {
      "rating": "0.5/5",
      "review": "easily the worst movie ever made"
    },
    {
      "rating": "1.5/5",
      "review": "Cool action and visuals but a terrible story line. In Last Knight, earth was called unicron, now in this movie it is its own planet? Main characters are poor, and predictable. Nonsensical scenes. Really nothing like the first 2."
    },
    {
      "rating": "4/5",
      "review": "I understand that most people might be getting tired of the Transformers franchise, but I am not one of them. I think this does a great job of taking what worked in Bumblebee and only adding to that formula that makes this movie worth watching. I hope that this franchise continues as I am curious to see where it goes next."
    },
    {
      "rating": "3.5/5",
      "review": "I loves the movie, but there were a few things that brought it down a bit for me, especially with plot inconsistency. The CGI and look of the movie was incredible, though, and most of the movie was great! Again, definitely recommend people to check it out!!!"
    },
    {
      "rating": "5/5",
      "review": "Surprised the hell out of me. Excellent movie. From all the New York references at the beginning to the end. Not your typical transformer movie. Can't wait for the next one."
    },
    {
      "rating": "0.5/5",
      "review": "Riddled with unnecessary gimmicks, an inconsistent script and storyline, and uninterestic characters. I can't believe I'm saying this, but even Michael Bay's version was better than this."
    },
    {
      "rating": "4.5/5",
      "review": "I liked it a ton. I loved the story telling, the designs of the transformers were great. It felt a little short for me, so I wish it was a little longer."
    },
    {
      "rating": "0.5/5",
      "review": "Watched all the movies so far with my family and enjoyed them. None of us could watch this - not my wife my kids or myself. Was just plain terrible."
    },
    {
      "rating": "2.5/5",
      "review": "It was OK, the human caractorw where out of place."
    },
    {
      "rating": "3/5",
      "review": "Series lost its spark. Characters were pretty bland and predictable."
    },
    {
      "rating": "2.5/5",
      "review": "It wasn't as good as any of the previous Transformers. This movie could have been a lot better. It felt like a budget movie."
    },
    {
      "rating": "5/5",
      "review": "I am a big transformers fan and I really liked this movie. The integration of Beast Wars lore with Transformers 1984 was great. This is all inferred: it is not stated directly but you have a ‘young' Optimus Prime desperately trying to get back to Cybertron coupled with the Beast Wars bots from the future sent by an ‘old' Optimus Prime to save earth and it's huge energon stores. Obvs these to objectives are mutually exclusive but the ‘wisdom' of the Beast Wars bots let's Optimus figure this out himself. The human story is actually pretty good with the two main characters developed enough despite minuscule exposition amongst all the transformers biz. Out of all the Transformers movie this is the closest to G1 cartoon series and 1984 Movie."
    },
    {
      "rating": "0.5/5",
      "review": "There is no way possible this movie got a 91% audience score. This movie is beyond terrible. Why does it seem that whomever is making these films are purposely going out of their way to ignore all the source material? Go out of their way to change the design, and personalities of every Transformer? In some cases completely change the alt mode from one character to another. Why did Mirage have Jazz's alt mode? What they did to Wheeljack in this film, was inexcusable. I cannot think of any valid reason for them to do what they did to him. Especially after seeing how he could have looked from the Cybertron scene in Bumblebee. They have to know that everyone wants a movie, like what we saw in the first 10 minutes of Bumblebee. Why do they just refuse to do this? We want a G1 inspired franchise. They could create a whole universe from this source material. 1st movie, work on the origins of Prime and Megatron. Tell the story of why Megatron became the way he did. Then move on to the war of cybertron and then end that movie with them crashing on Earth a million year ago. 2nd movie. Start where the last ended, but in current times. They have been in stasis this whole time, but are awaken and repaired with alt modes from their surroundings (also don't allow them to just change their alt mode whenever it's convenient, what they have is what they get.) 3rd movie. This is where we could maybe introduce Unicron, basically this could be a modern retelling of the 84 movie. But don't introduce all the G2ish characters, don't need to see Blur. But Optimus really does die in this one, doesn't come back. Megatron is reformatted into Galvatron. Everyone they introduce needs character development or don't have them in the film. This could even be a 2 part film, to allow them time to develop and tell the story. 4th movie. A true Beast wars movie, starts off in the way distant future. They can explain how the Autobots and Decepticons are extinct and the maximals and predicons are the decendants. BW Megatron has always had greater ambitions and then learns about the golden disk with the message from Megatron. Basically now, a movie similar to the original BW show. This can all be done, and would at the same time build a universe of connected movies. But instead, we get the exact same film over and over and over (with apparently no connection to the movies that came out before it). New unneeded human characters find artifact. Meet random transformer, hunt for other artifacts. Human saves day. We are so tired of this garbage. Why they refuse to give us the movies we want is baffling."
    },
    {
      "rating": "1/5",
      "review": "Worst movie of the series yet didn't know they could make it this bad"
    },
    {
      "rating": "3/5",
      "review": "Another cookie cutter transformer's movie that lacked substance. I felt the general theme, but thought the family dynamic could have been explored further. One of the things executed nicely was the action scenes. There were cool and picturesque battle scenes, and they didn't drag on too long either. Definitely not like \"Bayformers\", but a nice change of pace. Therefore, it ended up being an entertaining film to watch, and I would recommend it to anyone."
    },
    {
      "rating": "0.5/5",
      "review": "I'm a huge Transformers fan, but this was a horrible movie. Flat, formulaic, and stale. Just very bad. I wish this wasn't the case, but I have to be honest."
    },
    {
      "rating": "4.5/5",
      "review": "It was a pretty good movie, the intro was kinda mid, but overall good movie, loved the action, loved the characters, loved the story too, the ending was almost perfect, but there are better transformer movies 8.5/10"
    },
    {
      "rating": "4/5",
      "review": "My kids and loved it. Wife screamed at all the \"scary\" parts. Looking forward to the gi joe crossover. The only complaint really for me is they did not explain unicorm from the last transformer movie"
    },
    {
      "rating": "5/5",
      "review": "La mejor de todas 10/10"
    },
    {
      "rating": "3.5/5",
      "review": "This is my first Transformers movie. So, it probably didn't impact as much as it did to fans of the franchise. Though, the movie was full of action, and fun."
    },
    {
      "rating": "1/5",
      "review": "It was remarkable just how unlikeable the human characters were. Both immortal dishonest crooks that we are supposed to care about and root for? It's a bad movie when you're rooting for the villains to destroy the main characters. Then of course this doesn't fit in with any previous transformers movie. Unicon WAS earth last movie? What happened to that? Bumblebee dies. No effect as every other movie is after this so it was already like, he can't be so what?"
    },
    {
      "rating": "4/5",
      "review": "Transformers is coming back baby."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie I can highly recommend it"
    },
    {
      "rating": "4/5",
      "review": "Pretty damn good really liked it"
    },
    {
      "rating": "4.5/5",
      "review": "I think that this movie was amazing, I only give it a 4.5 star because I did not really like how the charterers were not original. I liked the movies energy and story and definitely think you should watch it if you have not already."
    },
    {
      "rating": "2.5/5",
      "review": "Again, Transformers is struggling to involve human characters in its storylines. Maybe it's time to move away from humans and focus on the transformers (since they are in the title). But, for what it is, Rise of the beasts does have it's share of moments and effects."
    },
    {
      "rating": "5/5",
      "review": "This movie is better than most of the Bay films character-wise. The designs are definitely better for the most parts."
    },
    {
      "rating": "3.5/5",
      "review": "It was really good! Some flaws right then and there, but the movie exceeds my expectation and made me entertained throughout. So yeah, you should watch it."
    },
    {
      "rating": "5/5",
      "review": "ess una muy buena pelicula la mejor que e visto pero para las personas que hablan de transfomers 2007 deben saber que EL UNIVERSO DE TRANSFOMERS SE REINICIO CON BUMBUBLEE"
    },
    {
      "rating": "4/5",
      "review": "El cga es muy bueno y, la historia convence. Aunque debo reconocer que soy muy fan de Optimus Prime y el solo hecho de ver a mi héroe ya me lleva a disfrutar de Transformers."
    },
    {
      "rating": "4.5/5",
      "review": "This has blessed me as a Transformers fan."
    },
    {
      "rating": "0.5/5",
      "review": "Doesnt make sense in the storyline. The first movie you see autobots arrive on earth, but now theyve been here for ages. Bumblebee \"dies\" which has no significance because we see him years later with Sam. Unicron was earth in the last one, but not anymore? 0/10 for not even following their own storyline!"
    },
    {
      "rating": "3.5/5",
      "review": "It's a good movie compared to a few others in the franchise but the problem with a prequel is you know certain characters survive and it brings up more questions that can't really be answered but if you can get past that it's a fun robot V robot movie with a lot of action"
    },
    {
      "rating": "4/5",
      "review": "Anthony Ramos acts well and the beasts component at least gives a storyline regarding the world being in trouble that's not a duplicate of previous Transformers films."
    },
    {
      "rating": "5/5",
      "review": "Great Movie!!! Highly Recommended!!! A++ 🍿🎥🍿"
    },
    {
      "rating": "5/5",
      "review": "This Is By Far The Best Movie I Ever Seen Watched it Many Times Watched Many Scenes Of it and God Its So Superior Compare to All other 2023 Films So It Didnt Deserve That Low Box Office But Hey People Be Woke and Wokin So Yea The Winner For the Best 2023 is Transformers; Rise Of The Beasts Eat Shit Haters Especially You Movie Reviewers on Youtube Who Sucked at Thier Jobs"
    },
    {
      "rating": "3/5",
      "review": "The acting did suck and I felt the movie was holding something back!"
    },
    {
      "rating": "5/5",
      "review": "One of the best Transformers videos :)"
    },
    {
      "rating": "5/5",
      "review": "Hatte mich sehr auf diesen Action Reißer gefreut und bin nicht enttäuscht worden. Hochgradige Spannung bis zum Schluss. Die Darsteller und die Handlung waren top gewählt. Kann ich auf jeden Fall weiter empfehlen. 👍👍👍"
    },
    {
      "rating": "5/5",
      "review": "Wonderful Movie. Brought me so much joy to watch and experience."
    },
    {
      "rating": "5/5",
      "review": "This movie is fun, sad,and with heart overall there's good action and some good visuals the characters feel fresh. The only critique I have is not enough character for the maximals this is a must whatch 10/10"
    },
    {
      "rating": "2/5",
      "review": "Anyone giving this movie 5 stars , or even 4 stars, should have their rights to review movies removed. The acting in this movie was horrible....HORRIBLE! Especially the interactions between Ramos and his younger brother. This movie introduced the maximals, which were incredible, but it did a terrible job at fleshing our their character. From what I gathered, this appeared to be a prequel to all the prior films released? At least it seemed that way. The G.I. Joe cameo at the end too made no sense and had no place in this movie. Plus with Ramos' acting as bad as it was, there's no way I would pay money to watch him play G.I. Joe. Watch this movie is you have nothing better to do with your time, but you might wanna pregame first so you might actually laugh at its lame attempt at humor."
    },
    {
      "rating": "2.5/5",
      "review": "This movie was just fine. There was no vision in direction. Felt like a watered down version of the Bay films."
    },
    {
      "rating": "3.5/5",
      "review": "\"Definitely one of the better installments in the franchise. I really enjoyed the main characters story arc. Where he started and where he ended up. The writer's did a fantastic job at raising the stakes and everything full circle.\""
    },
    {
      "rating": "1/5",
      "review": "Same exact reason that last Matrix movie sucked\" they tried way too hard and added animal transformers? It felt like their target audience was 12 year Olds. They clearly strayed from the formula that brought them the success in the first place. Sorry I bought it before actually seeing it. Waste of my money!"
    },
    {
      "rating": "3.5/5",
      "review": "Better than Michael Bay's films. The human subplots were actually investing and the Transformers got a satisfying amount of attention compared to the latter. It was on the shorter end of the franchise, however, which is why it only gets a 3.5/5 stars."
    },
    {
      "rating": "5/5",
      "review": "It is a good movie but I do not recommend kids under 7 are able to wach this but it is still a good movie!"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible actors. They picked the actors based off skin tone rather than acting skills so they could fit the agenda of black washing everything"
    },
    {
      "rating": "5/5",
      "review": "transform and roll out!"
    },
    {
      "rating": "3.5/5",
      "review": "Praticamente tudo sobre isso está fundamentalmente ok. Esta é basicamente uma releitura do primeiro com alguns elementos das sequências misturados para completar. A trilha sonora de rap misturada com cinematográfica é uma escolha meio estranha e é um sucesso ou um fracasso."
    },
    {
      "rating": "4.5/5",
      "review": "Has to be the better installation in the franchise, and frankly if they improve on this model the next few movies will be great. I actually felt like this was somewhat like what I remember the show being like as a kid... and the fact that they cut 50% of the BS cheese and replaced it with a couple of decent actors, makes it worth the watch."
    },
    {
      "rating": "4.5/5",
      "review": "I liked, because I love the effects, the design and the action scenes."
    },
    {
      "rating": "1.5/5",
      "review": "Super cheesy dialogue and storyline. CGI similar to Bumblebee movie - very underwhelming. Seems like a low budget TV series type knockoff of Transformers."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie."
    },
    {
      "rating": "5/5",
      "review": "PHENOMENAL movie - can't wait to see where they go next with this - hopefully they can connect it to all the Michael Bay films as well but if not I'm still looking forward to what is to come!"
    },
    {
      "rating": "3/5",
      "review": "Pretty much everything about this is fundamentally ok. This is basically a retelling of the first with some elements of the sequels mixed in for good measure. The rap soundtrack mixed in with cinematic is kind of a strange choice and is very hit or miss. Especially during the action scenes the rap numbers seem out of place. The CGI is shotty with the Bird looking not tha good, oversaturation at the end fight, solid work on Prime, its a bit all over the place. Also the action scenes are very simliar to what weve seen before in all the other ones. It is jumpy a bit in the start, but settles down in the second half. The new autobots aren't used for much besides plot expose dumps every 20 minutes or so and lack much character. That also goes for the human characters who are just ok as well and follow the same beats Shia & Mark followed. It's nothing we haven't seen before in this franchise and done better. The digital scenes look out of place as well and feel like there from a entirely different movie. The end fight does drag a bit as well keeping up with tradition of the other sequels. This is better than those mainly because the excess and Bay tropes aren't present in this and this feels like a basic stripped down Transformers sequel but thats the main problem. It is predictable the entire way for the most part but is competant. If you wanna see giant robots fight again than you'll get your money. If your most and wanna see something different and not just a retelling of the first or previous ones again than skip this and stick with the first & Bumblebee."
    },
    {
      "rating": "1/5",
      "review": "I can't believe that they have now took the Transformers franchise and made it a big racist piece of shit. I don't understand why we let Hollywood and politicians try to keep all those little Americans at each other's throat with all these little bullshit sayings and bigot jokes."
    },
    {
      "rating": "1.5/5",
      "review": "Man, I don't know what movie people who taste this thing high saw. I always liked transformers, this movie though, sucks!!! And what a waste of the maximals"
    },
    {
      "rating": "3/5",
      "review": "ROTB is a really good Transformers film but it's often boring and not the most compelling, but when the movie is in its prime. It mostly pays off."
    },
    {
      "rating": "3/5",
      "review": "Its Transformer so you get what you get."
    },
    {
      "rating": "4.5/5",
      "review": "9.0/10 I was super excited to watch this because it was set after the events of Bumblebee, which is a movie I loved! Finished watching this and it was great! Anthony Ramos did a very good job, the Maximals are super cool, and there was plenty of entertaining action and adventure that kept me hooked! There were also some scattered funny jokes! The whole planet-eating monster thing was a bit “unbelievable” but it didn’t ruin the movie."
    },
    {
      "rating": "4.5/5",
      "review": "A fresh look at the transformers universe. Greatly enjoyed the movie, during some scenes felt like was watching Avengers Endgame with different characters 😂 But overall engaging movie. Wish to see the next part 🤞"
    },
    {
      "rating": "1.5/5",
      "review": "This movie was very very bad to me, and it felt very empty The characters were an interesting, except for bumblebee, and Optimus prime steaks felt like you seen this in other transformer movies that humans are god awful not the actors just their characters and I really like the beast wars cartoon, but this was nothing like these wars. This felt like characters that were just so shallow in an not interesting enough to pull me in the movie and then they pulled this move out their ass to try to cross over with this other franchise spoilers is the G.I. Joe franchise. It is just so bizarre and unearned 2/10"
    },
    {
      "rating": "0.5/5",
      "review": "I would rather watch dog feces than see this movie again. It was so terrible I had to do research to find out why it was so terrible. I discovered it was not directed by Michael Bay. This movie was directed by Tyrone Newport. This movie was so unbelievably ghetto I'm surprised they didn't have optimus prime twerking."
    },
    {
      "rating": "2/5",
      "review": "Absolutely terrible ending."
    },
    {
      "rating": "3/5",
      "review": "To easy of a read and story line was basic. It didn't have depth as the other versions of Transformers. It felt thrown together. It was not as realistic as past Transformer's."
    },
    {
      "rating": "1.5/5",
      "review": "Woke from the start, right away at the start there are digs at white people, its a shame as the special effects were great. Stick to entertaining all of us and cut the racism and politics. We do not want to be lectured on politics. Its a movie about robots, stick to their story not about perceived social injustice."
    },
    {
      "rating": "3.5/5",
      "review": "La mejor película de transformers hecha hasta ahora, se siente fresca y es muy entretenida, la inclusión de los Maximals fue todo un acierto al igual que los villanos Terrorcons, igual cayó en los clásicos clichés y cursilerías de la saga, sobre todo hacia el final, que hacían ralentizar todo y quitar dinamismo."
    },
    {
      "rating": "3.5/5",
      "review": "Transformers: Rise of the Beasts is a really great new addition to the franchise as the film follows Noah who is played by the amazing Anthony Ramos who I know as Usnavi from In the Heights, as he falls into the lap of an Autobot named Mirage and is sucked into having to save the world. This movie I believe is much more entertaining and action packed as Bumblebee was and has a much more complex story as it dives more into the lore of Transformers with the arc known as Beast Wars. This movie feels really similar to Revenge of the Fallen as it dives into that National Treasure or Indiana Jones feel of things. I also really enjoyed the dynamic between not only Mirage and Noah within the movie but more so Noah and Optimus as they do butt heads a little, realizing they have more in common than they think which I enjoy their dynamic better than Sam and Optimus, but Sam's dynamic with Bumblebee can't be beaten in my opinion. I found a lot of Mirage's jokes within the movie to be funny, mostly due to the fact I get a kick out of Pete Davidson as it is. I also really enjoyed how more accurate the transformers' designs were to the cartoons even though the Bay designs will always have a special place in my heart. I'm just so glad that Transformers is still showing that they have gas in the tank when it comes to the intense action that will give you suspense, make you engaged, and still deliver a great story. Overall, Rise of the Beasts is a great movie with a charming cast and has some great character development and chemistry while also keeping the action-packing and bringing back that adventure aspect to these movies. Rise of the Beasts is a B+."
    },
    {
      "rating": "2/5",
      "review": "Good story premise but the characters have terrible reactions to what happens. Nobody would do what they do. It makes for a poor movie. Do the Decepticons forget they can fly? No background on how the autobots get there. Optimus is selfish? Just a money grab and not worth your time."
    },
    {
      "rating": "5/5",
      "review": "i think it was a good movie plus it's the best movie ever"
    },
    {
      "rating": "3.5/5",
      "review": "The first 30 minutes took me a bit to get \"into\" the movie; however, it quickly became very entertaining. I enjoyed this one quite a bit. Also I was always a massive fan of the Beast Wars cartoon and so cool seeing it all \"brought to live\". There were a few parts where it seemed humans learned something a little quick (I'll leave it at that), but that's okay, this was a good movie. Sit back - relax... and enjoy."
    },
    {
      "rating": "2/5",
      "review": "Unfortunately I found this entry boring. The first twenty minutes showed real promise and the final moments demonstrated some real progress but the characters are bland and lacking any flesh, the action is pointless and aimless and the audience is largely underestimated given this the sixth film in the series."
    },
    {
      "rating": "3/5",
      "review": "Entertaining but cgi overloaded film"
    },
    {
      "rating": "5/5",
      "review": "Its the best Transformers live-action movie. Just it"
    },
    {
      "rating": "1/5",
      "review": "To be completely honest, this is woke cobblers at about 80%. Where'd all da whypipo go? An all black cast dropped this crap down the toilet with a good flush. Predictable, boring, slow and unrealistic to the max."
    },
    {
      "rating": "1/5",
      "review": "I grew up on Transformers so yeah, guess how old I must be but I turned it off and started rewatching The Terminal List. Terrible acting, predictable woke nonsense, cringe writing, predictable AF... don't bother with it."
    },
    {
      "rating": "3.5/5",
      "review": "I saw this opening night. Just like I saw the first 3? Of the bay films. I think I missed 2 of them. Anyway growing up I was a HUGE Beast Wars fan. I also loved Bumblebee. So you can imagine when I saw the trailer I was ecstatic. Finally all my favorite stuff live action. However like all the Transformers movies it quickly devolves into dialogue that just doesn't make much sense. The transwarp this or that is going to be used by a bad guy to destroy this planet or that planet. It's it too much to ask for action packed intellectually engaging content? I guess if you make some thing and it's dumb, but it takes in the same out of money than why try? Most characters don't get enough screen time. Especially the maximals. These movies are just too packed with characters. There is no development."
    },
    {
      "rating": "1/5",
      "review": "They should have stopped with the last one. This prequel is just unoriginal. Not worth the 2 hours"
    },
    {
      "rating": "5/5",
      "review": "Awesome transformers movie!"
    },
    {
      "rating": "5/5",
      "review": "I personally love transformers all around, and this movie reminded me of what I missed in transformers movies while also showing me the things we could be seeing in the future. Many people are introduced to newer and older parts of the mythos through the movies, but all the same, alot of people create these weird ideas of what it \"used\" to be or what they want it to be, and ROTB is a shining example of the new direction taking place. Truthfully the movie is a 7.5/10 for me, but a 10/10 considering what type of road it seems like they're going with these films, you can almost say these movies are transforming:]"
    },
    {
      "rating": "1.5/5",
      "review": "Cringe Watch, at times, felt it was a spoof on Transformers, Avengers & LOTR, the worst Transformer movie yet."
    },
    {
      "rating": "1/5",
      "review": "Skipped thru a lot of it.."
    },
    {
      "rating": "2.5/5",
      "review": "Transformens has always been something that enchanted me but this new movie left me torn, the fights are quite frantic something very good about this movie, but the rest I only have to complain about, the humans are not interesting, the performances are horrible, but for me it is a so-so movie!"
    },
    {
      "rating": "3.5/5",
      "review": "This movie was interesting, Noah Diaz and the new Transformers that were introduced were pretty cool. I thought Optimus Prime was cool, but I liked the look of him from the previous movies more, and I was sick of the same \"I don't like humans\" routine from him. The final battle was cool, I loved the animal transformers. the lore is pretty well thought through and I appreciated that. The tie-in to G.I.Joe was also cool, and a Hasbro universe would be awesome. I liked that Noah wasn't just a helpless human running away during every battle like other characters were in the previous films."
    },
    {
      "rating": "1/5",
      "review": "Nice to see People of Color as the heroes but wish they could have done it without making all the white people (the boss and head of security who denied the interview citing \"people like you\") be despicable caricatures and without bits like \"Be sure to laugh at all their jokes. White people love that.\" I want us to all be able to joke and take a joke but this movie was very one-sided. Love beyond color."
    },
    {
      "rating": "2/5",
      "review": "I had high expectations. This movie is a huge disappointment. Yes it's cool they showed more bots but the main characters? Straight up obnoxious the whole movie. They made me cringe so much I wanted to pull my hair. I had to stop and re try watching this movie several times. Those 2 actors ruined this movie. The fights were kind of lame. Wish it was better."
    },
    {
      "rating": "0.5/5",
      "review": "Casting is terrible. The first 3 movies were great this one is buy far the worsts. Very said day for the transformers franchise"
    },
    {
      "rating": "3.5/5",
      "review": "it's been a while since i've watched a Transformers movie - i forgot there was like robot animals & dinosaurs & stuff. i don't know that the robot animals really added anything to this one per say - or even Optimus Prime for that matter either. the main dude & Mirage carried the whole thing i thought. overall it's a pretty good watch; if you're a fan of the franchise you'll probably like this one too - it's funny & action packed."
    },
    {
      "rating": "0.5/5",
      "review": "Uma verdadeira perca de tempo, foram 2 horas perdidas que nunca mais terei de volta, que roteiro fraco, frases de efeito sem graça, personagem sem sal, e um tanto quanto confusa a história! Uma pena que acabaram com a franquia dessa forma. Triste"
    },
    {
      "rating": "2/5",
      "review": "The terribly written script cannot be saved by the okay action sequences this movie has. 2/5."
    },
    {
      "rating": "4.5/5",
      "review": "What a beautiful movie! I watched this after recently revisiting Extinction and The Last Knight and found myself cheering and almost in tears every time there was a well thought out plot line. Bravo!"
    },
    {
      "rating": "1/5",
      "review": "O filme tenta tornar útil os protagonistas humanos, mas sem eles na história não faria a menor diferença, em todo momento você se pergunta o porquê deixar tarefas importantes pros protagonistas se um robô gigante com armas poderosas resolveria mais rápido, eles tentam recriar a química entre os robôs que nem no primeiro filme mas não rola porque é forçado demais"
    },
    {
      "rating": "0.5/5",
      "review": "I thought it couldn't be as bad as people were making out, but it is. Pandering racist drivel. I'm so happy this tanked. Keep going woke Hollywood because I love seeing this racist garbage fail."
    },
    {
      "rating": "5/5",
      "review": "This movie was amazing! Really surprised how it got 52 rotten tomatoes. ⭐️⭐️⭐️⭐️⭐️"
    },
    {
      "rating": "3.5/5",
      "review": "Fun movie. You get what you paid for, which is Transformers robots in disguise. The main lead actor was great and carried the movie."
    },
    {
      "rating": "1.5/5",
      "review": "it was action packed but i dislike how bumblebee died.i cried.."
    },
    {
      "rating": "5/5",
      "review": "An Amazing Action Packed Movie For The Franchise And Is Now One of My Favorites Other Than the First 2007 One.5"
    },
    {
      "rating": "1/5",
      "review": "Terribly for little kids, it's silly"
    },
    {
      "rating": "5/5",
      "review": "Awesome fun, defo worth a watch!"
    },
    {
      "rating": "3.5/5",
      "review": "Transformers: Rise Of The Beasts - 7/10. Bumble Bee I loved, and the first and third Transformers films I loved too. The issue I have with this movie is that its good, but not great. Its serviceable and entertaining to a certain extent. That magic and aura of the earlier entries is kinda missing here. The 90's aesthetic and soundtrack is fun, some of the action is good, the voice cast is great, and overall, the movie is entertaining. But again, the enticing nature that once was in this franchise is kinda absent here. I also did like how Optimus was a little meaner and vengeful here, giving a new avenue to explore for the character. Overall, good movie, but not amazing!"
    },
    {
      "rating": "2/5",
      "review": "I loved the idea of the movie. I watched beast wars as a kid. Loved beast wars! This movie made no sense to me. Acting was terrible! The story made no sense. The robots can only do so much to save the movie. The transformers can give humans their powers?! So Sam just had to run through a minefield for a whole movie for no reason? A lot didn't add up. I watched the whole thing so it wasn't good but it was a sight to see nonetheless."
    },
    {
      "rating": "2.5/5",
      "review": "Rehash of Fantastic Four and the Silver Surfer."
    },
    {
      "rating": "5/5",
      "review": "Acțiune si mult suspans. Efecte sonore și imagine de buna calitate! Recomand!"
    },
    {
      "rating": "4/5",
      "review": "We waited five years and this is what we deserved a good transformer movie since 2011"
    },
    {
      "rating": "4/5",
      "review": "It's a pretty good movie. The ending was somewhat of a letdown, imo, other than that we enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "Un film dedicat tuturor care le place actiune si aventura, film recomand."
    },
    {
      "rating": "5/5",
      "review": "Cel mai excepțional și atractiv film !"
    },
    {
      "rating": "2/5",
      "review": "This movie is hard to watch, considering how great the franchise started to see where it has ended up really is disappointing. The new york 90s vibe is not appealing in the slightest nor the terrible voice acting for the transformers. Really felt cheap and forcing Mirage to talk like a modern hip hop enthusiasts makes absolutely no sense, they literally are an advance race. This was made for New Yorkers is basically the point."
    },
    {
      "rating": "5/5",
      "review": "I love the new design of the autobots, great movie"
    },
    {
      "rating": "2/5",
      "review": "Other lackluster plot with ghetto backdrop. Not thought out well."
    },
    {
      "rating": "1/5",
      "review": "In the first few minutes of this movie, a poor hispanic Mom warns her son, who is on his way to a job interview, to make sure and laugh at the \"white people's jokes\". \"They\" like that kind of thing\" she says. Then the white interviewer refuses to interview the son saying he got a bad recommendation and telling him \"I can't let someone like you ruin my operation\" without even letting him explain. Just before that, the son's sick brother was thrown out of the hospital by an uptight white lady due to unpaid medical bills, but not before some random person of color on the street was yelling and complaining loudly about \"Capitalism\". All this in the first few minutes, so I think you can see what kind of movie this is."
    },
    {
      "rating": "3/5",
      "review": "Basically Transformers: Hood Edition. This is essentially what Miles Morales is to the Spider-Man universe. It was actually pretty decent minus some of the stereotypical stuff. As a Transformers fan I'll watch all of them and know that robot action will always carry even when there is glaring holes everywhere else in the film."
    },
    {
      "rating": "5/5",
      "review": "Fantastic Visuals. Good Characters and it is full of heart and beautiful action sequences!"
    },
    {
      "rating": "5/5",
      "review": "Action packed as it should"
    },
    {
      "rating": "5/5",
      "review": "Scenele din film sunt foarte bune"
    },
    {
      "rating": "5/5",
      "review": "BEST TRANSFORMERS MOVIE EVER! This is the only transformers movie with the most fighting scenes! Worth the $5 money!"
    },
    {
      "rating": "5/5",
      "review": "Un filme super merita văzut"
    },
    {
      "rating": "5/5",
      "review": "E o adevărată reușită! Super tare!"
    },
    {
      "rating": "5/5",
      "review": "Un film foarte bun merită văzut !"
    },
    {
      "rating": "0.5/5",
      "review": "The plot is terrible. This is the 5 sequel in the series and yet few human knew about the existence of these robots. I mean we went from destroying New York, the pyramids, military supporting them, to a shock to almost everyone that they exist. The plot is all the same, they find a way home and but they must destroying it so they can protect earth. Their home world was destroyed in one of the movies but not in this one. They supercharged Megatron last movie but he's no where to be found here. And there's always an artifact in the center of these movies; we went from the matrix of destiny, the old spark, the pillars and now the transwharp. And they always destroy these things in such a way, that there's no rebuilding them like everyone of them was unique, ancient no one has the knowledge to re-engineer. It is beyond stupid!!"
    },
    {
      "rating": "3.5/5",
      "review": "Transformer apes and birds? It's the same formula, but this one takes the human and autobot connection to an ironman level. Cool GI Joe ending."
    },
    {
      "rating": "5/5",
      "review": "Loved the story and action of this movie."
    },
    {
      "rating": "4.5/5",
      "review": "I think the movie gave us what we, transformers fans wanted: a transformers movie for all ages, that doesnt have any bad or sexual jokes, and its not so centred in the humans, since we get to see the autobots longer, since in the michael bay films, it was all about sam or cade, but here, we get to see the motivations of the characters more, and its not just giant robots killing each other for no reason. anthony ramos made a great job as noah, and dominique as helena. id give this movie an 9.6/10"
    },
    {
      "rating": "5/5",
      "review": "Cel mai bun film! Recomand!!"
    },
    {
      "rating": "5/5",
      "review": "Merita toate cele 5 stele.Un film foarte palpitant."
    },
    {
      "rating": "5/5",
      "review": "Un film de 5 stele am și jucat"
    },
    {
      "rating": "5/5",
      "review": "Superb îl recomand ii dau 5 stele"
    },
    {
      "rating": "5/5",
      "review": "Transformers un film care chear te transforma o lume a roboților bine realizata 🎉"
    },
    {
      "rating": "4/5",
      "review": "If you like Gen 1 transformers, Gen 2 Transformers and Transformers Beast Wars. You will probably love this as much as I did. It's an action movie, based on a cartoon. That's what you should expect."
    },
    {
      "rating": "0.5/5",
      "review": "Zero atmosphere. They spent effort making animated fight sequences, and just seem to play them back with some dull music background with no atmosphere - zero tension and maximum boredom. The acting is, at times, so painfully bad - it looks like they pulled some random teenagers from the street. It almost seems like there's an in-movie joke where one 'actor' says to the other 'actor' whilst pretending to push a heavy stone lid 'are you even pushing?'. Very good question, it looks like they put their hands on it, moved their bodies and scrunched up their faces. It never looked like they were really pushing it at all - I'm guessing they had to take care not to dislodge the polystyrene lid... I loved the first movie, and I really enjoyed seeing Bumblebee's movie - but that's it."
    },
    {
      "rating": "2.5/5",
      "review": "Meh was nothing but predictable and was a whole lot of nonsense with a new human having to explain things and intro to transformers which has been done in past movies they could have skipped this. It was ok not the best movie they have done. Would I watch again? No"
    },
    {
      "rating": "2.5/5",
      "review": "Good action C G and poor writing. The only smart woman is the only thing that I like in the movie. It's fun but could be better 👍"
    },
    {
      "rating": "2.5/5",
      "review": "just could not really find the storyline suspenseful at all."
    },
    {
      "rating": "5/5",
      "review": "Really such an awesome and visually entertaining movie that even had my 7 year old brother in awe"
    },
    {
      "rating": "1/5",
      "review": "This 91% rating has got to be rigged, this movie was so boring and did nothing new. My thoughts while watching this movie was \"I've already seen this\" because of the bland visuals, story and comedy oh my god the comedy was so bad. As bad as most of the Michael bay ones were, the guy had a visual style that made the transformers look so alive and fun and this one just looks so bland. And the ending might be the worst setup for a future project I've ever seen"
    },
    {
      "rating": "3.5/5",
      "review": "Overall I enjoyed this film but I can appreciate not everyone would like this film. I also didn't realise they were resetting the timeline so that was a big adjustment"
    },
    {
      "rating": "5/5",
      "review": "Dacă puteți ajunge la lungimea de undă ca un film în contradicție cu el însuși, Rise of the Beasts este un blockbuster de vară plăcut, care joacă hituri narative, băieți buni și băieți răi într-o cursă pentru un MacGuffin și oferă secvența de acțiune necesară."
    },
    {
      "rating": "5/5",
      "review": "This is my favorite movie. I love it!"
    },
    {
      "rating": "5/5",
      "review": "Un film intre fictiune si realitate, actiune continua si multe scene fantastice...merita vazut"
    },
    {
      "rating": "2.5/5",
      "review": "It was..alright? Not the best Transformers movie."
    },
    {
      "rating": "3.5/5",
      "review": "Was entertaining all the way through. I felt it was worth the money."
    },
    {
      "rating": "0.5/5",
      "review": "Where to start? This movie was a wreck from the start. Horrible writing, cheesy over the top green screen graphics. Acting was Marginal, and felt extremely forced. The only worse movie than this is TMNT.."
    },
    {
      "rating": "3/5",
      "review": "The best transformers movie to date. The rest absolutely horrible, this one a little better. At least with this one u can tell the good guys from the bad guys"
    },
    {
      "rating": "5/5",
      "review": "Seeing a director who is a fan of a franchise usually works out very well and it did in this instance, from top to bottom this is an amazing film and if you are a transformers fan you will love this"
    },
    {
      "rating": "2/5",
      "review": "The acting and dialogue of the main characters took me out of the movie. Cool special effects as always, but seems like a lazy cash grab. They could have done much more with it."
    },
    {
      "rating": "5/5",
      "review": "Filmul este foarte incitant, este genul meu preferat, recomand tuturor să-l vizioneze"
    },
    {
      "rating": "5/5",
      "review": "big robots go brrrrr"
    },
    {
      "rating": "4.5/5",
      "review": "as usual great cinematography and story telling, really engaging"
    },
    {
      "rating": "0.5/5",
      "review": "bro this movie was dumb like why would you have two different franchise go together and if transformers is its own franchise. Like if you imagine G.I Joe and the autobots together fighting that is so dumb like now G.I joe Might take over the transformers and G.I joe franchises and like i know transformers works with humans before but they are in the transformers Michael bay universe"
    },
    {
      "rating": "5/5",
      "review": "Seeing a G1 inpire live action movie is really good. Although I wanted to see more of the Maximals or even other Predacon instead of the same clone of Scorponok, but the fact that this movie did what ot did was amazing. Noah is a WAAAYYY better human lead than Sam and Cage, puting the spotlight on Mirage this time instead of Bumblebee was a good idea, and let's not forgotten of Peter Cullens spine chillin performance as the big man Prime himself."
    },
    {
      "rating": "5/5",
      "review": "Who cares about the plot!!?? This is about Robots duking it out at your favorite vacation spot. Great movie and an amazing start to an apparent reboot of the franchise. Keep it simple and have robots shooting each other with arm cannons at famous museums and I will be a avid movie attendee for the foreseeable future."
    },
    {
      "rating": "4.5/5",
      "review": "This was the most fun I've had at the movies in a long time. It can be a little shaky at times, but it manages to mix well the heart of the previous film Bumblebee (2018) with some really enjoyable action-packed fun. This might be Peter Cullen's best performance as Optimus Prime, and new character Mirage was an absolute joy. Primal and Airazor are also stand out characters. Not to mention, the music was absolutely on point."
    },
    {
      "rating": "1/5",
      "review": "This movie was just bad. Really only made for young kids. The special effects were terrible, the acting was flat, and the overall plot was poorly developed. There was zero character development, I felt like I was watching a kiddy cartoon."
    },
    {
      "rating": "3/5",
      "review": "It was pretty good compared with the other transfromer movies after the first movie, I would rather watch the first movie of transformers that this..."
    },
    {
      "rating": "0.5/5",
      "review": "Just another transformers movie! Nothing new!"
    },
    {
      "rating": "2/5",
      "review": "Maybe it is time for the franchise to stop Could not het myself to care about the Autobot's or their human sidekicks Diversity and inclusivity in the cast is so blatant and ultimately annoying. Found myself routing for the robot villains 😉"
    },
    {
      "rating": "5/5",
      "review": "By far one of the best transformer movies Don't give me I love all the transformer movies But this one Was the best"
    },
    {
      "rating": "5/5",
      "review": "Another of the great Transformers movies!!!!!!!!!!!!!!!!!!!!!!!! And having two Optimus in the movie, makes it ever better"
    },
    {
      "rating": "5/5",
      "review": "Love every second of it! It's a must-watch!!"
    },
    {
      "rating": "2/5",
      "review": "Who are all these people rating this piece of trash 5 stars saying \"It's THE BEST EVER! 🙂\" Must be a bunch of bots or something, at least I hope so because I literally couldn't take it anymore and had to write this review. Unicron IS THE EARTH. So boom the whole movie is already stupid. Secondly, I understand Optimus Prime is supposed to have \"grown\" throughout this film into who he is as we know him in the future movies.. but Optimus Prime has never once ever come across petty and bitter and childish like this trash heap portrays him as. He's not the autobots \"big brother\".. he's the LEADER WHO HAS LEAD FOR A LONG TIME. He wouldn't have needed to be persuaded by monkey Prime (Beast Wars the show was really good.. and they weren't that bad in this movie, except the fact that their bot forms are literally only shown at the very end.. and even still unrecognizable since the CGI was trash and it never actually showed them.. not to mention it's basically Optimis Primal, Airazor.. and cheetah bot and a rhino who don't do anything.. yup long parenthesis but oh well, because this trash was trash and you fools need to recognize.. not to mention it's BEAST WARS.. Dinosaur Megatron would have been awesome.. Scorponok was relegated to multiple shitty henchmen and . . oh, no other predacons.. let's randomly throw in Terrorcons.. Scourge was alright.. literally don't even know the others names..Although yellow truck bot actually looked cool) How about instead of Marky Mark (which was still leagues above these actors simply because of his BACKSTORY and the fact that he actually comes across as not just ACTING in some high school play like Fishbeck or whatever that girls name is with her literal one expression.. artifact crumbles into an alien relic 😐.. robots from space and a guy you don't know at all say risk your life and lead us to a place you literally just told us where it already is \"Okay\" 😐.. Oh no, eaglebot almost killed me literally no scream or anything she's just scooped up: 😐.. Spanish dudes freaking out .. fish back: 😐..) or some random Spanish dude that has ZERO backstory (who's acting wasn't bad, but they gave this dude literally nothing to work with.. hell the little brothers lines and his whole aura was actually one of the only highlights of this whole trashshow) just so we all know \"white people are evil and we HAVE to have a different race as the main characters.. this already so long I don't care. JUST MAKE TRANSFORMERS.. the way it was supposed to be made.. one blockbuster movie of awesome ass robots battling it out and let us invest in the BOTS.. what's so difficult about that. The beginning scene of Bumblebee was perfect.. make a whole movie showing all the Transformers . . And DO IT RIGHT. Or just stop, because this is just sad. Transformers are awesome and these movies are just ruining them."
    },
    {
      "rating": "3.5/5",
      "review": "Not too bad, repetitive as usual with transformers movies, a plucky human aiding some kind of hero redemption arc. The finale set piece was fantastic however, the rest of the movie was a bit of a snooze."
    },
    {
      "rating": "3.5/5",
      "review": "It was very point A to point B, and the characters weren't that fleshed out. But if you just want giant robot fighting action, here ya' go."
    },
    {
      "rating": "1.5/5",
      "review": "I feel like this movie like other movies focuses way to much on the color of your skin then good story telling. I.was very disappointed"
    },
    {
      "rating": "0.5/5",
      "review": "While the original 2007 Transformers film wasn't perfect, it was a movie for fans of the cartoon. I can still go back and watch that one with the joy I felt the first time I saw it. Like I said, it wasn't perfect, but it was big, funny, sexy and a fun ride. This one feels like it was made in 1995 except for the woke script. The graphics look more like a cartoon and the Autobots dialogue was straight out of the campy TV show sans the respect for Prime. None of the sequels seemed to ackowledge much about the mythology from the previous movie - but this one tries to tie to the original show's plot while creating a completely ridiculous new mythology. The fact the Michael Bay even has his name on this one shocks me. Complete garbage."
    },
    {
      "rating": "5/5",
      "review": "Really good movie, very action packed but also kinda funny, they have some scenes in 5yere that may be sad but then they always throw a joke or 2 after to make it better and the ending is just, perfection, highly recommend"
    },
    {
      "rating": "1/5",
      "review": "Michael Bay or not, you must realize -- this franchise is a scam."
    },
    {
      "rating": "5/5",
      "review": "فيلم رائع انصح الجميع مشاهدته"
    },
    {
      "rating": "5/5",
      "review": "Wonderful time, enjoying it"
    },
    {
      "rating": "5/5",
      "review": "great time I have it"
    },
    {
      "rating": "5/5",
      "review": "والذهاب الى السينما لمشاهدته ...فيلم جميل ورائع وممتع انصح به جميع الاعمار"
    },
    {
      "rating": "5/5",
      "review": "انهو فلم أكثر من رائع أحببته كثيرا كثير سنعود المشاهده مع العائله والاصدقاء"
    },
    {
      "rating": "5/5",
      "review": "من اجمل الافلام التي شاهدتها"
    },
    {
      "rating": "5/5",
      "review": "This movie is amazing. I love it all even though I critics hate it even though the Director works so hard on it."
    },
    {
      "rating": "1/5",
      "review": "Worst fucking Transformers movie EVER. Extremely cringe and overall just dumb asf story line doesn't make sense, I now have an appreciation for the Mark Wahlberg movies!!!"
    },
    {
      "rating": "2.5/5",
      "review": "It wasn't great, it wasn't horrible. It just was."
    },
    {
      "rating": "0.5/5",
      "review": "Probably the crappiest version of Transformers I have ever seen. Naive and intellect less dialogs, crappy graphics. Woke at its best. Stopped watching after 30 mins."
    },
    {
      "rating": "3/5",
      "review": "I went into this movie having high hopes based on reviews from audiences. However I was let down. I think the main problem is that it feels rushed. I felt like I wasn't given enough backstory for the human characters and therefore didn't really care about them. I also felt like we werent given enough explanation to the plot and therefore it was hard to care about what the transformers were trying to do. We also have a whole new cast of transformers that we also aren't introduced to very well. I also feel like optimus prime has changed character completely. In the bay movies he is a very strong and confident leader. However in this film it feels like he has lost his leadership and is quite boring. Another problem is that the cgi is different to the bay movies. While it is mostly still good. The transformers look a lot more cartoony. Overall I would say that if you are a fan of the original cartoon from the 80s you will probably enjoy this film. However If you are a big fan of the bay movies you probably won't enjoy this one as much."
    },
    {
      "rating": "1.5/5",
      "review": "Acting was stale, it lacked tastefulness. No emotional roller coaster compared to what Michael Bay and Shia brought us. Combat action was mid (make physics PHYSICS). CGI will definitely rule this franchise so no comment on that. And 2hr movie run tbh imo is quite short for this movie's story line."
    },
    {
      "rating": "0.5/5",
      "review": "The movie doesn't make any sense for the timeline it's supposed to fit into, the movie forces humor instead of the seriousness of the plot, prime has no sense of respectful leadership, they bid the life of every galaxy in existence on not wanting to be seen by humans, there is no significant loss because of the timeliness we know that the one character that dies is going to be resurrected, the cgi seems different in a bad way, not as much detail as the movies before it, there's nearly no backstory to the main character, character reactions are not all there in certain scenes, feels like a rip off of king Kong and Ironman as they perform the same moves at times, if it was the first movie of a new series spin off made for kids (because there's no gore or death) then I would rate it 5/5, but for the series it's supposed to be a part of, I would say save your money and watch the next fast and furious 29 or whatever number there on, it feels like a wasted hour of my life to watch this series die, very sad and disappointing to have watched these movies growing up from a kid being super excited to watch this new one just for it to tank the series for anyone who has watched the previous movies The movie doesn't pull the viewers in and get them attached to anything or anyone, they could have made the movie better by having the main character choose between saving his brother or the world, at least then people would be emotionally invested in something"
    },
    {
      "rating": "3/5",
      "review": "By itself without thinking about the other movies it's a good movie. The CGI was sucky but overall a great movie. The timeline compared to the other movies was very confusing. I was a upset when they killed off my favorite character but them they were brought back to life. The movie itself just didn't make a whole lot of sense."
    },
    {
      "rating": "0.5/5",
      "review": "Think of a 7 year old being handed 200 million dollars and told to make a movie, this movie is worse than whatever you're thinking."
    },
    {
      "rating": "5/5",
      "review": "It was so good I watched it 4 times"
    },
    {
      "rating": "5/5",
      "review": "جميل ورائع انصح بمشاهدته 😘"
    },
    {
      "rating": "5/5",
      "review": "فلم رائع جدا ومثير للأعجاب"
    },
    {
      "rating": "5/5",
      "review": "فلم جميل جدآ جدآ جدا"
    },
    {
      "rating": "5/5",
      "review": "رائعون دائما 🌷🌷🌷🌷"
    },
    {
      "rating": "5/5",
      "review": "انتم الأفضل والاروع دايمآ فيلم جميل جدا"
    },
    {
      "rating": "1/5",
      "review": "After forgetting I didn't finish Last Knight, I watched the film this evening and was surprised to find a 2023 movie. Payed the £20 to buy it and didn't watch the trailer - I wish I had. It doesn't make sense in the timeline aside a few references - it's been done on a tight budget and it feels like it's been crowbarred in but doesn't fit. Was hoping for the story to progress but I paid for a confusing mess. Wait until it's cheap to watch and leave it on in the background. The CGI was better in the first live action movie & this movie killed the franchise."
    },
    {
      "rating": "5/5",
      "review": "I love when movies score low on the tomato meter yet high on audience score. That's when you know it's a good movie."
    },
    {
      "rating": "4.5/5",
      "review": "Good end fight pretty good"
    },
    {
      "rating": "3.5/5",
      "review": "A good Transformers movie, but it's time to end this franchise. 'Rise of the Beasts' has good intentions, good characters, a killer soundtrack and good action sequences, but something here is off, the sense of urgency is gone and the sense of watching something big is not enogh like the first three movies. I think Steven Caple Jr does a solid job and Anthony Ramos and Dominique Fishback are good adition, but overall, 'Rise of the Beasts' end his journey without an impact, sadly."
    },
    {
      "rating": "5/5",
      "review": "فيلم رائع جدا.انصح بالمشاهده"
    },
    {
      "rating": "2/5",
      "review": "The start was super captivating but then I got super confused is this like paranormal activity where the last movie should have been the first one? I don't understand its place in the transformers timeline and gave no clues throughout the movie or ending if it \"should\" have been the first one."
    },
    {
      "rating": "3/5",
      "review": "A new take on transformers that is ok"
    },
    {
      "rating": "3.5/5",
      "review": "Acting was a little sub par, but Pete Davidson was good as Mirage!"
    },
    {
      "rating": "3.5/5",
      "review": "Fresh take on transformers, great development for autobots usually cast aside"
    },
    {
      "rating": "0.5/5",
      "review": "Assemble the Danimals"
    },
    {
      "rating": "2/5",
      "review": "Acting was terrible. White people bad theme as usual is moronic. Beasts were pretty cool though"
    },
    {
      "rating": "5/5",
      "review": "Must watch for fans I love this film 😍"
    },
    {
      "rating": "3.5/5",
      "review": "The plots of Avengers End Game and Fantastic Four Rise of The Silver starring Transformers with flavor."
    },
    {
      "rating": "2/5",
      "review": "The worst of an already tired franchise. Worse is that this prequel even breaks the storyline set by the other films."
    },
    {
      "rating": "5/5",
      "review": "This movie is one of the best movies I watched this year or maybe in my entire life. I enjoyed it and watched it multiple times. Forget the hate about this movie."
    },
    {
      "rating": "0.5/5",
      "review": "Just terrible. Spoiler alert in this review. Unless this was supposed to be a full restart of the movie franchise it made no sense. It is a prequel set in the 90s but makes no attempt to fit in with the other movies. We start with the Maximals on another planet, why are they animals? The auto bots chose cars to hide on earth, did that planet have the same animals as earth? Although they are giant versions of animals so they still don't fit in. The villain comes to destroy their home planet and their leader dies trying to stall. He fights the villain as a gorilla, so you assume that they don't have the ability to transform because otherwise why would you do that? Later we learn they can transform into robots with weapons, maybe their leader was just an idiot. We then are introduced to the humans with minimal background of both other than the fact that they are street smart and face racism. The male is supposed to be good with electronics - this never becomes a valuable skill. The female is an intern at a museum whose director uses her as an expert who gets no credit. We never get any background as to how she has so much knowledge of antiquities other than the fact that her dad was smart from looking things up on his own despite no college education. The male encounters the auto bots and is used to help them retrieve a newly discovered inter dimensional key at the museum. However they are intercepted by the villain who proceeds to beat up all the auto bots and steals the key (turns out to only be half). Optimus, generally the most experienced, wisest, and level headed transformer immediately blames the humans even though they had no knowledge of the villains and the villains managed to defeat every autobot. They then need to find the second half of the key which the female found through similar symbols in Peru. The only explanation as to why the humans are coming is the male doesn't want to trust the planets safety in their hands, as if he provides any help in a fight against giant advanced robots, and the female must come to help them find the location in Peru? They don't have gps or ability to access the internet as a technically advanced race of robots??"
    },
    {
      "rating": "4.5/5",
      "review": "فيلم مثير للاهتمام ، تريد مشاهدته مرة ثانية"
    },
    {
      "rating": "5/5",
      "review": "Interesting movie, want to watch it a second time"
    },
    {
      "rating": "5/5",
      "review": "Good movie, very good, I like it very much, recommend it to more people"
    },
    {
      "rating": "5/5",
      "review": "فيلم ممتع للغاية ، أنا معجب به كثيرًا ، وعائلتي أيضًا تعجبه كثيرًا ، أتمنى أن تتاح لي الفرصة لمشاهدته مع الأصدقاء"
    },
    {
      "rating": "1/5",
      "review": "By far the worst Transformers movie. The worst part is it totally destroyed any time line of the movies. 1994,,, really. Then when did the Shai LaBeouf, Mark Walberg, and Bumblebee movies take place. The 70's and 80's??? Or are they all fighting different parts of the war at the same time. Stupid mess up of the time line. No character build up. Who are these people. 20 minutes into the movie and these 2 humans are faced with giant robot aliens. They have no fear or suspicion. Learn their technology. Then go and fight with Unicron with no problems. Oh wait,,, one guy needed money so... No thank you. Waited, and watched good movies for years waiting for this crappie 2 hour cut grab at money for the franchise. I been a fan of Transformers since the 80's cartoon, the Beast Wars, no w the live action movies. You boys at the Transformers movie franchise camp failed your viewers on this one. This would have been a great 2 part series. Please dont ruin it by trying again."
    },
    {
      "rating": "1/5",
      "review": "Actors were boring, very low expression, worst of the Transformers saga."
    },
    {
      "rating": "3/5",
      "review": "Kind of thought it was all over the place. The story is so similar to all the others. Earth has a device that could end Earth. The human characters were very ho hum."
    },
    {
      "rating": "0.5/5",
      "review": "Wow. This dreadful movie makes the previous Bay movies seem like award winning masterpieces. The casting is dreadful, and the writing was like that of a 6 year old. The movie goes nowhere and there's zero investment in any of the characters. This reboot needs a whole new reboot or let's go back to the Bayverse with a new cast."
    },
    {
      "rating": "4.5/5",
      "review": "This was a great start to the rebooted franchise. I absolutely love that they started from the 80's to the 90's and supposedly will go to the next decade or two every movie thereafter all the way to the present day. (Spoiler) The ending was an absolute surprise and twist with the introduction to the G.I. Joe franchise crossing over. I cannot wait for the next one."
    },
    {
      "rating": "2.5/5",
      "review": "Entertaining for fun. Glad I didn't pay for a movie ticket. One of the better Transformers movies."
    },
    {
      "rating": "1/5",
      "review": "The only new thing this movie brings is identity politics. If you need some transformers Action, just watch the first one again. Unless you like identity politics, then this movie is for you."
    },
    {
      "rating": "5/5",
      "review": "Like bumblebee rise of the beast gives us more human touch nd high octane driven action packed adventure with very simple story with brand new debut of maximals nd terrorcons it's one of the best film of all time with same feeling like nd some new surprises love it absolutely awesome 👌👏♥️👌😃⚡👊🎉😍"
    },
    {
      "rating": "4/5",
      "review": "I watch Transformers movies for the action, the toy-commercial-esq vibes and Peter Cullen as Optimus Prime. Expecting anything else out of these movies is purely being fatuous. The transformers action, the music, the VFX are just *theatre applause* plus in the 90’s? Sign me up for this trilogy. Also that ending… mind = Oppenheimer atomic bomb scenes."
    },
    {
      "rating": "4/5",
      "review": "I watch Transformers movies for the action, the toy-commercial-esq vibes and Peter Cullen as Optimus Prime. Expecting anything else out of these movies is purely being fatuous. The transformers action, the music, the VFX are just *theatre applause* plus in the 90's? Sign me up for this trilogy. Also that ending… mind = Oppenheimer atomic bomb scenes."
    },
    {
      "rating": "1.5/5",
      "review": "The film was slow, the character development was generic, the plot was recycled, and the CGI budget was clearly lacking. This felt like the least familiar transformers movie so far, it's yet another step down from the shia labeouf days. The transformer voices came off animated and the lines were extremely uninspired. The two main characters felt empty and their performances were extremely dull."
    },
    {
      "rating": "3/5",
      "review": "Entretenida, buena cinta pochoclera que tiene la cuota de accion y humor que esperaba al sentarme a verla. Varios momentos que me hicieron decir \"Daaaah\" de lo inverosímiles que eran, un par de chistes malos (pero malos malos eh) y que sentí que hicieron esta película solo para vendernos un par mas hacen que no le ponga una calificación mas alta."
    },
    {
      "rating": "3.5/5",
      "review": "Rating: 7/10. 77/100"
    },
    {
      "rating": "5/5",
      "review": "The best transformers movie"
    },
    {
      "rating": "0.5/5",
      "review": "The best part was when Titus Welliver got up and said, “My face is still my warrant.”"
    }
  ]
}