[
  {
    "rating": "5/5",
    "review": "Loved this movie. Kept me on the edge of my seat the entire movie. I don’t review movies, that explains itself."
  },
  {
    "rating": "4/5",
    "review": "Solid movie! Kept me on the edge of my seat and couldn’t predict where it was going to go. My girlfriend’s hands stayed sweaty the whole time lol. A good all around movie with good acting and plot. Go see this one!"
  },
  {
    "rating": "3.5/5",
    "review": "Sharpened by James McAvoy's delightful acting and the generic but not pointless and actually entertaining plot Speak No Evil is worth a watch"
  },
  {
    "rating": "4/5",
    "review": "Speak no evil is a blast from start to finish. A family-holiday-suspense-thriller this film puts you in the front seat from the get go. It’s basically “get out” but with a family who are trapped, taken hostage by a sociopathic couple. Director James Watkins delivers a nerve-biting film that lets you get up close and personal with its leads. Essentially the story is about a couple who are trying to work on their marriage whilst on vacation but take their personal problems with them. The message or lesson behind the story is very clear. When you are in a vulnerable state in life, never let people especially strangers take advantage of you. Protect yourself at all times. Watkins keeps a tight focus on the protagonist’s and their new found friends. Never allowing the story to drift off into absurdity but rather insanity. The country house setting is claustrophobic, as each moment passes we feel the walls and spaces getting smaller and smaller. The film cleverly builds up to the moment of truth. Can the married couple escape in time or is there more at stake? James Mcavoy is outrageously enthralling. He needs to play more villains. Such an energetic performance and a very good script that has enough room for subtleties making the characters feel as fleshed out as possible. As to be expected the climax is a game of cat and mouse, hide and seek but it never feels too silly or far-fetched. Watkins’s mixes the right amount of violence, misdirection and foreplay wrapping things up with sheer consequence. Speak no evil is a well crafted stalker-thriller that packs an emotional gut punch too. If anything else this is wild entertainment at its best."
  },
  {
    "rating": "5/5",
    "review": "It was a great movie"
  },
  {
    "rating": "0.5/5",
    "review": "Derivative trash with hit and miss performances. A story line seen many times before with much better execution than this mess."
  },
  {
    "rating": "5/5",
    "review": "The ending was perfect — it’s not the typical “everything turns out fine.” Instead, it presents something that could be a harsh reality, but it’s still a taboo to talk about it."
  },
  {
    "rating": "2.5/5",
    "review": "McAvoy really tried to carry the film, and he almost did it but unfortunately he was just not enough to make up for the bad writing and the ending that was worse than the original."
  },
  {
    "rating": "5/5",
    "review": "I'm surprised by some of negative reviews by the audience, I guess it is personal opinion and subjective depending on your taste and what you like and enjoy. I personally thought this is the best film I have seen in years and I watch allot ofdifferent movies, excellent acting and very high suspence."
  },
  {
    "rating": "4.5/5",
    "review": "Excellent. James McAvoy is a strong actor. The movie was done well ...not cheesy."
  },
  {
    "rating": "5/5",
    "review": "Not an absolute must see but it was a suspense horror movie, there are a lot of movies out there with the similar plot but not with James McAvoy in it."
  },
  {
    "rating": "4.5/5",
    "review": "Absolutely intriguing and very suspenful. You knew from the begining something real bad was going to happen. Excellent."
  },
  {
    "rating": "4/5",
    "review": "I have watched God's knows how many thousands of films, I have never felt more uncomfortable watching a film than I did watching this, the Director has done an excellent job because I felt exactly as I would do were I really in the American visiting family in that situation, awkward. It's a really really good film."
  },
  {
    "rating": "2.5/5",
    "review": "It was alright. I like that they did their own take on the original and that the kids had a much bigger role. The acting was great, but it's ultimately too \"Americanized\" for my taste. Too much focus on action scenes and rushing of the plot. It took away a lot of nuance and subtlety that made the original so terrifying and anxiety inducing. It would be really hard for me to ever watch the original again because of how brutal it is, but it's definitely better than the remake."
  },
  {
    "rating": "3/5",
    "review": "Had it's moments, and the acting was good, but it was just a smidge boring and unremarkeable."
  },
  {
    "rating": "5/5",
    "review": "This movie is not meant to be funny, but you wouldn't feel guilty for laughing. We've all met the Tesla couple with the uptight veggie mom and the precocious child. This movie really helped you understand why they are incredibly annoying and how a sexy James McAvoy can ease that pain for you."
  },
  {
    "rating": "4/5",
    "review": "While I didn’t like it as much as I thought I would it was still a good movie. James McAvoy is a great actor with creepy people and this is very very true here. All the acting was great and had many good scenes but I felt that it wasn’t really realistic and also kinda boring at some times. I do like a slow burn but they need a little bit more in the middle. Otherwise though this film is pretty good."
  },
  {
    "rating": "1.5/5",
    "review": "Bad attempt at building suspense. It take the whole length of movie and still failed. The plot is weak and the writing is bad. The only saving point is the acting of the main villain. The rest? Just a waste of time. Keep doing things even though so many signs has been shown to them and they keep ignoring it. Suspense is never there. Just annoyance for dragging the suspense that never came."
  },
  {
    "rating": "1/5",
    "review": "One of the most frustrating movies to watch."
  },
  {
    "rating": "5/5",
    "review": "well done remake of a lesser known european movie made about 5 years ago. Really well done, and even having seen the original first, I really enjoyed this. Seeing the original didnt spoil the ending, and I didnt feel any point of the movie was redundant. I was pleasantly surprised. Acting was a 10/10 too. It's the type of movie that makes you grip the sofa during tense moments."
  },
  {
    "rating": "1.5/5",
    "review": "Comparada con la versión original es una muy flojo remake con un final totalmente edulcorado y para niños O sea el público norteamericano . La versión original danesa es mil veces mejor"
  },
  {
    "rating": "4.5/5",
    "review": "I thought this was really really good. In typical horror fashion, some poor choices were made, but in a shocking turn of events, I think those poor decisions were redeemed as the film went on. Pretty suspenseful and entertaining. Thought the cast did a really good job in these roles as well. Really pleased with how this turned out!"
  },
  {
    "rating": "1/5",
    "review": "Oh my oh my... One of the worst movies I've seen for a while. Take every single horror trope and put them in to one incredibly predictable and infuriating film. Couldn't wait for it to end, after repeated stupidity and ridiculous decisions from the family. McAvoy played his part well, as did the young boy, but the plot was so so so dumb even that couldn't save this one. Gutted as the trailer made it look good and the reviews were decent."
  },
  {
    "rating": "1.5/5",
    "review": "Great Cast, great locations & cinematography. Meh, predictable plot. Huge disappointment, waste of talent. The characters are complete muppets that continuously make unbelievable, imbecilic decisions over & over to move the unoriginal plot to it's predictable conclusion. I'm going to blame the writers because their name was on it, but who ever signed off on it being released the way it was should be punished. If you watch the trailer you've seen all you need to."
  },
  {
    "rating": "4.5/5",
    "review": "loved it, amazing, great. i wasnt as scared as i wanted to be but i was uncomfortable and anxious the whole time. amazing"
  },
  {
    "rating": "2/5",
    "review": "The acting was of a high standard, but the plot…gods save me from stupid, predictable plot tricks. Once we got past those shenanigans it got a little more interesting again. James McAvoy was a standout as always, as was the little boy."
  },
  {
    "rating": "5/5",
    "review": "Terrifying and the most uncomfortable watch I've seen in a while. With that said it is a total Horror crowd pleaser and a Brutal Revenge Blast!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie is made for wokies as it is the only type of person to find this story horrific."
  },
  {
    "rating": "3.5/5",
    "review": "not what i was expecting but i enjoyed it. Great performance from James McAvoy."
  },
  {
    "rating": "3/5",
    "review": "It was pretty cool. I like the acting and I like to suspense. I think the climax was missed or maybe prolong too much."
  },
  {
    "rating": "1/5",
    "review": "The dad was the most useless person in the movie. The first time the wife says to leave he should leave. Why did he have to drink a coffee if he has a Tesla, the car drives by itself. He didn’t think anything weird about the couple, and then in the end he had just one job, save the family or help, what did he do? He jumped from the roof and broke a leg, which was the most important contribution he made in the end. The woman doesn’t have just one pair of balls, she had four because she was holding her husbands too. I cannot imagine how much money they offered the actor of the husband to do that, they should of given a lot of money, because if it was me I would of read the script and taken out my eyes. Worse movie ever. Congratulations to the wife and the kids. If they have a sequel I hope he dies before movie even starts."
  },
  {
    "rating": "4.5/5",
    "review": "I found this remake better than the original (which is something I rarely say). I understand rejecting your instinct at the risk of coming off rude or impolite; I think most people do that to some extent. I'm so glad the remake gave the victims some bite -- they actually fought back and played relatively smart once they realized they should have trusted the wife's gut all along. That can't be said about the original. James McAvoy and the entire cast were absolutely brilliant. If you want a slow burn with a gut punch and maybe want to hate the victims a bit, watch the original."
  },
  {
    "rating": "1/5",
    "review": "The last 60 minutes are a waste of time. Just watch the 2022 original. It's way better."
  },
  {
    "rating": "4/5",
    "review": "Another good thriller from Blumhouse. No huge surprises but the acting and slow build up make it well worth watching."
  },
  {
    "rating": "2.5/5",
    "review": "The kid being a victim to a sinister couple was supposed to be a twist??? But it was clearly framed that way in the movie trailers to promote the film. This gives the film a very predictable story. To top it off, the main characters take the most illogical actions and mentality, worse than stereotypical horror characters. Movie is definitely not worth the hype."
  },
  {
    "rating": "3.5/5",
    "review": "Predictable for the most part but a solid thriller with great acting throughout!"
  },
  {
    "rating": "4.5/5",
    "review": "Another nail biter, and movie that absolutely pushes the envelope. Definitely recommended."
  },
  {
    "rating": "4/5",
    "review": "Incredibly tense and McCavoy is great"
  },
  {
    "rating": "0.5/5",
    "review": "It's the dumbest movie I've seen, why are these people so stupid? Going back for a stupid stuffed animal??, going up the roof to leave instead of the front door?? And many more scenes that make no sense."
  },
  {
    "rating": "5/5",
    "review": "When it first came out the reviews weren’t great for some reason and the trailer sort of made it seem like a horror but it’s more of a suspense thriller. Nonetheless I gave it a shot and I was very pleased with how good this was! Thoroughly entertaining. Not forced. Keeps you on your toes because you just don’t know where it’s going. Definitely a movie that teaches you a lesson about being a people pleaser and listening to your instinct. I definitely recommend."
  },
  {
    "rating": "4/5",
    "review": "Good decent horror😎"
  },
  {
    "rating": "4/5",
    "review": "Just goes to show that the devil is all in the details. No huge suprises and here and yet, when it's done so cleanly and earnestly - the effect is in full force nontheless."
  },
  {
    "rating": "5/5",
    "review": "James Maccavoy delivers in this intense thriller definitely recommend"
  },
  {
    "rating": "4.5/5",
    "review": "Suspenseful and fun thriller"
  },
  {
    "rating": "0.5/5",
    "review": "Plot relies on the stupidity of the MCs"
  },
  {
    "rating": "0.5/5",
    "review": "Loved it! The funniest film I'd seen in a long time. Why? Because it was a load of crap, and I just had to laugh in pure frustration!! Less frightening than discovering a spider on your ceiling. Totally predictable and not one likeable or sensible character (except maybe the young lad) in what was a poorly written script. How do you sciptwriters get away with this rubbish? Good acting from James McAvoy though ... credit where credit is due."
  },
  {
    "rating": "0.5/5",
    "review": "Rule 1: When they are concerned enough to flee in the early hours of the morning, but then return for a stuffed bunny rabbit, you turn off the movie."
  },
  {
    "rating": "1/5",
    "review": "I wanted the entire family dead within the first half hour. One stupid decision after another is not a set up for suspense. It was like watching Republicans fight out of a wet paper bag for almost two hours."
  },
  {
    "rating": "5/5",
    "review": "Suspenseful well made thriller with great acting all round"
  },
  {
    "rating": "4.5/5",
    "review": "Tense and enjoyable movie. There were light moments that made us laugh. Although I figured out early what the situation was I think James McAvoy brought the evil glint so well and I was along for the ride."
  },
  {
    "rating": "4/5",
    "review": "This horror thriller sucked me in when I knew bad things were about to happen, just didn't know exactly what. Excellent screen play & acting, including the children."
  },
  {
    "rating": "1.5/5",
    "review": "My partner and I spent the entire movie frustrated with the main family being so far beyond stupid it was wild. I would say you can’t make it up but they did. McAvoy tried to hold this movie together though like Toby McGuire’s Spider-Man trying to stop that train. He was for sure the best part. One star for McAvoy (with shoutouts to the young boy too) and the half a star solely for the Cotton Eyed Joe scene. That was the funniest thing I’ve seen in a while I swear to god"
  },
  {
    "rating": "0.5/5",
    "review": "Probably one of the most idiotic people I’ve seen with no survival skills whatsoever."
  },
  {
    "rating": "4/5",
    "review": "James McAvoy killed this role. Very entertaining watch from start to finish!"
  },
  {
    "rating": "3/5",
    "review": "*Speak No Evil* is a masterclass in tension, with an atmosphere so thick you could cut it with a knife. McAvoy, as always, delivers—his presence alone elevates every scene. The slow-burn buildup is psychological thriller gold, making every awkward smile and unspoken word feel like a gut punch. But then… it just plateaus. No shocking twists, no gut-wrenching left turns—just a predictable, drawn-out finale that left me more frustrated than shaken. It’s unsettling, yes, but it plays its cards too early and then just stares at you. Solid, but I wanted more. Three stars for the ride, not the destination."
  },
  {
    "rating": "0.5/5",
    "review": "I don’t understand why people like this movie. I found it incredibly predictable and trite."
  },
  {
    "rating": "3/5",
    "review": "The original was awesome, why remake it 2 years later."
  },
  {
    "rating": "5/5",
    "review": "I love Mcvoy hes a fave so hard not to like his work."
  },
  {
    "rating": "5/5",
    "review": "Excellent. Exciting with good acting."
  },
  {
    "rating": "2.5/5",
    "review": "Saw this in theaters with my buddy. We both immediately got the concept of there is a danger to being timid and not speaking up and avoiding conflict. We kept whispering to each other about the protagonist 'what a wimp' and 'How pathetic'. About half way or so through we both said 'if his family dies it will be totally fitting and his fault' and by the beginning of the actions scenes we both were at the point of 'i hope he gets killed, he deserves to die'. We were investeted in their demise. BUT then the ending seemed to completely abandon it's messaging and remove any consequences. Would have been an outstanding film if the family had died at the end driving home that messaging, but audiences want relief so I get why they did gave us a 'happy ending'. . . The acting however was superb across the board, every single actor, bravo!"
  },
  {
    "rating": "4/5",
    "review": "A good plot and acting, the semantic load, keep you in suspense until the very end. An unpredictable ending."
  },
  {
    "rating": "5/5",
    "review": "James mcavoy is amazing"
  },
  {
    "rating": "5/5",
    "review": "THIS WAS AMAZING I HYPERVENTILATED THE ENTIRE TIME AND MY BOYFRIEND MADE FUN OF ME OH MY GOD WAS IT GOOD ALSO WHO WANTS TO TAKE A TRIP TO ITALY"
  },
  {
    "rating": "4/5",
    "review": "James McAvoy is so talented in psychological, criminal thrillers (like Split as well). His range from Jane Austen and Penelope romances to this is incredible. I also enjoyed the plot of the meek husband who goes along with the friendship putting his family in jeopardy for his own insecure ego."
  },
  {
    "rating": "4/5",
    "review": "Cada actor desempeña a su personaje con la personalidad que se describe, importante en una película donde todo se desenvuelve en una sola locación y la interacción es constante. Desesperante, de cocción lenta. No decepciona y cumple cuando toca hacer climax."
  },
  {
    "rating": "1/5",
    "review": "Why in the world is the audience score so high on this movie? This was so corny and so ridiculous! The only redeeming quality was what happens at the end and that barely makes up for this complete waste of time. All the corny horror movie tropes that are regularly made fun of in commercials are present here in droves"
  },
  {
    "rating": "3/5",
    "review": "Um casal americano de férias na Itália conhece um casa inglês e se tornam amigos. Após as férias, o casal inglês convida o americano a passar um final de semana em sua casa no campo e eles aceitam. Porém, nem tudo parece ser. Remake do filme dinamarquês de 2022, que, infelizmente, ainda não assisti. Então analisarei o filme por suas qualidades e defeitos sem comparar com o original. O tema do filme é o conflito entre a educação, não constranger as outras pessoas, aceitar tudo com educação com o que se pode passar como sinceridade e honestidade, mas muitas vezes podem esconder uma camada de maldade. Qual seria o caminho a seguir: a educação, que pode levar a uma tolerância de tudo que as outras pessoas fazem, para não entrar em conflito, ou ser sincero e honesto, ao ponto de deixar a todos mal? Assim, a família americana se esconde na educação, enquanto a inglesa se liberta na sinceridade ao ponto de constranger. O elenco está muito bem. James McAvoy cria mais um psicopata charmoso, mas sempre com uma verdade na ponta da língua. Muitos que assistiram o filme dinamarquês reclamam que o que era meio nebuloso no original, aqui fica meio declarado. A sensação de perigo está sempre presente, mesmo nos melhores momentos de convivência entre as duas famílias. Aí chega a terceira parte do filme e eles me perdem. O que estava sendo bem construído, com os toques de maldade de McAvoy, vira uma luta pela sobrevivência. E aí temos os excessos típicos de filmes desse estilo. Porém, acho que o filme tem seus fãs e tem mérito para tê-los. Apenas não me conquistou. Espero assistir o original dinamarquês para poder fazer uma análise melhor sobre o remake americano."
  },
  {
    "rating": "1/5",
    "review": "Tiresome, predictable, very long, uninteresting main couple living a boring and unnecessary melodrama. James McAvoy and Aisling Franciosi do well, but when 3 minutes of The Bangles song is the best thing in the whole movie, the feeling of wasted time is inevitable."
  },
  {
    "rating": "3/5",
    "review": "All decent actors, but especially the main guy! Some odd film cutting/editing in a couple parts — oops. Build up too slow. Ending was worth the ride. Had me hopping out of my chair and yelling directions to the characters. LOL."
  },
  {
    "rating": "5/5",
    "review": "James mcavoy is an incredible actor. Great movie"
  },
  {
    "rating": "5/5",
    "review": "Best HORROR movie of 2024. It was actually scary! Please make more movies like this!"
  },
  {
    "rating": "2/5",
    "review": "Boring attempt at suspense that needs you to accept the main players have mental impairments to make them do the dumb things they do. And that, well that just ruins the experience."
  },
  {
    "rating": "4.5/5",
    "review": "Movie is so great 🥰🥰"
  },
  {
    "rating": "3.5/5",
    "review": "The positive overall rating is for the first hour. It holds its own versus the original. Where it falls down is the last 30 minutes and the ending. Watch both and you will understand."
  },
  {
    "rating": "1/5",
    "review": "I hated it. While some suspense movies really catch you for the plot, the interest you grow on the characters and their journey, this movie creates suspense having every single character making terrible dumb choices. The mother, the father (who until the very end does not develop a ball sack) and the daughter which controls the entire family and apparently is ok with a gun on her head but has a panic attack without her plush doll. You don’t develop interest in them but hate. The whole reason for the story to unfold is due to dumb decision after dumb decision from way before the movie even started. The wife shouldn’t have left everything to move to London, the husband shouldn’t have forgiven the betrayal, they shouldn’t have decided to take that weird trip, etc etc. The writings were on the walls. If there’s any lesson from this movie is that dumb decisions will have consequences and the ultimate dumb decision belongs to you for wanting to watch this movie and now you lost 2 hours of your life that you can’t take back. Conclusion: Stay away from this movie."
  },
  {
    "rating": "0.5/5",
    "review": "I had to make an account to leave this review….Jesus Christ this movie sucked, predictable and very stupid situations….holyyyy"
  },
  {
    "rating": "1/5",
    "review": "I made an account to review this movie poorly. Infuriating character decisions. The premise and good and reasonable. but JFC."
  },
  {
    "rating": "4/5",
    "review": "James McAvoy's acting in this movie is superb."
  },
  {
    "rating": "1/5",
    "review": "Not only was it predictable but another movie where the characters make clearly dumb decisions . Just because the acting is good doesn’t make the plot good at all. I wish story lines stopped resorting to the characters making dumb decisions"
  },
  {
    "rating": "2.5/5",
    "review": "This type of thing is usually done worse than it is here, though it’s much longer than it needed to be."
  },
  {
    "rating": "0.5/5",
    "review": "Straight up garbage! How many times did they return to put themselves in danger? It wasn't even suspenseful. Only watch this movie if you enjoy yelling \"MORONS\" every 5 minutes at the screen."
  },
  {
    "rating": "3/5",
    "review": "Nice movie wanted the bad guy to win kinda but you know"
  },
  {
    "rating": "0.5/5",
    "review": "No Parent with kids would ever do what they did. Leaving kid with absolute stranger. Then find her in bed with them, leave and go back for a stupid stuffed animal. Then let her go down a ladder while a killer is chasing them and allow her out of their site lol"
  },
  {
    "rating": "5/5",
    "review": "Very entertaining even though it was far fetched in many instances. I think the villain should win an award for his performance."
  },
  {
    "rating": "3.5/5",
    "review": "Great and had me laughing and very entertained. The third act was meh and dragged on. Still a very good watch."
  },
  {
    "rating": "5/5",
    "review": "Superb edge of the seat movie!"
  },
  {
    "rating": "1/5",
    "review": "The 1 star is for James McAvoy's undeniable talent. But when a family escapes a sociopath's liar, only to return for their TWELVE year old daughter's stuffed animal, that's when I change the channel. I found the film creepy, unrealistic and foolish, and did not finish it. Given it's high rating I'm sure it improved eventually, but I didn't make it that far."
  },
  {
    "rating": "5/5",
    "review": "V good movie, great acting + believeable plot, not crazy crazy plot armour . Recommend!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "3/5",
    "review": "Was as good as a horror movie can get. An actual good movie all the way up to the unavoidable slashing action sequences. Those left a lot to be desired and the story telling really took a downturn. Heard the original was better."
  },
  {
    "rating": "4.5/5",
    "review": "It started out very slow & confusing like why was this considered a horror movie in the first place it's just about a family that is different from every one else inviting this nermel American Family inside there house. But when got to the middle it felt more like a horror movie why they invited them to stay. Definitely after what that man to his Fake son and for that he got what he deserved at the end. God Bless you all."
  },
  {
    "rating": "4.5/5",
    "review": "The movie keeps you on the edge of your seat the entire time. I haven't seen such an excellent thriller in a long time—great acting by all cast and exceptional acting by Jamex McAvoy."
  },
  {
    "rating": "3.5/5",
    "review": "I really was conflicted about how many stars to give this one. For all but the last 15 mins it is brilliant. I haven't seen the Danish original, but having subsequently read about it, I can see that the good stuff is mostly inherited. Then, (a) of course, this version has to have a Hollywood ending; and (b) to facilitate same, all of the deliciously delicate balance of the set-up has to go right out the window. The people you are supposed to root for, even after all is revealed proceed to make the world's dumbest choices. I wanted them all to die. OMG what a let-down. Reminded me of the diabolically changed ending of the Hollywood version of \"The Vanishing.\" Peace out."
  },
  {
    "rating": "5/5",
    "review": "Suspenseful, smart and great acting all around"
  },
  {
    "rating": "4/5",
    "review": "The film follows a family consisting of Louise (Mackenzie Davis), Ben (Scott), and Agnes (Alex West), who, while on vacation, meet another family led by Chiara (Aislinn Franciose) and Dan Hough (Ant). At first, they seem welcoming, but their true sinister intentions soon emerge. Ant tries to warn Agnes about the danger, but since Chiara and James McAvoy have cut his tongue, he struggles to communicate. This tension immerses the audience in the same frustration as the character. With outstanding performances, especially from James McAvoy and Dan Hough, the film delivers an intriguing suspense story, despite some predictable moments. The shocking ending reveals that Ant was kidnapped and that this family had done the same to others before. Overall, it’s a great choice for suspense lovers."
  },
  {
    "rating": "5/5",
    "review": "A remake that was actually worth being done. James McAvoy was the perfect choice to lead this fantastic slow burn horror that keeps the suspense tight right up until the very end."
  },
  {
    "rating": "2/5",
    "review": "this remake doesn't do the european original justice"
  },
  {
    "rating": "5/5",
    "review": "Trippy thriller horror, suspenseful definitely psycho psychological"
  },
  {
    "rating": "1.5/5",
    "review": "It got a star due to the budget. Good camera work, great shots etc. The actual story is \"What is the worst possible next decision for our main character... Alright so they do that.\" Absolute hard pass on this film. I, frankly, almost turned it off..."
  },
  {
    "rating": "4/5",
    "review": "Creates a great sense of unease, good acting performances, but the overall story is pretty predictable and certain character decisions are just silly."
  },
  {
    "rating": "2.5/5",
    "review": "Interesting but kinda predictable"
  },
  {
    "rating": "0.5/5",
    "review": "No common sense This movie is just silly and unbelievable. I was cringing for all the wrong reasons as a father with common sense."
  },
  {
    "rating": "5/5",
    "review": "Honestly one of the better thrillers I’ve seen. Kept me guessing and ending was great. Highly recommend!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Speak No Evil hits early with Nothing Bad Can Happen vibes. While it sits a tier lower than the German movie (94), this American remake of a Danish movie (of the same name) telegraphs the twist early, but remains a solid thriller more interested in action than profundity. In fact, the “never could have our own children” is a well-worn trope, but is forgiven here — you’re in it for the performances and the legitimate concern for the Dalton family (Mackenzie Davis, Scoot McNairy, & Alix West Leffler). This is without a doubt my favorite James McAvoy performance. As Paddy, McAvoy gives a range from charming to menacing to downright sadistic. The most torturous moments emanate from scenes of sheer awkwardness. Apparently, the ending here is stark to that of the original. I plan to check it out after letting this one sit for a little."
  },
  {
    "rating": "4/5",
    "review": "Great film. Super creepy, the anxiety builds throughout and gets uncomfortable before finally breaking into the horror aspect. Mcavoy is incredible once again. Main characters acting coulda been a little better but still holds up, just didn’t love the actors in the family roles."
  },
  {
    "rating": "3.5/5",
    "review": "A typical American washed-out version of most foreign language films. That's not to say it wasn't good, but the original is so much better."
  },
  {
    "rating": "1/5",
    "review": "Nutella father of the family"
  },
  {
    "rating": "4/5",
    "review": "Almost as good as the original (Swedish?) film. And that's saying something."
  },
  {
    "rating": "2/5",
    "review": "This movie lost me when the family made the stupid decision to go back and grab a stuffed animal, because of their stupid annoying duaghter. All the choices this family made were idiotic and they deserved to be in this hellish scenario. Stupid choice after stupid choice, it was ridiculously unbelievable. Interesting premise but executed poorly. The favorable reviews surprise me."
  },
  {
    "rating": "3.5/5",
    "review": "It was a pretty good movie & worth watching. Not really much gore or horrible scenes."
  },
  {
    "rating": "1/5",
    "review": "The characters are unbelievably unrealistic. It was unbearable to watch"
  },
  {
    "rating": "3/5",
    "review": "While Speak No Evil is not a great film, James McEvoy's performance in it is terrific. He is an outstanding actor and manages to be larger than any role he plays. In this thriller he plays a gregarious, bold, and strong minded Physician who befriends a troubled couple while on vacation. The couple, whose roles are well played, are in the midst of economic and martial troubles that leave them, particularly, vulnerable to a new and exciting acquaintance. The movie is a little frustrating at points, but it works. It is a well scripted, well directed, and will paced thriller. Some parts are no believable, but it is a thriller/horror so we understand that going in."
  },
  {
    "rating": "1.5/5",
    "review": "Acting was solid but some of the writing and story line kind of lacked, and they just made really dumb choices that people wouldn’t do in real life which got frustrating to the point of checking how long was left in the movie. Overall not really worth the time."
  },
  {
    "rating": "3/5",
    "review": "Excellent thriller. McAvoy is phenomenal. Does get to a point where you think, \"Come On, Just go!\" but doesn't take too much away from it."
  },
  {
    "rating": "5/5",
    "review": "Fantastic Script; setting, characters and dialogue… Plot (Twists and Turns) and Character Development. James Mcavoy brings together an ensemble cast that thrills and captivates the audience throughout the movie from start to finish. Highly recommend watching this film… 5 STARS"
  },
  {
    "rating": "4.5/5",
    "review": "James McAvoy is perfect for the horror genre, because he delivers a solid and terrifying performance in a story with a slow but engaging development, being a decent remake of the original material."
  },
  {
    "rating": "5/5",
    "review": "James is acting perfection! I was on the edge the whole movie"
  },
  {
    "rating": "2/5",
    "review": "Not a great script, because the victim family made so many idiotic moves that it's annoying. In fact it's annoying from the beginning - such unlikeable people in general. They had a chance to escape that hell hole but because of their spoiled brat they went back to dangerous people then just hung out and stayed. I miss old, good movies."
  },
  {
    "rating": "3.5/5",
    "review": "Speak No Evil stands out as its own gripping factor from the original foreign film, flamed with James McAvoy’s intense performances, as he’s commonly known for in his previous thrillers, keeping audiences on the edge of their seats. The rest of the main cast also delivers solid performances. Grading: B"
  },
  {
    "rating": "5/5",
    "review": "Brilliantly gripping"
  },
  {
    "rating": "3.5/5",
    "review": "A very strong performance from James McAvoy carries this film beyond the riff raff of popcorn horror. Often in horror films we wonder why the heroes make the choices they do. To go into the house that seems haunted or creepy, to linger when they ought to be fleeing, to trust obviously creepy villains. And this film was full of moments like that. The married couple who have a middle-school aged daughter make many bad decisions and it causes us, the audience, to stop caring. But we keep watching to see McAvoy's mesmerizing turn here. His charm hides abusive and psychotic tendencies that gradually reveal themselves throughout the movie and it's very interesting to see just how far he goes into nutsburgers crazytown. And he really goes there. A decent movie if you're looking for a thrill anchored by a strong actor acting strongly!"
  },
  {
    "rating": "3/5",
    "review": "There is an increasing sense of dread juxtaposed with the lush holiday villa and pretty English countryside. However, the viewer's tension is due to (suddenly buff) James McAvoy's menacing performance. It is hard to care about the annoying, stupid, and weak American couple and their weird daughter thanks to their many \"as if\" moments. I wish the writers had given them more likeable qualities. The real horror part of this suspense movie is demonstrated through child abuse and not the \"twist\" that viewers can predict. I couldn't finish watching the original Speak No Evil when it came out in 2022, because it is so much darker than this remake. Knowing that the endings are vastly different, I'm more comfortable with this Hollywood ending, but it could be disappointing to true horror fans."
  },
  {
    "rating": "5/5",
    "review": "I can’t believe anyone would give this a bad review. It was the best thriller I’ve seen in years! It makes you feel so uncomfortable at times and leaves you on the edge of your seat at others. McAvoy is excellent, as is the rest of the cast. Such a fun watch."
  },
  {
    "rating": "3.5/5",
    "review": "cabra de mrd la odie, a ella y su conejo, se q es una peli y q deben ser así pero BASTA, igual es muy buena me gustó mucho jiji el fragmentado es tan buen actor de verdad 😭"
  },
  {
    "rating": "3.5/5",
    "review": "I knew nothing about this film before seeing it and thought it was a decent psychological thriller. McAvoy is at the top of his game here, as per usual, and everyone else, especially the children, had solid performances. Don't know what else to say, really. It's worth a watch, imo."
  },
  {
    "rating": "2.5/5",
    "review": "Yeah, that doesn't work for me. 'Speak No Evil' is well developed, but far from being actually good. As remake is inferior, because discart the social commentary and sensitivity of the original to play like some generic invasion home thriller that is almost worth because of James McAvoy and Mackenzie Davis performances, but that's it, aside from that is a pretty disappointed movie."
  },
  {
    "rating": "3.5/5",
    "review": "A spectacular thriller with incredible acting, the best part was the final act. Rating: 7.0"
  },
  {
    "rating": "2.5/5",
    "review": "Watch the original, this version changes the ending and it ruins the whole idea of the movie."
  },
  {
    "rating": "4/5",
    "review": "Outside of the. I can't believe they made that decision. It was a pretty good movie. I definitely found it engaging."
  },
  {
    "rating": "4/5",
    "review": "awesome flick, has its stupid moments, but James' performance alone is worth a watch."
  },
  {
    "rating": "3.5/5",
    "review": "great film, causes a lot of anxiety, is a movie uncomfortable to see but I liked it very much, a different proposal, something predictable but exciting."
  },
  {
    "rating": "1/5",
    "review": "Boring predictable, not sure why it has so high score"
  },
  {
    "rating": "3.5/5",
    "review": "The best line of the movie was delivered at a time that made the significance of it, underwhelming.. Lesson of the movie: “no new friends” - drake"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was terrible. No suspense, figured out the plot 30 minutes in only for the “action” to be the last 20 minutes. Waste of James McEvoy’s talent."
  },
  {
    "rating": "1/5",
    "review": "Absolutely baffled by these good reviews. Those who call it “scary” don’t understand what that means. Not a thriller. The entire movie was pointless, don’t waste your time."
  },
  {
    "rating": "5/5",
    "review": "Best movie I have seen in so long. James McAvoy was fabulous, great actor. Don’t like full on Horror movies, but this was just on the edge and you can really feel for the characters."
  },
  {
    "rating": "4.5/5",
    "review": "Pretty much spoiler warning. As a film, I honestly wouldn’t say that this remake is better than the original. I would say how every that I personally prefer this one. This original is executed perfectly, but it’s honestly one of the most depressing movies I’ve ever seen. I understand that’s supposed to be the impact and I respect it, but it’s sad. Like really sad. This one has a happy ending. Still cried, but for different reasons. I’m glad they made this, everyone did a great job."
  },
  {
    "rating": "3.5/5",
    "review": "James McAvoy was excellent and the best part, the ending was alot different and give the couple more backbone and gave it the more happy ending as opposed to the bleak depressing ending of the original which I actually preferred and I preferred the original movie overall to this however this was a very good interpretation"
  },
  {
    "rating": "2/5",
    "review": "Speak No Evil highlights the pitfalls of remaking a film without capturing its original essence. While The Guests masterfully balances tension and discomfort, using cultural subtleties and emotional restraint to create an atmosphere of dread, Speak No Evil comes across as a less sophisticated imitation that overindulges in brutality and shock value. In essence, while The Guests is a masterclass in restrained psychological horror, Speak No Evil feels like an attempt to replicate its success without understanding the subtlety and cultural context that made the original work."
  },
  {
    "rating": "5/5",
    "review": "Very good scary movie"
  },
  {
    "rating": "4/5",
    "review": "One of those movies where you feel like you want to get in the television and throw hands"
  },
  {
    "rating": "0.5/5",
    "review": "The main couple are insufferable. They lack chemistry. I get they are supposed to have marriage issues. The lack of chemistry comes across as a deeper issue than that. There’s a point of no return in the film that actually caused me to shut it off. I could not believe that knowing what they knew they would chose to return. It’s boring, and predictable. The one highlight: James McAvoy looking fine as hell shirtless. His acting was the only highlight for me until I turned it off."
  },
  {
    "rating": "2.5/5",
    "review": "It’s all right and definitely not scary. Starts good so keep you watching but the boys acting is terrible and how he is incorporated . The behavior during the movie doesn’t justify the plot"
  },
  {
    "rating": "1/5",
    "review": "If you don’t watch or read any thrillers and want to delve into genre then this film would be good. Otherwise it is a waste of time. Within minutes of the film you already know what will happen. There is a “tense” atmosphere at moments but that is the extent beyond some cheap thrills and violence. Waste of time."
  },
  {
    "rating": "4/5",
    "review": "Speak No Evil is an unsettling horror that explores the dangers of social niceties and human psychology. James McAvoy delivers a chilling performance, embodying a character that is both charming and menacing. The build-up of tension allows the audience to feel the mounting dread. As a thought-provoking addition to the horror genre, just remember, sometimes it's better to keep your thoughts to yourself."
  },
  {
    "rating": "0.5/5",
    "review": "The best way to describe this is film is flat and lame…it never really brings you in to care for the main characters well being as they go on this trip. As well as making a bunch of odd choices with the storyline and plot, I feel I could have wrote a better plot for this film to follow. Very unfortunate cause this film had a lot of potential but never met it…"
  },
  {
    "rating": "4/5",
    "review": "Personal opinion: watch anything with McAvoy in it."
  },
  {
    "rating": "4/5",
    "review": "As a fan of the original I can say this is an improved version. McAvoy was sensationally sinister. He got the balance right between being disarmingly charming to frightening in a blink of an eye. The remake improves on fleshing out the characters, in particular giving the kids an important role. I preferred this ending, makes it much less macabre and nihilistic and opts for more thrills and excitement for US audiences. It got a bit Rambo-esque at the end which made it a bit less intense. But in general, a very good watch and one of the best films of the year."
  },
  {
    "rating": "3.5/5",
    "review": "A predictable movie from start to finish, yet it manages to hold our attention by skillfully building tension, which drives the main characters toward a series of poor decisions. The cast delivers strong performances, with James McAvoy standing out in particular."
  },
  {
    "rating": "0.5/5",
    "review": "One of those movies that the \"good guys\" are so incredibly stupid and incompetent with absolutely no survival skills... That you start to route for the \"bad guy\" to just kill them all for always making the dumbest choices possible when given an opportunity to escape. I can't honestly believe that anyone with a brain in their head would think this nonsense was actually a good film."
  },
  {
    "rating": "2/5",
    "review": "It's a well-made movie, but the first 90 minutes are just boring and don't feel thrilling. It was very predictable. It doesn't qualify as a horror movie and is just a mediocre thriller. If you're looking for more action, look for another movie. I didn't enjoy it."
  },
  {
    "rating": "4/5",
    "review": "For some reason, I like when James McAvoy plays the bad guy. I've also been scrutinizing movies a bit more, and here there were some things that just didn't make sense realistically, or maybe I should sympathize more with the characters in their fight or flight moments."
  },
  {
    "rating": "3/5",
    "review": "Builds up well, with a sense of dread as the family visits their new friends. But the last section drifts into familiar cat-and-mouse territory as the nice guy becomes evil and the timid victims find new-found strength to commit violence to protect themselves and family. Nothing new, but entertaining. The kids are good."
  },
  {
    "rating": "5/5",
    "review": "Great version of speak no evil, best thriller I’ve seen in a long time"
  },
  {
    "rating": "2/5",
    "review": "This movie was just and hour and half of boredom to get to the meat of the story."
  },
  {
    "rating": "4.5/5",
    "review": "\"Speak No Evil\" presents a compelling narrative with strong performances, effectively delivering psychological horror that resonates."
  },
  {
    "rating": "1/5",
    "review": "Not very much of a horror movie. Doesn’t really get kinda scary until the end and a lot of lame sex jokes"
  },
  {
    "rating": "1.5/5",
    "review": "You knew what was going to happen and pretty much how the whole time and they just kept dragging it out and dragging it out and dragging it out to get to the end. Watching this movie actually pissed me off. So predictable and so boring. Lost a lot of respect for James McAvoy"
  },
  {
    "rating": "1/5",
    "review": "This movie sucked. It just did. The husband was a complete idiot and his decisions would never happen in real life."
  },
  {
    "rating": "1/5",
    "review": "This movie makes no sense, nonsensical characters that take outlandish actions (and accents, as says the gf,) poorly developed plot, and and an air of smug/undeserved accomplishment at the end of this train wreck. Was only going to give it a half star but adding an extra half because James McAvoy is pretty beefy; good job bro!"
  },
  {
    "rating": "1/5",
    "review": "It was a good movie but the husband was a dumbass. The wife kept sensing something was wrong. I love the fact that the boy kept trying warn them. The husband was dumb."
  },
  {
    "rating": "3.5/5",
    "review": "James McAvoy doesn’t get enough credit. Movie had me on my toes which is good."
  },
  {
    "rating": "0.5/5",
    "review": "I’ve never been so frustrated watching a movie. So many stupid decisions to keep the movie going."
  },
  {
    "rating": "5/5",
    "review": "A refreshingly well-structured work, entertaining, not unnecessarily bloody, gut-wrenching, but brilliant social criticism, about today's hypersensitive, alienated, impressionable average person and the evil that will always be among us..."
  },
  {
    "rating": "3/5",
    "review": "What started as a run of the mill horror flick, not only managed to subvert my expectations, but by the end of the film - it actually even managed to pull an audible gasp out of me. While there do happen to be quite a few horror cliches and a concept that borders the slightly derivative - James McAvoy’s performance is nothing short of remarkable (as we’ve come to expect). The tension is palpable, the acting is phenomenal, yet sadly there IS more left to be desired in the story and the logic department. Overall, I enjoyed it and would recommend."
  },
  {
    "rating": "1/5",
    "review": "This movie is utterly predictable and unfortunately built on a premise that any family would be so idiotic as to do what this family does - go stay in an untterly remote part of the countryside with what are essentially strangers for a week, experieicning multiple instances of massive weirdness everyday to just write it all off as no big deal. Never would a parent put their child in such a predicament, let alone endure it day after day without leaving absolutely immediately. The father is written as the weakest of people, the mother as seemingly smart and ardent but then also completely willing to \"go along to get along\", particularly after the first time they try to leave. There had to be seven different times when any reasonable people would've picked up and left. The saving grace in this movie is McAvoy, who does an excellent job of vaciliating from gregarious stranger to complete psychopath during the entire movie. He does go a bit over the top, particularly toward the end, but that's clearly done on purpose. He's the reason this movie got any stars at all. Skip this one for sure."
  },
  {
    "rating": "5/5",
    "review": "I had no expectations or knowledge of the film. It is a great thriller/horror film reminiscent of the early 00s, good fun time. Metaphors in the film make it more than a superficial horror film that produces commentary to modern social expectations and societal structures of family."
  },
  {
    "rating": "5/5",
    "review": "It was good. Kept me on the edge of my seat!"
  },
  {
    "rating": "4.5/5",
    "review": "I actually think I might prefer this to the original, just because of how terrifying James McAvoy was. He was totally believable"
  },
  {
    "rating": "5/5",
    "review": "This is the most f*ed up movie I’ve seen in my life"
  },
  {
    "rating": "1/5",
    "review": "Where to begin, yes Mcavoy was great. At least he had the normal behavior of a psycho. The Dad was a wimp, the daughter the smart one, however took her too long to figure out the obvious and the Mom did her best Terminator role. Did these people ever see Straw dogs? Just one misstep after another and dragged their conversations with the killers on and on way too long. And the Mom is then shocked when Ant takes out his revenge!! Take a pass on this one"
  },
  {
    "rating": "4/5",
    "review": "Chilling remake. McAvoy is great. Suspenseful as anyone could hopeful with twists galore. Slow burn off the top but alls bad that ends bad"
  },
  {
    "rating": "4/5",
    "review": "Haven't seen the original, but I will definitely check it out now. Thought it was great. McAvoy was great at being charming and creepy at the same time. Definitely an intentional gender role reversal with the visiting couple. Ending was good, but a well done lead up to it made the movie."
  },
  {
    "rating": "5/5",
    "review": "This is one of best movies of 2024. James mcavoy does a great job at being weird and a bad guy. The other actors did a great job at acting the twist is really cool. Watch it great movie."
  },
  {
    "rating": "4.5/5",
    "review": "This is a great thriller. I haven't seen the original Danish version, so I can't make any comparisons, which I think is good, because it allows me to give an objective score. Great acting, smart dialogue and very suspensful situations. I can't give it the full five stars because of a certain moment where certain characters make a dumb decision, but that's generic Hollywood suspension of disbelief I guess. Overall a great, engaging thriller. Highly recommended!"
  },
  {
    "rating": "5/5",
    "review": "Me and my husband just watched it. Both thought it was so good!! Acting is fantastic and we were on the edge of our seats thru most of the movie. Best horror movie in a while. Great job!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie is soooo stoopid. If you like yelling at the TV telling idiots to first leave the damn bunny and then to pick up one of the guns on the ground and shoot the psychos, this is the movie for you. Wow, if the parents actually did get killed by the guy, it prob would have been justified as a thinning of the herd. Ugh."
  },
  {
    "rating": "3.5/5",
    "review": "A fairly slow burn that has a lot of good tension that leads to a fairly satisfying ending. James McAvoy plays a fantastic bad guy, looks menacing, and is absolutely jacked. Good acting, just dragged a bit in the middle and the final action scene didn’t feel worth the wait. While the final scene does break with some tropes, it ultimately has my worst pet peeve where the victim gets the upper hand multiple times and just run away instead of ending things."
  },
  {
    "rating": "1/5",
    "review": "I TOO, have created an account On Rotten Tomatoes just to condemn this movie. The director is highly skilled at creating tension and awkwardness. Imagine a movie that uses EVERY trick in the book to create tension and awkwardness, but then has no substantial plot to back it up. I dont think this is a 'Girl Power' movie because event the girls in the film are fumbling goofballs. I was throwing the remote at the television. Really bad. I was blown away that they make movies like this still"
  },
  {
    "rating": "3.5/5",
    "review": "Disturbing and engaging till end but I found that the runtime felt too long. Rating: 7.4/10"
  },
  {
    "rating": "4/5",
    "review": "As usual James McAvoy does not disappoint! Loved the movie, great acting especially Dan Hough the young man. I thought he did a outstanding job."
  },
  {
    "rating": "3.5/5",
    "review": "Professor X went crazy in this"
  },
  {
    "rating": "1/5",
    "review": "Stupid family...easily manipulated...dad is soft... mom is dumb..daughter needs help"
  },
  {
    "rating": "2/5",
    "review": "Pretty boring and dry. Definitely not suspenseful. Not a bad movie to use as background noise as your watching reels though."
  },
  {
    "rating": "3/5",
    "review": "Has there been a character less capable of survival then this dad? I get how the little boy feels. My dad used to throw things at me when my timing was off during impromptu dance recitals."
  },
  {
    "rating": "3.5/5",
    "review": "James McAvoy’s performance is stellar as always. It was entertaining enough, but the movie could have been edited down a bit to make it a tight 90 and would have been so much better. I liked it but probably wouldn’t watch it again. Also I read the plot for the original and while it had a more brutal ending, it actually sounded like a better ending than this one."
  },
  {
    "rating": "3/5",
    "review": "Has a good central performance but absolutely wears out its welcome and its premise before its climax."
  },
  {
    "rating": "3/5",
    "review": "So, for a movie that came out in 2024, this was a triumph as there were a lot of flops. Now, for the story. You know there is something off right away, and James McAvoy plays that part well. He's convincing and dark. However, this is where the movie starts to falter after they leave the family vacation. The story becomes entirely 100% predictable with every cliché you've ever seen take place. Invite to a place in the middle of nowhere, no cell service or other people around, shady conversations, you think it, and it's all there. Now the characters, they all suck. Weak Dad, Horrible Wife, & Daughter who won't grow up. This family is a mess, and any normal family would have seen the red flags 5 minutes in. There's only 1 person worth saving in this whole film. It's very strange writing to make the characters you want to root for all be weak. The movie then plays out as expected. Like I said at the start, for 2024, this was a success, and I did find parts I enjoyed. Is it rewatchable? Probably not."
  },
  {
    "rating": "4.5/5",
    "review": "Very enjoyable and keeps you engaged. Builds up the suspense but is quite predictable."
  },
  {
    "rating": "4/5",
    "review": "This was a good movie I really liked it a lot and I felt like the story was really really good but I do think it was a little predictable. That doesn’t take away how great this movie was and how good the story was either."
  },
  {
    "rating": "1/5",
    "review": "I heard once that the worst thing you can say about a story is that you don't care about the characters. This is worse. I actively despise every single character in this film. They repeatedly and consistently fail to accomplish even the most basic of interactions or critical thought. Chekov's stuffed rabbit appeared within the first few scenes. Gee, I wonder if that will be important later. Yes, the bad guy is manipulative, but the second you've realized he's evil, no normal person would continue to be manipulated by them. Stop being polite and leave you absolute waste of air. I wanted a meteor to strike the house and eliminate every last irritating one of them."
  },
  {
    "rating": "3.5/5",
    "review": "A watered down Americanized remake. Great acting & easier to swallow but it doesn’t hit the same. The social horror is suspenseful & uncomfortable with some strangely funny moments thanks to McAvoy. Yet an unnecessary film."
  },
  {
    "rating": "4.5/5",
    "review": "Awesome thriller...some predictability but definitely a really good watch...at least the victims are smart"
  },
  {
    "rating": "3/5",
    "review": "A solid routine that plays it safe but does it well."
  },
  {
    "rating": "2/5",
    "review": "I guess this director/ writer thinks the way to get positive reviews from a female audience is to make the husband as useless and pathetic as possible? If that part of the movie wasn't so deliberate it would be a somewhat passable film otherwise."
  },
  {
    "rating": "3/5",
    "review": "James McAvoy is the reason I watched this. He is a Great actor & this role was no exception. With that said, the movie was only okay. Way too annoying, & the husband.....ugh, what a Putz. The mom was the one who had to take care of business."
  },
  {
    "rating": "0.5/5",
    "review": "If it wasn’t for the kids, I’d say everyone just deserved to die. So many unbelievable parts in this movie that go against all parental instincts. I couldn’t suspend belief enough to think this situation was even plausible. James McAvoy was great, and the kids, but everyone else is too stupid to live. Give them all the Darwin Award. This movie isn’t scary, it’s stressful. And not stressful because you’re worried, but because you’re so pissed at how dumb the parents are. If you enjoy yelling at the TV than this movie is for you. But you can get the same satisfaction from watching idiots on the news. It’ll leave you hating everyone."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is so effectively creepy and terrifying"
  },
  {
    "rating": "3/5",
    "review": "American family living in London meet another family on Italy and get invited to a vacation on their remote UK cottage only to find out a dark secret. James McCoy stars on this Blumhouse thriller and let me tell you. He is jacked. Characters is intense. It keeps your anxiety level up by the way this guys gets on everyone’s business. Good survival thriller even though the set the scene part is slow and too much. Could’ve been a 30 minute movie instead 🍿🍿🍿/5 on peacock"
  },
  {
    "rating": "3.5/5",
    "review": "Enjoyable movie. Ending of the original is so much better"
  },
  {
    "rating": "0.5/5",
    "review": "Irritating to have so many opportunities to evade problems and not take them. If you have a worthless, weak husband this movie is for you. Made an account because I hate this movie so much"
  },
  {
    "rating": "0.5/5",
    "review": "I have shat more interesting turds and signed up RT just to write this."
  },
  {
    "rating": "3/5",
    "review": "A very well made movie, with a good script and good performances. James McAvoy is a guarantee in what he does. I understand that it's a remake, I have to look for the original to see it. But at first, I recommend it, you will have a good time watching it. It is not a movie that has great emotions but it does have the suspense and mystery just enough for you to stay attentive to the screen."
  },
  {
    "rating": "3.5/5",
    "review": "McAvoy ate this up. Good tension though suffers from one or two \"normal people would NEVER do this scenarios\" that is critical to the plot."
  },
  {
    "rating": "0.5/5",
    "review": "horrible horrible movie. the content that is. other than that, intense thrill ride with mcavoy a super psycho. seen the dutch version. was sick in my stomach for a month. it was filth. the makers of that movie should all be in prison. absolute filth. people who enjoy movies about kids being tortured, really have no place in society."
  },
  {
    "rating": "2/5",
    "review": "A movie about a family that makes stupid decision after stupid decision. Predictable and kind of boring."
  },
  {
    "rating": "4.5/5",
    "review": "Okay, this movie was beyond creepy. I was so confused at first, James McAvoy is such a great actor in thriller movies, I won't lie he was making me mad in that dance scene with ANT and Agnes!!. Ant at the end damn he let that anger out and I felt so bad for him, I am happy he was all good!."
  },
  {
    "rating": "3.5/5",
    "review": "OH AGONIA DO KRL VIU"
  },
  {
    "rating": "4.5/5",
    "review": "Frustratingly fabulous movie. The couple from London was infuriating, leaving me wanting to reach through the screen and punch them. Love the strong woman aspect as well. Mcavoy was amazing and creepy. Definitely recommend!"
  },
  {
    "rating": "1/5",
    "review": "What a complete waste of time. So typical of Hollywood, to miss the entire point of the original and have it end with a girlboss taking charge. If it wasn't for James McAvoy, it would have been a total stinker."
  },
  {
    "rating": "4/5",
    "review": "Disturbing is what comes to mind after watching this movie. It’s not necessarily scary just creepy AF. Overall it was very good."
  },
  {
    "rating": "5/5",
    "review": "I'm so glad I watched this movie. It had a unique storyline for once. The movie a lil started slow, but if you can get past the first half hour, it's a winner."
  },
  {
    "rating": "3.5/5",
    "review": "Speak No Evil is a wickedly suspenseful thriller. It’s the kind of film you constantly find yourself yelling at the screen for the protagonist family to get the heck out of the situation they find themselves in, but one plausible explanation after another ends up pulling them back in. It’s not the usual home invasion thriller, although there are echoes of the film Funny Games in the plot. Instead, it all plays out more like a psychological thriller before things become unhinged in the final act. James MacAvoy is a tour de force of charisma and creep. If you’re looking for a movie with some twists and turns and a whole lot of mind games, this is one to see."
  },
  {
    "rating": "0.5/5",
    "review": "An inferior remake of a 2022 movie, where instead of providing a thought-provoking conclusion in theme with the rest of the movie, there's a 20 minute girlboss spree at the end."
  },
  {
    "rating": "4/5",
    "review": "The movie did what it was supposed to do piss me off and make me enjoy the movie lol. It was great 😊"
  },
  {
    "rating": "0.5/5",
    "review": "The original was actually dark and thought provoking, vs. This one being......girl boss"
  },
  {
    "rating": "1/5",
    "review": "Competently made, and James McAvoy was good, but they conventionalized everything that made the original so unique, and added a Hollywood ending. Seems like it was just made for money."
  },
  {
    "rating": "3/5",
    "review": "37 minutes in the beginning of the movie were so boring and near end it gets better, but very predictable."
  },
  {
    "rating": "5/5",
    "review": "James Mcavoy…..Oscar Contender!!!"
  },
  {
    "rating": "4/5",
    "review": "Suspenseful, but I couldn't stand the pussy dad."
  },
  {
    "rating": "3.5/5",
    "review": "A little predictable"
  },
  {
    "rating": "5/5",
    "review": "James Mcavoy is extremely underated and stellar as always. So uncomfortable, a ton of cringe moments. I think better than the original. Nice satisfying ending."
  },
  {
    "rating": "4/5",
    "review": "I was hesitant about watching this one. It's a remake of the Danish thriller Speak No Evil, which came out just two years ago and holds the title of the creepiest and scariest film I’ve ever seen. As a horror fan always seeking a challenge, the original Speak No Evil left an indelible mark on me—not because it was traditionally scary, but because of its sheer realism and how relatable the characters felt. Having loved the original and considering it one of my favorite horror films, I was skeptical about the remake. The only reason I decided to give it a chance was the stellar cast, especially James McAvoy, whose portrayal of the antagonist intrigued me. The first half of the film genuinely surprised me, delivering a deeply unsettling and gripping psychological thriller much like the original. It masterfully delves into themes of fear, guilt, and moral dilemmas, with a narrative that steadily builds tension and suspense. Its slow-burn approach creates a truly immersive experience, where every interaction feels loaded with hidden menace. I was filled with respect for how it honored the original while, in some instances, offering even more terrifying portrayals that outshone the first film. This is where my fears about the film were realized. The \"Americanization\" began to shine through, stripping away the darkness and ambiguity that made the original so compelling. As the film progressed, it started unraveling, answering too many of the questions that made the original so haunting. In my eyes, the sheer terror created by the unseen and the unexplained was what made the original a masterpiece. Unfortunately, the final 20 minutes devolve into a typical Hollywood horror movie with a somewhat happy ending—a stark departure from the bleak, twisted conclusion of the original. The cheesiness set in like an American hamburger, turning what could have been a dark and faithful adaptation into just another formulaic horror flick. This departure from the elegance of its first half ultimately left the film feeling like a mishmash, ordinary rather than great. The acting was phenomenal, with James McAvoy delivering a truly terrifying and maniacal performance as Paddy. His portrayal is packed with emotional depth and nuance, seamlessly shifting between vulnerability and intense menace, making his character both raw and complex. The minor in the film. Dan Hough's performance as Ant is compelling and memorable and one that I think does better for me than the original, the character seems to have more screentime resulting in him being much more relatable to the viewer as compared to the original . The cinematography and grainy picture quality added a distinct edge to the film, enhancing its realism and amplifying its unsettling atmosphere. The slow, deliberate shots and meticulously designed sets contributed to the overall discomfort, grounding the story in a sense of authenticity. While some moments felt slightly over-engineered, the sets consistently upheld the film's overarching vibe, complementing its eerie tone effectively. For me, the American remake of Speak No Evil starts off strong, capturing the unsettling vibe of the original with a gripping first half and stellar performances—especially from James McAvoy. But it loses steam in the final act, swapping the haunting ambiguity of the Danish film for a typical Hollywood ending. While it’s still a decent watch with solid cinematography, it doesn’t quite live up to the dark brilliance of the original and doesn’t compare to what I considered one of the scariest films I’ve ever seen. 8/10"
  },
  {
    "rating": "5/5",
    "review": "Good movies ! I just watch on Peacock! super love it ! James nailed the character a crazy psycho man that fit him very well! Highly recommended!"
  },
  {
    "rating": "4/5",
    "review": "Definitely worth watching, terrifying story about meeting strangers. Then all Hell breaks loose. It is a re-make of a Danish-Ditch film in 2022. Both are good movies. Good performances all around in both movies. ~IMO"
  },
  {
    "rating": "0.5/5",
    "review": "I have got to say this movie absolutely frustrated me to no end. What everyone says about “suspenseful buildup” being a “good characteristic” of this movie, are absolutely copiumed out on this director, crew or something. The insanity of thinking any of this is normal behavior or realistic situations that could have happened is asinine to believe they would actually happen. Nothing makes any sense in any possible way. Don’t watch this movie it is not worth it to get this angry for wasting your time."
  },
  {
    "rating": "1/5",
    "review": "Great acting, as expected. Way too predictable, though. Waste of time (because you can figure out the ending within 30 minutes into it)."
  },
  {
    "rating": "1/5",
    "review": "15 minutes in and an overly cautious mom who doesn't let her 11-year-old daughter have two desserts in a day lets a strange man she met one minute ago take her daughter away on a Vespa in a foreign country. Then they spent the entire weekend with a family they went to dinner with once to get a \"change of scenery\" after JUST coming back from vacation. It just gets worse from there, like take down the enemy and he drops his gun and you don't take it. Or you put a sharp object in your jeans pocket for no reason at all and then squat... why? Why would you put a sharp object in your pocket if your hands were completely free? No human being would excuse this many red flags. They would have just said \"we need to go, we have a family emergency\" and left. They wouldn't have sat around chit-chatting and excusing psychotic behavior. It's such an insult to the audience to create characters with no intelligence or survival instincts."
  },
  {
    "rating": "5/5",
    "review": "The People Under the Stairs - reimagined"
  },
  {
    "rating": "4/5",
    "review": "James McAvoy is a A+ actor"
  },
  {
    "rating": "1.5/5",
    "review": "It's just such a typical horror movie ending and if you have watched more than 3 horror movies you will know how it will end. Would of loved it went the other way and really shocked the audience more."
  },
  {
    "rating": "4.5/5",
    "review": "A well done thriller!"
  },
  {
    "rating": "3.5/5",
    "review": "It's a good suspense film, good story, good acting, and with a lot of tension, but the film would be better if it didn't have many clichés and inconsistencies."
  },
  {
    "rating": "3/5",
    "review": "I saw the original \"Speak No Evil\" - the Dutch movie, then saw this one. I prefer the Dutch version. America tends to remake foreign movies so they have a happy ending rather than a dark or disturbing ending. This is exactly what they did here. It's too bad because the acting is good. See the original and you'll see what I mean."
  },
  {
    "rating": "1/5",
    "review": "Skip this one and watch the much better original. This one was way too sanitized for snowflake Americans."
  },
  {
    "rating": "4/5",
    "review": "James Watkins is known for crafting gripping, suspenseful narratives, and pairing that with James McAvoy's dynamic acting makes for a powerful combination. McAvoy's ability to embody a dark and complex villain adds depth to any story, and it seems like his performance here truly shined. If you don't mind sharing, which movie is this review for? It sounds like something I'd love to dive into more!"
  },
  {
    "rating": "5/5",
    "review": "There is satisfaction at the movie which you’ll find out once you watch it, it’s not scary. It’s suspenseful and quite f’d up when you find a pivotal scene of why the boy can’t speak"
  },
  {
    "rating": "1.5/5",
    "review": "It was well acted but quite slow. Characters actions are questionable and at times ridiculous. Overall very disappointing."
  },
  {
    "rating": "3.5/5",
    "review": "Better than I expected. Definitely frightening. If that's your thing I recommend this movie."
  },
  {
    "rating": "3.5/5",
    "review": "Slow burn. Good movie."
  },
  {
    "rating": "2.5/5",
    "review": "Typical white ppl horror movie cause ain't no way I have those many red flags of a family and still stay there and put my family in danger. I shook my head so many times while watching this movie and was like why want they just leave to the end of it being like yep just as I thought 🤦🏾‍♀️ ...great actors bad plot with no twist just yea I Figured that would happen giving they were so stupid in the beginning...Blumhouse I love your movies as always this was a 4 out of 10"
  },
  {
    "rating": "4.5/5",
    "review": "2024's 'Speak No Evil' is probably the years' best grounded horror film. SYNOPSIS: 'A family is invited to spend a whole weekend in a lonely home in the countryside, but as the weekend progresses, they realize that a dark side lies within the family who invited them.' Often remakes of European horror films lose something from the original material and fade into nothingness. But that's not the case here. There's no 'been there, done that' here as James McAvoy absolutely excels in this role and literally holds nothing back. His gritty and unhinged performance is completely mesmerising and overall makes this film something very special. It's 'real', it could happen. 'Speak No Evil' is a twisted, suspenseful experience that keeps you engaged despite being a slow burn of a movie. This is a psychological thriller that lies in wait for its audience, and when you least suspect it, it goes in for the kill. Exceptional. 9/10"
  },
  {
    "rating": "4/5",
    "review": "thrilling, great story"
  },
  {
    "rating": "2/5",
    "review": "I've spent an hour cringing at all flaws that were meant to humanize the protagonists and make them relatable, thinking how is it legal to be this stupid, how were they allowed to get married and raise a child so poorly, how many red flags do they need, before they leave?! Then the movie turns into home alone, but instead of humor they have guns, and McAvoy decides he needs a shower in the middle of it all, he can't save this movie despite his best efforts."
  },
  {
    "rating": "3.5/5",
    "review": "James McAvoy is a beast!"
  },
  {
    "rating": "2/5",
    "review": "Hilariously bad! totally a huge flaw!"
  },
  {
    "rating": "4/5",
    "review": "This is a very well made horror/ thriller film. Definitely creepy and will give a good scare at times. The moment of realisation in the film is really good. I was surprised and excited for what would happen next. The actors did an amazing job with this film as well as everyone in involved. Recommended for anyone."
  },
  {
    "rating": "5/5",
    "review": "such a thriller well put together"
  },
  {
    "rating": "1.5/5",
    "review": "Really mediocre movie. McAvoy tries way too hard, and there are so many unbelievable plot points it’s hard to not be annoyed watching it."
  },
  {
    "rating": "2/5",
    "review": "Odd movie. Action sequences in the end were comedic."
  },
  {
    "rating": "2.5/5",
    "review": "Unnecessary remake of a superior foreign film"
  },
  {
    "rating": "1/5",
    "review": "Totally predictable from the start to its illogical and ludicrous finish. Good luck not reaching for the remote - McAvoy's performance is wasted."
  },
  {
    "rating": "3.5/5",
    "review": "What made the original good is how uneasy it made me feel nearly the entire time and then the ending which left me angry. This film gives you the uneasy feeling and James McAvoy is awesome but it completely changes the ending in a way that may leave audiences feeling better but leaves the ending in the original was almost the story. It's almost as if I'd like to see the original with McAvoy in the lead even though the guy who had his role in the original was good."
  },
  {
    "rating": "4/5",
    "review": "Speak No Evil: When Politeness Becomes Deadly! In an era where horror films often rush to shock without substance, “Speak No Evil” stands apart by playing a more sophisticated game with its audience. Director James Watkins knows we see the threat coming – that’s part of his strategy. Like a cat toying with a mouse, he lets us watch his characters walk into an obvious trap, making us willing participants in their downfall. The setup might seem familiar: Ben and Louise Dalton, Americans living in London and struggling with marital issues, decide to take a much-needed break with their 12-year-old daughter, Agnes, at a beautiful Italian resort. Ben, dealing with the sting of a recent job demotion, hopes the trip will bring some relief. At the resort, they meet Paddy, a charismatic English doctor with an overly friendly, almost alarming demeanor, along with his intense wife, Ciara, and their young son, Ant, who has a distinctive speech impediment due to a malformed tongue. What starts as casual vacation friendship takes an unexpected turn when Paddy extends an invitation to their countryside home in England. When the Daltons return to London, they’re surprised to receive a follow-up letter from Paddy, insisting they visit. With their marriage showing cracks and hoping a weekend getaway might help, Ben convinces Louise to accept. The idyllic English countryside setting soon becomes a backdrop for mounting psychological tension as the Daltons find themselves caught in an increasingly uncomfortable situation. What begins as mere social awkwardness gradually transforms into something far more sinister, forcing Ben and Louise to confront not only their hosts’ true intentions but also their own inability to break free from the constraints of social politeness – even when their survival instincts are screaming at them to run. As their weekend retreat spirals into a psychological nightmare, the Daltons must decide how much social courtesy is worth when the cost might be their lives. Watkins takes unusual care in crafting his characters’ backgrounds. Unlike the current trend of horror films with one-dimensional characters, here the characters get a proper backstory. Ben’s recent job demotion, Louise’s suppressed frustrations, even minor characters receive careful attention. Some might call this excessive, but it serves a crucial purpose: making their inevitable doom more than just a horror movie payoff – it becomes a tragedy we’re invested in. Mackenzie Davis brings remarkable depth to Louise, portraying her with a humble, genuine touch that feels instantly relatable to viewers. Her performance captures a woman caught between her instincts and the social conventions that keep her in increasingly uncomfortable situations. Davis conveys a subtle awareness of the danger around her, yet her character is restrained by the same unspoken rules that bind many people in real life. Scoot McNairy, as Ben, nails the role of the passive husband who avoids conflict at all costs, creating tension as his desire to escape confrontation leaves his family vulnerable. James McAvoy’s Paddy, meanwhile, is not just a typical antagonist—he’s a predator who is skillfully preying his way into his victims’ lives with unsettling ease. McAvoy’s portrayal of Paddy adds layers of menace to the film, showing a character who understands the impact of silent social. The horror here works on multiple levels. Yes, there’s the surface threat of strange people with unclear intentions, but the deeper terror comes from watching social pressure become a prison. Every polite laugh, every swallowed objection, every moment of silence where someone should speak up but doesn’t – these are the real horror elements, made more powerful because we recognize them from our own lives. As the film progresses, Watkins maintains suspense through careful pacing and subtle escalation. Unlike many contemporary horror films that rely on jump scares and gore, “Speak No Evil” builds its dread through the accumulation of small violations of social norms. Each transgression is just slight enough that objecting would seem ruder than the offense itself – a masterful representation of how social pressure can trap us. The third act’s violent eruption might seem jarring to viewers who expected the psychological chess game to maintain its subtle dance until the end. Some critics argue that abandoning the film’s careful exploration of social dynamics for more visceral horror betrays its thoughtful premise. Yet there’s a brutal logic to this shift – like a volcano that has been quietly building pressure beneath a serene surface, the explosion of violence feels both sudden and inevitable. The film’s descent into overt horror isn’t a departure from its psychological foundation but rather its natural conclusion – when social pressure reaches a critical point, the explosion isn’t just loud, it’s devastating. Like a kettle that must eventually whistle or a spring that must release its tension, the ending’s brutality serves as the only possible outcome for characters who’ve compressed their survival instincts beneath layers of social obligation for so long. It’s not that the film abandons its themes of social pressure and politeness – rather, it shows us their ultimate, terrible cost. Speak No Evil is a layered horror experience that bypasses cheap jump scares in favor of unsettling psychological tension, it succeeds in showcasing that effective horror comes not from monsters or gore, but from how what we consider harmless social norms—like politeness and keeping the peace—can actually lead us into danger. This fresh take is perfect for a horror film, showing how ordinary manners can become traps that others exploit. Speak No Evil could be a memorable entry in the genre. However, the familiar twist ending may feel predictable for some, taking away a bit from its psychological depth in favor of more conventional scares."
  },
  {
    "rating": "1/5",
    "review": "Is the first times that i want kill the family for as...ole"
  },
  {
    "rating": "4.5/5",
    "review": "Interesting commentary on masculinity. Fitting for our current political environment. It seems to recommend that men become more masculine or risk losing their livelihood and family. Either way, very tense throughout, make sure that this is the type of movie you’re in the mood for. But when you are, it’s well worth the discomfort"
  },
  {
    "rating": "4/5",
    "review": "Having watched the original, I was expecting to be disappointed because most remakes of foreign-language horror films pale in comparison. Yet I was pleasantly surprised that I liked this version of Speak No Evil far better. James McAvoy took creepy to the next level as his uncomfortable, albeit entertaining, performance was incredible. Tension is the key player in this movie, and it hits a home run with how aptly it utilizes cinematography to create the most unsettling atmosphere. Its slow-burn approach makes it an immersive experience, where every interaction is charged with a hidden menace that escalates the suspense. This remake of the Danish thriller is also more realistic and changes the ending to a more satisfying portrayal of how someone would react in a similar situation. Speak No Evil is the awaited win Blumhouse has been waiting for."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was generally good and of high quality, but the end and the middle were also good, but the beginning and a little later were a bit boring. But it was a watchable movie and the ending was of good quality."
  },
  {
    "rating": "2.5/5",
    "review": "Oh please! The last ten minutes or so are too ludicrous for words. I know we are always expected to suspend disbelief with most films, but I'm sorry....when somebody is holding a gun, even if they're beginning to feel the effects of being drugged with a hypodermic needle, one doesn't take the time to turn their back on the gun-holder and hug their daughter to make sure she's feeling ok ... SPOILER ... at the end when they hear a sound and see that it's a fox and not the psychotic killer, one doesn't put her chin on her husband's shoulder and breathe a sigh of relief ... especially when the psychotic killer is still alive and capable of appearing from any direction. But welcome to the movies!"
  },
  {
    "rating": "2.5/5",
    "review": "Once you find out the plot the rest is predictable."
  },
  {
    "rating": "1.5/5",
    "review": "I went into this movie with some hope, but can't say that it held my attention. Toward the end, I forwarded through the climax and just watched the last few minutes. The marital issues were nothing but a distraction, in my opinion, and kept the plot from moving forward. I wanted to enjoy this movie, but it fell flat for me."
  },
  {
    "rating": "4.5/5",
    "review": "What a great suspenseful movie obviously you kinda know what is gonna happen but they keep you on the edge of your seat for a long time.McAvoy is absolutely frightening. He reminds me of a young Girard Butler, and I hope to see more of him. Scoot Great like usual and it was nice to see him not in a war movie lol this time the battle was to save what’s dearest! Great movie to download and watch while playing a little NBA 2K25. I paused the game many times. I really enjoyed this movie hats off to Mackenzie Davis and Ainsley Franciosi, and Too bright young stars with Alix West and And the young man With no voice, who unfortunately rotten apples didn’t give a credit too. Very clever movie!"
  },
  {
    "rating": "5/5",
    "review": "Eu estava procurando um filme bom de suspense já faz tempo, e esse é muito bom recomendo ."
  },
  {
    "rating": "3/5",
    "review": "Very slow start. Picks up after an hour. Good Ending."
  },
  {
    "rating": "4.5/5",
    "review": "Decent flick! It’s intense and will keep you on the edge of your seat! Great acting as well.."
  },
  {
    "rating": "4.5/5",
    "review": "This is one of the two thrillers I saw this year and I really liked it, the cast plays well and believably, the twist at the end surprised me, I hope to see the source on which this movie is based and enjoy it as much as I enjoyed this movie."
  },
  {
    "rating": "3.5/5",
    "review": "A couple meets another while on holiday. When they accept an offer to visit, the relationship darkens. Exceptional performances from James McAvoy, Mackenzie Davis, and Aisling Franciosi (see the Nightingale 2018 for her performance) barely make this predictable film worth viewing. Poor Scott McNairy plays a buffoon well but his character is so irritating it almost ruined the film for me."
  },
  {
    "rating": "5/5",
    "review": "One of My favourite movies that have come out this year. It’s a MUST see."
  },
  {
    "rating": "3/5",
    "review": "Predictable. Like a repeat of the other movies."
  },
  {
    "rating": "1.5/5",
    "review": "Good idea, horrible execution."
  },
  {
    "rating": "3.5/5",
    "review": "If you enjoyed the harsh brutality of the original film this one might disappoint you but if you are looking for something genuinely thrilling this is for you."
  },
  {
    "rating": "2.5/5",
    "review": "The most unnecessary remake I've ever seen. It's not a bad film per se, but it feels disrespectful to its source material. Can't think of a single reason why anyone would want to watch this over the original."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was good, but I hate moments like... let's go back for the Toy... like... really!"
  },
  {
    "rating": "0.5/5",
    "review": "I was initially excited by some wise dialogue in the first 20 minutes, but it takes far too long to take off. After more than an hour, there’s still no suspense or action, and the unfolding story is beyond dumb and disappointing."
  },
  {
    "rating": "4.5/5",
    "review": "I love this movie because the ending surprised me. The whole time I was wondering what was gonna happen and how this was going to end and it’s definitely shocking. They chose the perfect people for the roles. It’s not scary, it’s just a damn good thriller. And it keeps you on the edge of your seat because you are constantly trying to figure everything out. Go see it!"
  },
  {
    "rating": "4/5",
    "review": "I love this movie because the ending surprised me. The whole time I was wondering what was gonna happen and how this was going to end and it’s definitely shocking. They chose the perfect people for the roles. It’s not scary, it’s just a damn good thriller. And it keeps you on the edge of your seat because you are constantly trying to figure everything out. Go see it!"
  },
  {
    "rating": "1/5",
    "review": "This is very painful to watch l. Sacrificed almost 2 hours of mental health to watch."
  },
  {
    "rating": "4.5/5",
    "review": "Very terrifying and outstanding performance by James McAvoy, very suspenseful scenes and surprising twists! Lost itself a little by the end but still got me entertained all the way through, very close to perfection actually. 9/10."
  },
  {
    "rating": "4.5/5",
    "review": "James McAvoy oozes so much screen presence we almost root for him throughout despite the horrible things he has to do."
  },
  {
    "rating": "5/5",
    "review": "Great plot and twists in this thriller!"
  },
  {
    "rating": "3.5/5",
    "review": "Direção: Ok Atuação: Bom Roteiro: Bom Caracterização: Ok Soundtrack: Ok"
  },
  {
    "rating": "5/5",
    "review": "This is an absolute pearler of a film. A remake I believe and this has done the job. Had me shouting out loud ! Get it watched and get your popcorn and enjoy. Well worth your time. James plays an extremely convincing role. Urrrggghhh"
  },
  {
    "rating": "4/5",
    "review": "I went into this movie not having any expectations, not seeing the trailer or knowing the plot; I was drawn to it by the cast (WHICH DID NOT DISAPPOINT). It was a bit of a slow burn, but by about half way in you have to see how it ends. The twist was decent, made better by the powerful acting. A small cast, every actor does their part and does it well, I was very moved by the children. The score is very suspenseful and eerie, its well done."
  },
  {
    "rating": "4.5/5",
    "review": "A decent thriller as far as thrillers go. Not going to be upset if you go in with reasonable expectations. Worth a watch"
  },
  {
    "rating": "3/5",
    "review": "The movie was ok. Predictable"
  },
  {
    "rating": "2/5",
    "review": "Not as good as the original Well acting But bad end The original movie is good because of the Ending America dont Like Depressive endings and thats why all them Remakes are worst"
  },
  {
    "rating": "5/5",
    "review": "This was an awesome movie filled with suspense and laced with twists and turns. Gotta see!"
  },
  {
    "rating": "5/5",
    "review": "Did not disappoint. Really good movie. Keep us interested to the end."
  },
  {
    "rating": "4/5",
    "review": "The English style is much better than the US style"
  },
  {
    "rating": "4/5",
    "review": "James McAvoy excelente actuación.. llena de momentos de suspensos muy buenos"
  },
  {
    "rating": "4/5",
    "review": "pretty cool! ending of the original Danish film is much better, but this movie is still pretty great!"
  },
  {
    "rating": "4/5",
    "review": "Le même film que l'original avec juste une fin beaucoup plus classique où la famille s'en sort en tuant tous les antagonistes. Un film bien exécuté mais quitte à en regardant un autant regarder la version de 2022."
  },
  {
    "rating": "5/5",
    "review": "I really liked this movie. It’s the best one I’ve seen in a while. Acting, plot and ending were great. Kept me on the edge of my seat!"
  },
  {
    "rating": "2/5",
    "review": "Did it suck? No. Should the producers have just advertised the original again? Yes. By all metrics this absolutely failed to meet the standard set by the original."
  },
  {
    "rating": "5/5",
    "review": "In a world where it's all too easy to be distracted while watching a movie at home this was so gripping and full of suspense I didn't want to miss a second. Great cast and superb acting. An absolute must see."
  },
  {
    "rating": "4/5",
    "review": "Definitely worth a watch, some twists and turns. Amazing that a horror film was set in the ‘west country’ as I am from there so it’s nice to see Americans coming to our neck of the woods. James McAvoy is brilliant, don’t think there has been a bad film with him in it! Not bad for someone who started out on Shameless UK many moons ago!"
  },
  {
    "rating": "5/5",
    "review": "Brilliant, chilling. Superb plot with excellent acting."
  },
  {
    "rating": "3/5",
    "review": "I was expecting more but the action was there for sure."
  },
  {
    "rating": "3/5",
    "review": "One of those movies where although it's good it's very, very uncomfortable to watch. I liked it but I didn't enjoy it. Does that make any sense?"
  },
  {
    "rating": "2/5",
    "review": "I wanted to like but unfortunately found it extremely predictable and boring.. what saved it was the acting, McAvoy especially"
  },
  {
    "rating": "5/5",
    "review": "Personally, I thought this was a very good movie. It was quite suspenseful right up to the ending, which was great. James McAvoy does an amazing job with his character in this movie. The rest of the actors are very good as well. I would definitely see it again."
  },
  {
    "rating": "5/5",
    "review": "A few goosebump inducing moments make this film worthwhile."
  },
  {
    "rating": "4/5",
    "review": "Loved it. One of the best movie in recent times."
  },
  {
    "rating": "5/5",
    "review": "This film was actually incredible. The acting was top notch, the situations the characters were put in felt dreadful at times, and the ending was very good. I highly recommend watching"
  },
  {
    "rating": "4/5",
    "review": "IN A NUTSHELL: The story is about a family that is invited to spend a whole weekend in a country home of another couple they had recently met while on vacation. The weekend reveals startling lies and an unimaginable dark side. This is an American remake of the 2022 Danish film. It’s unusual to get an American adaptation of a film so quickly! The movie was directed by James Watkins who also cowrote it with Christian Tafdrup and Mads Tafdrup. Christian and his brother co-wrote the screenplay, while Christian directed it. James McAvoy said that he did not watch the Danish film before he began filming because he didn’t want it to influence how he performed and presented the story. Twenty-four hours after they finished filming, he watched the original and said he was extremely impressed. Just so you know, the original Danish version is much more violent and brutal. The director of the unsettling Danish movie revealed that a real-life experience he had inspired the film. He and his wife met a Dutch couple when they were on vacation. Later, that couple invited them to visit them in the Netherlands. He and his wife declined the invitation because they thought it would be awkward. He let his mind wander and explore the worse-case scenario to see how far and horrific this movie could go. THINGS I LIKED: I don’t really like horror movies, so the only reason I wanted to watch this was to see the incredibly sinister performance by James McAvoy. I’ve been a huge fan of his and knew he would be amazing in this. The’s absolutely nothing he could have done better in this role. His creepy performance was stellar. The rest of the cast also did a great job and includes Mackenzie Davis, Scoot McNairy, Aisling Franciosi, and the two darling kid actors: Alix West Lefler and Dan Hough. There are so many times in Acts 1 and 2 where we see red flags and feel extremely uncomfortable. As you become more aware of what’s really happening, you want to yell at the screen to warn the characters not to do what they’re about to do. That’s what a good horror can do: evoke fear and passion in the audience. Mission accomplished in this film. The movie was filmed in Gloucester, England and also in Croatia for a week. The title takes on an interesting meaning in several ways. Because you know the madness is coming, you feel the tension from the very beginning of the film and throughout every scene, wondering when the chaos will begin. The dialogue does a great job injecting some humor along the way. THINGS I DIDN’T LIKE: Fans of the original Danish movie might be disappointed that the American film changes some plot points, especially the ending. Like most horror movies, there are always characters who make dumb decisions that put themselves in even more danger. Some viewers might complain that the story is slow-moving because they want to get to the crazy action sooner. The horror begins at the last 20 minutes of the movie. Sometimes, it was hard to understand what everyone was saying. TIPS FOR PARENTS: This frightening film is inappropriate for kids. Bloody, brutal violence Profanity Talk of a girl’s period Talk of divorce Stealing Portrayal of intimate relationships (fully clothed under a table) To see my full review, go to my Movie Review Mom YouTube channel!"
  },
  {
    "rating": "5/5",
    "review": "James McAvoy at his best!"
  },
  {
    "rating": "0.5/5",
    "review": "Horrible writing and storyline. Very disappointing. Waste of money."
  },
  {
    "rating": "5/5",
    "review": "Me and my son loved the movie! Starts a bit slow but then it's full of action amd suspense! It's really worth watching !!"
  },
  {
    "rating": "3/5",
    "review": "James makes movies so much easier to watch"
  },
  {
    "rating": "3/5",
    "review": "WAY overrated. This film spends 1hr and 40minutes making you feel uncomfortable and infuriatingly clubbing you with how tremendously stupid the main couple is at not seeing warning signs (they deserved to die for how dumb they were), then FINALLY gets to some movement in the last 20-minutes. It was not worth the wait. It's fine, not a bad film, but way overrated."
  },
  {
    "rating": "4/5",
    "review": "An enjoyable and exciting story that was thoroughly enjoyable and tense at times. The buildup to the climax of the film is definitely worth a watch."
  },
  {
    "rating": "3/5",
    "review": "The movie starts out really slow but eventually gets better. The show is saved by the superb acting of McAvoy. I"
  },
  {
    "rating": "2.5/5",
    "review": "Um filme que foi feito pra causar raiva em quem assiste! Nunca vi personagens tão burros, com escolhas tão irreais. São tão burros que da até dó! É isso me segurou até o final. Gostei bastante kkkkkkkk mas n assistiria novamente pela raiva que passei."
  },
  {
    "rating": "5/5",
    "review": "This movie isn't getting enough hype. It was so much better than I expected. It had my heart racing like crazy with anticipation, not knowing and gearing what was going to happen next. A great movie."
  },
  {
    "rating": "4/5",
    "review": "speak né evil e um bom filme no começo do filme vai dando um drama"
  },
  {
    "rating": "2/5",
    "review": "The entire movie is a lead up to a 15 minute action ending. Story is easy to follow and predict. It wasn't terrible, but wasn't great. Wait for streaming"
  },
  {
    "rating": "4.5/5",
    "review": "Went in with zero expectations. Was a fun thriller. Mccavoy is such a good actor he basically carries this film."
  },
  {
    "rating": "5/5",
    "review": "An incredible film. A masterful blend of art and horror. This film knows when to be subtle and knows when to amp it up. I was pleasantly surprised by the performances. Movie was perfectly casted and while the twist isn't truly surprising the pacing is absolutely incredible."
  },
  {
    "rating": "3.5/5",
    "review": "Honestly not too bad. Had a good creepy vibe going and the plot started a bit slow but ended up being pretty good."
  },
  {
    "rating": "3/5",
    "review": "James McAvoy brings out the roughness of a sociopathic control freak with no trouble. It is too bad, the rest of the cast lacks character and makes stupid decisions with no line of thought. This remake of the Danish version is better as a home viewing than a movie theater experience."
  },
  {
    "rating": "3/5",
    "review": "I enjoyed the Joker but not as much as I enjoy the previous one with Joaquin Phoenix! I’m not a fan of Lady Gaga so"
  },
  {
    "rating": "2.5/5",
    "review": "It's entertaining until the outcome. Predicatble. The father couldn't get more stupid, astonishingly stupid, hard to believe. Not even near to the original film but watchable tho."
  },
  {
    "rating": "4.5/5",
    "review": "James Freaking McAvoy!"
  },
  {
    "rating": "5/5",
    "review": "Well written family dynamic that's relatable and honest. Spectacular acting from the entire cast. The suspense was paced nicely and the buildup was great. A solid thriller that doesn't rely on dramatic blood and gore for shock value."
  },
  {
    "rating": "5/5",
    "review": "James McAvoy plays a great crazy person"
  },
  {
    "rating": "1/5",
    "review": "This atrocious movie was the best comedy I saw in the entirity of 2024. We laughed and we laughed, fave quote was “you blew up my car you cheeky c**t”. Half a star for comedic value and the other half for James McAvoy’s boobies."
  },
  {
    "rating": "3.5/5",
    "review": "They did well with the tension and suspense building. Great performances, beautiful country side scenery, and a psychotic plot makes this a fun flick for a Friday night."
  },
  {
    "rating": "5/5",
    "review": "Great movie, James McAvoy steals the show entirely and Dan Hough is outstanding. Edge of your seat stuff, it’s uncomfortable, red flags everywhere and yet funny and horrifying. We loved it despite the stupid things people did 😁"
  },
  {
    "rating": "5/5",
    "review": "The psicopatic face of James McAvoi in this movie is scary and I approved the character. The final is good. This rivisitation of the original movie is scary(positive sense) and absolutely good"
  },
  {
    "rating": "3.5/5",
    "review": "F*ing intense. Had me on the edge of my seat until the end. Definitely worth a watch."
  },
  {
    "rating": "4/5",
    "review": "James McAvoy is one of the best if not the best at what he does."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoy it! With an amazing plot twist"
  },
  {
    "rating": "3.5/5",
    "review": "Acting is absolutely amazing, the slow burn at the start hurts more than it helps but the end result makes the build up worthwhile, you become more and more unsettled as the movie progresses."
  },
  {
    "rating": "0.5/5",
    "review": "Such a brutal ending and its still boring as anything. Goof guys win, blah blah boring stuff. Oh, and our rental car has bulletproof windows for some reason. Zero effort put into movies, yet so much money."
  },
  {
    "rating": "2.5/5",
    "review": "It was pretty good. A lot of the build up was good, but then when we got to the final act there really wasn’t that much action. There was still definitely some good scenes but most of it was a little boring and predictable. Acting was really good though. I think it’s worth a watch at home."
  },
  {
    "rating": "2/5",
    "review": "Honestly just made me angry. The father was completely a useless moron. The mother just spoils her daughter and the daughter is a crybaby."
  },
  {
    "rating": "3.5/5",
    "review": "This is another great job by professor X himself he just is so locked in with his facial expressions I think he’s just one iconic horror role from being like a Jack Nicholson or Bruce Willis he’s so talented"
  },
  {
    "rating": "4/5",
    "review": "Solid, tense psychological thriller that flirts with going full horror; it restrains itself enough to maintain the plausibility and groundedness needed to keep its constant suspense going. The “psychosocial warfare” of the first and second acts make it an enjoyable slow burn with a final act that is more gratifying than most entries in the genre. Standout performance by McAvoy (with facial expressions on par with recent face work by Hartnett in Trapped and Thornton in Terrifier 3). In some of the movie’s best moments, McAvoy’s face seems to crystalize as symbol of all the “dread and dark delight’ that makes the movie a stressful fun ride."
  },
  {
    "rating": "4/5",
    "review": "Very entertaining, but a slow start. The start being slow is worth the character building and pay off. Typical bad decision, by characters, thriller worth the watch."
  },
  {
    "rating": "1.5/5",
    "review": "They went back for the teddy......"
  },
  {
    "rating": "3/5",
    "review": "Can it stop now please? First this is a great film and everyone in it is terrific. But two minutes in the outcome is clear. The Mackenzie Davis will be the strong female that fights the evil white guy. The other strong female is white so she will be evil partner of the evil white guy, which of course she turns out to be. There is another white guy so he will of course turn out to be evil which quell surprise! He is! The good white guy emancipated over the last decade by his need to attend to pronouns turns out not to be employable (authentic at least) and finally cries \"I don't know what to do\". The film would have benefited from Mackenzie's character having sex with Paddy (brilliantly played by James McAvoy) complicating the moral positioning with more depth. I was expecting Straw Dogs but no. In the end the bad guy is taken down by guess who? The strong female daughter. When the bad guy is finished off by the white kid it turns out he is a pyscho bad white kid. It's not that this reviewer is some old white guy thinly hiding some kind of bias hankering for Dirty Harry. I loved the females becoming the bosses in Ozark. It is just that since then the obvious trope stops us from enjoying any suspense or tension because the trope is a forgone giveaway."
  },
  {
    "rating": "3.5/5",
    "review": "Loved how the movie made you uneasy"
  },
  {
    "rating": "2/5",
    "review": "Watered down and moralistic remake."
  },
  {
    "rating": "4.5/5",
    "review": "To start with WHAT A FILM! From the get go it creates such a creepy and intriguing atmosphere to the point you can’t stop watching! I had my eyes glued to the screen the whole time. Would highly recommend to anyone who enjoys an action packed thriller!"
  },
  {
    "rating": "2/5",
    "review": "Previews were better than the movie"
  },
  {
    "rating": "4/5",
    "review": "It’s really good, sorry! Watch it, it’s a fun time. The last 30 minutes get so insane, you can’t help but love it."
  },
  {
    "rating": "5/5",
    "review": "This was a predictable and suspenseful at the same time, if that makes sense. The leading actor James was super as always."
  },
  {
    "rating": "5/5",
    "review": "Excellent and never drifts into the absurd."
  },
  {
    "rating": "1.5/5",
    "review": "Movie was more awkward than anything. I think James McAvoy does too much to try and seem unhinged but really it's just bad acting and not believable. Long set up for a boring ending. D+ movie."
  },
  {
    "rating": "1.5/5",
    "review": "Tu fica mais puto com a burrice dos personagens do que com medo de fato"
  },
  {
    "rating": "4/5",
    "review": "James McCavoy is an undeniable force and the movie keeps your hand white knuckle to the armrest"
  },
  {
    "rating": "4.5/5",
    "review": "The suspense the movie had the whole time was amazing. It kept me on the edge of the seat the whole time. The acting was incredible and a great plot on something that can happen in real life."
  },
  {
    "rating": "3.5/5",
    "review": "Está muy bien llevada, me gustó toda la historia, solo se me hizo muy lento lo que tardó desencadenar lo que se veía venir desde un principio. Me encantó el final"
  },
  {
    "rating": "4.5/5",
    "review": "This was fun. Villain was INSANE. No idea how you visit them alone. Family was annoying but interesting to follow"
  },
  {
    "rating": "1/5",
    "review": "We’ve all seen this predictable film before , done better"
  },
  {
    "rating": "4/5",
    "review": "Not a 5 start my girlfriend says but definitely a 4 star and a great thriller"
  },
  {
    "rating": "5/5",
    "review": "James Mcavoy’s performance is incredible. This movie creates a constant unsettling feeling that increases steadily throughout the film."
  },
  {
    "rating": "0.5/5",
    "review": "Although well acted, this was one of the most ridiculous story lines ever! You find your child in the bed of strange adults, after countless times of feeling in danger and uncomfortable and you get away but go back for a cuddly toy??"
  },
  {
    "rating": "4/5",
    "review": "Unfortunately, James McAvoy steals the show and the stage from the protagonists when he's on screen, but the way the film moves along and leaves you anguished on the edge of your seat is incredible."
  },
  {
    "rating": "4/5",
    "review": "Nice edge of the seat thriller. This is not a supernatural horror movie."
  },
  {
    "rating": "1/5",
    "review": "Depraved. Pointless"
  },
  {
    "rating": "2/5",
    "review": "Pretty much what you expect from the trailers. Protagonists where lame."
  },
  {
    "rating": "4.5/5",
    "review": "James McAvoy was fantastic, the writing was fantastic, the family interactions felt awkward at times as intended. Suspenseful & tense - an awesome combination."
  },
  {
    "rating": "4/5",
    "review": "Was by far the best suspenseful movie we've seen all year"
  },
  {
    "rating": "1.5/5",
    "review": "I will just say this, how is it a thriller/horror if the protagonist could have left any time, as they were not being held against there will."
  },
  {
    "rating": "5/5",
    "review": "It was a true build up but we were entertained and I loved it worth every sin I seen it at the show I would see it again."
  },
  {
    "rating": "3.5/5",
    "review": "Palpable terror. Ending was very pleasuring. The film was formatted in a very suspenseful way which I can appreciate. Great horror film!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely recommend it. Had us screaming at the TV! Very intense. Loved it."
  },
  {
    "rating": "5/5",
    "review": "All I can say is exhausted at the end and reminded me of the remake of Cape Fear!"
  },
  {
    "rating": "4/5",
    "review": "James McAvoy’s acting is brilliant as always and the films quite good - the dalton family do your head in with how much they let slide as if it’s normal behaviour but that’s how they’re meant to make you feel. Only down fall is at the time of watching I felt like there was a lot of waiting for ‘something to happen’"
  },
  {
    "rating": "4.5/5",
    "review": "A couple from London befriends another couple during a vacation in Italy. After returning home, they are invited to pass some time with the new friends at their remote farmhouse. Once there, the hosts reveal an awkward and sometimes outrageous behaviour, creating in their guests an enormous discomfort. The true reason behind this invitation goes above and beyond the imagination of the darkest mind. \"Speak No Evil\" is a remake of the 2022 Danish movie with the same title, though it reinvents the final act in a surprising way. The movie creates an eerie discomfort in the viewer by simply subverting some social conventions. The level of tension grows slowly until it culminates in an explosive and violent finale."
  },
  {
    "rating": "3.5/5",
    "review": "Great movie! Its definitely a slow burn but up until the reveal, its quite comic actually with the tension and awkward moments between the characters. It was a fun time and I do recommend it for the cinephiles."
  },
  {
    "rating": "2/5",
    "review": "Smart, warm, funny father turns out to be a psycho serial killer. That's the basic premise of this movie. It doesn't suprise that the first part of the movie is how this eventual killer tries hard to fake a friendly, normal facade in order to lure his victims. But soon, the questions keep kicking in. For example, how you can spend hours and days with another person/family without truly learning something about them in the process? How self-obsessed must you be? So, the killer managed to lure his potential victims into his den. Well deserved, I say. Keeping in mind what his ultimate goal is, there is simply no reason whatsoever to keep them around. And yet, so much unnecessary drama ensues just to keep us on our toes (I guess). When it's just infurious to watch them all act unbelievably stupid and ignorant. I don't want to spoil it for anyone so I'm just going to say, what happens in the final 15 minutes of the movie, is so out of character particularly for one person that it just got ridiculous. The problem is not the acting, though, it's really the script. I think McAvoy did a great job, in principle, and I hope to see him in better movies."
  },
  {
    "rating": "4/5",
    "review": "good movie. worth watching"
  },
  {
    "rating": "4/5",
    "review": "If you want a thriller suspense—this is it! I might have tweaked the ending but all in all, it was exactly what I was looking for."
  },
  {
    "rating": "5/5",
    "review": "James McAvoy is absolutely the best actor for these types of movies. Dude portrayed this role perfectly, he makes you think he really is this way in real life and it's not an act."
  },
  {
    "rating": "4/5",
    "review": "Had no idea what to expect, started off thinking this is an extremely weird film, left thinking this is a great film. Great story!"
  },
  {
    "rating": "2.5/5",
    "review": "why is there a need to remake a movie that was already Meh.. Sure, james mcavoy is a great actor and the movie is alright. Is it the best thing ever? nah. Worth watching? i mean if you are looking for some fun sure."
  },
  {
    "rating": "4.5/5",
    "review": "“Speak No Evil,” directed by James Watkins, is a masterful psychological thriller that expertly unravels the intricacies of human relationships and the unsettling consequences of misplaced trust. This film captivates its audience with an atmosphere of tension and dread, making it a standout entry in the genre. The story revolves around an American family—Ben, Louise, and their daughter Agnes—who unknowingly step into a nightmare after befriending a seemingly charming Dutch couple. From the moment the family arrives at the couple’s remote estate, the film plunges viewers into a chilling exploration of social discomfort and moral ambiguity. Watkins skillfully builds a sense of unease, showcasing how politeness can mask sinister intentions. The performances in “Speak No Evil” are exceptional. The lead actors bring depth and authenticity to their roles, particularly in portraying the emotional struggle of a family caught in a web of manipulation and terror. Their gradual realization of the danger they face is palpable, making their plight all the more relatable and horrifying. Visually, the film is striking. The idyllic beauty of the countryside stands in stark contrast to the malevolence that unfolds, heightening the sense of horror. Watkins’s direction allows for a slow, deliberate build-up of tension, leading to a climactic finale that is both shocking and thought-provoking. The film navigates dark themes with a deft hand, balancing moments of levity with the ever-present undercurrent of dread. One of the film’s greatest strengths is its ability to provoke thought. It raises important questions about complicity and the lengths to which individuals will go to maintain social niceties, even in the face of overt discomfort. The exploration of these themes resonates long after the credits roll, prompting viewers to reflect on their own experiences with trust and social boundaries. Overall, “Speak No Evil” is a powerful and unsettling film that leaves a lasting impression. Its blend of psychological horror, strong performances, and incisive commentary on human behavior make it a must-see for fans of the genre. Watkins has crafted a compelling narrative that will stay with viewers, urging them to reconsider the nature of civility and the darkness that can lie beneath the surface of seemingly ordinary lives."
  },
  {
    "rating": "4.5/5",
    "review": "I came for McAvoy performance, I got McAvoy performance."
  },
  {
    "rating": "4/5",
    "review": "James McAvoy not only engaged Paddy but enraged us with him until the very end. My only complaint was that the Daltons should have gone away once they suspected the whole set up was sinister."
  },
  {
    "rating": "4/5",
    "review": "This movie was low key good. I was instantly in with this family and rooting for them throughout the movie. McAvoy does a great job playing a deranged psychopath. Lots of tension."
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing film. All of the actors were great, especially James McAvoy, and the writing and direction was spot on."
  },
  {
    "rating": "3/5",
    "review": "It is a decent remake, but I liked the original version better. And it is strange to watch Scoot McNairy and Mackenzie Davis play a married couple after watching them portray workplace rivals for several seasons on Halt and Catch Fire."
  },
  {
    "rating": "0.5/5",
    "review": "A WASTEEEEE of time. Most dragged out ANNOYING beginning of any movie I have ever seen. Great ending— don’t know if it was worth the trouble, though."
  },
  {
    "rating": "3.5/5",
    "review": "MAcavoy is terrifying- scared the crpa out of me"
  },
  {
    "rating": "4/5",
    "review": "Engaging thriller, lots of twists and surprises. I liked it alot"
  },
  {
    "rating": "2/5",
    "review": "It's almost a slap in the face of the audience. No one in the movie has any sense."
  },
  {
    "rating": "4.5/5",
    "review": "surprised with how good it was solid 9/10"
  },
  {
    "rating": "4/5",
    "review": "Three fourths of this movie is dialogue, walking and feeling the weird behavior of this family that us, the audience, know is not trustworthy. But the tension and edge feeling that this type of horror gives you is simply natural, because it has happened before, and it is real. So this movie really makes the effort to make it the most believable possible, and it works. People lurking in the background, messages trying to be sent but failing and ultimately just really high tension. It really puts you in the place of the protagonists and explains to you why they’re doing what they are doing. But, as always in this type of movie, huge mistakes that no one in the right mind would make, are made, and although the movie does a good job of soothing you back into the plot and making it feel fresh again, it just keeps bashing in your head: “why didn’t they do this, or that…” and this type of questioning gets you out of the film, because it breaks the connection that it kept so long trying to form. In the end, the final act really feels rushed, with too much going on, but it works, because the movie isn’t about those scenes, it’s about the realism of its plot and characters, and that it can, mostly, handle very well."
  },
  {
    "rating": "4/5",
    "review": "James McAvoy can do no no wrong! He delivers a chilling performance. Love the ending. Its always great to see characters avenged in the ending"
  },
  {
    "rating": "3.5/5",
    "review": "Good thriller that keeps you focused !"
  },
  {
    "rating": "1/5",
    "review": "The best part of the original movies is the end, which kept me from sleeping from several nights. This is a washed down, coward version. I could not be more disapointed."
  },
  {
    "rating": "3.5/5",
    "review": "Extremely straight forward, there's like no doubt what's going on and what it's leading up to. Acting was very good but it's a no surprise kinda of movie besides the sheer weak spined character the dad is."
  },
  {
    "rating": "3/5",
    "review": "McAvoy did his job as usual. Never fails to deliver a brilliant performance. With that being said the original was better."
  },
  {
    "rating": "3/5",
    "review": "I guess there are people in the world as useless and screwed up as the victims. Hard to believe. Decent movie except for generally wanting them offed."
  },
  {
    "rating": "3.5/5",
    "review": "A good thriller that keeps your interest."
  },
  {
    "rating": "5/5",
    "review": "There are few films that put the audience directly into the shoes of the characters, experiencing their fear, confusion, and tenacity to survive. Speak No Evil is a wickedly cruel tale about the dangers of trusting strangers."
  },
  {
    "rating": "4.5/5",
    "review": "At first the film seems boring, but then the events become completely captivating."
  },
  {
    "rating": "1.5/5",
    "review": "idk how this is at a 80 percent score?! wait until it comes out at home. not good!!"
  },
  {
    "rating": "1/5",
    "review": "This isn’t a horror movie. This is a not-so-settled attempt at attacking “Toxic” masculinity. The villain is a poster child for all that’s wrong with the male archetype, where his masculinity is woven into a creepy killer, and only a strong woman can beat him accompanied by her inept neutered husband."
  },
  {
    "rating": "5/5",
    "review": "Taking our every day lives by exploiting new and old social norms, rules we feel should live by, and showing the drop out of avoiding our instincts. Fast past film with such real passion and connection from the actors the FEAR was felt. So worth it! Brilliant."
  },
  {
    "rating": "5/5",
    "review": "McAvoy, BRILLIANT! A great on edge film"
  },
  {
    "rating": "2.5/5",
    "review": "James McAvoy is where the budget has been spent and he is worth every penny. Lacklustre production, namely continuity errors and dismal lighting is what brings the rating down from a 3.5 star to a 2.5."
  },
  {
    "rating": "4/5",
    "review": "An Instant Classic!! Must Watch!!"
  },
  {
    "rating": "5/5",
    "review": "super intense very enjoyable highly recommend"
  },
  {
    "rating": "3.5/5",
    "review": "The movie started out slow and then became very dramatic. The best part of the movie was at the end, but the ending was also predictable. So, if you want some drama, you will like this. Not really a horror movie if that's what you are looking for. The actors were good, and the story was edge of the seat."
  },
  {
    "rating": "3/5",
    "review": "I liked cause it was entertaining, the plot was interesting and I just figured everything out I didnt like how short it was it felt rushed, the guy is a physcopat and weird story"
  },
  {
    "rating": "3.5/5",
    "review": "It was a good movie but it had a slow start."
  },
  {
    "rating": "4/5",
    "review": "A great movie with surprising twists. James McAvoy has again proved that he is one of the most versatile and gifted actors of Hollywood. Great script and good acting all throughout the board. Never a dull moment. Always keeps you guessing."
  },
  {
    "rating": "4/5",
    "review": "James & Aisling did some great acting in this movie, The americans not so much. The First 2/3rds were really well done, built up so much suspense. But the last 3rd fell short & became a bit goofy, It had a lot potential to be a chilling tale so I felt dissapointed that it went that way. Worth a watch anyway"
  },
  {
    "rating": "4/5",
    "review": "James McAvoy: one of the most underrated actors of our time. He delivered a strong performance (as expected). It’s an enjoyable, fun thriller through & through."
  },
  {
    "rating": "5/5",
    "review": "this movie was pretty good. it had plot twist in it that I loved. must see"
  },
  {
    "rating": "2.5/5",
    "review": "Its revised ending cannot be read as anything other than an attempt to coddle what it sees as the childlike audiences of the English-speaking world."
  },
  {
    "rating": "4.5/5",
    "review": "Plot twist!!! Drop the mic! It was good! It was like a virtual haunted house. You never knew what type of crazy you were going to enter from one scene to the next! I enjoyed it from beginning to the gory end!"
  },
  {
    "rating": "5/5",
    "review": "This was a really good movie! I was engaged the whole time"
  },
  {
    "rating": "5/5",
    "review": "The Movie is amazingly believable. All of the actors are good, but the acting from James MacAvoy is outstanding. It feels so good to walk out of a movie and feel that you received a lot of great entertainment for what you paid. It will make you want to have a ready plan if you're ever in this predicament with people you think you can trust. Don't doubt yourself. Trust your instincts. I will see it again, as soon as I can find some free time."
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed Speak No Evil. Even with a cast of only about 8 actors, every one of them delivered an awesome performance, especially James McAvoy. True to slow-burns, Speak No Evil builds in intensity and creates a visceral feeling of being so uncomfortable (in such a good way). I can't give it 5 stars just because its a bit predictable, it kind of lacks an element of surprise, but despite feeling like you know whats going to happen, it still executes the journey very well. I definitely recommend seeing this movie if you appreciate slow-burn psychological horror/thrillers."
  },
  {
    "rating": "3/5",
    "review": "James McAvoy is nothing short of awesome in this movie. The movie itself its nothing more than just a flashier version of the Finnish film not much creativity applied to be more unique than a more violent ending. big praises to Dan Hough"
  },
  {
    "rating": "5/5",
    "review": "A well-told horror without many scares, but even so, the psychological tension that this film makes with the viewer is terrifying. He makes you excited and crazy at the same time. I am in agony and the first time I saw the movie theater interacting with each other and we were all very apprehensive. I left the movie theater happy and loved the film. I want more psychopath films in this style. James Mcavoy surprised me with his performance and brought us a beautiful, terrifying film."
  },
  {
    "rating": "5/5",
    "review": "It was an enjoyable movie! Engaging and great acting by all."
  },
  {
    "rating": "3.5/5",
    "review": "Great social satire, with frustratingly good suspense. Wouldn't expect such a dark character from McAvoy. Moral of the story: don't spend a weekend with a random couple from the west country. The film is only let down by its rushed ending and one-hit-wonder plot. A very balanced thriller."
  },
  {
    "rating": "4.5/5",
    "review": "Speak No Evil (2024) is an intense, psychological thriller that masterfully combines tension, fear, and a gripping moral dilemma, making it one of the standout horror films of the year. Directed by James Watkins, the movie delivers a nerve-wracking experience from start to finish, leaving audiences on the edge of their seats. The film excels in building suspense through its minimalist approach. Rather than relying on jump scares, Speak No Evil creates a slow burn of dread, reminiscent of \"Funny Games\", using uncomfortable social interactions and sinister undertones to make the viewer squirm. The performances, especially from the lead actors, are outstanding. Their portrayal of seemingly normal people in increasingly disturbing circumstances adds a chilling layer of realism to the film. What makes Speak No Evil particularly effective is its exploration of human nature. It raises thought-provoking questions about politeness, boundaries, and the lengths people will go to avoid confrontation, even at their own peril. The film is not just a horror story but a disturbing commentary on the darker sides of social norms. If you're a fan of psychological horror that lingers long after the credits roll, Speak No Evil is a must-watch. The cast delivers powerhouse performances, bringing an eerie authenticity to the increasingly disturbing scenarios. The leads, in particular, masterfully capture the emotional and psychological unraveling of their characters. Their portrayal of fear, confusion, and desperation feels so natural that it becomes hard to separate the actors from their roles. They maintain a delicate balance between vulnerability and tension, making us feel every ounce of dread and discomfort the characters experience. What makes the acting so striking is how it enhances the film’s slow-burn horror. Rather than relying on traditional scare tactics, the performances build an overwhelming sense of dread through subtle, nuanced interactions. Even in quiet moments, the cast conveys an undercurrent of unease, leaving viewers constantly on edge, waiting for the inevitable horror to unfold. The chemistry between the actors is palpable, which makes the escalating tension in the story all the more effective. As their characters’ lives spiral out of control, the actors convey this descent with such skill that the viewer feels both emotionally invested and terrified for them. Overall, Speak No Evil is a haunting and unforgettable thriller, largely thanks to its superb acting. The cast's gripping performances ensure that the film not only keeps you hooked but also leaves a lasting impact long after the credits roll."
  },
  {
    "rating": "1/5",
    "review": "This is not real. Things like things don’t happen in real life. All you’ll get from this movie is anger. Everyone in the movie did a great performance but that doesn’t make it a good movie."
  },
  {
    "rating": "5/5",
    "review": "on the edge of the chsir"
  },
  {
    "rating": "5/5",
    "review": "James Mcavoy is a superb actor!"
  },
  {
    "rating": "5/5",
    "review": "Loved it it keeps you on your toes"
  },
  {
    "rating": "4/5",
    "review": "This is a really good movie. I got wrapped up in the story and enjoyed watching this movie!!"
  },
  {
    "rating": "4.5/5",
    "review": "Rating: 9.5/10. While this movie is a good bit cliche, the acting and genuinely fun interactions between the characters carries this movie above and beyond. It delivers a thought provoking theme of how society sees certain family/parenting styles, that I appreciated very much."
  },
  {
    "rating": "5/5",
    "review": "Masterpiece. James McAvoy kills it. This reminds me of something I was once told during a training. We as humans very often get ourselves into very bad situations because we try to be too polite. If something bothers you, you should act accordingly and because the protagonists in this movie don‘t do this, they get into a really bad situation."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie! The buildup gave me The Shining vibes but the payoff was awesome. Must-see!"
  },
  {
    "rating": "4.5/5",
    "review": "(NO SPOILERS) Any horror or Suspense film has its plot holes. This is a fantastic thriller which keeps you on the edge of your seat. People complaining about the dad being a puss or characters have no logic. I think they did a great job making you hate certain characters choices. We’re all human and different, we don’t and would not all react the same way. I think the acting was amazing and did just enough to give a 4.5/5."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie"
  },
  {
    "rating": "2/5",
    "review": "No esta mal, logra atrapar la trama... pero se hace muy larga y los personajes principales (el marido) es muy tonto, nada nuevo con la trama, además creo q esta un poco sobrevalorada."
  },
  {
    "rating": "2.5/5",
    "review": "Acting was great but I really hated the idea itself. It felt gross and wrong. How could a self respecting actor or producer agree to such an idea? It also made no sense logically. They would absolutely not get away with even one family like that. From a criminal perspective someone like that can go so wrong —it’s not real. The near-snuff stuff at the end leaves really bad impression. There are better movies in this genre like Funny Games."
  },
  {
    "rating": "2/5",
    "review": "plot was decent but executed terribly the Father in the movie was a scripted as an annoying idiot one big puss .. the acting was pretty good- just the plot was poor"
  },
  {
    "rating": "2/5",
    "review": "McAvoy is good in this... but the movie itself is a bad copy of the original foreign movie. Spend your time on the original movie over this, it's much better."
  },
  {
    "rating": "3.5/5",
    "review": "It started out very slow. The build-up could have been better. Also, the acting outside of the actor everyone knows, could have been better. But it does end well."
  },
  {
    "rating": "5/5",
    "review": "get ready to be on the edge of your seat with an anxiety attack. great movie"
  },
  {
    "rating": "5/5",
    "review": "Intense! Not what I expected! Doesnt disappointed"
  },
  {
    "rating": "4.5/5",
    "review": "The beginning was a little slow but when it got moving, it was SO GOOD!"
  },
  {
    "rating": "3/5",
    "review": "Took to long to get started"
  },
  {
    "rating": "5/5",
    "review": "What a mind blower! I was completely engrossed in the story and twists and turns that it took. In fact, I searched out the original version that was made years ago and it was similar but lacked a cohesive plot to hold it together. The ending of both films was harsh but the original was especially brutal. At least in the remake the family escapes. Nice touch!"
  },
  {
    "rating": "5/5",
    "review": "Slow burn, creepy sets in over time. Would recommend"
  },
  {
    "rating": "3.5/5",
    "review": "James McAvoy is hot when he's angry. Still feeling on edge from all that. That was a lot of fun. Great suspense. Great mix of awkward social and suspense thrills. Characters are fleshed out and interesting, shout out to Mackenzie Davis for having a very believable scared face and kicking the most ass. Villains are sick, well performed, with plenty of personality and memorable moments. What kind of kills the movie's plot is how there were multiple times I grew frustrated with the characters not making the obvious choice. Sometimes, I question why they don't ever just pick up the gun or something. The main kid actress did a good job overall but her character was frustratingly naive and slow. Maybe if they made her younger or in the spectrum, it would've made her innocence more believable. There was a moment in the middle where the movie could've just ended there but the kid in question did something so stupid that I found the entire rest of the film a little bit contrived. I felt like the ending forgot or at least lacked a satisfying conclusion to one of the character's arc. Felt like they were leading up to it but it ended up not coming to fruition. Anyways, the movie was fun, got my heart pumping, made me laugh uncomfortably, and James McAvoy proves we need him in more movies."
  },
  {
    "rating": "5/5",
    "review": "Hands down the best thriller I've seen in years."
  },
  {
    "rating": "1.5/5",
    "review": "In a movie we expect characters to behave a little less then normal. Its needed to move the plot along, but in Speak no evil the characters behave as if they have 0 ability to recognize any danger. Like an 80s slasher flic where the characters decide to hide in the cabin with 360 windows and no door only to \"suddenly\" be surprised that the killer is able to get in our characters make the dumbest decisions time and time again making for a terribly frustrating and emersion breaking watch. The fathers complete inability to make one rational choice or to show a glimmer of basic human intelligence makes him a particularly frustrating character. Had the killer seriously wanted them dead he could have simply handed the father a plastic bag and stopped watching him and he would have likely asphyxiated on his own in a few minutes. A fine example though of another of Hollywood's recent raft of poorly written male characters."
  },
  {
    "rating": "2.5/5",
    "review": "The original movie was much better because I don't like happy endings."
  },
  {
    "rating": "4/5",
    "review": "A great remake! Speak No Evil is a remake of 2022 Danish film which was also very good. This remake is dark, thrilling, and a bit different then the original. James Mcavoy gives a chilling and scary performance here. You just never know when his character is about to snap. This movie is about a family who befriend another family while on a trip to Italy. Soon the family we are following is invited to James Mcavoy's family farm house. Soon it becomes clear that something is quite off. This movie is very dark, thrilling, and an edge of your seat type of film. I enjoyed the differences that the Director implemented into this movie compared to the original. Speak No Evil gets a positive rating of 4 stars out of 5."
  },
  {
    "rating": "4/5",
    "review": "Amazing acting performance from the whole cast. Really wished it had the same ending as the original for a more impactful message. James McAvoy + Thriller Drama will never disapoint!!"
  },
  {
    "rating": "4/5",
    "review": "Slow but progressively gets better throughout"
  },
  {
    "rating": "4.5/5",
    "review": "The tension build up in this film is expertly delivered. James McAvoy seems so natural in this role and the juxtaposition of the two main male characters is fantastic. Really enjoyed this movie even if some of it was an uncomfortable watch"
  },
  {
    "rating": "5/5",
    "review": "Very much enjoyed this thriller. Mcavoy was great."
  },
  {
    "rating": "4/5",
    "review": "Interesting story, adequate flow of events, good acting. A work of cinema rarely seen today. I recommend you to watch it."
  },
  {
    "rating": "3/5",
    "review": "The movie was ok. Took to long for the excitement"
  },
  {
    "rating": "4.5/5",
    "review": "The movie has a very slow build-up, but towards the third act, it becomes more intense and gripping. Unlike the original Danish film, where the family simply let the villains do violent things to them, the characters in this American remake fought back and showed a strong will to survive. This contrast was quite striking; the original film's portrayal of the family's lack of survival instinct was frustrating, leading up to a very disturbing and shocking ending. In contrast, the American version was just nuts. I found myself clapping, cheering, and yelling because the scenes were so intense that I was on the edge of my seat. It also made me realize that excessive kindness and politeness can literally put you in danger. As a people pleaser myself, it hit me that I should start setting boundaries to avoid dangerous situations. Overall, the movie is really great. It has moments of humor and is engaging throughout. It's a shame that no one talks about it. It’s very underrated; there were only about five people in the theater. Hopefully, word of mouth will pick up because this movie deserved better at the box office. 🙌"
  },
  {
    "rating": "2/5",
    "review": "The trailer pretty much gave you what was going to happen. I was waiting for a twist and it didn’t come. It was pretty straight forward. James played the part well and was the bad guy. I was waiting for a twist the trailer didn’t show but that was it"
  },
  {
    "rating": "5/5",
    "review": "Really great suspense movie definitely got the heart rate up"
  },
  {
    "rating": "5/5",
    "review": "Soooo good. When James MaCavoy ✨"
  },
  {
    "rating": "5/5",
    "review": "No spoiler rewiev: I give 5 stars cause its about the end of the story. It's a horror film which has a good ending. That's the important thing. Story connecting with middle of the film and it ends well. We have a background story for ending but you need to little bit focus when you watching. You need to see which scene's are connected."
  },
  {
    "rating": "3/5",
    "review": "I like this movie, especially the acting and the sceneries. On the other hand, the ending is quite predictable, although i didn't know the film is a remake. Still a nice surprise as we decided to go to the movies at 22pm yesterday and this was the only movie that seemed interesting to me and my friend. Not my favorite, but thrilling and it didn't disappoint."
  },
  {
    "rating": "4/5",
    "review": "Great movie and plot. A bit the same story with the genre thing for the last years... the man is super weak and the woman \"saves the world\"."
  },
  {
    "rating": "4/5",
    "review": "James McAvoy couldn’t be any more suited for this role. His performance is absolutely brilliant! While it remains heavily influenced on its Danish predecessor, James Watkins is able to put his own refreshing originality into the film. Terrifying, unsettling, and at times painfully awkward, Speak no evil sets the standard and truly redefines what a “remake” should be!"
  },
  {
    "rating": "0.5/5",
    "review": "What you will leave with is disappointment with acute sadness. The introduction of the beauty, intelligence, empathy, and glimpse of strength in the main actress Mackenzie Davis is wasted. The repeated dumb choices the writer has inflicted upon the story, are what you expect to see with a clueless lacking a backbone to speak up woman, commonly in the horror movies of the days gone by cinema. The ending of her naked and murdered was lazy writing that sadly diminished the caliber of the entire movie."
  },
  {
    "rating": "5/5",
    "review": "This movie is purposely designed to have a slow build in order for the audience to become completely familiar and emersed in the experience of each character. There are plenty of \"warning signs\" to breadcrumb a trail towards a magnificent plot twist. This movie will have you squirming in your chair and at the edge of seat. If you enjoy the psychological thriller genre, this is definitely a must see."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Reminds me of a similar 5 star movie: Straw Dogs with Dustin Hoffman."
  },
  {
    "rating": "0.5/5",
    "review": "Lost my time and money."
  },
  {
    "rating": "5/5",
    "review": "Great story development. Great acting, McAvoy is an unbelievable actor in everything he does"
  },
  {
    "rating": "4/5",
    "review": "So I finally got around to seeing this film and while it's nothing new it still engages you start to finish. The whole cast puts in a good performance but it's James McAvoy who steals the show here. If you're not sure about this I would say give it a watch. I don't think yours be disappointed."
  },
  {
    "rating": "4/5",
    "review": "Two movies for the price of one. The first half would probably be best described as a \"cringe psychological drama\". If the viewer has social anxiety or is just shy, it is very uncomfortable to watch this film because you identify with the nice, polite American family who visit the home of a British couple they first meet on vacation in Italy, and then have to deal with their extremely and increasingly boorish behavior. This is a reversal of the stereotype of the \"ugly American\". The last half is more of a conventional thriller and is less interesting. Based upon the European film which had Danish and Dutch families. I don't know if this was made in the same part of the U.K., but it reminds me a little of 1971's \"Straw Dogs\"."
  },
  {
    "rating": "4/5",
    "review": "La premisa es buena, se siente que la historia avanza rápido dejando vacíos. Las actuaciones y el suspenso si me parecieron muy buenos. Es una peli para disfrutar de una historia simple y con poco miedo."
  },
  {
    "rating": "5/5",
    "review": "Amazing! Scary! Suspensful! I like it better than the original, although that one is good, too."
  },
  {
    "rating": "4.5/5",
    "review": "Another Blumhouse gem! McAvoy was fantastic and campy and over the top, and I loved it"
  },
  {
    "rating": "2/5",
    "review": "\"Speak No Evil\" comes from the quite reason original Danish one, with the same title. And with that, the twist is remarkably very predictable, and not close to original, despite a ludachris performance from James McAvoy, the product lacks a point, \"did we need a oh-so-soon remake...did we need a remake at all?\"."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Very tense. Highly recommended."
  },
  {
    "rating": "0.5/5",
    "review": "They turned a masterpiece into a common thriller. Hollywood rarely manages to convey real facts and emotions from the world. It lives in a dramatic bubble from which it cannot escape."
  },
  {
    "rating": "0.5/5",
    "review": "I find it quite sickening how the US likes to mask everything and throw the reality of the world to the sidelines."
  },
  {
    "rating": "4/5",
    "review": "Decent movie, fun watch. A little slow…"
  },
  {
    "rating": "4/5",
    "review": "This trope has been done so many times but James Mcavoy Carried as I expected. If you love a slow burn of a thriller you'll love this movie."
  },
  {
    "rating": "4/5",
    "review": "Definitely a movie to watch, great acting, fun experience"
  },
  {
    "rating": "2.5/5",
    "review": "I didn't know this was a remake until I left the theater. Once I found out, I could partially understand why the movie felt so tasteless to me. The technical aspects were barely adequate, reminding me of the cinematography from an average early 2000s TV movie. The camera was so static that it felt like I was watching the same shot over and over again. The plot development was quite flat and didn’t build any tension for me. Not even the unsettling performance by James McAvoy could save the day, and in general, the acting followed the screenplay in a way that made it all feel dull. With this premise, the rhetoric against capitalism and the system comes off as boring, and the movie doesn’t leave me wanting to explore deeper themes. In the end, the only feeling I have is wondering whether the original had more character and if this is just the typical Hollywood sugar-coated remake of a good idea."
  },
  {
    "rating": "0.5/5",
    "review": "Half of the movie is boring, full talking and slow pace, and main plot is just another typical story. Watch if you ran out of movies to watch."
  },
  {
    "rating": "3.5/5",
    "review": "Great film, I audibly gasped and didn't notice but for a solid 45 mins my hand was over my mouth in shock and anticipation. Some very uncomfortable scenes and I would give the good couples kid up for adoption for SPOILER ALERT them having to go back for her bunny but overall great watch."
  },
  {
    "rating": "2.5/5",
    "review": "First half is extremely slow. Then all of the sudden it turns into kind of a slasher flick. Dissapointing."
  },
  {
    "rating": "4.5/5",
    "review": "A solid film that gives you the creeps throughout. Well acted by all and thoroughly enjoyable."
  },
  {
    "rating": "5/5",
    "review": "Kept me on the edge of my seat the whole time!"
  },
  {
    "rating": "5/5",
    "review": "Brilliant Psychological Thriller. The way the plot builds up will keep you hooked to the movie from the first few minutes. I watched it twice in the theater."
  },
  {
    "rating": "4/5",
    "review": "Cleverly done, and enjoyable. Glad I watched this at a drive in because I was audibly reacting."
  },
  {
    "rating": "2.5/5",
    "review": "Worth seeing. McAvoy is great in the role and very entertaining if you aren't constantly holding it up to the original, as I was. Totally wimped out on the ending with the American version, though the European ending would probably traumatize some folks."
  },
  {
    "rating": "4/5",
    "review": "The movie was really good , I would definitely recommend it .had not seen a good movie like this in a while"
  },
  {
    "rating": "4/5",
    "review": "The American remake falls slightly short of the original but a must watch nonetheless. 5 stars for Mcavoys brilliant performance. Wow. Harnessing his inner psychopath, the actors unhinged range steals the show."
  },
  {
    "rating": "5/5",
    "review": "Such a beautiful movie!"
  },
  {
    "rating": "3/5",
    "review": "Played out plot you can see coming, and a twist that is a snooze. The last 30 minutes was a wonderful thrill ride full of jump scares. Too bad the first hour and twenty minutes wasn’t."
  },
  {
    "rating": "4/5",
    "review": "I feel like the movie started slow but the build up was decently done. It did keep me on my toes."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed it. I enjoyed the music and found the uncomfortable moments hilarious. I keep thinking about the moment when the two guys are driving and Jame M. Character is singing and looking directly into the other Character eyes. So funny 😁"
  },
  {
    "rating": "3.5/5",
    "review": "It had some excitement, decent story line. Great actors.. little slow at first"
  },
  {
    "rating": "3.5/5",
    "review": "Slow developing pot of mayhem, that once boiling, makes the wait worthwhile !"
  },
  {
    "rating": "5/5",
    "review": "I liked the scenery and plot. I liked how the woman was strong minded and her husband was weak in character. I liked James McAvoy as a psychopath hes a great actor. Finally it was believable no magic crap."
  },
  {
    "rating": "3/5",
    "review": "When it comes to the Psychological horror side of this movie they hit it right on the nail. I was consistently tense throughout the movie. When it comes to the up front horror this was a success. My only critiques for this film are how they used a little too much political agenda, how the daughter was extremely cringe, and how Louise was just a terrible character. What saves this film is how she redeems herself later on in the film."
  },
  {
    "rating": "3/5",
    "review": "I watched the original one, and i think it was way better, a lot darker and also- SPOILER- with no happy ending. This one is cute, not so original or creepy like the first one. I think it's an horror made for the average spectator who loves horror movies but \"not the bad ones\" iykyk."
  },
  {
    "rating": "5/5",
    "review": "Excellent, suspenseful!"
  }
]