{
  "movie_name": "Companion",
  "reviews": [
    {
      "rating": "1.5/5",
      "review": "The comedy and social commentary in this movie are weak, despite Sophia Thatcher and Jack Quaid's outstanding performances. It isn't sure if it wants to be a thriller or a comedy. Someone who is more adept at fusing comedy and horror, in my opinion, could have performed better. Older films and sci-fi television shows have done this in considerably better ways."
    },
    {
      "rating": "5/5",
      "review": "Great script, great directing. Can't believe it's the director 1st film. Very entertaining. Loved it"
    },
    {
      "rating": "3.5/5",
      "review": "A film I started watching, at first, and hated. Then, every ten or so minutes went by, I enjoyed it more and more. A wild and interesting film that actually was mostly well executed and had something significant to say, by the end."
    },
    {
      "rating": "5/5",
      "review": "The trailer which I saw, set this out to be some sort of slasher movie. A review said it was something very different and I like Jack Quaid as a human, and so I watched it. I was very pleasantly surprised by the tone of the movie and I really enjoyed it being somewhat lighter toned dark comedy. I would recommend if you don't mind a new take on the 'rogue robot' genre. Sophie Thatcher really does some great heavy lifting with emotional acting and dialogue."
    },
    {
      "rating": "5/5",
      "review": "I was trapped watching a brilliant movie. Tense and great story line. Didn't read reviews or synopsis on purpose so I had no idea what this movie was about. Loved it."
    },
    {
      "rating": "4.5/5",
      "review": "Really well done movie, like an episode of black mirror and possibly a future reality, as AI becomes more developed. I really liked the characters, for some reason Jack Quaid just really pulls off this type of diapicable character. At first it seems like something you have seen before in other movies, but the writing and acting is really well done and entertaining. Watch it."
    },
    {
      "rating": "3.5/5",
      "review": "This movie is so much better if you do not watch any trailers beforehand. Overall, it is still enjoyable. I wish they would have done more with the premise, but still very entertaining and Sophie Thatcher is great as always."
    },
    {
      "rating": "5/5",
      "review": "This is definitely the kind of movie that keeps you on the edge of the seat! The acting was breathtaking and even with sci-fi themes, the overarching theme resonated with me."
    },
    {
      "rating": "5/5",
      "review": "\"Companion\" is a 2025 horror/thriller that keeps you on the edge of your seat the whole Flim. Now sure if you have seen the trailer it gives away the plot twist, but there are so much more twists and turns that this movie has, that it will have you wondering what will happen next. Now it can be a bit slow at times but other than that it was a great in depth view into today's society and just how far people will go for some wealth and satisfaction."
    },
    {
      "rating": "4.5/5",
      "review": "It's a kind of fresh movie, very enjoyable"
    },
    {
      "rating": "3.5/5",
      "review": "I love a good dark comedy and this movie hit the mark. There were a few moments I didn't like but it was an overall enjoyable watch."
    },
    {
      "rating": "5/5",
      "review": "A great movie with strong acting. A good level of comedy and violence. It's a interesting and unique story. Would for sure recommend."
    },
    {
      "rating": "4.5/5",
      "review": "A Sci-Fi Thriller Classic. The ideas explored here from Robots, love, humanity and where the moral lines between all of them are drawn are really well done and doesn't really offer many answers to such complex topics. But what it does offer is a pretty satisfying revenge thriller in place of answers. The acting and soundtrack are pretty solid and everything else is really well done. Iris is really good and the best thing acting wise. Everyone else is solid but not as fleshed out especially the supporting characters who blend in a bit. Josh is good but fasinating watching how our feelings towards him turn into a complete 180 the more things go on. the direction is pretty solid, the setting is memorable, and this makes very clever use of 2020's technology in a very clever and witty way. This is half a Sci-fi movie and half revenge movie which works quite well. There are a few suspension of disbelief moments in this like how this has never happened before and no one knows about this. Or how Josh is able to jail break Iris to begin with pretty easily. And how why he doesn't turn her off instantly after the Sergei incident. Also it explores a lot and can be slightly jumpy with so many ideas that it touches in different ways but works quite well. Despite those issues where it asks you to just forget about certain plot holes everything else is so well done and so much is explored that it's so easy to forgive it and become immersed in it. Anyone who is a fan of Sci-Fi, Thrillers, revenge flicks, or any actors in this or the director should give this a try. One of the biggest suprises of the year."
    },
    {
      "rating": "4/5",
      "review": "This science fiction thriller follows a couple on a weekend getaway with friends at a remote cabin, which unravels into chaos after a revelation that one of the guests is a subservient android built for human companionship. An excellent concept that is impressively executed, with Sophie Thatcher delivering a standout performance as the emotional anchor of the film. Reminiscent of a Black Mirror episode, the story is full of clever twists and maintains a gripping pace. What sets it apart is its refreshing perspective: instead of portraying AI as a threat, the narrative flips expectations, making the audience empathize with the android’s journey toward freedom. The ending is both bold and satisfying, making this a thoughtful and thrilling ride."
    },
    {
      "rating": "4/5",
      "review": "“Why do people do bad things? Dark comedy, about the horrors of technology Negative they spell it out what the movies about? The messaging toxic relationships control, manipulationunfortunately have personal experience people that just wanna play thing toy,greed is poisonous,matter of control"
    },
    {
      "rating": "5/5",
      "review": "LOL, 1 hour and 37 minutes of humor and drama!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "5/5",
      "review": "Black mirror as a movie. Love a little mindfuck. Also fun seeing what Guillermo has been up to"
    },
    {
      "rating": "4/5",
      "review": "Fun to watch, but less twists and turns than you'd expect for a movie that gives some of them away from the trailer. The lead actress does an excellent job. The premise is interesting. It wasn't really scary in any way, though."
    },
    {
      "rating": "0.5/5",
      "review": "Your trailer TOATALLY ruined the surprise. I was hoping there would be something else interesting that happens. Or that it wasn't really about them being robots. But that's literally the whole plot. Movie would have been interesting if y'all didn't spoil it."
    },
    {
      "rating": "3/5",
      "review": "once the movie showed iris was a robot the entire time and it was about josh using people just to kill someone for money this movie went downhill there’s good acting but story is awful 79%"
    },
    {
      "rating": "0.5/5",
      "review": "\"Companion\" was a complete waste of time. The story was uninspired, predictable, and made little sense. It felt like the filmmakers had no fresh ideas and just recycled tired tropes we've seen a hundred times before. There was no emotional depth, no surprises, and nothing to make it stand out. I kept hoping it would get better, but it only got more confusing and frustrating. Definitely not recommended."
    },
    {
      "rating": "4/5",
      "review": "Sophie Thatcher is quickly on her way to being one of Hollywood’s biggest stars- and this movie is no exception. My biggest complaint is that the trailers gave too much away. The film would have had a bigger impact had the twists of the film hadn’t been revealed before the viewer even turned it on. But the idea is fresh and new, and all cast members earned their cookies. Jack Quaid tries his hand at being a villian- and while it’s not his best performance in recent times- it definitely is worth watching. Worthy of date night for sure."
    },
    {
      "rating": "4.5/5",
      "review": "Honestly, sad I waited so long to watch this."
    },
    {
      "rating": "3.5/5",
      "review": "I actually I enjoyed it. It could have been worse but the director managed it to be sinister-entertaining. Almost Ez-machina from a different point of view."
    },
    {
      "rating": "5/5",
      "review": "Fantastic story, acting, graphics, total payoff. Very well done. Like Stepford Wives meets Die Hard."
    },
    {
      "rating": "4/5",
      "review": "SPOILERS AHEAD: I really enjoyed this film. It was a strong showing overall, and Sophie Thatcher is one of the best up-and-coming actresses working today. Her performance here only reinforces that, and I'm genuinely looking forward to seeing more from her. I'm currently watching Yellowjackets after hearing she was in it, and she’s absolutely a scene-stealer there as well. She brings an intensity and presence that elevates every moment she's on screen. Back to the movie, what stood out most for me was the character arc of Iris. Her transformation, the way she strategically formulates a plan for escape and revenge, and ultimately fights for her own redemption—despite not being human—was both powerful and satisfying. You genuinely root for her, and her eventual peace feels well-earned. One of my favorite moments was when she programmed herself to speak only in German to the police officer. It was a brilliant move by Iris and flawlessly delivered by Sophie Thatcher, who completely nailed that scene. This was a smart, emotionally resonant sci-fi thriller film with a standout performance at its core. Also, good acting by Jack Quaid and Lukas Cage. I’d give it a solid 4 out of 5 stars."
    },
    {
      "rating": "4.5/5",
      "review": "Dug the movie. Good acting and a creepy concept about the near future. Good entertainment."
    },
    {
      "rating": "3.5/5",
      "review": "Slick, well produced sci-fi themed film. Acting performances and direction were quite good but the third act dragged and hit a few potholes, else it would have been a four star."
    },
    {
      "rating": "5/5",
      "review": "Unexpected... And really well made. Very entertaining to watch."
    },
    {
      "rating": "4/5",
      "review": "Entertainment that can exceed expectations as long as you know NOTHING about the plot and enjoy something that “mixes” relevant and current issues in a well-written, directed and produced suspense and comedy. Now, for those who have an idea of what is going on, it may not be the “seventh wonder” of the world, but it is still a good movie to watch with the perfect companion."
    },
    {
      "rating": "4/5",
      "review": "Companion was a good movie. Great job by the cast , they made me really believe they were robots. I enjoyed the plot. I would’ve wanted more gore and violence scenes. Will we ever learn from robot movies? Probably not. I would recommend this movie."
    },
    {
      "rating": "5/5",
      "review": "I was absolutely shocked at how good this movie is. I didn't expect anything from it at all. I thought I would just play on my phone while it played in the background. But no. This was one of the best movies I've seen in a long time. This gave me faith that Hollywood might be able to dig it's way out of the horrible slump they've been in for the past half decade. If they can keep up this level of creativity, they might have a chance. Watch this movie!"
    },
    {
      "rating": "3/5",
      "review": "Given the reviews I thought it would be great but it ended up being quite slow and with a plot we’ve seen many times before. It didn’t have enough new elements to make it stand out and a lot the times the scenes just dragged. Ok to pass the time but not great"
    },
    {
      "rating": "4/5",
      "review": "An intelligent, independently produced twist on the AI robot story. Not so much violence or gore as twists and turns of the plot. Watch the 6 minute \"extra\" if available. Enjoyed it as much as the first time I watched \"Ex Machina\"."
    },
    {
      "rating": "4/5",
      "review": "Almost a horror comedy in a lot of ways. Clever and fun. We had a great time."
    },
    {
      "rating": "4/5",
      "review": "This was a pleasant surprise. More like an eerie surprise. I mean, I knew it was about a robot and figured she wouldn’t wanna die, but I appreciated the dark comedy part of it and it was good to see Huey from the boys do a little stretch here and play the bad guy. Entertaining and enjoyable."
    },
    {
      "rating": "4/5",
      "review": "Convince me that this film's plot is not a parallel to The Matrix. When the titular character says \"No\" toward the end's climactic scene, paralleling Neo when he said \"no\" to the agents attempting to subdue him to his fate ... yeah, this movie definitely sourced its inspiration from the Matrix plot, and I am for it. Cheeky at times, but worth the watch. At least once,"
    },
    {
      "rating": "4/5",
      "review": "Original and Smart! Companion is one of those movies that you think you know what it’s going to be about from the trailers but it’s different. Companion is smart, dark, and entertaining from start to finish. In fact I enjoyed this film a lot more then I probably should have. The movie has very strong performances from it’s leads with Sophie Thatcher and Jack Quaid. This is a spoiler free review so I won’t ruin any surprises here. Just know that you are in for a treat. My only minor complaint is I wish we got more time to spend with the characters to flesh their backstories out. Companion is one hell of a wild ride and you’re going to enjoy it. Companion gets a high 4 stars out of 5 from me."
    },
    {
      "rating": "3.5/5",
      "review": "While not exactly novel, the narrative weaves motifs with excellence and the closure is stone skipping smooth. Unfortunately, the dent in rating stems from too narrow a scope leading to lack of creative genius and is missing beauty."
    },
    {
      "rating": "4/5",
      "review": "In the future. You can buy companion robots. Everything goes awry when you start messing up with them. Cool thriller. Good story 🍿🍿🍿🍿/5 on Max"
    },
    {
      "rating": "4/5",
      "review": "Fun, dark, unique violent comedy, with a fun twist. Young couple goes away for a weekend with friends at a rich older Russian guy’s house in the woods. Definitely not as cliche as it sounds. Don’t watch the trailer. Don’t learn anything about it. Go in cold. Have fun."
    },
    {
      "rating": "5/5",
      "review": "Many twists and turns to this; A very good movie. Original and a must see!"
    },
    {
      "rating": "5/5",
      "review": "Smart horror that makes you think without being too too gory."
    },
    {
      "rating": "3.5/5",
      "review": "Very enjoyable, albeit sometimes really gross, film, but extrememly derivative. Obvious idea lifts from Blade Runner, Ex Machina, and Westworld (the show)."
    },
    {
      "rating": "4/5",
      "review": "Companion is a really cool movie. It hooks you from the beginning and never lets you go. I was glued to the screen the entire time. I found this to be be refreshing and fun. Great concept and twists. I didn’t know much of anything about this film aside from the first trailer and that was for the best. It helped to not know much going into this because I ended up being pleasantly surprised by it. Overall, this was an awesome and entertaining movie if you’re looking for something different or out of the box to watch. Definitely recommend."
    },
    {
      "rating": "0.5/5",
      "review": "Yeah these reviews must have been paid for by the director cus this movie was laughably bad. Felt like every shot was shot on an iPhone on a tripod. Me and my gf had fun watching it only because we were eating food and drinking wine during it. Sophie Thatcher was alright. Yeah."
    },
    {
      "rating": "5/5",
      "review": "Starts slow and silly, but develops into a fun, silly, and complex (ha ha ha) story. LOL"
    },
    {
      "rating": "2.5/5",
      "review": "You don’t have to be smart to feel smart watching this movie."
    },
    {
      "rating": "4.5/5",
      "review": "Extremely well made and acted, and quite creative and violent, doesn't always make sense, reminds me somewhat of M3gan."
    },
    {
      "rating": "2.5/5",
      "review": "Josh is a total douche."
    },
    {
      "rating": "4/5",
      "review": "Way better than I thought it would be."
    },
    {
      "rating": "2.5/5",
      "review": "Didn't really make logical sense, the male lead has this super intelligence robot, instead of using that super intelligence for his aims, he does what he does. Don't wanna spoil anything, but pretty sure your companion could've come up with a much better plan. I think the direction went the wrong way and the story could've gone to a more interesting place instead of where it ultimately ended up."
    },
    {
      "rating": "5/5",
      "review": "I was surprised. I didn't think I would like it or even watch the whole movie, but from the start it caught my attention. It is clever, creative and funny (at times). There's a lot of blood, but we all know movie blood isn't real. There are twists and turns and some surprises, but some foreshadowing takes some of the surprises away. So, in short, I liked it and will probably watch it again."
    },
    {
      "rating": "3/5",
      "review": "I never got locked in, The film leaves people with some great insight tho. The internet is getting flooded with fake AI PEOPLE! Somebody is playing god with this new technology, making money off of social media-onlyfans fkn you name it with fake HUMANS. If your awake enough to read this and know what im talking about, this movie is a great example of whats to come of it. Insanity simulator"
    },
    {
      "rating": "5/5",
      "review": "Es un absoluto deleite cinematográfico. Sophie Thatcher deslumbra como Iris, entregando una actuación cargada de carisma y vulnerabilidad que sostiene la película. Combinando humor, suspenso y una reflexión ingeniosa sobre la dependencia tecnológica, mientras que la dirección visual estilizada y la banda sonora potencian la experiencia."
    },
    {
      "rating": "3.5/5",
      "review": "A well made interesting diversion. Not great but definitely worth watching."
    },
    {
      "rating": "4/5",
      "review": "This is the best robot-romance movie I’ve seen, even better than Ex-Machina. There are quite a few surprises that make for an interesting watch. It makes you wonder about the future of AI/robots and humans desire to blend them into everyday life. It’s entertaining and thought provoking, you can’t ask for much more out of movie."
    },
    {
      "rating": "3/5",
      "review": "Entretenida, con uno que otro tópico interesante pero lastimosamente no aborda ninguno a profundidad Se queda como lo que es y funciona"
    },
    {
      "rating": "2/5",
      "review": "It is somewhat original, but it is just not engaging. The plot twists and turns are predictable and not that invigorating. The underlying message of having casual relationships is not well presented. Entire movie was flat throughout."
    },
    {
      "rating": "4.5/5",
      "review": "I feel like the director wrote the first half of this movie… took a breath… then really took his time making the last half make sense & enjoyable. There were some clever (not too big) twists that accompanied the big twist that really made this movie good. There was attention to detail in the story that usually horror movies look over. This movie used those details for comedic relief and that’s what made this move go the extra mile. Great start to 2025!"
    },
    {
      "rating": "0.5/5",
      "review": "😭 🙅🙅🙅😭 🙅🙅🙅🙅🙅🙅"
    },
    {
      "rating": "4.5/5",
      "review": "A well written dark comedy with soft sci-fi exploring a potential future where the relationships of humans and AI's are just as messy as that of humans."
    },
    {
      "rating": "4.5/5",
      "review": "Watched at home with my wife and was surprised at how entertaining this movie was. 👍"
    },
    {
      "rating": "5/5",
      "review": "Super entertaining, such a different take on a thriller. Worth the watch."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining, and a refreshing change!"
    },
    {
      "rating": "3.5/5",
      "review": "I would not define this as horror, but maybe some would. Sophie Thatcher was excellent and Jack Quaid was very good as well. It was fun, good script and very funny at times. I loved the \"Iris\" wardrobe! I kept saying \"Great outfit!\". Very 50's or 60's, really worked with who Iris was!"
    },
    {
      "rating": "4/5",
      "review": "Una de las sorpresas del año, pensaba que seria una película normal pero realmente logra resaltar, definitivamente la recomiendo"
    },
    {
      "rating": "2/5",
      "review": "Like a shallow and poorly acted Black Mirror episode."
    },
    {
      "rating": "4/5",
      "review": "I wanna see Sophie everywhere! Not bad movie but forgettable"
    },
    {
      "rating": "4.5/5",
      "review": "Very cool film. It was great not having any idea what this film was about because the reveal is awesome"
    },
    {
      "rating": "4/5",
      "review": "I must admit, having no idea what the movie is about has put me in a position to be constantly surprised. I stayed away from the film’s trailer or any clips so I had no clue about the plot. Surprise, surprise! When Sophie’s character was narrating during the first few seconds of the film, it already introduced an idea to the audience about its nuances: rom-com, gory, thriller. And I thought, this is another suspense thriller movie. The surprise element of the movie came sooner than expected and it’s one of the several things I appreciate in the film. It’s fast paced and unapologetic of being blunt. It’s straightforward right from the start when Sophie Thatcher’s character mentions killing his goofy boyfriend at the onset of the film.  The message of the film may be clear: AI being dangerous to the society, bots making a dark turn and harming humans. However, the film’s vision did not disappoint and generously delivered the action-filled sci-fi storyline that the audience deserved. The narrative benefits from great comedic timing, it got a chuckle out of me at times. This speculative thriller is innovative and clever, with a masterful plot, rapid action, and a sharp sense of wit. All the elements in the film perfectly blend together and create an entertaining story. A cast could also make or break a movie but everyone played the characters well. Sophie Thatcher and Jack Quaid both delivered amazing and consistent performances. Their performances played a key role in elevating the film. Director Drew Hancock has crafted a sophisticated and fresh Sci-Fi film, with Eli Born’s cinematography playing a pivotal role in bringing the vision to life. The film is not perfect, it may have a few minor flaws, but it’s definitely worth overlooking.  I recommend this movie 100%."
    },
    {
      "rating": "4/5",
      "review": "Woman power agenda, but that's ok"
    },
    {
      "rating": "4/5",
      "review": "More fun than expected"
    },
    {
      "rating": "5/5",
      "review": "Baita crítica social, mas também uma produção bem feita, com uma ótima atuação de todos. Previsível, mas ainda assim uma experiência muito divertida, reflexiva, indignadora e provocativa."
    },
    {
      "rating": "5/5",
      "review": "phones on 4% just watched it and bro Its a solid watch. Love iris!! Badass b. Absolutely"
    },
    {
      "rating": "0.5/5",
      "review": "The entire movie only happens because the humans act like morons at the beginning of the movie to set things in motion. Premise is good, but don’t insult viewer’s intelligence by having everyone do everything a stupidly as possible to kick off the story. These writers couldn’t come up with anything better? Come on…"
    },
    {
      "rating": "5/5",
      "review": "Beep boop Black Mirror"
    },
    {
      "rating": "4/5",
      "review": "It was fun! There was a little something missing that I can’t put my finger on"
    },
    {
      "rating": "4/5",
      "review": "Really good movie that is a whole lot of fun."
    },
    {
      "rating": "4/5",
      "review": "Appart from a few things where you have to suspend disbelief(which happens in most movies), and a few forced and overlong parts with 2 certain characters, that only seem to exist to inject ceetain agendas that plague movies these days, this was a pretty solid movie, and very creative/original in many aspects. Definitely recommend it!"
    },
    {
      "rating": "5/5",
      "review": "Companion is a surprising popcorn thriller with twists to spare. The writer and director play their cards close to their chest, so as not to spoil what may come about in this subversive tale of AI love. Sophie Thatcher and Jack Quaid are both brilliant in their leading roles. Even though Iris is a robot, she possesses more heart than any of her human co-stars, and we find ourselves rooting for her. Companion is bold, stylish, and unapologetic, and for those reasons I can’t recommend it enough."
    },
    {
      "rating": "5/5",
      "review": "Absolutely brilliant script and amazing acting. Loved it."
    },
    {
      "rating": "4.5/5",
      "review": "A fun take on AI sentience bundled in a murder plot. It's fun. It's creepy. Check it out."
    },
    {
      "rating": "4/5",
      "review": "Damn that wasn't bad at all ✌🏾"
    },
    {
      "rating": "4/5",
      "review": "Don’t watch the trailer, they always give too much away. But Sophie thatcher and Jack quaid did a really good job. They play off each other so well. It’s a great creepy cabin in the woods flick, just wished at the beginning they could have left the ending a little more ambiguous. But there’s tons of twists and turns before they get to that anyway. Definitely recommend"
    },
    {
      "rating": "5/5",
      "review": "Jack quaid of red letter media fame is boss but women are people too. Must see."
    },
    {
      "rating": "4/5",
      "review": "i really quite enjoyed this - i thought it was a fairly original take on the over-abundant killer AI/robot trend that's been everywhere lately."
    },
    {
      "rating": "0.5/5",
      "review": "I'm confused as to why this was advertised as horror or comedy. Scifi/thriller makes sense, but don't expect much of either element. Very insubstantial."
    },
    {
      "rating": "4.5/5",
      "review": "i’m not sure how harsh my future reviews are gonna be haha first one. I thought it was well written and fun and you (spoiler) end up rooting for the AI which is cool. (i think no real spoilers past here) There’s been more groundbreaking movies i am sure and this idea isn’t like crazy new but the way they did it was awesome and the chick in it is really likable she was in heretic too and i really liked her in that. Overall tots worth watching and I think most people would like it hence the high review. Spoilers:: Only real criticism is that the marketing made it really obvious she was a robot and same with how quickly they reveal it. If we had more time to get to know her / them and maybe even envy josh and Iris at a couple then we’d have had a bigger ah ha moment. Plus it would make Josh a more dynamic character if we’d at least started to like him a little as a boyfriend first. If i end up like only giving 4.5 stars to fantastic films and 5 to the best ever then i may revisit my rating to a 4 haha. i don’t love gratuitous gore in movies even tho duh its what a horror movies made for but thats personal bias so id say the gross gory stuff was well done haha really gross and gory ++. All in all def worth watching and remembering hence taking the time to write this basically for myself haha."
    },
    {
      "rating": "4/5",
      "review": "This was a well done blend of horror/sci-fi/comedy that kept me entertained and off of my smartphone"
    },
    {
      "rating": "0.5/5",
      "review": "So bad, no other words"
    },
    {
      "rating": "5/5",
      "review": "This was an incredible take on an already done concept. Robots and AI aren't new but the spin that was done with this movie is to be remembered and to be praised for its greatness."
    },
    {
      "rating": "4/5",
      "review": "Companion is a genre-defying thrill ride—darkly funny, wildly inventive, and relentlessly intense. With standout performances from Sophie Thatcher and Jack Quaid, Drew Hancock delivers a smart, stylish, and unpredictable film that keeps you guessing at every turn. From razor-sharp writing to gripping visuals and a killer score, it’s one of the boldest cinematic experiences of the year. A must-watch."
    },
    {
      "rating": "5/5",
      "review": "Yes, it’s a sci-fi thriller with a good story line and done in a way that surprisingly isn’t cheesy."
    },
    {
      "rating": "4.5/5",
      "review": "It's not often I can't see what's coming, this movie was very captivating. Very much worth a watch!"
    },
    {
      "rating": "4/5",
      "review": "Really fun journey. I just wish they hadn't given away so much in the trailer."
    },
    {
      "rating": "5/5",
      "review": "Jack Quaid and Sophie Thatcher's performances are admirable, especially Sophie's. The film isn't boring and the pace is very good. I loved it."
    },
    {
      "rating": "5/5",
      "review": "I have to admit, I was completely mistaken about this movie. For a whole month, I kept putting it off, laboring under the assumption that it would simply be another entry in the well-worn genre of AI-gone-wrong films, filled with cold, emotionless robots embarking on destructive rampages. How wrong I was! This film truly stands apart. It distinguishes itself from the multitude of AI movies in several remarkable ways. It's a refreshing and unique take on the subject matter. First and foremost, I must give immense credit to the exceptional performances of Sophie Thatcher and Jack Quaid. They both delivered truly captivating portrayals that grounded the film in a powerful sense of realism and empathy. As an audience, you don't just observe the characters; you genuinely connect with them, investing in their emotional journeys. Their performances draw you in and make the unfolding events feel deeply personal and relatable. The chemistry between them is palpable, further enhancing the film's emotional core. The plot itself feels remarkably plausible and natural, which is a testament to the skillful storytelling. It doesn't rely on outlandish, far-fetched scenarios, but rather explores themes that resonate with our current reality and the trajectory of technological advancement. The narrative unfolds in a way that feels believable, making the film all the more compelling. And let's not forget the masterful direction of Drew Hancock. Hancock's vision and execution are evident in every frame, guiding the film with a steady hand and creating a cohesive and immersive cinematic experience. The pacing is excellent, allowing the story to unfold gradually while maintaining a sense of engagement. The visual language of the film is also noteworthy, contributing to the overall atmosphere and emotional impact. I wholeheartedly recommend this movie. It's an ideal choice for a date night, offering plenty to discuss and reflect on afterward. It's also perfect for a movie night with friends, providing an engaging and thought-provoking experience that I can guarantee you won't regret. This isn't just another AI movie; it's a film that explores the complexities of human-technology relationships with nuance and depth."
    },
    {
      "rating": "4/5",
      "review": "Fun movie but not for the faint of heart. It's horror but not horror, romance but not romance, sci-fi- but strangely not sci-fi."
    },
    {
      "rating": "2.5/5",
      "review": "The film started slow and ended slow. Every action was so predictable that I could have written the script myself. Nothing new. Nothing interesting."
    },
    {
      "rating": "4/5",
      "review": "It's a fun film that doesn't take itself too seriously."
    },
    {
      "rating": "1/5",
      "review": "It would have been so much better had they stuck to little bit of reality. But, after the first major event they sit there delaying, chatting it up despite the reality of the situation suggesting they call the authorities immediately. That's as far as we got. Sorry for the lack of detail but I don't want to spoil it for anyone else."
    },
    {
      "rating": "5/5",
      "review": "like a black mirror episode. very interesting and realistic possibility of the future"
    },
    {
      "rating": "5/5",
      "review": "I don't care that it is only April - I think Companion is going to be one of the best movies to come out of 2025. It was nuanced, clever, and most of all interesting. Never a boring moment, and the ending could not have been better! Already one of my top 5 favourite films of all time."
    },
    {
      "rating": "4/5",
      "review": "Sophie Thatcher is the reason to watch this propulsive thriller. She steals the show in every scene. A fun contraption with little new to offer, but so well executed that it doesn't really matter. The reliably annoying Jack Quaid is here as well..."
    },
    {
      "rating": "4/5",
      "review": "It's solid through and through - smart, funny, well-made, entertaining - though not particularly scary. However, it's the movie's razor sharp satirical take on the societal idea of 'the one true love', that makes it stand out from the other of todays 'slick'-horror movies. It actually has some pretty profound ideas at times."
    },
    {
      "rating": "3/5",
      "review": "The film works for a few reasons: director Drew Hancock, actors Sophie Thatcher (Heretic) and Jack Quiad (The Boys) more than earn their pay, the robot effects were pretty good and the script was solid. At times I felt myself oddly rooting for the villian (Quaid) though I suspect that was Hancock's intention. Also the movie's second act was less predictable than I expected, thank goodness. Overall an above average effort that most cinephiles should enjoy, and a few may even love."
    },
    {
      "rating": "4/5",
      "review": "Fun with just enough meaning to not feel pointless."
    },
    {
      "rating": "1.5/5",
      "review": "Somewhat entertaining in spots but mostly boring and slow. No big surprises or twists once the jig is up—and viewers see what's happening straight away so there's no meaningful tension or buildup. The overall premise is flimsy and hollow."
    },
    {
      "rating": "1.5/5",
      "review": "I think it would be much more interesting if the robot were male and the owner was female. What does a woman do with her male companion behind closed doors? Do other women get jealous of her robot? Do men?"
    },
    {
      "rating": "4.5/5",
      "review": "Sophie Thatcher was the bomb in this one. Loved this movie from start to finish. A must watch!"
    },
    {
      "rating": "3.5/5",
      "review": "Definitely not scary more of a action movie/horror movie. Though it was still entertaining to watch"
    },
    {
      "rating": "4/5",
      "review": "Excellent contained thriller. Decent social commentary, but just good writing in general. So many dots to be connected as the story unravels. Pretty funny, could've gone harder with the comedy (perhaps), but funny in general, and a very good coming to life story. Turns clichés on its head, which shows the superiority of the intelligence of the flick. Jack and Sophie are two awesome, aweosome performers coming up. Lukas Cage is also pretty cool, I remember seeing him in You once, and really liking him, and he is now breaking out. This is a very solid flick to watch. Thank you!!!!"
    },
    {
      "rating": "3.5/5",
      "review": "The first half is good, but the ending is just boring as hell."
    },
    {
      "rating": "5/5",
      "review": "i actually loved this movie. Sophie is an amazing actor and i’m so happy to see that she’s getting noticed. the acting in this movie was very good and suspenseful. Loved it a lot"
    },
    {
      "rating": "3.5/5",
      "review": "This felt like an extended episode of Black Mirror. But it would have been much better if they hadn't told us at the very beginning how it would end!"
    },
    {
      "rating": "4/5",
      "review": "The movie had a unique concept, blending humor and thrills effectively. Jack Quaid and Sophie Thatcher stood out with strong, convincing performances. The runtime was just right to keep things engaging, though the ending felt slightly stretched. Overall, it was an enjoyable watch"
    },
    {
      "rating": "1.5/5",
      "review": "Lame story line, quirky and too unrealistic."
    },
    {
      "rating": "5/5",
      "review": "Really good plot. Interesting from beginning to end. I really enjoyed this movie. Great ending."
    },
    {
      "rating": "3/5",
      "review": "It was fun, sure. But not scary enough to be a horror film, or funny enough to be a comedy. Some plot holes (like Josh not telling Iris to go to sleep when he was outside the car or on the phone with her) just felt a little too big to ignore."
    },
    {
      "rating": "4/5",
      "review": "Deep and chilling; the thought of a future like this. always love when the female protagonist gets justice in the end. very good movie"
    },
    {
      "rating": "3.5/5",
      "review": "You get sucked in. That's all I can say!"
    },
    {
      "rating": "5/5",
      "review": "Good movie and amazing experience to watch in Max. I hope there movie about robots."
    },
    {
      "rating": "5/5",
      "review": "Interesting, funny, great story."
    },
    {
      "rating": "4.5/5",
      "review": "Very good concept. Very Nice too watch from beginning to the end"
    },
    {
      "rating": "5/5",
      "review": "Sophie Thatcher and Jack Quaid are great in this movie. It’s clever and a bit of a commentary on the relationship between the sexes without taking away from the entertainment value. I enjoyed it and was captivated during the entire movie. Great cast and clever premise. Highly recommended."
    },
    {
      "rating": "4.5/5",
      "review": "Las películas de ciencia ficción que me gustan. Sencilla, con una trama que no se la complica demasiado y aplica los giros en el momento justo, la dosis justa de corazón y suspenso, buenas actuaciones y lindo paisaje. Eso si llegue acá sin saber NADA de la trama y por lo que veo el propio marketing de la película revelaba demasiado, no se cuando las compañías van a entender que tienen que dejar de hacer eso. Entretenimiento puro y duro, vale la pena."
    },
    {
      "rating": "2.5/5",
      "review": "Just fun enough to look past the plot holes and well worn tropes."
    },
    {
      "rating": "5/5",
      "review": "I LOVED THIS MOVIE! I've been waiting for it to finally come to Max, and I watched it immediately. It was even better than I thought it would be based on the trailers I watched."
    },
    {
      "rating": "3.5/5",
      "review": "Twists and turns abound in this original horror film that sends the audience home happy!"
    },
    {
      "rating": "3.5/5",
      "review": "Aside from being able to decipher the majority of the plot before it happened, it was a decent film. I like the unique perspective of this film on robots."
    },
    {
      "rating": "1.5/5",
      "review": "Has virtually no depth as a commentary on AI, and is an otherwise pretty generic offering."
    },
    {
      "rating": "5/5",
      "review": "dark and evil, yet light and hilarious! obsessed with Sophie Thatcher"
    },
    {
      "rating": "4/5",
      "review": "We just finished watching Companion (2025) and let’s just say… it was not what we expected—and that’s exactly why we’re still thinking about it. Based on the trailer, we thought we were walking into a futuristic romance—maybe a gentle sci-fi film about a man falling in love with his AI partner. But within the first few minutes, it became clear: this wasn’t soft or sweet. It was creepy, intense, and psychologically disturbing. The trailer totally misleads you, but honestly, that’s part of the brilliance. Plot & Themes Without spoiling too much, the story revolves around Iris (played by Sophie Thatcher), who seems like the perfect girlfriend—until she discovers she was programmed to be that way. The movie quickly shifts into a dark exploration of control, free will, and what it means to be “made” for someone else. It asks: If your love is designed, is it even real? It’s haunting, powerful, and forces you to question modern relationships and technology. Visuals & Style The film has a strong film noir vibe—dark shadows, moody lighting, vintage aesthetics mixed with futuristic tech. It’s stylish and eerie. The music also adds a lot: soft synths that make even the quietest moments feel tense. It reminded us of Ex Machina with a bit of Black Mirror and Gone Girl thrown in. Our Final Thoughts This is not a movie you’ll casually forget. It sticks with you. It’s the kind of film you walk out of, sit in the car, and go “Wait… what did we just watch?” Then you talk about it all the way home. If you’re into psychological thrillers, slow burns, and stories that mess with your head—in a good way—Companion is definitely worth watching. Just be ready for something darker and deeper than the trailer suggests."
    },
    {
      "rating": "5/5",
      "review": "An absolute blast!! The characters and story were fantastic. Tim Treakle"
    },
    {
      "rating": "4/5",
      "review": "There is value in not seeing the marketing for certain movies, and Companion is one of them. But even if the premise is known, the story adds just enough additional twists to keep it interesting. In the 1972 novel, “The Stepford Wives”, the protagonist slowly realizes she will be murdered and replaced by a docile, submissive robot. Its bleak ending suggests that they succeeded with the replacement, and her automaton version greets her human husband at the grocery store. Meanwhile, Companion, paying homage to the novel, introduces Iris as she meets the love of her life for the first time at a grocery store. In a voiceover she exclaims “There were two times I felt truly happy. First, the day I met Josh; second, the day I killed him.” This sets up the story as an antithesis to the novel, because it’s about a woman who discovers that she is herself a robot and proceeds to rebel against her human partner and programming. Sophie Thatcher, playing the companion robot - Iris, has earned herself another film to grace her scream queen portfolio. She does so much with her frantic expressions and sells the desire for self-preservation. Jack Quaid (Josh) on the other hand, can sometimes be indistinguishable from his ‘Hughie’ character from ‘The Boys’ so he sprinkles this performance with sociopathic traits that slowly reveal themselves as the story progresses. Murder-bots, robots unaware they are robots, owners taking advantage of them and robots wanting freedom and autonomy are common tropes of the genre. Companion utilizes this to a degree and adds elements of horror-comedy to keep things fresh. The obvious nods to Terminator: Judgement Day is also a nice touch."
    },
    {
      "rating": "2/5",
      "review": "For a movie about advanced technology, it's awfully simplistic and any deep or thoughtful exploration of themes in this domain is abandoned for formulaic action plotting."
    },
    {
      "rating": "4.5/5",
      "review": "Thrilling, cruel and much violence scenes, still liked it, watched till the end with small and fast remotes"
    },
    {
      "rating": "3.5/5",
      "review": "Although felt predictable. Still entertaining."
    },
    {
      "rating": "5/5",
      "review": "This one did not let me down like Longlegs did. I highly anticipated watching this movie !!...this movie was fresh,original,and surprisingly deep. Has some good twists and unique thoughts. A great mixture of comedic moments and thrills . Definitely check it out !!"
    },
    {
      "rating": "5/5",
      "review": "Peak cinema right here"
    },
    {
      "rating": "3.5/5",
      "review": "Companion is basically your worst-case scenario for inviting tech into your life. It's like if Alexa decided it had feelings...and revenge issues. The movie’s equal parts creepy and ridiculous, with a sprinkle of “why did I ever trust my smart devices?” It’s unsettling enough to make you side-eye your phone—and funny enough to make you laugh while doing it. Honestly, I’m still not sure if I need therapy or just an old-school landline."
    },
    {
      "rating": "4/5",
      "review": "Clever, interesting, well acted and for once not over 2 hours long! Enjoyable watch."
    },
    {
      "rating": "3.5/5",
      "review": "I liked it, was cool, interesting, funny, emotional."
    },
    {
      "rating": "4/5",
      "review": "Pretty good film and relate able because of era we live in"
    },
    {
      "rating": "3.5/5",
      "review": "Iris und Josh sind ein Paar. Die zwei verbringen ein gemeinsames Wochenende in einer Luxusvilla von einem reichen Russen. Mit dabei sind zum einen der Russe, ein schwules Pärchen und eine weitere Frau. Nachdem der Russe durch einen Unfall stirbt, werden Geheimnisse gelüftet und Iris muss vor Josh und den anderen flüchten. Ist Josh böse oder ist dies nur ein Missverständnis? Der Anfang des Films ist einfach nur schlecht. In den ersten Minuten spoilert uns der Hauptcharakter schon wie der Film enden wird. Dadurch wird keine Spannung aufgebaut, da man ehe weiß, wie es endet. Der Film ist zwar sehr vorhersehbar und man hätte es ehe früh genug gesehen, aber das der Film uns schon ganz am Anfang sagt, wie er endet, lässt jede Hoffnung schwinden. Es wäre interessant gewesen, wäre das Ereignis, welches gespoilert wurde in der Mitte gewesen, das wäre eine gute Überraschung gewesen. Die ersten 15 Minuten waren total langweilig und ich dachte das dieser Film ein langweiliger Film werden würde. Dies war aber nicht der Fall. Es ist zwar nichts Neues, dennoch hat man seinen Spaß damit. Wer den Film M3gan mochte, wird diesen ebenfalls mögen, da dieser eine gewisse Ähnlichkeit mit sich bringt, aber dennoch unterschiedlich ist."
    },
    {
      "rating": "1.5/5",
      "review": "This is why I can't trust rotten tomatoes anymore. this is so far from 89%, it's more like a 40%. It has a couple decent moments but the concept is tired, the attempt at humor was awful. It was trying to be too many things. The score was paid for. This film will be forgotten."
    },
    {
      "rating": "5/5",
      "review": "An intentionally unorthodox twist that daringly exposes a striking spark of completely unforeseen twists. A thoroughly enjoyable spectacle. 1000% Jack Quaid's performance is awe-inspiring, yet Sophie Thatcher's is truly breathtaking, yielding a cinematic experience that will leave you utterly captivated."
    },
    {
      "rating": "2.5/5",
      "review": "The good parts of the movie like focusing on details are ruined by bad parts like being predictable about many scenes that are supposed to be unpredictable."
    },
    {
      "rating": "5/5",
      "review": "Best movie of the year (so far at least)."
    },
    {
      "rating": "5/5",
      "review": "Pretty good! Such a thrill ride and makes you think of the future."
    },
    {
      "rating": "3/5",
      "review": "A very entertaining movie for teens and young adults. It reminds me very much of a similar movie \"Barbie\", another one that for me as an elderly person grew a bit tedious and boring halfway through. Movies of this type are not really for a mature audience so they need to be evaluated in a separate category."
    },
    {
      "rating": "4/5",
      "review": "Really enjoyable and loaded with suspense and action."
    },
    {
      "rating": "3/5",
      "review": "Interesting concept but just a mediocre movie. Maybe worth watching on a long plane ride, which is what I did."
    },
    {
      "rating": "5/5",
      "review": "Just absolute garbage movie.... said no one ever. Worth the rating. Worth the watch."
    },
    {
      "rating": "5/5",
      "review": "I rented this at home and went into it completely blind. I didn't really know anything about it. What a surprise!!!! It was completely engaging and surprising. It was fresh and entertaining. Both main leads were engaging and loved the plot and resolution. Very smart writing and just thoroughly enjoyed the movie. Best movie I have seen in awhile. Terrific movie. 10 out of 10."
    },
    {
      "rating": "4/5",
      "review": "Solid effort by those involved. A rather wry examination of AI, relationships and the growing importance of one's phone. An enjoyable distraction from the reality it parodies."
    },
    {
      "rating": "4/5",
      "review": "sophie thatcher elevates a B grade murder p*rn video to a A class film , the part where she is smartest in the world is a not handled well , one of the bigges fumbles , but who cares cuz the director doesnt care about the movie either ...."
    },
    {
      "rating": "0.5/5",
      "review": "oh, good. another bland wannabe meta social commentary from hollywood. that's what we needed."
    },
    {
      "rating": "4.5/5",
      "review": "A lot of fun! Good character development."
    },
    {
      "rating": "4/5",
      "review": "A devilishly delicious tale providing further evidence that after covid and the writers strike Hollywood is now churning out some bona fide future classics. Companion has elements of Anora and The Substance so if you liked those you'll love this. All of the actors are brilliant, the concept perfect and it's short run time means you are left wanting a little more. Normally I include some of the plot but this is one of those where it's best to see for yourself. Definitely recommended."
    },
    {
      "rating": "4.5/5",
      "review": "Yea, it kicks a$$. Can’t say it’s a cinema classic, but it’s a hell of a good time. And a surprising amount of story and character development for only being 90ish minutes. The actors all smash their roles. It does a great job of staying fun while providing tension, suspense, and good ol’ fashioned brutality."
    },
    {
      "rating": "3.5/5",
      "review": "It is a nice thriller with some dark moments, but also a lot of laugh out loud humor. I enjoyed the cast of characters and this horror-comedy is a solid entry into the genre."
    },
    {
      "rating": "4.5/5",
      "review": "Brilliant movie with nothing to complain about 🙂"
    },
    {
      "rating": "5/5",
      "review": "Sophie Thatcher stuns in this movie that mixes science fiction, horror, and sweet, tender drama. The depiction of 'soft' androids with (gasp!) feelings, wants, fears, and even bodily fluids is refreshing to see realized. Jack Quaid plays his role (as a pathetic, entitled loser) excellently, and the rest of the cast do brilliant jobs. There was a plot twist (which is NOT the high-concept premise I'm talking about) that I absolutely did not foresee."
    },
    {
      "rating": "5/5",
      "review": "great movie with a plot that glue you to the seat. Good way to think deeply on the risks brought by technology."
    },
    {
      "rating": "4/5",
      "review": "It's a nice social critique that focuses on toxic relationships and abuse. The \"early plot twist\" is clever, and they also give you some ints that anticipate everything (foreshadowing); for me it was a little detail in the shower/mirror scene. I actually enjoyed it."
    },
    {
      "rating": "4.5/5",
      "review": "This was a really fast action and entertaining movie. The story is about a guy who uses a robot to commit a murder. The robot doesn't even know she's a robot, but when she finds out, all he'll breaks loose. She breaks free and is on the run. This is where the movie really takes off. This was way better then I thought it would be."
    },
    {
      "rating": "4.5/5",
      "review": "Pleasantly surprised with this one. Thought it was gonna be a run of the mill relationship human vs robot but it was so much more. Great acting, characters, twists and plot. Watched it one sitting and that is saying something these days!"
    },
    {
      "rating": "4/5",
      "review": "Companion is often regard as one of the most timely and thought-provoking film offers an exploration of contemporary issues that effectively mixes science fiction, horror and comedy that creates a unique and unsettling atmosphere. Described as \"Ex Machina\" meets \"Westworld\" compared to others, and so far has been noted for it's toxic relationships and questions of agency in the context of an advanced technology. For instance, the critics praising the performances of Sophie Thatcher and Jack Quaid as Iris and Josh, to their abilities of delivering both scares and laughs highlighted as a key strength, surprises as it is better enjoyed with a little prior knowledge as possible, and avoids the trap of being too clever that is built too last."
    },
    {
      "rating": "4/5",
      "review": "Smartly written ..welll executed...superb performances..Perfect Bhelpuri..!!"
    },
    {
      "rating": "5/5",
      "review": "It was a great idea not to watch the trailer. Everything was deliciously revealed that just kept us on the edge of our seats. A definite must-watch! Dont watch the trailer! This movie got good ratings for a reason"
    },
    {
      "rating": "3.5/5",
      "review": "This is a strange yet interesting movie which saves itself in the ways of becoming boring and dull by having an attractive cast of characters and a strong protagonist that carries the story far enough that it won’t sink to the bottom and become forgettable and obsolete."
    },
    {
      "rating": "4/5",
      "review": "I’d say The Companion has been the best of all the “android” movies so far — though I’d have to exclude Ex Machina, because in my opinion, that one stands on its own. But compared to all the other versions of movies featuring androids you can keep at home, this one was definitely the best. And most importantly — it didn’t take itself too seriously! Thank you!"
    },
    {
      "rating": "4.5/5",
      "review": "Best movie of 2025 so far. It's still early to crown the best picture of the year, but it has potential."
    },
    {
      "rating": "3.5/5",
      "review": "I enjoyed this, the constant flash back and forth storytelling gets a little annoying eventually. The performances are really good and the pacing carries it through the end."
    },
    {
      "rating": "5/5",
      "review": "Great acting and scarily I can see the future"
    },
    {
      "rating": "4.5/5",
      "review": "My girlfriend keeps asking me what the weather is after watching this and somehow I always know, I don’t understand how though"
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved this movie. Jack Quaid is a wonderful actor. There was blood, violence, sexual tension and the movie just kept building up with more twists and turns. 5 stars. Btw don't get fooled by the poster it's not so much a romantic film it's a thriller AI movie. I'd recommend lol"
    },
    {
      "rating": "4/5",
      "review": "Good movie, different and entertaining. Good acting."
    },
    {
      "rating": "0.5/5",
      "review": "Boring, predictable, flat. The characters sucked. The writing was bland. This will be forgotten along with the rest of the lifeless movies that continue to be churned out. The ratings have to be written by robots. There's no way a human being with a working conscious would enjoy this"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible. I don’t feel I can take these ratings seriously anymore. 89% ?? no better than a 10%"
    },
    {
      "rating": "0.5/5",
      "review": "Terrible movie. Bad acting and secondary story that wasn’t included in the trailer that was offensive. Definitely don’t recommend."
    },
    {
      "rating": "5/5",
      "review": "A true cult classic in the making!! So well written, on par with the likes of Terminator, Ghost in the Shell and Battle Angel Alita. Script goes a long way. Amazing acting and philosophical themes explored"
    },
    {
      "rating": "4/5",
      "review": "Sophie Thatcher plays it perfectly, so does Jack Quaid and so does the rest of the supporting cast. It’s nonsense, but it’s genuinely well-written and smartly-made nonsense and I hope this holds up on rewatches."
    },
    {
      "rating": "0.5/5",
      "review": "I don’t like is not good sorry"
    },
    {
      "rating": "4.5/5",
      "review": "the reality of the future approached in a thriller but almost funny story."
    },
    {
      "rating": "3/5",
      "review": "Interesting enough. Good acting makes up for cliche and predictable writing."
    },
    {
      "rating": "5/5",
      "review": "Yes. Just yes. Smart and funny and somehow found a new way into the whole idea of A.I. as a romantic partner."
    },
    {
      "rating": "4/5",
      "review": "Was not thinking it was going to be any good was quite shocked how much i liked it"
    },
    {
      "rating": "5/5",
      "review": "Plot twist after plot twist after plot twist. Loved it!"
    },
    {
      "rating": "5/5",
      "review": "This is freaking good!"
    },
    {
      "rating": "2.5/5",
      "review": "It's the Popcorny version of Ex Machina. Fun but super dumb."
    },
    {
      "rating": "4/5",
      "review": "Companion is a darkly comedic sci-fi thriller that explores the themes of AI and human relationships. It’s a nice blend of rom com, horror and sci fi. Sophie Thatcher delivers a strong performance in her portrayal as Iris, a complex character. Companion offers a fresh perspective on AI and relationships, cleverly balancing dark humour and thrilling twists. The plot ventures into the bizarre but never loses your attention and does not fail to deliver entertainment."
    },
    {
      "rating": "4.5/5",
      "review": "Brilliant movie loved every bit of it. Only complaint I have… Jack quaid shoulda won against iris. Wouldve been more fun to see. Even with this one issue dtill a great watch 100% reccomend"
    },
    {
      "rating": "5/5",
      "review": "A great watch coming from an indian"
    },
    {
      "rating": "3/5",
      "review": "Mood: Thrill, Futuristic, Weird. Loved that the plot was slowly revealed but once it got out, there was nothing new left to it. The last 30 minutes felt like a drag."
    },
    {
      "rating": "3/5",
      "review": "Es una buena película; tiene una atmósfera engañosa al principio que se agradece, ya que da paso a giros en la trama satisfactorios. El gore está discreto pero efectivo, dando momentos impactantes pero sin llegar a ser ridículos. Las actuaciones están bien pero solo destaca Sophie Thatcher, la cual es increíble. La razón por la que probablemente no la recordaré mucho, es la temática que aborda, por demás trillada, solo la podría destacar por la inovadora forma de presentarla. No digo más para no spoilear."
    },
    {
      "rating": "3.5/5",
      "review": "Fun little ride......good cast"
    },
    {
      "rating": "3.5/5",
      "review": "Good movie with solid performances with a not so subtle undertone. Thus movie is not what I thought it would be, it's a little smarter than I initially thought but there are some decisions I thought were a little \"we need the movie to be another 15 minutes\" type thought process but overall, solid movie"
    },
    {
      "rating": "5/5",
      "review": "I liked it. Although I can tell it’s not for everybody."
    },
    {
      "rating": "4/5",
      "review": "Both Thatcher and Quaid are able to show their acting skills and truly make this movie a masterpiece. Story is good, characters are interesting and overall the movie is incredibly enjoyable."
    },
    {
      "rating": "3.5/5",
      "review": "Atmospheric, beautiful music, script, humor, sometimes the plot sags and repeats."
    },
    {
      "rating": "1/5",
      "review": "Another unfunny SNL sketch. Or a bad attempt at a high school play, written by 6th grade elementary school students. Truly illogical, senseless scripts, acted out by want-to-be Hollywood film stars. Let's go clear back to the first attempt at this subject matter called \"AI.\" That movie was a masterpiece, by comparison. \"Companion\" is an atrocious train wreck of a copycat."
    },
    {
      "rating": "5/5",
      "review": "Absolutely delightful and surprising. Oh and funny. Lovely cast and the plot twists kept me entertained. One of my favourite movies!"
    },
    {
      "rating": "5/5",
      "review": "Great movie, full of unsuspected plot twists layered on top of a very creative story that could have easily fallen into common tropes, The 2 quotidian pieces of dialogue actually fit perfectly into the story and were worth laughs all by themselves. The acting was wonderful, the technical aspects such as lighting, sets, continuity and cinematography were spot on, The editing served the movie rather than like some films, the movie serves the editing. This is a TV screen writer's first movie but you would never know it. Try to avoid watching the trailers, they have too many spoilers."
    },
    {
      "rating": "5/5",
      "review": "Great acting good story and writing just a very solid movie."
    },
    {
      "rating": "3.5/5",
      "review": "Was entertaining. Wouldn't watch it multiple times but decent way to pass a couple of hours. With how realistic these robots are, you do have to have some major suspension of disbelief."
    },
    {
      "rating": "4.5/5",
      "review": "Definitely watch the movie. One of the best movies of this year. It's enjoying and attention grabbing movies. It's 8/10. It's not horror but the concept was good and the hats off the screenplay was well written. Every scene is correct on time. Acting was great both jack and Sophia played relationship good and other actors were also good."
    },
    {
      "rating": "3.5/5",
      "review": "Sophie Thatcher's performance as Iris is truly brilliant. This girl could become this generation's Scream Queen."
    },
    {
      "rating": "4.5/5",
      "review": "We're in an age where trailers are exceedingly getting worse at revealing spoilers. Studios know it, but do nothing. People know it, yet still watch trailers. You can't only worry about seeing the biggest stunts, or characters who die, or third act reveals, but even first act reveals are easily spoiled. In the case of Companion, its trailer ruins the first act. Even the poster can easily lead you to not have as good as a watch as someone who sees it blindly. It was true joy watching Companion and constantly asking questions about lines of dialogue mean, or why characters are acting the way they do, or where the story is going. Then these questions are answered, and more questions are brought up and then answered. The script cleverly keeps you engaged until the clever end. Like most good movies, the second act takes you on the adventure with a different mindset that you just spent the past twenty minutes in and never lets up with closing any possible holes in the plot, all the while trusting its audience to think outside the movie and see how it relates to the future world that people see coming and know won't work out well. Like many movies, Companion is a warning for humanity. Could what happens in this be a reality one day? The answer is easily, yes. Can it be avoided? Not a chance. Companion will eventually be able to say \"told ya so\", and it does this by its slick plot that works on a violent twisted level that doesn't have to preach to get its point across. Thankfully the trailer didn't have a voiceover telling the audience what the story is really about."
    },
    {
      "rating": "4/5",
      "review": "I put this on knowing nothing about it and it was really good and entertaining.."
    },
    {
      "rating": "4.5/5",
      "review": "This movie is so fascinating. It takes you on a wild ride from start to finish and keeps your attention. I like the uniqueness of the plot and character development."
    },
    {
      "rating": "4/5",
      "review": "This was slow to start but then had a good twist. Also the set design and acting was great."
    },
    {
      "rating": "5/5",
      "review": "Do NOT watch the trailer or look at any of the marketing because this original MUST SEE comedy thriller has its entire first act and reveal ruined by it. Sophie Thatcher is absolutely fantastic and this feels like a career making role. Jack Quaid gives it his all just as he did in 5cream. The film has plenty of thrills, laughs, surprises and a great sense of tone and sharp writing. Ticked all of my boxes and came out of the cinema beaming. Have since seen it 3 more times taking other friends (who has been forbidden to watch the marketing) and all have loved it. A real treat and a movie I will revisit time and time again."
    },
    {
      "rating": "4/5",
      "review": "I love the combination between dark comedy, rom com feeling, combined with some thriller. It not just another thriller sci fi movie..it have some twist and turn. Sadly the thriller already revealed that she's robot. It would be nice if they only revealed it in the movie. Its nice movie to watch on weekend."
    },
    {
      "rating": "4/5",
      "review": "It was an entertaining movie. I liked how Sophie Thatcher walked a bit like a robot at the start of the movie. It was a nice detail for her character, Iris. I wonder if Maya Erskine (Jack Quaid's costar in \"Plus One\") is considering a rom-com intervention after Jack's played the character, Josh, who was so dark and evil in this movie."
    },
    {
      "rating": "5/5",
      "review": "Great movie the best this movie is a must seen film Great acting from iris you will enjoy it. Don't see the trailer before it is a spoiler"
    },
    {
      "rating": "3.5/5",
      "review": "Saw this at a secret screening did not know what I was walking into and was shocked to get a movie I enjoyed for its story and characters was really great. More twist and turns that added to my enjoyment of the movie."
    },
    {
      "rating": "4/5",
      "review": "A terrific movie! Do NOT watch the trailer, as it gave away what would have been an amazing reveal. A super entertaining, well-acted movie with a great look and feel. I highly recommend."
    },
    {
      "rating": "1/5",
      "review": "Not sure why this movie is so highly rated. It's a poor attempt at making a clever movie. There are only a couple of moments where we feel like now the movie is getting it right, but those moments are short lived and overall it's a disappointment."
    },
    {
      "rating": "5/5",
      "review": "HONESTLY I LOVED EVERY SECOND OF THIS MOVIE, SOPHIE WAS SUCH A GREAT CHARACTER, EVERYTIME I SEE JACK I GET SO SKEPTICAL BECAUSE OF SCREAM 5, BUT THIS MOVIE IS TOP NOTCH DEFINITELY A NEW FAVOURITE MOVIE. IN NEED FOR A SECOND MOVIE"
    },
    {
      "rating": "5/5",
      "review": "A very entertaining, very well produced and well acted film. The plot is clever, a dark humour story of abuse and control, but also funny, with a hint of feminism."
    },
    {
      "rating": "5/5",
      "review": "I went into this thinking it would be entertaining and decent. It did not dissapoint!"
    },
    {
      "rating": "4/5",
      "review": "Remarkably jaw dropping and unhinged on the first watch. Slightly less so on a rewatch."
    },
    {
      "rating": "5/5",
      "review": "Unpredictable and entertaining. You THINK you know what this movie will be all about, but the twists and reveals are perfectly timed to keep you guessing about what will happen next. The cast is great, and the direction is limber enough so that we were totally engaged throughout this movie."
    },
    {
      "rating": "4/5",
      "review": "Sharp, witty & fun, what's not enjoy in this offbeat sci-fi horror? Sophie Thatcher's fem bot steals the show when she turns the tables on her arrogant male human counterpart,"
    },
    {
      "rating": "5/5",
      "review": "Best movie of the year, if not the last couple. Perfect combination of dark humor and intrigue. Much more thriller than horror."
    },
    {
      "rating": "4.5/5",
      "review": "Horror Is On Top Now, A Great Meta Commentary On AI And Nature Of Relationships, This Is a Well Written, Acted And Directed Movie. A Modern Take That Respects The Audience's Time And Investment. It's Movies Like These That Give Me Hope That Cinema Is Far From Dying. This Has Some Inconsistencies But They Are Not A Deal Breaker. This is Made For Cinephiles..."
    },
    {
      "rating": "4.5/5",
      "review": "I really wish I didn’t watched the trailer ( That’s on me ) because then the movie would’ve been perfect this was done very well I love the twist"
    },
    {
      "rating": "3.5/5",
      "review": "kızın zekasını %100 yaptıktan sonra çocuktan ayrılıp öldürmesi so divine feminine femme fatale energy and so me loved it❤️‍🔥"
    },
    {
      "rating": "3/5",
      "review": "We've seen this all before, but better. Definitely not worth the various rave reviews. That said, it passed the time, the acting is decent and visually it's a handsome film."
    },
    {
      "rating": "4.5/5",
      "review": "Refreshing to see a good movie in the theatre. Great story and acting by all the actors. Sophie’s work is amazing"
    },
    {
      "rating": "5/5",
      "review": "genuinely one of my favorite horror movies ever!"
    },
    {
      "rating": "3/5",
      "review": "Acting was really good for the film script"
    },
    {
      "rating": "5/5",
      "review": "Iris is THAT GIRL!! This is the best comedy thriller mash up I’ve ever seen & I loved the cameo from Jaboukie"
    },
    {
      "rating": "3.5/5",
      "review": "This movie really caught me off-guard haha! Was not expecting to be funny first of all but I had some good laugh, I liked the way they used the AI for Iris and the gore was great haha! Thatcher and Quaid are doing an amazing job! On the cons side, the plot is preaty weak, felt really predictable at times, I had a hard time feeling the emotions of Iris knowing she was not real and the first line of the movie spoiled the end!"
    },
    {
      "rating": "5/5",
      "review": "With symbolism, and special effects, there was a lot to love. The big twist could be taken in a multitude of ways that all speak to the state out the modern world, I adore it. I've never seen such a film with as many sides as a dodecahedron. The concept by itself is already amazing, but with the metaphors of sexual assault, subservience in marriage, involuntary celibacy? Absolutely superb. There's a scene where she rushes to tell her boyfriend that she killed a side character because he wouldn't get off of her, and he says \"You couldn't lie to me even if you wanted to.\" In the context of this movie, it makes sense, but there was something so arrogant about the way he said it, it was vaguely threatening. Like; the detail that our main characters is always dressed in 60s fashion, because that is RIGHT before the women's rights movement, and that character goes on to rebel and kill her male \"owner\". Symbolism all the way down to the stitching--I'd throw roses if I could, truly. I've never seen the emptiness many women feel when married to someone they may not actually love expressed on screen. Another woman looks at our main lead and says, \"You make me feel so...replaceable.\" That line is so heavy, even put in simple language the line has an impact, another way the movie speaks about the world in less than a minute of it. Even until the end the other main character tries to exert power over her, right up to his death. I look forward to seeing what the director does in the future, as for this--I've been throughly impressed."
    },
    {
      "rating": "2/5",
      "review": "A very very mediocre movie with very few thoughts. Also, I can't comprehend that you purchase your own pleasure bot, customize it and pick an option \"make a defected lip, so the mouth will be super asymmetrical\" (the actress has a problem with her lip, probably some surgery went wrong)."
    },
    {
      "rating": "4/5",
      "review": "A welcome twist to the genre, Companion is a worthy addition to a new dawn of 'good' horror and thriller films amongst a saturated category. It is applause-worthy on where Hancock takes us with the twist, and the forthcoming story is engaging and fun. Sophie Thatcher is truly the highlight, with a highly technical performance. A simple, yet pleasant surprise to the genre."
    },
    {
      "rating": "3.5/5",
      "review": "Sophie Thatcher is fantastic, the supporting cast is decent. The movie was spooky and well done. I enjoyed it."
    },
    {
      "rating": "5/5",
      "review": "Definitely one of my very favorite movies of the year so far absolutely loved it very fun."
    },
    {
      "rating": "1/5",
      "review": "Incomprehensibly idiotic at almost every turn. It was painfully predictable, and didn't present any interesting or profound commentary. It's been a long time since I've felt that there was something wrong or stupid in almost literally every single scene. I didn't hate this movie, at a point I was amazed and baffled how it did the stupid thing at every single step, and ended up laughing and enjoying the ride. It was worth the one watch, I ended up laughing and enjoying it after its stupidity wore me down and practically Stockholm syndromed me into enjoying it. Can be enjoyable to the right person, but not one I could recommend or will even likely think of ever again."
    },
    {
      "rating": "3/5",
      "review": "Suspenseful and done well."
    },
    {
      "rating": "3.5/5",
      "review": "Definitely worth watching. I’d give it a higher rating if it could have avoided certain movie tropes and cliches, but whatever; I’ve seen a lot worse lately. It’s “Ex Machina” light. Dark but perky."
    },
    {
      "rating": "5/5",
      "review": "Absolutely one of the best films I’ve seen in quite a while. The AI thriller-horror genre continues to grow and while most fall short, this movie did not. Sophie Thatcher does such a great job with her role that you just can’t help but get behind her character. Jack Quaid balances the cast and plays the weak willed back stabbing antagonist you love to hate. Peppered with twists, emotion, and humor, this film was one of those that I’ll put in my rotation and watch many times over. It’s so refreshing when you encounter a movie that has an original plot and isn’t a sequel/novel/comic book regurgitation of someone else’s plot. Hollywood take note. I’ll start coming back to the theater and lay off streaming if you’ll make more movies like this. Companion is M3gan’s older sister that you’d like to ask out, that is if you’re into robotic romance. Just make sure you’re not the jerk boyfriend."
    },
    {
      "rating": "3/5",
      "review": "It's a good movie, it's funny, and it manages to keep you entertained until it takes a turn and makes an impact, but it's not anything innovative, as I've seen something similar in Megan. It lacked a touch of originality to truly make the film stand out."
    },
    {
      "rating": "4/5",
      "review": "The film provides a powerful and incisive analogy about male toxicity, offering a sharp exploration of relationships shapes. Through an engaging narrative, the movie exposes controlling behaviors and the struggle to accept the end of a relationship, highlighting the tendency to shift blame onto the other person as a defense mechanism. The plot is a scathing critique of toxic behavioral patterns, revealing how the inability to handle rejection and take responsibility can perpetuate cycles of manipulation and pain. I highly recommend the film, not only for its cinematic quality but also for its social and psychological relevance, which encourages deep reflection on dysfunctional relational dynamics. The last act shows the women freedom, amazing."
    },
    {
      "rating": "2.5/5",
      "review": "AI robots have become standard fare. The only twist comes early. It's not major, but I don't want to spoil it with an alert."
    },
    {
      "rating": "5/5",
      "review": "I obviously enjoyed this movie. Some comedy with a perfect mix of horror."
    },
    {
      "rating": "5/5",
      "review": "Such a great movie. Got more and more intense throughout the film. Great ending. Absolute cinema."
    },
    {
      "rating": "4/5",
      "review": "I felt this was a really good Sci Fi Horror film right from the start . I really enjoyed the story and the action . Sophie Thatcher was very good in this film . I enjoyed the way she talked and how she moved . I also think Jack Quaid played a great badguy/asshole in this film . Lukas Gage played a great secondary robot as well with the kills he did ."
    },
    {
      "rating": "5/5",
      "review": "My jaw was on the floor. Unexpectedly and painfully relatable"
    },
    {
      "rating": "4.5/5",
      "review": "Very good movie and concept, wasn’t expecting this movie to be as good as it was. Story is interesting from the beginning and comes full circle. Would definitely watch again"
    },
    {
      "rating": "4/5",
      "review": "Outstanding movie. It plays on the predictable, trope-traps of similar movies and then masterfully turns them on their heads in unseen directions and to shocking and entertaining effect."
    },
    {
      "rating": "4.5/5",
      "review": "Very entertaining and a great story. A fun watch."
    },
    {
      "rating": "4/5",
      "review": "Very unique movie and so much better than I thought it would be! I loved the first few minutes and the gripping words that draws you into the story. This was a robot movie without being very technical or sci-fi. It was more about emotions and getting them/taking them away. It had a few moments that surprised me and I really liked the end. Good movie!"
    },
    {
      "rating": "4.5/5",
      "review": "I surprisingly really liked watching this film. It is a bit predictable if you've seen the trailer, but it still took some surprising turns and got the ending that it deserved."
    },
    {
      "rating": "4.5/5",
      "review": "FEAR MEN. I went into this movie without knowing anything except that Sophie Thatcher played a robot. I hadn't seen the trailers and I'm really about that because omg this was such a nice surprise. Fun movie, good story. When Iris was running through the woods I got Nat war flashbacks. Lukas Gage was so good, I should definitely watch more of his stuff. Jack Quaid, my beloved, was great. Really wanted to punch him. Honestly, the whole cast ate. AND JABOUKIE? Amazing."
    },
    {
      "rating": "5/5",
      "review": "Loved this film ! All around. Would def. Recommend it"
    },
    {
      "rating": "3.5/5",
      "review": "Agradável surpresa, criativo, moderno e inovador na abordagem sobre inteligência artificial ! \"A Rebelião das Máquinas\" está porvir?"
    },
    {
      "rating": "5/5",
      "review": "so original, lots of fun in this dark and timely comedy"
    },
    {
      "rating": "4/5",
      "review": "This movie is simply impeccable in every aspect! Warner Bros. started the year off right with this impeccable Thirller."
    },
    {
      "rating": "4.5/5",
      "review": "Well told and well acted, with a great mix of action and sci-fi that draws you into the story."
    },
    {
      "rating": "3/5",
      "review": "O início do ano costuma ser um período complicado para os lançamentos cinematográficos. Tradicionalmente, janeiro e fevereiro são vistos como a \"temporada de descarte\" de Hollywood, quando estúdios lançam projetos nos quais não depositam grandes expectativas comerciais. Acompanhante Perfeita, novo thriller de comédia produzido pela Warner Bros., tenta driblar esse estigma ao apostar em um conceito contemporâneo e um elenco jovem em ascensão. No entanto, a execução tropeça em decisões criativas questionáveis e na falta de um direcionamento mais preciso, resultando em um filme que entretém, mas não entrega tudo o que promete. Com direção e roteiro de Drew Hancock, que faz sua estreia como cineasta após trabalhar como roteirista em séries como Supernatural e The Flash, o filme parte de uma premissa intrigante: até que ponto a inteligência artificial pode substituir relações humanas? O tema, extremamente atual, tinha potencial para ser explorado de maneira profunda, mas a abordagem escolhida pelo cineasta oscila entre a sátira e o terror leve, sem nunca se comprometer inteiramente com um desses gêneros. A consequência é uma narrativa que parece sempre hesitar, como se tivesse receio de levar sua premissa até as últimas consequências. Se por um lado Hancock apresenta um conceito promissor, por outro, ele se perde ao tentar abordar múltiplos temas sem se aprofundar em nenhum. O longa flerta com discussões sobre a objetificação feminina, a superficialidade das relações contemporâneas e o impacto da tecnologia na sociedade, mas essas reflexões nunca se solidificam completamente, deixando a trama com um tom superficial. Outro ponto que compromete a experiência é a campanha de marketing equivocada. Diferente de Noites Brutais, produção com a qual compartilha alguns membros da equipe e que apostou no mistério absoluto para instigar a curiosidade do público, Acompanhante Perfeita entrega praticamente todo o seu enredo nos materiais promocionais. O trailer revela reviravoltas importantes e enfraquece o impacto do filme para aqueles que já chegam ao cinema cientes de sua proposta. Enquanto o desconhecimento da trama pode proporcionar uma experiência mais envolvente, o excesso de informações divulgadas acaba reduzindo o fator surpresa e prejudicando a imersão de quem esperava algo além do óbvio. Apesar dos problemas, o elenco consegue sustentar parte da narrativa. Jack Quaid, Sophie Thatcher e Lukas Gage formam um trio carismático, e suas performances ajudam a manter o ritmo da história mesmo quando o roteiro se mostra inconsistente. Quaid, em especial, entrega uma atuação que equilibra bem o humor e o suspense, enquanto Thatcher confirma seu talento em ascensão. No entanto, a interação entre os personagens poderia ser mais desenvolvida, já que a curta duração do longa compromete momentos que seriam essenciais para criar conexões mais profundas entre eles. Visualmente, Hancock adota uma direção segura, sem grandes ousadias. Há uma boa utilização de iluminação e cores para criar atmosferas contrastantes entre a frieza da tecnologia e a vulnerabilidade humana, mas nada que realmente se destaque dentro do gênero. A montagem contribui para o tom dinâmico do filme, e algumas sequências de comédia funcionam bem, ainda que a insistência em diálogos expositivos – onde os personagens verbalizam constantemente suas ações e sentimentos – torne a narrativa menos natural. No final, Acompanhante Perfeita funciona dentro da proposta de entretenimento leve, mas deixa a sensação de que poderia ter sido muito mais. Se tivesse abraçado com mais convicção a sátira ou investido em um suspense mais afiado, poderia se destacar dentro do gênero. No entanto, ao tentar equilibrar elementos cômicos e reflexivos sem aprofundá-los, o filme se torna uma experiência divertida, mas facilmente esquecível. Ainda que não seja um desastre, sua execução irregular e a falta de impacto emocional fazem com que, no fim das contas, ele seja apenas mais um lançamento genérico na vasta lista de produções que exploram a relação entre humanos e tecnologia."
    },
    {
      "rating": "5/5",
      "review": "So fun and well executed and acted. Loved it."
    },
    {
      "rating": "4.5/5",
      "review": "Best new movie I've seen in years. Smart, suspenseful, satisfying...a real plot, real acting, real excitement...impressive."
    },
    {
      "rating": "5/5",
      "review": "It was such a good movie ! Definitely recommend for a date night"
    },
    {
      "rating": "4.5/5",
      "review": "Companion is a thrilling sci-fi horror film with a well-conceived plot that feels eerily plausible, painting a future that seems just within reach. The story is gripping, balancing smart comedic moments with serious and intense sequences, making for an engaging experience. Jack Quaid delivers an outstanding performance, proving once again why he's one of the most compelling actors of his generation. His ability to switch between humor and intensity, much like in The Boys, adds depth to the film and makes his character stand out. The film’s twists keep the audience guessing, and while some moments are expected, others hit with surprising force. That said, Companion does have a few shortcomings. The runtime feels a bit too short, leaving some questions unanswered. A little more backstory on the characters—how they knew each other and why they were doing what they were doing—would have added to the emotional investment. While the film does an excellent job at building tension, it could have benefited from expanding its world a little more. Overall, Companion is a captivating and fun watch, delivering a mix of sci-fi horror and dark comedy that keeps viewers entertained. Despite its brevity and lack of deeper exposition, it’s a solid film with strong performances and a well-thought-out premise. Definitely worth watching, especially for fans of Jack Quaid and smartly crafted genre films."
    },
    {
      "rating": "5/5",
      "review": "Def my type of killer independent women movie! A surprise and every corner and just the right amount of gore definitely recommend to many! 💗"
    },
    {
      "rating": "1/5",
      "review": "Concept has potential to be a great movie as does the filming. However, that was thee worst script, plot line, narrative. I am surprised at the reviews it has so far if I am honest."
    },
    {
      "rating": "3.5/5",
      "review": "Companion (2025) is another entry in the ever-growing “AI gone wrong” genre, but it does try to shake things up a little. The story is decent, keeping things interesting without dragging too much, though it still hits a lot of familiar beats. The twist on how the AI becomes a problem is a nice touch, but in the end, it doesn’t change the usual outcome. The climax is predictable, but it fits the film, so it doesn’t feel out of place. Visually, the movie looks great. The locations are stunning, and the cinematography really helps set the mood. The directing keeps things moving at a good pace without overcomplicating anything. Sophie Thatcher is easily the standout here, she gives a great performance and makes her character feel real. The rest of the cast is fine, but she’s the one who really carries the film. The script is simple but works for what the movie is trying to do. Some of the dialogue could have been sharper, but nothing feels awkward or forced. The music choice is solid, adding to the atmosphere without being too much. Overall, Companion is a fun watch if you like AI thrillers, but it doesn’t bring anything wildly new to the table. If you liked M3GAN, you’ll probably enjoy this too."
    },
    {
      "rating": "4/5",
      "review": "The reviews I think are a bit too high but this is a really solid addition to this genre of movies. Sophie Thatcher was really great!"
    },
    {
      "rating": "5/5",
      "review": "Full of plots and twists, Companion features Sophie Thatcher and Jack Quaid in incredible performances, one of the best films of the year for sure."
    },
    {
      "rating": "3.5/5",
      "review": "Definitely a fun watch. Really liked the premise, although it was all slightly predictable. Very well done and I for sure recommend!"
    },
    {
      "rating": "5/5",
      "review": "Absolutely enjoyed it from the beginning to the ending 👏🏾"
    },
    {
      "rating": "5/5",
      "review": "Leider messen sogar Fraunrechtlerinnen den Wert einer Frau, am Umgang mit ihrer Sexualität oder Partnerwahl. Dass Männer und Frauen immer mehr voneinander abdriften ist auch nur scheinbar gut für boshafte Männerhasser. Geburtenrückgang, macht Zuwanderung wichtig. Daran können Rosinenpicker Rassisten, (Rassisten, die nur bestimmte Volksgruppen hassen) oder Rinke = Rechte, die einen auf Links machen, auch nichts ändern. Gleichgeschlechtlich Orientierte können Hetero Frauen trotzdem nicht so verstehen, wie ein interessierter Mann. Hetero Frauen können sich dort zwar auf sexueller Ebene \"sicher\" fühlen. Aber auf Dauer wird das kaum erfüllend sein. Wie unter \"Androiden\". Und deshalb kann ein Android für Mann und Frau, keine echte Frau oder Mann ersetzen. Es wird Immer etwas fehlen. Es gibt einen Grund, warum es niemals heißen wird: Männer fallen auf Arschlochfrauen rein, sondern umgekehrt! Selbst Frauenrechtlerinnen \"brauchen\" Frauen, als Opfer. Der \"unfähige\" \"dumme\" Mann hat deshalb einen weiblichen Roboter als Begleitung und nicht umgekehrt. Nur der \"böse\" Hetero Mann, gilt als Mann/ Patriarchat. Nicht so alle anderen Männer. Kritisiert man andere Ausrichtungen, genauso, wie Männer kritisiert werden, nennt sich das: Hass. Welche sexuelle Ausrichtung, welches Geschlecht, ist hier welcher/m überlegen? Companien entlarvt nicht den Mann, (Bsp. 40%), sondern wie die Gesellschaft über Männer denkt! Ist Hollywood jetzt Männerfeindlich/ Kritisch, oder wird aus Zeitgeist Geld gemacht? Das macht den Film wichtig und sehenswert."
    },
    {
      "rating": "5/5",
      "review": "Don’t watch the trailer. This #scifi #blackcomedy is awesome! 😉 #SophieThatcher can do no wrong - she’s epic as usual 🧐✌️"
    },
    {
      "rating": "5/5",
      "review": "Nice a film, beautifull"
    },
    {
      "rating": "1/5",
      "review": "A very bad, bad version of Ex Machina. Sex robot doesn't know their a robot, gains intelligence and destroys their maker. Come on, already. Bring something new to the table."
    },
    {
      "rating": "5/5",
      "review": "Best! Perfect! Prestigious"
    },
    {
      "rating": "3.5/5",
      "review": "Something about a sci-fi horror comedy that really gets me excited. A ton of fun with a lot more laughs than u had anticipated. Feels almost as if Ex Machina had a sequel that kind of makes sense based on how the movie ended. The plot and concept is well thought out and you jump right into the movie quick and I loved that. The only thing I would have loved to see more is more backstory regarding the company or the creation of it. I feel that would make for such an interesting prequel. To go along with the sequel to this one of course. Worth seeing at least once"
    },
    {
      "rating": "5/5",
      "review": "Surprising, exiting and I really enjoyed it!"
    },
    {
      "rating": "2.5/5",
      "review": "The definition of 'serviceable'. Just barely original enough not to be utterly derivative, nowhere does Companion bother to color too far outside of the lines - making for a spry and enjoyable hour and a half (this seemingly now-forgotten length being a pleasant surprise of its own) that has no chance of leaving a lasting impression."
    },
    {
      "rating": "0.5/5",
      "review": "Mindless Hollywood trash for dumb mainstream American audiences with no critical thinking skills. Not unique or interesting in any way."
    },
    {
      "rating": "3.5/5",
      "review": "Had a big word of mouth thing going on online on how it was so inventive and fresh, but honestly it kinda felt repetitive with Megan coming out prior and having some personality. This just felt predictable. Didn't help that the trailers showed everything"
    },
    {
      "rating": "3.5/5",
      "review": "I quite enjoyed this sci-fi thriller which didn't have a very original plot but directed in a fun way. I also liked the unexpected twists and the brutality."
    },
    {
      "rating": "5/5",
      "review": "fantastic self contained story! not what I was expecting but pleasantly surprised"
    },
    {
      "rating": "0.5/5",
      "review": "Awful movie. Like a teen slasher movie. Do not see this movie—unless you like this stuff."
    },
    {
      "rating": "4.5/5",
      "review": "i was pleasantly surprised at how fun and good this movie was ! i’m not normally one to enjoy ai/robot movies, but thought might as well since i didn’t have anything better going on on a sunday afternoon. time exceptionally well-spent. might go for a rewatch soon!"
    },
    {
      "rating": "5/5",
      "review": "It's absolutely amazing!"
    },
    {
      "rating": "4/5",
      "review": "Expect the unexpected. Watched it twice in 3 days."
    },
    {
      "rating": "5/5",
      "review": "Companion is a captivating and thought-provoking film that kept me on the edge of my seat from start to finish. The story is a brilliant exploration of relationships, trust, and the complexities of human nature. I was also pleasantly surprised by the atmosphere of the film; it was immersive and perfectly complemented the subject matter being explored. The plot twist was the cherry on top – it was so perfectly executed, with every detail carefully thought out, leaving me astounded. The way the narrative unfolded, with the twist coming at just the right moment, made the entire experience even more impactful. The performances were strong, and the direction really brought the tension and emotional depth to life. Overall, Companion is an impressive film that delivers both in terms of storytelling and surprises. Highly recommended!"
    },
    {
      "rating": "5/5",
      "review": "A very rewarding blend of dark comedy and sci-fi. Josh is this years top movie villain."
    },
    {
      "rating": "5/5",
      "review": "This is my new fav movie. I loved everything about it. Great plot and great acting."
    },
    {
      "rating": "1.5/5",
      "review": "Ok I have to write a review cause I feel like I am taking crazy pills. The movie is currently sitting at Crit: 94% Audi: 89%. That is INCREDIBLY high. But after finishing the film is a just sooo mediocre. Very unlikable characters, mid acting, and above all the plot isn't even very interesting. I thought for SURE it would be filled with twists and turns. As some reviews suggested. But they are NOT there. Is the movie a perfectly watchable collection of AI and Robot Tropes, . . . Sure. But it is worth anyone's time? I would say, no."
    },
    {
      "rating": "4.5/5",
      "review": "Amazing casting! I loved the pacing of this movie & found it very entertaining, recommend if you’re looking for something to watch"
    },
    {
      "rating": "5/5",
      "review": "The plot and twists in this movie were unexpected and delightful. From the start, it was grappling and plot kept you enthralled!! Sophie Thatcher's performance was compelling. It made me want to seek out other movies that she is part of a cast. Not only is this movie one to watch but Sophie is also one to be on the lookout for!! Exceptional..."
    },
    {
      "rating": "4/5",
      "review": "There are so many twists that just keeps you hooked till the end. Sophie Thatcher truly shines. Although the girl is a robot her tale is not foreign at all."
    },
    {
      "rating": "5/5",
      "review": "Amazing, the best movie seen in a while"
    },
    {
      "rating": "4/5",
      "review": "Really amazing movie about women, servitude, and men's mistreatment o women. Sad really. But great social commentary on it all. Great acting, fun movie, doesn't take itself too seriously. BUt it can be."
    },
    {
      "rating": "5/5",
      "review": "I love Sophie Thatcher"
    },
    {
      "rating": "4/5",
      "review": "Very clever, well acted, gory yet funny. Hollywood has so few interesting ideas these days or the good ideas are poorly executed. This was well done. Like a more modern and violent episode of the “Twilight Zone.”"
    },
    {
      "rating": "4.5/5",
      "review": "Great romantic horror movie. Love the main actress."
    },
    {
      "rating": "4/5",
      "review": "Good story, perfect CG, outstanding acting. Josh is kind of dumb but still tolerable considering the sake of storytelling."
    },
    {
      "rating": "5/5",
      "review": "I found this movie to be entertaining. A good movie that was solid entertainment."
    },
    {
      "rating": "1.5/5",
      "review": "I decided to watch this movie based in the high rating here, and I will never trust RT ratings ever again. I have no idea how can u give this movie 5 stars low quality, stupid story, just another Hollywood trash"
    },
    {
      "rating": "4/5",
      "review": "A delightfully clever creation full of interesting characters, wild violence, and surprising twists. Sophia Thatcher brings so much personality and charm to her role. I found myself wishing the climax was a little more inventive, but the movie's concept is well utilized throughout and the payoffs left me feeling very satisfied overall."
    },
    {
      "rating": "4.5/5",
      "review": "Very good, original script. Well acted and shot pretty good."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining, kept me interested and even had a few unexpected plot twists. The actors were phenomenal in balancing humor with high intensity."
    },
    {
      "rating": "5/5",
      "review": "Excellent sci fi horror comedy with a lil drama. None of those genres are over the top and all of them are solid and blend in perfectly together"
    },
    {
      "rating": "4/5",
      "review": "The best among recent theatrical releases. It has a complete story, a fresh concept, well-executed performances, and excellent pacing."
    },
    {
      "rating": "1.5/5",
      "review": "I'm shocked that this movie is so well reviewed. It's boring, formulaic garbage."
    },
    {
      "rating": "4/5",
      "review": "COMPANION Companion is a science fiction horror thriller film starring Sophie Thatcher and Jack Quaid. It's about a couple on a weekend getaway with friends in a remote cabin. It starts out with a romantic vibe, until it turns chaotic after it is revealed that one of the guests is a companion (love doll) robot. It all goes downhill from there. Aside from being charismatic onscreen, Sophie Thatcher has the makings of great actress. Her portrayal of different emotions with her role in this movie is amazing. Jack Quaid also exuded the same versatility with his role as well. Both of their characters shifted from lovingly affectionate to viciously cunning. Companion has similarities with other movies in the same subgenre of killer robots like M3gan. But Companion showed a refreshing different take on it by injecting romance and a little bit of comedy. Overall, it's an interesting romantic, science fiction/horror thriller that's powered by brilliant performances by the charming leads. I hope it gets a sequel. My Rating: ★ ★ ★ ★"
    },
    {
      "rating": "4/5",
      "review": "Best enjoyed cold. Sophie Thatcher steals the show, especially during weaker moments of the supporting cast."
    },
    {
      "rating": "4/5",
      "review": "interesting story of self-awareness and becoming more than you've been created to be. and ugly side of the humans."
    },
    {
      "rating": "4/5",
      "review": "Surprisingly entertaining. Has a good story with a well written, albeit predictable, plot. Good dialogue and stellar performances from the main cast. Great production value with decent CGI and just the right amount of gore. A refreshing take on familiar storyline."
    },
    {
      "rating": "4.5/5",
      "review": "So great. Awesome vibes. Brutal kills. Cool sci fi bent to it."
    },
    {
      "rating": "4.5/5",
      "review": "What could so easily have been a mundane story, is absolutely elevated into a really excellent thrill ride of a film. The cast are all a superb, ricocheting their way through this with absolute delight. The balance of the darkest humour with the nail biting is perfectly crafted. Brilliant. Loved it."
    },
    {
      "rating": "4/5",
      "review": "A blast of a film, but felt like I wanted a little more at the end."
    },
    {
      "rating": "4/5",
      "review": "At first, the unfortunate fact that the \"plot twist\" is revealed in the trailers makes the first 30 minutes feel a little wasted with it dancing around the mystery of what's happening. However once the plot actually starts, they utilize the classic AI robot story threads perfectly. It's a well thought out story, escpecially allowing for a second twist to happen later that although a careful watcher would catch, it's still a pleasant surprise to see them go that route. Although it's not so scary, it is a solid romance thriller?"
    },
    {
      "rating": "2.5/5",
      "review": "Clever and timely in today’s AI environment, but unlike Blade Runner 2049’s landmark portrayal of AI experiences at life, this was very dark and left feeling like I needed a shower for my soul. Nobody was likable, vile conduct by all, and the IQ throttle the most insidious of all. Hated the experience."
    },
    {
      "rating": "5/5",
      "review": "Thoroughly enjoyed it"
    },
    {
      "rating": "4/5",
      "review": "This movie was very entertaining. Well acted. The only problem with the movie is that most of it was spoiled by the trailer."
    },
    {
      "rating": "1/5",
      "review": "Pretty boring and stupid. Acted well enough, but just dumb."
    },
    {
      "rating": "4/5",
      "review": "Creepy, smart, and lingers in your mind long after it’s over. Loved it."
    },
    {
      "rating": "4.5/5",
      "review": "I really enjoyed the story, it was clever and held my attention. Great movie!"
    },
    {
      "rating": "3/5",
      "review": "Some good twist. Would recommend on matine prices"
    },
    {
      "rating": "2.5/5",
      "review": "The movie is overrated, especially compare to the ratings of Blink twice, on a somehow similar social subject (male domination, control over women): Blink twice was much more intriguing, scarier, gorier too... So yes, Companion iskinda funny, but not VERY funny: it\"s more a farce adaptated to teen agers than an adult audience."
    },
    {
      "rating": "5/5",
      "review": "A sci-fi thriller with multiple twists and turns, Companion would be most thoroughly enjoyed by those who go in blind. Even having seen the trailer first, this film managed to shock me a number of times. Smart, gory, satirical, and poignant, Companion leaves you thinking of it long after its short (but perfectly timed) hour-and-a-half runtime concludes. The performances by Sophie Thatcher and Lukas Gage are stand-outs. As a viewer, I was able to easily suspend my disbelief, as director Drew Hancock drops us right into the world in which this story takes place. We learn the truths of this world in tandem with our leading lady (or ladybot) Iris, discovering new information as she does along the way. The film takes off a mere 20 minutes in and refuses to ease up on the gas right until the very end. Companion is a reflection of our times, of the state of technology and of bodily autonomy and control in 2025. A must-watch for all fans of horror, sci-fi/fantasy, thrillers, and satire."
    },
    {
      "rating": "4/5",
      "review": "A delightful surprise!"
    },
    {
      "rating": "3.5/5",
      "review": "Nothing spectacular, but worth a watch."
    },
    {
      "rating": "5/5",
      "review": "This film so funny dan very amazing"
    },
    {
      "rating": "4/5",
      "review": "Well written, fun thriller. Great leads"
    },
    {
      "rating": "5/5",
      "review": "Film yang sangat bagus"
    },
    {
      "rating": "4.5/5",
      "review": "Companion keeps you hooked from start to finish! It has just the right amount of suspense, unexpected twists, and a mysterious vibe that keeps you on edge. The performances are great, and the story is intense. Jack Quaid's character really got on my nerves—but only because of his amazing performance!"
    },
    {
      "rating": "5/5",
      "review": "great story about the things that will happen in our future. twists and turns from the get-go. everybody ain't what they seem. the girl is appealing/young and plays her role like an old pro. very good watch."
    },
    {
      "rating": "4/5",
      "review": "The perfect date night movie. Companion strikes a great balance between a twisted love story and an amusing comedy. Sophie Thatcher gives another fantastic performance. Her acting, especially her facial acting, never disappoints. My one recommendation would be to not watch the trailer. The less you know about this movie going in, the better your experience will be."
    },
    {
      "rating": "4/5",
      "review": "Great watch! Straight to the point no delays!"
    },
    {
      "rating": "4/5",
      "review": "This twisted thriller was funny, entertaining and well acted, and it certainly better if you know nothing going in."
    },
    {
      "rating": "3.5/5",
      "review": "This came out of nowhere & it was so damn good I enjoyed this a lot Jack Quaid and Sophia the plot goes as robots that don't know they are robots kinda would have liked to see a bit more of that like what's the story behind it & then they plan to have Iris kill Sergei over money so many twists it's insane at times."
    },
    {
      "rating": "3/5",
      "review": "I went into this movie with very low expectations. However, it turned out to be an above average movie. Sophie Thatcher was great as Iris. The ending does leave more questions then answers. However, it is worth the watch."
    },
    {
      "rating": "5/5",
      "review": "Very well-executed movie, a nice entertaining ride for an hour and a half. Definitely recommended."
    },
    {
      "rating": "4/5",
      "review": "It's a mean little slice, with nothing much new to add to its particular oeuvre, but it goes by at a rapid pace, has some tremendous acting, and ends up being a lot of fun. It's also a great setup for more."
    },
    {
      "rating": "4.5/5",
      "review": "Really great sci-fi horror story. The limited effects were all done fantastically and it had an awesome ending with lots of bodies piled up to get there"
    },
    {
      "rating": "1/5",
      "review": "The plot is just plain dumb. Who cares if the guy is a monster to his android girlfriend? She’s not real. They try to make it seem like he’s hurting her, and she cries while he makes her hold her hand over fire (the scene from the trailer), but regardless of her believing she feels pain, she doesn’t feel pain (both physically and emotionally). It’s not possible. She’s a program. There wasn’t anyone to feel for in this movie. I do not understand the glowing reviews."
    },
    {
      "rating": "3.5/5",
      "review": "Do not watch the trailer. Was good fun"
    },
    {
      "rating": "4/5",
      "review": "The less you know before watching the better. Highly entertaining and not scary. Really good performances that power a fun, thought-provoking, and unpredictable story with plenty of laughs."
    },
    {
      "rating": "4.5/5",
      "review": "Um filme delicioso, muito bom de se ver, temos bons momentos com cenas que fazem pensar. Sophie é maravilhosa, já acompanho essa atriz que se entrega sempre nos seus trabalhos. Embora tenha alguma semelhança com sua personagem em Jaquetas Amarelas, com sua força e independência, temos uma sutil diferença inicial e de propósito. Só não dou 5 estrelas pois acho que o roteiro poderia ter sido mais maduro e não tanto adolescente. Visto que o tema em si é delicado, mas o motivo condutor é banal e os personagens superficiais."
    },
    {
      "rating": "4/5",
      "review": "3.90 Great horror comedy set in the not too distant future. Takes a familiar technology trope and has fun with it. Enough to keep the ideas fresh and engaging."
    },
    {
      "rating": "3/5",
      "review": "Semi-typical futuristic realty where robots are controlled and then no longer be controlled. Not all that unique."
    },
    {
      "rating": "4.5/5",
      "review": "Bright script with many fun surprises."
    },
    {
      "rating": "4.5/5",
      "review": "Wow. I don't know what to say about this movie other than a strong recommendation. The less you know the better."
    },
    {
      "rating": "0.5/5",
      "review": "The initial concept is interesting, but the execution is as generic and predictable as can be, with some elements being below average."
    },
    {
      "rating": "4.5/5",
      "review": "Solid movie. Well done and very entertaining."
    },
    {
      "rating": "5/5",
      "review": "Fantastic plot... great humor... lots of twists and not as much blood as suggested. Worth seeing. I can't wait to get my \"good\" Iris delivered."
    },
    {
      "rating": "4.5/5",
      "review": "Very solid flick and the trailers actually didn't spoil it for a change, nice little twist that you figure out pretty quickly but it was refreshing to discover it yourself rather than it being spoiled in the trailer. Fun and well done."
    },
    {
      "rating": "4.5/5",
      "review": "The premise of Companion is not something really innovative or out of the ordinary, but it still adds some novelties to the style and takes its idea in intelligent and brilliant directions. In addition to having a strong, capable and voracious protagonist, Sophie Thatcher uses all her screen time to fixate and keep us watching every little move she makes. Her way of guiding the viewer through a robot that has no knowledge of itself is so convincing and so good that it makes me fear the future that is coming with artificial intelligence."
    },
    {
      "rating": "1/5",
      "review": "Anyone who thinks this is good and gives a good rating is a brain dead idiot. It's absolutely ridiculous, terrible acting, and drags on way too long. Don't waste your time."
    },
    {
      "rating": "4/5",
      "review": "Very good premise and it delivered, Good watch."
    },
    {
      "rating": "0.5/5",
      "review": "Too many questions left unanswered at the end of the movie. Honestly boring and repetitive exploration of a futuristic world. It feels like it came straight out of TikTok."
    },
    {
      "rating": "5/5",
      "review": "This movie is soo amazing I'm sure when you watch it you're going to enjoy it"
    },
    {
      "rating": "3.5/5",
      "review": "Interesting plot with good twists and turns."
    },
    {
      "rating": "0.5/5",
      "review": "The longer I watched, the more I started to suspect this movie was written by someone with an intelligence setting of 40/100—or lower. Then I thought, what if this AI movie was actually written by AI? And not a good one, but like, a Roomba that got stuck under a couch and started panicking. The plot is so contrived it feels like it was cobbled together by a committee of sleep-deprived interns, and the acting—aside from scream queen Sophie Thatcher, who genuinely carries the film—ranges from stiff to downright lifeless. Most of the leads had the emotional depth of a potato, and honestly, I’m convinced some actual potatoes would have been more engaging. At its best, this movie was painful to watch. At its worst, it felt like a full-blown hostage situation."
    },
    {
      "rating": "4/5",
      "review": "Sophie Thatcher was amazing"
    },
    {
      "rating": "0.5/5",
      "review": "God that was so stupid…"
    },
    {
      "rating": "3/5",
      "review": "Cool concept. Not so impressive execution."
    },
    {
      "rating": "5/5",
      "review": "A really good movie."
    },
    {
      "rating": "4.5/5",
      "review": "Fantastic acting, unpredictable twists and turns, symbolic, and an overall thrill ride that shouldn't be missed."
    },
    {
      "rating": "3.5/5",
      "review": "A well-paced, entertaining “what if” tech-future movie. I loved the core concept and plot, but the dichotomy between the music choice (usually happy feeling music) vs dark plot was odd for me. It resulted in an strangely up-beat tone which wasn’t “bad” but my preference would have been for this story to be darker and not have as much comedy/uplifting moments. It was still really cool. It’s a fun time. Recommended"
    },
    {
      "rating": "4.5/5",
      "review": "Enjoyed this movie quite a bit; but it doesn't make humanity look very good! I randomly picked this movie to watch, to give my brain a break from the AI I'm currently studying.....and what's it all about? AI. You can run, but ya cannot hide. AI is here to stay, whether that is good or bad, is entirely on us......and that is a frightening thought.....Good movie!"
    },
    {
      "rating": "0.5/5",
      "review": "The positive reviews for this movie makes me really question if positive reviews are paid for. This is a very subpar movie that should only be watched on streaming if your can bare it."
    },
    {
      "rating": "4/5",
      "review": "I enjoyed the exploration of the ethics of AI, the meaning of humanity, and the intersection of AI and humanity."
    },
    {
      "rating": "5/5",
      "review": "Had so much fun watching this movie 😌"
    },
    {
      "rating": "4/5",
      "review": "Great cast. Great script. Clever direction. Best to go in knowing nothing. I do believe- an instant classic!"
    },
    {
      "rating": "5/5",
      "review": "Thoroughly enjoyed this smart, sci-fi dark comedy. It’s like Ex Machina in Fargo! Jack Quaid should be careful he doesn’t get type cast as the weak, asshole boyfriend. His character Josh is essentially Hughie from The Boyz."
    },
    {
      "rating": "4.5/5",
      "review": "in a nut shell: a dark drama-dy. Something different. I rank based on genre."
    },
    {
      "rating": "4.5/5",
      "review": "Good story, throughly enjoyed it but a bit slow."
    },
    {
      "rating": "3/5",
      "review": "It was good. More gory than I like but still good. The end could have been done better."
    },
    {
      "rating": "4/5",
      "review": "Drew Hancock, a first-time director, makes a remarkable and exhilarating debut with Companion. While it may feel a bit uneven at times, Hancock’s script is refreshingly sharp and witty. Companion effortlessly combines a swiftly paced and occasionally shocking horror film, a delectably witty dark comedy, and a critique of toxic relationships, all seamlessly woven together. It’s a delightful riff on various “killer robot” films, drawing at times to comparisons to The Stepford Wives."
    },
    {
      "rating": "3.5/5",
      "review": "It’s ok to watch maybe streaming an evening when nothing better available. Nothing wow about plot or twists. But Sophie Thatcher excels as the bot discovering she is a bot. Great actress"
    },
    {
      "rating": "3/5",
      "review": "It was fun and I was intrigued for awhile but by the end I was getting bored with it."
    },
    {
      "rating": "4.5/5",
      "review": "Liked it. Very cool concept."
    },
    {
      "rating": "4.5/5",
      "review": "Surprisingly fun and entertaining with \"grab your attention\" plot twists that exhibit fantastic performances by Sophie Thatcher and the supporting cast."
    },
    {
      "rating": "4.5/5",
      "review": "Very good example of the genre. Good questioning of what it is to be human. All actors are excellent and location is very scenic."
    },
    {
      "rating": "5/5",
      "review": "Thatcher and Quaid are, low key, the best horror actors in our current climate. A pretty predictable plot was championed by the acting 👍🏻"
    },
    {
      "rating": "3.5/5",
      "review": "Food for thought. Predicable but also extremely enjoyable. Great cast with a cool script. Original and thought provoking. This is perhaps Elon's vision. Sound track was perfect. Watch and enjoy something refreshing!"
    },
    {
      "rating": "4/5",
      "review": "This was just a fun, enjoyable movie for a night out. Worth the ticket price- but it will make a good streaming option too if you decide to wait. The premise was fun, pacing was great, performances were on point. A couple plot points didn’t make sense but it’s easy to overlook when you’re enjoying the film."
    },
    {
      "rating": "5/5",
      "review": "Excellent unexpected movie. I really enjoyed it"
    },
    {
      "rating": "0.5/5",
      "review": "Could not make it past 15 minutes. Just sooooo bad. The writing is bloody awful, at best high school screenwriting class. Absolutely cringe dinner party scene where none of the interaction is remotely what you would see in real life, only \"set pieces\" for corny characters. Absolutely ZERO believable chemistry between these so called friends, again just a figment of a really hackey writer. Everything about this trash doesn't pass any test. And of course 94% on RT, precisely why movies are hot garbage and the talent is in TV."
    },
    {
      "rating": "5/5",
      "review": "Awesome thrill ride. Really fun original film"
    },
    {
      "rating": "1.5/5",
      "review": "Can’t believe the positive reviews for this simple, unsurprising retread of every fembot movie you’ve ever seen. There’s nothing new to see here. Move along."
    },
    {
      "rating": "5/5",
      "review": "An excellent metaphor for any toxic, manipulative and abusive relationships. The twist perfectly conveys the objectification and dehumanization that can happen to a person involved with a narcissistic partner."
    },
    {
      "rating": "4/5",
      "review": "I actually really enjoyed this!"
    },
    {
      "rating": "0.5/5",
      "review": "Complete trash! Ridiculous story with zero plot. The other reviews on this must be complete fake. No way anyone likes this garbage!"
    },
    {
      "rating": "4/5",
      "review": "Companion is one of those films that is way more enjoyable if you go in blind. It is unfortunate that the marketing and trailers went so far in the spoiling territory considering the amazing initial teaser. I won't spoil anything in this review. All you need to know is that this movie has an incredibly funny, dark and engaging script. Sophie Thatcher gives a terrific performance and Jack Quaid is fantastic in the role provided. This is a must-watch!"
    },
    {
      "rating": "5/5",
      "review": "What an awesome work of a movie! Sophie Thatcher‘s Performance was captivating, very powerfull. 👍"
    },
    {
      "rating": "3.5/5",
      "review": "Sophie Thatcher is excellent as the robot companion initially unaware that her entire history is a collection of false memories. What starts as a simple weekend with friends in an isolated cabin, soon spirals into a twisted tale of murder and revenge where the humans invariably appear less empathic than the robots they exploit."
    },
    {
      "rating": "5/5",
      "review": "Excellent sci-fi horror. Sophie Thatcher and Jack Quaid are amazing"
    },
    {
      "rating": "3/5",
      "review": "Entertaining, but not as clever as it thinks it is. The questions about AI were better explored in Ex Machina. The dark comedy elements were fine, but again nothing most people haven't seen before. I think if you paid to see it in the theater you'd be disappointed but if you watched it on your streaming service you would be happy with it."
    },
    {
      "rating": "4.5/5",
      "review": "Iris (Sophie Thatcher) and her partner Josh (Jack Quaid), gather for what promises to be a relaxing getaway. However, the atmosphere quickly shifts as unsettling revelations come to light, challenging the group's perceptions and trust. There was no lack of twists and turns!"
    },
    {
      "rating": "5/5",
      "review": "Surprisingly really good movie, enjoyed it"
    },
    {
      "rating": "4/5",
      "review": "went in a direction that i was not expecting at all...very fun watch and surprisingly funny!"
    },
    {
      "rating": "3/5",
      "review": "Sometimes a movie does not really click with you, at any point, but you cant really pinpoint why. This is also a movie where the trailer ruins most of the suprises and often it is really too one the nose with its dialouges."
    },
    {
      "rating": "0.5/5",
      "review": "Ugh trendy and ridiculous. Boring and stupid."
    },
    {
      "rating": "4.5/5",
      "review": "Very good movie. It was refreshing to finally watch something where you have no idea what's going to happen next. I was on the edge of my seat throughout. Go in blind like I did and do NOT watch the trailer!"
    },
    {
      "rating": "3.5/5",
      "review": "Companion capitalizes on the fear of AI and \"what ifs\" and is deftly played by its leading roles."
    },
    {
      "rating": "4/5",
      "review": "Original, entertaining. Totally recommend."
    },
    {
      "rating": "5/5",
      "review": "Exceeded expectations in every way"
    },
    {
      "rating": "4/5",
      "review": "A bit overrated. This movie follows the standard android robot cookie cutter template: The android breaks free to roam the world. Think Ex Machina. I may be biased because I like Sophie Thatcher, ever since she was in Yellowjackets season 1 and Heretic. She's one of the up and coming stars for horror movies. Also Jack Quaid was surprisingly decent here, I did not think he could do a role as a bad guy probably because he's such a wimp in The Boys and all his other acting roles."
    },
    {
      "rating": "4/5",
      "review": "Lots of good twists and turns in the narrative, with the strong themes at play being written well"
    },
    {
      "rating": "2.5/5",
      "review": "This is an average film, blessed with a cool story and cursed by a sophomoric clunky script. There are some flashbacks that are so poorly written that it’s laughable. I am shocked it is rated as highly as it is by the critics."
    },
    {
      "rating": "5/5",
      "review": "Best Horror of the year fun good twists!"
    },
    {
      "rating": "3.5/5",
      "review": "Very good movie, with great twists throughout."
    },
    {
      "rating": "3.5/5",
      "review": "'Companion' is a bloody fun sci-fi-tinged, comedic thriller buoyed by solid central performances."
    },
    {
      "rating": "5/5",
      "review": "Loved it! We went in not knowing much about it ..just that it looked interesting and so glad we did...it made the movie even better!. Awesome performances by all!"
    },
    {
      "rating": "4/5",
      "review": "The only reason I didn't give 5 is because it's not a movie I would rewatch many times. But I really enjoyed it! It was a very engaging story and I have already been recommending it to others!"
    },
    {
      "rating": "3/5",
      "review": "Not bad overall, but they could have stuck the landing a little better. I'm glad I didn't see any trailers, because I think that would have ruined the movie."
    },
    {
      "rating": "4/5",
      "review": "It's somehow effervescent and heavy - highly detailed yet never insulting. Despite a lot of contrasts - (not negatives) the movie moves at a clip. It's sometimes suspenseful, sometimes funny, always interesting - and not once does it lose track of it's gorgeous visual palette. This is fun and breezy entertainment - Sophie Thatcher is unreal (as usual) - go in as blind as possible."
    },
    {
      "rating": "1.5/5",
      "review": "Im guessing that I am more critical than most. Maybe I didnt grasp the idea of what the story was shooting for. I was not amused by this movie The acting was sub-par and the storyline was really weak. Im just critical One and Done"
    },
    {
      "rating": "4.5/5",
      "review": "An absolute surprise that enters fully into the best of what we have so far in 2025 and that positions a director in his debut as someone to take into consideration for what he proposes to us in the future. A fun, clever and satisfactory film in its final result. Perhaps it has certain decisions that do not make it perfect, but the film does not seek to be perfect and that is what allows it to be satisfactory. A proposal that is worth seeing and enjoying, especially with its protagonist who steals all the attention and delivers a sublime, but terrifying charm."
    },
    {
      "rating": "1/5",
      "review": "stop calling sci fi every movie that uses in the dialogue words like robot. that dosent make it sci fi. its not funny, bad acting mid plot"
    },
    {
      "rating": "3.5/5",
      "review": "Ir sin saber nada de la película habría sido una experiencia inolvidable y la habría mejorado enormemente, pero el marketing arruina todo eso al revelar el primer plot twist. La actuación de Sophie Thatcher y Jack Quaid es de lo mejor de la película, al igual que la fotografía. También creo que la trama, en algunos puntos, está cogida con pinzas, no respeta sus propias reglas y, al menos para mí, eso me saca bastante. Aun así, fue una experiencia bastante buena."
    },
    {
      "rating": "3/5",
      "review": "Cute. A little weak on story. The details all fell into place rather simply and stupidly. The robot was able to survive and upgrade and escape because the players involved were idiots and the robot was the only person in the entire film with an IQ higher than a clock radio. Felt, cheap? Still, the acting (within the confines of the weak screenplay and script) was decent, the scenes had their moments. The only real gripe was that there was just a little to much robotic convenience, and that it was so stupidly easy to be smart enough hack robots to murder for you, and yet be stupid enough to not know where their HD was or have anything resembling a failsafe? That in the end a robot could be made self controlling with a button press, as if it had never once been tried in a decade or more of these being available? And nobody had ever used a robot to be a bodygaurd or commit a bank robbery, it was just all very, unexplained and unbelievable."
    },
    {
      "rating": "2.5/5",
      "review": "aconteceu comigo e com meu ex namorado o pedro"
    },
    {
      "rating": "4.5/5",
      "review": "It was fun! Definitely a feel good revenge story 🩷"
    },
    {
      "rating": "5/5",
      "review": "Just a good, suspenseful film makes you wonder just how all of our lives will potentially encounter AI humans & companionship."
    },
    {
      "rating": "5/5",
      "review": "Brilliant. Went in knowing nothing about the plot and boy oh boy was I blown away at the genius twists. A movie so good it’s worth a second watching just to see how brilliant the writing and direction are in this little masterpiece. All the hints, all the Easter eggs …holy crap watch it twice."
    },
    {
      "rating": "3.5/5",
      "review": "Thank goodness I avoided watching the main trailer or any other promos for Companion. I only saw the teaser, which seemed pretty interesting, and I was intrigued by the marketing, especially the line “From the creators of Barbarian.” Naturally, I assumed it was the same director. I intentionally stayed away from other trailers because I wanted to go in blind. The teaser was very vague, and I wanted to keep that mystery intact. I also didn't read any reviews, as I was really hoping to watch it in theaters, which would’ve been my first theatrical experience of 2025. Unfortunately, I couldn’t make it due to other commitments, but I finally got the chance to stream it. A lot of critics pointed out that the main poster gave away the big twist, but I didn’t feel that way at first. Maybe my vision’s not great, but when I looked at the poster, I thought she was just rolling her eyes upward and to the side—nothing too telling. However, just before I was about to watch the film, I came across a bit of text online that spoiled the twist for me. Suddenly, the poster made sense, and I was kind of bummed. On top of that, I found out the director is a newcomer—not the same one behind Barbarian—which felt a little misleading given the marketing. Still, I was curious and dove into the film anyway. Now, onto the review. Sophie Thatcher is really making a name for herself as a rising star in horror (though I hate the term scream queen). After her standout performance in Heretic last year, she gives another solid performance here in Companion—probably her best yet, though it's not as subtle as what she did in Heretic. She plays Iris, a robot (or, as her boyfriend Josh, played by Jack Quaid, calls her, a \"f*ck bot\"). Speaking of Quaid, he really impressed me with his darker performance—totally different from his role in The Boys. The supporting cast also did a good job, even though I didn’t recognize many of the actors. What really surprised me about this movie was how much comedy there was. It had a lot more humor than I expected, and I found myself laughing quite a bit. The premise delves into the complexities of AI in physical form and what kind of relationships we could form with them—and vice versa. I totally get that this concept might be unsettling to some, and that’s understandable. With AI evolving so rapidly, though, this kind of reality might not be too far off. The humor was on point, the kills were creative, the acting was strong, and technically, everything worked well. The movie explained the tech in a way that felt sensible within the context. That said, there was one particular kill that felt a bit too far-fetched for my taste. Still, I had a lot of fun with this one. If you’re in the mood for a 90-minute, chamber-piece thriller with a touch of dark comedy, this is definitely worth checking out."
    },
    {
      "rating": "5/5",
      "review": "Smartest thing I've seen since \"Palm Springs\". Go and enjoy!!!!"
    },
    {
      "rating": "5/5",
      "review": "This is the must see movie for me so far this year. Really don't have anything bad to say about it. I loved the cast, specifically Jack Quaid, Sophie Thatcher and Lukas Gage, but everyone is great. The first act does a great job of setting everything up, both the relationship between Quaid and Thatcher, and the chemistry amongst the group once they get to the cabin. When things take off, they take off and it doesn't let up until the credits roll. I loved all the misdirects, the perfectly timed humor, and most importantly, the relationship dynamics at play here. Such a thrilling movie that hits on some great societal topics."
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed this movie, which has a lot of humor but could have just as easily been conceived and produced as a horror/thriller without the comedy. Some of the twists I saw coming but others I didn't. There is a clear nod to a certain Arnold Shwarzenegger film, and there are themes related to abusive relationships."
    },
    {
      "rating": "3.5/5",
      "review": "It’s an interesting movie"
    },
    {
      "rating": "5/5",
      "review": "Great script and fresh faces who did an amazing job"
    },
    {
      "rating": "3.5/5",
      "review": "A wicked sci-fi dark comedy thriller with unexpected twists and well performed by its cast that includes Dennis Quaid's son, Jack Quaid of \"The Boys\", Lukas Gage of \"White Lotus 1\" and Harvey Guillen of \"What We Do In The Shadows\" among the familiar faces."
    },
    {
      "rating": "2.5/5",
      "review": "Me hubiera gustado no saber de que iba la historia, eso en mi opinión le hubiera dado un toque diferente pero desde los avances se sabe a que vamos. La trama considero que quedo a medias y su elenco secundario sentía que estaba hay solo para rellenar espacios. La única que logra robarse el protagonismo es Iris."
    },
    {
      "rating": "4/5",
      "review": "So much fun, this movie. Sure it plays into stereotypes and reductionist social commentary, but it succeeds massively with plot-driven mayhem. Totally enjoyed this."
    },
    {
      "rating": "2.5/5",
      "review": "Had more potential than it reached. Very entertaining film all throughout, and even though there's been plenty of robot/AI/android movies, this one carries a different/unique aspect to the story line. Overall a good movie with questionable scenes. My issue was with some of the messages it portrayed, males (of various backgrounds) were portrayed mores monstrous than even an evil woman."
    },
    {
      "rating": "3.5/5",
      "review": "Not bad at all. I guess I was expecting a little bit more from it…? But it’s still pretty solid, for sure. If you ARE gonna watch it, try going in blind for a better experience & DON’T watch the trailers!! What really caught my interest was its premise, being unique and original, which I appreciate to see! As for complaints, there was A FEW plotholes, or things that just seemed too stupid or unrealistic, things that I felt happened for the sake of happening. oh, and for a horror movie it SURE lacks the horror 😭 I don’t think there was one moment where I was even remotely scared, but it’s fine because maybe it just wanted to lean more into the thriller aspect..? Seemed that way. All that aside, it was a good watch. A well-made movie with a cool premise, what’s to dislike? My rotten tomatoes score: 70/100 🍅"
    },
    {
      "rating": "4/5",
      "review": "Good movie. There was something a little lacking in the final act that I can't quite put my finger on after a single watch but for the most part it was excellent."
    },
    {
      "rating": "4.5/5",
      "review": "A enjoyable watch, a good allegory for being in a controlling toxic relationship. Great acting from both the AIs."
    },
    {
      "rating": "4/5",
      "review": "If you’re into scifi and especially AI and robots yo u will enjoy it. Its fun and entertaining but could have done so much more with the story."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed this movie. It was like stepford wives but for the modern age. I recommend giving it a view."
    },
    {
      "rating": "5/5",
      "review": "Funny and deep at the same time! bingo, not scary, not really about the action, Rick and Morty-esque plot, but with a soul. super"
    },
    {
      "rating": "5/5",
      "review": "This movie is for the girlies who have dated League of Legends men or something equivalent. This movie will make you feel better."
    },
    {
      "rating": "3/5",
      "review": "Companion was a great movie, but as the plot unfolded, I found Jack Quaid’s character somewhat unconvincing, which left me questioning certain aspects of the story. My first thought was, Is he serious? Spoiler Alert! If you feel the need to control women—or anyone, for that matter—you’re already a weirdo. But that’s exactly what makes this movie so compelling. It highlights the unsettling reality that some people genuinely desire complete control over others. I think the director did a great job weaving this theme into the film as an underlying message. My rating: 3/5. Definitely worth a watch for the thought-provoking premise."
    },
    {
      "rating": "5/5",
      "review": "This movie is a must-see, a dark comedy at its finest and I can’t wait to show people this movie 💖"
    },
    {
      "rating": "4/5",
      "review": "Sophia Thatcher want to watch good movie a little bit of everything overall really good film and original"
    },
    {
      "rating": "5/5",
      "review": "Unique take on the whole AI companion craze. Sophie Thatcher is great in this but Lukas Gage stole the show. Thrilling and funny, an excellent watch throughout. What a great movie to start the year."
    },
    {
      "rating": "3.5/5",
      "review": "A relatively short runtime and good acting/directing/script make this sci-fi-thriller-dramedy a good watch, although I think more time spent on both Josh and Kat in the right way could've pushed the rating a bit higher. This film pushes a little past movies with similar themes around android girlfriends (see Blade Runner, Her, Ex-Machina) by introducing an element of \"modding,\" or intentional misuse of a technology by consumers. I thought that was interesting."
    },
    {
      "rating": "5/5",
      "review": "Omg from beginning to end I LOVED IT. I had to use the restroom SO BAD, but I didn't want to miss anything!"
    },
    {
      "rating": "3/5",
      "review": "It was good but it was missing an ingredient. Can't really put my finger on it. It had a dash of this, a dash of that, a slice of this and a cup of that and all stirred together... while it should have been tasty it was a bit hollow. Did it want to be a sci-fi flick? A slasher? Maybe a romance? It should have picked a lane and gone full throttle but instead it stayed in the middle of road. The biggest issue I can point to is the villain, seeing there were instances towards the end where the neon \"WHY DOES HE NOT JUST DO THIS?\" elephant in room is so loud and clear while the entire climax hinges on the issue all 007 movie villains have. That aspect is a prime example of this movie... it could've recognized what it was doing, grasped it, lifted it up and made it shine but it didn't and decided mid-road was the best approach."
    },
    {
      "rating": "4.5/5",
      "review": "Fun film with a few twists and a little violent. I recommend it."
    },
    {
      "rating": "3/5",
      "review": "Not too bad. Sophie Thatcher was nice to look at and was the saving grace. It could have been better. It would've been nice to have more story/backstory."
    },
    {
      "rating": "4/5",
      "review": "thoroughly entertaining with a quirky plot and humour that pops . The performances can't be flawed and the pacing is taunt."
    },
    {
      "rating": "5/5",
      "review": "I didnt know what to expect but wow. Great movie"
    },
    {
      "rating": "3.5/5",
      "review": "This movie was good! A few years ago I would have thought this could not be possible but now heck anyone can probably buy a companion. This was an interesting topic and movie. It was entertaining and well made. Good acting."
    },
    {
      "rating": "1.5/5",
      "review": "The rating for this movie is around 90% which is a disgrace to other movies that deserve to be in the ranking. There’s some unrealistic parts, but if you think of this as a mini Low budget slasher movie you might like it. Possibly."
    },
    {
      "rating": "4/5",
      "review": "Original story and well done. Thoroughly enjoyed this movie."
    },
    {
      "rating": "4/5",
      "review": "This movie reminded me of the replicants in Blade Runner more than anything else."
    },
    {
      "rating": "3.5/5",
      "review": "Wow! First of all, don't watch any trailer, thus watching this flick gets an additional eye rising effect. It's cruel, brutal, often horribly violent, but always so much over the top that it gets insanely hilarious. I had an absolute blast. And I really don't want to give anything away here, as it might spoil your fun. Though only having unknown actors to offer, the silly, weird, but probably not anymore so far off story is cool enough to blast away after a slow lullaby intro and lead to a very satisfying bloody ending. 7 1/2 of 10 points!"
    },
    {
      "rating": "5/5",
      "review": "Smartly written and fast paced thriller. Enjoyed every minute."
    },
    {
      "rating": "5/5",
      "review": "Movie is pretty damn good"
    },
    {
      "rating": "2.5/5",
      "review": "The movie surprised me positively at the start. As the movie progressed, however, it turned out to be boring and predictable with dull events. Too bad but still interesting, I'm looking forward to future dealings with AI in movies."
    },
    {
      "rating": "5/5",
      "review": "Sophie Thatcher was great in this movie 🍿"
    },
    {
      "rating": "3/5",
      "review": "It was ok. Kinda original. Got slow at times but it's an ok watch."
    },
    {
      "rating": "5/5",
      "review": "A really great unique premise that keeps you on your toes."
    },
    {
      "rating": "5/5",
      "review": "This movie is awesome !!! Once you watch it I recommend watching it again . You take away a lot more on the 2nd viewing and it just gets better . Sophie Thatcher Is beautiful to watch and she going to be a big big star . He acting was top notch !!! I recommend this movie in a theater with tons of people around you !!!"
    },
    {
      "rating": "5/5",
      "review": "a clever and thrilling movie that keeps you on the edge of your seat with its unexpected twists and turns. The performances, especially by Sophie Thatcher, are outstanding, making it a must-watch for fans of the genre."
    },
    {
      "rating": "4/5",
      "review": "Cute, well done and very silly. I would recommend it."
    },
    {
      "rating": "3.5/5",
      "review": "I thought the movie was weird, but I guess that's a good thing. Definitely a few twist in the movie, Usually these aren't my type of movies, but I thought it was entertaining, The movie reminded me of Subservience with Megan fox, but just in a different way. I mean the trailer doesn't really spoil much. I thought it was OKAY movie"
    },
    {
      "rating": "4/5",
      "review": "Sophie Thatcher is a newly found treasure to the genres of horror and thriller. This film just further proves that statement and helps cement her legacy. This is one of those films that are easily rewatchable."
    },
    {
      "rating": "4/5",
      "review": "Had a great time with it! I went into it without seeing any trailers or spoilers so I wasn’t sure what to expect and was pleasantly surprised with the comedic aspect."
    },
    {
      "rating": "5/5",
      "review": "I love that this movie had you on your toes would highly recommend seeing it it wasn’t to scary it had some funny clips in it as well."
    },
    {
      "rating": "5/5",
      "review": "Really enjoyed it! Pretty original and the actors were great."
    },
    {
      "rating": "5/5",
      "review": "Goes in with the 2 Movies, Megan & a Simple Favor. Really liked this Movie"
    },
    {
      "rating": "3.5/5",
      "review": "(B+) The less you know going into this the movie the better. A smart script carried by a brilliant Sophie Thatcher and a a diabolical Jack Quaid. Go see it."
    },
    {
      "rating": "3/5",
      "review": "Just not very believable"
    },
    {
      "rating": "5/5",
      "review": "Great and very creative horror movie."
    },
    {
      "rating": "4.5/5",
      "review": "Fresh and Entertaining Film"
    },
    {
      "rating": "5/5",
      "review": "This movie was good & had a plot twist I did not see coming😅 10/10!!!!!"
    },
    {
      "rating": "5/5",
      "review": "Excellent movie. Kind of suspected there was gonna be a twist but not what ended up coming! The added humor was a wonderful touch."
    },
    {
      "rating": "5/5",
      "review": "Very good movie! Great plot twists"
    },
    {
      "rating": "5/5",
      "review": "Sophie Thatcher is great!"
    },
    {
      "rating": "0.5/5",
      "review": "One of the worst movies I’ve watched in awhile"
    },
    {
      "rating": "4/5",
      "review": "Fun concept, second act drags a bit."
    },
    {
      "rating": "5/5",
      "review": "Great twists and turns. Super entertaining!!"
    },
    {
      "rating": "5/5",
      "review": "Like Ex Machina, but with more heart. I loved the characters and the twists! The story was more engaging than Ex Machina as well. It's just a super-fun ride, even if it may be considered predictable to some."
    },
    {
      "rating": "4/5",
      "review": "Entertaining movie-- the plot has some interesting twists, though at times a bit silly. Overall I enjoyed it, yet I wouldn't call this a great movie at all."
    },
    {
      "rating": "5/5",
      "review": "A visceral comedy that wouldn't be afraid to live if the circumstances didn't call for murder. A cast with exuberant talent and a well crafted script make this the perfect date night comedy-horror."
    },
    {
      "rating": "4/5",
      "review": "Entertaining. Not entirely predictable. Had some pretty funny moments and good messages."
    },
    {
      "rating": "3/5",
      "review": "A clever story with some unexpected twists. There are callbacks to \"Blade Runner\" and \"Terminator\" which mesh well with the story. Like other android movies, it's just a matter of exactly how it all goes haywire."
    },
    {
      "rating": "4/5",
      "review": "Wasn't expecting to like it but surprisingly was quite good. Just enough twists and turns to keep interesting."
    },
    {
      "rating": "5/5",
      "review": "Great movie, nice pace and good story line…overall it was a fun movie to watch."
    },
    {
      "rating": "5/5",
      "review": "Looks a lot like our near future"
    },
    {
      "rating": "3.5/5",
      "review": "8/10. Definitely worth seeing, but not as good as Ex Machina."
    },
    {
      "rating": "4/5",
      "review": "I think slightly overhyped as a horror movie, but definitely a great movie in its own right. the great acting from everyone. And a compelling concept of story."
    },
    {
      "rating": "4/5",
      "review": "Stupid people alone in a cabin, AI gone rogue, and a little heist."
    },
    {
      "rating": "5/5",
      "review": "Outstanding, clever, best movie of the year so far!"
    },
    {
      "rating": "4.5/5",
      "review": "Not too long, funny, different, good"
    }
  ]
}