{
  "movie_name": "The Amateur",
  "reviews": [
    {
      "rating": "2/5",
      "review": "The trailers spoil the first two acts of the movie almost entirely, leaving an underwhelming third act to tie things up. Sadly marketing ruined this one for me"
    },
    {
      "rating": "4/5",
      "review": "The movie was fast paced and action oriented and captured the various actors in the movie. Definitely worth seeing"
    },
    {
      "rating": "4/5",
      "review": "Good action movie that's not predictable"
    },
    {
      "rating": "5/5",
      "review": "Extremely well done. Excellent acting, an intelligent script and story actually written for adults. Highly recommended."
    },
    {
      "rating": "5/5",
      "review": "This movie was far better than I expected. I wish it had received more attention and more promotion than it has had. The cast was great, and Rami was exceptional!"
    },
    {
      "rating": "5/5",
      "review": "It was an enjoyable movie. There were a couple scenes that had me scratching my head."
    },
    {
      "rating": "5/5",
      "review": "Liked the tech aspect and Malek's intelligence"
    },
    {
      "rating": "5/5",
      "review": "just a great idea for a great movie!"
    },
    {
      "rating": "5/5",
      "review": "Fantastic! I like the fact that he’s not your typical CIA agent! Great acting! Nice pace!"
    },
    {
      "rating": "5/5",
      "review": "Suspenseful and smart! A great movie to see on the big screen"
    },
    {
      "rating": "5/5",
      "review": "I liked the Amateur (2025) I felt the movie had a great pace, great action, easy to follow and very entertaining.Never a dull moment. I would watch it again. Very entertaining and powerful story."
    },
    {
      "rating": "5/5",
      "review": "Great story, great movie!"
    },
    {
      "rating": "4/5",
      "review": "I’d not read the book or seen the 1980s movie before watching Rami Maalek’s version so this was new ground, as it were. Definitely worth seeing. Solid performances all around and more suspenseful than I expected. Still, I wanted to read the original novel before reviewing the movie and I’m glad I did; the original book delves more into why the blackmail works that wasn’t explored enough in the movie. (No spoilers; let’s just say that what a writer would consider enough to blackmail top CIA officials in the 70s is called Tuesday in the 21st century’s CIA!🤣) Good enough for a widescreen tv but I was impressed with the’big screen experience.”"
    },
    {
      "rating": "4.5/5",
      "review": "Fun movie. Some action and overall very enjoyable."
    },
    {
      "rating": "4/5",
      "review": "Great little spy thriller. Perfect for a matinee."
    },
    {
      "rating": "0.5/5",
      "review": "Watch it? Rent it? Skip it? Skip it. That was such a huge waste of a free movie ticket. The Amateur is about a pencil neck, computer geek working for the CIA who becomes an International CIA Agent overnight in order to find and kill those who killed his wife. Sounds stupid? You’re right. It is. It was. Somehow over a 2 hour period Rami Malek, an academy award winner, is transformed into a bullet proof CIA spy using his skills he learned from Lawrence Fishburne over a period of a few days and the help of YouTube videos (seriously). Jon Berthnal has a couple of very regrettable appearances, seriously, just a couple. Needless to say Rami learns how to hack into every building, access every camera, to evade the highly trained CIA agents sent to find him. He is bulletproof. Literally escaping a Seal team with automatic weapons. Ugh. It is just so cringe worthy. I feel more stupider just writing this. This was crap. Just total crap. A waste of 2 hours and a free movie ticket. Don’t waste your time or money watching this stupidity."
    },
    {
      "rating": "5/5",
      "review": "Great twists and turns!! Loved it!"
    },
    {
      "rating": "5/5",
      "review": "Incredible!!!! Edge of your seat the entire movie…..Will purchase when released!!!"
    },
    {
      "rating": "4/5",
      "review": "It was better than expected, definitely enjoyed the “cerebral” twist on the spy thriller genre."
    },
    {
      "rating": "5/5",
      "review": "Epitome of a fun popcorn movie. Lots of action and suspense. And Rami Malek was great."
    },
    {
      "rating": "4/5",
      "review": "Great acting, believable plot, not exceptionally violent"
    },
    {
      "rating": "2/5",
      "review": "Movie was just okay. Didn’t totally suck."
    },
    {
      "rating": "5/5",
      "review": "WAY BETTER THAN I THOUGHT !!"
    },
    {
      "rating": "4/5",
      "review": "Entertaining. Solid story, well acted. Good character development. Fast moving and engaging story."
    },
    {
      "rating": "4.5/5",
      "review": "Plenty off suspense, action packed with a tiny hint of comedy"
    },
    {
      "rating": "2.5/5",
      "review": "Enjoyably preposterous with a great bunch of actors, not all of whom are best fitted for their roles, but are still great to see ."
    },
    {
      "rating": "5/5",
      "review": "Finally, a good movie. It had a fantastic ending."
    },
    {
      "rating": "5/5",
      "review": "The most exhilarating spy movie of this decade. An absolute must see would recommend for all of my friends"
    },
    {
      "rating": "4/5",
      "review": "Great story and action"
    },
    {
      "rating": "3/5",
      "review": "slow moving and could have a little more action. story was very good though"
    },
    {
      "rating": "2/5",
      "review": "The action was the best part of the movie."
    },
    {
      "rating": "1/5",
      "review": "Somewhere south of awful"
    },
    {
      "rating": "5/5",
      "review": "I thought the actors were great the lead actor was fantastic. All of the actors were wonderful. The plot was outstanding."
    },
    {
      "rating": "5/5",
      "review": "Rami Malek is great as usual"
    },
    {
      "rating": "3.5/5",
      "review": "Great premise but needed better execution. Don't show the best scene in the Trailer!!"
    },
    {
      "rating": "4.5/5",
      "review": "We enjoyed Seeing This at the Theater. However we felt we would have also enjoyed watching it from home in our PJ’s with pause breaks for snacks and the bathroom."
    },
    {
      "rating": "5/5",
      "review": "Perfect writing, actual fleshed out strong supporting female characters, and a great commentary on grief. Fantastic writing, great directing, and outstanding acting. A must see!"
    },
    {
      "rating": "4/5",
      "review": "The movie started a bit slow, but once it hit its stride, it held my attention the rest of the way. I found some parts of the plot to be somewhat difficult to follow. I could see the effects, but (to me), the causes needed more setup. Also, the suspense and musical background noise often obscured the dialogue."
    },
    {
      "rating": "3.5/5",
      "review": "The Amateur has its flaws, but it is well acted and holds true to the novel it is based on. Of course any movie in this category is going to considered far fetched, as there are certainly some thoughts on this particular installment doubling down on that notion. I found it enjoyable, and Rami Malek is good in just about anything he does."
    },
    {
      "rating": "4.5/5",
      "review": "I am begging directors to let Rami Malek off the leash. Mr. Robot showed us how much talent this man has, but no one since Esmail has been able to pull that level of performance out of him. This movie gets a solid B from me, but man. Knowing how strong and formidable he is as an actor, I walk away from most performances disappointed. Give him more to work with, and push him hard. He won't disappoint."
    },
    {
      "rating": "5/5",
      "review": "Great storyline and character development. Loved how it all came together at the end."
    },
    {
      "rating": "3/5",
      "review": "Just never got into the story or the main character. Did like the ending as that seemed the most believable."
    },
    {
      "rating": "4.5/5",
      "review": "Fantastic thriller adapted from just as thrilling of a novel. Rami Malek was perfect for this role and absolutely commands every scene he's in. Highly recommended 4.5/5."
    },
    {
      "rating": "5/5",
      "review": "Great from start to end."
    },
    {
      "rating": "4/5",
      "review": "we were totally entertained!"
    },
    {
      "rating": "5/5",
      "review": "It was filled with action, intrigue, and I liked that I couldn't figure out how it was going to end. Acting was well done as well."
    },
    {
      "rating": "3/5",
      "review": "It was a good movie but wasn't great."
    },
    {
      "rating": "5/5",
      "review": "Was a slow movie getting into but story was awesome definitely would watch again"
    },
    {
      "rating": "5/5",
      "review": "Loved it. Clever, engaging, and well written."
    },
    {
      "rating": "5/5",
      "review": "Kept you on the edge of your seat!"
    },
    {
      "rating": "4/5",
      "review": "Satisfying and entertaining. A few incongruencies but for the most part really well done"
    },
    {
      "rating": "5/5",
      "review": "Great movie from start to end"
    },
    {
      "rating": "5/5",
      "review": "Good story. Flies by."
    },
    {
      "rating": "4/5",
      "review": "it starts a little slow but picks up and is a good movie. We would recommend this movie."
    },
    {
      "rating": "4/5",
      "review": "Story line was great but it was a little slow."
    },
    {
      "rating": "3.5/5",
      "review": "Not a terrible movie, but so many of the best scenes and plot points were in the trailer. Overall, I wish we had waited to stream it rather than seeing it in the theater."
    },
    {
      "rating": "4/5",
      "review": "I went with 2 friends, I enjoyed the story and Rami's acting. The pacing was a little slow for us. My friends both fell asleep at noon on a Sunday, albeit a rainy Sunday! I think it is worth the time to see it!"
    },
    {
      "rating": "4/5",
      "review": "This movie brought something fresh to the action genre. Also Rami Malek."
    },
    {
      "rating": "1.5/5",
      "review": "Story has many loose ends. Most of the time we’re unable to follow the logic. Some characters are completely out of place. Overall the script has substantial flaws and it’s an overall disappointing movie."
    },
    {
      "rating": "4.5/5",
      "review": "This was a compelling and thrilling plot. Enough suspense and not overly violent."
    },
    {
      "rating": "5/5",
      "review": "it was really good and kinda confusing at some moments but all an all really good"
    },
    {
      "rating": "4/5",
      "review": "Very good movie! 8/10. Great plot and very good acting. I highly recommend watching it!"
    },
    {
      "rating": "4/5",
      "review": "Captivating with happy end revenge - can outsmart this guy enjoyed it!"
    },
    {
      "rating": "4/5",
      "review": "Great storyline, engaging, felt his pain. Definitely recommend!!"
    },
    {
      "rating": "5/5",
      "review": "Well written, well acted, particularly by the Rami Malek, the main actor. Great story line, very captivating. It's set up nicely for a sequel!"
    },
    {
      "rating": "5/5",
      "review": "Very good story, loved Malik's character and development."
    },
    {
      "rating": "3/5",
      "review": "Character development was weak. Didn't feel the connection and conflict between characters for the most part."
    },
    {
      "rating": "4.5/5",
      "review": "Slow burn towards dynamite scenes of revenge against a terrorist group that killed his wife. Rami Malik's brooding character is highly intelligent and even more driven than anyone could have expected."
    },
    {
      "rating": "3.5/5",
      "review": "Well done spy thriller. It simmers and never really bursts with action. However, in this instance, the question is pondered about who the reasonable party is in the world of espionage. Does providing the intelligence to execute the mission is as responsible as the person who delivers the final blow? Well worth a trip to the theater."
    },
    {
      "rating": "4/5",
      "review": "Entertaining. Worth your time."
    },
    {
      "rating": "5/5",
      "review": "Good movie. Enjoy it a lot catch it in theatres"
    },
    {
      "rating": "5/5",
      "review": "Just gotta watch it!! It’s full of action and suspense and I love the main character he’s a brilliant actor!!"
    },
    {
      "rating": "5/5",
      "review": "It was just a well thought out movie Great acting and seemed real"
    },
    {
      "rating": "5/5",
      "review": "It was fantastic and a must see movie"
    },
    {
      "rating": "4/5",
      "review": "The movie was a fun watch, probably better than most movies in the theater at the moment. It was slow in some parts, I felt like they could have used this time to do more character development or even make the story a bit more complex. They could have done more will the main character's skill set to make the plot more unique. There was a random CIA character in the beginning that showed up later and then disappeared, didn't have any actual role in the story.. kind of odd, a missed opportunity perhaps. Rami Malek and most of the actors deliver, but I can't say the same for the movie's writing."
    },
    {
      "rating": "2.5/5",
      "review": "Mosts of the best parts were in the trailer. So if you watched the trailer, you basically saw the best parts of the movie. I was strongly disappointed watching it."
    },
    {
      "rating": "5/5",
      "review": "Enjoyed every aspect of the movie. Great to see an \"action\" movie that was not just scene after scene of mindless violence. And grateful that they made it PG-13, instead of the typical gratuitous junk to get an R rating."
    },
    {
      "rating": "5/5",
      "review": "best movie so far this year. Classic MCU."
    },
    {
      "rating": "2.5/5",
      "review": "This is a poor man's Mission Impossible, fewer stunts with lesser characters, and just truly amateur, in everyway."
    },
    {
      "rating": "4/5",
      "review": "Good story, believable, well acted, suspenseful with unexpected plot twists. Will recommend if you like a high tech spy adventure."
    },
    {
      "rating": "5/5",
      "review": "Action. Story line."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining movie. Great story line and fantastic characters Excellent actors Really a good action movie A must SEE!!!!"
    },
    {
      "rating": "2.5/5",
      "review": "Not sure how it got an 88% rating. 75% is more like it."
    },
    {
      "rating": "4/5",
      "review": "Great film, I may of preferred it if the \"hero\" dies another end.."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie!! The lead is always going to kill it in every movie he's in. Laurence Fishburne was a surprise but did amazing!! The guy that always plays the bad cop disappointed me, I thought he would do more. Left a lot to be imagined there."
    },
    {
      "rating": "2/5",
      "review": "Great plot but boring as well."
    },
    {
      "rating": "4/5",
      "review": "While it falls short of telling a truly engaging story due to its overuse of stereotypes, The Amateur is still an entertaining spy film thanks to its action and Malek's emotional performance."
    },
    {
      "rating": "3/5",
      "review": "I thought the movie was slow developing the plot in the first half."
    },
    {
      "rating": "4/5",
      "review": "My only gripe was continuity. The backpack comes and goes. Fights are good, not that quick-cut crap."
    },
    {
      "rating": "4/5",
      "review": "Great story. Like any action movie, had great locales. Lighting and filmography were excellent. Believable characters and strong actors. Casting was perfect! Unexpected, refreshing \"tools of retribution\" punctuated the story well."
    },
    {
      "rating": "3.5/5",
      "review": "Good movie. A little long."
    },
    {
      "rating": "1.5/5",
      "review": "It's basically the plot of \"Taken\" with a few character swap outs. However, unlike, \"Taken\", this movie failed miserably. Long, drawn out plot and dare I say...boring? Barely any action scenes and even those were mid. I started playing solitaire on my phone an hour into the movie."
    },
    {
      "rating": "3.5/5",
      "review": "The storyline was good but the movie itself was dark throughout"
    },
    {
      "rating": "2.5/5",
      "review": "Has una critica profecional de Warfare analizando sus puntos bueno y malos sobre direccion, escritura, guion, dialogos, narración, historia o trama, tematica, personajes, actuaciones, cgi, fotografia, actos, coreografia, portada de la pelicula, casting, banda sonora despues de esto la conclucion y la clasificacion del 0 al 100"
    },
    {
      "rating": "4/5",
      "review": "It was an overall decent movie, the final act was kinda…bland. Was hoping more conflict, but the ending was satisfying as always! Definite watch!"
    },
    {
      "rating": "3/5",
      "review": "Even though the film is pretty slow, it has some really good moments that make it enough to recommend."
    },
    {
      "rating": "2.5/5",
      "review": "The Amateur es una película de espionaje con un enfoque distinto, que destaca por su protagonista atípico y atmósfera tensa, pero que se ve limitada por una narrativa predecible y desarrollo superficial de personajes."
    },
    {
      "rating": "3.5/5",
      "review": "Good plot line good acting. I enjoyed it"
    },
    {
      "rating": "3.5/5",
      "review": "Amateur wasn’t bad just they should have had added more kills in the movie. Watch him get payback with unique ways to kill then was fun but you only get a few."
    },
    {
      "rating": "2/5",
      "review": "Epic fail with a superstar cast trying to make another action film that will capture people's hearts with its dumb plot, which leaves the viewers confused as to what they just witnessed."
    },
    {
      "rating": "4/5",
      "review": "Great acting and story. It is not something revolutionary, we have seen things like this before but they were still able to make a great story out of it."
    },
    {
      "rating": "4/5",
      "review": "Solid twist on the revene action thriller genre. I wish the trailer hadn't given away most of the best scenes but that is the world we live in now."
    },
    {
      "rating": "5/5",
      "review": "It was a smart movie in that it was a thriller. I thought it was going to be a typical bang bang movie, but it wasn’t. It was well thought out - one step ahead of an expected move, then it did something unexpected. The acting was excellent from all the actors. Thoroughly enjoyed the movie."
    },
    {
      "rating": "5/5",
      "review": "Best movie Ive seen in years! Great acting, script, screenplay, special effects all of it! Outstanding!"
    },
    {
      "rating": "5/5",
      "review": "This was better then I expected, I really enjoyed"
    },
    {
      "rating": "4/5",
      "review": "The movie kept you guessing throughout. Great Actors and action. We felt the time flew by . The main character was brilliant and we wanted him to be successful. We loved the movie!!!!!!"
    },
    {
      "rating": "4/5",
      "review": "I loved the ending tricked me a bit. Me and my better half were thinking that Charlie would have finally pulled the trigger but the ending was good."
    },
    {
      "rating": "4/5",
      "review": "Very clever telling of the story. Excellent casting action. Great thriller."
    },
    {
      "rating": "5/5",
      "review": "The actors played their roles perfectly and the twist and turns kept you guessing what the next move would be."
    },
    {
      "rating": "3/5",
      "review": "another one that it's basic but either way entertainng"
    },
    {
      "rating": "5/5",
      "review": "Excellent movie in a time there are nothing good coming out of Hollywood rated less than R."
    },
    {
      "rating": "5/5",
      "review": "Good movie tells a fascinating story"
    },
    {
      "rating": "4/5",
      "review": "We enjoyed this movie very much... had it's slow moments ... but don't they all. Interesting resolution of the guys inability to actually shoot his targets. Great cast."
    },
    {
      "rating": "3/5",
      "review": "[SPOILER - Light] This film was a lot of fun up to the final act, where it seemed to take a turn from good, to just ok. The story does well enough to present the protagonist as a fish out of water, while simultaneously setting up his love for puzzles. Then it expects you to believe he masterminded his whole revenge plot on a whim, conveniently traveled the world, got allies killed without any extra remorse, and rides off into the sunset like Jet Li out of War. Come to think of it, the films have similar themes. They put the best kills in the trailer and open with the weakest, where he's still a fish out of water. The film was really back and forth about his capability."
    },
    {
      "rating": "5/5",
      "review": "Great story line and acting. Terrific."
    },
    {
      "rating": "5/5",
      "review": "Such a good thriller! Just when you think you have it figured out Or somethings going to happen, something else comes up! It was great especially for a date night."
    },
    {
      "rating": "3/5",
      "review": "It’s definitely a movie that seems long winded. I like the foundation of the movie and I see what the director was trying to do. Very average. Nothing great but nothing bad."
    },
    {
      "rating": "5/5",
      "review": "Great movie!! Action, suspense - acting well done!"
    },
    {
      "rating": "3/5",
      "review": "The Amateur isn’t a terrible movie, but it felt disjointed and lacked cohesion. The story follows a high-IQ computer nerd who decides to become an assassin after his wife is killed. Though he’s not a trained killer, he sets out on a revenge mission, taking out his targets using unconventional methods. He manages to eliminate three out of the four people responsible for her death. When he finally confronts the main culprit in the climax, rather than exacting personal justice, he turns the killer over to the government. It’s an odd choice that feels unearned and anticlimactic, leaving viewers wondering, Why? The movie lacks suspense, the plot doesn’t fully come together, and it ultimately falls short of its potential. It might have worked better as a straight-to-streaming release rather than a theatrical experience."
    },
    {
      "rating": "4/5",
      "review": "The ending was unexpected and better than I expected. It seems we've found our new Jason Bourne."
    },
    {
      "rating": "2.5/5",
      "review": "Watchable but predictable."
    },
    {
      "rating": "4/5",
      "review": "Good movie, solid story and positive ending"
    },
    {
      "rating": "2/5",
      "review": "movie was sub-par, wasn't witty enough to keep your attention or stupid enough to laugh at. idk if your gonna have a tech guy be smart, make him do smarter things against equally as smart people."
    },
    {
      "rating": "5/5",
      "review": "This movie was better than what I expected. It was elaborated in detailed to make every scene and scenarios fitting accordingly to the concept"
    },
    {
      "rating": "2.5/5",
      "review": "It had potential , but could have been much better ."
    },
    {
      "rating": "5/5",
      "review": "A surprisingly gripping movie, with great acting from Rami Malek and Laurence Fishbourne. The emotional motivation was compelling and the underlying spy motives were great! Definitely recommend!"
    },
    {
      "rating": "3.5/5",
      "review": "very action packed, good for fans of mystery, action, psychological thrillers, or government movies. overall good film quality, but slightly repetitive. overall pretty good movie, worth a watch."
    },
    {
      "rating": "3/5",
      "review": "Kinda like a poor man's accountant. Acting not as good. Humor mostly absent and action scenes are was subpar."
    },
    {
      "rating": "3/5",
      "review": "Engaging thriller. Well paced, plotted, and acted."
    },
    {
      "rating": "5/5",
      "review": "Great acting and very suspenseful. Its a movie you might have to watch twice to pick up the missing pieces from the first watch."
    },
    {
      "rating": "5/5",
      "review": "Good story and suspense"
    },
    {
      "rating": "1.5/5",
      "review": "ChatGPT: please write a screenplay for a pastiche of a Jason Bourne movie, but make the lead character completely implausible, the plot full of holes, and don't bother making the audience care about any of the characters."
    },
    {
      "rating": "4/5",
      "review": "It was a good, not great movie. A little slow at times. Decent story."
    },
    {
      "rating": "5/5",
      "review": "Amazing spy action thriller. Reminds me of the Bourne trilogy."
    },
    {
      "rating": "4/5",
      "review": "This is a great movie. Its a hybrid between Taken and The Beekeeper with a high technology overview. I loved it!"
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed the \"build up\" of events that led to the main character's struggle, strength, and shockingly \"unfolding\" into the character others assumed he could never be. The power of love, determination, and revenge is not to be understated in Amateur!"
    },
    {
      "rating": "4/5",
      "review": "Very good, could have been a little better but overall great for a pg13 movie all good for my wife even!!"
    },
    {
      "rating": "5/5",
      "review": "Smart! Good story line."
    },
    {
      "rating": "4/5",
      "review": "This was a fun movie, loved the actors, a good straight forward action thriller."
    },
    {
      "rating": "4/5",
      "review": "Slow at the start but picks up with clever plot twists throughout. Surprisingly enjoyed it from beginning to end despite the 2 hour runtime. A solid watch"
    },
    {
      "rating": "2.5/5",
      "review": "Ok movie. Good actors and decent story, just not that exciting or compelling."
    },
    {
      "rating": "2.5/5",
      "review": "Not Rami's best acting and I think the story could have been stronger. I wanted to like it, not be a troll, but I'm not sure how its ratings got as high as they did."
    },
    {
      "rating": "5/5",
      "review": "This movie was E P I C !! Very action based and unpredictable. My Boy (fav actor of mine) Rami Malek? Precisely the person fit for the character he played. If tou havent seen it yet Go See it Now"
    },
    {
      "rating": "5/5",
      "review": "This movie was very suspenseful, rooted for the underdog throughout and pleased with the ending."
    },
    {
      "rating": "4.5/5",
      "review": "Great suspenseful movie that was not entirely predictable with a nice surprise at the end."
    },
    {
      "rating": "3/5",
      "review": "Entertaining but a little flat."
    },
    {
      "rating": "1/5",
      "review": "Movie was boring long and too drawn out for me"
    },
    {
      "rating": "3/5",
      "review": "while the plot and protagonist’s motivation was intriguing, the overall direction of the movie was pretty predictable and uninspiring. Not a bad movie, by any stretch. However, not much replay value."
    },
    {
      "rating": "4/5",
      "review": "Smart! Didn't force the character to become something he's not. The movie flowed really well, good plot and great actors."
    },
    {
      "rating": "5/5",
      "review": "Great intrigue throughout."
    },
    {
      "rating": "5/5",
      "review": "giving diff twist on Jack Ryan on a budget. Worth the watch. Rami Maleck at it again"
    },
    {
      "rating": "4.5/5",
      "review": "A twist to your typical revenge story. Made me cry and made me laugh, and kept me on the edge of my seat."
    },
    {
      "rating": "4/5",
      "review": "Fun ride using brains over brawn."
    },
    {
      "rating": "5/5",
      "review": "Very suspenseful and entertaining. Well acted too."
    },
    {
      "rating": "5/5",
      "review": "Great movie. best in a long time"
    },
    {
      "rating": "5/5",
      "review": "Move over 007...Charlie is our new favorite non spy! It's nice to see a smart guy being the lead."
    },
    {
      "rating": "2.5/5",
      "review": "the photographer was too dark. It was too predicable. He is so great and was not used to the best of his ability. It was just disappointing"
    },
    {
      "rating": "5/5",
      "review": "Move was very authentic and the story line was great"
    },
    {
      "rating": "4.5/5",
      "review": "Excellent film. Great location shots. Well executed."
    },
    {
      "rating": "4/5",
      "review": "A good story line that haves you being sympathetic to the main character. I wanted the main conspirators to be more believable in their interactions with the main character. Moved along at a good pace and kept my interest throughout. The ending was not expected but fit well. I liked it."
    },
    {
      "rating": "4.5/5",
      "review": "Great plot, good character development, pace of the movie was perfect. Believable, poignant, and engaging. Excellent movie!"
    },
    {
      "rating": "4/5",
      "review": "Well acted, very interesting, some things did not make sense and some things were left for us to imagine, but overall it was a very good movie"
    },
    {
      "rating": "2/5",
      "review": "Boring and the scenes were very dark as in no brightness so it was hard to watch."
    },
    {
      "rating": "4/5",
      "review": "I really liked the movie. The action developed quickly and Rami Malek played his role well."
    },
    {
      "rating": "5/5",
      "review": "I love Remi Malik, and this type of character is really good for him to play. You’re emotionally involved because of the scenario and he does a very good job at making everything believable. The action was great."
    },
    {
      "rating": "5/5",
      "review": "I thoroughly enjoyed the movie. I was engaged by the story and did not think of this as a \"revenge movie\" or \"spy thriller\". I did not compare it to any other movie......I went to the movie and was moved by the story. Loved Rami Malek and felt the sorrow and madness of losing a loved one. His character was using his genius for a questionable CIA operation. In becoming a vigilante, he becomes a fuller person and may be fighting back against organized evil. There were no half pornographic love making scenes, even when he's in bed with women spy he meets. The good guy wins! What a movie! Go see it yourself!"
    },
    {
      "rating": "5/5",
      "review": "Interesting plot and suspenseful with unanticipated outcomes. Interesting character development."
    },
    {
      "rating": "4.5/5",
      "review": "Excellent movie and great plot. I lost my wife 3 years ago and it stir up the feeling of loss."
    },
    {
      "rating": "3/5",
      "review": "It was okay. I thought it'd be better ."
    },
    {
      "rating": "4.5/5",
      "review": "I’ve almost stopped going to the cinema. Every movie is either a cartoon movie (whether it’s animated or just another twist on a comic book or a game) or a horror flick. FINALLY, an action movie…with good actors and something for adults. Well done!"
    },
    {
      "rating": "4/5",
      "review": "Nice suspenseful action film with surprises around each corner."
    },
    {
      "rating": "4.5/5",
      "review": "It was an amazing action movie!"
    },
    {
      "rating": "1.5/5",
      "review": "So they fridge his wife (the unfortunate Rachel Brosnahan), then the mild-mannered analyst becomes a vendetta machine. We really like many of the actors, but this script was insulting. The world doesn't need another Liam Neeson revenge film, and Rami Malik does not need to try to be Liam Neeson. Even Liam Neeson doesn't need to make any more of those stupid revenge movies! There are some smart bits (thus the half-star), but what kind of entitled idiot thinks he's got the right to go out and kill people because a loved one dies? Or that he even has a chance to actually succeed?? I would not buy that Rami Malik could do any of this, or that anyone with a brain would want to try. Lastly, the idea that everyone in the CIA is ethically and morally good except for a few bad apples is possibly the most insulting bit of all. (We saw this at the drive-in, which automatically improves movies by at least 30%, so had we paid to see this in an indoor theater, I'd have been even angrier at it.)"
    },
    {
      "rating": "2/5",
      "review": "Very slow movie I expected the amateur to become something other than the amateur, but he seemed to stay the amateur the entire movie. I didnt fall asleep so thats a good sign at least all in all affair movie but I wouldve liked to have seen more action."
    },
    {
      "rating": "4/5",
      "review": "Solid movie with equally solid cast, & acting! Strong & creative, very entertaining story!"
    },
    {
      "rating": "5/5",
      "review": "It was nice to see a movie with action using digital apps etc. instead of guns and knives.."
    },
    {
      "rating": "4/5",
      "review": "Definitely worth a watch! I had never heard of it and I ended up at the theater on my birthday to watch a random movie! I knew Laurence Fishburne was in it, so I figured it had to be somewhat good. My family really didn't want to watch it. Well, afterwards, everyone had enjoyed the movie! Lots of action, great plot and story development, the main character was a phenomenal actor! I'll watch again when it comes out on video to see if I missed any of the clues during the movie!"
    },
    {
      "rating": "4/5",
      "review": "I'm glad I saw this movie. It was entertaining in a strange sort of way. Thought that the main character was miscast in the role. I couldn't seem to get Freddie Mercury out of my mind."
    },
    {
      "rating": "3/5",
      "review": "Nothing earth-shattering."
    },
    {
      "rating": "4/5",
      "review": "The movie did not live up to the trailers. Rami Malik did an excellent job as his character grew. The end scene gives way to the possibility of a sequel."
    },
    {
      "rating": "3.5/5",
      "review": "An interesting movie, that could be easily watched on a weekend without having to think to much. A few minor holes in the plot made the history almost too convinient, in order to reach a predictable conclusion."
    },
    {
      "rating": "1.5/5",
      "review": "Actors did their jobs well to be engaging. Overall show was boring and anticlimactic."
    },
    {
      "rating": "4/5",
      "review": "Well thought out, strong performance; recommend"
    },
    {
      "rating": "4/5",
      "review": "Great movie with a nice twist at the end, but while the premise is original and Rami Malek is excellent, it's pretty much what you expect from these movies. Definitely worth a watch, and enjoyable, but don't expect anything out of the ordinary. Bourne Intellect."
    },
    {
      "rating": "4/5",
      "review": "I enjoyed it. It was fun to see a less conventional revenge story with a character that wasn't just an absolute butt kicker. I thought Rami was excellent."
    },
    {
      "rating": "5/5",
      "review": "I have not seen the movie just rating the trailer will see the movie and review the movie after I have seen it"
    },
    {
      "rating": "4/5",
      "review": "8/10 Good twist in end"
    },
    {
      "rating": "4.5/5",
      "review": "The film as a whole was entertaining and intense. The characters were fun and their personalities were interesting. The story I found to be simple yet great and the film was really good as whole."
    },
    {
      "rating": "3/5",
      "review": "decent movie, but felt like I saw it during the preview trailers leave something to be learned"
    },
    {
      "rating": "3.5/5",
      "review": "A little bit too far-fetched."
    },
    {
      "rating": "5/5",
      "review": "I LOVED IT!!! It's a must watch."
    },
    {
      "rating": "4.5/5",
      "review": "Good flick but if you have to pick, go see The Accountant 2. Just sayin’."
    },
    {
      "rating": "4.5/5",
      "review": "Great flickmain character is very interesting and the action is a fun ride."
    },
    {
      "rating": "4/5",
      "review": "I enjoyed it very much. I had some slow parts, but I believe it was to build the characters."
    },
    {
      "rating": "5/5",
      "review": "How refreshing to see a movie without excessive violence, profanity or sex. I am no prude but sometimes its nice to see the story unfold without distractions."
    },
    {
      "rating": "5/5",
      "review": "Love coming to the afternoon showing of new movies coming out, good hot popcorn, and my soda, what could be better"
    },
    {
      "rating": "5/5",
      "review": "The best movie Ive seen in a while! The underdog surprises everyone, which makes it an adventure and a feel good movie all in one. Very enjoyable!"
    },
    {
      "rating": "5/5",
      "review": "Good movie. Not your normal spy thriller. Plenty of action."
    },
    {
      "rating": "5/5",
      "review": "Unique and refreshing action movie. Rami Malek plays a perfect role. Don't sleep on this!"
    },
    {
      "rating": "1/5",
      "review": "spoilers ahead. Summary: it's bad. Full review: Unfortunately one of the worst films I've seen in a long time. The first 5 minutes showcase stiff and unemotional acting from Rachel Brosnahan and Rami Malek. Thankfully we don't see them on the screen together after this, but they packed enough clichés and cheesy dialogue to make up for it. Each line felt like it was just being remembered not acted. The rest of the movie feels similar. We are introduced to a cast of characters, foes, villains and allies who end up being pretty much inconsequential throughout the whole movie. Even the characters who seem like they would be very important seem to only suggest their importance and then maybe appear once more in the movie for almost no reason - John Bernthal's characters being the biggest sinner here. The movie hints he's a pretty friendly but badass agent who Rami Malek is perhaps envious of, or wants to be pals with. He turns up later not for a cool action scene, not too bring Malek on and be defeated in some cool way, not to join Malek and lend him his very cool agent skills - but just to tell the guy to give it up, and the conversation simply ends because Malek says 'nah', so Bernthal let's him walk away. That's it. It's a tiny scene in the middle of the movie, and we never see that character again. Laurence Fishburn also has an extremely disappointing lack of screen time; his story line is seriously confusing and lacks development - he is introduced to train our character, after which he follows our character as if he's trying to turn him in, he suddenly saves our character by what seems like betraying the CIA, he turns up at the end to say 'well done protagonist, you proved me wrong and you really are the coolest guy'. We have no understanding why or when he decided to help Rami Malek considering Malek was getting away from him the whole beginning of the film. The actual villains that Malek is trying to find are all of course foreign, and also not a threat at all. The most stakes there was at any point is with the woman he went after first because she scratched his face up a bit before being hit by s car, conveniently. The rest of his revenge killings just kind of happen, there is no trouble travelling, no trouble finding the baddies, no fighting and barely any negotiating. The final villain which is corruption at the CIA also just is fixed at the end, and despite us knowing thet betrayed and killed allies abroad secretly, we are reassured that patriotism and the American dream will prevail after all."
    },
    {
      "rating": "3/5",
      "review": "Rami Malek delivers in his important role, but the plot dampens and loses it’s interest towards the end."
    },
    {
      "rating": "3/5",
      "review": "decent action, good cast, a bit of sloppy story holds it back"
    },
    {
      "rating": "4.5/5",
      "review": "Intriguing movie. Some plot holes. Good start to finish."
    },
    {
      "rating": "5/5",
      "review": "Great movie Rami malek was awsome"
    },
    {
      "rating": "4.5/5",
      "review": "Great action and storyline. Surprises on his ingenuity of taking down the bad guys, showing muscle is not always needed!"
    },
    {
      "rating": "5/5",
      "review": "It was a really well filmed movie. Very cinematic at certain points and the actors they used were very talented"
    },
    {
      "rating": "4/5",
      "review": "Rami Malek is superb, but in places the plot feels slightly implausible."
    },
    {
      "rating": "3.5/5",
      "review": "The Amateur is a slick, globe-trotting revenge thriller that offers a fresh spin on the espionage genre, powered by strong performances by Remi Malek and Laurence Fishburne, as well as its inventive special effects, but the film is hampered by a predictable plot with implausible leaps in logic."
    },
    {
      "rating": "5/5",
      "review": "This movie was a different take on your normal action thriller the lead character put his MacGyver sense into it, and his next move was surprising every time."
    },
    {
      "rating": "5/5",
      "review": "A thriller from start to finish and Rami Malek was phenomenal in his role once again."
    },
    {
      "rating": "5/5",
      "review": "Brilliant! Unique plot. Must see on the big screen!"
    },
    {
      "rating": "3.5/5",
      "review": "Surprising a solid movie to watch. It gives an artistic perspective on how corrupt the CIA is. The plot was a lil slow here and there so that keeps me from rating it higher."
    },
    {
      "rating": "5/5",
      "review": "Enthralling story of a supposedly weak individual overcoming incredible odds to avenge his wifes death."
    },
    {
      "rating": "5/5",
      "review": "Solid flick. Good watch!"
    },
    {
      "rating": "5/5",
      "review": "Once again, a film proves that you should never read the critics' reviews, only the audience consensus. When I read that this movie is about the CIA, I figured it would be dull and over my head. But Rami Malek was a joy to watch in his role, is there anything he can't do? Action packed and so interesting."
    },
    {
      "rating": "5/5",
      "review": "Kept you waiting with anticipation. Good movie. Could see it again, I can't say that about too many movies!"
    },
    {
      "rating": "4/5",
      "review": "Loved the fast pace & intrigue"
    },
    {
      "rating": "5/5",
      "review": "I look forward to seeing it again!!! So exciting!!"
    },
    {
      "rating": "5/5",
      "review": "Great movie! Acting was great! Lots of twists and turns!"
    },
    {
      "rating": "4/5",
      "review": "Movie has some nice surprises. Decent action. Don't really care for Rami Malek ... should have casted someone else."
    },
    {
      "rating": "4/5",
      "review": "Great movie. Well acted and well written. Pacing and story are spot on. I really enjoyed this movie."
    },
    {
      "rating": "1/5",
      "review": "I watched the film solely because of Caitriona Balfe, whom I consider an extraordinarily talented actress. She demonstrated that in Outlander and reaffirmed it in Belfast. In this film, however, she was practically invisible. It highlighted just how important it is not only to choose the right roles, but also the right co-stars. Rami Malek is an actor who gives nothing to anyone. As a result, the film ends up being completely unwatchable. Still, a bad script, poor direction, and terrible casting didn’t faze Laurence Fishburne, who delivered a professional performance despite the uninspiring material."
    },
    {
      "rating": "5/5",
      "review": "I absolutely loved this movie, it kept me guessing and the story line though sad and heart breaking was very well written ❤️👍🏽"
    },
    {
      "rating": "2.5/5",
      "review": "This was surprisingly dull. No attempt to emotionally connect the viewer with Malik’s mission; boring villains, if they were even developed at all; and the too-few action scenes are in the trailer. I love the concept and that they tried to make an original film, just wish it was better."
    },
    {
      "rating": "5/5",
      "review": "Such a well done movie. Kept me on the edge of my seat the whole time."
    },
    {
      "rating": "3.5/5",
      "review": "I don't know what to say, except that I liked it more than I thought I would after reading some negative reviews. It started off slow, but it picked up considerably in the second half of the movie and didn't go as I expected. I guess my favorite thing is that it wasn't super violent and didn't have a ton of cursing, something which isn't common for this kind of movie it was one of the better films I've seen so far this year."
    },
    {
      "rating": "3.5/5",
      "review": "The film is very beautiful and very realistic, far from everything that scratches life, without any external appearances, in addition to the fact that it talks about revenge only, without harming other people. What is also beautiful in the film are the techniques that are shown at the beginning."
    },
    {
      "rating": "3.5/5",
      "review": "Really liked this. Malek is very good. The script is well done and the movie does not drag. I liked this from start to finish and would love to see more of these or more films like this. Well done."
    },
    {
      "rating": "4/5",
      "review": "Rami Malek's ability to act in a diverse range of roles highlights his remarkable versatility as an actor, allowing him to convincingly portray everything from the legendary Freddie Mercury in Bohemian Rhapsody to a socially awkward hacker in this film. His talent for immersing himself into complex, emotionally layered characters has earned him critical acclaim and set him apart as one of the most dynamic actors of his generation."
    },
    {
      "rating": "5/5",
      "review": "Acting was excellent, and the action was non-stop. So glad we gave it a shot! Good one!!"
    },
    {
      "rating": "5/5",
      "review": "Action and suspense!"
    },
    {
      "rating": "3.5/5",
      "review": "Not a bad movie but a movie I should have waited to stream on Netflix. Storyline is good but just takes forever to get there."
    },
    {
      "rating": "5/5",
      "review": "This was a great movie! Good amount of action and thrills without all the unnecessary profanity and gore. This was a definite win in our book."
    },
    {
      "rating": "4/5",
      "review": "Very enjoyable to watch and intriguing the way things happen"
    },
    {
      "rating": "5/5",
      "review": "I loved how Charlie outsmarted his own agency!"
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good but slow at times"
    },
    {
      "rating": "5/5",
      "review": "Excellent movie! Really kept you guessing! Really enjoyed this!"
    },
    {
      "rating": "3.5/5",
      "review": "Entertaining, great creativity in the writing. It wasn't a complete disappointment, but I could have waited to watch it on Netflix."
    },
    {
      "rating": "5/5",
      "review": "Very entertaining. If you like Jason Bourne movies, this is right up your alley!"
    },
    {
      "rating": "5/5",
      "review": "A supet ride with great heart. Excellent cast. Highly recommend!"
    },
    {
      "rating": "4.5/5",
      "review": "Malek is just great in this movie. We definitely enjoyed all the action and interplay between characters."
    },
    {
      "rating": "5/5",
      "review": "Rami Malek is superb as always!"
    },
    {
      "rating": "5/5",
      "review": "Exciting, unpredictable, smart, edge of your seat, thriller. Rami Malek is fantastic!"
    },
    {
      "rating": "2/5",
      "review": "The only good characters in this movie were the International cities which gave it a Bourne Vibe. Other than that, this \"hero\" is completely unbelievable and out of his element."
    },
    {
      "rating": "4/5",
      "review": "Really good movie!! I was entertained the entire time and had quite a few “did not see that coming moments.” Rami Malik did a great job. I really enjoyed the premise of the movie without all the blood and gore."
    },
    {
      "rating": "4.5/5",
      "review": "Good well-balanced film with a great lead actor."
    },
    {
      "rating": "3/5",
      "review": "Interesting take on spy movie. I liked it and loved the supporting cast. Only watched it bc im an unlimited regal member. It's a take it or leave for me."
    },
    {
      "rating": "5/5",
      "review": "This was a great action packed movie. Reminded me of the type of spy movies that Harrison Ford used to make. I give it a 10 out of 10 stars. I loved it."
    },
    {
      "rating": "5/5",
      "review": "AWESOME!!!!!!! From start to finish!:)"
    },
    {
      "rating": "5/5",
      "review": "The brilliance behind the kills, i loved it. ALSO This is one of the few movies where someone uses their brain more than their fist yet still kept me engaged as an action movie."
    },
    {
      "rating": "4/5",
      "review": "Good story if a little far fetched, but that's why it's a movie for entertainment, right? Liked some of the turns and clever get backs he did on the bad guys. Worth a watch. Rami is a great actor"
    },
    {
      "rating": "0.5/5",
      "review": "This movie was dogshit. The protagonist spends 90 minutes on his computer reviewing evidence of his wife's killers. Literally watching paint dry is more entertaining than this. My cousin and I walked out on this movie it was so boring couldn't even finish it."
    },
    {
      "rating": "2/5",
      "review": "very slow and the plot was not smooth. I was lost most of the movie."
    },
    {
      "rating": "5/5",
      "review": "So good! Had me on the edge of my seat!"
    },
    {
      "rating": "4/5",
      "review": "It was a great movie! Thought the acting was good, good storyline, kept you interested."
    },
    {
      "rating": "4/5",
      "review": "Entertaining but lacked emotional connection with main actor. Cliche story and sappy back love story were weak and didnt add to the originality of this film."
    },
    {
      "rating": "5/5",
      "review": "enjoyable and labyrinthan the best i've seen rami in so far"
    },
    {
      "rating": "3/5",
      "review": "My wife and I like the concept and the main actor played his role very well. However, terrible ending and poor execution on the overall plot. Ultimately our desires were left unmet and longing for something more! Entertaining to see once. Although, not a repeat till it comes to Netflix."
    },
    {
      "rating": "3.5/5",
      "review": "Meh, warfare was better"
    },
    {
      "rating": "5/5",
      "review": "Very intelligent, fast moving movie. No unnecessary use of sex, foul language, blood or violence. The movie keeps the thinking movie goer on their toes. Well directed and acted."
    },
    {
      "rating": "5/5",
      "review": "Fast paced and twisty. A fun watch!"
    },
    {
      "rating": "4/5",
      "review": "The movie kept you in your seat the whole time"
    },
    {
      "rating": "3.5/5",
      "review": "Good involvement between the brothers. Wished for more of the Accountant character to mathematically figure how to line dance and work out how to confront the kidnappers. A good follow up from the first Accountant movie."
    },
    {
      "rating": "5/5",
      "review": "Enjoyed it all. Love Rami and the plot. Very well played."
    },
    {
      "rating": "5/5",
      "review": "Loved it! Finally, a character really looking/acting like an amateur, but with enough smarts and plain luck to accomplish what they set out to do. Loved the story, loved the casting. Definitely a must see."
    },
    {
      "rating": "3/5",
      "review": "Good plot but the ending was anticlimactic. A little unbelievable as well."
    },
    {
      "rating": "5/5",
      "review": "Great movie, enjoyed on a Sunday afternoon."
    },
    {
      "rating": "5/5",
      "review": "Great storyline! Cleaver!"
    },
    {
      "rating": "4/5",
      "review": "It was a good movie. Dragged a little but great action and suspense"
    },
    {
      "rating": "5/5",
      "review": "great plot and great actors. very impressive movie."
    },
    {
      "rating": "5/5",
      "review": "Loved the acting! Spectacular story line. Great ending."
    },
    {
      "rating": "5/5",
      "review": "This movie was well written and the action scenes were great!"
    },
    {
      "rating": "4/5",
      "review": "Definitely worth a watch if youre into action flicks with great actors, no silly writing, mostly plausible fight scenes and action. Remi Malek is awesome as usual. Nice Laurence Fishburn role. Quite a few faces youll recognize from good movies and TV series. Good plot line as well. A number of unexpected twists. Recommended!"
    },
    {
      "rating": "5/5",
      "review": "The Movie was outstanding for us seniors (76) to watch. Charlie played by Rami did an outstanding job of playing the CIA computer/data nerd. The deaths of the first 3 accomplices involved in his wife's death were different, unexpected and keep you engaged. The ending was enjoyable because the villain gets unexpected justice and Charle comes away with the satisfaction that his wife's death was vindicated, and he was brought back into the CIA with his superiors getting what they deserved as well."
    },
    {
      "rating": "4/5",
      "review": "Some parts are little boring but over all it was a good movie."
    },
    {
      "rating": "3/5",
      "review": "Very slow start, got better after second half"
    },
    {
      "rating": "5/5",
      "review": "Super good movie 😚💚✨🐸"
    },
    {
      "rating": "5/5",
      "review": "Great cinema very ntriguing opened my mind more about our dark government"
    },
    {
      "rating": "5/5",
      "review": "Smart story, root for the underdog!"
    },
    {
      "rating": "4/5",
      "review": "It was a decent thriller that was a fun ride... lots of suspension of disbelief but no more than most modern \"spy\" type thrillers... Malek and Fishburne should be the next new \"team\" I like their dynamic. I was a little disappointed with the use of John Bernthal's character, which they seemed to be hinting at him having a larger role later but (spoiler) that does not really happen. The final sequence is also a little less than satisfying and again unbelievable (Malek's character is never shut out of the CIA infrastructure so he can do a lot of unbelievable things but given the plot, he would have been immediately locked out)."
    },
    {
      "rating": "5/5",
      "review": "Clever thriller and Remy Malik is awesome as usual!"
    },
    {
      "rating": "5/5",
      "review": "The movie was fantastic!"
    },
    {
      "rating": "5/5",
      "review": "Loved how clever and driven he main character is. Full of action and surprises."
    },
    {
      "rating": "5/5",
      "review": "It was a great movie"
    },
    {
      "rating": "4/5",
      "review": "I liked that the action. The beginning was kind of slow"
    },
    {
      "rating": "5/5",
      "review": "What an awesome movie!"
    },
    {
      "rating": "5/5",
      "review": "The Amateur is an absolute gem! gripping storyline, intense performances, and masterful direction, it keeps you on the edge of your seat from start to finish. The protagonist’s journey is both compelling and unpredictable, blending suspense, emotion, and action. A brilliant film that delivers on every level—highly recommend!"
    },
    {
      "rating": "4/5",
      "review": "Started off slow but was really good"
    },
    {
      "rating": "5/5",
      "review": "I was at first reluctant to go watch it because it seemed like it would be like so many other movies with the same theme. However, it was intriguing enough to keep me interested throughout the entire movie. The twist towards the end were very interesting. Definitely worth a consideration."
    },
    {
      "rating": "5/5",
      "review": "La pelicula tiene una buena trama, es entretenida, la actuacion de Malek Fishburne es muy buena. Me gusto la pelicula."
    },
    {
      "rating": "5/5",
      "review": "Intriguing from the start. finally a movie that isn't predictable and not juvenile. no ridiculous or pathetic characters. if you are looking for a movie that respects you for being an intelligent adult... this won't disappoint."
    },
    {
      "rating": "1/5",
      "review": "Very slow and unbelievable plot line."
    },
    {
      "rating": "4/5",
      "review": "I liked what he was capable of doing. I think it was too drawn out."
    },
    {
      "rating": "5/5",
      "review": "I liked this show, full of intrigue and suspense. Twists around every corner. Loved Rami in this show"
    },
    {
      "rating": "5/5",
      "review": "I really liked this movie and I think Rami Malek knocked it out of the park. A Jason Bourne-type movie. Malek is quiet and nerdy, and then morphs into a man who gets it done with both brains and brawn. Such an interesting guy. He killed in Bohemian Rhapsody and now this. Color me impressed."
    },
    {
      "rating": "5/5",
      "review": "A must see. Slick and well made"
    },
    {
      "rating": "5/5",
      "review": "The movie was great and liked it more than I expected to, my only complaint is there are some parts of the movie that felt disconnected. Over all it’s a good movie"
    },
    {
      "rating": "3.5/5",
      "review": "Pretty good but it could have been so much better. Poorly produced I think."
    },
    {
      "rating": "4.5/5",
      "review": "I thought the Amateur was very well done! I dont know how believable the story is but then Im not a technical person. I recommend it for an entertaining afternoon."
    },
    {
      "rating": "5/5",
      "review": "Excellent! Suspenseful, engaging, and well acted!"
    },
    {
      "rating": "5/5",
      "review": "So good! Especially the lead actor and Inquilene."
    },
    {
      "rating": "4/5",
      "review": "Great movie. I wish they spent a little more time on his relationship with his wife so you could really feel how special it was but still a great movie and Id recommend it."
    },
    {
      "rating": "5/5",
      "review": "Awesome movie, great storyline."
    },
    {
      "rating": "5/5",
      "review": "Excellent script and actors."
    },
    {
      "rating": "4/5",
      "review": "Lots of surprises in this movie. Well done.."
    },
    {
      "rating": "5/5",
      "review": "Loved it!! Very Exciting."
    },
    {
      "rating": "5/5",
      "review": "Excellent and so refreshing. Waaaaay Better than I thought. Instant classic"
    },
    {
      "rating": "5/5",
      "review": "In few words: The revenge thriller around a \"nerd\", is fantastic in this film."
    },
    {
      "rating": "5/5",
      "review": "Very good. Not as action packed as expected but very enjoyable"
    },
    {
      "rating": "5/5",
      "review": "Excellent! Kept you intrigued all the way through!"
    },
    {
      "rating": "5/5",
      "review": "We loved the movie !!! Great action !!!"
    },
    {
      "rating": "3/5",
      "review": "Quite a few loose ends as though pieces of film were left in the cutting room floor."
    },
    {
      "rating": "4/5",
      "review": "Movie was suspenseful but did drag in some areas."
    },
    {
      "rating": "5/5",
      "review": "Excellent storyline. Rami Malik was excellent!"
    },
    {
      "rating": "5/5",
      "review": "Good film! Enjoyed it"
    },
    {
      "rating": "4/5",
      "review": "The beginning was a little tough to get through. Overall, it was a pretty good movie."
    },
    {
      "rating": "4/5",
      "review": "Loved the main character's (Charlie) underdog aspect. No one expects the man behind the computer to ultimately have a lot of power in knowledge. Using his intelligence, he got was he set out for."
    },
    {
      "rating": "5/5",
      "review": "The Amateur was a well-acted suspenseful movie with plot twists along the way."
    },
    {
      "rating": "5/5",
      "review": "A very interesting re-think of the action-adventure thriller. Rami Malek is a completely sympathetic character in a bad situation who manages to get the best of those who completely underestimate him. There are twists and turns you don't expect, and it has a better and more uplifting ending than would have been expected. Prepare to be pleasantly surprised by this one."
    },
    {
      "rating": "5/5",
      "review": "Amazing! Rami Malek was so good in this character. it was made for him to play!! I love spy films and this was fantastic!"
    },
    {
      "rating": "3/5",
      "review": "Very slow moving in alot of the plot"
    },
    {
      "rating": "3/5",
      "review": "liked opening liked locales disliked explosions over and over"
    },
    {
      "rating": "5/5",
      "review": "The pace of the film was excellent. It was very suspenseful--but I need to see it again because I know I missed some things."
    },
    {
      "rating": "3.5/5",
      "review": "Not finishing the story of the hitman , jumped around a little . The rest of the parts of Rami hunting down the perps was good"
    },
    {
      "rating": "5/5",
      "review": "Great action, great plot, great characters!!"
    },
    {
      "rating": "3/5",
      "review": "Not bad but it could be better"
    },
    {
      "rating": "5/5",
      "review": "Wasnt just a revenge plot but so many twists and turns. So much emotions. He played the role exceptionally."
    },
    {
      "rating": "5/5",
      "review": "Intriguing and action"
    },
    {
      "rating": "4/5",
      "review": "We enjoyed the movie. Good action and suspense."
    },
    {
      "rating": "4.5/5",
      "review": "Everyone in the CIA must go through basic training but no training even lawyence fishburn's (where's the spell check) training will prepare you for this movie. What a great ride across the Northern hemisphere featuring the amateur's revenge and dealing with remorse the best way he can."
    },
    {
      "rating": "5/5",
      "review": "We enjoyed this movie."
    },
    {
      "rating": "4/5",
      "review": "Great acting, captivating story."
    },
    {
      "rating": "5/5",
      "review": "Loved the movie. Awesome story and Rami Malek is amazing."
    },
    {
      "rating": "1.5/5",
      "review": "A slow boat to nowhere. No character development you don’t care about these characters. You could care less. What happens to anybody by the time. The whole thing is done. What a waste of time."
    },
    {
      "rating": "3/5",
      "review": "Thought it was a great movie right up until the end, where there were unrealistic situations occur. I just think there could have been a better ending, or they didn't know how to end the movie."
    },
    {
      "rating": "5/5",
      "review": "Intense. Smart. Loved it."
    },
    {
      "rating": "5/5",
      "review": "Thought the movie was great..ending was the best revenge ever.."
    },
    {
      "rating": "4.5/5",
      "review": "Different movie, glad to see something new from Hollywood"
    },
    {
      "rating": "4.5/5",
      "review": "We loved the movie it has a lot of action and suspense."
    },
    {
      "rating": "5/5",
      "review": "The movie was intriguing and fast pace. We enjoyed it. I recommend"
    },
    {
      "rating": "2/5",
      "review": "Great kills but not enough action"
    },
    {
      "rating": "5/5",
      "review": "Great movie! Charlie is very clever in all his high tech wizardry. Kept you interested the entire time and it was good to see the underdog prevail."
    },
    {
      "rating": "4/5",
      "review": "Rami Malek does a great job portraying Charles Heller, the awkward CIA Cryptography turned Unconventional Assassin out for revenge. If I had to describe The Amateur, it’s like if you were to model a character after Edward Snowden, bless him with the genius of Gerard Butler’s character from Law Abiding Citizen then adapt the story from American Assassin. Overall a really good movie."
    },
    {
      "rating": "3/5",
      "review": "Acting was good but plot was a little thin. Ok for an action style."
    },
    {
      "rating": "5/5",
      "review": "Excellent storyline, fine portrayal of an amateur with extraordinary intellect."
    },
    {
      "rating": "4.5/5",
      "review": "Very different and well-acted."
    },
    {
      "rating": "5/5",
      "review": "Great movie! Loved it. Rami Malek was outstanding."
    },
    {
      "rating": "1/5",
      "review": "So unbelievably boring"
    },
    {
      "rating": "4/5",
      "review": "Rami is the perfect person for a role like this. Just unassuming enough to be dangerous."
    },
    {
      "rating": "4.5/5",
      "review": "This was a really fantastic action, flick with a MacGyver like twist to it in technical ways. It reminded me a bit of the Jason Bourne films, but was perhaps written a little bit better. I remember that in the Jason Bourne films, you never knew exactly what was going on or why he was doing what he was doing. This plot line here was more straightforward. I actually hope that there will be a sequel to this."
    },
    {
      "rating": "5/5",
      "review": "Great surprise of a movie. Highly recommended."
    },
    {
      "rating": "2.5/5",
      "review": "There was not a lot action, not so believable but it was a good movie. I would have waited to watch at home streaming service."
    },
    {
      "rating": "4.5/5",
      "review": "Everything you could want in a high stakes thriller - revenge, CIA cover up, coding genius turned bad ass. Went into this viewing without watching the trailer and was thoroughly entertained throughout. Recommend for anyone who likes action thrillers!"
    },
    {
      "rating": "4/5",
      "review": "It was exciting but hard to follow and parts were unbelievable."
    },
    {
      "rating": "3.5/5",
      "review": "Though I am really no fan of Malik, the script is surely excellent. There are many vengeance movies, but normally always with an ex-marine or so who goes after the criminals. But here it's a computer geek who wants revenge. It's quite tense and exciting throughout most of the flick. And the end is absolutely unpredictable. 👍 7/10."
    },
    {
      "rating": "5/5",
      "review": "The cast was the perfect ensemble for this well written script! At first you thought it was going to be the typical love lost vengeance movie but it has its twists and turns and keeps you interested. Rami Malek was the perfect actor for this lead character."
    },
    {
      "rating": "5/5",
      "review": "Very good psychological movie"
    },
    {
      "rating": "5/5",
      "review": "Great action and suspense"
    },
    {
      "rating": "4.5/5",
      "review": "Well acted and lots of action."
    },
    {
      "rating": "5/5",
      "review": "Excellent movie!!! Great actors!!!"
    },
    {
      "rating": "5/5",
      "review": "Great movie and kept me interested more as it progressed. Very suspenseful"
    },
    {
      "rating": "4/5",
      "review": "I find it to be good content, it allows me to have a very peaceful day."
    },
    {
      "rating": "5/5",
      "review": "Great action packed movie. Go see it."
    },
    {
      "rating": "5/5",
      "review": "Good movir! Suspense and action!"
    },
    {
      "rating": "4/5",
      "review": "Great cast and movie was good, the trailer had me thinking something like taken, nobody, John wick. It kind of was just a bit more story than action"
    },
    {
      "rating": "3/5",
      "review": "Was ‘aight’. Basic enough revenge premise, some cool locations in Europe. Suspension of disbelief required. Worth watching on a weeknight solo trip to the theatre or on a plane."
    },
    {
      "rating": "3/5",
      "review": "Great idea, kept expect the wife to walk back as a double agent as the twist. Love the idea of the nerd becoming the assassin, but I thought Remi was 2D at times. The pace seemed slow at times as well. Had this been a little faster, agile this could have been a kick off to a spy thriller franchise but I’m not sure there is enough gas in the tank to make Remi the American Bond."
    },
    {
      "rating": "1.5/5",
      "review": "Advertised as an action movie but is a generic boring thriller."
    },
    {
      "rating": "3.5/5",
      "review": "A little slow in the beginning of the movie. Once into the plot, it picked up. A little more action needed."
    },
    {
      "rating": "4.5/5",
      "review": "Pretty good movie and a nice change from what was expected"
    },
    {
      "rating": "5/5",
      "review": "The suspense was great! Such a good movie!"
    },
    {
      "rating": "5/5",
      "review": "Awesome movie Lead actors solid"
    },
    {
      "rating": "3/5",
      "review": "Nice scenery and sets, but we didn't care if the lead lived or died. The ending was disappointing, and movie was slow at times. Many unexplained plot holes, but some scenes were exciting."
    },
    {
      "rating": "5/5",
      "review": "This movie was absolutely fantastic! The plot was brilliant, the love he had with his wife was Charlies motivation to step out of his comfort zone, to seek justice for the death of his wife. The lengths he went to using his skills as a strategic analyst was astounding. I highly recommend seeing this movie!"
    },
    {
      "rating": "5/5",
      "review": "Very clever and entertaining"
    },
    {
      "rating": "4.5/5",
      "review": "Mr Robot is back and kicking ass. I was hoping for more of a twist and happier ending... it was a little anticlimactic. Malak was brilliant as always"
    },
    {
      "rating": "5/5",
      "review": "A realistic spy movie with thoughtful and well drawn characters"
    },
    {
      "rating": "3/5",
      "review": "I'll be honest. I just don't get this guy. He's just sort of one-dimensional. Well, at least he was in this movie. I know he played Freddie Mercury and apparently was good (I didn't see it) but I just never got into his character in this movie. I understand what the movie was about and appreciate it. But it was just a bit slow for me and I would've liked to have seen someone else in the role."
    },
    {
      "rating": "2/5",
      "review": "So slow very little action kept waiting for it to get better. This movie could have been a lot shorter. Good story line."
    },
    {
      "rating": "3/5",
      "review": "While not awful, the preview gives the expectation of an action packed movie. However, both of the impressive kills in the movie are in the trailer. The pacing is slow and the protagonist is not very likeable. The \"brilliant\" amateur's cunning consists mainly of pipe bombs and the end is quite anticlimactic. Did not meet expectations."
    },
    {
      "rating": "5/5",
      "review": "Best movie I have seen in awhile. Even with its 2 hour run time, I was not bored at any point. I like how Charlie used more intelect than brute force and fighting to defeat the mercenaries. Refreshingly different. I look forward to a sequel."
    },
    {
      "rating": "4/5",
      "review": "Constant action and story line was good with great actors but not the greatest lead acting performance"
    },
    {
      "rating": "4/5",
      "review": "Many stars in this one however the leading actor was ho hum bit loved the constant action and story line!"
    },
    {
      "rating": "3.5/5",
      "review": "I did watch this too. It was an awesome film as well. Espionage thriller w/ action. It was interesting how he killed his wife murders one by one. Not bad."
    },
    {
      "rating": "4/5",
      "review": "Action and intrigue with foreign locations. Great acting. Loved it."
    },
    {
      "rating": "4/5",
      "review": "A bit far fetch but good story"
    },
    {
      "rating": "3.5/5",
      "review": "The movie had some exciting scenes as well as some scenes that left me wanting more to happen. 3.5 stars"
    },
    {
      "rating": "2/5",
      "review": "Too many mcguffins and an odd moral compass create a strange film that might have been really good but is instead just ok...ish. I get that he wants to avenge his wife but a couple of days training to be an assassin, seriously? All feels a bit rushed and underdeveloped"
    },
    {
      "rating": "5/5",
      "review": "This such a great film!!! Just mixed really loud! I would definitely see it again"
    },
    {
      "rating": "5/5",
      "review": "Awesome film, great story of a nerdy CIA agent going into the field to make things right. Good action that keeps you guessing."
    },
    {
      "rating": "5/5",
      "review": "Even better than hoped! Interesting and creative . never a dull moment!"
    },
    {
      "rating": "4.5/5",
      "review": "Fantastic movie, one of the best movies of its kind. Very satisfying ending too."
    },
    {
      "rating": "2.5/5",
      "review": "Not bad, just generic.  And not really believable emotionally.  This might as well be a Mr. Robot movie"
    },
    {
      "rating": "1.5/5",
      "review": "I fell asleep twice, too much of it was 'so convenient' in that things just happened to fall into place as it wouldn't in real life. A case in point, the CIA thought he was popping up all over the world (as he had played with their software), he was travelling across the globe, but of course using his passport and that's how people are tracked - not by CCTV on every street with face recognition. Reality suspended too much to be fair - I know it's a film, but would like to be able to relate to it in some way or another. It tries too hard and fails IMO"
    },
    {
      "rating": "5/5",
      "review": "I really liked this movie. Rami Malek does a great job with the character he's playing. I was on the edge of my seat to see what was coming next. It's definitely worth your time to watch it. Enjoy!!"
    },
    {
      "rating": "4/5",
      "review": "This was a pretty good cloak and dagger film. There were a few instances that you were not believable, but most people don’t go to the movies for real life."
    },
    {
      "rating": "5/5",
      "review": "I enjoyed it. A good movie."
    },
    {
      "rating": "4/5",
      "review": "This was an above average addition to the world trekking spy adventure genre. I enjoyed the way our main character laid out his plan and kept the audience and everyone including the CIA guessing. This was more psychological than some in this genre as there were only a few fights. It was mostly him being one step ahead of everyone else to accomplish his goals. It was a film to seek retribution for his wife’s death and achieved its goals."
    },
    {
      "rating": "3.5/5",
      "review": "I like that it wasn't sexual and promoting women bodies. I dislike that it wasn't enough continuous action that have you like tense that the main character might not succeed. I dislike the whole bad guy giving the nerdy computer guy the gun scene. It would have been nice to see him shoot someone up close and make his trainer eat his words that he couldn't accomplish that. But at least let him fight or struggle to get a gun and accomplish that. Other then that I've been recommending the movie to many already. It was good."
    },
    {
      "rating": "5/5",
      "review": "I really enjoyed it. Kept me on my toes."
    },
    {
      "rating": "5/5",
      "review": "Very action packed and full of plot twists."
    },
    {
      "rating": "2/5",
      "review": "Great cast, very disappointing movie. A lot of the scenes could have been made impactful but were instead wasted, and in the end that was my impression of the entire film - lots of potential with zero return."
    },
    {
      "rating": "5/5",
      "review": "Story keeps you in your seat, Good actors great action scenes all around. Movie worth seeing on the Big Screen"
    },
    {
      "rating": "3.5/5",
      "review": "Good premise of Jason Bourne but with a nerd. Unfortunately, the writer and director were the real amateurs"
    },
    {
      "rating": "5/5",
      "review": "Excellent movie. Fast, entertaining, great story line!"
    },
    {
      "rating": "5/5",
      "review": "Rami Malek and fish burn was phenomenal!! Loved the unique plot. Please watch and support this cast in theaters"
    },
    {
      "rating": "1/5",
      "review": "I walked out after a little over an hour. Decided going home to read a library book would be more entertaining. This doesnt feel like a Jason Bourne film, it has more the made for TV feel."
    },
    {
      "rating": "4.5/5",
      "review": "Great movie acting was excellent and great plot"
    },
    {
      "rating": "5/5",
      "review": "The plot was great Rami and Lawrence Fishborne were Great"
    },
    {
      "rating": "5/5",
      "review": "intense romantic but suspense loved it."
    },
    {
      "rating": "4/5",
      "review": "Very good movie. Good story line coupled with very good acting."
    },
    {
      "rating": "1.5/5",
      "review": "Feckless lead. Unbelievable supporting cast showing up in unbelievable situations. Women all had dark hair (couldn't distinguish who was who). Couldn't wait for ending, and don't remember if he got the killer."
    },
    {
      "rating": "3/5",
      "review": "It was entertaining. It had a Jason Bourne feel. Not as good. Worth watching. I would recommend it."
    },
    {
      "rating": "4/5",
      "review": "A movie with more strategizing than car chases; more clever plans than karate strikes. This nerdy hero (Heller) who can't hit a silhouette target from 10 meters is the complete opposite of John Wick. I enjoyed the whole movie, even when it overplayed Heller's technical nous. Other than the non-standard hero, the rest of the movie is fairly typical of the 'rogue spy brings down corrupt CIA leadership' genre."
    },
    {
      "rating": "5/5",
      "review": "Great plot and action"
    },
    {
      "rating": "4/5",
      "review": "great story line and great preformances, Rami does it again!"
    },
    {
      "rating": "3/5",
      "review": "moderately entertaining movie"
    },
    {
      "rating": "3/5",
      "review": "It was fine, literally didnt need any screens with Jon Berthnal- its like he was edited in at the end just to have his name on the ledger"
    },
    {
      "rating": "2/5",
      "review": "This movie should have been a mini series. Seemed too rushed. Obvious disconnect between the writer, the editors, and the director."
    },
    {
      "rating": "2.5/5",
      "review": "The Amateur is a movie I wanted to like, because I like action-thrillers, but sadly I ended up disliking this one. I heard bad things about it, but I didn't care, because I tend to like these kind of movies. Unfortunately the movie is boring for the most part. The story is simple, the tension was on a very low level. The only thing that surprised me was the way the main character did what he did. A big part of my problems is because of the trailer. There is just too much in it and I've seen it in the cinema too many times. So in many scenes I knew what would happen. The characters are not well-written. I couldn't get attached to Heller, so that's also a big part of why I was bored. A movie like this should be a lot more tense, there were only a few intense or exciting scenes. The film should also be a lot shorter. The score is good, but a bit too epic sometimes. Finally the casting is the best aspect. The supporting cast including Jon Bernthal, Laurence Fishburne, Holt McCallany and Caitriona Balfe elevated their scenes very much. The Amateur was promising because of its cast, but ended up being boring and uninteresting."
    },
    {
      "rating": "4/5",
      "review": "I really like this movie. Lots of action in suspense. Look, the plot might be a little far-fetched. However, that’s why we go to the movies! I really like how we got to see a change in the main character, an increase in maturity, as he progressed through the story. Good job by the actor and the director."
    },
    {
      "rating": "5/5",
      "review": "Loved the suspense, the twists and turns, and the acting was superb. I would watch it again."
    },
    {
      "rating": "4/5",
      "review": "The Amateur is a revenge story highly suited on the magnetic personality of Rami Malek. And in that sense, I loved it. You want to see him complete his job for sure. The script lacks some stakes in the second part and the finale felt rushed. But it works and it satisfies. Good."
    },
    {
      "rating": "4/5",
      "review": "good thriller. I like the how the story builds in layers."
    },
    {
      "rating": "5/5",
      "review": "Rami Malek is amazing! This movie is non stop action, great plot, had me on edge of my seat!"
    },
    {
      "rating": "3/5",
      "review": "Overall, it's a decent movie. It's hard to be passionate about Rami Malek's character. It's difficult to find him credible. You might want more of Inquiline played by Caitriona Balfe. Her piece is perhaps some of the most intriguing and could have (maybe should have) been the substance of dual heroes. And you might leave disappointed that Jon Bernthal's character is seemingly some sort of red herring. What the heck was that all about? The ending with Laurence Fishburne is fairly unsatisfying. And you might feel like the character played by Adrian Martinez should have had something more. The filming and scene cuts almost make you believe that certainly there will be, and then there isn't. But, it's a clever story with decent action and an interesting twist on the Jason Bourne-espe type thriller from a conspiracy perspective."
    },
    {
      "rating": "5/5",
      "review": "You could really sense his frustration of his own department's no worries \"We got this handled\" attitude and his anger when he discovers the truth. Refreshing to see justice served in a very intelligient manner as opposed to the regular muscle, guns, physical violence action we are used to seeing."
    },
    {
      "rating": "5/5",
      "review": "The story held my interest throughout and flowed at a good pace. The acting was superb."
    },
    {
      "rating": "4/5",
      "review": "A very fun film with a premise that drew me in. Instead of the typical alpha male machine gun toting martial arts expert, we are introduced to a very unorthodox protagonist who uses his unique talents and resourcefulness to reach his ‘goals’ and the ride is action packed and thrilling along the way. Rami Malek is a great lead in this film and could be the start of more films like this for him."
    },
    {
      "rating": "5/5",
      "review": "Was a real spy thriller.. Can see a sequel!"
    },
    {
      "rating": "4/5",
      "review": "I loved it! It didnt get the advertising it deserved! Very exciting twists & turns & surprises. Loved it was clean & I dont think there was even cussing."
    },
    {
      "rating": "4/5",
      "review": "Rami Malek is an excellent actor and that alone made the movie enjoyable. The storyline obviously wasn't anything original as far as CIA spy movies go but the action was good."
    },
    {
      "rating": "5/5",
      "review": "Great revenge movie!"
    },
    {
      "rating": "5/5",
      "review": "Movie was great, no bad feedback."
    },
    {
      "rating": "4/5",
      "review": "Clever plot. Well acted. It didn't end as predictably as one would think. Entertaining overall."
    },
    {
      "rating": "3.5/5",
      "review": "This was like one of the best actions films I have seen since “22 it had one funny moment but the whole film was on point but I give it a rating 9/10"
    },
    {
      "rating": "3.5/5",
      "review": "Good story but slow to start"
    },
    {
      "rating": "4/5",
      "review": "Really enjoyed this one! Kept me on the edge of my seat and cheering all the way through!"
    },
    {
      "rating": "5/5",
      "review": "Everyone has their movie preference type and this is mine! I lovvvvve action/adventure, suspense/thriller. I knew, while watching the trailer, that I would return to the theater to see this film. I'll be telling everyone at work tomorrow that I highly recommend The Amateur. Great storyline and the cast did phenomenal work. I didn't hear a peep in the theater because everyone was so engrossed in this movie and absorbing every second of new material presented. So far in 2025, this is my favorite of this year and I see lots of movies, 1 or 2 weekly. Make time to see this great movie and enjoy!"
    },
    {
      "rating": "2.5/5",
      "review": "Slow at times. The plot was confusing at times. Malik's performance was superb."
    },
    {
      "rating": "3.5/5",
      "review": "It was good but I thought the ending and the way Charlie defeated the people who killed his wife was a little underwhelming. Still worth watching!"
    },
    {
      "rating": "5/5",
      "review": "All around great movie."
    },
    {
      "rating": "4/5",
      "review": "Honestly, a good movie to go to. Thrills. Tension. Wild. Loved it!"
    },
    {
      "rating": "4/5",
      "review": "Definitely was a drama but I was definitely hooked and kept me on the edge of my seat a few times !"
    },
    {
      "rating": "2/5",
      "review": "This movie tries so hard to be smart, but it ends up being a poor attempt at Saw."
    },
    {
      "rating": "5/5",
      "review": "Amazing movie! Watch it!!!"
    },
    {
      "rating": "5/5",
      "review": "Plot, film locations, acting and its ending made this a great movie experience!!"
    },
    {
      "rating": "3/5",
      "review": "It was good, but nothing groundbreaking."
    },
    {
      "rating": "5/5",
      "review": "Remi Malek's character was well played as awkward, nerdy, and determined. I loved the final confrontation."
    },
    {
      "rating": "4.5/5",
      "review": "Suspenseful to the end"
    },
    {
      "rating": "5/5",
      "review": "Good action and story."
    },
    {
      "rating": "5/5",
      "review": "It was cerebral. I really liked it."
    },
    {
      "rating": "2/5",
      "review": "The main actor, Malek, didn’t work for me in this role. He plays it too emotionless most of the time. I just didn’t believe his desire for revenge. The plot was fun but the emotions weren’t there to pull me in. Perhaps that’s the director’s fault, but I feel like the script is too weak and the actor was, well, trying to act, instead of actually feeling the pain and desire for revenge. Again, good idea for a story, but the movie fell flat for me."
    },
    {
      "rating": "4.5/5",
      "review": "I'm a big fan of Rami Malek and Lawrence Fishbourne so I may be somewhat impartial... The movie was full of action, drama and suspense. LOVED IT!!!!"
    },
    {
      "rating": "5/5",
      "review": "We loved it! Creative without the crap! Well done!"
    },
    {
      "rating": "5/5",
      "review": "Great story, direction and acting. An espionage thriller modernized for today’s audience."
    },
    {
      "rating": "5/5",
      "review": "Great movie, held our interest from the beginning to end. Good casting."
    },
    {
      "rating": "4/5",
      "review": "l love Rami in everything. He is a wonderful actor. lots of action"
    },
    {
      "rating": "0.5/5",
      "review": "bug eyed malek proovs he cant act , this is a disgrace to cinema"
    },
    {
      "rating": "5/5",
      "review": "Suspenseful, good story and acting. Very little swearing."
    },
    {
      "rating": "2/5",
      "review": "aassdsadsadöoaksdkaösdk"
    },
    {
      "rating": "3/5",
      "review": "nothing new and nothing great. what was even the point of Jon Bernthal's character?"
    },
    {
      "rating": "3/5",
      "review": "Fairly predictable, but a good romp."
    },
    {
      "rating": "5/5",
      "review": "This film was really good! I enjoyed it very much!"
    },
    {
      "rating": "5/5",
      "review": "An excellent thriller with enough twists and turns to hold your interest."
    },
    {
      "rating": "4/5",
      "review": "fast action and excting to watch"
    },
    {
      "rating": "4.5/5",
      "review": "Good suspense movie with just enough believability that it keeps you interested. The theater was almost full at the 10am show so it must be getting good word of mouth reviews."
    },
    {
      "rating": "3.5/5",
      "review": "The film tells the story of Charlie Heller, played by Rami Malek, whom you may know, among others, from Mr. Robot or Bohemian Rhapsody. The main character works at the CIA headquarters in Langley as an extremely talented cryptologist. His seemingly simple and routine life changes completely when his wife Sarah (Rachel Brosnahan) is killed in a terrorist attack in London. Charlie does everything to convince his superiors to take action to catch and punish the perpetrators, but when they refuse you, he decides to take matters into his own hands. He uses his intelligence and skills to do justice to his beloved's killers. The plot may seem simple, predictable and give the impression of \"I've seen it somewhere before\", but it still draws you in and encourages you to follow the further fate of the characters. The pace of the film is a bit slow, but in my case it didn't make me bored - on the contrary, the story engaged me more and more. It can be said that this is a \"one-man army action\" film, but it differs from classic examples of this type. Charlie is not John Wick or Nathan Cain from Novocaina - he cannot kill a man with his bare hands. Instead of brute force, he uses his mind, knowledge and analytical skills, which adds freshness to the film. Rami Malek here is somewhat reminiscent of Elliot from Mr. The robot, although in this role, is more human - not cold and feelingless, but frightened, incapable of violence, but ready to sacrifice. It is worth mentioning that Jon Bernthal appears in the film and in my opinion his character does not play a major role. He appears maybe in three scenes and that's it. Laurence Fishburne plays a character somewhat reminiscent of Morpheus from The Matrix or King Bowery from John Wick, although here he plays rather a villain - although whether he is really bad can be debated. To be honest, it's hard for me to point out the disadvantages of this film that I didn't notice them because I was too absorbed in the plot. In short: I really liked the movie. To sum up - The Amateur is an interesting action thriller. It may seem like something we've already seen somewhere, but it's still worth giving it a chance and watching it, whether in the cinema or at home. I recommend."
    },
    {
      "rating": "3.5/5",
      "review": "Overall ok movie, not allot of action, more of a drama."
    },
    {
      "rating": "4/5",
      "review": "If you enjoy Rami Maleks acting, you will enjoy the movie. We do and we did!"
    },
    {
      "rating": "5/5",
      "review": "The movie was so Good"
    },
    {
      "rating": "2/5",
      "review": "Too much violence. Hard to follow the storyline."
    },
    {
      "rating": "4/5",
      "review": "I enjoyed the twist of brains over brawn in this film. Charlie may not have been able to beat the bad guys with his fists, but he sure did a brilliant job of leveraging his intellect to seek not only justice but his revenge."
    },
    {
      "rating": "4/5",
      "review": "Filmul este foarte interesant, povestea este destul de buna, chiar dacă pare a fi prea generica. Lucrurile se așează prea bine în anumite situații, însă filmul merita văzut în cinematografe. Îi dau 80 % ,fiindcă filmul pare a fi un amestec din alte filme care încearcă sa facă ceva original."
    },
    {
      "rating": "4/5",
      "review": "I really enjoyed this, sort of a thinking man’s 007. Really hope they make another one!"
    },
    {
      "rating": "5/5",
      "review": "Congratulations! We have a new action thriller movie. I hope there's Amateur 2!"
    },
    {
      "rating": "3/5",
      "review": "The movie was good however it was very predictable and ended a bit weird."
    },
    {
      "rating": "5/5",
      "review": "It started slow but by the end was so eye catching, and interesting but also different."
    },
    {
      "rating": "4/5",
      "review": "Very entertaining, a lot of fun!"
    },
    {
      "rating": "5/5",
      "review": "The writing was excellent!!! Plenty of action!!! All of the characters were great!! Five stars to the director and producer!!!"
    },
    {
      "rating": "4/5",
      "review": "It was better than I thought it would be. However, all that intrigue and danger Charlie put himself in, and only got a few scratches?"
    },
    {
      "rating": "2/5",
      "review": "The first disappointment of 2025. I was expecting a low key film just to kill some time… and it still let me down. It features well known actors, but they’re completely lacking charisma here. The script is ridículous. Honestly, the trailer holds all the excitement, the best parts are already in it."
    },
    {
      "rating": "3/5",
      "review": "Not a bad movie. A bit slow at times. But I liked the cat and mouse. Might have been better if R rated movie made then PG."
    },
    {
      "rating": "4/5",
      "review": "It was surprisingly good, it started slow, but the action picked up nicely.."
    },
    {
      "rating": "5/5",
      "review": "Loved it! He was underestimated at every turn and continuously outsmarted them all. Very fun!!!"
    },
    {
      "rating": "5/5",
      "review": "Well acted, not as predictable as I thought it was going to be."
    },
    {
      "rating": "3/5",
      "review": "The Amateur is nothing new, but I found a good amount of fun to be had in this engaging revenge story. Rami Malek steals the show as he gives a great performance that shows the deep grief his character goes through, and I enjoyed the ways he would squirm out of tough situations like a bar of soap. It was cool seeing the way of how the film uses technology to decode the mystery of who made Rami Malek’s character a living hell, which made the action so much more fun. But I think the film takes too long for that to happen, and in the meantime we are fed a lot of different characters I found a little bland, lots of head scratching decisions made in the development of the supporting roles. Even with Rami Malek’s character, the film felt like they didn’t know how to keep his motives steady. But I think it’s an engaging enough time to watch go see it in theatres"
    },
    {
      "rating": "5/5",
      "review": "This is a movie that keeps you guessing all throughout the story line."
    },
    {
      "rating": "5/5",
      "review": "Awesome movie. Kept us on our toes. Plot twist for sure was unexpected. I would definitely recommend and watch it again!"
    },
    {
      "rating": "5/5",
      "review": "Loved all the different ways he was able to get his guy without the normal blood and Gore."
    },
    {
      "rating": "5/5",
      "review": "amazing 👏 hands down well worth every penny"
    },
    {
      "rating": "5/5",
      "review": "it was different. he couldn't fight but used what he was good at to get the job done"
    },
    {
      "rating": "5/5",
      "review": "Really well made movie, really enjoyed it"
    },
    {
      "rating": "4/5",
      "review": "Movie was good but slow it took forever for the action to start"
    },
    {
      "rating": "5/5",
      "review": "Action packed good storyline"
    },
    {
      "rating": "4/5",
      "review": "My wife and I enjoyed date night at the movies while watching The Amateur. It is an enjoyable, original story. We both agree on 3-1/2 to 4 stars out of 5. Worth seeing on the big screen."
    },
    {
      "rating": "5/5",
      "review": "Love this movie. Rami is a great actor, keeping me thinking about the next victim and step. Would watch it again as it was fast paced and exciting."
    },
    {
      "rating": "3.5/5",
      "review": "it was a fun movie, a little boring at times, but i’d give it a solid 7 out of 10."
    },
    {
      "rating": "4.5/5",
      "review": "Phenomenal performance by Rami Malek . Intriguing story and action packed ."
    },
    {
      "rating": "4.5/5",
      "review": "Loved how the main character was able to get the other guys"
    }
  ]
}