[
  {
    "rating": "4/5",
    "review": "Final destination review I love when the death scenes are very interesting funny dramatic the writer of some characters and choices was very dumb and frustrating I love the soundtrack I listen to and put it into my playlist 4 star 7 out 10 star 70 star out 100 star"
  },
  {
    "rating": "2.5/5",
    "review": "A movie with such a unique premise that it started off a new horror franchise that the whole family can enjoy. (for better or worse)"
  },
  {
    "rating": "3.5/5",
    "review": "Started off the series well and was quite clever in its idea. It does exactly what you want from the start for this sort of film. One gripe is death cleaning up after itself in one death which sort of ruins the point."
  },
  {
    "rating": "2.5/5",
    "review": "Pacing really slowed down at the end and had some really unnecessary scenes. Also thought the acting was really generic and bland. Camera work was sloppy and generic. Only thing that was okay about this movie was the creative and innovative deaths. Suspense wasn't really that intense, you know what's going to happen before it happens."
  },
  {
    "rating": "0.5/5",
    "review": "**** this, I'm getting out of here!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "5/5",
    "review": "Final Destination is hands-down the best in the series. I was only two when it came out, but rewatching it in high school and again now reminded me how terrifying everyday life can be — yet we still take risks. This film is a fun, suspenseful ride with a brilliantly original concept. The kills are memorably cool, and the characters are easy to root for. It’s horror with brains and attitude. I’m so excited for Final Destination: Bloodlines and can’t wait to see how everything ties together."
  },
  {
    "rating": "3/5",
    "review": "“Destino Final” no es una obra maestra del cine de terror, pero sí es una propuesta original dentro del género slasher de los 2000, con una premisa intrigante y una ejecución entretenida. Es una película que juega con el miedo a lo inevitable, y lo hace con estilo."
  },
  {
    "rating": "5/5",
    "review": "O ponto de partida de uma franquia que teve altos e baixos, mas que sempre se manteve boa, fazendo o simples com perfeição..."
  },
  {
    "rating": "2/5",
    "review": "The premise is fascinating but the writing is bad and most of these actors are just bad and annoying. Some of the sequels are better..."
  },
  {
    "rating": "3/5",
    "review": "I had the pleasure of catching the Final Destination Double Bill on the big screen, which included the original & followed by \"Final Destination Bloodlines.\" I couldn't pass on it as I don't remember the last time I watched \"Final Destination,\" the movie that kicked off a franchise. The scene transitions & looking back on the foreshadowing for the impending deaths that I missed, the story driven tension leading up to the opening disaster. The story building to the rules in Death's design that got introduced. The main core of the characters are maybe the best as they aren't treated like cannon fodder who are just there for the deaths. 25 years later its still my favourite entry."
  },
  {
    "rating": "5/5",
    "review": "Um clássico dos anos 2000"
  },
  {
    "rating": "5/5",
    "review": "Excellent movie with a new direction in Horror. No boogeyman, no bad guys, just some dumb teenagers vs the nature of Death Miss you Tony T!!!!"
  },
  {
    "rating": "4/5",
    "review": "Underrated. As this plot was the first of its kind."
  },
  {
    "rating": "3.5/5",
    "review": "Full of gore, violence and creative deaths. I do love that aspect. It's not a bad movie, but not my favourite of the franchise."
  },
  {
    "rating": "3/5",
    "review": "Before we get into this review, I will go ahead and say that to be fair, I'm not the biggest fan of these movies, but at the least when given the chance, I can appreciate them from an average viewpoint. But for now, we go into the film that started the franchise. With this film, I always found it to be in the middle. Not terrible. Not great. I just found it fine. I will say the kills were great and creative, the score for the movie was good, and the acting was also great. Of course, death's design can be well paced when cheating it from a teenager's premonition of a bigger event before the events that take the survivors out one-by-one. What keeps the film going is the thrill of what comes next as death, being a malevolent force that it is, tracks down and pulls the strings of its next victim. With the characters, I always thought of them being your usual high school drama set of troupes like you have your outcast, you bully, your best friend as they are written as such. I do give Alex credit along with Clear that they are better written for the script that they were given. Even enjoyed Alex the most as he's learning more about his premonitions while piecing together death's plan. I'll admit, one of the characters, Carter mostly, is one of my nitpicks. Being more of a whiner when he's nothing more but the jerk despite being played by a good actor. Like if I were to see him approach me, I wouldn't hold back to smack him back. But I digress. Also nice to see Tony Todd on the screen, rest in peace, even if it's just one screen being the coroner. I give this film six and a half car on the train tracks out of ten. 6.5/10."
  },
  {
    "rating": "5/5",
    "review": "The best final destination movie. I don't understand why people hate this franchise final destination franchise is one of the horror movies that actually make me scared. Also so excited for the bloodlines"
  },
  {
    "rating": "4/5",
    "review": "'Final Destination' is top entertainment! I've been meaning to watch this franchise for ages - happy to get started. The only thing I know coming in is there's some sort of scene with a car driving behind a (presumably unsafely loaded) lorry? Presumably that's in a sequel. This is the first time I've watched Devon Sawa at this age of his, I know from watching TV's 'Chucky' that people always mention this film(s?) when talking about him. He is a well chosen lead, for sure. Ali Larter is solid too. Interesting to see Seann William Scott involved. Some of the characters behind that trio are iffy, in terms of how they are written/portrayed. Kerr Smith's Carter is mostly annoying, for example. Larter's Clear is written a bit odd around the middle part too. The bit with touching the thing (no spoilers) with Kristen Cloke's character is also silly. To be fair, it is a movie designed to be entertaining rather than being something super intricate and highly logical. It does deliver in regards to the former, the effects are great and the deaths do get nicely creative. It is well paced as well, a 90 minute run time is perfect for a film like this. I will say that the ending seemed a bit off to me (if still fun and fine), it kinda felt like the filmmakers didn't know how to end it given how the 'skipping' works and obviously they wanted to set a sequel. It's not a big issue whatsoever, it did seem a little roughly concluded though. All in all, as you can see from my rating, I did love watching it. Interested to see how the follows-up turned up, I'd imagine it's a mixed bag (at best) but time will tell."
  },
  {
    "rating": "4/5",
    "review": "I am glad I came back to this movie quite a bit older, but it still gets me at the edge of my seat, which is how horror should be."
  },
  {
    "rating": "3.5/5",
    "review": "It’s been 25 years and this franchise has given new meaning to the term paranoid/deepest fears From a screenplay by James Reddick he read from an article James Wong directs the first installment of this long dormant series centering around something many of us don’t consider…death itself coming after us Instead of a monster or inanimate object what if the thing stalking us was the presence of death? You can interpret it as the grim reaper The story centers on high school student Alex Browning and his classmates going on a trip to Paris, France They board the plane designated Flight 180 and Alex all of a sudden has a premonition of the plane exploding after takeoff He tries to warn everyone and he and several students leave yet the plane still takes off and explodes just like he said it would Then a few months later everyone seems to go on with their lives but all the survivors start dying off in weird accidents; Alex comes to the conclusion that the ones who survived die in the exact order they would have if they stayed on the plane They’re all on death’s list and they have to find a way to break the chain This has one hell of an opening with the plane itself The movie isn’t scary per se but takes our greatest fears amping them up by delivering the most gruesome death scenarios We never consider these every day walking outside our homes but death can strike at any moment It’s the unavoidable fateful nature of it all Maybe in death there are no accidents, no coincidences, all of our actions are based on choices from the mundane to the monumental, are we all part of death’s sadistic design? Wong’s direction has him taking all the chaos losing a loved one manifesting it physically and visibly, he has a timely examination of death and negative emotion Even the characters on the poster become empty husks as the series of events unfold It’s got a big collection of upcoming teen actors: Ali Larter, Sean William Scott, Devon Sawa, Kerr Smith, Amanda Detmer, and the late Tony Todd himself This ended up getting mixed reviews from critics and has more along the lines of an X-Files episode not being subtle with a few glaring plot holes but managed to make $112 million on a $23 million budget thanks to fan appreciation It’s also quite pressing since this was 1 year before the tragedy of 9/11, something horrific we were not ready for Gives off that sense of dread getting onto a plane now There’s some creative deaths like from Rube Goldberg elaborate set pieces, a chilling score, some fun dark humor, and a memorable performance by Todd bringing eerie gravitas that would be a frequent occurrence in later sequels With 6 films now it’s a testament to this franchise’s staying power for a studio genre picture making death quite unsettling"
  },
  {
    "rating": "4/5",
    "review": "Final Destination kicks off with an eerie premise that immediately sets the tone for what’s to come. The plot follows a group of characters who narrowly escape a disaster, only to realize that fate doesn’t like being cheated. Instead of diving deep into the mystery of why things are happening, the movie focuses more on tension and the creative ways death finds its victims. While the concept is solid, the execution sometimes feels a bit surface-level, making it more about the spectacle than the psychological depth it hints at. The directing does a good job of keeping the suspense alive, using clever foreshadowing and unsettling visual cues to build tension. Cinematography plays into this well, with zoom-ins on seemingly random objects that later become crucial, adding an extra layer of unease. The film also makes great use of lighting and framing to amplify the feeling that something ominous is always lurking around the corner. It’s not a groundbreaking approach, but it works effectively within the horror-thriller genre. Acting is decent for the type of movie it is, with a few standout performances that help sell the fear and paranoia. The script keeps things moving, though some dialogue can feel a little forced at times. Where the movie really shines is in its sound design, using an eerie score and well-placed sound effects to enhance the tension. Overall, Final Destination is a fun, suspenseful ride that delivers on its concept, even if it doesn’t explore its deeper themes as much as it could have."
  },
  {
    "rating": "3/5",
    "review": "Not the best but a good movie that started a good franchise. The movie was an original idea which I liked a lot but I felt like most of the kills felt boring or not wild enough. It was a good watch though and it started a good franchise but the beginning film to me felt iffy. Tony Todd was wonderful as ever though and one of the other things I love about this movie."
  },
  {
    "rating": "0.5/5",
    "review": "I thought the movie was wack"
  },
  {
    "rating": "3.5/5",
    "review": "It is a pretty good Movie and it definitely has a good Idea, especially the first Minutes and the first tragical event of the movie was pretty great but that was about it, it was the highlight of the movie, after that the deaths that came were pretty predictable and a little bit over the top, but besides that this still is a good movie which was very fun to watch."
  },
  {
    "rating": "4/5",
    "review": "I'm glad I decided to rewatch this after so many years, it felt as good as it did the first time. The tense plot keeps building up slowly until the very last minutes where a lot happens at once. Final Destination: Bloodlines will be out in 2025, so it's time to finally catch up with the series until then."
  },
  {
    "rating": "3.5/5",
    "review": "Thanks to the original trilogy I am scared of flying, driving and I am damn sure that I will not enjoy my next rollercoaster amongst many other more mundane day-to-day activities portrayed in these excellent films. The catastrophes in these movies are so impressively detailed mapping out the end of each victim’s life. This movie itself is where it all started. It is a good starting point too. The tragedy is devastating, the quality of young talent impressive and the whole idea scary and yet interesting. The film is well made and graphically violent. This is clever horror that will make you think twice about your very own existence. Whatever that existence is. Classic film making and a very entertaining and fun movie. It is even a little scary! Love the characters, the story and the entertainment."
  },
  {
    "rating": "3.5/5",
    "review": "Una buena entrada para animarte a ver toda la saga. Es inteligente, pero carece de alma; parece que a nadie le importa la muerte de sus amigos. Aún así, estás todo el tiempo con ganas de saber qué pasará. Para mí, esta entrega tiene una de las muertes más horribles por estrangulamiento; es tan difícil de ver. Imposible que no te suden las manos"
  },
  {
    "rating": "4.5/5",
    "review": "Because of Final Destination: Bloodlines releasing soon, I decided now would be a great chance to catch up on the rest of the series, as I watched the first film a bit ago. So, here's my review of the first film as I'm reviewing the others! I really enjoyed this movie but not because I thought it was scary. I found it quite funny. It's a weird concept: Death gets pissed at people escaping his wrath and punishes them via systematically killing them like an invisible slasher villain, and it's executed in a funny way. It's like a game of trying to figure out how each character on Death's hit list will die. It also has an element of dread to it, as it's still a horror movie after all. It's a film, ultimately, about fate. How your fate, no matter how hard you try to run from it, always catches up with you. It's funny and scary and I love it for that. Overall, a great horror comedy. Can't wait to watch the second one!"
  },
  {
    "rating": "4.5/5",
    "review": "The first 15 minutes are every nervous flyer’s nightmare, while the rest is a freefall of fantastical deaths dialed up to full camp."
  },
  {
    "rating": "2.5/5",
    "review": "Okay all honesty in this it was an okay movie you are just screwed no matter what the hell you do. You can never dodge death and the characters were decent just alright idk def think it couldve been better, The death were also a little werid of how they died, lines were kinda cheesy and corny but lowkey enjoyed that though. I will check out the second one just to see what you guys keep coming up with I know I did watch a movie dont remebr the number but did traumtize me lol."
  },
  {
    "rating": "5/5",
    "review": "“Death is the Final Destination, Boarding Starts Now!” Now I’m scared to go on a plane. The whole storyline is interesting and a great franchise for horror. 5/5 stars."
  },
  {
    "rating": "2.5/5",
    "review": "Not a terrible horror movie. A bunch of kids miraculously survive a brutal plane crash; and then Death and Destiny seems to be coming after them later; since they cheated Death before...Adam Stein, the director, should have reigned himself in a little; it's almost comically melodramatic sometimes. A little more nuance and subtlety, and ambiguity, would have helped. Also teenagers who aren't such a bunch of Animal House-Deadhead stereotypes. And the composer over does it with the Psycho background music...But there's still some cool ideas and set pieces nestled in there; and some good suspense. Supposedly it was inspired by an X Files script; and you can see that influence; that and The Twilight Zone; with all it's twisty stories about fate and destiny. The kill scenes are very similar to the Rube Goldberg type death scenes in The Omen. I'd recommend this for horror aficionados; and horror completists; since it's considered a classic in slasher fan circles. So not a great movie; but interesting in parts."
  },
  {
    "rating": "3.5/5",
    "review": "Full of suspense, makes you grip the edge of your seat and surprises are thrown in throughout. Worth a watch!"
  },
  {
    "rating": "4/5",
    "review": "Very enjoyable i had a lot of fun"
  },
  {
    "rating": "3.5/5",
    "review": "It’s not a bad movie. The visions and deaths are great and make a hallmark of the series because of how graphic and violent they were. However, the forgettable scenes of nonsense dialogue that doesn’t need to be dragged on make this boring for some viewers."
  },
  {
    "rating": "3.5/5",
    "review": "While it's hardly anything more than another gory 'Scream'-inspired teen slasher, it's also a genuinely fun, fast paced thriller with some memorable characters and kills."
  },
  {
    "rating": "3.5/5",
    "review": "It was certainly fun to watch."
  },
  {
    "rating": "4.5/5",
    "review": "final destination is a unique thriller with a plotline I feel nobody has captured better than this, a normal senior who randomly sees something so horrible it kills many people and he saves 7 from it only for the survivors start to go one by one in the order death decided for them. I feel its the most scary as there's no villain there's no ghosts or somebody to be scared of the thing your scared of is death and that's something everybody can relate too because we will all die someday. this film forces characters and the viewers to confront how sudden death is and that's the beauty of this film"
  },
  {
    "rating": "1/5",
    "review": "Final Destination has earned a well-deserved place amongst the ranks of worst horror films I've ever watched. The plot is incredibly contrived, nonsensical and just plain boring and the romance subplot feels very forced and unnatural. The deaths are corny as hell and entirely unbelievable. Unlikable and/or underdeveloped characters, laughable dialogue delivered through a slew of lackluster performances, and a total absence of any truly scary or suspenseful scenes. With no tangible antagonist to move the film along, all of the horror lies in the lousy acting and forgettable script. How Final Destination managed to explode into a full-blown film franchise is as confusing to me as why it was made in the first place."
  },
  {
    "rating": "3.5/5",
    "review": "Just a simple fun movie. Not really special but definitely great to watch!"
  },
  {
    "rating": "3/5",
    "review": "Thought this was good. A story of fatalities, outlined that you can’t cheat death. 4 more films to follow."
  },
  {
    "rating": "3/5",
    "review": "Good film, good story line, quite original plot, but something just feels a bit cheap about the film, mabye it's the acting, or just hasn't aged very well"
  },
  {
    "rating": "4/5",
    "review": "A pretty solid start to this franchise, a bit of a rocky beginning but after that its classic 2000's horror."
  },
  {
    "rating": "4/5",
    "review": "Der Horrorfilm Final Destination stammt von James Wong. … Final Destination ist gut durchdacht. Manchmal wirkt es zu sehr konstruiert. …"
  },
  {
    "rating": "5/5",
    "review": "Great gore, and great premise. The entire concept Final Destination introduces to the franchise is amazing and original. This is definitely one of the most original horror movies and has great ways of killing characters off. It’s characters are quite decent characters with little flaws, but the characters don’t make us feel that bad whenever we see them die, but still provide satisfying gore whenever they do."
  },
  {
    "rating": "3/5",
    "review": "Time pass,nothing great 6/10"
  },
  {
    "rating": "4/5",
    "review": "Excelente! Um filme completamente diferente, e no qual é o meu favorito do gênero terror. Eu conseguir sentir a tensão do Alex desde o momento que ele passou a ter as premonições. E sem contar das atuações, todos conseguem passar o que realmente sentem."
  },
  {
    "rating": "5/5",
    "review": "Final destination has an amazing premise that could lead to all sorts of creative sequels and it's a perfect move all about death."
  },
  {
    "rating": "3.5/5",
    "review": "Comienza mi maratón de mi más grande gusto culposo del cine, la saga de Destino Final. La primera película de esta saga creo un subgénero dentro del slasher (subgénero del terror), planteando de manera clásica, la muerte de un grupo de jóvenes bajo la mano de un ser omnipresente. Ya por este aspecto, se considera un clásico del terror, pero claramente de dudosa calidad. El accidente del avión es efectivo en todo momento, donde a pesar del bajo presupuesto, tuvieron muy claro qué querían mostrar y funciona tanto en una primera vista, como en estarla repitiendo una y otra vez la escena. Con esto nos lleva a las muertes de los personajes, digamos que el desenlace de las mismas es efectivo, pero la manera en cómo empiezan, no. Detalles como el agua mágica que sale del inodoro o la taza que al mínimo cambio de temperatura se rompa (haría falta comprobarlo), hacen que estas escenas pierdan potencia, ya que, de manera contenida y no gore, logran ser efectivas e impactantes, sin mencionar que una de esas muertes es un tremendo jumpscare. Respecto a las matices de la historia, antes me parecía que hablaban mucho y no decían nada, pero ahora, algunos detalles cobran bastante sentido, como las presuntas sospechas de los agentes hacia Alex alegando que es un terrorista arraigado a los que se bajaron del avión, o del hecho que Clear no cree acerca del plan de la muerte debido al trauma que le genero la muerte de su padre y no querer aceptar un destino así; son momentos que pase muy por alto en su momento y que haberla visto después de muchos años, hacen que se le agregue un valor mas profundo a la película. Por último, voy a mencionar al elefante en la habitación, el terrible agujero argumental casi al final de la película, donde Alex se da cuenta que Clear era la siguiente y no él, ni siquiera intentaron justificarlo, fue una decisión bastante estúpida tanto de los escritores de la historia, como del mismo Alex en este universo, es completamente ridículo e incoherente y afecta muchísimo a la película, es la única razón por la cual pierde tres puntos y se queda con una calificación menguante."
  },
  {
    "rating": "3.5/5",
    "review": "You can't cheat death. No boogeyman, no monster just death itself claiming people when it's their time. I like this movie, I will watch it again."
  },
  {
    "rating": "3/5",
    "review": "It's fine. I wish the story was better developped. although the movie isn't terrible, it feels a bit \"pointless\"."
  },
  {
    "rating": "5/5",
    "review": "I Don't care what anyone else says, this is the best horror movie I have ever watched. The Gore, Tension and Raw Jaw-Dropping Moments Stand Out. I Cannot wait for Final Destination 2!"
  },
  {
    "rating": "1/5",
    "review": "Final Destination is a disappointing film. It is about Alex who saves some of classmates after getting a premonition. Devon Sawa and Ali Larter give terrible performances. The script is badly written. James Wong did a horrible job directing this movie. I was not impressed with this motion picture."
  },
  {
    "rating": "3.5/5",
    "review": "Buena película, una cinta gore que es puro entretenimiento. Esta película es el inicio de una franquicia muy exitosa, con una historia que siempre me resulto entretenida de ver, a pesar de que después fue un poco sobreexplotada. Lo que me gusta de la película es que no es solo una compilación de muertes, sino que hay un trasfondo de todo lo que ocurre, y se explica bien por que pasa lo que pasa y en el orden que sucede. Esta muy bueno como el protagonista tiene las premoniciones sobre la muerte de sus amigos y es interesante ver como todos piensan que esta loco al principio y después le van creyendo. Las muertes están muy bien logradas y hay una gran variedad, algo característico de la saga. Otra cosa que me gusto fue el personaje de el forense, quien parece ser la muerte en persona según la interpretación que le das, un personaje muy interesante realmente. Por otro lado, las actuaciones están geniales, principalmente las de Devon Sawa, Ali Larter, Seann William Scott y Kerr Smith. En conclusión, una buena película, con una trama muy entretenida, unas formas de morir que quedaron marcadas y con un elenco de personajes genial. La recomiendo."
  },
  {
    "rating": "3.5/5",
    "review": "No es una película de terror, es más bien de suspenso, la verdad no hay mucho que decir, pudieron hacer algo mejor con ese concepto tan interesante, pero decidieron hacer algo simple, que bueno, en mi opinión esta muy decente. Las actuaciones ni las exageradas escenas de muerte brillan tanto, pero es algo digerible y disfrutable."
  },
  {
    "rating": "5/5",
    "review": "As a millienial this movie will forever haunt my dreams. As a teenager I went through a literal time period in my life where I was afraid I'd set off my own death sequence. So if movie can traumatize you for life...it's gotta have 5 stars."
  },
  {
    "rating": "3.5/5",
    "review": "I recently decided to revisit the 'Final Destination' franchise, starting with the original film from 2000. SYNOPSIS: 'Death stalks Alex Browning and a group of high school students, who survived a doomed airliner.' The original and best film of the franchise actually made stars of many of it's cast unlike it's 4 sequels. This film really sets up what's to come from the entire franchise moving forward with some really chilling shocks and deaths, in what is really a fun teenage romp akin to 'Scream' and 'I Know What You Did Last Summer'. Over two decades later this is still a clever slasher film with some fun gory deaths. You shouldn't laugh but you do. A great horror flick of the 00s. 7/10"
  },
  {
    "rating": "1.5/5",
    "review": "Ever notice how nobody named a movie something like \"Final Destination 1?\" That's because movie makers have no idea that people would give a movie like that the time of day. Not even \"Saw\" started off like that. But wouldn't it have been interesting to have a movie come out that was called \"Saw One?\" Or, in the South, it would have been called \"I Seen One Over There.\" The \"Final Destination\" series is one of the better examples of how a movie series will surprise you with the number of sequels it can spawn. And none of them in the \"Final Destination\" story are very good."
  },
  {
    "rating": "5/5",
    "review": "Really amazing movie series"
  },
  {
    "rating": "3/5",
    "review": "Final Destination has a lot of charm, which is crucial in the enjoyment of this movie. From the story to the acting, the slightly over the top nature of it all gives this film a special feel, in an otherwise standard flick. Although it's iconic in the genre, Final Destination does not really 'wow' with its first outing. While it has some captivating kills and an intriguing plot, it doesn't feel that it does as much as it could to creatively bring it all together and that feels mostly due to the runtime. Stretching it by a bit more to give some time to breathe might've made for a more fulfilling climax. Still, a charming start to an iconic franchise, with only time as its fault."
  },
  {
    "rating": "4.5/5",
    "review": "I grew up in the 90's so this movie was the 1st of it's kind to really put the tension of dying being portrayed as a systematic plan of fate that happens to cause freak accidents amongst these teens. The fun factor is hoping they get to really cheat death and survive."
  },
  {
    "rating": "5/5",
    "review": "best movie franchise out there"
  },
  {
    "rating": "4/5",
    "review": "This one doesn't get enough love. Death as the protagonist chasing down those that escaped him is a wicked concept, if there were a few more scares this could have been all time but that super clean 90s look diminishes some of the more tense opportunities."
  },
  {
    "rating": "5/5",
    "review": "Absolutely love it. My favorite movie"
  },
  {
    "rating": "4/5",
    "review": "Traz uma trama interessante e excelente mortes."
  },
  {
    "rating": "2.5/5",
    "review": "Final Destination (2000) - A Tense Journey with Pacing Quirks Released in 2000, Final Destination pioneered a unique approach to the horror genre, introducing audiences to a gripping narrative centered around the ominous concept of escaping death's clutches. While the film falls into the realm of the average, securing a 5.5 out of 10, it manages to carve out its own space with a suspenseful storyline, despite occasional pacing hiccups. Innovative Premise: Final Destination kicks off with a fresh and innovative premise, exploring the aftermath of a group of survivors who cheat death after narrowly escaping a catastrophic plane crash. The movie ventures into uncharted territory by delving into the consequences of thwarting fate, setting the stage for a suspenseful and intriguing tale. Effective Suspense and Inventive Deaths: The film excels in creating an atmosphere of constant dread, utilizing inventive and, at times, gruesome death sequences that keep viewers on the edge of their seats. The unpredictable nature of these scenarios adds an element of excitement, contributing to the overall tension that Final Destination successfully cultivates. Abit Slow Pacing: However, the movie encounters challenges with pacing. There are instances where the narrative seems to lose its momentum, leading to moments of sluggishness. These slower intervals, although a drawback, don't entirely overshadow the film's ability to maintain an underlying sense of unease. Character Dynamics and Performances: The characters, while not exceptionally deep, manage to convey the psychological toll of evading death. The cast, including Devon Sawa as Alex Browning, delivers performances that resonate with the genre's expectations, even if character development takes a backseat to the unfolding chaos. Predictable Plot Turns: While the film's premise is intriguing, the plot, at times, takes predictable turns. Some elements of the story follow familiar horror tropes, and the narrative occasionally lacks the level of complexity that could elevate it to a more exceptional status. Final Verdict - 5.5/10: Final Destination secures a 5.5 out of 10, reflecting its standing as an average horror-thriller. The movie navigates the challenging terrain of death and destiny with inventive death sequences and moments of genuine suspense. While pacing quirks and predictable elements hold it back from greatness, Final Destination manages to deliver an overall enjoyable experience for fans of the genre. It stands as a notable entry in the early 2000s horror landscape, with its own unique take on the inevitability of fate."
  },
  {
    "rating": "5/5",
    "review": "Amazing concept with ugly actors, I would have made the movie with busty babes eps latinas. Is not netflixed."
  },
  {
    "rating": "5/5",
    "review": "One of my all time favorite movies! The Final Destination series were a blast."
  },
  {
    "rating": "1/5",
    "review": "Está aí um filme q tem uma premissa boa, porém quando saiu do papel ficou um lixo"
  },
  {
    "rating": "4/5",
    "review": "Nice plot and best final destination movie"
  },
  {
    "rating": "5/5",
    "review": "Já assisti diversas vezes, e talvez por isso, hoje, já não sinta mais o frescor que tinha das primeiras vezes que vi. Portanto, vou considerar minhas sensações de quando vi o filme pela primeira vez, e realmente fiquei com medo do roteiro, e das mortes, que eram algo plausível e que poderia ocorrer para qualquer um. E essa jogada de morrer com acidentes bobos é que fez a franquia ter esse sucesso, visto que os atores não são conhecidos, nem são bons, e mesmo hoje, nem tiveram notoriedade para se tornarem mais famosos. Os efeitos eram interessantes, principalmente os práticos. E como a trama se amarra é muito bacana."
  },
  {
    "rating": "5/5",
    "review": "Final Destination is chilling, thrilling, and hilarious. Director James Wong's supernatural horror thriller Final Destination (2000) is truly awesome. Wong's moody direction is very stylized and atmospheric. I love a lot of these early 2000's movies that I grew up watching. It's not just blind nostalgia because the brutal and creative kills are super entertaining. Wong's visceral style is gripping, especially with his forlorn tone. He makes a somber and mournful tone to respect the dead as he kills off these teenagers one by one. Wong's cycles of death are enthralling. You really cannot cheat Death. Screenwriters James Wong, Jeffrey Reddick, and Glen Morgan ruminate on how you can cheat Death. Final Destination's premise of plane crash survivors getting hunted down by the Grim Reaper is interesting enough, but putting existentialist questions along the way is the icing on the cake. The amount of detail and thought put into which order of people dying or what convoluted series of coincidences have to occur before someone is killed is delightful. They come up with innovative murders that are horrifying enough to stay in your memory, but also highly enjoyable to watch in a horror thriller. The plane explosion, car crash, knife stabs, decapitation, and more are fantastic. Who can forget the exploding lights and electric shocks? Final Destination holds up for me. I love and appreciate the entire cast of characters having their last names based off of famous horror directors, actors, or producers is a fun nod. Casting directors John Papsidera and Heike Brandstatter got famous Canadian and American actors for the panicked teenagers makes for a real pleasant watch. Canadian actor Devon Sawa is amazing as Final Destination hero Alex Browning. I appreciate his freaks out performance as he gets premonitions of death and attempts to prevent his friends from being killed by the Grim Reaper. Devon Sawa was actually a great actor and not just a teen heartthrob from the early 2000's. I think he's gripping and emotionally raw throughout the entire movie. He feels totally earnest in his mourning of his friends to his fear of others getting harmed. American actress Ali Larter is gorgeous and compelling as the curiously named Clear Rivers. I had such a crush on her when Final Destination came out and she's still so pretty and engaging in this horror classic. Ali Larter feels genuine in her emotions after getting spooked by Alex's premonitions. She makes for a cute goth girl or edgy heroine. I like that she's a survivor and smart and not here just as a love interest. She has real romantic chemistry with Devon Sawa when they're talking in her garage about their connection. American actor Kerr Smith is great as the jock bully Carter Horton with a chip on his shoulder. His rage and frustrations over feeling emasculated by Alex saving him are interesting. He's such a selfish jerk. Kristen Cloke is excellent as the scared teacher Valerie Lewton with her feelings of guilt over telling the other teacher to stay on the doomed flight. Daniel Roebuck's frustrated Agent Weine and Roger Guenveur Smith's skeptical Agent Schreck are fun adults. Canadian actor Chad Donella is quite moving as Alex's guilt ridden best friend Tod Waggner. Seann William Scott is hilarious as the hysterical idiot Billy Hitchcock. Tony Todd's ominous monologue about cheating Death is outstanding as creepy coroner William Bludworth. It's like the Grim Reaper telling the heroes off for surviving so long. Amanda Detmer is really hot as the dumb blonde Terry Chaney. Editor James Coblentz' sharp cuts make each kill exciting and the movie super fast paced. Cinematographer Robert McLachlan uses heavy shadows, nighttime shots, and blue lighting for a haunting look to Final Destination. Production designer John Willett lets everything move to be potentially lethal. Art directors William Heslup and Bill McMahon lean into that slick icy lighting and sheen of early 2000's horror movies. I love the dark way Final Destination looks. Set decorators Geoff Wallace, Mary-Lou Storey, John Alvarez, Anneke Van Oort, and Joey Jow let every prop be deadly. All the practical effects and CGI look fabulous. Composers Shirley Walker and Adam Hamilton's thrilling film score is eerie with atmosphere and plenty of symphonic bursts for the horror sequences. The massive sound team of Scott Martin Gershin, Dino Dimuro, Eric Batut, Nerses Gezalyan, James Moriana, Jeffrey Wilhoit, Greg Zimmerman, Alan Rankin, Paul Timothy Carden, Tom Ozanich, Melissa Sherwood Hofmann, Brad Sherman, Hector C. Gika, Peter Zinda, Scott Wolf, Scott Sanders, Philip A. Hess, and Dave McMoyler put every noise imaginable in here. They make each moment suspenseful. Costume designer Jori Woodman gives every actor and actress the most 2000's crop tops, sweaters, and double layers of shirts. Makeup artist Lisa Love makes Ali Larter and Amanda Detmer look like the prettiest girls ever. Hairstylists Stacey Butterworth and Thom MacIntyre do the coolest haircuts for everyone that embodies that era. In all, Final Destination is a delightful 98 minutes of murder and nostalgia."
  },
  {
    "rating": "4.5/5",
    "review": "I love this movie so very much."
  },
  {
    "rating": "4/5",
    "review": "A película \"Premonição\", lançada em 2000 e dirigida por James Wong, apresenta uma premissa intrigante que promete manter os espectadores à beira de seus assentos. Com uma pontuação de 4 em 5, o filme oferece uma combinação de suspense, tensão e elementos sobrenaturais que cativam a atenção do público, apesar de algumas falhas que impedem uma avaliação perfeita. O enredo gira em torno de um grupo de adolescentes que escapam de um acidente de avião devido a uma visão premonitória de um dos personagens. Enquanto o grupo tenta lidar com a sobrevivência e o trauma do ocorrido, a Morte parece estar seguindo-os para garantir que a ordem natural seja restabelecida. O roteiro inteligentemente brinca com a ideia de destino versus livre-arbítrio, criando um cenário onde as vítimas lutam para escapar das garras inexoráveis da Morte. As cenas de morte são elaboradas de maneira meticulosa, com uma combinação de suspense, surpresa e horror, que são elementos-chave do gênero. A direção de Wong é habilidosa ao criar uma atmosfera de tensão crescente, mantendo o público ansioso para ver como cada personagem enfrentará seu destino inevitável. No entanto, o filme não é isento de falhas. Algumas atuações parecem um tanto artificiais, afetando ocasionalmente a imersão do público na história. Além disso, o desenvolvimento dos personagens poderia ter sido mais profundo, permitindo ao público uma conexão mais sólida com eles, o que teria intensificado ainda mais o impacto emocional das cenas de morte. Outro ponto que merece destaque é a maneira como o enredo se desenrola. Embora a premissa inicial seja intrigante, a lógica por trás das mortes muitas vezes parece forçada e improvável. Isso pode tirar parte do realismo do filme e fazer com que o público questione a coesão interna da trama. Em suma, \"Premonição\" é um filme que oferece uma dose saudável de suspense e horror, mantendo os espectadores entretidos ao longo de sua narrativa. Apesar de suas falhas na atuação e na construção lógica da história, ele consegue prender a atenção e proporcionar momentos de intensa emoção. Com uma nota de 4 em 5, é uma escolha sólida para os amantes do gênero que estão em busca de uma experiência cinematográfica eletrizante."
  },
  {
    "rating": "0.5/5",
    "review": "So stupid! Only relying on its gore. Bad acting, bad plot and very unrealistic"
  },
  {
    "rating": "5/5",
    "review": "Final destination is my all time favorite horror movie ever and every thing about it is perfect"
  },
  {
    "rating": "3.5/5",
    "review": "The first instalment in the franchise sets the stage with its inventive and thrilling concept of Death's design, creating a suspenseful and nail-biting horror experience that has since become a staple in the genre."
  },
  {
    "rating": "3/5",
    "review": "An interesting premise combined with well done suspense and great action are just enough to overshadow \"Final Destination\"'s clunky dialogue, mostly forgettable characters, and wooden acting from some of the cast. A perfect so-bad-its-good movie!"
  },
  {
    "rating": "3/5",
    "review": "Original idea, mediocre execution. But entertaining."
  },
  {
    "rating": "4/5",
    "review": "What a brilliant idea for a movie! Loved it! Very clever! X"
  },
  {
    "rating": "5/5",
    "review": "The greatest 01 hour: and 37 minutes ever!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "3.5/5",
    "review": "Final Destination was really the first horror movie I got really fascinated with as a kind. Death as an entity coming to get you, you can't stop it, you can't see it, you can't hide from it. To me it is really one of the scariest movie villains put to screen. That it came about as a discarded X-Files episode is really special and the influence of the show is very much felt in this first instalment. (There are two inspectors trying to figure out the strange deaths). A dark, philosophically twisted way to tell the audience that death could be around any corner. That today the set of events could have been set in motion that makes you meet your demise. The characters trying to escape that feels like they are escaping their destiny. What has been planned for them. They are desperate to take control over this part of their life, an analogy for staying alive against all the odds that life itself can throw at you. Alas, it is a bit held down by mediocre acting. But, to me, it is a great horror movie with a novel, interesting concept that death can put in motion a Goldberg-machine like set of events that can kill someone in a bizarre accident."
  },
  {
    "rating": "3.5/5",
    "review": "Somehow I've gone 30 years without ever watching this. People talked about it a lot when I was in school. I was always intrigued but too scared to watch. I've only recently gotten into the horror genre. I must say it's not at all what I was expecting. The tone is more light hearted, almost sweet. Clearly this movie is made for young teenagers despite the R rating. I did enjoy it but it didn't feel like a horror movie to me. I was honestly underwhelmed by the gore factor compared to the hype. It was almost slapstick outside of the initial plane scene. Certainly worth a watch and I think it deserves its status as a modern-ish teen classic."
  },
  {
    "rating": "3.5/5",
    "review": "An interesting take on horror that has never been done before. Amazing gore effects and creative kills that will make you both laugh and be horrified at the same time."
  },
  {
    "rating": "4/5",
    "review": "While many of the deaths are ridiculous and strain believability, Final Destination is nonetheless an entertaining horror movie due to a great concept and effective tension building. It certainly is a very creative movie and although some of the deaths are hard to believe, the unique ways in which they play out keeps the movie from becoming repetitive."
  },
  {
    "rating": "3.5/5",
    "review": "An ‘old school' YA thriller that has never failed in its ability to hold a following, Love it now as much as I did on my first run through"
  },
  {
    "rating": "3.5/5",
    "review": "A new movie franchise is born"
  },
  {
    "rating": "3.5/5",
    "review": "Final Destination is a horror movie with a novel idea that makes it memorable, along with its creative and gory kills that become more elaborate as the franchise continues. The acting in the film is inconsistent, ranging from passable to good, but Tony Todd's standout scene adds to the overall quality. While I found the ending somewhat unengaging, the final scene provides a satisfying conclusion. Despite its flaws, Final Destination is still a unique and entertaining horror movie that horror fans should definitely check out."
  },
  {
    "rating": "3.5/5",
    "review": "The Final Destination franchise is a rollercoaster of hits and misses, with each film offering a unique experience. The first film was a standout with its incredible cast, well-choreographed death scenes, and impressive CGI, creating a thrilling and memorable viewing experience. It sets the stage for the rest of the franchise and is a must-watch to dive into the series. The fear-inducing nature of the first film sticks with you, making you wary of certain scenarios like logging trucks on the interstate. The subsequent films maintain the suspense and entertainment value, although some may not reach the same heights as the original. Final Destination 3 introduces a roller coaster theme, adding a new dimension to the series with a focus on amusement park thrills. While it may not live up to the standards set by its predecessors, the film still offers an engaging watch, thanks to its strong casting and visual effects. Final Destination and Final Destination 5 continue the franchise's trend of captivating audiences with their thrilling storylines and engaging characters. While they may not reach blockbuster status, they succeed in keeping viewers entertained and invested in the series. Overall, the Final Destination franchise is a mixed bag, with each installment bringing something different to the table. While some films may not shine as brightly as others, the series as a whole offers an enjoyable viewing experience that keeps you on the edge of your seat."
  },
  {
    "rating": "3.5/5",
    "review": "This Movie Will always Be a Classic for The Future up ahead. It's at Great Movie."
  },
  {
    "rating": "3.5/5",
    "review": "There are 5 of these in this series at the moment. This one isn't too bad and passes the time. It gets a little boring and drawn out near the end. FD 2 is worst. FD 3 and 5 are probably the best in the series so far. FD 4 is in between the weakest and best of the series."
  },
  {
    "rating": "5/5",
    "review": "Love this movie. A person has visions of a disaster or people dieing. All his visions come true. This one is my favorite out of the series."
  },
  {
    "rating": "3.5/5",
    "review": "One of my favorite horror movies. Admired writer's creativities."
  },
  {
    "rating": "3/5",
    "review": "Final Destination has a lot of creepy visuals and a story thats entertaining enough to keep you hooked."
  },
  {
    "rating": "5/5",
    "review": "Theres not a SINGLE movie that's been released which traumatised me as much as the final destination movies..."
  },
  {
    "rating": "2.5/5",
    "review": "Suspense is the name of the game, but ultimately death's plan cheats the movie out of a good plot, a fun ride but one that ends in slight dissapointment."
  },
  {
    "rating": "2.5/5",
    "review": "\"We need to get off this plane, it's going to explode on takeoff and we're all going to die.\" Kerr Smith: \"How dare you save my life.\" The other early 2000s horror that featured a plane explosion and turned out to age really poorly once 9/11 rolled around; you know, the one not named Donnie Darko. Final Destination has a creative premise, essentially taking the slasher out of the slasher film and replacing him with a cosmic unknown force, but I have no idea what sort of tone it's trying for here; the introduction of the film is understandably dark, condemning hundreds of people to death in a brutal explosion and dedicating a pretty substantial bit of runtime to memorials, tragic mourning, and uncomfortable unresolved trauma. The protagonist, Devon Sawa's Alex, is treated as a social pariah despite saving the lives of his friends, with his paranormal brush with death almost poisoning him in the eyes of others; even the responsibility of the first death is blamed on him, as he is accused of pushing his friend towards suicide. All signs point to a dark thriller where Alex has to contend not only with death chasing him, but a disbelieving world where he appears increasingly paranoid. Then we get ... weirdly lighthearted? The kills get elaborate and whimsical, it's like the Grim Reaper is playing with an erector set as he cobbles together each elaborate murder. Some people are just dropped from the story for laughs, usually after some ironic one-liner. By the end it's become a buddy-survival-mystery, without a hint of the paranoia that the film started out with, only hanging on to a bit of emo existentialism. It's a strange evolution that feels stark, even if the two halves kind of work on their own. Nice Tony Todd cameo, though it's a bit weird that he became a franchise mainstay when he's around for all of two minutes. Just as well that Sean William Scott's character dies here. He'd still be waiting on that Jets Super Bowl for a while yet. (2.5/5)"
  },
  {
    "rating": "2/5",
    "review": "A cool, original idea that was alright."
  },
  {
    "rating": "3/5",
    "review": "It's crap….but watch it anyway."
  },
  {
    "rating": "4/5",
    "review": "All I gotta say is that this is a CLASSIC! GREAT CONCEPT!"
  },
  {
    "rating": "2/5",
    "review": "While its kills are amusingly quaint compared to what later installments in the series would offer and a handful of its scenes are unintentionally amusing instead of scary, it's hard to fault a movie that walked so its sequels could run; if only its pacing wasn't so slow."
  },
  {
    "rating": "3.5/5",
    "review": "filme legal pra caralho, cenas das mortes foram bem planejadas, o elenco ajudou muito, cada personagem deve um aparição muito boa, o ruim é que tem cenas que as coisas se movem mais rapido, tipo cair alguma coisa no chão para que o personagem escorregue e morra ou acontecer um machucado forte que possa morrer ali mesmo. recomendo muito assitir esse filme."
  },
  {
    "rating": "4.5/5",
    "review": "Although it's own rules are unclear, (and continue to be throughout the sequels) Final Destination's cohesive set of characters and simplistic/probable deaths make this first installment stand up above it's sequels and be one of the most unique slasher flicks."
  },
  {
    "rating": "5/5",
    "review": "The greatest 01 hour: and 37 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "2.5/5",
    "review": "My rating for the film is a 5.7/10"
  },
  {
    "rating": "3/5",
    "review": "Having recently watched it a couple days ago I can say this movie is worth the watch, is it the best? No, is it the worst? No, its decent worth the experience of watching it. Other than that the movie a lot of times is uninteresting or you quickly get uninterested until a killing scene happens, good concept but could be better."
  },
  {
    "rating": "4/5",
    "review": "Perturbador, diabolicamente bem bolado e capaz de te fazer desistir daquela viagem programada há meses. Alguns dos receios mais profundos da minha alma surgiram em decorrência de Premonição, então o filme cumpre bem seu papel."
  },
  {
    "rating": "3/5",
    "review": "Slightly tense at first but then gets wacky and is overall kinda funny."
  },
  {
    "rating": "4/5",
    "review": "That was Destructible Fun"
  },
  {
    "rating": "2.5/5",
    "review": "Definitely worth a watch. Yes, it's a cheesy horror film; however, the real terror eventually sets in after when you imagine like scenarios occurring. Bad acting, terrifying concept, bad but good. 5/10"
  },
  {
    "rating": "2.5/5",
    "review": "I mean -- it's Final Destination. It's a bizarre and ridiculous concept with bizarre and ridiculous kills. 5.85/10"
  },
  {
    "rating": "4/5",
    "review": "t's easy to forget that the first film in this franchise is actually a very good horror film. After the slasher craze and Scream rip-offs in the nineties it was refreshing to see that there was still some creativity to be found within the genre. The succes of this film naturally stems from the fact that it has one of the best villains ever, the Grim Reaper himself. The ways in which the cast is killed off one by one are often very creative indeed and make for some gruesome watching. The cast is ok, but they are (as usually is the case in this type of film) merely servicable to a very clever script. And Tony Todd is in it, which is always cool. It is a shame that such a creative genre film was followed by such paint-by-numbers slapstick horror sequels. I'll just stick to this one and leave the rest be."
  },
  {
    "rating": "3.5/5",
    "review": "A movie does not need A-list actors, air tight scripts, etc. to be enjoyable. Many of the movies that I have found to be painfully boring were full of A-list actors and supposedly perfect scripts/stories."
  },
  {
    "rating": "5/5",
    "review": "it's something different. I really like it."
  },
  {
    "rating": "3.5/5",
    "review": "Such a genius premise, the only thing holding it back is it doesn't have nearly much fun as its sequels."
  },
  {
    "rating": "4/5",
    "review": "Final Destination is as well-acted and suspenseful as you'd expect from a movie from the writers of The X-Files that was based off of a rejected spec script for that aforementioned show though it's not without its share of weak writing and dialogue coupled with my ambivalent feelings about the two different endings. On one hand, I feel the theatrical ending fits the tone of the movie and the premise of the franchise it would spawn better. But on the other hand, there's a featurette on the DVD discussing the alternate ending's themes that made it more understandable for me. Though to be fair, I think the movie worked just fine without a love story. The characters not having much to them beyond being generic high-schoolers, and a teacher, doesn't help matters. Seems like Ali Larter was the only one who had some depth to her in one quiet scene where she talks to Devon Sawa about a family tragedy. Oh, and Tony Todd is one hell of a one-scene wonder. That clunkily inserted last sentence aside, Final Destination is a well-crafted horror-thriller whose scares come from just how easily its memorable death scenes could occur in real life, with any supernatural angle being merely implied and never outright confirmed. Critics might not have liked it all that much but it does have some intelligence lying around, a perk from having crew members from The X-Files on board, I'm guessing."
  },
  {
    "rating": "3/5",
    "review": "The whole premise of this franchise is interesting, I just think it can be executed a lot better."
  },
  {
    "rating": "3/5",
    "review": "The only one in the franchise I actually enjoyed. Its not really a good movie but its an interesting premise and mostly well made. The opening disaster is incredible and unsettling and most of the rest of the film is suspenseful. I dont like how the sequels just became about gory death scenes. Prefer the elaborate and clever Rube Goldberg death setups and wish they had stayed more about suspense than appealing to the cheap shock and gore fans."
  },
  {
    "rating": "4/5",
    "review": "I like the movie but as a young gay back in 2001 I wish they've made a scene where there's a young boy who will touch Alex or Carter's crotch. I wonder how those two Teenage boys of the early 2000s will gonna react on that situation?"
  },
  {
    "rating": "2/5",
    "review": "A ideia do filme é sensacional, mas acaba caindo nos clichês desses filmes dos anos 2000, tem mortes critativamente estranhas e um final tosco"
  },
  {
    "rating": "3/5",
    "review": "Final Destination is creepy and enjoyable. Movie's concept was new, \"Death is coming for you even if you try to cheat it.\" Movie showed deaths using everything we do or see at home. The way deaths happened, you may get frightened and think what if this happens in reality. The direction is little bit weak and acting could also been much better. These things doesn't bother you as you are busy enjoying the thrill and drama. This movie gives mixed feeling of horror, drama and thrill. Overall, will recommend everyone to give it a try."
  },
  {
    "rating": "2.5/5",
    "review": "Entertaining enough, helped to watch this movie since I watched the franchise in reverse"
  },
  {
    "rating": "4/5",
    "review": "One of my childhood movies that I never get tired of watching it."
  },
  {
    "rating": "3.5/5",
    "review": "fast paced and fun. keeps you wondering how it will all end."
  },
  {
    "rating": "3.5/5",
    "review": "Just for the original and bright concept it brought to the slasher genre the movie is far from average and has become a classic. It has gotten old on some subparts but mainly still holds pretty well working on different levels. The actors do the job, the direction is not obviously great and just fonctional but everything combine makes it work as a guilty pleasure."
  },
  {
    "rating": "3.5/5",
    "review": "Final destination 1 26.1.21 Have seen this before but not for a long time. Forgot how completely preposterous it was. But you can't take your eyes off the screen just waiting for how the 'accident' fits together. Mental, just completely mental. But good, so good, like picking a scab when it's not quite ready to come off. 6.5/0. D.B."
  },
  {
    "rating": "4/5",
    "review": "Final destination is a good start for a fun and silly franchise that have insanely entertaining gore."
  },
  {
    "rating": "5/5",
    "review": "Final Destination is a show of scares and moments of tension, favorable performances and a dignified script."
  },
  {
    "rating": "4.5/5",
    "review": "Creepy and Real This movie was frightening for one simple reason, it isn't afraid to go the route of talking about death, fate and if the inevitable is really unavoidable or if deaths plan can be fathomed and subsequently outwitted. The opening scene is downright scary, come on who hasn't got on a plane and wondered if it would crash, and let me tell you I am not in a hurry to get on one now. Thought the story is a little contrived and a bit predictable(though that is part of the story) the effect is still the same. The movie is not, despite what you may hear, a teen flick, if you're a horror fan from any generation trust me you'll like it as long as you go in wanting to see it and willing to actually think about the film and follow the story line. Trust me on this one and give it a shot."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was good, however a lot of the characters where very stupid and corny. The story was pretty good though."
  },
  {
    "rating": "3.5/5",
    "review": "A decent horror flick with a good cast and engaging storyline that delivers thrills and chills at every corner."
  },
  {
    "rating": "0.5/5",
    "review": "Filme fraco, péssimas atuações, típico filme ruim dos anos 2000, perdi meu tempo"
  },
  {
    "rating": "0.5/5",
    "review": "A film with no narrative or artistic merit, meant to tittilate those who derive enjoyment from meaningless death and violence."
  },
  {
    "rating": "3.5/5",
    "review": "HEY TEENS LOOKING FOR HORROR/SPOOKY SEASON WATCHES! i'm tired of seeing cranky adults' reviews on these horror films so i'm going to give my perspective as a teen. i recommend watching it with some friends, maybe poking fun at it a little, idk. personal ranking of final destination movies: fd3, fd1, fd2, fd5, fd4 the first three are worth watching, especially if you're a lover of horror movies like me. you can watch them alone or maybe w a group of friends, and you can make fun of the characters and their decisions (my favorite). the fourth and fifth ones suck, ngl, but the fifth one does have a SATISFYING ending especially if you've seen all of the movies. anyways, watch it. enjoy spooky season!"
  },
  {
    "rating": "2.5/5",
    "review": "Pretty bad horror type death movie starring random 20 year olds and a movie franchise that is way too long."
  },
  {
    "rating": "3.5/5",
    "review": "I see the audience likes this better than the critics. I'm not a fan of horror typically, but I was drawn to watch this because of premonitions that I had personally experienced that shook my understanding of reality. This movie goes in that direction, but in the movie, destiny is evil , unforgiving, and out to get you. Whereas in my experience, it just is. The phenomenon of clairvoyance or sixth sense is real enough for both the CIA and the Soviets to study it for decades. And there are documentaries on that. The ancient Greeks and Romans also believed in oracles--and fate. Are we meant to know everything? I don't think so. Full reality is beyond the capacity of a human brain to sense. And wouldn't it be overload? Our senses detect just enough for us to function and interact. What happens when you sense too much? Movies about that interest me. This stays more on the horror side of it. I'm more into the science, but faith plays a role too. So I'm drawn to something like The XFiles."
  },
  {
    "rating": "2.5/5",
    "review": "The first Final Destination film partially squanders its interesting premise and some good death scenes with horror cliches and weak acting from its cast."
  },
  {
    "rating": "5/5",
    "review": "chilling, scary, gory, and has a good premise= A dam good time"
  },
  {
    "rating": "3.5/5",
    "review": "Though some of the characters were being a bit dumb. Final Destination had a interesting premise and a good plot. P.S. I will never look at death the same way again (LOL)"
  },
  {
    "rating": "1.5/5",
    "review": "Death itself being the serial killer that is stalking and killing a bunch of kids who dodged their appointed time to die, is an interesting concept. At least it was a new spin on a horror film of this type after the glut of Scream knock-offs that had been littering theaters throughout the late 90s. However, the idea is not realized in an effective fashion with Final Destination. Considering the number of ways we all could die any given day of the week, it becomes downright comical watching the Rube-Goldberg methods that death implements to take down these kids. The movie seems to think we’re supposed to be tense and frightened when a splash of water is making its way across the floor in order to make someone slip and fall, but I could only chuckle. In fact, there’s one death that is so elaborate that I felt like it was pulled from a Naked Gun movie. There were definitely other times when the film went so over-the-top that it felt like they were going for comedy. The most blatant is the ridiculous scene in the morgue where Tony Todd explains the premise of the film for us in case we didn’t understand yet. Maybe the tone would have worked better if they hired at least one good actor. However, Final Destination is overflowing with young people straight out of Central Casting. Not one of them effectively conveys an emotion, with the possible exception of Ali Larter who might be trying a little bit. Devon Sawa, who plays the lead character, is arguably the worst of the bunch. There’s nothing likable or endearing about his performance, to the point that I was kind of rooting for him to die earlier. I can applaud the attempt these film-makers made to think outside the box, but the end result of Final Destination is not good."
  },
  {
    "rating": "2/5",
    "review": "An interesting premise quickly becomes an unintentional comedy as it goes on."
  },
  {
    "rating": "4/5",
    "review": "This is like Scream but not quite like Scream do you get what I mean"
  },
  {
    "rating": "3.5/5",
    "review": "It's good, very good, it's violent, one of the best in the series, i just hated the acting, there are a lot of cheesy performances in this movie"
  },
  {
    "rating": "4/5",
    "review": "Fulfils its conceit well in the writing, lots of fun, nicely shot and edited."
  },
  {
    "rating": "2/5",
    "review": "Forgot about this dumb thing"
  },
  {
    "rating": "3/5",
    "review": "Are you in control of your destiny? That is the question in this movie that tells the story of a group of teenagers that are marked for death by the Grim Reaper himself, after exiting a plane that was supposed to explode and claim their lives. Tony Todd has the standout performance as the creepily medical Coroner, who appears to be more than he says he is (we never know though) It was alright, it could have been a lot better. I wish they would have explained more why only Alex had the visions (making him “the chosen one”)A lot of cringe dialogue moments in the middle, but the gruesome deaths are crazy. if you’re into those kind of movies, then you will like this."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing movie!great suspenseful and thrilling.good acting and story the ending was amazing kept me guessing who's next and little little steps were creepy to look!entertaining movie."
  },
  {
    "rating": "5/5",
    "review": "com certeza um clássico absoluto , Premonição 1 ou Final Destination 1 é simples ,direto , atmosférico , violento , surpreendente e impressionate , com certeza foi um soco na cara de sexta feira 13 , a hora do pesadelo e outras sagas exageradas! tudo nesse filme é bem legal , atuações , roteiro , direção , fotografia e trama !"
  },
  {
    "rating": "4/5",
    "review": "With a interesting plot to separate it from the usual slasher formula with masked killers or monsters, Final Destination helps bring to life the familiar fears of natural causes from flying to never trusting what the future will bring us while also showing us a good cast and payoff for the first installment in a newly made franchise~"
  },
  {
    "rating": "3.5/5",
    "review": "It's a good film and story."
  },
  {
    "rating": "4/5",
    "review": "I always found this to be a quite a unique and fun horror film, and the whole franchise is definitely a guilty pleasure of mine."
  },
  {
    "rating": "4/5",
    "review": "Although dull and unrealistic at times, Final Destination is mostly a fun and suspenseful movie."
  },
  {
    "rating": "5/5",
    "review": "This movie kept me on the edge of my seat. It was a wild ride beginning to end!"
  },
  {
    "rating": "3.5/5",
    "review": "Lots of fun and laughter, but leaves u suitably uncomfortable putting the lights out and going to bed"
  },
  {
    "rating": "1/5",
    "review": "This film has a good premise, but the rest is boring and dull. I never got intreed in the story, and I'll probably never watch this again. Grade: D-"
  },
  {
    "rating": "4.5/5",
    "review": "Final Destination is made into and instant classic with the directing and writing talents of James Wong and Glen Morgan; as well as the good practical effects, creativity, and entertaining performances."
  },
  {
    "rating": "2.5/5",
    "review": "Ridiculous, unrealistic, coupled with some very bad acting, I'd give this film 1 star. But if u look at this film as a \"horror comedy\" then I guess it ticks all the right boxes, so for that I'd give an extra star, plus I found it to be somewhat mildly entertaining, so I guess I'll give an extra half-star. Final rating: 2 and half stars (And that's me being VERY generous)"
  },
  {
    "rating": "1/5",
    "review": "Devon Sawa & Kerr Smith were terrible actors. It may have started the awful bus deaths in tv & movies..... or that could've been Meet Joe Black."
  },
  {
    "rating": "3/5",
    "review": "Certainly not a bad horror film by any stretch. It has an interesting and unique premise as it plays like a slasher film but the killer is death itself. While it may not elevate to high levels of entertainment, it does everything well enough to keep fans of 90's horror films interested."
  },
  {
    "rating": "3/5",
    "review": "You its so bad on so many levels that i ended up laughing so much and enjoyed the heck out of this."
  },
  {
    "rating": "5/5",
    "review": "I don't know why it has a bad review.... because it was incredible!"
  },
  {
    "rating": "5/5",
    "review": "This is a great movie with good death scenes and an original idea. It is a classic for sure that is just a fun ride."
  },
  {
    "rating": "3/5",
    "review": "It had its suspense and terrifying sense of \"the thousand ways to die\" kind of saying. But at the expense of an at least stellar storytelling, I'd say the acting and decent script pulls off a rather mediocre gore-fest movie than anything."
  },
  {
    "rating": "5/5",
    "review": "Amazing Movie, Loved every scene, It's a must see."
  },
  {
    "rating": "3.5/5",
    "review": "Critics always judge horror/thriller movies harshly. This isn't the best movie, yet, its still enjoyable."
  },
  {
    "rating": "4/5",
    "review": "The Final Destination, may be a more corny and unsatisfying movie but at times the movie offers some thrills."
  },
  {
    "rating": "5/5",
    "review": "this was the first horror movie i ever watched, and boy was it good. it features a lot of suspence and leaves the viewer still thinking about the movie well after watching."
  },
  {
    "rating": "1.5/5",
    "review": "Somewhere buried deep in the film's premise lies the kernel of an intriguing idea - and that's Final Destination's lone good point. What happens if someone on board a plane has a premonition of disaster, flees from the aircraft before takeoff, then watches in horror as it explodes once it is airborne. Of course, it takes about ten minutes for it to become apparent that Final Destination is only going to use this as a hook. The point of the movie has nothing to do with how the survivors cope with guilt and uncertainty. Instead, Final Destination is intent upon illustrating that, while it's possible for seven people to cheat death by disembarking from a doomed plane, the Devil still demands his due. So, with John Denver singing in the background, they start dying one-by-one. Even the special effects are no good. Near the beginning of the film, as Sawa's character, Alex, has a vision of the plane's destruction, we are treated to the same kind of visuals used several decades ago when Christopher Reeve's Superman took to the air. Later, for a beheading scene, the decapitation is so ineptly done that I found myself choking back laughter. Moments like that make you wonder if this film could have had a chance as camp. Unfortunately, the somber, serious tone deflates any hope of this."
  },
  {
    "rating": "3.5/5",
    "review": "una idea muy original un gran clasico."
  },
  {
    "rating": "1/5",
    "review": "Stupid, silly and gory."
  },
  {
    "rating": "5/5",
    "review": "The idea can be considered fresh at the time when the movie was released. One of my favorite horror movies of all time! Recommended for all horror movie fans."
  },
  {
    "rating": "4.5/5",
    "review": "\"Final Destination\" tem um bom enredo, as cenas das mortes são impressionantes e o elenco é razoável. Algumas partes são estranhas, mas, fora isso, o filme é muito bom."
  },
  {
    "rating": "2.5/5",
    "review": "Pretty bad horror type death movie starring random 20 year olds and a movie franchise that is way too long."
  },
  {
    "rating": "2.5/5",
    "review": "Final Destination unfortunately suffers from a lack of real suspense and too many outlandish deaths."
  },
  {
    "rating": "3.5/5",
    "review": "A unique movie that stands out in the horror genre, even though the characters could use more development."
  },
  {
    "rating": "1.5/5",
    "review": "Not the best film, the successor is much better."
  },
  {
    "rating": "2.5/5",
    "review": "Brilliant opening scene but sadly the rest of the film largely wastes the great setup. I would give 5 stars for the opening scene and around 1 for the rest."
  },
  {
    "rating": "2.5/5",
    "review": "Inicialmente no es una mala idea es una interesante cinta que trae tal ves un concepto fresco al genero, ahora su cojeante ejecución lo hace ver bastante debil al acabar , no se puede traer mucho de este film ya que esta de por si un poco a medias su dirección y actuaciones, pero su guion es lo que hace resaltar este film que es basico en muchos aspectos."
  },
  {
    "rating": "3.5/5",
    "review": "I have seen this movie multiple times and the fact now 18 years have gone by the effect the movie has has kind of diminished now. Yes the movie is cheesy, the dialogue awful and some acting woody, but back in 2000 this was such an original movie and a spawned a new dawn in horror and many sequels. Devon Sawa who reminded me of a young Simon Le Bon (Duran Duran) never really made it to great success. None of the cast did really. Out of the all movies, I preferred Final Destination 2. Still good to watch again. Probably my Final watch on this now."
  },
  {
    "rating": "2.5/5",
    "review": "Movies premise was interesting. Plot was very consistent and the movie was fast movie and smooth. Yet there was a lack of character development between some of the characters but a decent development with the Man and the two girls. However the events in the film were kind of tacky and cliche some weren't logical and had little reasoning. The plot also didn't describe the antagonist (death) so much. Like how do these events unfold without a plot or meaning behind them. Overall the movie is okay and had a lack of things that made me give this rating."
  },
  {
    "rating": "3/5",
    "review": "iT WAS GREAT BACK IN THE DAY, AFTER A RE-WATCH....NOT AS GOOD BUT STILL A GREAT WATCH."
  },
  {
    "rating": "3/5",
    "review": "Strengths: The premise is a cool one. It feels mostly original and sets you up for a film filled with suspense. Here, the deaths are mostly well done. They get gory and more gruesome as the series goes on, but theyâ(TM)re mostly realistic and look good here. One character gets beheaded and it looks way better than it has any right to in 2000. Devon Sawa (Alex Browning) gives a surprisingly strong performance as the lead, while Ali Larter (Clear Rivers) and Sean William Scott (Billy Hitchock) are both fine. The movie also works as a good time capsule for the era it was released in. Lastly, I appreciated that the movie mostly didnâ(TM)t try to do too much. Itâ(TM)s just a fun, guilty pleasure. Weaknesses: Some of the scenes are way over dramatic and come off as cheesy. The big climax where Alex saves Clear will make your eyes roll with how lame it is. Not only does it come across as lame, but it feels unsatisfying and not the way you want things to end. Other than the cast I mentioned, everyone else is doing a pretty bad job. Seriously, thereâ(TM)s poor line delivery and bad acting galore. Overall: As I said, this is a guilty pleasure. Itâ(TM)s not going to wow you with acting or writing. It is cheap fun thanks to a really cool concept and mostly strong execution."
  },
  {
    "rating": "5/5",
    "review": "Death list haunted you and would never allow to escape. The old movies never really get old, ain't they?"
  },
  {
    "rating": "3.5/5",
    "review": "Good movie but not the best"
  },
  {
    "rating": "4/5",
    "review": "My favorite part from all of the Final Destinations."
  },
  {
    "rating": "2.5/5",
    "review": "The concept of the film is really good and I mean it well. The rest is very poor."
  },
  {
    "rating": "4/5",
    "review": "I think this is a feel-good comedy. It's like a young adult movie about accepting the inevitability of death but it's fun. I think the critics are missing the point of this movie. It's not supposed to be terrifying or character driven. It's just pure entertainment with the simple and obvious message which is, \"you can't cheat death.\""
  },
  {
    "rating": "4/5",
    "review": "I love the Final Destination series of films. I don't watch a lot of Horror films but I like Final Destination because it doesn't feel like horror, more like a thriller or a dark drama. It's a very clever concept: the idea that you can escape death but it will come back to get you, and that Death has a pattern. Of course we probably watch these films just to see in what grizzly ways the characters are going to die."
  },
  {
    "rating": "3.5/5",
    "review": "The dialogue is terrible, but it's fun mousetrap murder with a good base mythology."
  },
  {
    "rating": "1.5/5",
    "review": "'FINAL DESTINATION' was directed by James Wong and stars Devon Sawa, Ali Larter and Kerr Smith. ?After a student(Devon Sawa) visions the plane he's about to board explode, he throws a fit and gets him and a group of his friends kicked of the flight. Second into the air, the plane explodes. All seems fine but when the survivors begin getting knocked off one by one, they must band together to discover the truth. Don't watch this movie if you're looking for a genuinely frightening and scary experience - you WILL be disappointed. This movie is more comedic than anything. I laughed so much more than I felt frightened. Now I think about it, I wasn't frightened at all. I wasn't even disturbed by the deaths. It was all just kind of dull. Watch this movie if you're drinking with friends because you will have a laugh, just don't watch it if you're looking for a horror movie. I really like the gimmick of this movie. It's pretty interesting and I would love to see it be explored more, with a different cast and director. The actual story itself was very poorly written. Character's are stupid and this makes it very hard to care about them. A lot of the things that happen in this movie make no sense and the deaths itself contain no logic behind them. I understand they tried to excuse it but there should still be logic and setup to each kill to justify it. Maybe even include red herrings; keep the viewer guessing. Another flaw with the deaths is how generic and boring they are. Needless gore and violence is the one thing I would remove from movies today if I could; it's sick and never works. That said, I would have actually liked to see more creativity and thought put into the deaths. Keep it comic violence and make the movie a full blown comedy; that'd be fun. The only performance in this movie that wasn't completely robotic and forgettable was Kristen Cloke as Valerie Lewton. Even that performance was just barely passable. The rest of the acting was pathetic. Devon Sawa was shocking, Ali Larter was abysmal, Kerr Smith tried but failed - no one impressed me and only one person barely escaped my scold. Every movie like this were the cast are getting picked off one by one needs to include likable characters to make me want them to live or an interesting antagonist to make the deaths interesting. This movie succeeds at neither. The characters are dull, bland and forgettable, and the antagonist(I won't spoil it) doesn't appear for the entirety of the movie. This lack of good characters makes me actively dislike the characters and means I don't care if they die which means I have lesser interest in the movie. This movie hit the trifecta of trashy cinematography. It was badly lit, shot and edited. Nothing in this movie is technically proficient. The effects are also atrocious. I don't care if it was made in the year 2000, realistic dinosaurs were made in 1993. This movie was not at all frightening(if anything, it was comedic). I laughed a lot in this movie due to the clichés and lack of genuinely frightening moments. There is a scene towards the end were I should have been on the edge of my seat but I was on the verge of crying with laughter. For what this movie is attempting to do, it fails. But for sheer entertainment value, I'll recommend this movie. Watch it with some friends. I'll rate it 3 Expert Getaway Strategies out of 10."
  },
  {
    "rating": "4/5",
    "review": "If your expecting super gore like they have in the 4 sequels, you won't get that. This film is great. It's suspenseful without being too violent. If you want to see the Final Destination films but don't like violence, check this one out. The acting was great in this film. The soundtrack was also chilling. Seann William Scott's death is my favorite out of all the ones in this film. If you like horror/thrillers, check this one out. Rating: 8.2/10"
  },
  {
    "rating": "2.5/5",
    "review": "This film had a definitely inserting concept, that a group of teens who have \"cheated\" death after abruptly departing an airplane that ends up exploding upon takeoff, who then find themselves fighting for their lives as death stalks them in the form of a series of elaborate fatal and/or near fatal accidents and mishaps (ranging from seemingly simple bathroom slip and falls, to downed power lines, to elaborate car and train sequences). The film was written and directed by \"X-Files\" veterans Glen Morgan and James Wong, so from a technical standpoint, it's a well crafted film with excitement, suspense, and thrills. However, I'm not sure the film's premiss was enough to sustain a feature length film. It also doesn't help that the characters are not all that interesting, though it is kind of fun to see a young Ali Larter. Overall, this film this lacked story and characters to sustain itself, but the elaborate death sequences were interesting and suspenseful enough to hold my interest and make the film worth watching."
  },
  {
    "rating": "3/5",
    "review": "\"A guilty pleasure for everyone to enjoy, not matter who you are.\""
  },
  {
    "rating": "3.5/5",
    "review": "It's good horror movie"
  },
  {
    "rating": "2.5/5",
    "review": "A horror movie with out horror and with bland as hell characters Final Destination is a pile of bull."
  },
  {
    "rating": "3/5",
    "review": "fun horror movie with some great scenes and a cool premise. there is some cheesiness and some random signs that seem irrelevant but still enjoyable. (about 3 viewings)"
  },
  {
    "rating": "2/5",
    "review": "not a bad movie, but entertaining for reasons not entirely intended: it's not so much a horror/thriller as much as it's a dark comedy. seriously, the story is goofy, the setups chiché, and the actin only on par. on the other hand, if you go into this movie expecting a laugh, you probably won't get much out of it either. still, it's at least entertaining."
  },
  {
    "rating": "2.5/5",
    "review": "In an attempt to showcase death itself as the true antagonist of horror, unrealistic gore and uninspired, predictable plotting overwhelm the promising setup and thought-provoking message Final Destination has to offer, squandering an intriguing concept for a unique franchise as a result."
  },
  {
    "rating": "1/5",
    "review": "The idea may be a bit intriguing, but the execution falls way beyond short. The death scenes which are what the series is most iconic for are very lacking. I understand they beefed them up for squeals, but I can't imagine why they would since this movie is so underwhelming. And the acting, the acting in this is atrocious. No one delivers a believable or motivated performance. It is the text book definition of bland acting, not caring in the slightest. I thought the original would be better than the sequels, yet somehow it may be worse. What a waste."
  },
  {
    "rating": "3/5",
    "review": "Kind of fun, but ultimately cheesy teen horror movie with strong 90s vibe."
  },
  {
    "rating": "3.5/5",
    "review": "What saves this film is the fantastic skill shown in the development of palpable tension and suspense."
  },
  {
    "rating": "3.5/5",
    "review": "it was entertaining with an interesting story line. Not much to complain about."
  },
  {
    "rating": "3.5/5",
    "review": "Final Destination has a pretty cool concept, and in the first movie, it's executed pretty well. Also, the actors were better in the first film. Overall, a pretty good flick! 3.5/5 OR 7/10"
  },
  {
    "rating": "5/5",
    "review": "Strangely, a wonderful horror film. A death romp with a larger story behind it that works. Fun characters that have their own personalities, some of which you're excited to see die. All in all, a good film, and a perfect massacre."
  },
  {
    "rating": "3.5/5",
    "review": "Decent movie to start the Final Destination series. The concept is pretty cool. The best thing about this film is watching sequence of events that ultimately lead to someone's death."
  },
  {
    "rating": "3.5/5",
    "review": "It is okay but I always get pissed off by every single film sequels."
  },
  {
    "rating": "2.5/5",
    "review": "Final Destination has a outstanding plot but it all goes away with actors that didn't make their performances believable and didn't cause any thrills for the audience the more times you watch the movie the more boring it gets."
  },
  {
    "rating": "1.5/5",
    "review": "In an admirable attempt to deem Death itself the true antagonist of horror, unrealistic gore overshadows Final Destination's innovative concept, and is ultimately little more than a testament to how special effects have drastically replaced serious-minded creativity."
  },
  {
    "rating": "4/5",
    "review": "Apparently, the writers of the X-Files wrote this movie. And they did an excellent job on it ! In my personal opinion, this is the best horror ghost movie of 2000. It's well paced and has great and original story to it. Just like Roger Elbert said, this is really one of the smarter modern horror teenage movies. And the deaths scenes for the characters and over the top, very creative. Recommended !!"
  },
  {
    "rating": "3/5",
    "review": "I expected this movie to have over the top gore with its reputation but to my surprise it wasn't bad at all. This is your typical horror/suspense film and I enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "I loved it and made me paranoid...LOL"
  },
  {
    "rating": "3.5/5",
    "review": "A unique take on the otherwise overplayed genre. Suspenseful, entertaining and enough heart to make us really care about the characters."
  },
  {
    "rating": "3.5/5",
    "review": "4 - What an awesome premise. The movie has quite a few surprises and even manages to scare along the way too. Imho it gets most of it's *'s from the unexpected twists and surprises. This movie is good right up to the last second."
  },
  {
    "rating": "3.5/5",
    "review": "All very new and creative in the first one."
  },
  {
    "rating": "4/5",
    "review": "I really liked this movie. It was like if you mixed a teen movie with a few X files episodes. There was a lot of cool (but a bit overdone) death symbolism. The first scene with the plane was very cool."
  },
  {
    "rating": "5/5",
    "review": "This franchise is how we should all question our every move"
  },
  {
    "rating": "3/5",
    "review": "Fun horror flick for the whole family! Just turn off your brain and enjoy. If you expect any degree of depth or a good story, this one isn't for you."
  },
  {
    "rating": "3.5/5",
    "review": "I like the Final Destination series, so I just thought that when I rewatch them again, I'll review them. So for Final Destination, it's a really good movie. The story of it is very original and can be very scary if it actually happens. This is probably the closest moment for me that actually thinks that death is causing all of this, instead of just natural occurrences by people's dumb mistakes in the later films. The deaths are creative, and the characters, while not much developed, are smarter than your usual horror characters, at least for the main character that is. The acting is serviceable, even though there were some who acted a bit off here. The effects are fine, and the premonition in the beginning is really good and intense. The humor can get a little lame at times, but the writing overall is really not bad. Final Destination is not high horror, but it's an entertaining one that doesn't go for the gore and is more about the story."
  },
  {
    "rating": "4/5",
    "review": "Surprisingly good movie that started a great franchise."
  },
  {
    "rating": "4.5/5",
    "review": "An exciting film with the grim reaper as the murderer, a different film from others, lost its reputation because of the un-needed sequels. Very good thrilling suspense film."
  },
  {
    "rating": "4/5",
    "review": "I quite enjoyed this it was very twilight zone you can't cheat death Plot What if you can see the future and there was way that you could change the out come but every change you more people die fate Great story and suspenseful Visual effects were great Worthwhile watching"
  },
  {
    "rating": "5/5",
    "review": "#makes me paranoid. #Stiffler from American pie gets decapitated by piece of scrap metal"
  },
  {
    "rating": "3.5/5",
    "review": "tão bom quanto o 2, so as mortes que são ruins são muito fracas como atropelamento,e estrangulamento bem diferente dos outros filme que tem até empalamento por um cano"
  },
  {
    "rating": "3/5",
    "review": "The movie has a new and interesting plot it's not that clichÃ (C) story about a slasher and revenge no it's much more original and unique and may be the ending may have been dull and fast but at least the movie is trying I mean this movie is so original that the killer isn't even human it's more like the killer is faith"
  },
  {
    "rating": "3/5",
    "review": "This was kinda scary, but nothing to brag home about!"
  },
  {
    "rating": "3.5/5",
    "review": "Intriguing and violent with creative kills. Final Destination may not have the best acting or dialogue. But it's unique and intelligent premise and horror carnage will definitely appeal to genre junkies and some norms"
  },
  {
    "rating": "1.5/5",
    "review": "Why exactly was this so successful?"
  },
  {
    "rating": "2.5/5",
    "review": "This movie can be a little predictable, but his great cast and the original story are enough to forget that. Final Destination try to transmit the message that all of we have a destiny and can't escape to it, but this attempt to transmit the message is destroyed for is weak argument, because all of we know that the water won't follow a specific path on the floor escaping to the laws of physic. Interesting."
  },
  {
    "rating": "2.5/5",
    "review": "This movie can be a little predictable, but its great cast and the original story are enough to forget that. Final Destination tries to transmit the message that all of we have a destiny and that we can't escape to it, but this attempt to transmit the message is destroyed by its weak screenplay, because all of we know that the water won't follow a specific path on the floor escaping to the laws of physic. Interesting."
  },
  {
    "rating": "4/5",
    "review": "Such an original concept for the time. It had some very unique kills and kept me on the edge of my seat."
  },
  {
    "rating": "3.5/5",
    "review": "I am shocked at how much I enjoyed this piece of nonsense. The sense of humor was wonderfully dark, having Tony Todd, Mr. Candyman himself, in a wonderfully dark cameo, naming characters after greats of horror cinema past and having the most elaborate and amusing death scenes in recent memory. I can't wait to watch the other 4."
  },
  {
    "rating": "4/5",
    "review": "Honestly, this is a very well made horror movie! The story is interesting and I haven't seen a movie with a similiar plot, so it's deffinetely original. The characters aren't that interesting nor the actors can act amazingly, but the amount of intrigue and enjoyment in this movie is pretty high! I really liked this movie and I hope the sequels are as good, if not even better. The ending left some questions unanswered, but it was very satisfying to say the least. The gore and violence is not the most gruesome but it is certainly disturbing at a few times. All in all, a very intriguing movie with not so intriguing characters and shaky acting, but the movie is saved by its plot and I can't wait to see the sequels!"
  },
  {
    "rating": "4/5",
    "review": "Final Destination is the very first installment in one of the most popular horror franchises of all time, and I honestly think it's pretty good. Lacking the slasher genre and having a more unique element of horror and death, Final Destination is a very well done horror film that is very interesting and entertaining."
  },
  {
    "rating": "3/5",
    "review": "A good thriller movie."
  },
  {
    "rating": "4.5/5",
    "review": "A great story I love the concept. This movies idea alone is enough to make you love it. It may not have an outstanding cast but I promise you if you put Jake Gyllenhaal in this lead role people would love it even more. Regardless I love this movie."
  },
  {
    "rating": "3.5/5",
    "review": "Even though Final Destination runs out of steam in the third act, it's a really interesting film with tons of terrifying scenes. If you haven't seen it by now I'd suggest you check it out. 73/100"
  },
  {
    "rating": "3/5",
    "review": "If the acting and overall premise had been stronger, FINAL DESTINATION would have been one of the greatest horror films, but that doesn't take away from an intriguing idea and impressive, yet comic death scenes."
  },
  {
    "rating": "5/5",
    "review": "one of the best movies it brought a new genera of horror movies and not the aame old slasher movie"
  },
  {
    "rating": "4/5",
    "review": ".ÃÂ¢Ã,Â¦ÃÂ¢Ã,Â¦ÃÂ¢Ã,Â¦Ã¢Â¦â¦"
  },
  {
    "rating": "3.5/5",
    "review": "The first in the franchise. Good to see where things started out. 3/8/15"
  },
  {
    "rating": "4.5/5",
    "review": "Very interesting story and creative deaths that are quite different from the typical murders that are in horror films."
  },
  {
    "rating": "4/5",
    "review": "the best of the six in my opnion"
  },
  {
    "rating": "3.5/5",
    "review": "70% ---------- 3.5 - Devon Saw 3.5 - Ali Larter 3.0 - Seann William Scott 3.0 - Chad Donella 3.0 - Daniel Roebuck 3.0 - Roger Guenveur Smith 3.0 - Kirsten Cloke 2.0 - Amanda Detmer 2.0 - Kerr Smith"
  },
  {
    "rating": "4.5/5",
    "review": "15 years now on tv the important critics on here should have there final destination they got it wrong there sacked"
  },
  {
    "rating": "3/5",
    "review": "***Due to the recent RT changes that have basically ruined my past reviews, I am mostly only giving a rating rather than a full review.***"
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed the supernatural slasher concept. Although, it makes no sense, I hope it is explained in later films. Also, there are strange time gaps between the main characters' deaths that isn't explained or why a group is taken out in the beginning then time passes, individuals, then time passes and one more person and the death skip concept is confusing."
  },
  {
    "rating": "1.5/5",
    "review": "Pretty mediocre the sequels are a lot better overall I wasn't having that much fun but there is very cool death scenes and overall mediocre movie with cool death scenes Grade C-"
  },
  {
    "rating": "3/5",
    "review": "eh it is what it is not horrible. The first of its kind and many to fallow most did get Better. did really enjoy this cast"
  },
  {
    "rating": "4/5",
    "review": "Cla greag supernatural film!"
  },
  {
    "rating": "4/5",
    "review": "A guilty pleasure as blood and mayhem wreck the screen. Sure little on plot, but enough to entertain."
  },
  {
    "rating": "3.5/5",
    "review": "A premise that's a guessing game to details with points of thrilling and trying to be obviously suspense while the teens were typically being energetic like when a new film starting something that they're unaware what they're in for, it's a ridiculous violent teen horror flick like the soul of the franchise antagonist Death being melodramatic sometime. (B) (Full review coming soon)"
  },
  {
    "rating": "5/5",
    "review": "James Wong, proves if you cheat death, death will come back and bite you in the butt. Creative deaths make to be an awesome horror flick"
  },
  {
    "rating": "3.5/5",
    "review": "I hate it when someone finally comes up with a brilliant premise for a movie, but wastes it by not executing it to its fullest. This movie sizzles with its idea alone, but remains low with the poor execution. Sadly, it does not ever pick up where it should have been."
  },
  {
    "rating": "1/5",
    "review": "I loved this movie as a kid/13 year old, this one and it's sequels (which I will review next) were one of my favorites at the time. I kind of forgot these movies existed for a while (really well done if you forget all about it right?) Of course I see now what a piece of garbage it is and now I'm almost embarrassed to say I enjoyed it. It is so painfully written I wouldn't be surprised if the actors cried while saying their lines. You really can't blame the actors though for all of the poor performances... all they had to go off of what James Wong calls a \"script\". You'd think with a movie so original it'll at least be fun? hahahahhaha.... right? There's no time to get to know any of the characters since it's so rushed so none of them are enjoyable or entertaining or have any development for that matter."
  },
  {
    "rating": "3/5",
    "review": "\"Final Destination\" is completely silly and over the top, but at the end of the day, it's a guilty pleasure that is fairly entertaining.Â  The movie is overacted and the dialogue is pretty ridiculous. However, the sequences where characters face peril are pretty thrilling and kept me on the edge of my seat. It's a movie that delivers what it promises and is entertaining to watch. It's far from art, but I had a good time with it due to its genuine thrills and creative concept. I think it delivers solid entertainment that horror or thriller fans should check out at least once."
  },
  {
    "rating": "3/5",
    "review": "I own all of the movies because I enjoy them, not because I think they are amazing or anything. Enjoyable."
  },
  {
    "rating": "4/5",
    "review": "This film is great, however, as being the first one, the deaths are not as gory or awesome as the ones in later films. The story line is really good though."
  },
  {
    "rating": "3.5/5",
    "review": "good movie but death is the killer. really? death?"
  },
  {
    "rating": "5/5",
    "review": "love this movie. dont know why it is rated low."
  },
  {
    "rating": "3.5/5",
    "review": "http://criticascommedo.blogspot.pt/2014/06/final-destination.html"
  },
  {
    "rating": "2.5/5",
    "review": "Final Destination isn't visionary substance. It was made for cynical misanthropes to laugh and it's teenage audience demographic to shriek. This film does just that and I for one belong to the former. If you are both interested in a gore fest and are a prodigal of time, I highly recommend it. To all others, I advise you take a detour and watch/re-watch Christopher Nolan's brilliant thriller Memento."
  },
  {
    "rating": "3/5",
    "review": "A clever spin on the genre with some nasty kills and one sexy Ali Larter. What's not to like?"
  },
  {
    "rating": "3/5",
    "review": "Would of been nice 14 years ago"
  },
  {
    "rating": "4.5/5",
    "review": "In comparison to the rest of the series, the original seems to be the best at incorporating the gruesome deaths into the plot and the character personalities. It also features the most sentimentality and distress felt through acting."
  },
  {
    "rating": "3/5",
    "review": "Cheesetastic 2000s goodness."
  },
  {
    "rating": "2/5",
    "review": "Unfortunately not the solid movie it could've been. First of all the acting is quite cheesy which could be accepted for this kind of film but what really annoys me is that they took a good idea and somehow destroyed it. What was impressive though is the scene with the plane that promises to stay in your mind. If you take it too serious you may not wish to go on a flight the next time."
  },
  {
    "rating": "3.5/5",
    "review": "loved this movie when it came out..and i still do."
  },
  {
    "rating": "2/5",
    "review": "Good premise, good cast, good start. But once you figure out the story line (which was early), loses the suspense and horror. Hey, at least it's got Stifler!"
  },
  {
    "rating": "5/5",
    "review": "Extremely entertaining, violent, bloody, intense & truly original."
  },
  {
    "rating": "4/5",
    "review": "Love the inventive death scenes. Little bit predicable but good enough for me to go out and buy the set. The 3D versions are enjoyable too."
  },
  {
    "rating": "2.5/5",
    "review": "A group of teens are on a school trip, when one has a vision after boarding the plane that it will crash. So he causes a scene and gets kicked out and some students stay off the plane. They watch as the plane explodes moments later. They think they are ok, when later they are all being killed in odd situations. They learn the way the plane exploded, they were supposed to die in a certain order, and now death is coming to maintain that order. A really interesting idea, but this was a little silly. A few of the deaths are really over-the-top and cheesy and the dialogue is laughable. It does introduce an interesting concept of one of them being 'skipped', but even that can't help fix what seems like a failed opportunity. Of the teen horror resurgence of the late 90's, I can see why this one has been forgotten."
  },
  {
    "rating": "2/5",
    "review": "*OFFICIAL BETTER THAN EXTREMELY LOUD AND INCREDIBLY CLOSE SEAL* It's too silly to be scary and not silly enough to be entertaining."
  },
  {
    "rating": "3/5",
    "review": "It's quite smart and keeps the tension going, and overall resembles a good original shocker. Yes, we do have a ridiculous plot though."
  },
  {
    "rating": "4/5",
    "review": "Does a good job of building tension most of the time."
  },
  {
    "rating": "3.5/5",
    "review": "It may not be a great and smart movie, but it is a very effective way to create fears."
  },
  {
    "rating": "2/5",
    "review": "one of the rare sequel movies where the first part is probably the worst .. in my opinion."
  },
  {
    "rating": "4/5",
    "review": "One is a little shocked that real life footage of an airplane crash is used in this film, however once it's realized that it is just Americans that are dying then the movie brightens up. Strong acting with emotions banging around an empty can, one can get the drift of the film quickly. Twists and turns and skips add to the excitement of death. Nibbles: Pears"
  },
  {
    "rating": "3/5",
    "review": "Interesting story, keeps you guessing"
  },
  {
    "rating": "4/5",
    "review": "its a really good movie i really enjoyed watching it"
  },
  {
    "rating": "4.5/5",
    "review": "Final Destination is intelligently written and surely has one of the coolest final shots in film history. It is no surprise that the film has turned into a profitable franchise for its studio, New Line. What is a surprise is that the sequels are actually pretty good and they always kick off with an exceptionally well-staged catastrophe which sets the scene for what is to follow.If you are a fan of horror, then 'Final Destination' should definitely be a part of your flight plan!"
  },
  {
    "rating": "2/5",
    "review": "Ah, yet another fine premise hindered by horrible execution. Final Destination, the film that spawned four subsequent installments, may be dumb, but it's dumb fun nonetheless. Sure, it's basically no different than thousands of other young adult movies about kids who have amazing powers (Harry Potter, Percy Jackson, etc), but Destination seems to understand why movies like those are so bad, and even play off of them a little. It's not a spoof, but parts of it are so ludicrous and hilariously over-the-top, it's hard not to laugh. Final Destination stars a plethora of child actors (most of whom will be recognized by any X-Files aficionados out there) as a group of French class students. While en route to Paris for a school trip, a student named Alex has a prophetic vision that the plane they are on will crash, causing him to leap out of his seat, cause a panic, and get off the plane with a few of his classmates. Of course, as it always is in these kinds of movies, Alex is right and the plane blows up on takeoff. This is an epic premise, and gives way to an astoundingly awesome series of events that pits Alex against the FBI, who clearly think the circumstances are a bit suspect. It's got a little bit of that 'question authority' factor that I (as a teenager) enjoy so much in movies. But a lot of the acting is pretty bad, especially from the main characters. It's not like you're supposed to really take the movie seriously, but most of the characters overemphasize their dialogue, making the whole thing feel more like an MTV video than a serious horror movie (which it isn't). This is pretty much the horror equivalent of a Michael Bay movie: Character development is virtually nonexistent, but for clean and unbridled craziness, this is what you want. The deaths themselves are amazingly ludicrous, to the point of outright slapstick humor. I never thought I'd laugh out loud at a woman being impaled by a set of kitchen knives, but I definitely did here. Sadly, this was not really the filmmaker's intent, because the movie is SUPPOSED to be truly scary. However, it's hard to be terrified when you're watching a guy slip on toilet water, fall into his shower, and get strangled by the shower curtain. Not to mention a girl who walks into the street, says \"You can all drop dead,\" and then gets hit by a bus. Shock humor is fun, and this movie utilizes it to no end. By the time the final sequence rolls around (which involves a clothesline and lightning), you're watching a movie so gleefully ridiculous you can't help but enjoy it. But at its core, Final Destination is really nothing more than an empty, fluffy film that just so happens to have an intriguing premise. There's not much else that sets it apart from the pack, no memorable scenes, bad acting, bad dialogue, and some pretty dumb sequences. It pains me to say this, because I actually had fun watching it, but it's nothing more than nonsensical gore and asinine plot points. Its central premise relies on the characters finding messages that death itself sends them, but why does death have a plan OR pattern, and if it did, why would it share it with them? Cheating death is one thing. Cheating the audience, though... that's the anus of cinema. Final Score for Final Destination: 4/10 stars. Much like Kick-Ass, Pacific Rim, and Event Horizon, this is an immensely entertaining movie to watch, and the perfect bargain-buy horror movie rental for a slow weekend. Sure, it's filled with obnoxious characters and confusing death sequences, but that's what movies like this are made for: Hilarious in-home commentary. It's by no means a good movie. However, for outside-the-box concepts and chaotic gore, there's no better place to turn to."
  },
  {
    "rating": "3/5",
    "review": "A cool unique premise about death and fate, but poorly executed. Mildly entertaining though. Bonus points for making me laugh."
  },
  {
    "rating": "4/5",
    "review": "This is really exciting, although it requires a strong stomach as nothing is left to the imagination when it comes to people dying gruesome deaths! I was hooked from the very start as I love films set on aeroplanes, and it just continued from there. The ending was shocking!"
  },
  {
    "rating": "1/5",
    "review": "If you want to watch a movie full of mediocre-acting and all-nonsense gore, then Final Destination is the movie for you."
  },
  {
    "rating": "3.5/5",
    "review": "A fun concept in an overall entertaining though lacking film. The death scenes are pretty suspenseful, but they get confusing. Characters are so-so, and the ending is a bit unsatisfying at the final second."
  },
  {
    "rating": "3/5",
    "review": "Final Destination sports an intriguing premise, and for a while it's actually pretty intense. But where it goes wrong is it takes itself way too seriously for it's own good, as you can only go so far in this movie keeping a straight face, it's just silly fun after a while, and I'm not quite sure it was what they were aiming for."
  },
  {
    "rating": "3/5",
    "review": "Good idea. Not amazing movie"
  },
  {
    "rating": "3.5/5",
    "review": "Interessante A História,E Cenas Fantásticas Da Morte E Suas Presas."
  },
  {
    "rating": "2.5/5",
    "review": "One of my all time favorite horror series. My fourth favorite out of five"
  },
  {
    "rating": "5/5",
    "review": "one of my fav horror movies"
  },
  {
    "rating": "4/5",
    "review": "It may not be certified as a classic in horror cinema but Final Destination is an original story with very clever deaths and riveting performances"
  },
  {
    "rating": "2/5",
    "review": "Add a Review (Optional)"
  },
  {
    "rating": "3.5/5",
    "review": "Unexpectedly chilling with plenty of gore. Great for teen audiences!"
  },
  {
    "rating": "3.5/5",
    "review": "American horror is so often about visible threats that it comes as a bit of a relief to have one film feature an ominous enemy that is never seen, nor heard, norgiven shape. The premise: Devon Sawa plays a high school student who after boarding a plane on route to a high school field trip, has a horrific premonition that causes him and a group of classmates to be expelled from the plane before take-off. True to what he foretold, the plane blows up (in a very shocking scene that cannot be shaken off so easily). The survivors then find themselves being picked off one by one in a certain sequence by what seem to be freak accidents, except Candyman's Tony Todd, obviously relishing his cameo as the mortician-from-hell, warns Sawa and Larter that Death's design has been foiled, and that he is now after them and the remaining survivors. I might have preferred it if director James Wong had gone for creepiness and a strong deniability of the supernatural elements in the film, but instead he goes down the route of slam-bang, in-your-face thrills and shocks. Fortunately, it's not a full-on missed opportunity as we do end up getting a string of entertaining set pieces that cleverly show how mundane household objects can become dangerously lethal in a matter of seconds. As a viewer I soon found myself watching every scene as a potential sandbox of death - which was strangely fun. True, the film is a little ham-fisted in execution on many levels, but it also tries earnestly to rise above the typical slasher movie, which is something that needs to be appreciated."
  },
  {
    "rating": "2.5/5",
    "review": "Contrived and unscary"
  },
  {
    "rating": "2/5",
    "review": "Review coming soon..."
  },
  {
    "rating": "2/5",
    "review": "I forgot how lame this movie was. Pass."
  },
  {
    "rating": "2/5",
    "review": "2 stars! The Final Destination sequel is kinda stupid, but the first one is definitely the best one. Some parts are enjoyable, but it's not great!"
  },
  {
    "rating": "4.5/5",
    "review": "The beginning of my love for horror, still my favorite series!!"
  },
  {
    "rating": "2/5",
    "review": "The film doesn't have much of a premise, it's mostly just people dying."
  },
  {
    "rating": "2.5/5",
    "review": "That premise...it seems like the ideal plot for a great horror film. With such premise, you can create suspense, thrill, chills, fear and even some drama, and then have some creative deaths. I'll admit it, the film did have some atmosphere of fear and despair, but overall, it's just an averagely executed idea that doesn't scare and doesn't create any drama. It falls into the same clichés that every horror movie with teenager characters falls into: the characters are stale and dumb, like, just because they are underage. It doesn't help that the acting is very average too. We have each of these generic characters: the main character that wants to do everything right, the douchebag, the hot girl, the bully, the dumb, etc. Nothing new here. The story had an interesting development, but that alone needs characters to fully exploit its elements. Seeing how bad these characters are, you can easily guess the result. It gets a bit silly at times and predictable: they're all gonna die, so every scene in which they save one another are pointless. Now, the highlight: the death scenes. Yeah, some of them are creative, gory, and even cool. But that's the problem: they're not scary. They're just...gory, graphical, but nothing really compelling. Also it transforms everyday stuff into a deadly trap, and it isn't scary, it's silly. I did felt anxious while the movie showed the build-up to the death of certain characters, but after the fun moment of watching them die, it feels empty. And I don't even know if I were supposed to feel anxious or it's because the movie is annoying; something tells me it's the second one, but then again, maybe the movie did have something in there. Some of its moments work, but overall, it's not what it could have been. It should've been a horror classic, but it's only the beginning of a dreadful saga that overstayed its welcome at the very first sequel. Overall, it's just dumb fun, but it shouldn't be; it should be scary and suspenseful. Guess it didn't work. Well, it won some good money, so I guess people really liked this stuff. Well, unfortunately that meant a lot of sequels, each of them worse...ish. It never needed a sequel; it never needed to have numbers in the box-office either. Guess the death sentence was for us."
  },
  {
    "rating": "4/5",
    "review": "Best 1 out of all of um"
  },
  {
    "rating": "4.5/5",
    "review": "really liked this movie, definitely kept me interested"
  },
  {
    "rating": "3/5",
    "review": "From the opening titles it's clear Final Destination is a film about death and the makers really lay it on thick as if the audience is incapable of following a storyline without constant reminders about the subject. There are images of death, deathly screams, even a copy of Death of a Salesman. In the beginning we join Alex (Devon Sawa) a superstitious 17-year-old who is preparing to go to France on a school field trip. \"You've got your whole life ahead of you,\" says his dad, like a black cat crossing his path to smash a mirror over his head. When Alex and his classmates arrive at the airport, director James Wong continues to treat you like the big idiot you are. Alex is handed a 'Death is not the end' flyer and the camera zooms in on the word terminal. Numbers are significant throughout the film, as if to say your number's up. Before the flight takes off, Alex has a premonition that it's going to blow up. He and some of the other students are subsequently removed from the plane and are sitting in the lounge in time to see it explode in a fireball. But there's no escaping death and one-by-one the grim reaper picks off the survivors. You spend most of the film trying to guess how they are going to die and Wong often leads you down the wrong path ­- like when Tod (Chad Donella) starts to shave and nicks his neck and then plucks his nose hairs with a pair of sharp scissors - neither of these things get him but you're made to think they will and you start to see danger everywhere. It's after the death of his friend that Alex starts to piece together the clues: \"Death has a new design for all of you.\" When Final Destination was released in 2000, it was an original concept. It went on to win awards, including the Best Performance by a Younger Actor, and spawned a series of films. But it hasn't aged well and when you watch other horror films it seems rather tame in comparison."
  },
  {
    "rating": "3.5/5",
    "review": "Under-rated horror film that unlike the sequels, is original and well made. Yet, it has less positive reviews than the sequels, what the hell ?"
  },
  {
    "rating": "3/5",
    "review": "It has an interesting premise but not using it to its full advantage."
  },
  {
    "rating": "5/5",
    "review": "Final Destination is a really interesting film. It's got an interesting premise and is also very original. The film focuses on a group of high school students who are taking a trip to Paris and one of the students has a premonition about the plane exploding in midair. After he and a group of fellow students are taken out of the plane, the plane explodes, though the other students who left early survive. Death than starts to kill off each student who was supposed to die on the plane, in the order they were supposed to die. The death scenes are absolutely well executed, while the plane explosion is realistic and the special effects involved in it are well done. The film ends ambiguously, though on a great note with possible future events to occur."
  },
  {
    "rating": "5/5",
    "review": "We have so much to thank this film for, notably the four other sequels that were spawned from this classic. I wouldn't call it a horror as such as there's far more than just pointless violence or non stop scares to this, it genuinely has a credible storyline in which it just happens to encompass several grisly moments. Starting with a group of high school students who are about to embark on a trip to Paris, we then witness one of them having a premonition that the plane is about to crash. As the events in real life then begin to mirror his prediction, he has an outburst which results in several of the students having to leave the aircraft. True to form, the plane then explodes minutes later. However, that is just the beginning, as in the days after that horrific event, the survivors start dropping one by one leading the others to believe that they were destined to be on that plane as part of deaths design, and now death is hunting them down in the most gruesome of accidents. This is a very original and innovative film which keeps you guessing as to what is going to happen next, and who is in for the chop. There's nothing predictable about it, other than it will end at some point, and it is structured perfectly with an action packed beginning, eventful middle, and an unforeseeable ending sequence. There's a reason why the franchise is still ongoing over ten years later, because it would be appealing to all sexes and ages. The only time I wouldn't recommend it is for nervous flyers who are going abroad on holiday anytime soon. Aside from that, it's always a good time filler, so get on board, grab your seats, and prepare for one of the best visual journeys of a lifetime."
  },
  {
    "rating": "1/5",
    "review": "Bem chatinho e desinteressante, as cenas de morte são o único atrativo do filme."
  },
  {
    "rating": "4/5",
    "review": "A new idea that unfortunately have sequels and a franchise... Repeating the idea again and again."
  },
  {
    "rating": "5/5",
    "review": "Love this saga but the first ones are best!!!!"
  },
  {
    "rating": "3.5/5",
    "review": "A quality teen horror thriller that keeps you on edge throughout. 7/10"
  },
  {
    "rating": "4/5",
    "review": "the bus killing bit makes me rate this movie higher than i should !!!!"
  },
  {
    "rating": "3/5",
    "review": "lt's only a film series where teenagers die gruesome deaths.l suppose it does have a bit of a charm too it!"
  },
  {
    "rating": "5/5",
    "review": "Quite good for a teen slasher flick."
  },
  {
    "rating": "4.5/5",
    "review": "The first of the three, brilliant thriller, as a few kids tempt deadly fate after escaping from a plane crash that is about to happen."
  },
  {
    "rating": "4/5",
    "review": "Damn original movie making! Death scenes rock!"
  },
  {
    "rating": "2.5/5",
    "review": "As inventive as ever, Final Destination engrosses within itself a barrage of clever deaths that keep this film from dying of poor execution and rather baneful acting."
  },
  {
    "rating": "3.5/5",
    "review": "B- This movie started it all..."
  },
  {
    "rating": "3/5",
    "review": "The movie that started the franchise. It is always fun to see people dying gruesome, inventive deaths? Not for squeamish."
  },
  {
    "rating": "4/5",
    "review": "The first Final Destination movie. The story for this is really good and like 3 and 4, doesn't rely on the gore as much."
  },
  {
    "rating": "3.5/5",
    "review": "It's the film that started it all... and man, is it completely different from current Final Destination films... The gore isn't as plentiful as the other films and the main focus of this one is storytelling. Yeah, it gets a bit cheesy towards the second act of the movie... but it's a fun ride that you won't want to pass up."
  },
  {
    "rating": "1.5/5",
    "review": "Good but the sequals were better"
  },
  {
    "rating": "3.5/5",
    "review": "James Wong directs this fine film bringing in \"Death\" as the killer.One of the greater horror films to be made.A teenager boarding a plane has a premonition that there will be a great disaster causing panic on board leading him and a few of his friends to get kicked off the plane.But just a few moments later the aircraft explodes,leading the survivors to be killed off one by one by a supernatural force.Recomend this film to any horror fan."
  },
  {
    "rating": "4/5",
    "review": "Classic 90s feel; my favourite. Awesome premise. It was a cool concept before they made all the sequels. Stands alone quite nicely."
  },
  {
    "rating": "3.5/5",
    "review": "They should have stopped making these films and after this one it goes down hill. The next five or how ever many gets repetitive and boring."
  },
  {
    "rating": "3.5/5",
    "review": "A very original idea as well as a scary one when you think about it. The deaths were unique and genuinely realistic as well as frightful."
  },
  {
    "rating": "2.5/5",
    "review": "better than saw, but still not good"
  },
  {
    "rating": "3/5",
    "review": "Stylistically akin to the Scream and I Know What You Did Last Summer movie series but like the original Scream, Final Destination actually had some creativity and originality."
  },
  {
    "rating": "5/5",
    "review": "Jmaes Wong made a classic cult movie.It's the best horrible movie I've ever seen!"
  },
  {
    "rating": "4/5",
    "review": "This is a movie which started off as a recycled screenplay for an X-Files episode, and being a huge fan of the show I could pretty much see how Mulder and Scully would fit into the plot. Setting that aside, as a horror movie this worked out quite well. It introduced something not yet seen, namely the main villain not being a monster, a killer or anything of that nature, but just death itself, and a series of over-the-top coincidences which would in some way end a person's life or mutilate their body. A fine idea which could be played with in countless ways, thus a whole franchise was born, which reminds me much of the Saw franchise due to the irony and nature of the characters' deaths."
  },
  {
    "rating": "3.5/5",
    "review": "74% Despite not being the most interesting entry in the franchise, Final Destination succeeds with great thrills, amazing performances and very bloody special effects."
  },
  {
    "rating": "4/5",
    "review": "not the best of all thre but still good"
  },
  {
    "rating": "5/5",
    "review": "I've got this whole collection and I like them all,,,, my fav. is part one."
  },
  {
    "rating": "5/5",
    "review": "Final Destination is one of the most surprising Horror films I've ever watched and it is also one of the best Horror films in the 21st Century. This movie is about a young man name Alex Browning who has a vision of the plane going to explode and after he saved his friends he soon realized that death is still after them and Alex and Clear Rivers must save the other survivors in order to cheat death once and for all. To be honest I had a fun time watching this movie and this movie seriously delivered the goods and its the best out of all the Final Destination films next to Final Destination 5. I seriously love this movie and I totally love the concept of death manipulating the environment in killing the survivors rather than having the grim reaper as the main antagonist instead death manipulates the environment in killing all those survivors who were supposed to die in the plane crash and I totally enjoyed this movie and it never gets boring and there are lots of big surprises that the movie delivers. What's great about Final Destination is that the whole film is full of suspense, tension and its also thrilling at the exact same time. There are lots of suspenceful scenes in this movie like the scene where Alex saves Carter Horton from getting ran over by a train in the train tracks that is one of the most suspenceful scenes in the film. The scene where Alex tries to save Mrs. Lewton is also the most suspenceful scene in the film and the airplane premonition is also one of the best opening scenes I've seen in the movie and the most suspenceful scene in the film and there are other scenes also that are really suspenceful which I totally enjoyed watching in the movie so far. What I also like about this movie is that the whole film has a really unique atmosphere that gives the movie a dark feel and this movie totally had the best cinematography used in a Horror film and I totally enjoyed the film's deliberate atmosphere and overall the atmosphere is well used in the movie so far. The other things that I like about this film is that the whole movie is also full of characters that are well developed and all of the characters are believable and likable at the same time and I as fund of some of the characters in this film some of them were fun and some were just believable which I seriously like in the movie and I seriously like the idea of this film so far. The other highlights I totally enjoyed in this movie is mostly the death scenes in this film. Although the deaths in this movie may not be as gory as the later on Final Destination sequels death scenes the kills are still inventive and painful to watch there's only one death scene where the gore was used once only. Tod's death scene where he gets strangled by the wire while he's hanging his clothes in the bathroom is one of the most painful death scenes in the film. Terry's death is one of the most intense kills in this film. Billy Hitchcock's decapitation death scene was pretty impressive and it may not be gory but it is overall the most suspenceful death scene in the film while Mrs. Lewton's death is the goriest death scene I've seen in the film and I think it is the most gruesome death scene in the film so far because it is the only death scene that used gore only because the rest of the death scenes didn't have any gore although they're all fun to watch so far in the film. Now the acting is great the performances of the casts did a really good job with their work in the film. Devon Sawa did a really good job with his role as the protagonist Alex Browning and his performance in the film is just impressive. Ali Larter did a good job as well with her role in the film as Alex's love interest Clear Rivers. Kerr Smith did a unique and impressive job with his work in the film as the hot headed bully and rival of Alex Carter Horton and Seann William Scott did a good job with his role as Billy Hitchcock an overall all of the casts did a wonderful job with their work in the film so far. Director James Wong did a really good job with his work in this movie and I was impressed with his stylish directing on this film even Glen Morgan and Final Destination series creator Jeffrey Riddick did a good job in making the first installment in the Final Destination series and they totally nailed they're work in the film so far and I was overall impressed with the ideas of the filmmakers in making this movie so far. Overall Final Destination gets a 10/10 because this movie delivers the goods and it has a lot of impressive ideas and big surprises that can wow the audience. I highly recommend you to watch this movie and consider it as an entertaining time killer if you're looking for a good time to get scared and freak out and if you're also interested to watch a lot of kills that will make you jump and squirm."
  },
  {
    "rating": "3/5",
    "review": "Putting a fresh spin on the tiring slasher flick, this is the first of many horrors (four sequels prove the title wrong in the next eleven years) in which teens and those who should know better fall foul of death itself in wonderfully macabre and inventive ways. A fun, but nasty chiller that gore hounds will lap up."
  },
  {
    "rating": "5/5",
    "review": "My favorite series, great movie for horror lovers, not as much gore as the others but this one has more detail"
  },
  {
    "rating": "3/5",
    "review": "My favourite of the trilogy for its use of action and sly humour."
  },
  {
    "rating": "4/5",
    "review": "Actually creepy to a certain extent, this is the best of the trilogy. The movie had a greta premise, and it at least carried out what it meant to do. Considering all the crap 'horror' that gets released today, this one actually seems pretty good."
  },
  {
    "rating": "3.5/5",
    "review": "An original idea which makes for a decent flick."
  },
  {
    "rating": "4/5",
    "review": "The critics were rough on this 1. The first installment... a classic"
  },
  {
    "rating": "2.5/5",
    "review": "Okay, first of all, this movie is NOT scary AT ALL. It is sad, and little children (ages 10 +) could handle this. I personally thought this movie was OK. It isn't a \"must see\" kind of movie, but it was Okay."
  },
  {
    "rating": "5/5",
    "review": "There is no cheating death, only delay of the inevitable."
  },
  {
    "rating": "4/5",
    "review": "Alex has a terrifying premonition that causes him and several of his classmates to be escorted off of their plane to Paris just moments before it takes off and explodes. Now, Death has returned to reclaim the victims that escaped their fiery demise... FINAL DESTINATION: The ultimate excuse for contrived screenwriting! The FINAL DESTINATION series gave the typical Teen Slasher an all-new angle that moves away from the hockey-masked killer and into the realm of the supernatural. The films are always about surprise and anticipation, not so much in regards to who is going to die, but when and how. The first FINAL DESTINATION provides thrilling shocks in every death that defy audience expectations. Clever clues are laid out for both the characters and the audience to determine the next method of execution, and yet each death arrives with a sudden jolt. Director James Wong puts together another clean-cut cast of familiar teen faces, with Devon Sawa in the lead as the paranoid Alex Browning and Ali Larter chasing closing behind him as the stereotypically strange and misunderstood Clear Rivers. As silly and absurd as the series often may be, it provides plenty of mindless entertainment as we anxiously await each bloody new death."
  },
  {
    "rating": "3/5",
    "review": "I like all the killing scenes."
  },
  {
    "rating": "2.5/5",
    "review": "entertaining but corny. definitely won't watch it again."
  },
  {
    "rating": "5/5",
    "review": "OMG! Great Great Great!!!!!!!!!!!!!"
  },
  {
    "rating": "3/5",
    "review": "Not bad at all. Exciting horror. More than I can say for a lot recent thing in this genre."
  },
  {
    "rating": "5/5",
    "review": "The best. An unofficial X-Files spinoff movie."
  },
  {
    "rating": "3/5",
    "review": "Often predictable, but more often very disturbing, this provided a great start for the modern classic horror franchise."
  },
  {
    "rating": "3.5/5",
    "review": "Despite the fact that this movie was just another teen horror flick, I actaully did enjoy this one. Because in this movie, the \"killer\" is the best killer of them all ... DEATH! Anyway, this one was pretty good. The other two after it were horrible."
  },
  {
    "rating": "5/5",
    "review": "I love this film I have it on DVD. It was well worth watching and to me was really scary. It really made me think about things more. I even started to cross the streets more properly at crossings and always taking more time to look before crossing the roads because of this film. It really got to me quite a bit. If you watch the extras the people who made this film done this on purpose. In each of there films they showed people some parts that they were going to put in the films and tested them to see what scared them the most. They wired people up to test their heart rates and they changed the storyline and effects around what people were scared of the most. This is why it should get to most people and is why I think it is a good film. The special effects were really good and the film had some really gross parts in it. The acting by the actors was really good too and the film had a great storyline. Also on the extras on the dvd it also tells you of a woman who has premonitions and it tells you about her and some of her family which saome of them also have premonitions. I really liked this film and i would say to anybody that it is well worth watching. Not the best of the lot but its still very good."
  },
  {
    "rating": "3/5",
    "review": "sort of a good movie"
  },
  {
    "rating": "2/5",
    "review": "Didn't like so much."
  },
  {
    "rating": "5/5",
    "review": "Brilliant. If I weren't afraid to fly before I definitely am now. The film itself isn't scary, however the thoughts it provoke are, the whole concept of cheating death is what makes this film work."
  },
  {
    "rating": "2.5/5",
    "review": "It was pretty gross, but really cool special effects..."
  },
  {
    "rating": "4/5",
    "review": "A gripping horror thriller which is probably the best of all 5 movies. It has some great set pieces and deaths and some good performances! Nicely directed and a fun ending!"
  },
  {
    "rating": "5/5",
    "review": "While a high school class is on a field trip to Paris while in the plane a kid named Alex has a premonition that the plane is going to explode. He and some others get kicked off the plane and while at the airport watching the plane get in the air it then explodes. Thinking they cheated death Alex soon finds out they are next and they can't cheat death after all. I really liked this movie I thought it was chilling and at the same time exciting. The acting was good although I see some reviews say it wasn't but I think the actors put in a good effort and played their parts well. Tony Todd who was one of the scariest killers of all time known as the Candyman was pretty creepy in his small role in this movie. I liked it and thought the way they had some of the characters deaths was pretty creative. I think if you are looking for a good fast Exciting thriller look no farther than Final Destination."
  },
  {
    "rating": "4/5",
    "review": "This movie is very scared me at age 11"
  },
  {
    "rating": "5/5",
    "review": "The best part of the movie is knowing you cant kill the bad guy."
  },
  {
    "rating": "3.5/5",
    "review": "Devon Sawa, another one of my childhood crushes..."
  },
  {
    "rating": "3/5",
    "review": "While it does have its problems this is a mostly entertaining, well paced, taut and suspenseful horror movie that has a great premise and is mostly well executed throughout."
  },
  {
    "rating": "3/5",
    "review": "It has a great concept that really could have been scary, but it takes on the wrong tone and suffers from being underdeveloped. It winds up being a brain-dead movie aimed at teens, which is a total lost opportunity. It gets off to a strong start where a premonition creates a wrinkle in death's design by a group of people get off a plane before it blows up. An effective and darkly ironic sense of fate comes into play where death will correct no matter what you do to avoid it. You soon know what will happen but you do not know how, and that is unnerving. Sadly, the good setup is only amounts to one senseless kill scene after another. The fundamental flaw of the movie is that the viewer is emotionally detached from nearly all of these characters, so that you will enjoy the process of them dying off on at a time. If you do not care about any of the characters it is hard to care about anything that happens in the movie. Another misstep was how the death scenes are over the top and too farfetched to take seriously. They unfortunately come off as darkly humorous rather than frightening. This movie is misguided and a really good concept is squandered and it results in a mediocre series of kill scenes."
  },
  {
    "rating": "3/5",
    "review": "i like the theme, and the directing was good"
  },
  {
    "rating": "2.5/5",
    "review": "Nothing like a good \"death is hunting you\" movie to make you paranoid."
  },
  {
    "rating": "2.5/5",
    "review": "It was okay. Nothing special, but it does deliver in what it intends, which is high death."
  },
  {
    "rating": "3/5",
    "review": "The start of the FD series."
  },
  {
    "rating": "4.5/5",
    "review": "a great movie for super natural and horror movie lovers.........."
  },
  {
    "rating": "3.5/5",
    "review": "Actually better than I expected. But not one I'd be willing to watch over and over. Also followed by a bunch of sequels that have different incidents that share the same story"
  },
  {
    "rating": "1/5",
    "review": "And just when I thought Hollywood can't get any sillier!"
  },
  {
    "rating": "3/5",
    "review": "This film was alrite. I have to say, i did freak out at the beginning of the film when the plane blew up. It really was scary but i thought the rest of the films kill offs were not as scary. But it was a good overall."
  },
  {
    "rating": "3/5",
    "review": "More funny than scary."
  },
  {
    "rating": "5/5",
    "review": "IS A GREAT MOVIE NOT REALLY SCARY THOUGHT"
  },
  {
    "rating": "3/5",
    "review": "Interesting way of thinking about death"
  },
  {
    "rating": "3/5",
    "review": "my favorite of the series"
  },
  {
    "rating": "5/5",
    "review": "awesome watch all three movies and the fourth one to be announced yet"
  },
  {
    "rating": "4.5/5",
    "review": "Te engancha todo el tiempo, muy interesante, definitivamente la mejor de las tres."
  },
  {
    "rating": "2.5/5",
    "review": "i dont really like final destination movies this was kinda annoying to watch"
  },
  {
    "rating": "3.5/5",
    "review": "This movie was a pleasant surprise!"
  },
  {
    "rating": "4/5",
    "review": "very original. creepy, clever horror suspense"
  },
  {
    "rating": "2.5/5",
    "review": "An interesting and different idea introduced to the horror genre, but Final Destination ends up feeling like the most pointless movie ever made."
  },
  {
    "rating": "3/5",
    "review": "The first of the series definitely isn't the goriest, but it certainly is the most compelling"
  },
  {
    "rating": "5/5",
    "review": "one of my favorite movies!"
  },
  {
    "rating": "3.5/5",
    "review": "A pretty cool premise that keeps the story going. The acting and the script could've definitely been better, but the movie was really entertaining nevertheless. Creative take on the genre at the time, but it should've stayed at one because it probably gets repetitive in the unecessary sequels."
  },
  {
    "rating": "5/5",
    "review": "Clever and smart! Death always has a way!"
  },
  {
    "rating": "3/5",
    "review": "It's a film reaching new heights of ok, stretching the limits of not bad. But generally speaking, it's fine"
  },
  {
    "rating": "3.5/5",
    "review": "I HATE HATE HATE! the part where he gets strangled by the shower chord ;[ or whatever, Cant watch it, gotta cover my eyes"
  },
  {
    "rating": "3.5/5",
    "review": "If you like horror, then this is a pretty original story. The acting is ok, but its creepy and fun to watch."
  },
  {
    "rating": "3.5/5",
    "review": "A simple idea brought to the screen with such a pulse pounding edge that it is a cut above most teen/horror films. The 2nd final destination is also worth a look....don't bother with the third!"
  },
  {
    "rating": "3/5",
    "review": "This is a good thrill fest but at times it lacks a lot of horrific opportunities."
  },
  {
    "rating": "1.5/5",
    "review": "ThIs film is just stupid has no tension and Evan the spin off's have the same plot death death death..."
  },
  {
    "rating": "3/5",
    "review": "good thriller if you like thrillers"
  },
  {
    "rating": "5/5",
    "review": "The best Final Destination movie. The second and the third are not as good as this one!"
  },
  {
    "rating": "2/5",
    "review": "It had gotten predictable with time. The premonitions made it so unbearable to watch that i end up predicting what's going to happen. I nearly fell asleep."
  },
  {
    "rating": "3.5/5",
    "review": "Good unpretentious fun, a film that's basically a series of death set-pieces strung together."
  },
  {
    "rating": "5/5",
    "review": "Its creppy but scarry."
  },
  {
    "rating": "4.5/5",
    "review": "http://expletivedleted.livejournal.com/133284.html What's your favorite scary movie? Well, it depends on how you want to define scary movie. My favorite horror franchise is a toss up between Final Destination and Scream. If we're sticking to the slasher subgenre, it's Scream. I love how it's a sorta parody of the genre, while still being a part of the genre itself. But in the end, I had to go with Final Destination. As a franchise, I feel tht it did stay pretty strong throughout. Yes, it had a few questionable entries, but it didn't decline as steadily or steeply as Scream. The first FD is brilliant. It's the right combo of campy and scary. It's dark and twisted, but a lil tongue-in-cheek and entertainly over the top. The second film continued that grave and austere vibe. The third and fourth did go a bit downhill, too much on the camp and too ridiculous, even for its predecessors. But then the fifth one, just when all hope had been lost, was incredible. It hit the balance even better. Was just as dark as the first two, but just as fun as the last two. That was all well and good, but the twist at the end. Whoa. Beyond perfection. Did not see it coming, and it was a great way to tie everything in. That restored my faith, and that's why Final Destination (mostly the first one, but as a representation of all of them) is on my list. Two things that really stick out to me about these films. One is that the death scenes are really creative. In the early movies they're incredibly creepy and suspenseful. By the later ones, they're more ridiculous, but that's the charm. Half of the fun in watching is seeing how they're gonna die, and the build up gets milked like crazy. However, what really strikes me most about these movies is that the concept scares the \\m/ outta me. I don't typically get scared with horror movies, usually because I can see a way out. Slasher movie? Um, run from the guy with the knife, and not to the upstairs bathroom. Shark in the water? Stay outta the water. Supernatural being haunting your house? Right. But here, you're running from death itself. When it's your turn, there is no escape. Even if you're lucky enough to get skipped, it comes back around. Sometimes our victims think they've found a loophole, but by the end (or the next movie) they're still wiped out. The first time I ever saw this movie, it was about two weeks before getting on a plane to fly aross the country for a class trip. I obsessively checked the latch on my tray table to make sure it didn't break off. To this day, I still check it as soon as I sit down. God only knows what I'd do if it ever broke on me. On that same trip, after being edgy about the plane ride, the toilet in one of our hotel rooms overflowed. The water appeared to chase us around the bathroom. I love the original cast so much too. Devon Sawa had been one of my biggest crushes in junior high,a nd this was one of the first times I saw him all growed up. I still adore the boy. He's why I started watching Nikita. This was also during the Dawson's Creek heyday, so it was a big deal seeing Kerr Smith. Roswell was also just starting up, so Brendan Fehr had a small role. You also got Seann William Scott before he was too typecast as Stiffler. And look, a pre-Heroes, pre-blonde Ali Larter! Say what you will about these films being too silly or cheesey. That's what I love about them. http://www.expletivedleted.com http://www.twitter.com/expletivedleted http://www.facebook.com/expletivedleted"
  },
  {
    "rating": "4.5/5",
    "review": "good clean haha clean sorry wrong movie bloody bloody and bloody"
  },
  {
    "rating": "2/5",
    "review": "a teen horror that is a lot inferior to similar films!!"
  },
  {
    "rating": "0.5/5",
    "review": "Another teen horror movie. Good idea, poor everything else."
  },
  {
    "rating": "3/5",
    "review": "This comes off like a black comedy in places, presumably unintentionally which isn't a reassuring sign. Conceptually, a really interesting horror film."
  },
  {
    "rating": "3.5/5",
    "review": "It works as a slasher and the concept is great, the acting is usually subpar but its well made and a good time if you want to see people die."
  },
  {
    "rating": "3.5/5",
    "review": "Suspenseful and frightening, Final Destination is an entertaining and well-crafted thriller. The story follows a group of high school students that are stalked by Death after a premonition helps them escape a plane crash. The casting is fairly solid, and includes Kerr Smith, Ali Larter, Seann William Scott, and Tony Todd. Additionally, the film does a pretty good job at setting up suspenseful and intense scenes that are unnerving. However, there's some weak writing (particularly the dialog) that cause the tone to be a bit uneven. Yet even with its flaws, Final Destination is a smart film that's full of shocks and scares."
  },
  {
    "rating": "2.5/5",
    "review": "The death scenes are great, but the acting and characters in Final Destination are mainly boring."
  },
  {
    "rating": "4/5",
    "review": "<i>Final Destination</i> manages to make the mundane enthralling. That speaks to the quality of thriller that it is, doesn't it? To say that it manages to make someone lighting a candle must-see material tells you just how captivated I was. Sure, a lot of the film features a bunch of red herrings, but when you're having this much fun watching and waiting for people to die, being tricked from time to time isn't a negative. The hook: A class trip to Paris is planned. On the trip, one character sees the plane explode, and thinks he's a goner. But he wakes up, unaware that he had just fallen asleep while waiting for takeoff. He causes a stir, gets a few people kicked off the plane with him, and low and behold, he was right: The plan explodes shortly after getting off the ground. The characters still at the airport should be ecstatic: They just cheated Death! They're alive, and it's all thanks to this premonition. Instead, they're saddened because their friends and classmates just died. Way to keep a somber tone, <i>Final Destination</i>. Anyway, the main character, Alex (Devon Sawa) soon becomes the prime suspect of the FBI. Why? Well, since he had this vision of the future, and managed to get off the plane, they think that he managed to blow it up. They become even more suspicious when his friend, Tod (Chad Donella) commits suicide via hanging himself in the bathroom. Or, at least, that's what the FBI thinks. We saw the truth: A leaky toilet caused water to get on the floor, which in turn lead to Tod slipping, falling toward the bathtub, and getting a wire wrapped around his neck. He struggled but was unable to get free. The water later retreated. We know it wasn't suicide, and we know Alex wasn't involved, but nobody else does. Soon enough, another one of the survivors is killed, once again in an \"accident\" that Alex can be linked to. The FBI are now thinking he very well could be a serial killer. Meanwhile, the one person who believes him, a woman named Clear (Ali Larter), is trying to help Alex make sense of all of the events that are going on. Essentially, they determine that Death is angry that he didn't take all of the people he planned to, and is now going to get even by killing them later on. So, yes, this elaborate set-up was a way to give director James Wong and writers Glen Morgan and Jeffery Reddick a reason to kill a bunch of teenagers without creating a serial killer to do it. Well, Death can be called a serial killer, I suppose, given the fact that he kind of kills everyone ever alive, but he isn't your traditional knife-to-the-chest killer. Instead, can strike at any time, in any place, using anything. He's possibly the worst entity to make angry. Because of the \"any place, any time, anything\" problem, absolutely anything the characters do could kill them -- usually in the most complex and Rube Goldberg-esque way possible. For instance, lighting a candle could somehow make fishing hook become stuck in your mouth, pulling you onto an electrocution trap set because your faucet was leaking and you never noticed it. That doesn't actually happen in the film, but it's the best I can come up with at the moment. The logic doesn't always make sense, but the thrill of the kill is never not enjoyable. Since any action taken could trigger an overly complex death sequence, the entire film is intense. For some reason, there isn't any difference between the before-explosion and after-explosion scenes in terms of style. Before the vision is even had, and before we (presumably) know that this is a horror film, mundane actions are still made to seem scary. This doesn't work at the start, and it would have been nice to see a style shift in the before and after shots in order to fully capture just how tense life would be with Death awaiting your every move. I'm not sure if one is supposed to enjoy a film like <i>Final Destination</i>. I wondered throughout if I was supposed to like seeing teenagers getting killed in ways that I can't even describe. Surely this isn't supposed to be fun. But it is. I'm not sure why, but it just is. I wasn't ever scared, but I was engaged. I laughed at some of the kills, as the special effects left a lot to be desired, but because Death could appear at any time to end one of their lives, I had a good time. Maybe that speaks to the viewer's nature -- if you like this kind of film you're a bad person or something -- but I can't deny that the creative kills were fun to watch. This is a film that does get very silly at times, especially later on when the characters think they figure out a way to cheat Death for good. The eventual explanation comes across as both pointless and stupid, even if it does give the characters something to do. It didn't seem necessary, though, as the plot is basically just an excuse to massacre teenagers. If you're enjoying the earlier part of the film, you're not going to want to see these kids live anyway. If you're not, then a \"we might be able to avoid Death by doing X\" won't save this movie for you. <i>Final Destination</i> is ultimately a very enjoyable film -- if you enjoy watching teenagers die in random, complex and fascinating ways. If you have, I don't know, a shred of empathy for human beings, this might not be for you. But I had a really fun time with it and would recommend it for fans of the teen slasher genre. Death makes a pretty good murderer, when you think about it."
  },
  {
    "rating": "3.5/5",
    "review": "Classic horror flick. I have a feeling this movie will not age well, so it'll be so much more enjoyable in like, i dont know, 30 years to watch all the campy deaths! hah!"
  },
  {
    "rating": "4/5",
    "review": "I won't lie, This film was great. It took the whole idea from general horror movies about a killer stalking them but in this one reversed it into something way more different, Death it self picking off teens one by one, Making it all seem like accidents, and it was great. It's one of the most original ideas in a while, I mean this film is still very flawed, But still how creative it is shows how great this series can be if they actually tried in some of the sequels that they are throwing out there. This film was a lot of fun, creative deaths, alright acting. I Loved the first but the rest can go die somewhere... No pun intended. 4/5."
  },
  {
    "rating": "3/5",
    "review": "\"Final Destination\" es junto con \"Scream\", \"I Know What You Did Last Summer\" y \"Urban Legend\", otro intento por revivir el \"Slasher movie\" tan popular en los 80. En este caso, el asesino es invisible, pero igual persigue a los adolescentes para eliminarlos uno por uno. El merito de esta cinta esta en su ritmo y en que intenta superar los cliches del subgenero. El resultado no llega a ser del todo satisfactorio, pero logra entretener."
  },
  {
    "rating": "5/5",
    "review": "Ahh, Final Destination, the movie that started the now never-ending franchise. I remember getting this on dvd and not really knowing what this was going into it. So, we meet Alex and his friends fixing to take a huge trip to Paris. Sounds pretty boring, but then Alex has a vision of him and his friends dying after the plane explodes. He warns them all and he gets some other people off thinking he's just a loony. But then after take off, what do you know, the plane goes BLAM! So a couple months pass and then it happens, they started dying in mysterious 'accidents'. Come to find out, they were never meant to get off the plane and death is back to finish what it started on the plane. Intriguing, don't you think. This was good, unlike some of the others (The Final Destination). It was original, I had never seen anything like this and thought, \"Hey, this is a good movie and ranks high among my favs\". It was gory, interesting story, cool deaths, Tony Todd, and likeable characters. Even though it had it's flaws, it's still a solid movie and for that 5/5"
  },
  {
    "rating": "3/5",
    "review": "From the beginning to the end, the film remains tense and upbeat, but certain technical aspects, such as the way the film was shot, the blatant disregard for equipment reflected in the mirror, shadows of the equipment cast over each set, and an unrealistic beheading make me question what the $23 million pricetag actually went toward."
  },
  {
    "rating": "4/5",
    "review": "death all over the place"
  },
  {
    "rating": "3/5",
    "review": "really wasn't the most impressed but it wasn't a bad movie..."
  },
  {
    "rating": "3/5",
    "review": "Good movie, not great but entertaining. Shocking visuals."
  },
  {
    "rating": "2/5",
    "review": "Fun to watch, but just not a good movie."
  },
  {
    "rating": "3.5/5",
    "review": "I love the design but wasn't overly impressed with the execution."
  },
  {
    "rating": "3.5/5",
    "review": "The script is unique (for its time, which would be year 2000) and has that creepy and suspenseful moments I love in horror movies. The idea of Death in the movie was great and creepy (and now I have a fear of using airplanes). The actors/actresses weren't all that good (ALI LARTER, even in Resident Evil: Extinction, you need more practice). The effects were decent too. I really loved how Valerie died and the glass breaking in the airport and all those things! Devon and Ali's chemistry is still a better love story than Twilight, too."
  },
  {
    "rating": "2/5",
    "review": "It's not scary, campy, or even really that gory, making it unclear what audience Final Destination is trying to appeal to."
  },
  {
    "rating": "5/5",
    "review": "Shocking, Excellent movie"
  },
  {
    "rating": "3/5",
    "review": "OMG I didnt expect most of what happened too actually happen! Great Movie!"
  },
  {
    "rating": "5/5",
    "review": "this movie serves as one of the best teen horror flicks that were being produced and released extensively back in the late 90's as it introduced a fresh new concept that helped revolutionized the teen horror genre and build the foundation for the series to be still successful to this date."
  },
  {
    "rating": "2/5",
    "review": "Just an ok start to a franchise"
  },
  {
    "rating": "4/5",
    "review": "Good: A good and original idea, portrays death in an interesting manner, kind of like a slasher film-except you can't see the slasher, good deaths, and oh my it's the guy who played the Candyman! Bad: Pretty bad acting from some. I have to that Final Destination is one of the better horror movies of the 2000s to me. I really enjoy the concept of Final Destination. Death is a force that you cannot escape no matter what. They portray death as almost an intelligent person that is adept at his job and will do everything to get it done. It is difficult to place this in an exact genre, but this could easily be considered a slasher film. It has the same kind of formula, except you just cannot see the killer. This killer is very good at what he does, as the deaths is this movie are highly enjoyable and creative. Although they do not compare to the deaths of later movies, and just other movies of the time. Just a little trivia, the man who plays William Bludworth is the same guy who played the Candyman! How about that?! On the down side there is some pretty bad acting from some. Overall, a movie that should be watched by anyone interested in horror or looking for a scare."
  },
  {
    "rating": "3/5",
    "review": "Original, clever, and gory - all these factors in a teenage movie? It seems unbelievable, but you better believe it."
  },
  {
    "rating": "5/5",
    "review": "Freaky movie!! Good pace, good acting and not entirely predictable."
  },
  {
    "rating": "4/5",
    "review": "great the first time"
  },
  {
    "rating": "5/5",
    "review": "Definitely need another one of these movies."
  },
  {
    "rating": "4/5",
    "review": "I enjoyed the movie."
  },
  {
    "rating": "2.5/5",
    "review": "Terror intrigante com bons diÃ¡logos e mortes absurdas."
  },
  {
    "rating": "2.5/5",
    "review": "the film is good only because aleks is able to work out whos next in line for death plan, and its good how they managed to do some good death scean with how the technoilgy is today"
  },
  {
    "rating": "4/5",
    "review": "Really good, I actually liked the story too."
  },
  {
    "rating": "5/5",
    "review": "Great movie...it shows you that anything is possible when it comes to life and death."
  },
  {
    "rating": "3.5/5",
    "review": "Entertaining, but kinda predictable."
  },
  {
    "rating": "3.5/5",
    "review": "Where it all began is certainly where it will not end! A perfect beginning film that started this live-kill cycle!"
  },
  {
    "rating": "4.5/5",
    "review": "I love the premise. decent horror movie"
  },
  {
    "rating": "0.5/5",
    "review": "I'm sorry I just hate the whole concept!"
  },
  {
    "rating": "4.5/5",
    "review": "The death seems are awsome ...very good movie"
  },
  {
    "rating": "5/5",
    "review": "makes one wonder... lolll"
  },
  {
    "rating": "5/5",
    "review": "Awesome gore scenes!"
  },
  {
    "rating": "5/5",
    "review": "Best horror movie you will ever see"
  },
  {
    "rating": "2/5",
    "review": "Good idea fallen flat by bad script."
  },
  {
    "rating": "1/5",
    "review": "it was okay but i will NEVER watch it again"
  },
  {
    "rating": "1/5",
    "review": "A cult movie, but also a garbage movie."
  },
  {
    "rating": "3/5",
    "review": "It's not a good movie, but it's definitely entertaining in it's Rube Golberg-ian death scenes."
  },
  {
    "rating": "4/5",
    "review": "Awesome idea. Lots of cool deaths"
  },
  {
    "rating": "4/5",
    "review": "good film..gory and edgy!!"
  },
  {
    "rating": "1.5/5",
    "review": "Can't deny how stupid the plot is; a bunch of people die, and now the survivors are threatened by the rather silly \"design\" of death. It is choked with unnecessary chills and is a waste of time."
  },
  {
    "rating": "5/5",
    "review": "so messed up. u can never get away from the villan in this one. hehehe"
  },
  {
    "rating": "0.5/5",
    "review": "Hilarious... but it's not supposed to be. Interesting idea, but terrible acting, terrible script, terrible cliches, overall making for one terrible mess."
  },
  {
    "rating": "5/5",
    "review": "love it! I love all of the final destination movies! I will watch them over and over!"
  },
  {
    "rating": "3/5",
    "review": "death itself comming at you and not an accual human, thats a cool twist."
  },
  {
    "rating": "4/5",
    "review": "What started it all. While plenty of fans of the franchise say this is the best or their favorite, I'd actually have to disagree. It's dark and moodier than the others but still good."
  },
  {
    "rating": "3.5/5",
    "review": "The best of the Final Destination series. very entertaining and suspenseful."
  },
  {
    "rating": "3/5",
    "review": "pretty good the effects were lil old"
  },
  {
    "rating": "2.5/5",
    "review": "90's Heart throbs and future hero stars.... the only perk of final destination was the quick launch of super stardom and big breaks for the actors. with cheesy movies: i know what you did last summer and scream, Final destination wasn't like others teen horrors. It shined orginality, but to say it was scary or the best out there i have to object!"
  },
  {
    "rating": "3/5",
    "review": "Fresh idea executed in a rather unimaginative manner. Final Destination is thrilling and scary in its storyline, but because of those one-dimensional puppets instead of people it isn't able to become anything more than it is - a suspense story that has some intriguing death sequences, but isn't able to shock properly."
  },
  {
    "rating": "3.5/5",
    "review": "An interesting and chilling idea, even though the plot is rendered pointless by the film's own mythology real early on in the proceedings. Still there are enough memorable moments to recommend this grisly thriller."
  },
  {
    "rating": "3.5/5",
    "review": "The only way to do jump scares."
  },
  {
    "rating": "5/5",
    "review": "Excelent movie. I watched it like 20 times."
  },
  {
    "rating": "5/5",
    "review": "Loved it!\" Saw the first 3/three All in the cinema,"
  },
  {
    "rating": "5/5",
    "review": "The beginning of an awsome triology"
  },
  {
    "rating": "3/5",
    "review": "The acting was good, eventhought the movie was exagerating but I think the message was clear ; you can't cheat death, and you're the creator of your own destiny, every move you do counts."
  },
  {
    "rating": "2/5",
    "review": "This film is laughably bad. It suffers from a bad and predictable premise, ridiculously cheesy death scenes, and dry acting. If you're gonna watch this, watch it with a group of friends for laughs. It is more enjoyable that way, rather than trying to take it in as a horror film."
  },
  {
    "rating": "3/5",
    "review": "A rare supernatural movie that is a bit suspenseful and entertaining! 7/10"
  },
  {
    "rating": "4/5",
    "review": "I'm not really a fan of slasher flicks, but the supernatural angle makes this very intriguing (and the first couple movies are more thrillers than slashers anyway). Surprisingly smart and interesting."
  },
  {
    "rating": "3/5",
    "review": "\" an original shocker that keeps the tension going\"-- I agree!"
  },
  {
    "rating": "3.5/5",
    "review": "Is it really death that's following them, or the ghost of Rube Goldberg???"
  },
  {
    "rating": "4.5/5",
    "review": "This film is the reason why I love horror movies, suspense and just enough blood to please the audience, Ali Larter was a fantastic female lead."
  },
  {
    "rating": "4/5",
    "review": "Great fun Jumpy film, with it's fare share of gore."
  },
  {
    "rating": "3/5",
    "review": "The best film in the \"Final Destination\" series. But is that really saying something?"
  },
  {
    "rating": "3/5",
    "review": "Scared the crap out of me in 7th grade lol"
  },
  {
    "rating": "1.5/5",
    "review": "I prefer other teen horror films where people get killed for an obvious reason. The idea of people dying by mother nature or by things near them is stupid making the film pure garbage and a waste of time."
  },
  {
    "rating": "2/5",
    "review": "An eerie story but unconvincing acting."
  },
  {
    "rating": "4/5",
    "review": "Although the film features some spotty performances, Final Destination is an incredibly original horror film that entertains and engages."
  },
  {
    "rating": "3.5/5",
    "review": "It has an original premise and it is the best of the franchise since the sequels haven't been made yet for taking the same idea for every movie."
  },
  {
    "rating": "5/5",
    "review": "The first was the BEST!"
  },
  {
    "rating": "4/5",
    "review": "ThÊ bÊ$T 0ñÊ 0f ThÊM Ãll!!!"
  },
  {
    "rating": "5/5",
    "review": "Death Walk behind you!!!"
  },
  {
    "rating": "1.5/5",
    "review": "Two words: Bad deaths"
  },
  {
    "rating": "3.5/5",
    "review": "Good, creepy horror movie with a neat premise."
  },
  {
    "rating": "2.5/5",
    "review": "i still like it but...."
  },
  {
    "rating": "4/5",
    "review": "Final Destination is the perfect example of a suspenseful teen slasher that plays by the rules and gives them a twist."
  },
  {
    "rating": "3.5/5",
    "review": "Slightly above average horror film."
  },
  {
    "rating": "3/5",
    "review": "first one is the best for sure, good story, some cool deaths, an interesting plot"
  },
  {
    "rating": "2.5/5",
    "review": "This one was good, the others sucked"
  },
  {
    "rating": "5/5",
    "review": "favorite part is when the chick was fussing about being careful and stepped out into the street and got ran over by the metro bus...I know thats a bit cruel but I laughed when it happened"
  },
  {
    "rating": "2/5",
    "review": "An interesting idea to begin with, followed by two pathetic sequels."
  },
  {
    "rating": "3.5/5",
    "review": "Very original horror movie. Very Good."
  },
  {
    "rating": "3.5/5",
    "review": "i loved the build up to each death. very creative and entertaining"
  },
  {
    "rating": "3.5/5",
    "review": "A different kind of horror film which makes an effective thrill for the audience"
  },
  {
    "rating": "3/5",
    "review": "It's like a porn... you only watch it for the gorey scenes and FF through the plot."
  },
  {
    "rating": "3/5",
    "review": "This movie might have some ok and some not good lines. But I'll say this, I like the way people die on this movie."
  },
  {
    "rating": "2.5/5",
    "review": "A teenage horror film that has at least an amount of ingenuity."
  },
  {
    "rating": "3.5/5",
    "review": "Probably the scariest \"paranormal\" film I've ever seen!"
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed this movie"
  },
  {
    "rating": "5/5",
    "review": "I don't just like this one I like everyone of them and hope there are still many more to come"
  },
  {
    "rating": "2.5/5",
    "review": "Good start to a good horror series but could've been better."
  },
  {
    "rating": "4/5",
    "review": "Excellent suspense that goes past the boring stalk 'n' slash crap."
  },
  {
    "rating": "3/5",
    "review": "Stupid, but overall not a bad movie."
  },
  {
    "rating": "4/5",
    "review": "Great make you jump scary film"
  },
  {
    "rating": "3/5",
    "review": "a nicely done start for the franchise."
  },
  {
    "rating": "4.5/5",
    "review": "Years later it is still not the film to watch before a flight."
  }
]