[
  {
    "rating": "0.5/5",
    "review": "The Electric State is a baffling, joyless slog that leaves you wondering why it was even made. From start to finish, the film stumbles through a clunky, incoherent narrative that tries to be emotional and profound but ends up feeling empty and directionless. The acting is flat across the board, with performances that feel either completely disinterested or overly forced—never genuine, never engaging. The storytelling is a disjointed mess, dragging viewers through a world that’s poorly explained and even more poorly utilized. Nothing connects emotionally, the pacing is tedious, and the tone shifts are jarring. There’s no payoff, no momentum, and absolutely nothing redeemable in the way the plot or characters are handled. For a movie with such a promising visual concept, The Electric State is shockingly devoid of energy, creativity, or purpose. A complete misfire in every sense—forgettable, frustrating, and frankly a waste of time."
  },
  {
    "rating": "3/5",
    "review": "It's a kids movie I guess. Nothing makes sense, but that doesn't really matter somehow. It's okay. Nothing ground-breaking but kids under 12 would enjoy it probably. Script is average and direction seems average too., as the actors are all good ones, but don't particularly shine here. Reminiscent of the goonies, (perhaps because of the doctor) but without the heart and soul of those 80's kids movies."
  },
  {
    "rating": "0.5/5",
    "review": "A complete insult to the source material and the fact this has such a high public score demonstrate how audience expectations of quality are an at all time low No sane person would see this as a good movie"
  },
  {
    "rating": "5/5",
    "review": "Weirdly entertaining. A mash up of \"Ready Player One\", \"Real Steel\", \"I Robot\", and \"Short Circuit\". Imaginative and thought provoking, with humor, heart, and interesting characters."
  },
  {
    "rating": "5/5",
    "review": "As usual the critics show their ignorance. Every movie that they score low ends up being great. And every move they score well is awful. Cute movie. A lot of good simple one liners and quips. An overall good message."
  },
  {
    "rating": "5/5",
    "review": "Me gustó mucho fue la mejor película de robos que vi"
  },
  {
    "rating": "4.5/5",
    "review": "While no movie can be perfect, this movie is excellent. It tells a wonderful story and gets you invested. If your main goal in movies is to find as many deep things to review, small slipups, then you will find a way to ruin your experience watching any movie. If you just sit back and watch the movie, then you will enjoy this movie."
  },
  {
    "rating": "4/5",
    "review": "I thought it was good 🙂 I don't understand why a movie just can't be entertaining anymore. I was entertained, burned up a few hours of my day, and that should be enough. Every movie doesn't have to have a mind-numbing revelation. People need to get off their high horse and just see what movies are, entertainment. If you want to be so serious go watch a documentary"
  },
  {
    "rating": "1/5",
    "review": "Yet another swing and a miss for pratt, just an awful performance and awful movie. Bobby-brown needs to stop while she's ahead as well."
  },
  {
    "rating": "4/5",
    "review": "cute movie, liked the Jurassic Park reference, decent soundtrack too"
  },
  {
    "rating": "2.5/5",
    "review": "Despite the obvious charisma of the two lead actors and the presence of a charming robot character, it isn’t enough to support a story full of plot holes and poor direction."
  },
  {
    "rating": "5/5",
    "review": "I find It incredible that the critics gave this lovely movie such an hard time. It seems to me nowadays people have such a big habit at just consuming content that they can't appreciate something simpler but with a heart. I think the story was a nicely written one, the actors did a good job and the robots were fantastic. The plot may be not the newest on the block but what's important here is the relationship between brother and sister and the take on connection and disconnection. I appreciated that not all the choices were easy choices. Maybe I wouldn't have add the final sequence, that was a bit just to ease a pain that, in my opinion, should have stayed there. Like this ... It's just my opinion but I would have preferred it without the final scene Nonetheless the movie is a nice one to watch and one I would watch again."
  },
  {
    "rating": "5/5",
    "review": "It was a lovely movie, the plot while having a typical equation, was well written. I genuinely cried in it, and adored tje characters. The casting and acting was done well. A family friendly movie for 10 and up for sure."
  },
  {
    "rating": "5/5",
    "review": "Perfect for family night! It’s funny, the visuals are very good, the story is touching and the cast is amazing"
  },
  {
    "rating": "2/5",
    "review": "Mais uma vez, eu caí na publicidade da Netflix, e me arrependi. Eu vi todo o \"buzz\" em cima desse filme, e imaginei que fosse um filme interessante que alimentasse nossa imaginação para um futuro pós apocalíptico. No entanto, apesar de ser, de fato, pós apocalíptico, o filme deixa muito a desejar. Não é, nem de longe, o pior filme que eu já vi. Entretanto, infelizmente, é um filme que eu considerei chato. Não prendeu minha atenção, demorei dois dias para assistir de tanto tédio, e num enorme esforço despendido da minha parte para assistir até o final. Na verdade, eu tinha uma esperança de que o final fosse um pouco menos monótono. Spoiler, não foi. Foi um final previsível, monótono e chato, mesmo com toda a cena de luta, brigas, soldados vs. robôs, e etc. O enredo tinha tudo para transformar o filme em algo interessante. Se tratando de uma menina órfão, que reencontra seu irmão preso em um robô e toda a saga para encontrar o corpo dele. Tinha tudo para ser 'o filme\", entretanto a forma como o filme foi trabalhado, o deixou chato. Triste desperdício de roteiro."
  },
  {
    "rating": "5/5",
    "review": "I don't know why the ratings are so low . It IS the best movie I've seen on Netflix in well over a year . I will be buying this dvd . The exchange between Chris Pratt and his robot Herman are priceless. I had my adult son watch it and he felt the same. I am going to start looking for all the bad ratings movies and watch them all if this is how ratings work. Same applied to Waterworld, The Postman, Finest Kind, .... I could go on ."
  },
  {
    "rating": "2.5/5",
    "review": "It's not ad bad as imagined reading reviews, not my favorite but not a disaster"
  },
  {
    "rating": "1.5/5",
    "review": "Sayang oras. Maganda sana un concept na threats sa AI or robotics in the future pero may kulang. Since settings nito e sa 90's, sana nilagyan pa ng puso dun sa mga bagay na lakas maka nostalgic. Nakulangan din ako sa mga maaksyong eksena. Mukang naubos na ang magic ng Russo Brothers sa Avengers Endgame"
  },
  {
    "rating": "3.5/5",
    "review": "Y'all it’s a kids movie. It’s not supposed to be a life changing masterpiece. We’ve become ten times too judgmental and expect everything to be beautiful deep pieces of art. It was entertaining, I laughed a couple times, and at least it’s not a lousy recycled idea. Just don’t watch it if you don’t like it. No reason to go bash it online when people worked hard on it."
  },
  {
    "rating": "5/5",
    "review": "This movie is one of the top 3 sci-fi movies I've ever seen."
  },
  {
    "rating": "4.5/5",
    "review": "This was an extremely interesting movie, with a fascinating, post-apocalyptic feel. Highly recommend it!"
  },
  {
    "rating": "2.5/5",
    "review": "You know what is going to happen. Like all of these movies. But nice special effects."
  },
  {
    "rating": "0.5/5",
    "review": "no me gusto nada mu aburrida la pelicula es cierto que deben empezar un poco lenta pero no mamen esta de la verga pinche pelicula mediocre"
  },
  {
    "rating": "0.5/5",
    "review": "That was properly bad. If you value your time and sanity do not put yourself through this, it's just so bad"
  },
  {
    "rating": "5/5",
    "review": "Love it. All of the negative review here, are just bunch of karen."
  },
  {
    "rating": "2/5",
    "review": "Promising storyline but it lacks connection to the main characters due to bad editing I guess? The dialogue and emotional journey has no depth and seems to run through the story. It's a shame, cause the graphics are great, and you got Stanley Tucci playing the bad guy. This could have been so much better. Will never watch again or recommend."
  },
  {
    "rating": "4/5",
    "review": "I have to admit that when I first saw the robot and the trailer I was not very attracted by it, and it took some months before on a boring friday evening, not having found anything better to watch I decided to have a look at it, and I really liked it! The story is good, the actors also, is funny (could probably be a little more funny), it has action, it is romantic and a little sad. All in all I would recommend it to anyone in search of an easy good story!"
  },
  {
    "rating": "1/5",
    "review": "For viewers unfamiliar with the original dystopian graphic novel, it might be entertaining. When I heard that Marvel directors were working on this book, I suspected disaster, and my suspicions were confirmed. Aside from the use of original concept art, the film lacks the depth or intensity of the original. The fat budget would have been better spent on good screenplays. It's a shame about the missed opportunity for a worthy adaptation of a masterpiece"
  },
  {
    "rating": "2.5/5",
    "review": "Pretty bud dumb. Needed better leads or a better story, ideally both."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie!! It was a heartwarming and endearing story. I cried sad tears and happy tears. I was entertained and connected with the characters, both human and robot....."
  },
  {
    "rating": "2.5/5",
    "review": "Interesting concepts, some great graphics, and utterly forgettable. The focus on humanizing the robots leaves the leads lacking emotional connection with the audience creating zero buy-in on the main characters storyline. Eventually you get a very russo bros fight scene but I feel like overall this was a missed opportunity and I like Pratt and MBB but Chris is poorly written and MBB is doing her best but can’t save this one."
  },
  {
    "rating": "5/5",
    "review": "I like the movie. Though the plot may be predictable. But I watched it with an expectation to be entertained and I was."
  },
  {
    "rating": "4/5",
    "review": "Some of these reviews are taking this movie WAAAAY too seriously. it was never going to win oscars, or split your sides laughing, but for a harmless hour or so to tune out with some of your favourite actors - its perfect."
  },
  {
    "rating": "5/5",
    "review": "What a pleasant surprise this was. A heartwarming and humorous tale of redemption. It made me cry happy tears so that's 5 stars for me."
  },
  {
    "rating": "2/5",
    "review": "The Electric State is passable family entertainment that is also conspicuously inert.  Watching it is like watching someone describe an awesome film they watched in the most boring way possible.  The film is vaporous despite talented people both in front of and behind the camera.  It may hold the title as the most a film adaptation has ever departed from its source material in cinematic history.  Then there’s the uncanny way the film serves as meta commentary on itself and the filmmakers.  Regardless, The Electric State is a strangely compelling viewing experience, even if it’s for the wrong reasons.  Toss-up. detroitcineaste"
  },
  {
    "rating": "5/5",
    "review": "I absolutely love this movie. It's one of the best things that've come out in recent years. The heart and soul that went into the character designs and world building is amazing. The characters are loveable and amusing, and overall I think this movie is great and rewatchable. I honestly can't believe the other reviews I see, as this is the first movie I've watched in a very long time, and especially in recent years, that's made me excited and invested in it. It's also a work of art, you can see the care taken in the designs of the robots and the building of the world, it sets a stage for imagination and it's glorious. I genuinely watched it, and then rewatched it the very next day because it hasn't left my mind."
  },
  {
    "rating": "2/5",
    "review": "To cast MBBrown as a teenager?? The only redeeming value of the film is some of the retro robots are very well done. The story is flimsy, as others have noted, with the central “evil corporation” not well-defined nor thought through. Script so unimaginative, my grandson could have written. MBB and Chris Pratt try really hard, but the plot is so weak, the human characters so robotic, and the robotic characters so cliched, I watched the second half just to see how bad it got! I wasn’t disappointed in its ability to prove me right. Was it sci-fi? Was it a comedy? Was it a heartwarming family tear-jerker? I think it tries to be all three, with end result a melange of schtick and predictability no one would enjoy. As the closing credits rolled, I was amazed that there actually people who paid for this disaster to be made. I fully suspected “written, directed, and produced by the same person.” I could not otherwise understand how anyone could think this movie was gonna ‘make it.’"
  },
  {
    "rating": "1.5/5",
    "review": "An evil global company with a big red button that says \"destroy the company\" on it, and no one is guarding the button"
  },
  {
    "rating": "2/5",
    "review": "I had to watch this movie in two parts, it was rather unstimulating at times. Although the premise is cool, the pacing, dialogue and character building feels a little shallow."
  },
  {
    "rating": "1/5",
    "review": "Oh man this was so bad. Felt nothing for the characters. Nonsensical story and boring."
  },
  {
    "rating": "5/5",
    "review": "I thought it was very good. World, story, CGI, acting. Well told. Pace was good. Nothing bad to say."
  },
  {
    "rating": "4.5/5",
    "review": "Ignore the haters, we watched this and thoroughly enjoyed it. Aimed at a family audience, it's just a great piece of escapism."
  },
  {
    "rating": "2.5/5",
    "review": "The hate is so forced i dont understand"
  },
  {
    "rating": "4/5",
    "review": "I don't understand the hate. It is a great movie with a great cast."
  },
  {
    "rating": "5/5",
    "review": "Maybe it's not up for an Oscar or maybe it's not a massive sci-fi wonder. But it's about humanity, whether it be human or robot. It has all the elements of a great story to keep the watcher entertained throughout the whole movie. You get it all. All the emotions right where they need to be to remind us why we are here on this earth. For each other."
  },
  {
    "rating": "5/5",
    "review": "For me, this movie's definitely moving and very good story telling. Sometimes you just gotta have to appreciate the time put in to this and specially since this is the Russo brother's we are talking about."
  },
  {
    "rating": "5/5",
    "review": "In all my life I've never left a review of a movie......I'm 29. Read plenty of reviews and reading some of these pissed me of so I had to. I made a whole account to say what total BS some of these low reviews are. Yes the movie isn't one for the ages but family fun it sure is.....of course it wasn't targeted towards adult but I watched this movie with my wife started at 11pm.....I really expected to get bored and fall asleep....Nope 1:19am and I'm creating a rotten tomatoes account to say watch it if you love action, humor, and tearing jerking movies....5/5 from me...I even turned down seggs to finish this...."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is very entertaining, funny and action packed. My kids enjoy it and it’s nice to have a movie that isn’t MA rating for once. I can appreciate that for sure. Lots of familiar faces and cool storyline. My toddlers favorite movie oddly. We’ve watched over 10 times. It’s worth a watch for sure"
  },
  {
    "rating": "4.5/5",
    "review": "The electric state is an incredibly good film where it switches between hilarious, tragically beautiful, and epic, with many different parts in-between. An incredibly good movie that made me like robots more and like humans notably less."
  },
  {
    "rating": "4/5",
    "review": "Modern critics need to go rewatch some of the truly mediocre sci fi of decades past and temper their expectations. The story was predictable, themes and characters a bit derivative, what isnt it these days? Visually it was great, the acting was mostly solid, and it was a fun watch. Maybe not $300+ million of fun, but far from being a bomb. I just can’t get over how panned this is; it really didnt do a single thing wrong. Why can’t we just appreciate the successes?"
  },
  {
    "rating": "5/5",
    "review": "I had to watch it since I saw a TikTok saying it was awful. Went into it expecting it to be bad but it was honestly a top tier watch and gave a good story at a fast pace making it easy to stay invested. Amazing quality and acting, and the robots too, if I had not known before hand the movie was cgi I’d have believed the robots were real."
  },
  {
    "rating": "5/5",
    "review": "Maybe written it is not a masterpiece of art but I loved it, the movie was quite comical, I liked the visuals and the setting of it, even the extra characters I found quite interesting, my whole family agrees that it is a good movie to enjoy not to give it too much depth, although the final message was quite good"
  },
  {
    "rating": "3/5",
    "review": "Bon, le film était pas terrible... Il m'a fait rire et il est touchant par moment, mais il ne m'a pas marqué."
  },
  {
    "rating": "5/5",
    "review": "this movie is so good dont listen to what anyone says this movie is actually peak"
  },
  {
    "rating": "4/5",
    "review": "This movie is entertaining. I wouldnt expect it to be a cult classic but its definitely fun to watch. It was also a sci-fi movie the family (with preteens) was willing to watch together. No unnecessary gore and minor use of bad words. I was a little shocked to see the budget which might be why critics were so harsh. Overall worth the watch."
  },
  {
    "rating": "0.5/5",
    "review": "Russo Brothers Failed at something, Awful Nightmare to even watch"
  },
  {
    "rating": "2.5/5",
    "review": "It's watchable, but wouldn't revisit again. Not sure where the $320m went to make this. But given it's the most expensive film ever made by Netflix, it should be a lot better."
  },
  {
    "rating": "3/5",
    "review": "I think this was definitely solid. Not really sure why this seemed to get many negative reviews. It definitely wasn't anything special, but nowhere near bad. Solid stuff!"
  },
  {
    "rating": "4/5",
    "review": "great film with recognizable cast and love the cgi I am a huge fan of sci fi and love millie bobby brown"
  },
  {
    "rating": "5/5",
    "review": "What a fun movie - a lighthearted romp through a re-imagined 1990s world of retro robots. Loved all of the characters - human and robot. Very imaginative and fun."
  },
  {
    "rating": "0.5/5",
    "review": "AVOID. This is 2 hours and 8 minutes of my life that I’ll never get back. This film is so far beneath many of the actors within it. How did this movie get made."
  },
  {
    "rating": "1.5/5",
    "review": "Otro projecto fallido de los hermanos russo la trama de la película es un poco estupida."
  },
  {
    "rating": "5/5",
    "review": "Soooo good. Critics are no longer reliable to determine a good movie."
  },
  {
    "rating": "2/5",
    "review": "It’s such a shame that the directors of the best MCU films, the Russo brothers, fumble projects outside of the MCU. It is already proven that a loose adaptation of the source material works for superhero comics, especially those running for more than half a century. This same mindset did not work for The Electric State. This is because it is a single, hauntingly beautiful illustrated novel published in 2018. I was first introduced to this book by a YouTube channel: Curious Archive. I've become a fan ever since. The original story is essentially THE Black Mirror episode to end all Black Mirror episodes. It is set in an alternative 90s where the world has been ravaged by war. It follows Michelle and her brother, Skip, as they journey through desolate America filled with giant, broken, mascot-looking robots as well as streets littered with dead or dying humans hooked to helmets called ‘neurocasters’. Their journey unveils disturbing truths about the technologic apocalypse. Essentially, The Electric State is an atmospheric horror experience that deals with humanity, connection and the use of technology. Meanwhile, the Netflix film, who had a $300 million budget, failed to capitalize on these elements and instead chose to tell a cliché action-adventure story about robots who wish to coexist with humans. While there are still themes of the original book in play, like a cautionary tale to unplug every once in a while, – it is more of an afterthought instead of the core conflict. To the film’s merit, the CGI looks decent, as it should be for the budget. And it is very interesting to see the book’s various bots made tangible and moving. However, it’s safe to say there will be no proper adaptation of The Electric State, so for those who feel like the film left much to be desired, the original book by Simon Stålenhag is absolutely more fulfilling."
  },
  {
    "rating": "4.5/5",
    "review": "Definitely recommend this movie! Critics, as usual in recent times couldn't be more off in their criticism. This movie shows creativity that a lot of filmmakers don't seem to have in the modern era. It's a perfect blend of emotions. Great movie!"
  },
  {
    "rating": "0.5/5",
    "review": "Adapting Stalenhag's masterpiece into this should be considered a violation of the Geneva Conventions"
  },
  {
    "rating": "5/5",
    "review": "Very good movie, dont let certified reviewers from rotten tomatoes put you away from this diamond!"
  },
  {
    "rating": "5/5",
    "review": "Literal, deberíamos admitir que la prensa del cine apesta ¿Quién está conmigo?"
  },
  {
    "rating": "5/5",
    "review": "This is an amazing family movie, my son loved it and it was a great to watch together. Don't listen to the critics, it doesn't have to be the same as the book to be great"
  },
  {
    "rating": "1/5",
    "review": "This move proves that money doesn't buy a great movie ! It was okay to pass the time but works neither as a grown up movie or a kids move. $320M is a lot to spend to make point that human contact is important !"
  },
  {
    "rating": "4.5/5",
    "review": "This is only a masterpiece for those of us my age who can appreciate the utterly massive amount of detailed clever precise and funny 1990's references. And I only caught maybe 50% after watching it twice. Hearing it cost 320 million to make - totally makes sense after wondering how much work went into two hours non-stop brilliant effects work. Is it better as a movie in whole than say E.T. or similar science fiction films that are kid friendly? No, music is dull, but its pretty funny and cute, and if you are between 45 and 55 years old it's equivalent to eating candy pretty much non-stop for two whole hours. People expect perfect movies for 300+ million, but its rare to come even close. This was my favorite movie I've seen in 15 years, just perfect if you are 50 and worth seeing even for those not familiar with the 1990's. 320 million buys cool things."
  },
  {
    "rating": "1.5/5",
    "review": "To be honest, I haven't even seen this movie yet and it looks awful. My mom wants to watch it with me and I was going to before I saw the trailers and read the reviews. Looking at it now I feel like the only good thing in this movie is my memory of stranger things when I look at Millie Bobby Brown."
  },
  {
    "rating": "4/5",
    "review": "Definitely a lot better than the critical reviews. I found it very entertaining and fun to watch."
  },
  {
    "rating": "3/5",
    "review": "It ain't Contact, but it ain't Pixel either. The critics seemed to be looking for a tighter script of Data's humanity trial with a much bigger CGI budget. It sure wasn't that, but, in fairness, it wasn't trying to be. The movie can be faulted for trying to juggle Millie Bobby Brown's sincerity and Chris Pratt's adventurous wisecracker. It was two stories that did not fit together. But it was an entertainment. It moved along well enough. It was fun to watch. The story was neither astonishing nor wholly original. But I liked it well enough, although I could have offered a couple of suggestions to the Russos. If they had asked."
  },
  {
    "rating": "5/5",
    "review": "I absolutely LOVED the movie! It took me with it emotionally and I was able to really feel the story and the characters. I even cried at the end!! The storyline is perfectly fitted to the actors Millie and Chris and how they're acting together is phenomenal! The movie is for every age - not like the original (simon smth). Yeah, some scenes I was like \"hmm I expected more here\" but isn't that with almost every movie??! All in all I ADORED and LOVED this money besides its critics - they are over the top - it's really NOT THAT BAD! I'm definitely gonna rewatch it a lot of times!"
  },
  {
    "rating": "3/5",
    "review": "Nothing preposterous but nothing special. Generic to its core. There’s almost nothing more I could even say. Slightly fun sometimes."
  },
  {
    "rating": "5/5",
    "review": "15% Critics review... you'd think this movie is absolute dogshit. WRONG! This movie was super fun and full of heart. Good for the family too... The visuals were stunning, the characters were hilarious in a very grim and twisted reflection of consumerism. Lots of moments really had me giggling... but this is a charming action comedy for sure."
  },
  {
    "rating": "5/5",
    "review": "I thought this movie was great, I'm hardly ever on Netflix but this movie grabbed my attention immediately. All of the robots are completely unique, the different scaling, designs and a little pinch of uncanny makes them pop out. I loved watching this movie. I'd honestly have to say that this is the best movie I'd seen since Ready Player One"
  },
  {
    "rating": "4/5",
    "review": "A classic Chris Pratt sci-fi movie. The Russos bring the same magic they have to many Avengers movies to this fun romp through a dystopian wasteland. Millie Bobby Brown's performance roots this movie emotionally, while I thought Giancarlo Esposito was underutilised. The dialogue was hilariously predictable, which honestly helped to make some of the jokes even better because I did not see them coming. This film rides its charismatic cast to victory!"
  },
  {
    "rating": "5/5",
    "review": "A genuinely good film."
  },
  {
    "rating": "5/5",
    "review": "Fun for the family."
  },
  {
    "rating": "5/5",
    "review": "Our whole family absolutely loved this movie! I am so glad we didn’t check the ratings beforehand because we might not have watched it. Admittedly, some of the scenarios require a leap of faith, but if 100% realism was required for a movie to be enjoyable no one would have watched Galaxy Quest , The Wizard of Oz or ET."
  },
  {
    "rating": "1/5",
    "review": "La película es un completo fracaso. Es aburrida. Sin sentido. Los primeros 30 min da sueño y el resto de la película no lo sé. \" ya estaba dormido\""
  },
  {
    "rating": "3.5/5",
    "review": "I liked it it was really good"
  },
  {
    "rating": "5/5",
    "review": "It was a perfect movie it had a perfect story the cosmo bot was great the characters where fantastic the villain was great and it was a deep movie."
  },
  {
    "rating": "5/5",
    "review": "This movie is goated. It feels real, it feels relatable, about some giant power hurting the little guy. I love it. Don’t know what the critics are saying."
  },
  {
    "rating": "2.5/5",
    "review": "bearable if you watch on 1.5x speed while doing something else"
  },
  {
    "rating": "0.5/5",
    "review": "A sensory endurance test and one of those movies that could only really be funded by Netflix, let's be brutally honest the majority of these streaming pick ups haven't been greenlit elsewhere for a reason. Occasionally you get a gem like Dolomite is My Name but the majority are over bloated messes which is certainly the case with The Electric State. No amount of cash and star power could save this complete shambles."
  },
  {
    "rating": "3/5",
    "review": "The Electric State (2025) The Special Effects Deserved a Better Storyline (11,590 – 05 Apr 2025 – by Claudio Carvalho) In 1990, the boy Christopher \"Chris\" Greene (Woody Norman) is a genius and pride and joy of his sister Michelle (Millie Bobby Brown). Meanwhile, the robots are protesting against their use by humans and on strike. There is a war between humans and robots, and the robots are winning the battles. Until the day the CEO of Sentre, Ethan Skate (Stanley Tucci), develops a technology to allow humans to upload their minds into drone robots using a helmet and the humans win the war. The robots are exiled in the Exclusion Zone and humans are forbidden to own robots. However, humans use the Sentre helmet to live in the virtual world while the drones work for them. In 1994, the rebel Michelle, who lost her family in a car accident, lives in several foster homes, and now with her abusive foster father Ted Finister (Jason Alexander). She has a problem at school when she refuses to use Sentre helmet during a class. During the night, a Cosmos robot visits her, and she fixes his voice. Soon she learns that the robot is her brother Chris, who is alive. She has an argument with Ted and flees from his foster home to seek out Chris’ whereabouts. She wants to find Dr. Clark Amherst (Ke Huy Quan), who told her that Chris was dead, but he is hidden in the Exclusion Zone. She finds that Ted buys forbidden goods from the smuggler John Keats (Chris Pratt) and looks for him at his address. But Ethan is aware that the Cosmos robot has escaped and looks for the veteran Marshall Bradbury, a.k.a. “The Butcher of Schenectady” (Giancarlo Esposito), to hunt down Michelle and the robot. Michelle and Cosmos meet Keats and his robot Herman, but they have been followed by “The Butcher”, in the beginning of a dangerous adventure of discovery and friendship while trying to rescue Chris. “The Electric State” (2025) is a sci-fi action movie in a dystopian society with state-of-art special effects and a cast with names such as Chris Pratt, Stanley Tucci, Giancarlo Esposito and Millie Bobby Brown. However, the film does not work well. First, the storyline is uneven, alternating a good idea with silly and corny moments. Stanley Tucci is a great villain, but Chris Pratt is not a great hero, and the robots steal the movie. In the end, “The Electric State” disappoints and does not deliver the expected by the viewer. My vote is six. Title (Brazil): “The Electric State” My Blog: https://maniacosporfilme.wordpress.com/"
  },
  {
    "rating": "4.5/5",
    "review": "I go into watching movies with 5 criterias... 1 - action : yes 2 - funny : yes 3 - cgi is actually good : yes 4 - a little sad : yes 5 - ENTERTAINING : yes Chris and Millie have amazing on-screen big brother - little sister vibes. The critics always have these insane mental check lists... if you want a good movie that entertains.. highly recommended."
  },
  {
    "rating": "4.5/5",
    "review": "I don’t know why people are upset by this movie… I thought it was great!"
  },
  {
    "rating": "5/5",
    "review": "I believe it’s an underrated movie with a lot of meaning, good cgi and good acting highly recommend!"
  },
  {
    "rating": "2/5",
    "review": "Huge budget for a huge flop"
  },
  {
    "rating": "5/5",
    "review": "Don't look at these \"Top Critics\" reviews. They are All crap and probably paid off. This is a great movie. Do yourself and watch a. Good heart felt and cautionary take. It a bit long, but well worth it. These \"Top Critics\" are trying too hard. Just have a good time!"
  },
  {
    "rating": "3/5",
    "review": "Not the greatest but not the worst it could of had more story to it though"
  },
  {
    "rating": "4/5",
    "review": "I think this moive was pretty enjoyable I do think it didn't have to be that long and there were a few things that didn't make any sense like the ending, it was nothing like the novel, but it was funny and enjoyable."
  },
  {
    "rating": "4/5",
    "review": "It's a little bland with It's action but love the ascetic. The acting is brilliant. I have a feeling it will become a cult fave."
  },
  {
    "rating": "4/5",
    "review": "I’ve just watched the movie. It was toned waaaaaaaaayyyyyy down from the book to reach younger audiences. It was Netflix’s choice and if you watch with this in mind, it’s a great movie. But if you want some of the darker/raw tones from the book, you will be disappointed. I’m ok with that, it opens opportunity for other adaptations more book oriented."
  },
  {
    "rating": "5/5",
    "review": "Watched this with the whole family and we loved it (my husband and me and our two daughters 8 and 11)! Great story, interesting concept, amazing effects, funny and touching. Don’t understand the bad reviews!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie is so horrible, it made me stop being suicidal because my life is more worth then this movie… 320 million dollars down the drain, as id life wasn’t hard enough as is, do not watch for your own sanity"
  },
  {
    "rating": "0.5/5",
    "review": "Netflix will never stop surpassing me. It falls lower and lower creating one poo bigger then last one. Movie - soulless action movie goo"
  },
  {
    "rating": "2/5",
    "review": "Weak plot for a post apocalyptic robot world, russo brothers did a great job only with marvel"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was an energy vampire. A lumbering slog of lowest common denominator writing with characters more cardboard than metal. An impressive waste of an amazing pool of voice talent and genuinely impressive vfx. It is a pity it's so brain meltingly dumb and predictable that you can't stay awake long enough to enjoy them."
  },
  {
    "rating": "3/5",
    "review": "As a popcorn movie, the Russo brothers' adaptation of Simon Stalenhag's graphic novel is, dare I say it, actually fine. Set in an alternative 1990s where robots were banished after a failed uprising against their human overlords, a surprisingly flat Millie Bobby Brown plays Michelle, who's searching for her genius younger brother she thought she had lost after a car accident which also killed their parents. Together with Chris Pratt's soldier-turned-smuggler Keats (a role he can play in his sleep by now) and his rather fun Russian doll-inspired robotic sidekick Herman, they uncover a dark secret Stanley Tucci's tech-bro-like baddie Ethan Skate is desperate to keep hidden. Whilst no one would argue that the familiar sounding story is not derivative, and some of the 'plot twists' are obvious, but the execution here is competent and entertaining enough for its 2hr+ runtime to whizz by painlessly. Visually, the retro-futuristically designed production has much eye-catching details that's amusing, almost delightful even, and the special effects are decent (bar that one brief but embarrassingly bad Photoshopped shot of Bill Clinton). While the ubiquitous Giancarlo Esposito manages to provide heft and menace with a practically zoomed in performance, miscellaneous Oscar/Emmy winners/nominees pop in for blink-and-you'll-miss cameos and there's an A(or at least B)-list of voice-actors led by Woody Harrelson and Anthony Mackie assembled to give life to the CGI robots. Compared to similar outputs from other streamers led by superhero/franchise stars on hiatus in between sequels, this is undemanding, watchable and actually nicely put together. Christopher Markus and Stephen McFeely's script ultimately holds itself together well enough in a pleasingly Amblin-esque manner, and had the film not been overshadowed by that antagonizing price tag of $300m and those Avengers-level expectations, perhaps it wouldn't, and shouldn't, be judged as harshly as it had by some."
  },
  {
    "rating": "3.5/5",
    "review": "Not for the Cynical Family-friendly sci-fi action/adventure with internationally recognized actors and a technically impressive production, particularly thanks to its wide variety of robots. It has a fun, fast-paced rhythm, straight out of the popcorn-movie playbook. It’s not going to win an Oscar—nor is it trying to—but I honestly enjoyed it way more than most of the films that usually get nominated for those monocle-wearing awards. I’m tired of reading negative reviews about Netflix’s latest movie. Most of them just can’t accept that something this expensive to produce is meant to be enjoyed. Some people hate CGI on principle, and others underestimate a great new-generation actress like Millie Bobby Brown. Is it the best movie of the year or one of the platform’s top titles? No. Is it a sci-fi film with a story that’s interesting enough for a broad audience, decently executed overall, and technically impressive? Yes, absolutely. For me, it’s a solid 7 out of 10. You can enjoy it at any time of day, with the whole family, and it’ll still hit the mark. Was it expensive to make? Sure, but that’s actually a plus for the viewer, not a negative. Honestly, I hope they spend even more."
  },
  {
    "rating": "2/5",
    "review": "Mediocre movie. Good CGI but really weak plot. 43/100"
  },
  {
    "rating": "0.5/5",
    "review": "utter tripe, made me double over in physical pain multiple times. It also dealt 1000 psychic damage to my soul"
  },
  {
    "rating": "1.5/5",
    "review": "So much noise, so little soul..."
  },
  {
    "rating": "4/5",
    "review": "Great visuals and overall a nice popcorn movie."
  },
  {
    "rating": "2/5",
    "review": "Visually kinda cool. Muting the audio would have made it better."
  },
  {
    "rating": "4.5/5",
    "review": "This film touched me in way I can't explain. Very deep for anyone who has suffered loss. If you're on your own spectrum - you will be moved."
  },
  {
    "rating": "5/5",
    "review": "This movie is a prime example of my dislike for RT's \"critics.\" Who are these people? Why is their opinion the only one that's seen when movies are shown with a rating outside of the RT website? Isn't the consensus of the *audience* the most important consideration? This movie is incredibly engaging. Boo RT critics."
  },
  {
    "rating": "1.5/5",
    "review": "Overly long and bizarrely very boring..."
  },
  {
    "rating": "2.5/5",
    "review": "Wasn't enough to take me completely away from me book. There was an early piece of music which set the tone non-too-well. The characters dint feel quite there, unbalanced qualities too. Mish-mosh. Wanted to enjoy it more than I did. 8.4.25 4.5/0. D.B."
  },
  {
    "rating": "1/5",
    "review": "They messed up. The kid came out of the coma. So why did she have to kill him? It makes no sense."
  },
  {
    "rating": "3.5/5",
    "review": "Best movie of the year so far, though so far it hasn't shined"
  },
  {
    "rating": "1/5",
    "review": "Not it. Not it. Not it. Not it. Not it."
  },
  {
    "rating": "5/5",
    "review": "An interesting film that has a strange and uncomfortable feel to it, and before watching it I was determined to hate it. However, despite its unfavourable reviews from the word salad brigade, 'professional reviewers', and my own prejudices, I ended up being entertained and engaged. I pity those who can't see its obscure charms."
  },
  {
    "rating": "3/5",
    "review": "With this movie's bloated budget, you would think it was going to be some kind of epic special effects blockbuster. Instead, we get a flat story, uninteresting characters and motivations but the bots are cool though."
  },
  {
    "rating": "4/5",
    "review": "Eff the critics, I liked it"
  },
  {
    "rating": "3.5/5",
    "review": "This movie is neither groundbreaking nor spectacular. However, it is entertaining enough to watch from start to finish."
  },
  {
    "rating": "5/5",
    "review": "Don't let the critics stop you...This was a good movie."
  },
  {
    "rating": "3.5/5",
    "review": "Far better than the reviews and comments I've seen. I watched this back to back with Borderlands, and this was far better of the two. I would like this as a TV series, something like the Twisted Metal TV series. Then I would have had a chance getting to learn the characters more. I liked the twist and turns of the plot, and the actors fit their roles more or less perfectly."
  },
  {
    "rating": "2/5",
    "review": "Boring,pointless and Ai should’ve replaced CGI.all those said is a great movie,is brainless!!"
  },
  {
    "rating": "2/5",
    "review": "Was not an easy watch, and I really didn't care about the characters, which makes viewing tough. Looking through the audience reviews, I see a lot of comments about the critics, but it's important to not let our personal thoughts about critics dictate how much of a pass we give a movie. This was an average story from the jump, nothing special happening here."
  },
  {
    "rating": "3/5",
    "review": "The critics yearn for AI to replace them……. The movie was entertaining, had great CGI, and contemplated ideas that are timely. We live in a strange period, and the movie is probably too on the nose in some respects for the critics, but the reality is not everyone sees the message being conveyed as self evident. I’m glad young people will watch this movie and will be forced to consider its message, even if for just a moment. More stuff like this, please."
  },
  {
    "rating": "5/5",
    "review": "I Loved it hope their is a second.its a movie don't need to think to hard"
  },
  {
    "rating": "1.5/5",
    "review": "Just wasn’t happening for me. Great cast but was entertained at all. If this had been released at the cinema I doubt very much that I would have gone to see it."
  },
  {
    "rating": "4/5",
    "review": "Professional critics need to touch grass once in a while, this movie is fine. I've been a fan of Simon Stalenhag's work for longer than most people have even heard of him, and although this adaptation of The Electric State is certainly not without criticism it is not one star levels of bad."
  },
  {
    "rating": "5/5",
    "review": "Sometimes I don't agree with critics, sometimes I do. I have never seen such a good movie so lowly rated by critics. It's dumfounding. You literally have to have a hatred for science fiction and even a little bit of humanity to not find something to like in this movie."
  },
  {
    "rating": "4.5/5",
    "review": "The film is really underrated because of its budget and Netflix, but you can see a lot of affection and an interesting theme that entertains you and seeks to generate compassion for non-human beings. It has a good story and a very important message behind it."
  },
  {
    "rating": "3/5",
    "review": "The Electric State It's a completely different film from the entire history of the Russo brothers, its narrative is quite interesting and positive for its execution, but I think Netflix is not very confident with the project."
  },
  {
    "rating": "1.5/5",
    "review": "An entirely forgettable film with characters as underdeveloped as the world they occupy. Brown's lackluster performance is more a consequence of the dull, poorly written character than her own acting. Pratt reprises his role as a fast-talking lead, but his energy feels mismatched with the film's overall tone. While a handful of visuals stand out as impressive, they do little to redeem this two-hour slog."
  },
  {
    "rating": "5/5",
    "review": "Although not the best movie or something so cinematically perfect, but it was still a BEAUTIFUL movie. The idea was enticing, the passion in the emotional scenes was good, and the CGI was EXCELLENT! Multiple messages can be pulled from it. “No one’s ever truly forgotten” and “Anyone can change the world” are the first 2 that come to mind. I really recommend this movie to anyone and everyone, as it’s a great family movie, as well as a great 1-on-1 movie. Plus, I cried twice. I’m not really a cryer, and this is the first new movie that’s made me cry in a long time."
  },
  {
    "rating": "4.5/5",
    "review": "Don't get all the hate, I thought the movie was thoroughly entertaining! I feel like people forget that not every film has to be thought provoking masterpiece...this was a fun, fast paced flick that made me laugh, cry and cheer."
  },
  {
    "rating": "5/5",
    "review": "I loved it! I get why others don’t also. But I feel like this movie is ahead of its time. Maybe people will appreciate the artistry and message of it in the future. Millie, Chris, Tucci!! Gian Carlo, Ke Huy, Woody…list goes on. Dream cast. It’s such a fun movie to watch with all the incredible looking robots!! its visually stunning. The bad reviews I feel like are of people who went into it wanting way too much depth. This movie is a FUN watch. So happy I didn’t miss out on seeing it because of bad reviews."
  },
  {
    "rating": "4.5/5",
    "review": "The critics have no clue what they are talking about. They are so focused on finding every flaw about a movie and reviewing it based on the budget, directors, and specifics of a movie they forget to actually enjoy the film. The film was well put together, with a story that built up to a final moment, getting increasingly emotional. The story left the viewer asking questions, and when one question was answered another one was asked, which helped build the storyline. As an honest review, it was a great watch. I also want to note how the critics try and speak in the most eloquent English possible instead of actually enjoying the movie. Just look at the difference between the critics ranking and the audiences, it really shows."
  },
  {
    "rating": "3.5/5",
    "review": "The electric state doesn’t deserve the heavy criticism because it is in fact a lot of fun. It’s a very enjoyable watch even though it will probably be forgotten and there’s nothing to extraordinary going on. The story is interesting and the cast does have emotion even during moments where the script has uninspired moments. The special effects are actually very impressive too, if you don’t like the story at least that will keep you interested. 7/10 critically it might not be that spectacular but it is very entertaining and will be enjoyed once it finds it’s target audience."
  },
  {
    "rating": "4/5",
    "review": "Im failing to see the critics consensus on this one as it's nostalgic and adventurous tone makes for a great time with some excellent visuals and fun action moments. Although the story isn't entirely new it still manages to be engaging and heartwarming. I would gladly welcomed a sequel, although i understand some criticisms of the budget behind the film."
  },
  {
    "rating": "5/5",
    "review": "I loved it! Millie Bobby Brown and Chris Pratt were great and the story was so unique. the sci fi story is something I always enjoy"
  },
  {
    "rating": "1/5",
    "review": "copy pasted a story about ai robots vs humans , and even worse they got chris pratt to drive it down hard into the toilet head first ."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed the movie and was Entertained throughout it. I was not aware of the graphic novel of the source material, but after watching the movie, I’m most likely purchase the books that this movie was based off of. I also understand that the movie is different from the source material. That doesn’t mean I can’t enjoy each version."
  },
  {
    "rating": "3/5",
    "review": "Good movie with good music and characters."
  },
  {
    "rating": "5/5",
    "review": "Gostei do filme, por mais que seja um pouco genérico. Eu gostei! Eu assistiria novamente."
  },
  {
    "rating": "0.5/5",
    "review": "She was better brunette. Good though."
  },
  {
    "rating": "5/5",
    "review": "I watched this movie with my kids and we really enjoyed it. It was very entertaining, funny, and heartwarming. Was it Oscar worthy? No. But it is a great family movie, nonetheless."
  },
  {
    "rating": "4/5",
    "review": "Critics are so out of touch and write like a bunch of AI bots. The movie is entertaining, has a good pace, story is good enough, graphics are sweet. Is it predictable? Yeah. But who cares? Sometimes people just want to be entertained and let’s face it, most of us are not those “sophisticated palette” people who can only dine on the “finer things” in life."
  },
  {
    "rating": "4.5/5",
    "review": "Movie was great. Has heart. Likable characters. And great effects. Throughly enjoyed it…..I don’t know what movie the “experts “ were watching."
  },
  {
    "rating": "2.5/5",
    "review": "This movie is for a generation of people growing up on Marvel and similar properties, believing that CGI and easy stories are all cinema has to offer. But it's ultimately heartless and uninteresting and not worthy of the medium. It's a shame, it could really have been something, and it's sad to see that so many seem to think that this is all a good movie can be."
  },
  {
    "rating": "5/5",
    "review": "I can’t believe all the horrible reviews!! The critic reviews are giving jealous/troll vibes though I have no context of the reasoning. I found this movie creative, soulful, and the perfect cinematic escape into a different world. Incredible acting, funny, and sentimental- it provided everything I could ask for a Friday night movie with my husband. Delightfully wholesome and fun."
  },
  {
    "rating": "5/5",
    "review": "I thoroughly enjoyed this film, and thought it had a great story with a good cast of characters to keep it moving along, from start to finish. The cgi effects were well done, but it came down to the relationship between the sister and brother that pulled this one off."
  },
  {
    "rating": "1.5/5",
    "review": "The two best words to describe the movie would be \"Souless\" and \"Corporate\". Nothing about this movie is creative or inspiring. The whole thing feels like it was thought out in a board meeting room."
  },
  {
    "rating": "5/5",
    "review": "Not sure what it is but many of you are putting your trust in these weirdos to decide if a movie is good or not. This movie did its job. It entertained me for 2 hours. Watch the movie yourself and craft your opinion afterwards."
  },
  {
    "rating": "5/5",
    "review": "This is a really great and epic movie."
  },
  {
    "rating": "5/5",
    "review": "A fun and whimsical movie that was a breath of fresh air as opposed to the rehash and remakes of other movies. I thought The Electric State was fun and visually appealing. It had a great message at the end. I loved it!"
  },
  {
    "rating": "0.5/5",
    "review": "Note to HBO, Netflix and Apple.... Please stop giving money to the Russo brothers......The people who are paying your subscription are over 15 yrs old.......or at least demand better! Gray Men, Electric State, Citadel, Cherry....do I have to bring up the Marvel crap?"
  },
  {
    "rating": "1/5",
    "review": "Really weak script and Chris Pratt can’t save this boring and pathetic movie, I know the Russo brothers can do better."
  },
  {
    "rating": "5/5",
    "review": "Very emotional, and amazing CGI. 10/10 best movie of 2025 so far."
  },
  {
    "rating": "0.5/5",
    "review": "Nothing interesting happens in this movie at all, the robots and drones look like cheap designs with no imagination, and then when the girl kills her brother because people using drones (phones in the real world) is bad ommkaY? That made the movie irredeemable."
  },
  {
    "rating": "3.5/5",
    "review": "It was a good movie, with a lot of fun moments. The movie is a bit exaggerated for real life, but that is what makes it so fun to watch. So overall a very good movie that will definetely make you laugh!"
  },
  {
    "rating": "5/5",
    "review": "Thoughtful, timely commentary, some clunk but lots of fun and nostalgia."
  },
  {
    "rating": "0.5/5",
    "review": "Waste of time. Could not get into it at all."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie, but could have been better. Some scenes their wasn’t any connections between the actors you could feel it, and some others the acting wasn’t amazing. Some moments their robots looked kind of weird to me, specially with the amount of money they used to create that movie. But hey, some moments were actually pretty good, and it is definitely a movie you can watch just to pass time and you know, enjoy a story without thinking too much."
  },
  {
    "rating": "4/5",
    "review": "We enjoyed it and think its worth a watch. Good Netflix level movie where you don't have to think too much. Pretty well done."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. I thought was adventurous and comedic. The cast was amazing of course."
  },
  {
    "rating": "2/5",
    "review": "Too slow with little suspense. Barely made it through the first hour of this 2 hour movie."
  },
  {
    "rating": "2.5/5",
    "review": "As the kids say, it was mid. Not bad but not good."
  },
  {
    "rating": "5/5",
    "review": "Love this film! Adorable and funny!"
  },
  {
    "rating": "4.5/5",
    "review": "Gostei do filme, tem efeitos interessantes, abriu espaço para uma nova história."
  },
  {
    "rating": "1/5",
    "review": "I honestly don’t understand how this movie was meant for adults—it was way too silly to take seriously. The plot was all over the place, the dialogue felt like it was written in five minutes, and the characters were completely one-dimensional. It was honestly a waste of time, and I kept hoping it would get better, but it never did. The only thing that stood out was the graphics, which were actually impressive. If the same effort had gone into the story and characters, it could have been decent. But as it is, I wouldn’t recommend it to anyone."
  },
  {
    "rating": "3.5/5",
    "review": "Parecería que, al saber todo el mundo el costo de la película (USD 320MM) La misma tiene que ser sí o sí una genialidad, pero no es así con ese criterio todas las películas independientes deberían ser malas, lo mismo aplica para las de bajo presupuesto. El costo no tiene que condicionar el visionado y me da la impresión que esta información y los antecedentes de los directores de películas anteriores (Avengers Infinity War y Avengers Endgame) pusieron la vara muy alta a la hora de juzgar esta película, que mi entender, es buena, es entretenida, se deja ver y por momentos emociona. Técnicamente es perfecta y aunque el guión puede tener algún punto flojo, no entiendo el ensañamiento de la crítica con esta película. Yo recomiendo que la vean."
  },
  {
    "rating": "3.5/5",
    "review": "I enjoyed the film as a whole, however I feel it was very predictable at times. Overall though, a great film!"
  },
  {
    "rating": "5/5",
    "review": "Glad I didn't listen to the \"critics'. It's a fun, thought provoking, yet light hearted, family oriantated Sci-fi flick. Yes the plot may be a little predictable at times tho it still had plenty of twists to keep it interesting. The action scenes are immersive with incredible CGI. Definitely worth a watch."
  },
  {
    "rating": "5/5",
    "review": "Ignore the critics, solid movie, kids loved it."
  },
  {
    "rating": "3/5",
    "review": "Definitely not Guardians of the Galaxy but actually entertaining. In this day and age of AI , it actually has relevance, though the plot here is somewhat suspect. A fu movie for the syfy fans, but could even be a cult movie for the Young generation"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Good laugh combination of laughs and action. I thoroughly enjoyed it"
  },
  {
    "rating": "0.5/5",
    "review": "Absolute trash. So bad this is the first time I've felt compelled to sign up and post something. Terrible dad jokes. Basic obvious predictable plot. Zero surprises or twists."
  },
  {
    "rating": "1/5",
    "review": "Aimed for mildly humerous and fell short. Predictable storyline with none of the depth needed to engage and some sizable plot holes."
  },
  {
    "rating": "5/5",
    "review": "I don't know what the so-called critics are smoking, but this movie is great. It has the aesthetics of the book. The adventure road trip find yourself in a dystopian retro alternate sci fi world that the electric state is supposed to be about is all there, albeit with a bit of a tear down the corrupt system schtick added on top. It has the retro robots, the neurocasters. Don't really know what more you could want/expect short of the bliss of a neurocaster."
  },
  {
    "rating": "3.5/5",
    "review": "I really like the movie. I have seen it many times."
  },
  {
    "rating": "1.5/5",
    "review": "Lack of direction/plot and character building. A movie with a solid budget, book and talent that should have been much more."
  },
  {
    "rating": "4.5/5",
    "review": "I almost didn't watch this movie becasue of the savage reviews until a mate suggested that the critics were by and large 30-somethings and up, so weren't the primary demographic. They forget what it was like to enjoy a movie as a kid or YA. When I watched it with this perspective – which is to say, not critically – the movie was fine. Chris Pratt playing Chris Pratt wasn't the more adventurous choice, and Millie Bobbie Brown playing a high schooler was an odd casting option. I got over it. Plot gimmicks and holes? Sure, but just sit back and enjoy the ride. It's not Oscar fare anyway. The '90s nostalgia alone was fun, though I admit that I think they were relying on this aspect to draw in more interest. The CGI was decent, too. If I were to rate this without this consideration, it might be a 2.5 or 3.0, so do yourself a favour, and shut off your brain for a couple hours."
  },
  {
    "rating": "4/5",
    "review": "Never read the book, but because of this movie I plan on buying the books, seems interesting. As for as the movie goes it's a pretty good movie. I'm mature enough to realize movies are never like the books so I never expect them to be."
  },
  {
    "rating": "5/5",
    "review": "I don't understand all the hate. This movie was a lot of fun. I thought MBB gave a great performance and that the effects were amazing."
  },
  {
    "rating": "1.5/5",
    "review": "By all accounts, this movie should have been good, but it wasn’t. The premise, source material, and budget are all solid, and yet there’s really not much to praise about this movie. That said, I’ll start with what little I can: Visually, the movie looked pretty good. Not necessarily the cinematography, but the art design and effects. A huge part of that is because of the artwork of Simon Stalenhag that this movie is based on. That said, I have to give credit to the movie for sticking with the aesthetic and not trying to change what works. The other thing I can praise is the music. There were a few moments that *almost* made me feel something thanks entirely to the music. Unfortunately, the movie was a disaster in every other area. It has some of the worst dialogue and most obvious product placement I have ever seen. The story is close to being good, which somehow makes it worse when it falls short, and the actors are all clearly phoning it in for a paycheck (if they’re not, that’s even worse). The worst part of this movie is that you can tell they thought it was going to be really good. There are so many moments and lines that feel like they’re supposed to be heavy hitters, but it all falls flat. Honestly, this movie should be studied for how hard it fumbled"
  },
  {
    "rating": "4/5",
    "review": "Funny, easygoing, and genuinely enjoyable. Did Panda Express dirty though. 🤪"
  },
  {
    "rating": "4/5",
    "review": "Do not listen critics, to me this was fun movie to watch"
  },
  {
    "rating": "1/5",
    "review": "Well, i wasn't in an electric state watching this. A 320 million garbage dump of a film, this super flat, uninteresting and generic watch that not only misses when it comes to character and story- but also when it comes to its most pivotal aspect, its action. Millie Bobby Brown and Chris Pratt are merely okay with the material they are served, and the material they are served is god awful."
  },
  {
    "rating": "4/5",
    "review": "This is a fun little campy adventure. The critics are too serious. I never read the book so I can't compare, but the movie stands on its own as a family appropriate movie."
  },
  {
    "rating": "4/5",
    "review": "Critics annoy me so much, but also, I always need a good laugh so I read their sour notes. This movie is pretty good! Wife and I enjoyed our watch. Fun visuals, good humor, and an enjoyable sound track and story. It’s not gonna be the best movie out there, but you won’t regret watching it."
  },
  {
    "rating": "1/5",
    "review": "Fell asleep twice trying to watch it."
  },
  {
    "rating": "4.5/5",
    "review": "Don't listen to the bad reviews, This film is an awesome pick if you're looking for something to watch, The main criticism is about it Being dull and 'straying too far from the book' but as a film itself, it's amazing! To the likeable characters (Herman specifically lol) captivating plot that slowly unravels the truth of the antagonising company in the film, I might be biased since I'm an avid Transformers fan so I LOOOVE anything with sentient robots in it so take my review with a pinch of salt. In summary, It's no where near as bad people say it is, and DEFINITELY worth the watch."
  },
  {
    "rating": "5/5",
    "review": "I didn't know what to expect with this movie but I'm happy I saw it. I'm shocked by all the negative reviews because this movie was actually really good. I think it's worth a watch. The acting was good, the CGI was great, and I felt that there were a good amount of twists and turns in it."
  },
  {
    "rating": "1/5",
    "review": "Mindnumbing tedium after the first 5 minutes. Chris Pratt was not his recognisable GoG self and although Millie Bobby Brown rang out every last emotion, the effort was wasted. A flat boring creation that I ended up fast-forwarding for most of it's duration. Pure unadulterated drivel."
  },
  {
    "rating": "4/5",
    "review": "The Electric State is a fun, whimsy fairytale with Dad humor and some really cute characters. Sure, the story is predictable as is the ending, but this movie invites you on a journey through an imaginative dystopian future. Notice I didn't say \"far fetched\" or \"ridiculous\". With everything we know about AI and robotics advancements... who knows? The writers took a couple of jabs at the current state of politics, which is the only reason that I can imagine someone would rate this under 3*s and getting everybody all upset. Check it out, It isn't going to sweep the Oscars, but the loveable characters might just sweep you off your feet."
  },
  {
    "rating": "3.5/5",
    "review": "After seeing a few post on this movie I figured I'd give it a shot. So late night and a good snack I put on Electric State. Over all it's ok movie. Electric State based on a book and now turned into a movie is ok. I'd say not great but it's not bad also. Acting is ok. Millie Bobby Brown and Chris Pratt do an ok job. What I liked was some of the robots and the flash back putting the movie in an alt 1980 - 1990 era. What kills the story is that there so much info in the movie and it feels rush. The character/world building is don't poorly. This just does not feel like a movie that so much money was put into it. Over all if you got nothing else to watch and want to watch a fun movie that requires very little to put your thoughts into I'd say watch it."
  },
  {
    "rating": "5/5",
    "review": "This movie was really good! Only reason I’m guessing it got bad reviews is because Chris Pratt is republican……."
  },
  {
    "rating": "3/5",
    "review": "The Russo bros direct an action-packed popcorn movie with lots of cool visuals but none of intelligence. To perfectly describe The Electric State is to put the words mindless and entertaining in the same sentence. The movie offers an interesting twist on the dystopian genre by taking place in the 90s, creating a futuristic yet nostalgic world where humans and robots struggle to coexist. While this premise sounds exciting, it’s sadly not executed to its fullest potential. The acting is on par with Netflix productions considering how flat the characters are, and the visuals are heavily reliant on CGI as usual. The Electric State’s biggest advantage is that it’s fun to watch despite its many imperfections."
  },
  {
    "rating": "1/5",
    "review": "This isn't a movie, it's a tax write off. It drags, it's boring, it's predictable, the characters don't feel like characters, the jokes aren't funny or clever. Just your standard Netflix movie slog. Don't waste your time"
  },
  {
    "rating": "4/5",
    "review": "Decent film to watch with the kids…. Bit of 90s nostalgia mixed in & some good fx and action"
  },
  {
    "rating": "4.5/5",
    "review": "This is why I never listen to the critic's. This movie had heart and was enjoyable. By no means perfect but definitely one of the better movies I've seen."
  },
  {
    "rating": "5/5",
    "review": "Is incredible how the critics, rate Emilia Perez, an absurd almost insulting movie 75, and rate these movie wich is very fresh and with a interesting anachronism of what we're living today displayed on the 90's definitely recommended kids will love it also adults, a perfect shown that the critics work are more bounty than real focus"
  },
  {
    "rating": "4/5",
    "review": "Never trust professional critics. This movie wasn't the greatest, but for the majority of critics to hate it as much as they did is ridiculous. A watchable movie that was entertaining. Remember, these are the same critics who gave Anora a 93% tomatometer and best picture this year, which is a travesty of the highest order. The pretentiousness of film critics is astounding."
  },
  {
    "rating": "1/5",
    "review": "Good graphics poor plot and acting."
  },
  {
    "rating": "0.5/5",
    "review": "(Spoiler) Pro-Tip for future screenwriters, don't make the audience root for the brother-sister reunion through 95% of the movie then have the sister kill the little brother at the end. I cant believe this has to be written down. Movie was fine, would have done better if you know, the sister hadn't killed the brother at the end. The sad attempt to suggest the brother wasn't dead in the final reflection was way too little too late. Hes dead. She killed him. Nobody cares about the storyline after that."
  },
  {
    "rating": "2/5",
    "review": "This movie is one of the best examples that hiring fan-favourite stars and putting millions into graphics cannot make a good movie. The story is good, but movie quite miserably failed to tell it. I'm a crybaby that gets teary in seconds as soon as I see characters going through all kinds of emotional stuff, but this movie failed to develop any character connection with the viewer. I was watching emotional scenes where I knew I would normally be balling my eyes out but I felt nothing. Also, quite a few lines that were intended to be jokes felt like silence fillers written by AI that was fed some old joke books."
  },
  {
    "rating": "5/5",
    "review": "It was fun to watch while it was expensive to make. I honestly think it was very good and worth every penny, it looked as if they tried really hard on making the movie. To call this their passion project bad would be hateful to the specific group of people this was ment for."
  },
  {
    "rating": "5/5",
    "review": "Both me, my gf and her friend loved this movie. There were a few flaws with our resident bad guy Giancarlo E. Character, mostly early on but its otherwise a great ride. Disclaimer - we havent seen or touched any related media, which seems to be at the core of many complaints. We simply enjoyed it as it was and we all thought it deserved a theatrical run if anything !"
  },
  {
    "rating": "5/5",
    "review": "The film has an engaging narrative, combining lightness and entertainment effectively. The script is well-structured and coherent, sustaining a plot that keeps the viewer's interest from start to finish. The production stands out for its technical quality, showing meticulous care in every detail. The cast, made up of renowned actors, delivers solid performances that enrich the cinematic experience, providing memorable moments for the audience."
  },
  {
    "rating": "1.5/5",
    "review": "Such good actors for such a poor performance, expected a lot more to be honest."
  },
  {
    "rating": "5/5",
    "review": "Loved this movie. Finally something different from Hollywood. Was so tired of the same old stories being remade."
  },
  {
    "rating": "3.5/5",
    "review": "Critics are funny with their ratings. I always bypass the critic ratings and go straight to the real people ratings and this movie is no different. Yeah, it's not going to win any awards but this was an entertaining movie. That's all you could really ask for."
  },
  {
    "rating": "5/5",
    "review": "Really creative, really funny, and completely enjoyable! We loved it. Great performances by the human actors and the voice actors. Such attention to detail and so funny!"
  },
  {
    "rating": "4.5/5",
    "review": "I like the actors. I really liked the character design. I am not sure why it got such bad audience / professional reviews. I am into this movie. Also, just found out there were book so I am not coming in as a fan. Robots good."
  },
  {
    "rating": "3/5",
    "review": "At first was all talking which made me sleepy. After a while surely got interested"
  },
  {
    "rating": "4/5",
    "review": "Critics got this one wrong. It was a fun watch!"
  },
  {
    "rating": "2.5/5",
    "review": "Cool concept for a movie that starts strong with good pace but eventually gets stuck in the mud and finishes flat."
  },
  {
    "rating": "5/5",
    "review": "I really liked it. A completely different world."
  },
  {
    "rating": "5/5",
    "review": "Na boa como considerar a avaliação de menos de 200 pessoas que se dizem críticos especializados, em frente a mais de 2000 pessoas kkkkkk esses críticos especializados não passam de palhaços pra mim kkkkk bando de lixo comprados kkkkkkk"
  },
  {
    "rating": "4/5",
    "review": "Don’t really know why the critics hated this movie. I thought it was fun and entertaining. It made me laugh and cry and had a great soundtrack."
  },
  {
    "rating": "5/5",
    "review": "A great movie if you are afan of the books it is a must see if you believe in the fact about today's society and our dependency on url lingo it's a great watch for everyone 😊 and my 11 year old loved it and wants to see the a sequel based on the books thank you for doing it justice we as a family loved it"
  },
  {
    "rating": "5/5",
    "review": "I know most people now don't remember the actual book, or can take the time to actually enjoy this movie, and yes I know most critics say it's bad but if your my age and can remember the books and are an actual gen xer or a xellenial the music and the back story are truly a blast from the past and yet seem to highlight the current state of the world today as a slave to electronics and, being afraid to offend people, honestly love this reminds me of a newer batteries not included meets short circuit and absolutely must see and my 11 year old loved it"
  },
  {
    "rating": "5/5",
    "review": "This movie doesn't have any political nonsense which probably explain why the critics are so critical of it. If you want a good family movie, your kids will love it and both my wife and I enjoyed it. The only way to keep these critics happy would be to see Chris Pratt in skirts and confused kids without a direction. This a very nice, no nonsense, family movie. Good story and character development. Comedy, acting, graphics were all amazing. At this point, just ignore the critics as they are disconnected from reality just as much as Hollyweirdos are."
  },
  {
    "rating": "5/5",
    "review": "While the humour element was a little sawn, it's a tremendous film. All the 90s nostalgia you could want."
  },
  {
    "rating": "5/5",
    "review": "I thought this was such a fun movie. Felt like a lost 90s movie with modern vfx."
  },
  {
    "rating": "4/5",
    "review": "Wow I really dont get the hate behind this movie, it was extremely fun and entertaining to watch and I genuinely had a lot of fun while watching it. Even though It sometimes was a little bit hard to watch because of the corniness or the bad writing it still matched up to a good movie overall, the action was pretty entertaining and the story itself was decent, the end overall was very corny but still it doesn't make it bad because overall from start to the middle it was one of the most entertaining movies I have seen the whole year, and I almost forgot to say that the cast was incredible, the actors you got are really incredible, especially Chris Pratt in this movie was cool I really liked his role and he also was pretty funny."
  },
  {
    "rating": "1.5/5",
    "review": "So predictable Bad dialog Cringy Surprised by the corporate tie in w Planters Peanuts Voice over for Mr Peanut was really good Terrible Cringe of a movie Sorry Chris a nd Millie"
  },
  {
    "rating": "5/5",
    "review": "I sat down with a group of family and friends to watch this movie and was pleasantly surprised to find a refreshingly witty and polotics free movie in the year 2025! I hope this trend continues as this is at least in my opinion, one of the biggest issues in modern day entertainment. There's a lot of people who still just want to laugh and enjoy story telling, without the feeling of being preached at. I'm flabbergasted as to why so many individuals have posted negative reviews on this, but something tells me it's entirely political. Anyway, the acting was fantastic and the writing was hilarious and gripping. 5/5 stars from me and the other 9 folks who watched it with us. If you liked Guardian's of the galaxy and Chris Pratt, give it a watch for yourself and you decide! Just leave your polotics at the door and enjoy the Movie! 😁 🎬"
  },
  {
    "rating": "3/5",
    "review": "O filme não é ruim, o roteiro é simples e a intenção do filme são muito boas, mas o roteiro as vezes meio que forças certas cenas. Ele tem muitas copias de varias filmes, não é muito criativo em quase nada. O filme é salvo pelo bons atores que estão nesse filme, só isso mesmo."
  },
  {
    "rating": "3.5/5",
    "review": "I thought the movie was a fun watch. It was somewhat predictable. Over all if you enjoy kind of silly robot war, lost family type of movies, this is a pretty good one."
  },
  {
    "rating": "3/5",
    "review": "Should it have been better, absolutely, but it wasn’t that bad"
  },
  {
    "rating": "2/5",
    "review": "I wanted to like this movie. Name actors, yes! Robot wars with humans, yes! Mr. Freakin Peanut leading the robots, heck yes! Lots of talking, not a lot of action. I don't mind lots of dialog if it goes somewhere. More unbelievable acting. They simply do not act like anyone in their situation would act. It takes away from the movie. It was often boring."
  },
  {
    "rating": "4/5",
    "review": "Sometimes professional critics and the public we are not in the same page. Exactly what is happening with this movie. But guess what. In such cases it's our opinion that really matters and this is a unique, fresh, idea wrapped in a great, fun to watch, movie with mind blowing special effects, wonderful photography (for that kind of movies) and actors that you can tell they were having fun playing, deliverng something that you will not regret watching."
  },
  {
    "rating": "3/5",
    "review": "Interesting concept but far too PG13 for my liking. Needed to be darker and with more action. Felt like a bad Disney live action remake when it could when have been much more."
  },
  {
    "rating": "4.5/5",
    "review": "Honestly, I really liked it a lot. It's the kind of movie that someone who loves post-apocalyptic and dystopian settings would enjoy. I loved how the robots were initially presented as somewhat heartless and the ones who started the war, but later, they feel more human than the actual humans. You end up empathizing with their motivations and what drives them. A very good movie, definitely worth watching!"
  },
  {
    "rating": "5/5",
    "review": "Realmente me encantó super recomendada"
  },
  {
    "rating": "5/5",
    "review": "The critics dont like this movie becuase Chris Pratt is a christian. This show is 4/5 from Google users and 70% audience score on RT. Don't listen to critics. Show was funny, very well produced action scenes and special fx, nostalgic weird and well done robots........and it had Chris Pratt in it playing Chris Pratt. It has george Castansa......What's not to like. My 7 year old and my wife loved it. It was a good movie. Start to finish. I'd watch again."
  },
  {
    "rating": "4/5",
    "review": "A nice sundays afternoon movie, super enjoyable."
  },
  {
    "rating": "5/5",
    "review": "Movie made me cry it was beautiful 🥹"
  },
  {
    "rating": "5/5",
    "review": "Wow, the criticism of this movie from the “professional” critics is pretty intense. I think you may have forgotten the point of movies. This movie was extremely entertaining and satisfying. Could it have been better, probably; was it good enough, definitely! Worth watching."
  },
  {
    "rating": "5/5",
    "review": "Loved this movie! It kept me and my family entertained the whole way through. Cute touchy feely moments and an awesome soundtrack to boot. Alan Silvestri never disappoints. Ignore the negative reviews and see this movie! 💯 😀"
  },
  {
    "rating": "2/5",
    "review": "Impressive effects and occasionally entertaining lines cannot salvage a painfully boring script and a poor pair of protagonists into anything worth remembering. The lightshow might distract you for an evening, but any of the other mediocre schlock you pass over whenever you open a streaming service would do just as well."
  },
  {
    "rating": "5/5",
    "review": "The term “electric state” could refer to a few different concepts depending on the context. Here are a few possibilities: 1. Electric Charge State: This refers to the condition or quantity of electric charge an object or particle possesses. Objects can have a positive, negative, or neutral electric charge, which determines how they interact with other charged objects. 2. Electric Field State: In physics, this might refer to the state of an electric field, describing the distribution and strength of the electric forces exerted by charged particles in a given area. 3. Electric Potential State: The state of electric potential or voltage at a point in space, related to the work required to move a unit charge from a reference point (usually infinity) to that point. 4. Electric State in Solid-State Physics: In the context of materials science or electronics, this could refer to the specific conditions or arrangement of electrons within a material, such as the energy state of electrons in a conductor or semiconductor. Also, when is stranger things 5 coming out Millie"
  },
  {
    "rating": "5/5",
    "review": "Like the story line and premise, it reflects on what's going on in the world today. People be glued to a cellphone all the time. Nice sci-fi movie with a neat ending and message for all of us..."
  },
  {
    "rating": "5/5",
    "review": "my kids loved this movie.."
  },
  {
    "rating": "4/5",
    "review": "I like the movie. There were laugh out loud moments and tears too. I liked the characters, even the bots. Especially the bots. I liked the scenery around Moab and the VW bus. I liked the symbolism of the people putting on the helmets; seems similar to people having their heads down all the time looking at their phones."
  },
  {
    "rating": "5/5",
    "review": "ABSOLUTELY worth the time to watch it. Its a little slow at a few points but still a great movie that i highly recommend watching. I never leave reviews, but after seeing how wrong the critics were I felt like adding my vote to this. Wonder who told the critics not to like this one.. sad."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed the film I would rewatch it again and if you like droid related films I suggest this"
  },
  {
    "rating": "2.5/5",
    "review": "It's a decent film; it's not a complete disaster. It has many flaws and a weak script, but it has its moments where it shines and shows off its budget, which is more or less what one would expect to see in a film like this. Perhaps it deserved a run in theaters to appreciate its technical and sound work, but hey, it's a high-budget streaming film, and we have to settle for that. The result is an acceptable film that will not be remembered and will be a shining example of the 2025 film industry."
  },
  {
    "rating": "5/5",
    "review": "Really enjoyed the movie. It was fun and entertaining and great to watch with my daughter. Critics were way overthinking it. Much better than the Marvel superhero movies that I fall asleep watching."
  },
  {
    "rating": "4/5",
    "review": "It’s an interesting movie but the product placement is way too obvious and very irritating. I have to say the actors were okay. Chris Pratt’s role is almost a carbon copy of many of his roles he’s played in the past. I walked into this movie thinking it was one of the worst movies ever and I was close to being correct. However if you played this movie in the background of doing something you wouldn’t want to look up to see what’s happening. The plot is very predictable and contains many loopholes. I am a fan of the art book and I have to say this was a let down. The cgi was nice yet the plot couldn’t follow suit. I did enjoy watching this movie even though there were many negatives. I would recommend if you have free time and a love for robot movies. Just don’t expect it to be award winning."
  },
  {
    "rating": "4/5",
    "review": "It’s a fun little movie with great visual design. It’s not super deep but very endearing. We enjoyed it."
  },
  {
    "rating": "3.5/5",
    "review": "Robot vs. Man but in a different kind of way. Electric State is an easy watch with Millie and Pratt. Don't overthink it, just enjoy it."
  },
  {
    "rating": "2/5",
    "review": "I donno man, I donno. But I suppose that's the problem. I dont think it takes finding Dr to figure out where the boy is, 1 company running the entire globe's technological systems on 1 brain seems a bit, huh, to me. I works but it doesn't, if you get what I'm trying to say. I donno man."
  },
  {
    "rating": "1.5/5",
    "review": "A+ for style and creativity, but the story is so lazy, predictable, with characters that I feel a child wrote in the fifth grade that your better off watching Barney instead."
  },
  {
    "rating": "5/5",
    "review": "The Electric State takes us back to the 90s, eliciting nostalgia while flipping history to a \"what if\" AI robots became a thing and the technocratic overlords became war heroes. It's thought provoking, but not too much so to make you bored. I'm not sure what the bad reviews are about, the acting is good, the pacing is fun, the story is interesting. And soundtrack is GREAT! VfX are amazing too. It's better than all the Marvel movies put together. It's a playful adventure, probably geared more toward kids but one that adults will still enjoy. Don't expect Schilders List and you'll have a good time. Idk what all the trash reviews were about, this is a fun one."
  },
  {
    "rating": "4.5/5",
    "review": "Electric State is a good movie, very funny and with good visual effects, but the first 20 minutes are not that exciting, but after that it becomes a very good movie, with a very nice message :)"
  },
  {
    "rating": "2.5/5",
    "review": "i loved the robots a lot ! the SFX are absolutely phenomenal and you can see this is were all the money was spent can someone try and encourage BETTER SCRIPTS in movies please the dialogue is pretty lame and adds zero to the overall understanding of the plot all in all the actors except Ke just stand there while the robots take over which is as it should be in a robot movie stanley tucci unconvincing as a baddie MBB always tries to add pathos but even she was disconnected from her character. Pratt is just a CARICATURE now. Robots 10 Humans 1"
  },
  {
    "rating": "4.5/5",
    "review": "Okay don't know what's going on with the reviews this one is honest, this film is for kids not adults but both me and my wife enjoyed watching it. It's a little predictable in places but I think it's because it's pulling ideas from other old films that kids of today may not have seen. So watch it without prejudice and maybe you'll be pleasantly surprised like me, glad I watched it. Think my kids will probably be big fans of it."
  },
  {
    "rating": "0.5/5",
    "review": "Electric state is based off of visual novel which did it as severe disservice although the storyline seems pretty clear-cut they got to stop throwing high ranking actors into everything new movie or new TV series I'm kind of sick of seeing the same actor over and over again I want to see somebody new. I am no critic and I hope no one takes this to heart and this is how I feel and it's been on my mind for a couple of days now since the movie came out. Ps everyone can enjoy a good movie ever now and again and not a lot of people like it one people post about it saying it's bad just know it's a stranger online posting their opinion. so if you enjoy the movie enjoy it 😀."
  },
  {
    "rating": "5/5",
    "review": "This movie is great, my boyfriend and i love it and thought it was funny 💅💜❤️💚"
  },
  {
    "rating": "0.5/5",
    "review": "Hahhahhahha it’s so amazing what they think Billie Poppi Brown means to the world but she doesn’t mean anything. Trash."
  },
  {
    "rating": "0.5/5",
    "review": "Unwatchable. Plot and character development is non-existent. 30 minutes into “Data Dump” of facts and history of the world and characters and I had to turn it off."
  },
  {
    "rating": "1/5",
    "review": "All the good reviews here just more proof of the cognitive decline of the USA, like you needed more proof."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! Has the touch, the action and was very well constructed."
  },
  {
    "rating": "4/5",
    "review": "I watched this on Netflix. To be honest I had wa5ched some reviewers beforehand and they were pretty brutal. I decided to give it a watch and enjoyed it. If you are looking for something not too deep that is just for entertainment then this will work. Just go along for the ride and don't take it too seriously."
  },
  {
    "rating": "5/5",
    "review": "I loved the movie. Would definitively recommend!"
  },
  {
    "rating": "2.5/5",
    "review": "Some of the ideas in this film don't make any sense. That being said, it had some good action sequences and comedy. The VFX were outstanding too. I had a pretty good time watching it, but I'm not sure I'll revisit it any time soon."
  },
  {
    "rating": "5/5",
    "review": "Assistam simplesmente assistam não vá esperando um roteiro complexo mas vá esperando um filme divertido pra caramba"
  },
  {
    "rating": "3/5",
    "review": "\"The Electric State,\" directed by Anthony and Joe Russo, is a sci-fi adventure set in an alternate, retro-futuristic 1990s America. The film stars Millie Bobby Brown as Michelle, an orphaned teenager who embarks on a journey with a mysterious robot named Cosmo to find her long-lost brother. Along the way, they team up with Keats, a smuggler portrayed by Chris Pratt, and his wisecracking sidekick, navigating a dystopian landscape filled with the remnants of a high-tech consumerist society in decline. Visually, \"The Electric State\" is a spectacle. The filmmakers have crafted a vast, ruined world where gigantic battle drones litter the countryside, seamlessly blending live-action with CGI to bring this desolate landscape to life. The design of the robots, especially Cosmo, is both creative and evocative, reminiscent of the charm found in Pixar's \"WALL-E.\" These visual elements successfully transport the audience into the film's unique universe. However, the film's narrative struggles to match its visual prowess. The screenplay often falls into the trap of excessive exposition, particularly in the opening sequences that delve into the backstory of the war with machines. This approach tends to tell rather than show, hindering the audience's immersion. The pacing is another issue; scenes transition rapidly, with characters delivering lines at a breakneck speed, leaving little room for viewers to absorb the unfolding events. Millie Bobby Brown delivers a commendable performance as Michelle, capturing the character's determination and vulnerability. Chris Pratt's portrayal of Keats, however, feels somewhat one-dimensional, lacking the depth needed to make his character truly compelling. The supporting cast, including Stanley Tucci, Ke Huy Quan, and Giancarlo Esposito, add gravitas to the film, though their characters often feel underutilized. Thematically, \"The Electric State\" explores the ethics of robotics and the consequences of a high-tech society's decline. While these themes are timely and relevant, the film's execution lacks the nuance required to provoke deeper contemplation. The narrative's focus on action and spectacle often overshadows the philosophical questions it attempts to raise. Comparatively, the Russo brothers have previously demonstrated their ability to balance action and character development in films like \"Avengers: Endgame.\" However, \"The Electric State\" seems to prioritize visual spectacle over narrative depth, resulting in a less satisfying experience. The film's ambitious scope is evident, but it falls short of delivering the emotional resonance found in some of their earlier works. In conclusion, \"The Electric State\" is a bold endeavor that excels in visual artistry but falters in storytelling and character development. While it offers moments of spectacle and a few emotional beats, the overall experience feels underwhelming. For viewers seeking a visually immersive sci-fi adventure, it may suffice, but those looking for a more profound narrative may find it lacking."
  },
  {
    "rating": "5/5",
    "review": "Great movie! Just a thought. Rotten Tomatoes would benefit by first posting audience reviews before critic reviews are posted for about a week before critic have their say. The audience POV is more valued."
  },
  {
    "rating": "5/5",
    "review": "So good I have watched it twice now in the space of a week. The CGI and interaction with the live actors is incredible. Very well made movie and you actually feel sorry for the robots."
  },
  {
    "rating": "0.5/5",
    "review": "Don’t bother! cheap script, bad acting."
  },
  {
    "rating": "2.5/5",
    "review": "It has such a misfit guardian of the galaxy vibes that the mark is missed. A movie that wants to have you connect and feel leaves you emotionally empty. Especially towards the characters. It's totally watchable but it will leave you wanting more when done."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this film. I know that critics see a lot of movies, but I still don't know how this couldn't warm your heart enough to give it at least a 50 percent. Lol."
  },
  {
    "rating": "2/5",
    "review": "Damn I usually love sci-fi movies but it just seemed a little bit cheesy for my liking"
  },
  {
    "rating": "3.5/5",
    "review": "This was an overall good fun family movie. It had production values of a big time movie and a story easy for the whole family to follow. The visuals were great. The robots all had the old but superadvanced feel. Clever way to use robots as the bad guy cannon fodder. Pratt was his normal character which is cool. Perfect movie for family night and popcorn."
  },
  {
    "rating": "5/5",
    "review": "Such a good movie, loved the retro looking robots!"
  },
  {
    "rating": "5/5",
    "review": "This movie is AMAZING!! I love this movie. I have told all my friends what a great movie this is and I would recommend this movie. If you want a great watch for your family this is it. It sends a great message and the actors and actresses did such a great job with their roles. I can’t say enough about how much I liked this movie. Well done creating such a great film. Truly enjoyed it. Thank you"
  },
  {
    "rating": "1/5",
    "review": "Lazy writing, inept acting. What could have been..."
  },
  {
    "rating": "3/5",
    "review": "An electric spark of strong visuals, captivating actiony and original themes but also filled with blandness, CGI and dosen't quite deliver its theme."
  },
  {
    "rating": "2.5/5",
    "review": "Ummm, yeah, it was fine. Thought the story and most of the writing just felt bad, some instances where I just thought people wouldn't speak like that (yes, it was when it was people). I thought the movie looked great and props to the actors doing what they could with some of their lines. Overall, story felt fine and feels like the came off a production line in a factory. A well run factory but a factory none the less"
  },
  {
    "rating": "3.5/5",
    "review": "Although the film is CGI heavy, the amount of money spent on making the VFX is pretty damn good for a non-theatrical release. The plot wasn't overwhelming and I couldn't really find any plot holes. I enjoyed the nostalgia and always love the techy sci-fi stuff."
  },
  {
    "rating": "2/5",
    "review": "Listen to the critics. This was dull and boring. I was only able to get to about 2/3rds of the movie before losing complete interest."
  },
  {
    "rating": "4/5",
    "review": "Turn your brain off and just enjoy 😃Rotten Tomatoes still don’t understand that some films are just fun and not a documentary."
  },
  {
    "rating": "1/5",
    "review": "I'm embarrassed for Pratt and Brown. How could they have put their rep on the line for such a goofy, boring movie?"
  },
  {
    "rating": "1/5",
    "review": "Nostalgic music does not cover up the bad acting, flat jokes, and plot that doesn't really go anywhere."
  },
  {
    "rating": "5/5",
    "review": "Great movie, you can see from the beginning that the really worked hard at the visual effect and sound, truly one of the best movies I've seen this year so far, the acting was spot on you can even see scene that were vary similar possibly inspired by E.T. After watching this movie and reading the reviews of the so called \"critics\" it shows that they clearly have no idea what they are talking about. It's almost as if there's a general mob like mentality that they decided to all either leave bad review not based on the quality of the movie but on some other agenda. Just look at all the reviews of actual general public and you will see that the movie is so much better than the critics review. So if you are not sure whether it's worth a watch or not because of all the bad critic reviews, don't wait just watch it and you will be pleasantly surprised."
  },
  {
    "rating": "5/5",
    "review": "I loved the movie. I found it entertaining and though I haven’t read the original source, I found it to be a rather well-made movie. Yes, there was a bit of over the top Comedic attempts from Chris Pratt, but that’s Chris Pratt. It’s appealing to children though maybe those that are over A certain age. It’s not a reboot or remake so I found it to be an enjoyable movie one that doesn’t need to be overanalyzed by these so-called Professional critics. I agree an enormous amount of money was spent on this which probably could’ve been done for less, but they got a great set of actors and voice actors and the VFX was quite enjoyable. Yes, there were a few subpar moments but overall I give this a 10/10. It kept my attention and it makes me want to now read the source material. So I think the Russo Brothers did a great job and I would watch this movie again. The point of a movie is to provide an escape from the mundane and monotonous world we live in. It did that and then some, kids will love it and that’s all that matters."
  },
  {
    "rating": "1/5",
    "review": "Frankly an insult to the original story only retaining some semblance of the original art."
  },
  {
    "rating": "5/5",
    "review": "That's Really Good But I LOVE Kid Cosmo 😍"
  },
  {
    "rating": "0.5/5",
    "review": "Absolute garbage. The movie doesn't deserve any more said about it than that."
  },
  {
    "rating": "3.5/5",
    "review": "I dunno what all the hate is for the movie. Maybe a bunch of MAGA fanatics got mad a movie with a clear message being made that rounding up a persecuted groups and putting them in detention centers is a bad idea? Seriously, that's happening right now. Also, this movie was exactly what I expected. Goofy characters, potentially AI written script, and a lot of stupid jokes. If you expected art when watching a movie about a girl going to rescue her brother whose mind currently resides in a cutesy robot I'd suggest you could have saved yourself the time after reading a simple description of the plot. Honestly, 15%? This movie while being totally formulaic and mostly brainless entertainment was VERY successful at keeping me entertained for two hours."
  },
  {
    "rating": "5/5",
    "review": "I shat my pants a few times during this movie. So suspenseful and terrifying. My cat worried about my health a few times. I absolutely shat my pants so bad the poop was seeping out of my thong. Chris Pratt nailed this role! Definitely better than that Star-Man role."
  },
  {
    "rating": "4.5/5",
    "review": "Really enjoyable movie with good humor and surprisingly funny dialogue. Tons of big name actors too."
  },
  {
    "rating": "3/5",
    "review": "This movie is worth watching but only for the world building and overall vibe. Unfortunately, the plot is not great and completely forgettable."
  },
  {
    "rating": "5/5",
    "review": "I can’t believe Letterboxd and rotten tomatoes not giving love to this movie ! This movie is awesome. Great story. Great special effects. Milly Bobbie brown and Chris prat knocked it out of the park and my favorite vegan actor woodie harrelson. Mua. Chef kiss ! This is a reverse terminator movie where the humans are evil and the robots are the good guys. One of my favorite movies this year 🍿🍿🍿🍿🍿/5 on Netflix"
  },
  {
    "rating": "1/5",
    "review": "Serious snoozer. All that money to make a dorky, humorless mess. The film couldn’t find its tone. Is it a comedy? Thriller? Sci-fi? Kids movie? How the hell did they get all these name stars in it? Oh, I know…$"
  },
  {
    "rating": "3.5/5",
    "review": "I really like the design of the robots. I'll watch it again just for the baseball robot alone"
  },
  {
    "rating": "2.5/5",
    "review": "I wouldn't say i would watch this again. Maybe in a few years. A little less then a decent movie"
  },
  {
    "rating": "2/5",
    "review": "Stinker. Dull, predictable and not as funny as it thinks it is."
  },
  {
    "rating": "4/5",
    "review": "I have officially grown tired of \"expert\" movie reviewers. I think the lot of them should pick a lane and stay there. If you like sci-fi and can speak the language...be a sci-fi critic. I don't need a bunch of indie, rom-com, cheesy drama lovers critiquing my sci-fi! I have been a sci-fi fan for 50 years, I may know a thing or two. I watched this with my daughters and we enjoyed the movie and the discussions it generated. We were able to suspend our expertise and allow the movie to entertain us. Something the self-absorbed bloviating critics find difficulty with. It is entertainment for gosh sake! The disparity between the experts and the audience is wide on this one, which means you will probably enjoy it."
  },
  {
    "rating": "5/5",
    "review": "This was the best made by Netflix for wider audience movies. What I mean by that is PG-13 instead of mature audience garbage. The graphics were awesome, It was funny, the characters were really interesting, the premise was interesting. And it it all points for me. I am not watching a movie especially one made by Netflix expecting it to be like an artistic masterpiece, I just want to be entertained. And I was very entertained. So was my teenage son. I will recommend this movie to everyone all the time."
  },
  {
    "rating": "2/5",
    "review": "A visually stunning but emotionally vacant sci-fi action movie. The Russo Brothers build a fantastic retro-futuristic world, but with clunky dialogue, crazy pacing, and DOA performances it gets ruined. Millie Bobby Brown does her best, but there's just not much the script allows her to do, and even a deep cast with tons of great actors can't even attempt to rescue it. Too much stale CGI and a try-hard '90s soundtrack aren't helping. All flash, no substance."
  },
  {
    "rating": "1/5",
    "review": "I liked some of the lore, but it was just kinda eh"
  },
  {
    "rating": "1.5/5",
    "review": "I was very excited for this movie, but unfortunately it was a disappointment. Not only was I excited for the Russo Brothers newest movie, I am also a huge fan of Chris Pratt. The premise Is interesting But the delivery is lackluster. It felt like everywhere where the movie was improving it was taking three steps back. Unfortunately I will not recommend the only reason why you got any stars from me, was Chris Pratt sidekick didn't miss with delivery and comedic relief."
  },
  {
    "rating": "3.5/5",
    "review": "Don't be put off by the low reviews. It may not be as funny as it could have been, but its in the same genre as Guardians of the Galaxy, if you liked that."
  },
  {
    "rating": "4.5/5",
    "review": "I thoroughly enjoyed this movie! Not sure why the critics were so harsh on it. Anyway, I recommend it if you enjoy sci-fi movies."
  },
  {
    "rating": "2.5/5",
    "review": "Der Film selber ist eigentlich für eine Netflix Produktion gar nicht so schlecht. Aber warum zum Geier war der so unglaublich teuer? Der sieht nicht viel besser aus als ein Film für 20 Millionen und das Drehbuch ist auch nicht sonderlich kreativ. Sonderlich viel leisten tun die Schauspieler darüber hinaus auch nicht. Die Roboter sind recht nett gestaltet. Kann man sich mal geben so auf der Couch, aber eine absolute Geldverschwendung von Netflix wie auch schon Red Notice und so."
  },
  {
    "rating": "3/5",
    "review": "Keeps you along for the ride, nothing spectacular, not a bad movie"
  },
  {
    "rating": "4.5/5",
    "review": "This is excellent escapism... An entertaining movie with lots of great visual gags. Worth watching just to see all the different robots they included. It's not Shakespeare, but that's not why I watch Netflix. The actors are fun and the story progresses in a satisfactory manner. The movie delivered on all it was supposed to. Most importantly, I had fun. That's got to start counting for something again."
  },
  {
    "rating": "5/5",
    "review": "Great film! Easy watch, cool cgi and good story."
  },
  {
    "rating": "5/5",
    "review": "Enjoyed watching this. After lots of bad reviews I found it wasn't that bad. Definitely worth a watch with an open mind."
  },
  {
    "rating": "4.5/5",
    "review": "I LOVED this movie, it’s a really great show on the dystopian side and the utopian side, it’s sad seeing how people only look at one side and say “that’s it” because that isn’t a genuine experience, that’s just looking at someone else’s vision and only basing it on that, this movie deserved better then what people just see the one side of it as."
  },
  {
    "rating": "4.5/5",
    "review": "I really don't understand what people are talking about. This movie was very different to others. The Russo brothers truly did great! Millie Bobby Brown was fantastic in this film! And Chris Pratt did phenomenal! Stanley Tucci made me hate his character but that's when you know you have a great actor."
  },
  {
    "rating": "5/5",
    "review": "Not just another Star Lord. Chris’ character is grumpy dude meets hippy outlaw. The story line is interesting yet uncomplicated. The kind of movie you want to watch, when you just want to be entertained not terrorized. The acting is believable if you have an imagination and can let yourself enjoy a film without sex, and gratuitous violence. Although there are a few fight scenes it’s minus the usual gore. I really enjoyed Millie, she was fun and endearing. The kid that played her brother was actually outstanding. Very in character and perfect for that role. Great flick. Especially for kids. ❤️✅👍 I hope there’s a sequel because honestly the only thing missing is character development. We want to know more!"
  },
  {
    "rating": "2.5/5",
    "review": "It was... Meh, which is dissapointing not only because it could have been great but really should have been. A great cast, renouned directors, amazing source material and apparently limitless budget. But oh dear what we got was about as basic as a vanilla ice cream, at best. Knowing the source material the film is pretty much just the visual asthetic of the book with basically none of its story which is a very grim tale told in a simple but very captivating way. What we get instead is a long winded, bizzarly goofy and not terribly interesting reinterpretation, that almost felt like it should have been a series, not a film. It trudges along in a very strange discombobulated way often not making sense or laying narrative framework that either doesn't pay off or is completely ignored, forgotten or worse doesn't land the way it was intended. I found myself bored with 20 minutes to go and asking, do I care about this journey anymore? These people, this plight? No, Not really. While I liked the characters in principle I didnt like the writing. Its far too hammy, and low hanging fruit in nature. It seems like they wrote it after they cast it, as if each line of dialogue was written for the person delivering the lines, and NOT for the character they are portraying. You have Millie Bobby Brown playing a character Millie always plays, and saying the things Millie always says. Shes, yet again the tragic yet virtuous girl boss who can do no wrong and sticks it to the man. (I love ya Mills but you gotta step outta that mold) Meanwhile Chris Pratt is another dithering hero, a whitless good guy with a heart of gold wrapped in a rough exterior, he's effectively another Starlord.... The supporting cast is okay but again fall into character type for each and every actor. Giancarlo Esposito plays who you'd expect, Anthony Mackey? Ditto. Even Ke Huy Qwan is exactly who you'd think he'd be. It's a film where every person in front of the camera or voicing a character was unashamedly typecast. Then theres the cost. Had this been a 50 million dollar movie I might let more slide but at 320 million? I cant help but ask where the money was spent. Sure the CG is good, but theres nothing special or jaw dropping about it and theres certainly nothing here thats 320 million dollars better then any of the CG seen in the Avengers movies or heck even Transformers. Then theres the costuming and practical effects which look very cheap and flimsy. Its an odd dichotomy visually that when it nails the books asthetic is quite striking but when it doesn't it really doesn't. In the end overall I'd give it a 2.5/5. Its the definition of mediocre. Not the worst thing ever in terms of a watching expierence but its easily the most expensive waste of potential you'll likely see in a while."
  },
  {
    "rating": "5/5",
    "review": "Pure entertainment. Must have been watching a different movie than the critics."
  },
  {
    "rating": "4/5",
    "review": "A good family movie, entertaining, moving and a good original storyline. It does have some sad parts but overall I recommend a watch."
  },
  {
    "rating": "0.5/5",
    "review": "The Russo brothers have taken a horrifically beautiful and atmospheric sci-fi novel and adapted it into Transformers-esque, action slop staring Chris Pratt. The fact that the audience score is so high makes me weep for humanity."
  },
  {
    "rating": "1.5/5",
    "review": "O filme tem todo um cenário para ser bom, mas a história foi ruim demais, apressada e mal desenvolvida."
  },
  {
    "rating": "1.5/5",
    "review": "The Russo brothers have done good work in the past and so have these cast members. But this is just bad."
  },
  {
    "rating": "2/5",
    "review": "It was boring ... Not bad , just ... HOW MANY THIS THING COST ?!"
  },
  {
    "rating": "4/5",
    "review": "Critics have missed the boat on this one. What were they watching? It is fun, creative, and the robots/effects are amazing. Very imaginative and I love Kid Cosmo. Some parts are hilarious. Definitely recommend."
  },
  {
    "rating": "0.5/5",
    "review": "It's hard to imagine a worse way to spend $320 million. I can't believe the audience rating. I simply cannot believe that this many people enjoyed this slopfest. Everyone I've talked to who has seen it agreed that it was horrific. Netflix, spend your money on quality lower budget products instead of betting the farm on low quality dumb nonsense like this."
  },
  {
    "rating": "2/5",
    "review": "I dunno, maybe if i was a 12 year old or younger i might like it it, but it really didn't do anything for me. It felt like it was trying to do the Guardians of the Galaxy thing but failed. This was a big ol' meh."
  },
  {
    "rating": "4/5",
    "review": "Very entertaining movie. Nice concept . Don’t understand all the critics hate ."
  },
  {
    "rating": "1/5",
    "review": "i wanted to like this but i couldn’t rate it anymore than one star, visuals were pretty cool, story line seemed extremely dull compared to the visuals? very weird to actually watch, lastly the ending doesn’t make any sense, it was clearly just thought up to be overly dramatic, unfortunately a fail but had the workings to be decent but definitely fell flat"
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed it. Dare I say I liked it even more than Ready Player One."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was ok. A good film for kids between 10 - 12"
  },
  {
    "rating": "4.5/5",
    "review": "I liked this movie! The robots were fun. The story had enough meaning to keep it interesting but not so much that it felt too serious. It was a fun movie! Just enjoy it."
  },
  {
    "rating": "5/5",
    "review": "Enjoyable. That's all I can say. Family movie great special effects"
  },
  {
    "rating": "0.5/5",
    "review": "Rip off of transformers 4, even had the same “evil antagonist”"
  },
  {
    "rating": "4/5",
    "review": "This movie was so much better than the reviews. Not perfect, but perfectly enjoyable to watch with the family and certainly better than many recent films I have seen which had far superior reviews."
  },
  {
    "rating": "3/5",
    "review": "It's pretty empty but has many small kinda fun moments and the premise is pretty good"
  },
  {
    "rating": "4/5",
    "review": "Not sure why everyone is backing this movie my mother and myself enjoyed this Chris Pratt/Bobby brown mash up"
  },
  {
    "rating": "4/5",
    "review": "Great story and amazing theme. Great original idea that has never been seen before."
  },
  {
    "rating": "5/5",
    "review": "Just a fun movie. I liked it."
  },
  {
    "rating": "5/5",
    "review": "I have no idea what these \"top critcs\" blabber about. I watchedd this film and personally 1 critic is pathetic eith his comment \"wizard if oz, surrounded by loads of tin men. Isnt majority of films based on the same thing. Good defeating bad. For those who doubt this film i recomend wathing it. I think the special effects are great the acting is great and rhe story line is great. So called top critics get a life and realise that sime days you are flops and you need to give films a chance and not compare them to other films."
  },
  {
    "rating": "1.5/5",
    "review": "How can you spend $320 million on THIS? Here's a great example of how money does NOT guarantee a good film. The stories man, focus on the stories!!"
  },
  {
    "rating": "4.5/5",
    "review": "This movie is great - really fun to watch! It is another example of how critics are so out of touch with what the general public enjoys in a movie. Sure there were some moments in the climactic scenes where I feel like the script faltered and didn't quite hit the mark or provide enough justification for some characters' actions. But those points were few and far between. Overall, this movie was so much fun to watch. The acting was stellar, the sci-fi caricature of an alternate 1990's was perfection, the well-timed comedic bits were exactly what was needed, and the story was heartfelt and as real as you could want, considering the source (a graphic novel). Any critic who panned this movie forgot what it's like to just enjoy a movie for what it is. It doesn't need to be an exact duplicate of the source, it needs to stand on its own. And this film does that. Enjoy the graphic novel for what it is, and enjoy this film separately for what it is. Both have merits in their own right. If you're looking for an enjoyable evening of cinema, give this one a chance. You won't be disappointed."
  },
  {
    "rating": "5/5",
    "review": "I’m probably gonna get a lot of flack for this, but guess what I liked the movie. I watched it with my mom. I watched the movie so that way I could enjoy the crap out of it and I don’t see it like some kind of gross boring whatever everyone’s talking about, it’s a movie. I watched it and enjoyed it. That’s what you’re supposed to do with a movie. You wanna give it horrible reviews? That’s your prerogative, but don’t crap on it and make people not wanna watch it that might actually wanna watch it and give your reviews that might turn them away from potentially enjoying the movie."
  },
  {
    "rating": "4/5",
    "review": "Love it. Good movie for a evening. Good actors and good acting. This one like family movie. Good idea for a movie."
  },
  {
    "rating": "0.5/5",
    "review": "Pratt and Brown really don't have the charisma to make this anything more than what the Russo's do with it - and unfortunately that's a whole lot of empty headed nothing. All that money thrown away in the pursuit of mimicking what's been done before (and much, much better) without a true voice. Cements the idea that the Russo's belong in television, where the heart and soul of the production is managed by the show runners and producers. Luckily for them, the MCU operates as one giant mega budget TV show, and they're running back to where they belong for their next couple projects."
  },
  {
    "rating": "0.5/5",
    "review": "Pointless and absolutely boring. Couldn’t finish it"
  },
  {
    "rating": "1.5/5",
    "review": "B Grade Sci-Fi. It is painful to watch good actors like Pratt thrown into a mess like this."
  },
  {
    "rating": "2/5",
    "review": "The story is good and the cgi robots was very good. Millie Brown acting is so bad in this movie. She just comes off as a brat and her emotional scene is laughable. The robots showed more emotions. Everyone else was good in their part but they can carry the movie so far."
  },
  {
    "rating": "0.5/5",
    "review": "One of those movies that makes you question how it ever could've possibly been greenlit by an entire committee of HUMAN PEOPLE for almost half a billion dollars!"
  },
  {
    "rating": "0.5/5",
    "review": "\"The Electric State\" promised a visually stunning, emotionally resonant journey, but it delivered a muddled narrative and a surprisingly underwhelming performance from Millie Bobby Brown. While the film's aesthetic, admittedly, is a feast for the eyes, the story it attempts to tell is lost in a sea of visual effects and underdeveloped characters. Brown, who has proven her talent in other projects, feels miscast and surprisingly flat as the protagonist. Her portrayal of a young woman navigating a dystopian landscape lacks the necessary emotional depth and grit. There's a disconnect between the character's supposed desperation and Brown's often detached demeanor. The emotional weight of her quest feels manufactured, rather than genuinely felt. Her delivery of lines is often monotone, and the moments that should have been impactful fall flat due to a lack of genuine emotional investment. It's as if she's going through the motions, failing to connect with the character's internal struggles. The chemistry with her robotic companion, Skip, which should have been a central emotional anchor, is also surprisingly weak. The film's reliance on Brown's performance to carry the emotional weight ultimately backfires, leaving the audience feeling detached and uninvested. While the visual spectacle might entertain some, the film's core narrative and Brown's performance fail to deliver the emotional punch it so desperately needed.\""
  },
  {
    "rating": "0.5/5",
    "review": "Netflix really is just throwing away money aren't they? We want quality, not quantity."
  },
  {
    "rating": "1.5/5",
    "review": "I was really looking forward to this movie as it has two of my favorite stars in it, but alas was left deeply disappointed. Millie Bobby Brown is one of the most talented young actresses today, but the lazy writing makes her come off as yet another toxic female. Chris Pratt is relegated to dumb comedy relief. The characters are so one dimensional in this movie it's hard to look past that and enjoy the weak plot."
  },
  {
    "rating": "5/5",
    "review": "I think it is not the best movie but the end made me crie and I really like this movie. There is a lot of hate for Millie Bobby Brown but for what, like for real people are mean for Millie because she is older now but I think she is really beautiful and kind and I think for people to give hate behind a screen is sow low because she is a really good actres, also in this movie. This movie Made me crie, smile, love and much more. I loved watching it. 🤍🤍🤍"
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I’ve watched this year!!"
  },
  {
    "rating": "1.5/5",
    "review": "Do people care about anything other than \"entertaining\" \"content\" anymore? First of all this is an ADAPTATION not an original story. And as an adaptation it's awful. Turning a stunning looking Graphic Novel, with deep philosophical meaning, in a depressing, yet, beautiful distopian world into a Marvel movie is the same as turning Lord of the Rings into a Romantic Comedy with Sandra Bullock. I bet the critics you guys say to ignore are least are aware of the source material. Everything else is just your typical Marvel comedy (let's be honest, Marvel movies are no longer action superhero movies): cheesy one-liners, goofy actiing, shallow massaging and poor storytelling. Warch it if you have the intelectual development of a 14 years old boy. If you are an adult with half of your brain operational, read the graphic novel or watch the Curious Archive video about it on YT. Much more deserving of merit"
  },
  {
    "rating": "5/5",
    "review": "É um ótimo filme, com uma boa animação, e demonstrar algumas mensagens, e é bem emocionante o filme gostei muito, e quero a parte 2 desse filme"
  },
  {
    "rating": "2.5/5",
    "review": "It's aight. Don't know why this cost 320 million to make... Also is this site an avid war-zone because the Audience and Critics are at constant war with each other!"
  },
  {
    "rating": "5/5",
    "review": "Forget about the \"professional\" critics!!! No one cares about them anyway. This movie is amazing. Some of the best Special FX for ANY 2024/2025 movies so far. The story could be a bit better but is engaging and very fun to watch. Don't miss this one."
  },
  {
    "rating": "4/5",
    "review": "Once again, another example of how everything the critics think is amazing stinks and everything they think is terrible turns out to be great. Critics are all a bunch of snooty bums, obsessed with the smell of their own flatulence."
  },
  {
    "rating": "5/5",
    "review": "Fantastic movie. The trailer doesn't spoil this film. Just give it a watch and I promise you'll be on the edge of your seat the whole time. The characters have memorable personalities portrayed by a surprising amount of different stars you may not recognize till the end."
  },
  {
    "rating": "5/5",
    "review": "The critics are all wrong this movie is great. It's funny and deep and heart warming and everyone needs to give it a chance! It should have better advertising so people know about it. But it's great"
  },
  {
    "rating": "5/5",
    "review": "Never listen to critics. It is a good movie and fun to watch!"
  },
  {
    "rating": "2.5/5",
    "review": "The Electric State is a movie that has lots of ups and downs. The cinematography of the atmosphere and the robots themselves is amazing. The ideas of technology are captivating, but not exactly new as it is reminiscent of other movies. Millie Bobby Brown and Chris Pratt play their characters well, however there are times where they feel awkward. Chris Pratt with the empty handed jokes? Millie Bobby Brown didn't seem to display emotions well until some of the ending scenes. I don't regret watching it, however I don't think I'd rewatch it. It'll be interesting to see if they make a second one since the ending seems like a tease of a sequel."
  },
  {
    "rating": "5/5",
    "review": "Never listen to the critics. This movie is phenomenal. The film just emits \"Sharkboy & Lavagirl\" energy (with less of the fever dream feeling). Definitely one of my new favorite movies. I will promote this movie as if I'm Elon Musk himself with no marketing department, trying to sell his Cybertrucks."
  },
  {
    "rating": "4/5",
    "review": "People don't understand that this is an action comedy sci-fi farce. From the director of Community and You,Me, and Dupree. Watch it that way and you will have a great time. Especially for the comedy it displays. Mr Peanut sets the stage. It also serves up a healthy portion of politics in regard to immigration. A must watch for a good chuckle!"
  },
  {
    "rating": "5/5",
    "review": "While watching The Electric State, I was laughing, finding myself wondering what deeper meanings were, and sympathizing with robots. Today, it's hard to connect with CGI, but this movie did it well. There was only one scene were I could very easily tell no one was in the room together. The humor, emotion, character development, and overall ending through me for a loop- and I immediately thought about who I could watch it again with."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed this movie."
  },
  {
    "rating": "5/5",
    "review": "I’m not entirely sure what ground-breaking movie the critics were looking for but this movie was so fun, heartwarming, and visually stunning. I found myself laughing much more than I was expecting and all-around had a great time. Will definitely be watching again."
  },
  {
    "rating": "4/5",
    "review": "Entretenida con una temática interesante"
  },
  {
    "rating": "4/5",
    "review": "Critics must be tied to directly to Hollywood, they are simply way off what actually entertains normal people. I get it if you think this is silly but that is what makes it fun. Combo of ET, Toy Story with some Transformers thrown in. Action, good comedy banter, and great characters. Sit back, lighten up and enjoy a movie anyone can watch"
  },
  {
    "rating": "3.5/5",
    "review": "Seems like an orchestrated campaign against this film by \"top critics\". As drivel goes (90% of modern cinema) this is the upper echelon & the cinematic achievement of the graphic & puppetry work alone makes it worth the watch. This is some of the best cgi work ever rendered. Corridor Crew is gonna love this. Who cares if it's a robot apocalypse trope? A lot of ppl like that, plus it's an adaption of an existing graphic novel? The hate seems so contrived. It's not a Mulholland Drive, or Red, Blue or even a White (all you Le cinèma du Gaullywood freaks know what I'm talking about) but it's a fine Spielberg clone that's full of some of the best graphic artistry in modern cinema. And I'm not really a fan of either of the two lead actors either, but with so much incredible CGI to oggle, I hardly let their average performances bother me. If you're a fan of graphic artistry, it's a must see."
  },
  {
    "rating": "5/5",
    "review": "The story made sense and was consistent, the acting was good, the plot entertaining. So much better than a lot of the other stuff that has come out lately. It was just a fun flick that is a crowd pleaser."
  },
  {
    "rating": "4.5/5",
    "review": "Cant understand the critics trashing this movie!! It had the young adult heart warming of Gremlins or Bumblebee. certainly this movie wasnt aiming for the Oscars or Golden Globes but i fount it way mire entertainimg than the critics give it. The post office robot alone was worth the watch!!!!"
  },
  {
    "rating": "4/5",
    "review": "Entertaining. Not as bad as others described it. Decent movie. Great cast"
  },
  {
    "rating": "0.5/5",
    "review": "Crap movie. Everything was bad, even the acting."
  },
  {
    "rating": "1/5",
    "review": "Afraid I can’t recommend this movie. At all!! I really struggled to watch it to the end. It had a cast that are usually great but I don’t think they gave good performances in this movie. No cohesion or warmth between them."
  },
  {
    "rating": "4.5/5",
    "review": "Personally I think it's a really good movie the actors and actresses are good together, it's a touching story and overall it's just really good. It's a Must watch"
  },
  {
    "rating": "5/5",
    "review": "I created a RT account just because yet again I think the professional critics are so out of touch the the general audience. I think the movie was excellent and enjoyed it all the way through. Good light entertainment that made my evening. It isn't perfect but I thoroughly enjoyed it."
  },
  {
    "rating": "1.5/5",
    "review": "I really wanted to like the movie but as hard as I tried it was just too hasty and predictable"
  },
  {
    "rating": "0.5/5",
    "review": "What amazing opportunity they had yet somehow amazingly it went totally the other way. Probably one of the worst films I've seen in a long long time and I've seen a lot of bad movies lately."
  },
  {
    "rating": "5/5",
    "review": "Not sure why people are trashing this movie. I thought it was a great watch. Funny and entertaining. I’m a little annoyed I waited over a week to watch it because of the reviews."
  },
  {
    "rating": "1.5/5",
    "review": "Why is that only 1 in 10 movies are worth watching? Where are the talented writers, the talented directors, the talented actors? I was quite surprised to see such low quality work from the Russo's. Movie makers, tv series makers need to drop the pandering to a small percentage of audience who might not be even going to movies anyway. Hollywood needs to remember who buys movie tickets. If you only please 2% of the customer base, you will lose 98% of your customers as demonstrated by the empty theaters for this, Snow White, and TDS sufferer, Robert DeNiro's gangster movie."
  },
  {
    "rating": "2.5/5",
    "review": "It was passable, enjoyed the acting and message. Just didn’t pop like I was hoping."
  },
  {
    "rating": "4.5/5",
    "review": "I see all of these negative reviews and it blows my mind. This was a great movie…it’s a movie that teaches us a lesson about the dangers of always being online and we’re losing real human connections. I don’t really watch sci-fi movies, they’re not my thing…this was a very cute movie. Lots of rock classics in the soundtrack, the robots are very clever and cute…it was great! Don’t mind the negative reviews and watch it with your kids!"
  },
  {
    "rating": "2/5",
    "review": "To be honest, I'm not sure I've watched a straight to stream movie and thought that it was great. This is more of the same, mediocre at best. Go re-watch a fun film and save your time on this one. I said to my wife afterward, could you imagine spending $+300 million dollars and this was your take-away. Not good."
  },
  {
    "rating": "2.5/5",
    "review": "It had the ability to be amazing but it was just.... Meh. I could barely stay awake to even watch it, very unforgettable."
  },
  {
    "rating": "2.5/5",
    "review": "I Hoped to see lot of action in the movie, Good for one time watch, i know that movie has some issues regarding CGI and music, nothing will change even after the sorting."
  },
  {
    "rating": "4/5",
    "review": "Enjoyable movie for kids. I liked the visuals."
  },
  {
    "rating": "2.5/5",
    "review": "I love the Russo Brothers and their movies as they can truly bring us some epic movies but The Electric State was a huge disappoint, all that money spent on this movie was a waste, even tho that I did finish watching the film, a 2nd viewing will definitely not take place in my household, sorry Russo Bros but you failed with this one."
  },
  {
    "rating": "5/5",
    "review": "How refreshing to watch a movie without overwhelming language, sex, and gore. A classic plot line of good and evil with 5 star special effects/quality acting."
  },
  {
    "rating": "5/5",
    "review": "My kids and I really enjoyed this. I read the book, and that was a much better story, but for what it was, this movie was great. I feel like Millie Bobby Brown phoned in a few scenes but overall it was enjoyable."
  },
  {
    "rating": "3/5",
    "review": "Ngl Daddy Pratt carried the movie."
  },
  {
    "rating": "3/5",
    "review": "It was built around an interesting concept, but I just didn't connect with this one (just like my opinion of Pacific Rim, but at least I didn't fall asleep in Pacific Rim.) I don't think this film deserves only a 15% on Rotten Tomatoes, but I don't think it should be anything over a 60%, maybe 65% if I'm feeling generous. It's not bad, it isn't my last choice in a movie. I mean, there are some moments in which I genuinly felt nostalgic for my childhood and even occasionally chuckled, but it just feels like it's taking a lot from District 9 (like an entire area where the people are banned and keep something not human, how original). I really don't know what to say about this film, so you should just go see this film and form your own opinion about it."
  },
  {
    "rating": "5/5",
    "review": "Very entertaining, great CGI"
  },
  {
    "rating": "5/5",
    "review": "The critics are all full of S#!T…..Stunning visuals. Great cast. Loved the story and don’t care it’s only “loosely “ based in the novels. Certain it will become a cult classic in the future."
  },
  {
    "rating": "1/5",
    "review": "Boring and hackneyed narrative."
  },
  {
    "rating": "3/5",
    "review": "Good action, and great visuals. Acting was fine. I just wish that the story and humor weren’t so utterly derivative."
  },
  {
    "rating": "3.5/5",
    "review": "Properly done alternate universe movie And if you are wanting to make a movie about unfair opresion then this is the way to do it Main Character lead is a women who plays her role well Humans are opressing the robots and even a child to get ahead But what they are doing is actually just taking things backwards for all If we want to throw away our humanity then we will all lose Is it the best Science fiction movie ever? No But 100 times better than most of what have been coming out of Holywood lately"
  },
  {
    "rating": "4.5/5",
    "review": "This movie is a solid piece of entertainment. I found the story refreshing between all the sequels, prequels and reboots we keep getting. Also, I don't know what the so called \"Top Critics\" were watching, but I'm fairly certain they never made it past the trailer."
  },
  {
    "rating": "4/5",
    "review": "This is why we need to get rid of \"professional\" critics cause 9 times out of 10 they are wrong and have more effect on type of movies we get then the general audience. This movie was one of the better ones made by netflix. FIRE ALL CRITICS!!"
  },
  {
    "rating": "5/5",
    "review": "Not sure what the critics are smoking, but this was a solid movie."
  },
  {
    "rating": "5/5",
    "review": "Great movie don't listen to the Critics they're wrong a lot of the time some of the time trust the audience more! It hits the Nostalgia buzz it' well acted and even the robots in movie aren't robotic. Humour and music was also generally good"
  },
  {
    "rating": "5/5",
    "review": "Absolutely cinema ✋🏻🥹🤚🏻"
  },
  {
    "rating": "3.5/5",
    "review": "Worth watching for sci-fi fans. Should have been longer or a two part movie in order to flesh out the characters a little more. That would have been great for both the humans and robots."
  },
  {
    "rating": "4/5",
    "review": "I really enjoyed this movie. I heard a lot of reviews be negative mostly about the budget. It has a lot of heart. There are lots of meanings to be taken away from this movie, but as a mom I have 3 kids and they are very close so I loved the brother sister aspect and the emotions I felt watching it being played out. Knowing that my kids would do anything for each other. Thank you for pulling at momma heart strings!"
  },
  {
    "rating": "4/5",
    "review": "Just… a GOOD movie. Worth watching. Yes, the ending with the boy was pretty formulaic and you don’t get to a point where you really care about the characters, but it’s creative, weirdly beautiful, a fun watch, and memorable. I don’t really understand all the critic haters out there. Definitely worth your entertainment time. Recommended."
  },
  {
    "rating": "5/5",
    "review": "This is my first review, I made an account just to leave a review to counteract the horrible critic score. This movie is fantastic, far from perfect but as always trust the audience scores not the critics."
  },
  {
    "rating": "5/5",
    "review": "The cgi was FANTASTIC!!!! The robot designs were extremely creative and fun to look at. I really like how each robot interacted with each other and their place in the story. Only complaint was there couldve been a bit more story in the 2 hour long film but I just think that it is the perfect film to get a sequel."
  },
  {
    "rating": "4/5",
    "review": "Don't listen to the critics. A fun, entertaining movie with interesting ideas and amazing effects."
  },
  {
    "rating": "5/5",
    "review": "I thought it was really good! The critics are completely wrong. Listen to the people! The cast was good, the acting was good, the story was good, the special effects were good, the soundtrack was good! I mean it’s not Oscar worthy, but definitely worth watching."
  },
  {
    "rating": "4/5",
    "review": "I am writing my first review on this website to plead with people to judge movies for themselves. While this movie isn't for purists of the original content it's based off of. This movie serves to remind people that, while it may not be the best at any one thing. It is certainly not as bad as the critics would have you think. The special effects are top tier, so polished that they blend seamlessly creating an epic sci-fi watching experience. Witty banter and two funny satirical co-stars bridge a gap for viewers of all ages to enjoy a movie for what it is. An escape from the everyday. Worth the time."
  },
  {
    "rating": "5/5",
    "review": "This is my first review, I hate the critics, this movie was Big screen worthy! Ignore the Critics and make up your own mind. 5 stars from me."
  },
  {
    "rating": "4/5",
    "review": "I also don't disagree with critics rating, which I'm sure has more to do with Chris Pratt, and his stances on issues. The movie isn't bad at all. Generally(not always though)I have opposing opinions in relation to critics, this time is no different. Give it a watch"
  },
  {
    "rating": "4.5/5",
    "review": "A lot of bad reviews from critics but I’d say for a feel good movie it did it for me. Amazing cast and visually stunning, funny robots reminded me of Transformers."
  },
  {
    "rating": "4.5/5",
    "review": "Don’t acknowledge the critics reviews. This was a really good movie. Like most if not all movies it wasn’t perfect but definitely not 15% like the critics say. Must watch."
  },
  {
    "rating": "1.5/5",
    "review": "The movie is bad... the idea is entertaining and it has good actors but it's silly, pointless, and very naif... a wasted opportunity."
  },
  {
    "rating": "5/5",
    "review": "Not really sure why this film has received such negative reviews, I went in it hyped by the trailer, expectations at their highest, and I have to say I wasn't disappointed at all! It didn't feel soulless to me in the slightest, in fact if anything it was actually quite an emotional story, girl meets robot who claims to be her long-thought-dead brother, and goes off in search of him (this is my oversimplification of the main plot point) anyway, ignore the negative reviews and enjoy Woody Harrelson voicing a peanut, because I loved it!"
  },
  {
    "rating": "4/5",
    "review": "I do not understand all the hate. My family loved the movie. We thought the robots were funny but also endearing. I loved the 90s references. Millie Bobby Brown rarely disappoints and Chris Pratt was Chris Pratt Maybe people are taking themselves too seriously."
  },
  {
    "rating": "5/5",
    "review": "The Electric State was really funny. Chris Pratt was basically Star Lord in a different movie, & the action was killer. The concept had holes, but who freaking cares!?! We laughed the whole time and it was a fun night, thanks to Millie Bobby Brown & The Russos. Anybody who didnt like it, seriously just wants to crap on EVERYTHING! Im so tired of people these days. It's like nothing is ever good enough anymore, & everyone is both a critic and an amazing film maker. Electric State was hilarious and I will totally watch it again!, & if you want a silly movie with MBB, StarLord, cute robots and a fun adventure to watch with the wife and/or the kiddos (our kids were playing their video games, so my wife and I watched it together and loved it!) ....then Go Watch Electric State 🤖"
  },
  {
    "rating": "5/5",
    "review": "O filme apresenta os mesmos clássicos de sempre, achei meio genérico mas atraí a minha atenção."
  },
  {
    "rating": "2.5/5",
    "review": "Stick to Marvel Russo Brothers... Stick to Marvel."
  },
  {
    "rating": "4/5",
    "review": "It was a great sci fi movie, sure there is plenty of cliche to go around, it achieves the goal of entertaining escapism in a fresh setting. Best of all it didn’t try to push any trendy immersion killers like so many movies have in the past decade. The lack of subtext preaching is likely the main reason for the poor “pro critic” opinions, but for us mere mortals it’s a total bonus."
  },
  {
    "rating": "1/5",
    "review": "Complete travesty to the source material"
  },
  {
    "rating": "1.5/5",
    "review": "Not \"bad\" just not written for adults. The dialogue plays like it was written for Nickelodeon. For $320 million I expected more."
  },
  {
    "rating": "5/5",
    "review": "Myself and my 5 year old loved this movie! Lots of actors we love, it Went along smoothly and great music!"
  },
  {
    "rating": "3.5/5",
    "review": "Good orignal sci-fi well done , the pace of the movie was awakward, great effects"
  },
  {
    "rating": "0.5/5",
    "review": "Un bodrio simplemente"
  },
  {
    "rating": "4/5",
    "review": "This is not a bad film. Critics are full of it. It is a bit maudlin at the end, but amusing throughout. Great world building. Looks great. Really, you could do a lot worse."
  },
  {
    "rating": "5/5",
    "review": "I have a 15 year old boy and a 6 year old boy. It can hard finding things we can all watch together. This was a great weekend popcorn movie for us. Maybe I wouldn't have liked it if I watched it by myself but I won't know. Give it a chance if you arent in an overly analytical mood."
  },
  {
    "rating": "5/5",
    "review": "This movie is good no Matter what."
  },
  {
    "rating": "5/5",
    "review": "I think have a beautifull message the movie and even I am very interesting in the worldbuilding that they are"
  },
  {
    "rating": "2.5/5",
    "review": "Not great… Chris Pratt was wasted by whatever direction he received or what the left on the cutting room floor. 11 is not ready to carry a project. A rough watch, but it has robots, so if you are 5 you might enjoy it."
  },
  {
    "rating": "3.5/5",
    "review": "Great Sunday afternoon flick for all the family. Is it going to change your life? No but my husband and I enjoyed it, fun fresh concept with a few laughs, heart and a climatic ending!"
  },
  {
    "rating": "5/5",
    "review": "Awesome. Great movie, great actors, great story, great visual effects. I don’t understand this poor score at all. Critics are just totally dumb. And when you read their reviews, you realise that yah, they’re totally dumb."
  },
  {
    "rating": "5/5",
    "review": "A throw back to real movies, emotions, and journeying into the unknown. 90s references were awesome and the friendship between characters was reminiscent of classic movies we grew up with. In a world where electronics are already a problematic escape, this movie also has cultural and societal commentary that we need to look at and begin talking about before we find ourselves lost in this state. Excellent story!"
  },
  {
    "rating": "2/5",
    "review": "Una película más de Netflix o lo que se puede esperar de ellos. Lenta, aburrida por muchos momentos decepcionante por parte de los directores. Chris Pratt interpretando a Chris Pratt y Millie Bobby sin chiste. Lo único atractivo de esta película son los robots estilo animatronicos de “five night at freddy“, el cast que decepciona y él lo nombres detrás de esta película. Un idea buena pero mal ejecutada."
  },
  {
    "rating": "3.5/5",
    "review": "I'm not sure why the critics disliked this movie so much. I found it to be an interesting and enjoyable sci-fi film with a great cast and excellent special FX. The concept about AI and robots/machines is interesting and well handled. The 2 lead actors are likeable and acts really well. An overall solid film."
  },
  {
    "rating": "5/5",
    "review": "This movie is absolutly the best one i ever seen. This film got me emotional when Michelle unplug the machiean that is connected to the brother. This film deserves more than 15%. P.S WHY!? then again. I hate that they added Chris Pratt in there."
  },
  {
    "rating": "4/5",
    "review": "A little cheesy derivitive and I'm not entirely convinced it was worth the price tag but, it is still a very entertaining watch and not at ALL deserving of the critics hate."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved it 🥰"
  },
  {
    "rating": "1.5/5",
    "review": "Movie had a generic feel to it, may have been the CGI but the cohesiveness of the plot was below subpar."
  },
  {
    "rating": "5/5",
    "review": "Great movie. Great actors and so funny. Whole family enjoyed it."
  },
  {
    "rating": "2/5",
    "review": "This had glimmers of what the creative premise could've been in its first act, but the moment that a robot started singing The Clash's cover of I Fought The Law while Chris Pratt nods along with his stupid haircut, I knew this was the generic Netflix movie crap I was fearing it would be."
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed it a lot. It is an easy to understand movie, It touches the topic of how technology is being used today. While the movie has a sci fi.half funny half serious, human-robot drama going on, in one moment during the movie we think about about a word that we can work while resting and have an opinion about it. Very well done."
  },
  {
    "rating": "5/5",
    "review": "Chris Pratt is amazing as always!"
  },
  {
    "rating": "3.5/5",
    "review": "The Electric State:heard a lot about it-the cast,the issues and even the costs which didn't bother me 1 iota..A lot of downers expressing a bland cast which I found ratthering charming and cast nicely for the movie.$320 +million to make a movie isn't chump change but considering the movie has a good cast great special effects and a heart warming story-to many people want dread and glamorized doom,this is more them just a story about the woes of an alter-universe-it is about survival.I would rather kick back and get lost in a movie with an attempt at heart then watch a movie that crams every piece of storyline down your throat.Kudos as this one is a keeper when other films fail."
  },
  {
    "rating": "3.5/5",
    "review": "Honestly wasnt that bad, no idea why ratings are so bad. Millie Brown was the worst part and she was a better actress than she usually is."
  },
  {
    "rating": "4/5",
    "review": "This movie gets a lot a hate but was what I expected which was a casual movie with some action, comedy and a plot line that follows the general Hollywood formula. If you don't expect this to be the best movie of the year you should enjoy it."
  },
  {
    "rating": "5/5",
    "review": "Whoever called this movie 'a piece of junk' should be declared 'mentally unsound'. A lot of movies in history were declared flop or slow starters, but went on to become cult classics in their own genre. This is going to be one of them."
  },
  {
    "rating": "5/5",
    "review": "I 100% don’t agree with the critics. Was it gone With the Wind? No. Was it an entertaining ride? Absolutely. I would love for them to make a sequel."
  },
  {
    "rating": "5/5",
    "review": "Not many movies can evoke an emotional response. This is genuinely a great movie. I can imagine reading the book first would greatly affect your opinion in the sense that I’m not sure anyone can name a single movie that has lived up to expectations based on a book. That being said put the book out of your mind completely if you have read it. Drop all expectations and just trust the process. While small things can be criticized, keep an open mind. This movie is not just another apocalyptic tech takes over story. While the entirety of the story is greatly exaggerated, it is a great analogy of the world we live in today. Consumed by what we think has saved us. Instead of listening we react. Take the time to really reflect on the message and feel what the characters feel. Though I doubt anyone will read this or it’ll change anything. It’s definitely still a good watch."
  },
  {
    "rating": "3/5",
    "review": "This is an awesome looking film which is quite thin in substance. This film does improve as it goes on and my daughter loved it."
  },
  {
    "rating": "3/5",
    "review": "Inegavelmente lindo e impressionante, visualmente é muito lindo, chamativo, e com muita criatividade. Principalmente em efeitos, que são pra mim o verdadeiro ponto alto do filme. Mas, já não podemos dizer muitas coisas sobre ROTEIRO e DIREÇÃO dos Irmãos Russos, que para mim, fizeram mais uma obra extremamente esquecível.. e que poderia ter sido MUITO mais. Pois promissor com certeza é. Personagens beem fracos e desinteressantes, trilha sonora sem originalidade, apenas básico do básico. Efeitos sonoros são um grande acerto pelo menos. E o elenco, é muito chamativo de fato.. pena que alguns deles são um desperdício gigante. E também alguns são personagens que já encarnaram antes no passado. No geral, bem fraco e esquecível. Mais um filme dos irmãos Russos que poderia ter sido muito melhor. \"É ruim?\" - Com certeza NÃO. \"É bom?\" - Para mim, SIM. \"Eu gostei?\" - SIM, gostei bastante. \"Vale a pena?\" Na minha opinião, vale sim a pena. Maass é bem esquecível. Apesar de eu ter gostado."
  },
  {
    "rating": "1/5",
    "review": "This movie lacks any substance. The Idea that robots are treated effectively as evil slaves is done better in so many other sci-fi movies. The acting is nat bad, but is lost in in the mediocre plot."
  },
  {
    "rating": "4.5/5",
    "review": "It is a good movie. It is not bad. I am not trying to sound simple but frankly the critics got it wrong. Bad movies have things in common and this movie does not belong with bad movies. I like it. It was ENTERTAINING. This is important. No one has time to sit through movies that are not entertaining. That being said, my only complaint is that it is the same story that has been told 10000 times. Good vs Evil. Evil dude does bas things and good people try to take down the evil guy. Avatar? Same movie. (For example)"
  },
  {
    "rating": "0.5/5",
    "review": "First ever review of my Life but couldt disagree more with all the audience. I can't really believe people saying it's a good movie. I can't also believe someone decided to produce this kind of over-budgeted thing. VFX were good. Be kind to yourself, if you have two hours to waste, watch something else."
  },
  {
    "rating": "3.5/5",
    "review": "Once again ignore critics, unless it's a movie about a prostitute or has subtitles or is a movie about how someone beats the odds this the critics will immediately relegate this to a terrible movie. The Electric State is a pretty fun watch. Is it a great movie? Probably not, is it good enough to be entertaining? Absolutely. The movie takes place after a war between Robots and Humans after robots achieved sentience and wanted freedom from servitude. The movie is about that and it's about a brother and sister reuniting and finding others to help against a common foe. Again, ignore the critics judge it for yourself."
  },
  {
    "rating": "5/5",
    "review": "Great Movie! Well thought out. Could be a single movie or is open to a sequel based on one of the last clips. Great family fun. I think everyone who takes too technical of an approach and doesn’t appreciate this film, doesn’t remember the wonderment of young families having a relaxing time watching a movie. It’s not meant to be epic, or life altering, symbolic of deeper things. Although it does deal in foreseeable moral issues in the future. Or the loss of a family member in death. But It’s just a normal family movie!! If this was made in 1990 it would have been the most epic movie. People who are not appreciating this movie are getting use to amazing movies and not appreciating them. Now they are constantly board and critical. Hey Netflix great Job!!"
  },
  {
    "rating": "3/5",
    "review": "Em 1990, explodiu a guerra entre os seres humanos e os robôs. Em 1994, a guerra terminou com a vitória dos humanos, que usaram uma tecnologia desenvolvida por um cientista chamado Ethan Skate, que transfere a mente das pessoas para corpos eletrônicos chamados de drones. Os robôs foram exilados em uma Zona de Exceção. E a empresa de Skate enriqueceu com sua tecnologia. É quando Michelle descobre que a mente do seu irmão falecido está no corpo de um robô e ela decide ir até a Zona de Exceção para descobrir a verdade, porém há uma conspiração bem maior por trás. Os anos 90 viraram os novos anos 80? É meio estranho uma ficção científica com tantos conceitos inexistentes hoje em dia, passar durante a década de 90. Por que não jogar para o futuro? Só para aproveitar a trilha sonora? Depois dos Vingadores, os irmãos Russo não acertaram mais. E este filme segue os outros: uma bola na trave. Tinha os elementos certos, o elenco certo, mas algo não me pegou. Chris Pratt faz mais uma cópia do Starlord. Tucci e Esposito entregam os vilões que eles estão acostumados a fazer, com um pé nas costas. Millie Bobby Brown não acertou como protagonista como em Stranger Things. Talvez porque lá existe uma química entre o elenco que lhe dá o suporte necessário. Aqui ela e Pratt não combinaram. Ficou forçado o motivo pelo qual ele vai ajudá-la, Na parte técnica, o filme se sai bem (também com um orçamento de US$ 320 milhões). Os efeitos visuais são muito bons e mesclam bem o CGI com animatronics e outras técnicas. The Electric State é o filme que ficou no quase, sem um bom roteiro, que aproveitasse tudo o que a história proporcionaria."
  },
  {
    "rating": "3/5",
    "review": "It's not the worst movie I've ever seen, but it feels extremely generic. The characters aren't very good and it misses the point of the source material."
  },
  {
    "rating": "4/5",
    "review": "Is it a perfect movie that's going to win award after award? No. Is it a horrible movie that is unwatchable? Also no. It's fine. You can put it on watch it, follow it and just enjoy it with some popcorn. Seriously that's all it's trying to be. I don't understand all the hate reviews for it. It's like certain movies fall into this thing where it becomes popular to hate or love it and then the masses just go with that in order to fit in. This movie is 100% more entertaining than Wicked and yet they have the exact opposite reviews. (Wicked is an unbearable movie, with bad acting and CGI that drags) The Electric State has decent acting, pretty good CGI and a fine pace. Storyline and plot isn't complicated. The only thing is it feels like Ready Player One meets the MCU. If you go in wanting to hate any movie, odds are you will. If you go into this movie just wanting something fun to watch for a couple hours, it'll do that."
  },
  {
    "rating": "4/5",
    "review": "Definitely better than the reviews. The world is interesting while it doesn't make sense when you think about it. The characters ,humans and bots alike are kinda cool and work well together. The emotional background stories are simple but work. Action is meh but has some very fun ideas. All in all I am positively surprised."
  },
  {
    "rating": "5/5",
    "review": "I often find that if the critics hate it, the audience it's designed for will love it. This is perfect escapism, what a fun and well done movie. This was such a fun watch. It was a great way to redo end rethink the 90s and all the touches and characters were so great. Thank you Netflix! Millie was great in this. Same with Chris. A+"
  },
  {
    "rating": "3.5/5",
    "review": "It's a fun movie. As others have stated, it could have been much better using most of the same story, directing and effects, but it's definitely worth a couple hours on a Saturday night. I really didn't like the ending though...one of the parts, among others, which could have been more thought out and could have made this movie great."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved this movie reminds me of some Jim Henson productions. Nice story original characters and setting. The idea was pretty original which is lacking nowadays, good acting, a good sci-fi, adventure with some heartfelt themes. Bad guy could've been developed a bit more in my opinion, but definitely worth a watch."
  },
  {
    "rating": "1/5",
    "review": "1000 plot holes in the first 10 minutes. 0/10. Waste of time. Not even entertaining. So bad I made a rotten tomatoes profile just to give it this review."
  },
  {
    "rating": "3.5/5",
    "review": "Fun Gen X nostalgia with some great punchlines. I imagined a packed theater on a Saturday night laughing out loud at the screen. The FX was better than most of the recent blockbuster movies released in the past few years, rarely was I taken out of the moment by a bad effects shot. Tighter editing would have made this a better experience. Millie and Chris are a great together. Maybe in the MCU in the future?"
  },
  {
    "rating": "0.5/5",
    "review": "Top 5 worst movie I’ve ever seen"
  },
  {
    "rating": "5/5",
    "review": "This is one of my favourite movies of the last few years! I have NO IDEA why the critics are cutting it down. The critics have no credibility anymore."
  },
  {
    "rating": "5/5",
    "review": "I always like it when a good movie is panned by the major critics. In fact, a critically-panned movie almost always ends up being delightful - as The Electric State was. I honestly cannot understand the negative reviews. Do yourself a favor. Only listen to the critics as a way of finding great movies, because great movies are the ones the critics consistently pan. The Russo Brothers have created yet another brilliant movie."
  },
  {
    "rating": "5/5",
    "review": "Don’t listen to the critics! This movie is tons of fun, period. Anyone who says this is a bad movie doesn’t know how to enjoy things. It’s sad."
  },
  {
    "rating": "4.5/5",
    "review": "The critics must have watched a different movie. This movie was good, really good, really entertaining. My wife and I and teenage son and daughter all enjoyed it for family movie night. Let yourself go with the story. It's an emotional build right up to a very satisfying end. The story of the robots suck you in and you build that connection. Unique characters, visual scenes, great cast, engaging story. Thoroughly enjoyed this movie."
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved it, it takes you on a ride of emotions, the hate for this movie is honestly so forced."
  },
  {
    "rating": "5/5",
    "review": "So different. Dark and funny, great sets and scenes. Sometimes I could totally see the comic book behind the scene. How do they think of this stuff!!"
  },
  {
    "rating": "2.5/5",
    "review": "Its missing the spark that makes films memorable, exciting, and unforgettable. Watch it, but dont expect the explosions on screen to make your heart skip a beat."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie. It has a unique plot and is very well done. Not sure why the critics don't like it. I think young and old will enjoy this movie."
  },
  {
    "rating": "5/5",
    "review": "My husband and I loved this movie. It’s heart warming, funny and lots of action."
  },
  {
    "rating": "5/5",
    "review": "Entertaining movie great cast"
  },
  {
    "rating": "5/5",
    "review": "Yes its not a deep thinking movie with a complex and thought provoking plot, but while we do need movies like that, sometimes we just need fun movies where we can sit back, relax, and enjoy the movie! This movie is one of those types and if the critics don't like it, who cares, most everyone else seems to."
  },
  {
    "rating": "5/5",
    "review": "Loved it! Great acting, I laughed a lot throughout and it had emotional yet satisfying ending."
  },
  {
    "rating": "4/5",
    "review": "Critics are off their rocker, Rotten Tomatoes needs to change who reviews these movies... It's creepy, interesting, well-acted enough, and visually thrilling enough to be regarded much better. Even the storyline was better than I expected. As a sci fi lover the visual aesthetics and setting alone were enough for me to give it 4 stars. The car being thrown at the window scene was one notable moment of incredible filmmaking to me."
  },
  {
    "rating": "2.5/5",
    "review": "There was a good movie in there somewhere. Basically a Wizard of Oz story with pacing issues and boring dialogue. The robots were the best part. Really dragged on with not enough going on until the big battle at the end. Would have been better with a better director like Spielberg or George Miller. Millie Bobby Brown is bland. She's no Carrie Fisher. Chris Pratt is played out. They needed to amp up the emotional range."
  },
  {
    "rating": "3.5/5",
    "review": "Solid practical and digital effects hold up this predictable but average movie. Despite the basic story it is an enjoyable watch. The movies performers are good but nothing outstanding. It's a solid popcorn flick. Something you can through on and simply enjoy. The 90's nostalgia alone makes it a tone of fun."
  },
  {
    "rating": "4/5",
    "review": "It was actually quite entertaining. Not sure if it’s because my expectations were low or what. I think 15% from the critics isn’t justified. I’d say it’s more like 50-60%"
  },
  {
    "rating": "3.5/5",
    "review": "What it lacks in depth and a substantive backstory, it makes up for in charm, character, and warmth... in spite of its somewhat dreary dystopian story. It plays as a YA Sci-Fi, and delivers on this"
  },
  {
    "rating": "2.5/5",
    "review": "Better than He-Man 1987."
  },
  {
    "rating": "1.5/5",
    "review": "Uninteresting premise, worse execution."
  },
  {
    "rating": "4/5",
    "review": "Can’t understand the critics’ absolute hatred of this movie. It made me feel a range of emotions and had a poignant message about our need for human connection. Amazing cast."
  },
  {
    "rating": "1/5",
    "review": "Seems like the star of the movie was special effects. Story and characters could have been made more 3 dimensional. I felt very meh after watching this. My expectations were high, too high. I wish I hadn't watched this. And I'm huge fans of the main cast, movie just a bad story or very badly directed. I'm sure it could have been better, with better writing and directing. Was so hoping this would be good."
  },
  {
    "rating": "4.5/5",
    "review": "AMAZING!!! Chris Pratt and Millie Bobby Brown together, are you kidding me?! Great story, acting, CGI and cast! Save yourself some and only read this review and go watch it!"
  },
  {
    "rating": "5/5",
    "review": "A brilliant story of the hatred of men towards those they see inferior all through an adolescent lense."
  },
  {
    "rating": "4.5/5",
    "review": "Our family really enjoyed it. Some curse words but besides that it was a simple yet fun enough storyline for everyone to enjoy. Graphics were amazing!"
  },
  {
    "rating": "3/5",
    "review": "Ing. Personally, I really enjoy the retro-futuristic setting, as it is visually appealing and original. However, I believe the plot, resolution, and central conflict lack depth, which weakens the development of the story. Despite this, the actors delivered outstanding performances, but the overall result fails to stand out, earning a rating of 3/5. Undoubtedly, this work had the potential to offer something far more memorable. Esp. \"Personalmente, me encanta la ambientación retrofuturista, ya que es visualmente atractiva y original. Sin embargo, considero que la trama, el desenlace y el conflicto central carecen de profundidad, lo que debilita el desarrollo de la historia. A pesar de esto, los actores hicieron un trabajo destacado en sus interpretaciones, pero el resultado general no logra destacarse, mereciendo una calificación de 3/5. Sin duda, es una obra que tenía el potencial de ofrecer algo mucho más memorable.\""
  },
  {
    "rating": "5/5",
    "review": "I'm not sure why this show has been getting so much hate it's cute, it's sometimes fun, it's insightful and occasionally very dark. And above all it's worth a watch"
  },
  {
    "rating": "5/5",
    "review": "Great storyline, acting and overall emotion. Acting/genre similar to Guardians of the Galaxy. Would definitely recommend to others."
  },
  {
    "rating": "3.5/5",
    "review": "Rage with the machines. The Electric State is a 2025 American science fiction action-adventure film produced and directed by Anthony and Joe Russo 🤖 It’s good 🙂 Worth a watch. I’d recommend it if you like this genre 👍🏼 An orphaned teen hits the road with a mysterious robot to find her long-lost brother, teaming up with a smuggler and his wisecracking sidekick."
  },
  {
    "rating": "5/5",
    "review": "Very entertaining! Definitely worth checking out! Don't let the critic rating control what you watch and like!"
  },
  {
    "rating": "5/5",
    "review": "I loved it. I was drawn in from beginning to end and thought it was masterfully imagined."
  },
  {
    "rating": "2/5",
    "review": "You could tell the script almost from the beginning. It feels like and empty film and it's sad because It could have been a lot better"
  },
  {
    "rating": "5/5",
    "review": ""
  },
  {
    "rating": "4.5/5",
    "review": "This should have been in theaters. I took a half star because it was a bit slow at times, but overall my whole family loved it."
  }
]