[
  {
    "rating": "0.5/5",
    "review": "My most favorite part was when the movie ended."
  },
  {
    "rating": "5/5",
    "review": "Just amazing I know some say 1 and lots follow but this is an amazing film and you need to listen to your heart."
  },
  {
    "rating": "0.5/5",
    "review": "Disney has been destroying classic movies and stories, and this one was no exception. I think the movie is too bad, to be honest."
  },
  {
    "rating": "0.5/5",
    "review": "This movie could have been called anything else but Snow White. I imagine would would just have been easier since this movie has nothing to so with the original. And sorry, but watching Rachel struggling to seem graceful was killing me! It was just not the right fit."
  },
  {
    "rating": "0.5/5",
    "review": "Why would Disney change the story line?! Some of the most iconic songs were not included the dwarfs were not played by real humans but they had a little person playing one of the bandits! What in the world!? The acting was corny. The main actress . The evil queen didnt seem natural, it was all bad acting. Stop all of this Disney! Dont ruin these classic movies! Overall, very disappointing!"
  },
  {
    "rating": "1/5",
    "review": "The best part of the film was when everyone got up at the end and left the theatre....Truly appalling"
  },
  {
    "rating": "0.5/5",
    "review": "What a waste of a Snow White movie"
  },
  {
    "rating": "1/5",
    "review": "UUGGHHH...... Just horrible"
  },
  {
    "rating": "2/5",
    "review": "hay mas canciones de diálogo solo dura cinco minuto hablando"
  },
  {
    "rating": "1/5",
    "review": "The unnecessary CGI and horrible acting by Gal Gadot made this watch unbearable."
  },
  {
    "rating": "0.5/5",
    "review": "horrible not the disney snow white you remember"
  },
  {
    "rating": "1/5",
    "review": "This movie is absolute trash, I'd rather get run over by a bus instead watching this. The dwarfs in it look like creepy old grandpa's, this is just the original movie but much absolute trash. Please watch the original movie instead than this new Disney live action trash."
  },
  {
    "rating": "0.5/5",
    "review": "Only saving grace of this film was Rachel Zegler and her wonderful voice. However Gal Gadot was a hard watch. Messy acting, poor line delivery"
  },
  {
    "rating": "2/5",
    "review": "If I could post a one star or no stars I would. But they would accuse me of reviews bombing. I stopped watching after 30 mins it was so stupid and believe it or not Rachel was the best part of this movie by far. Amazing voice, but I can’t help but hate her for all her political attacks. I will NEVER pay to see her do anything for that alone reason. Verified indisputable truths, she sucks"
  },
  {
    "rating": "1/5",
    "review": "Really terrible acting, and all around terrible movie. They should’ve just created a brand new movie and not called Tried to use snow White as a selling point. It’s nothing like Snow White."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute waste of time... they completely destroyed the original story! It's like Disney is deviating further and further away from the original story lines whenever they decide to do a live action movie or a side spin of a film such as what they did with LightYear. They completely messed that one up as well. Word of advice: don't waste your money or your time on this film. It's completely garbage at best!"
  },
  {
    "rating": "0.5/5",
    "review": "Smh took a great movie and ruined it"
  },
  {
    "rating": "5/5",
    "review": "I liked the part at the end when everybody was dancing in white clothes"
  },
  {
    "rating": "5/5",
    "review": "My husband and I took our 6 & 3 year olds to see for mother's day. We really enjoyed the whole movie, the characters were lovable, the songs were clever (the voices singing the songs were beautiful), snow-white character really nailed the bewildered look the whole movie. The plot was clear, the villain was dark but will not give the kids nightmares. We have been listening to the soundtrack at home ever since we saw the movie. I would pay to see it again + we look forward to having it on Disney+. Very family friendly 🌟🌟🌟🌟🌟"
  },
  {
    "rating": "1.5/5",
    "review": "I put aside all the rhetoric about this movie and tried to watch it fairly. Honestly, I did not like it, mostly because they seemed confused whether to honor the original story or to put a new spin on it. Other recreations have been good at balancing, but this one seemed awkward."
  },
  {
    "rating": "4/5",
    "review": "Rachel excelled in this, some casting felt off however the film is worth a watch!"
  },
  {
    "rating": "2/5",
    "review": "The classic tale comes to life. Disney's Snow White, or simply Snow White, is a 2025 American musical fantasy film directed by Marc Webb 🍎 This remake doesn’t always work as well as it should, and for some reason it lacks charm… Can’t recommend it. Meh, it passed the time. Sort of. 😕 Following the benevolent King's disappearance, the Evil Queen dominated the once fair land with a cruel streak. Princess Snow White flees the castle when the Queen, in her jealousy over Snow White's inner beauty, tries to kill her. Deep into the dark woods, she stumbles upon seven magical dwarves and a young bandit named Jonathan. Together, they strive to survive the Queen's relentless pursuit and aspire to take back the kingdom."
  },
  {
    "rating": "0.5/5",
    "review": "Weak movie, you can tell they backed away from an even more ridiculous story so the reshoots are visible and weird"
  },
  {
    "rating": "1/5",
    "review": "Save your money and watch something else. I mean really. I wish I can give 0 stars."
  },
  {
    "rating": "0.5/5",
    "review": "very very disappointing..."
  },
  {
    "rating": "0.5/5",
    "review": "Lo mejor fue la reina."
  },
  {
    "rating": "5/5",
    "review": "This version is beautiful! It's sweet but strong, follows the original story adapted to the times, and the star is gorgeous and a fabulous actress. It brought great memories, and my kids and I had a lovely time! I strongly recommend it. You'll enjoy it!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely wonderful movie with singing, dancing, story and acting. The seven dwarfs were exceptionally heartwarming. I liked the story variation from the original Snow White. What a happen ending where the people choose kindness over evil."
  },
  {
    "rating": "0.5/5",
    "review": "Very uninspiring and changed the original story too much. The computer generated dwarves are a little creepy too. Singing is mediocre at best. Disney completely missed at best."
  },
  {
    "rating": "3.5/5",
    "review": "Better than expected. Dwarves were the best part."
  },
  {
    "rating": "5/5",
    "review": "I happy movies . Good movie for family and Disney fans.big movies. I Good Disney marketing movies and more movies future .dark movies . I think age 15 and 18 adults movies. I say things change movies for late Christmas movies in 2024. The older adults feel funny movies. I think Disney parks theme park. I think theatre season, I see future movies and shows and musical performances and Disney extends movies and television and shows in 2025 . I think 2025 movies is pretty cool film for audiences but because film teams good at making money. Content creators continue developing Disney projects for Disney plus future projects continue more Disney content."
  },
  {
    "rating": "4/5",
    "review": "Wonder how many of whom written negative, one sentence reviews actually saw the movie? Probably almost all just jumped on that bandwagon of hate for what ever reason. We all know some people will hate no matter what just because it’s Disney. Yes it’s not the “ Snow white and the 7 dwarfs” what we’ve all seen before. It’s new but if you not going to see this with hate prior start watching it, you might enjoy it. CGI? Yes it’s cartoon style but don’t forget this movie was made for children and kids of course they’ll make cgi characters cute and unrealistic. So if you got surprised or upset because of this I think you should stop for a second and think about life… My only issue was the obsessive amount usage of autotune."
  },
  {
    "rating": "0.5/5",
    "review": "Unwatchable. Kristen Stewart played a better snow white."
  },
  {
    "rating": "0.5/5",
    "review": "Peor live action que he visto. A los enanitos, mal hechos, se nota que los agregaron una vez terminada la película. Lástima que no contrataron a personas pequeñas para el papel desde un principio y que no se apegaron a la historia original."
  },
  {
    "rating": "3/5",
    "review": "Good enough for a kids movie. Subpar."
  },
  {
    "rating": "0.5/5",
    "review": "demasiado incongruente"
  },
  {
    "rating": "5/5",
    "review": "I like how Snow White wants to sing about wishing"
  },
  {
    "rating": "0.5/5",
    "review": "The worst movie of all time!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Definitely something to stay away from. Do not waist your time on it."
  },
  {
    "rating": "0.5/5",
    "review": "Worst Acting, Forcefully inforced Women Impowerment which doesn't work at all. Just watch the Old one."
  },
  {
    "rating": "0.5/5",
    "review": "I didn't watch the movie in theaters but I can tell how bad it is and I'm so glad it dropped cause Disney has gone too far with this one thinking the original Snow White and the Seven Dwarfs is seen as a joke for audience well guess what? It's not cause it's a alter classic for generations but Modern Disney is been a coward for thinking the live action movie will make them more money like with Alice in Wonderland (2010) or The Lion King Live Action. Idk what are they thinking in their heads but clearly they need to get that thoughts out of their heads and make something much more adventurous and emotional and even magical like they have done in the good old day......But I guess it's the future so I guess we need to change but we don't have to change cause we are proud of what we are on the inside. We are perfect just being us. We can only hope that Disney will finally open their eyes and see what they are doing wrong and try to be the Disney we all know and love. But until then Snow White (2025) is by far the absolute worst Disney Live Action of all time and yes it's even worse than Pinocchio (2022) because at least this movie was laughably bad. This one has nothing there is nothing to enjoy here. So I'm not watching this garbage and either should you."
  },
  {
    "rating": "0.5/5",
    "review": "Bad acting all around, and it stars a person that spent the last year questioning your past movies."
  },
  {
    "rating": "0.5/5",
    "review": "I honestly don't know what the hell happened here, but wtf did they do to the dwarves. Nightmare fuel."
  },
  {
    "rating": "4.5/5",
    "review": "The movie was well done. I thought the music was fabulous, the animation, costumes,the casting. I highly recommend this film. It was fun, thoughtful, a great message for all ages, and brought such joy."
  },
  {
    "rating": "4/5",
    "review": "It feels there are many rooting against this movie. It seems such noise has distracted from what I consider a fairly enjoyable movie. Rachel Ziegler did a great job. She has an outstanding singing voice. The storyline for the most part aligned to the classic 1936 version. And the movie went quick and had a nice pace. I would recommend this movie for all ages."
  },
  {
    "rating": "5/5",
    "review": "Beautiful singing & awesome acting!"
  },
  {
    "rating": "5/5",
    "review": "The story was different but it was visually pleasing. It would have been a great time to employ actual little people who would have appreciated the work since it is a live action movie."
  },
  {
    "rating": "0.5/5",
    "review": "I just watched the movie for Mother’s Day, I didn’t like it, my mom didn’t like it, nor did my cousins, horrible move plus it kept skipping from scene to scene without explaining how the queen nor the princess or the peasant (her boyfriend) got to a certain area."
  },
  {
    "rating": "5/5",
    "review": "So fun and great music!"
  },
  {
    "rating": "5/5",
    "review": "It was a really sweet movie"
  },
  {
    "rating": "2/5",
    "review": "This movie would've been way better if they hadn't kept rewriting it. The best thing about this movie is easily Rachel's performance."
  },
  {
    "rating": "2/5",
    "review": "It wasn't nearly as clever & charming as previous Disney movies. The 7 dwarfs were especially ugly & not anything like the 7 dwarfs in the original Snow White. Rachel Zegler was fine, but she just didn't seem right for the role of Cinderella to me. Gal Godot was great as the evil stepmother."
  },
  {
    "rating": "0.5/5",
    "review": "The Worst Movie Ever!! Don’t waste your money"
  },
  {
    "rating": "4.5/5",
    "review": "Inspiring. Great musical dance numbers"
  },
  {
    "rating": "2/5",
    "review": "No. Just no. I think there were some parts that I found endearing but mostly I just was not invested and I’d rather go watch the original."
  },
  {
    "rating": "1/5",
    "review": "Horrible execution of a classic. These Disney films are trying to hard."
  },
  {
    "rating": "0.5/5",
    "review": "Awful screen play / no originality and awful acting. Dont waste your time or money!"
  },
  {
    "rating": "1/5",
    "review": "Stay away from this movie AT ALL COSTS"
  },
  {
    "rating": "0.5/5",
    "review": "wow!!! I mean I tried to look past all the negative media attention it garnered prior to being released...It was a really tough watch :("
  },
  {
    "rating": "0.5/5",
    "review": "What is disney doing? Stop destroying the classics, make new stories if you want, but please dont destroy these beloved childhood stories. So disappointed."
  },
  {
    "rating": "4/5",
    "review": "Not my favorite but still enjoyable. A lot of songs and half of them were good."
  },
  {
    "rating": "4/5",
    "review": "Um Live action bem divertido"
  },
  {
    "rating": "0.5/5",
    "review": "After watching it, had to confirm all those bad rumours. Really really bad. Don't even bother, I wasted my time."
  },
  {
    "rating": "0.5/5",
    "review": "Calling this a joke would be generous. Worst excuse for a movie in a long time."
  },
  {
    "rating": "0.5/5",
    "review": "yes, im here to pile up on the horrible waste of time, history ruin, I will say that the acting is not bad, is not the best but, the story and CGI ruined the hole plot."
  },
  {
    "rating": "0.5/5",
    "review": "I didn't think the reviews could be true. i didn't think it could actually be as bad as people said. I was wrong."
  },
  {
    "rating": "1/5",
    "review": "trash doesn't stick to original snow white plot from cartoon to overly woman power. I support woman but if you're gonna do a remake from the original don't mess it up cuZ you'll make the fans upset"
  },
  {
    "rating": "5/5",
    "review": "My 10 yr old granddaughter & I loved it! She has not seen the original!"
  },
  {
    "rating": "1/5",
    "review": "Disappointing version bad casting and performance don’t waste your time or money on this garbage"
  },
  {
    "rating": "0.5/5",
    "review": "The cgi of the dwarfs was awful, it gives me nightmares!"
  },
  {
    "rating": "4/5",
    "review": "I thought it was good for what I thought. it was meant to be, a children's movie. if you want to get hung up on all the other political junk, that's up to you."
  },
  {
    "rating": "2.5/5",
    "review": "The film is about a girl whose name is Snow White. She lost her father and has a very bad mother in law. The film tells the story of how she meets new good friends and takes back her kingdom. The film was very interesting, but I didn't like how much they changed the original story. I recommend it for people who like watch movies in family or with kids."
  },
  {
    "rating": "4.5/5",
    "review": "Fun, good songs and acting. Kids loves it."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute trash. I tried. I really did"
  },
  {
    "rating": "1/5",
    "review": "Unfortunately one of the worst movies of all times."
  },
  {
    "rating": "1/5",
    "review": "The worst movie ever. What a waste of time"
  },
  {
    "rating": "1/5",
    "review": "Acting was poor and story was terrible. Save your money at this point."
  },
  {
    "rating": "0.5/5",
    "review": "Bad. Ga usah nonton."
  },
  {
    "rating": "5/5",
    "review": "The movie was great. I don’t know why everybody thinks it was terrible. I went with my daughter and we had a fabulous time! My daughter is nine years old, We both enjoyed dopey who was really cute and all the little creatures were adorable. I thought Gal Gadot did an amazing job playing the evil queen; And I even enjoyed the modernism of the Snow White character. The prince wasn’t overly full of himself, it was a very enjoying fairytale and we had a great time. I didn’t love how they animated the graphics of the dwarfs …I think it could have used improvement but still enjoyable. My daughter felt Snow White didn’t look pale enough 😂"
  },
  {
    "rating": "0.5/5",
    "review": "Surprisingly, the only redeeming feature of this film was Zegler’s performance. It’s very apparent that there were several major changes during production, and Gal Gadot’s performance was ultimately subpar."
  },
  {
    "rating": "0.5/5",
    "review": "Music just horrible. Let it echo echo doesn't make sense. The seven things are creepy as hell. Gal Gadot is still not a good actress. Ziegler has a great voice but the story was lame & her acting is bad."
  },
  {
    "rating": "2/5",
    "review": "i was very excited for this movie and left very disappointed. this movie is nothing like the original and the plot line just doesn’t add up. the point of the story is to have true love kiss with her \"prince” when in this movie she fell in love with a thief. very dissatisfied."
  },
  {
    "rating": "0.5/5",
    "review": "This film feels overly politically correct to the point that it takes away from the magic of the original. Even without knowing about the PR controversies — like Zegler’s comments — it’s clear that the creative direction was driven more by appeasement than storytelling. Replacing the iconic dwarfs with “magical creatures” feels forced and unnecessary. Audiences connect with timeless beauty and classic allure for a reason, and this just missed the mark."
  },
  {
    "rating": "5/5",
    "review": "I think people are just hateful cause they’re ignorant and it’s a trend. The music and new songs were great, choreography was amazing (especially the last number). All because of “politics” and for people speaking up and using their voice about issues going on in the world and trying to defend what is right and have a different opinion than the rest. It was a fun retelling of a classic, with some cool twists, nod to the original, and I think once it’s online for streaming it will have more of a chance that it deserves instead of being bashed due to ignorance. It’s a shame really. Fun and entertaining. When it comes to movies I don’t let other sway my opinion before actually giving a film a genuine chance, with an open mind. Please go watch this movie. It isn’t fair what happened to it and Rachel (who is quite talented). A dedicated casts and crew worked hard on this film, and people should see their vision of this modern adaptation of a beloved classic."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute Trash! Don’t wast your time or money on this movie that I hated every second of! Disney has definitely lowered the bar so low, it’s insane! 😡"
  },
  {
    "rating": "0.5/5",
    "review": "It was fine but they changed the orignal plot and my the kid i was babysitting was very confused."
  },
  {
    "rating": "1/5",
    "review": "I took my kids to this movie despite my reservations, and I tried as hard as I could to be open minded. Some of the songs were lovely and Rachel Ziegler has a wonderful voice. Despite that this movie is every bit as bad as people are saying. The dwarves are scary, the CGI is unrealistic and the story is silly. I can’t spend any more money with Disney in good faith."
  },
  {
    "rating": "2/5",
    "review": "it was just ok. A little change to be modern, but not crazy changes. lack of chemistry between snow and thief. my wife loved it, even though she fell asleep 3 times."
  },
  {
    "rating": "1/5",
    "review": "ABSOLUTE HOT GARBAGE POOR CASTING AND YIKES THE STORY TELLING."
  },
  {
    "rating": "5/5",
    "review": "Perfect Movie, Perfect Costumes. Zegler is perfect cast."
  },
  {
    "rating": "0.5/5",
    "review": "As much as the original had value. this is recycled and not in a way that makes it better."
  },
  {
    "rating": "5/5",
    "review": "I loved everything about this movie: the songs, the costumes, the storyline & even the dwarves! I cried, I laughed & I cant wait to see this movie, again, before it leaves the theatres!"
  },
  {
    "rating": "4/5",
    "review": "The movie was done beautifully.. I love it...what I did not like was Gal Gadot acting or singing..it was the worst parts of the movie..she looked the part but I cringed during her scenes"
  },
  {
    "rating": "0.5/5",
    "review": "I was very excited to watch this despite hearing all the negative feedback and I went in with an open mind, but walked out very disappointed. The acting was not good, songs were okay but the CGI for the dwarfs, just why? The plot change was also what threw me for a loop since the original was one of the best movies growing up and just seeing this made it so disrespectful."
  },
  {
    "rating": "0.5/5",
    "review": "This movie tried too hard to check too many boxes. Another woke Disney flop."
  },
  {
    "rating": "4/5",
    "review": "I loved the Snow White remake! I think Rachel Zegler did a great job in her role as Snow White. And she has a beautiful singing voice. \"Waiting on a Wish\" is a very good song. I also liked the lesson of this movie. True beauty comes from within! It's a great lesson for kids (and adults). Snow White stands as a good example of kindness and generosity. Also, actor Andrew Burnap does a good job as the captain of the bandits. He's very charming in this movie. And Gal Gadot is convincing as the Evil Queen. I'm glad Gal was cast for this part. And lastly, I loved the 7 dwarves. They're all very cute. Great CGI. I've seen this movie multiple times at the theater, and each time the audience gave it an applause at the end. God bless you all. Let the good things grow!"
  },
  {
    "rating": "1/5",
    "review": "The movie was clunky, the story didn’t fit or pay homage to the original. The acting was honestly atrocious and over acted, even from Gal Godat. I am unsure what in the Wild West Disney was thinking with this movie."
  },
  {
    "rating": "0.5/5",
    "review": "This failure of a movie is the final nail in the coffin for Hollywood and will mark a shift in popular culture for the better. Ultimately this reprehensible mess will offer sunshine after the rain in the form of better movies that people want to see. Better movies that they want their kids to see. Movies that don't insult the intelligence of their audience with attempts to influence people politically."
  },
  {
    "rating": "1.5/5",
    "review": "Meh! It’s the only one I can write."
  },
  {
    "rating": "1/5",
    "review": "Why and how is this movie named Snow white?? It has no relation with all the building moments of original farytail...most part is diferent..."
  },
  {
    "rating": "0.5/5",
    "review": "An utter disgrace of everything the original was supposed to be …"
  },
  {
    "rating": "0.5/5",
    "review": "I don’t like this movie is garbage and it’s not that good then the 1937 movie of Snow White"
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely awful. I can't think of a movie I've ever seen that I would rate lower than this."
  },
  {
    "rating": "0.5/5",
    "review": "The remake of Snow White was bombed. Nearly no one came to the cinema to watch the movie, which was deserved. Rachel Zegler has a good singing voice, which isn't judgeable but doesn't have the true face of 'Snow White' it just ain't her! Im sorry but the evil queen was under budget...the acting...like gurl stick to 'wonder women'"
  },
  {
    "rating": "0.5/5",
    "review": "I hate how uncanny 7 dwarf is and the story change's this is not good"
  },
  {
    "rating": "5/5",
    "review": "Beautiful adaptation of a beloved classic. They changed just enough to add backstory to characters, which only strengthens the story as a whole, while still including most of the original animated Disney classic. Ive heard negative talk about them eliminating the original love story, but I didnt see that at allthe love story is still there (complete with her humming some day my prince will come), but its more believable. The soundtrack is amazing. Please give this adaptation a chance and dont listen to unverified reviews - likely from those who have never seen it."
  },
  {
    "rating": "0.5/5",
    "review": "The actor that plays Snow White ruined the movie before it even came out I wouldn’t be surprised if I never see her in anything big again"
  },
  {
    "rating": "3/5",
    "review": "Doesn’t deserve the hate it got. It’s fine."
  },
  {
    "rating": "0.5/5",
    "review": "It is terrible in the mismatch of characters. If Disney wants to promote Latino Actors they should have all characters in the move Latino actors."
  },
  {
    "rating": "4/5",
    "review": "We really enjoyed the movie. Having grown up with the original it was cool to see the changes made to the story and my 6 year old really loved it so that was the most important part to me."
  },
  {
    "rating": "0.5/5",
    "review": "Weird weird weird. And a 400 millón flop"
  },
  {
    "rating": "5/5",
    "review": "It was just as good as the first time I saw it on the big screen. This is my sons first time seeing it on the big screen, and he loves it"
  },
  {
    "rating": "1/5",
    "review": "Just hate everything about it."
  },
  {
    "rating": "0.5/5",
    "review": "Theres so much they could have done better... the magic h as deffinatly been lost with this one"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst remakes, don't spend your money. Zegler acting is very questionable while Gadot overpowered her on everything. Bad cgi."
  },
  {
    "rating": "0.5/5",
    "review": "That Was The Waste Of My Time, Good Thing I Didn’t Watch It, Thank The Lord, I Hope Disney Will Ended Their Live Action Remakes"
  },
  {
    "rating": "1/5",
    "review": "Nothing to do with the story. Ruined it. Disney has lost their purpose."
  },
  {
    "rating": "4/5",
    "review": "I like it. Yes, i exist. But Gadot is miscast"
  },
  {
    "rating": "4.5/5",
    "review": "I loved it! I’m not jumping on the band wagon of leaving poor reviews. I genuinely loved this film. It wasn’t perfect, nothing in life is. I thought Rachel Zegler was perfect as Snow White, I was not particularly taken with Gal Gadot or the actor who played the other lead role. I thought Dopey was adorable and all the other dwarves were so lovable. The supporting actors too were extremely good. Some of the songs were a bit naff but overall I loved it and would quite happily sit through it again."
  },
  {
    "rating": "0.5/5",
    "review": "bro this movie sucked. its not even ven funny anym cus the actress herself was an egoist and hated the original movie of snow white?? worst movie of all time bro💀 even mc is way much better than this sh."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst moves I have ever watched can not recommend my aunt cried while watching it I cried cause of how bad it was."
  },
  {
    "rating": "4.5/5",
    "review": "People are mean. I love Rachel Zegler. This had charm and whimsy. The songs were fun!"
  },
  {
    "rating": "4/5",
    "review": "It was a little different from the original as a musical. Was happy that the witch wasn't as scary as the original for the little ones."
  },
  {
    "rating": "5/5",
    "review": "So cute! Very simple concepts for the young ones and beautiful cinematography for the older ones! The princess sang wonderfully the evil queen not at all…"
  },
  {
    "rating": "0.5/5",
    "review": "Like everyone that has seen this awful movie it’s AWFUL!!!"
  },
  {
    "rating": "0.5/5",
    "review": "It was ass I can confidently tell you it was a horrible trash movie made by money hungry yaks who casted someone completely opposite of Snow White childhood memory"
  },
  {
    "rating": "4/5",
    "review": "I really liked Rachel Zeuglar as snow white, Gal Gadot was not good as the evil queen. The movie also did a good job of developing the dwarves as real characters."
  },
  {
    "rating": "3/5",
    "review": "Not what expected, bad marketing, boring movie with a little bit of great music, all the scenes were so different from every point and it didn’t make me feel anything"
  },
  {
    "rating": "1/5",
    "review": "It was bland. They used to much CGI in it making it seem like a cheap cartoon."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible just horrible"
  },
  {
    "rating": "0.5/5",
    "review": "Wasn't what i expected it to be. The memes are better."
  },
  {
    "rating": "1/5",
    "review": "I did not have to stand in line to watch this. It was weird, weird!"
  },
  {
    "rating": "0.5/5",
    "review": "Stupid, that's all I have to say it's pointless. It's dumb and I will never, ever support this movie actors or complete another s***, especially the one who plays snow white. They just turned a good short into a complete another dog s*** film"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Love how they stayed true to Disney's original version. Definitely worth seeing on the big screen."
  },
  {
    "rating": "0.5/5",
    "review": "Seriously....it was bad. The acting, costume, everything! I was bored watching the beginning. I had to stop because it wasn't enjoyable."
  },
  {
    "rating": "0.5/5",
    "review": "Even though she sings reasonably well, Snow White's acting is very weak. Terrible CGIs, terrible choice of not using real dwarves. Why change the beautiful original story? My praise goes to the beautiful evil queen. I do not recommend it, do not waste your time."
  },
  {
    "rating": "0.5/5",
    "review": "Don't even waste your time trying to pirate this thing"
  },
  {
    "rating": "0.5/5",
    "review": "it was so bad i had to turn it off"
  },
  {
    "rating": "1/5",
    "review": "Oh man this was a truly awful movie. Hard pass."
  },
  {
    "rating": "3/5",
    "review": "Doesn’t deserve all the bad press. Is it the best, no! But is it bad, also no. Younger audiences(under 12) will think it’s cool. The story is similar but with a moral center on taking action rather than waiting on fate which I commend. The “dwarfs” are forest creatures having lived in the wood for over 250 years, so not humans per se. Actual humans with dwarfism are cast is supporting rolls as marksmen and others as villagers to mark the difference of human vs mystical creature. I would have liked to have seen the queen’s transition from con-artist to evil villain to have been slower as her paranoia grew, bride to full bodysuit villain costume was abrupt."
  },
  {
    "rating": "0.5/5",
    "review": "The worst movie I have ever seen"
  },
  {
    "rating": "0.5/5",
    "review": "This movie is not the best version de Snow White."
  },
  {
    "rating": "0.5/5",
    "review": "Pésima en tantos aspectos, pero de lo peor es la historia (si así se le puede llamar), es una colcha de retazos con mediocres intentos de imponer ideologías y agendas políticas. Malas actuaciones, mal CGI, aburrida."
  },
  {
    "rating": "0.5/5",
    "review": "Did not stay true to the original Disney movie, Snow White actor too politicaly active, thus causing tensions with audience, the seven dwarves are not even refered to as the seven dwarves, the dwarves were all CGI and not real actors, this movie is just a disaster."
  },
  {
    "rating": "0.5/5",
    "review": "Are you kidding me a rotten film with one actress insulting the original delightful animated film and one who plays a wicked stepmother that didn’t seem like they thought this out when casting her and the grand insult of god awful CGI dwarfs when actors and actress are available to play a wonderful portrayal of the classic characters. This film deserves to be in the dustbin of failed films adaptations right next to the live action of Ghost in the shell and Dragon Ball! Absolutely DISGUSTING"
  },
  {
    "rating": "5/5",
    "review": "I think they didn’t capture the real Snow White original film. Movie was just too misguided and the acting wasn’t the best. There was too much going on and the hair they gave the actress playing Snow White was not flattering on the her and though her voice is lovely they didn’t play some of the most iconic Snow White songs which unfortunately didn’t capture the beauty of the original film. Overall I also think there was many options for an actress to play Snow White and Disney should’ve chosen someone who wasn’t going to slander the original film and talk ill about it which caused for the live action to not preform well."
  },
  {
    "rating": "5/5",
    "review": "Unexpectedly loved this. Rachel Zegler is incredible as Snow White - amazing singing voice and absolutely luminous on screen. Loved how they have updated the story slightly so it’s not so trite."
  },
  {
    "rating": "0.5/5",
    "review": "Such trash! Rachel Z is a monster. A train wreck. I’d rather watch myself get a root canal"
  },
  {
    "rating": "5/5",
    "review": "I'm really glad I went to go see it. It was still an enjoyable movie even if people don't like the main actress."
  },
  {
    "rating": "0.5/5",
    "review": "Wouldn’t recommend it"
  },
  {
    "rating": "0.5/5",
    "review": "Eh it’s alright, would not watch again"
  },
  {
    "rating": "5/5",
    "review": "I saw this movie with my two daughters who both loved it. The CGI dwarves looked a little odd but overall the story and music was good. I'd venture to say most who gave it 1 star didn't watch it."
  },
  {
    "rating": "0.5/5",
    "review": "I once heard the sound nails on a chalkboard in a room full of crying children. Would recommend the nails on a chalkboard 100 times over before I recommend this movie. If you're on a date that you want to get rid of, then go see this movie with that person."
  },
  {
    "rating": "1/5",
    "review": "first off did not go off the ogrinal plot second why cgi dwarfs"
  },
  {
    "rating": "1/5",
    "review": "Waste of money and time 👎🏻 I like the original version"
  },
  {
    "rating": "4/5",
    "review": "Great production. Its diverse without being apologetic (ala Buzz Lightyear)."
  },
  {
    "rating": "1/5",
    "review": "Absolutely uncanny and terrible. I went in intending to separate the rhetoric from the product but it was almost impossible. Thinking back to the comments about using actors for the dwarves which resulted in the abominations we saw on screen (which was far more disrespectful and insulting...) to the messages inserted into what is a flagship story part of Disney's history. Just a massive miss."
  },
  {
    "rating": "5/5",
    "review": "Great, my grandmother went back in life she enjoyed it so much"
  },
  {
    "rating": "1/5",
    "review": "Probably the worst actress to ever star in a movie. She got a face like a bull frog, eyes a football field apart. Definitely ruined snow white."
  },
  {
    "rating": "0.5/5",
    "review": "Rachel overall didn’t even like the character why play something you don’t like?"
  },
  {
    "rating": "0.5/5",
    "review": "A movie so bad that Walt Disney himself would demolish the castle using Snow White as a demolition sledgehammer."
  },
  {
    "rating": "0.5/5",
    "review": "Really pathetic Disney. Worst Disney movie I have ever seen"
  },
  {
    "rating": "5/5",
    "review": "Thoroughly enjoyed this version. I watched it when I was a young girl 1n the 50's and it is one of my favorites."
  },
  {
    "rating": "1/5",
    "review": "I had high hopes but disappointed"
  },
  {
    "rating": "0.5/5",
    "review": "Another incredible story destroyed, as well as a cast of dubious people (except for Gal Gadot), a poor plot and a lack of charisma."
  },
  {
    "rating": "1/5",
    "review": "O filme é tão ruim que precisei criar uma conta aqui só pra dizer isso. Eu perdi meu precioso dinheirinho indo ao cinema para acabar cochilando. Nem as crianças que estavam na sala estavam empolgadas. E que péssima escolha de atores, a protagonista parece ter a cara torta e fica mexendo o rosto sem sentido."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I’ve seen in the last 25 years by far."
  },
  {
    "rating": "5/5",
    "review": "Granny liked the sword and 5 yrs old granddaughter didn't."
  },
  {
    "rating": "0.5/5",
    "review": "Disgusting. That's the only word needed... But I had to write more to be able to comment on the site."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved this real-life remake from start to finish! Incredible acting and what a beautiful refreshing take on the fairy tale! May not be one for the magots but if you're a decent human being and love everyone, you will genuinely enjoy this beauty of a film!"
  },
  {
    "rating": "1/5",
    "review": "If there would be a possibility to give it a 0, I would. You people are sick, absolutely ruined everything."
  },
  {
    "rating": "0.5/5",
    "review": "Complete destruction of a beautiful classic storyline, only redeeming quality is Gal Gadot and even she seems annoyed with it acting as the queen during the film. This could have been so great, but wtf was anyone thinking casting zegler as snow white? really? If I wanted to watch a couple of hours of forced acting from a bitter female there's plenty of protests here in Austin I can go watch, they're loaded with them. I was so sad and disappointed by this movie, it was uninspired, politically motivated drivel and why would have it been the end of the world if they just stuck with the original story and hired little people to boot? \"magical creatures\"? omg. There's a reason this thing has turned into a debacle, it's not even a cool bad, it's just bad. \"Bad\" movies from previous generations sometimes wind up gaining a cult following, I think this thing will be epically forgettable in the future, I'd be surprised if it even gets released on bluray or anything as judging from the numbers I can't think of a single person who left the theater wanting to ever see it again."
  },
  {
    "rating": "1/5",
    "review": "Yah ada film Hitam Bete gw jing"
  },
  {
    "rating": "1/5",
    "review": "Never had it... I hate this movie"
  },
  {
    "rating": "0.5/5",
    "review": "bad actress, bad casting, bad acting, stupid cgi, the feels are completely off ALL OF IT. stop trying to make something new from a classic, disney. don't get me started on mermaid ariel. honestly disney flopped so bad and su(ks."
  },
  {
    "rating": "0.5/5",
    "review": "Phim quá dở và không hiểu vì sao lại chọn Zegler vào vai này."
  },
  {
    "rating": "0.5/5",
    "review": "It deviate from the animated version than please don't called it Disney's Snow White. The CGI dwarfs were the worst and the male lead role was muted,bland.( as compared to his other works)"
  },
  {
    "rating": "5/5",
    "review": "We loved Snow White. Great sets, great story,great ending. Loved the dwarves!"
  },
  {
    "rating": "4.5/5",
    "review": "What a fun interpretation of the story. I loved the style choices and costumes. The songs are catchy and have a Broadway feel. The choreography is exact! I'm not sure why people are hating on it."
  },
  {
    "rating": "2.5/5",
    "review": "Some of the graphics were cringeworthy.. too many songs"
  },
  {
    "rating": "5/5",
    "review": "really good movie took my fiancee"
  },
  {
    "rating": "5/5",
    "review": "A Magical Experience: Disney's New Snow White Reimagining Despite the wave of negative reviews circulating online, my granddaughter and I were thoroughly enchanted by Disney's new adaptation of Snow White. This fresh take on the beloved classic managed to capture the essence of the original while breathing new life into the story for today's audience. The filmmakers made thoughtful updates to the narrative that diverge from the 1937 animated version, but these changes served the story well rather than detracting from it. The visual effects were stunning, creating a magical world that had both of us mesmerized from beginning to end. The costume design and set pieces paid beautiful homage to the original while adding contemporary flair. What impressed me most was how the film maintained the heart of Snow White's journey while adding more depth to her character. The relationship between Snow White and the dwarfs was portrayed with warmth and humor that had my granddaughter giggling throughout. Meanwhile, the antagonist brought a compelling and nuanced performance to the screen. The music deserves special mention – the score complemented pivotal moments perfectly, and the reimagined versions of classic songs struck just the right balance between nostalgia and innovation. Perhaps most importantly, the film delivered a satisfying conclusion that left us both smiling as we left the theater. It's a reminder that sometimes it's best to experience art with fresh eyes rather than being swayed by critics. This multigenerational appeal is exactly what makes Disney's new Snow White a triumph – it created a precious memory for my granddaughter and me that we'll cherish for years to come."
  },
  {
    "rating": "0.5/5",
    "review": "a very bad movie. Don´t recommend, the worst acting ever."
  },
  {
    "rating": "1/5",
    "review": "Not so good i expected more from this movie but the kids loved it 😊"
  },
  {
    "rating": "0.5/5",
    "review": "I was rooting for the poisoned apple."
  },
  {
    "rating": "1/5",
    "review": "Very boring for kids as well"
  },
  {
    "rating": "5/5",
    "review": "Talking dwarfs is so cute. It's the best musical movie ever!"
  },
  {
    "rating": "2/5",
    "review": "I liked the introduction to the plot of this film, the singing was good, wish I could say the same for some of the acting. The story got progressively worse s the movie went on. I am NOT gonna talk about the random plot hole riddled of an ending."
  },
  {
    "rating": "5/5",
    "review": "Great musical choruses, visually fun, good message/s of kindness, bravery etc and sticks to the original plot, except that it is not a prince that awakens her but a regular guy but I did not mind that at all! The 10 year old girls loved it and a 6 year old boy happily sat through it. It would be a shame to skip this on the big screen due to recent noise in the media. It's a great movie, enjoy it for that."
  },
  {
    "rating": "0.5/5",
    "review": "No matter how much Disney promotes Zegler, she is the reason of such a failure. Let alone the CGI dwarves, the diverting story. Big no no."
  },
  {
    "rating": "0.5/5",
    "review": "Please never watch this !"
  },
  {
    "rating": "1/5",
    "review": "A complete waste of time. Like why did you guys even make this piece of trash!"
  },
  {
    "rating": "0.5/5",
    "review": "I went into this film hoping for a fun, fresh take—especially after hearing all the mixed buzz—but I walked out feeling let down. The story never quite clicked: every twist felt engineered rather than earned, and the characters just never landed. Then there’s the music. Hearing the same handful of songs on repeat quickly turns what should be show‑stopping moments into palate‑washers. What struck me most was how drastically they reworked everything from the original—except the costumes, which look like they belong on Broadway, not in a live‑action movie. It’s a weird mash‑up that robs the film of any real momentum or atmosphere. Worst of all, the heart of the story is missing. The original’s sweet, earnest romance? Gone. In its place are hollow gestures that never build the kind of chemistry you want to see in a love story. At the end of the day, this adaptation just doesn’t capture what made the first one feel so special."
  },
  {
    "rating": "0.5/5",
    "review": "One of thé worset movie i ever seen"
  },
  {
    "rating": "3.5/5",
    "review": "I like a lot of people had heard murmurings of issues with the live action version of Snow White, obviously a lot of people took issue with the fact that they didn't cast someone who's \"Skin was white as snow\", which is arguably one of the few things the general public seems to cling onto regarding the original. However, despite the re-casting; I actually really enjoyed this film, it's also worth noting I'm not someone who's a Disney Stan, I will and have criticised Disney in the past to friends and family, but this film while it does indeed have its problems. Mainly for me the uncanny valley nature of a lot of the CGI, as well as what felt like a TV series level of VFX budget regarding the mirror on the wall and the clouds of smoke surrounding the evil queen when the clouds swirl around her. Rather than feeling grand and spectacular, it fell small and underwhelming if I'm being critical. However, despite all of that I did leave the cinema smiling and the film also made me feel what it wanted me to feel. I actually had tears in my eyes during some of the scenes in this film, especially when we see Snow White being mourned and ultimately that's exactly what a movie is supposed to do; make you feel something! Does this film have issues? Yes. Would I have preferred to have real dwarf actors and not CGI creations? Yes. Does re-casting snow white to not have \"skin as white as snow\" cause an issue to the telling of the story? No. Honestly it doesn't. Now, while the reason give for the name in universe honestly feels very poorly written, clearly Disney were hoping to inspire a new generation and they were never trying to please those who saw the original and that's why I'd say there are a lot of people who need to take off their rose tinted spectacles and acknowledge it for what it is. It's own thing."
  },
  {
    "rating": "5/5",
    "review": "Snow White is an inspirational and fun movie. Rachel is incredible in this role and I loved it."
  },
  {
    "rating": "0.5/5",
    "review": "I'd give this a 0/5 if I could. This movie is easily the worst Disney \"remake\" and I can't recommend this corporate slop to anyone—not even my worst enemies. DO. NOT. WATCH. THIS. MOVIE."
  },
  {
    "rating": "1/5",
    "review": "The only good thing they did was having Gal Gadot play as the evil queen. Must've been so easy for her and definitely suited her real personality on several levels."
  },
  {
    "rating": "5/5",
    "review": "Exceeded my expectations. Both the adults and children thoroughly enjoyed the movie."
  },
  {
    "rating": "0.5/5",
    "review": "The movie was bad simply not because of the movie itself just mostly about the main character in the movie itself and changing up the concept of the movie and it really crushed many snow white fans childhoods."
  },
  {
    "rating": "1/5",
    "review": "what a disappointment and what a let down, Disney keeps twisting our movies"
  },
  {
    "rating": "0.5/5",
    "review": "As i saw gal gadot acting on ths shaw i hate it and i dont recommend anyone to see it"
  },
  {
    "rating": "0.5/5",
    "review": "It was horrible. Just horrible. The movie did not need to be made or shown in public!"
  },
  {
    "rating": "1/5",
    "review": "Se você quiser ter a sensação de ver um filme de princesa da Disney, não veja esse, a essência de ser uma princesa da Disney foi por água a baixo. A expectativa de ver o filme e sentir uma nostalgia não acontece, são poucas as partes que você consegue realmente traçar um paralelo entre a animação e o live action. Um figurino e maquiagem que não entregam uma magia de contos de fada; números musicais são muitos, mas em sua grande maioria são ruins. É realmente uma pena."
  },
  {
    "rating": "4/5",
    "review": "Songs definitely were my favorite though i enjoyed the films storyline and ignored what many don't like about the two actresses"
  },
  {
    "rating": "0.5/5",
    "review": "Disgustingly bad. The original was 10/10. If you were gonna remake SNOW WHITE, you gotta REMAKE SNOW WHITE. Ya know?"
  },
  {
    "rating": "3/5",
    "review": "A lot of people have been posting terrible reviews and a lot of people went into the movie expecting to hate on it because of all the online drama but take that away. It wasn’t a terrible movie. It just wasn’t a good movie. What I spend the time in the theater to go see it again no but what I watch it at home on a streamer with some kids Yes It looks expensive. The songs are fine. The only character or cast member that didn’t hold their own on the singing side was Gal Gadot. I think if you take the politics out of it, and you take away the fact that most people are hating on Disney right now because of them trying to match the current political scheme and speak to the younger viewers or follow the current culture of people under 20 then you’ll realize what’s left is a good film with some poor choices. The over 40 people who are all bent on tearing it down. Need to remember that it’s not for them. They already had their snow White when they were children growing up and their expectation of a recreation of a movie that had its own issues needs to be kept in check, it’s just an outdated expectation of an nostalgic memory that they share from being little children. I was one of those little children I’m over 50 I get it but at the same time I can appreciate what happens and how things progress It probably should’ve been remade a long time ago to avoid this. And it wasn’t as dark as people like to let on, even though the source material Is very dark. So I say if you’re gonna skip the theater, at least give it a shot when it lands on Disney+"
  },
  {
    "rating": "5/5",
    "review": "Saw this movie with the grandkids. They loved it. So did my wife and I. Disney creatively blended real life and animation. All the songs were excellent. Loved watching Gal Godot take on the role of the evil Queen. Rachel Zegler was a great fit as Snow White. The movie is well worth seeing. Having watched it, it seems as though most of the low ratings lack any well-grounded substance."
  },
  {
    "rating": "0.5/5",
    "review": "Todo un bodrio sin magia. La protagonista actúa con la emoción de un tronco, los diálogos son vergonzosos y los efectos parecen de 2005. La Reina Malvada merecía mejor villano. ¡Un insulto al cuento clásico! Todo por el woke y la arrogancia y la pésima actuación de Rachel Zegler."
  },
  {
    "rating": "1/5",
    "review": "Utterly bad from start to finish."
  },
  {
    "rating": "3/5",
    "review": "It was ok, I was a little disappointed. The quality was quite poor and I didn’t care for the changes in the storyline. It didn’t feel like I was watching a Disney movie."
  },
  {
    "rating": "4/5",
    "review": "Disregard the politics and cast drama. My 6 year old and 12 year old watched the film and loved it. My 12 year old also loved the original. She felt that it was worthwhile to see this new live action version on the big screen."
  },
  {
    "rating": "1/5",
    "review": "it's was so boring you could hear people snoring in the cinema, my child decided to go for walk then continue watching this movie, when I asked her why, she said its boring and she didn't like it"
  },
  {
    "rating": "2/5",
    "review": "not that bad. not as good as the original but not horrible"
  },
  {
    "rating": "1/5",
    "review": "If they want to change the story, then come up with a new story. My daughter (10 years old) kept whispering where is Snow White. We left. Went home and rewatched the original."
  },
  {
    "rating": "1/5",
    "review": "Just disappointment on the snow white herself. She’s not for this role. Ruins many people childhood."
  },
  {
    "rating": "0.5/5",
    "review": "Annoyed that I have to give it any stars at all"
  },
  {
    "rating": "0.5/5",
    "review": "A nova versão de Branca de Neve (2025) é um desastre anunciado que cumpre todas as previsões pessimistas. Desde o momento em que a Disney decidiu reescrever sua própria história, removendo elementos clássicos e personagens icônicos, o filme perdeu sua identidade. A protagonista parece desconectada da essência do conto original, transformando uma jornada de autodescoberta em um manifesto genérico e sem alma. A ausência dos sete anões, substituídos por um grupo aleatório de personagens de CGI, elimina um dos aspectos mais icônicos da trama. Além disso, a falta de um Príncipe ou qualquer construção convincente de romance faz com que a história perca seu encanto atemporal. Visualmente, o filme até tenta impressionar, mas os efeitos especiais são inconsistentes e o design de produção carece da magia e do capricho que tornaram as animações clássicas inesquecíveis. A trilha sonora é esquecível, e as novas canções não chegam perto do impacto das originais. No fim, Branca de Neve (2025) parece mais um projeto preocupado em se distanciar do passado do que em contar uma boa história. O resultado? Um filme morno, sem carisma e facilmente esquecível."
  },
  {
    "rating": "4/5",
    "review": "The movie was OK. Did not like the dwarves they are out of proportion."
  },
  {
    "rating": "1.5/5",
    "review": "Honestly the best part of this movie was Gal Gadot… and that’s saying something."
  },
  {
    "rating": "4/5",
    "review": "The movie is great! The story is amazingly done! The soundtracks are absolutely a masterpiece. The actors, however, could still do better. I think, if they acted a little more natural, then this movie would turn out much better."
  },
  {
    "rating": "5/5",
    "review": "Arguably the best Disney live action yet. The music, the choreography were all so incredibly fantastic and fresh all while staying completely true to the original. I will be watching on repeat when it comes to Disney+"
  },
  {
    "rating": "0.5/5",
    "review": "I absolutely LOVE Disney!!! But this movie was terrible. It was just boring."
  },
  {
    "rating": "0.5/5",
    "review": "This is genuinely the worst movie I’ve laid my eyes on The way it disrespects the original animated movie and treats the audiences like a total piece of crap pretty much sums up Hollywood now.."
  },
  {
    "rating": "5/5",
    "review": "The movie was fantastic from start to the very end. I don't understand why all the bad reviews. This movie was absolutely amazing and Disney should be honored for it's production. Rachel was phenomenal. The other actors were extraordinary and I loved the CGI characters because they were more like the original characters in the original Snow White cartoon. I'm a 60-year-old man in this movie was not on my radar but I am glad I went to see it and will go and see it again."
  },
  {
    "rating": "1/5",
    "review": "The problem with this movie is that the original was a love movie, this is a modern girl power movie. Both good in their own way but don't remake it if it's going to be a whole different story. Pretty boring movie."
  },
  {
    "rating": "2/5",
    "review": "I expected for this movie to be the same thing like from the original snow white the actors are good but the story line does not feel the same at all 😔"
  },
  {
    "rating": "5/5",
    "review": "it was amaziiiiiiiiing I loved it. It's almost as good as the og. Rachel and gal were perfect and Andrew (Burnap ) is soooo hot. I laughed soooo hard and it was just amazing."
  },
  {
    "rating": "0.5/5",
    "review": "Don’t even bother watching this. Watch the 1930s one. That one’s much better than this garbage."
  },
  {
    "rating": "3/5",
    "review": "I don't think this movie was as bad as everyone said it was. It was not the best Disney Live Action, but it was good enough to watch once."
  },
  {
    "rating": "5/5",
    "review": "Posiblemente la mejor película del año,y en la cual los ignorantes cinematográficos,no la han dado la oportunidad por analfabetos Possibly the best film of the year, and in which the ignorant cinematographic ones have not given it the opportunity for illiterate"
  },
  {
    "rating": "0.5/5",
    "review": "This movie awful 😞"
  },
  {
    "rating": "0.5/5",
    "review": "It is the worst live action adaptation"
  },
  {
    "rating": "0.5/5",
    "review": "I saw the bad reviews but took my granddaughter to see if anyway thinking \"how bad could it be?\" Well, the 3.5 ⭐ reviews were indeed wrong. Even my eight year old granddaughter, about 3/4 of The way through the movie turned to me and said \"this movie is soooo boring!\" And she wasn't wrong. It was so bad in fact, we decided to walk out before the movie was over and go get ice cream"
  },
  {
    "rating": "3/5",
    "review": "I saw it with children - they loved it. New generation will watch and love this snow white rather than the original one. Some people just have to deal. Since they put out same material differently made, it's going to be different. It was not bad. Gal gadot though.... I'm not sure about having her sing. Anyway. Disney live action are always controversial. It's a way to get publicity. You and me - are not their audience for these movies. The new kids are."
  },
  {
    "rating": "0.5/5",
    "review": "Snow white was one of my all time fav movies until this Zegler girl messed it up completely. Even my 7 year old neice who loves snow white and was so exited to see the movie asked to leave after 30 min saying that his has nothing to do with the story she knows and loves. We did see Minecraft tho and it was awsome! I mean seriously what kind of real actress takes a classic movie and run it to the mud because of their own idioligical BS."
  },
  {
    "rating": "0.5/5",
    "review": "Poor script, poor acting, disjointed music worst movie I’ve seen in a long time."
  },
  {
    "rating": "1/5",
    "review": "Unwatchable. Walked out. Not the classic and too much CGI. off script from the original that just left a really bad taste in the mouth. Despite being the same time frame (16th century Germany) as the original movie, this adds today's norms as if it is the current world. Way too off beat and \"icky\", in a word."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely Terrible Movie! Specially because of the terrible acting of Rachel"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was completely poor trashy and ridiculous I’m seen better movies in my Time. The voice was not soprano it was actually a mezzo at most on top of all that you gave the actor a hideous haircut that looks exactly like Lord farquaad. On top of all of that it has no respect for the original film, unlike any other live action Disney movie, not accuracy of the characters nor an accuracy of them in 1937. This was a complete waste of time and effort of the crew and directors. And also, it doesn’t help the fact that Rachel Zegler has been getting herself into controversy. I think I’ll pass."
  },
  {
    "rating": "1.5/5",
    "review": "Didn't like the acting. I only enjoyed the 7 dwarfs"
  },
  {
    "rating": "3/5",
    "review": "I will say it's good. however it's not the same as the classic, while the songs are very interesting they don't just get stuck in your head like the classic did. I did however like that they added more detail about her family and what happened to them. As well as the twist of the love interest. I'm one of those people that like when they have context that would explains stuff that the original sometimes didn't. Could have it been better... yes would I watch it again maybe.....it all depends on the point of view"
  },
  {
    "rating": "5/5",
    "review": "The music and acting was great. I really liked the cartoon brought to life. My granddaughter thought the dwarves and animals were cute and well done."
  },
  {
    "rating": "4.5/5",
    "review": "It was a great movie and would watch again! I loved the actors."
  },
  {
    "rating": "0.5/5",
    "review": "Had hopes it would be good. But it’s boring. Dialog is weak. Waste of time and money. Hard pass."
  },
  {
    "rating": "4.5/5",
    "review": "Snow White (2025) reimagines the classic tale with bold visuals, strong musical numbers, and a confident performance from Rachel Zegler. The CGI dwarves are stylized fantasy creatures that fit the world, and the film leans fully into its theatrical roots. While not without flaws, this is a cleaner and more cinematic take than recent live-action adaptations. Worth seeing on the big screen."
  },
  {
    "rating": "1.5/5",
    "review": "I came in with low expectations and I still left disappointed. It's not often I want a movie to end, but that's how I felt within an hour of this one. It wasn't very engaging; I felt bored after the first 30 minutes. The transition between realism and blatant CGI was a bit off-putting, too, in my opinion, and it all just felt like it was trying too hard, yet failing in whatever lessons it was trying to teach. It's also worth noting there were around 15 kids under 12 in the showing I went to. They were all restless throughout, with parents having to step in several times, so from that, I'm guessing it wasn't a favorite with the kids either."
  },
  {
    "rating": "1.5/5",
    "review": "The movie is really boring, destroys unlike the spirit of the true story of Snow White. If it hadn't been Snow White and there hadn't been so many songs it could have been a good one and the worst is Gal Gadot's acting, it's just horrible to watch, her facial expressions are too much, she does And a little disappointed with Rachel's acting, she's much better in her other roles"
  },
  {
    "rating": "0.5/5",
    "review": "the trailer looks bad"
  },
  {
    "rating": "1/5",
    "review": "I didn’t know Lord Farquaad and Snow White were the same person."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies that I ever watched man, lost almost 2 hours of my time"
  },
  {
    "rating": "1/5",
    "review": "I don’t even know where to begin with this mess of a movie, but let’s talk about the biggest disappointment: Gal Gadot. I honestly couldn’t believe how wooden, emotionless, and downright awkward her performance was. Was she even trying? Every line delivery felt forced, every facial expression looked like she was either confused or bored. She completely sucked the life out of what should have been a charismatic, complex villain. The Evil Queen is supposed to be captivating, terrifying, and iconic — instead, we got a bland, one-dimensional caricature. It’s like Gadot walked on set, read her lines off a cue card, and left. No presence, no intensity, just a big nothing. I’ve seen better acting in high school plays. Honestly, she dragged the entire film down with her. A great villain can elevate a fairy tale — here, it just buried it. Total waste of potential. If this is what Disney thinks is star power, they seriously need a reality check."
  },
  {
    "rating": "1.5/5",
    "review": "First off, I thought I was gonna really like this movie the trailer seemed corny but alright. don’t get me wrong Rachel Zegler has a amazing beautiful voice I feel like it should had been used in a different movie possibly not this one. I get people keep saying “Snow White isn’t Hispanic she’s white her skin was white as snow” I get what they’re saying but it’s just a movie that wasn’t executed at its finest the acting wasn’t really good they’re was a lot of CGI in the movie this movie was a big let down for adults who really like Snow White the kids obviously liked it because you know their kids they don’t know better if your gonna remake a movie please have a better casting and a better plot. Hopefully this review is a little bit helpful."
  },
  {
    "rating": "5/5",
    "review": "That was a good musical! My granddaughter and I truly enjoyed it. Well done Disney!"
  },
  {
    "rating": "5/5",
    "review": "Amazing loved the rendition of high ho. Consistent to original story."
  },
  {
    "rating": "4.5/5",
    "review": "Enjoyed very much. Grandkids loved it!"
  },
  {
    "rating": "0.5/5",
    "review": "This Movie Sucks Ass... It wasn't enjoyable and the original story was completely different and it just didn't feel right. And didn't feel good... The plot was very dumb down and it was boring and bad. Worst movie i ever seen."
  },
  {
    "rating": "0.5/5",
    "review": "No one asked for this"
  },
  {
    "rating": "1.5/5",
    "review": "Simplesmente um desrespeito a obra original! Sem mais sem menos, um filme pobre,mesmo com orçamento de milhões, atuações medianas,músicas fracas,nada convincente"
  },
  {
    "rating": "0.5/5",
    "review": "Too much damn singing … the singing has too go it’s boring."
  },
  {
    "rating": "2/5",
    "review": "Visuals are beautiful. That’s about it. Felt like “Beauty and the Beast”. Watch if you want—have low expectations."
  },
  {
    "rating": "1/5",
    "review": "There was more music than a story line, the lead actress was terrible. They could have done better with this movie. Disappointing."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is boring and preachy. I thought I’d be able to sit through it but it was maddening and I was actually relieved when my daughter wanted to leave. The cgi magical small people scared her and I thought they were really creepy too. The whole thing was a disaster."
  },
  {
    "rating": "5/5",
    "review": "Excellent Disney movie"
  },
  {
    "rating": "1.5/5",
    "review": "Wait until its streaming!"
  },
  {
    "rating": "2.5/5",
    "review": "Entertaining and colorful but not soulful"
  },
  {
    "rating": "5/5",
    "review": "Snow White is a charming movie, with beautiful art direction, sweeping vocals, and careful updates that are true to core messages of the original. The issues many have with this movie have nothing to do with the movie itself, but instead are rooted in the cynical world that we live in. It was wonderful to escape that world for a short while into pure Disney magic. Walt would be proud."
  },
  {
    "rating": "3.5/5",
    "review": "Thought it would be better than I expected, but good just the same and short."
  },
  {
    "rating": "4/5",
    "review": "Way better than everyone has been saying. Great songs! A positive message about standing up for what you know is right."
  },
  {
    "rating": "0.5/5",
    "review": "Save your money terrible Snow White no role model for young girls"
  },
  {
    "rating": "0.5/5",
    "review": "Just plain awful, a dishonor to the original author"
  },
  {
    "rating": "0.5/5",
    "review": "I am one of those people who do think if you are going to make a live action, I think the character should look like the person. Just a personal preference, the literal whole point of a live action is to make it come to life. But there are some exceptions, life action Ariel was beautiful and I enjoyed that. Right off the bat didn’t specify agree with the casting of Snow White, I decided to give it a chance. (Why is it we can cast everyone else fine but when it comes to the main character they have to make a drastic switch?) I wanted it to be a good movie but I honestly wanted to claw my eyes out the entire time. It’s so visually boring and the costumes look so cheap💔 why is the actors at Disney world look more real then the MOVIE, I could probably higher a princess actor who does birthdays and they would have a better dress on. I hate how they have to modernize everything and can’t just leave a classic alone."
  },
  {
    "rating": "0.5/5",
    "review": "This movie feels like it's trying to give me a social lesson, and the dwarves doesn't even look like they're real. It's all trying so hard to tell you the movie is a good movie, when it's not. It's boring, got caught sleeping and I left the movie theater"
  },
  {
    "rating": "1/5",
    "review": "Disney's Snow White or simply Snow White, is a 2025 American musical fantasy film directed by Marc Webb and produced by Marc Platt Productions for Walt Disney Pictures. It is a live-action reimagining of Walt Disney's Snow White and the Seven Dwarfs, which was based on the 1812 fairy tale \"Snow White\" by the Brothers Grimm. The film stars Rachel Zegler as the title character Gal Gadot as the Evil Queen and Andrew Burnap as Jonathan, a rogue bandit. Prior to its release, the film generated significant controversy regarding its color-blind casting, changes to the story and the reimagining of the Seven Dwarfs. Additional backlash stemmed from lead actress Zegler's public critiques of the original film and her political views. As lame as it got, the title also had been changed a third time. It has grossed $183.4 million worldwide. With a production budget of $270 million, it is one of Disney's most expensive films and flops. Vision wrote: \"the film was visually disappointing. Eye gouging. The dwarves and animals were upsetting to watch. Sad. The actress was not convincing at all. The story was disastrous. It looked as if it was rewritten several times. They should have let the project and the actress burn in the fires of Tinseltown instead of releasing it. The only thing promising form the film was the immersive music and sound. One fry and nothing more.\""
  },
  {
    "rating": "0.5/5",
    "review": "The Sinking of Disney."
  },
  {
    "rating": "0.5/5",
    "review": "Can I rate it a zero?"
  },
  {
    "rating": "1/5",
    "review": "The 7 dwarfs were the best part of the Snow White movie."
  },
  {
    "rating": "5/5",
    "review": "Took my Mom we enjoyed the film and soundtrack."
  },
  {
    "rating": "5/5",
    "review": "My kids didnt have much memory of the original Disney version, but they loved this movie. I thought it was a really enjoyable retelling- I loved the little details that were woven in from the original, and I loved how they treated each character with such care. Of all the Snow White spinoff films in recent cinema, this one is by far my favorite. I have a pretty fond place in my heart for Snow White in knowing the impact of the original film at the time of its release- it was my Grannys favorite, and shed put it on whenever wed make the two-day drive to her house. Realizing that she was 8 when the original came out in theaters, I understand why it was so special to her as well. When I saw the metacritic score around 40, it lowered my expectations a bit. After seeing the movie, I actually just felt annoyed by the critical reviews, because I felt like this movie deserved a much warmer reception. If you have any affection for original Disney movies, I think youll appreciate this movie."
  },
  {
    "rating": "1/5",
    "review": "worst live action disney movie of all time"
  },
  {
    "rating": "0.5/5",
    "review": "I love the songs, but the acting was horrible except for Andrew Burnap, I think he was good."
  },
  {
    "rating": "0.5/5",
    "review": "HORRIBLE MOVIE. If they wanted to do a live action remake, they should have used real Little People. Instead of AI. There was better way to remake this movie. When doing remakes why not make the original Brothers Grimm srory into the remake. I am not a fan of the actress who played Snow White but I think she would've been better in the ORIGINAL Brother's Grimm instead off the Disney updated version."
  },
  {
    "rating": "5/5",
    "review": "I loved it, it's amazing the development of the relationship between snow white and Jonathan was amazing and the dwarfs were amazing the dopey's development was incredible and the movie was fun I enjoyed it very much and I can say I liked it better than the original. The songs were good and I loved all the movie in general."
  },
  {
    "rating": "0.5/5",
    "review": "It was just terrible. About as awful as everyone all over social media said it was."
  },
  {
    "rating": "4/5",
    "review": "The movie was really cute overall and perfect for kids and adults alike. The Disney magic is still alive and well with this film. Most of the songs were amazing and catchy, the visual aesthetic was incredible too."
  },
  {
    "rating": "5/5",
    "review": "I think that it was a wonderful, and new take on such a classic story. I loved seeing how strong Snow White could be. I think the actress that played her was adorable and her facial expressions caught the struggle that I think a gentle soul like Snow White would feel. I loved the animals and the dwarves. They made my heart happy, I love the small grabs back to the original movie, dopey having diamond eyes, Snow White seeing red eyes before they turn into animals, etc.. I enjoyed it very much. 🩷"
  },
  {
    "rating": "1.5/5",
    "review": "Acting was mediocre. Visuals were good, but that's about it."
  },
  {
    "rating": "1/5",
    "review": "did not like the movie, disney should stop remaking their animated classics."
  },
  {
    "rating": "4.5/5",
    "review": "Surprisingly faithful to the original. Wonderful visuals, nice homages to several of the original scenes and shots, but with appropriate updating. The forest and the dwarves' cottage were wonderfully recreated. The best of the original's songs were retained, with a few more mixed in (some very good, others not). The story moves on at a good pace and felt both familiar and refreshed."
  },
  {
    "rating": "0.5/5",
    "review": "Very very bad, was cringing so hard. Main actress was such a disappointment. Disney ruined such a great classic."
  },
  {
    "rating": "0.5/5",
    "review": "The rest of the cast was perfect except the main ones. Zegler and Gadot doesn't work. Gadot is lacking an EVIL Queen vibes. Zegler doesn't really have a Disney Princess charisma, but atleast the voice is there. The songs were very good. At least."
  },
  {
    "rating": "0.5/5",
    "review": "What's the message? Rebellion, punishment, thieves... What movie is this? Isn't it Snow White?"
  },
  {
    "rating": "1/5",
    "review": "Es una película espantosa que no merecía existir"
  },
  {
    "rating": "0.5/5",
    "review": "This movie simply isn’t the snow white story. They changed from the actual source material so much that it’s a different story. The whole point of there original story was how true loves kiss saved her but in this one she’s like a freedom fighter like braveheart or Sarah Conner and she’s fighting to win her kingdom back. It’s weird and forced. Then the 7 dwarves and how they were utilized was pretty strange in this. Very very bad execution and a huge mistake on Disneys part here."
  },
  {
    "rating": "2/5",
    "review": "I was reaching for a replica of the amazing original Snow White movie. But, I guess they didn't aim the arrow for that! Let's start out with the positive. I liked how they added backstory for Snow White, and the ending gave a nice moral to not be vain, and stuck up as that will perish you. And the scenes(background), were really great in my opinion. I also thought the part where Snow White was scared running in the woods was really accurate to the original movie. It was great seeing it (not great, she was scared but you get the point). However, I don't get the ending when everyone dressed in white. I should have been colorful! Onto the bad parts. Snow White, is not the caring girl we know and love. She is much more serious. She doesn't talk to the creatures, like she used to in the most whimsical way. They should've had a lot more interactions, and I was so sad they didn't! They also needed more time with the dwarves! The dwarves were pretty corny. But, I really had a problem with DOPEY! First of all, WHY DOES HE HAVE HAIR? He's supposed to be bald ( don't laugh )! He is NOT supposed to be self-concious! I really wish they hadn't :( ! It brought so much LESS funniness to the film because of his negative thoughts. He needs to be happy to be himself! And him actually being able to speak, but didn't have enough courage to? Nope! Dopey being able to speak at the end, wasn't heart lifting, at least for me. I wished we had the scene where the dwarves are afraid of who is in their house. Also they should have introduced the dwarves with Snow White guessing, that was really good! But, instead they were introduced in incorrect alphabetical order. They tried to make it less boring with Happy suggesting to introduce them by the size of their toes. Also I DID NOT like the SONGS! I mean they had two originals, but they remixed it and did it poorly. (That sounds mean, but still). \"Hi Ho\" was too corny. And \"Whistle While You Work\" with the dwarves NO THANK YOU! The animals cleaning up was funny, and much better! And, it was corny. And the new songs aren't good either. A common theme is having hope&bravery \"With a Smile and A Song\" fits perfectly into it! However, they did not add it. It would fit perfectly. The dwarves washing song was som wonderful (this was left out), and I love how they cleaned Grumpy up! This was unfortunatly missing! Also the Evil Queen wastes time to send her soldiers in the woods to find Snow White. They then report a bit more physific location. But, honestly if the Evil Queen just got the info from the Magic Mirror, it would be less time consuming. I don't like the \"Prince\" so much, just because it's kind of copying Flynn Ryder (from Tangled). Snow White and the \"Prince\" are kind of like the couple of Rapunzel and Flynn Ryder. I like that couple, but the fact that they copied it? Sorry. I also feel like the \"Prince\" should actually be a Prince. Like maybe they could have made him a Prince in disguise. I don't know, just an idea to throw in there. The \"Prince\" was the substitute for the animals and dwarves. We had a LOT more scenes with him in it. Some people don't like how in the original Snow White marries a dude that she meets for 5 minutes. I never really thought about that much, until some of my family members brought it up. The plot revolves around that detail, trying to fix it. Maybe they could of added it in the backstory, though. They could of loved each other since they were young, and finally married. How they tried to fix it, changing the characters, the plot, adding characters, changing songs, adding and removing songs, lost the original movie we know and love. The original is just WAY better! I have spoken my mind, and given the review this movie deserves."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible, enough said"
  },
  {
    "rating": "3/5",
    "review": "I love Disney movies! But this was not it for me. I loved Dopey and some other characters, but the live action just didn't do it for me."
  },
  {
    "rating": "0.5/5",
    "review": "Oh Disney, Disney what did you do?"
  },
  {
    "rating": "0.5/5",
    "review": "I didn’t like it they literally changed what we were raised to in our childhood"
  },
  {
    "rating": "5/5",
    "review": "I dont get the hate. It was cute and charming. The hate for it feels incredibly forced. Rachel Zegler and Gal Gadot were wonderful in their roles."
  },
  {
    "rating": "5/5",
    "review": "We enjoyed the singing and dancing We also liked all the animals"
  },
  {
    "rating": "1/5",
    "review": "I feel like they tried to force this movie. They should have waited and written a better story that is more similar to the OG."
  },
  {
    "rating": "4/5",
    "review": "I had no idea of all the controversy surrounding this film before watching it. I had a thoroughly enjoyable evening watching this film. It's carries a happy vibe, promotes lots of lovely subliminal messages. The beliefs and values it shares are supportive to all in today's modern society. I left the cinema smiling 🥰"
  },
  {
    "rating": "1/5",
    "review": "Another Disney classic ruined by the greed of producers. Can't wait for what's next to experience, a live action re-make that's lead is CGI, film production crew is CGI, and the audience watching it is, indeed, CGI."
  },
  {
    "rating": "5/5",
    "review": "Took my granddaughter and we both loved it. Didnt realize it was mainly a musical but love musicals too."
  },
  {
    "rating": "4/5",
    "review": "Enjoyed this live version of Snow White..... But for the love of god Disney, stop with the wide spaced eyes on the main female characters.... Little mermaid was already disturbing enough!! It's distracting and not appealing :/"
  },
  {
    "rating": "5/5",
    "review": "did not deserve the reviews it got Disney adults and critics ruin everything it was actually a good movie"
  },
  {
    "rating": "1/5",
    "review": "I paid $9 to see this movie and should be refunded $18 for pain and suffering. I don't need to define what was bad because all of it was bad."
  },
  {
    "rating": "1/5",
    "review": "The Movie sucks a lot. The actor acting like nonsense. Snow White is uglier than the Evil Queen. I don't recommended watching this movie. This sucks, don't watch it!"
  },
  {
    "rating": "1/5",
    "review": "Worst movie of all. It disrespects the values of the original story, uses an actress to cast as snow white that is not even white, hates the original movie and has a horrible personality. And the nerve they had to make the dwarfs CGI instead of real dwarf actors was so disrespectful to the community. Please do not waste your money on this trash."
  },
  {
    "rating": "4.5/5",
    "review": "I loved the new Snow White movie! It was well done!"
  },
  {
    "rating": "0.5/5",
    "review": "This was a terrible project, I'm not even sure how the production team thought this was good enough to put out. Putting aside all the horrible CGI, some of the scenes do look vibrant and magical. The Dwarfs (who are iconic loveable characters) look creepy and out of place among the live cast. Speaking of the cast, let's move on to them. The only one who was a positive light was the not-a-prince, prince. Who DOES in fact save the princess by taking an arrow for her, and then waking her from the poison apple with a kiss. Making him more of a Robin Hood rebellion leader instead of a prince is an unnecessary, but fine change to the story. That doesn't change the story line too much, but what's wrong with having a prince as a love interest? There was no chemistry between the characters which really made the acting seem more like satire. Rachel has no respect for Snow White and it shows on screen. Snow White is feminine, pure of heart, and finds her inner strength from her kindness and love for others. She does not need to be loud, bold and patronizing, which I think the writers forgot and also shows in the music. It doesn't seem like it was meant for Snow White, but more for Encanto or Wish. Disney needs to remember where their foundation is and raise their standards back up. This is a fairytale meant to inspire with hope and love and show that inner beauty is stronger and more important than outer beauty, this is why she is the fairest of them all, not because she knows how to share apples and cherries. The symbolism of her wishing for love is actually important to show how unloved and mistreated she was living with her step mother. She was hoping and dreaming for compassion and human connection, isn't that something we all can relate to? That doesn't make her a weak character, it makes her a relatable teenager, which she was. That doesn't translate with Rachel's portrayal. Overall, don't waste your time on this movie, you'll never get that time back."
  },
  {
    "rating": "1/5",
    "review": "They could have made separated movie at least. Its so terrible. Its about everything but Snow white, she doesnt even look like her, doesnt match her personality, doesnt match her behaviours, doesnt match morals and they dont even have goals in common !! Imagine making a whoole different story with different characters and say it's just a realistic \"snow white\" movie. Its so bad that i couldnt stand to see her face ever again. Dont watch it!"
  },
  {
    "rating": "0.5/5",
    "review": "Just a terrible movie"
  },
  {
    "rating": "0.5/5",
    "review": "Seriously the worst Disney interpretation so far in history. Gal Gador as the evil queen is a terrible actress"
  },
  {
    "rating": "0.5/5",
    "review": "what's the point? The old movie actually feels better."
  },
  {
    "rating": "2/5",
    "review": "This movie HAD potential: Rachel Zegler is a superb performer and actress and I love hearing her voice. I think most of the other actors (except Gal Gadot) also did the best with what they were provided from a really thin script. Most of this movie is really undercooked. The romance was rushed, Snow White’s motivation was unclear (she wants to be a leader, but she already IS a leader through most of the movie? She guides the other characters and has little struggle taking on that role) The Evil Queen is mad because she’s not considered the prettiest when….that doesn’t matter to literally anybody in this movie? Some motivations are very blurry. The CGI Dwarves? Gross. Just appalling. Some scenes are so rushed, like with the Hunstman? That was so anticlimactic and did not have near as much intensity as the original. In the original, Snow White is fearing for her life and crying, and still forgives the Huntsman. But here, she’s not? Hello! He’s threatening to stab you with a knife! Again, Snow White wants to be brave and such like her parents told her and she already IS. There’s no Journey or arc for her to discover this part of herself. So the emotional moments and beats all fall flat."
  },
  {
    "rating": "5/5",
    "review": "I truly enjoyed Snow White so much. It’s definitely not as bad as people say."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is truly unwatchable."
  },
  {
    "rating": "0.5/5",
    "review": "Por dios siempre Disney arruinando todo pero no culpo a nadie más que el director que escogió a esa actriz no culpo a nadie más que a Disney por contratar gente mediocre que a simple vista se ve que hace su trabajo bien y ni si quiera respetar el material original"
  },
  {
    "rating": "5/5",
    "review": "I just saw it. I thought it was good. I didn't see the trailers showing it was gonna be a musical, but, I liked it. I'm a kid at heart, so I LOVED how they brought the animals more to life. I'll buy the DVD, when it comes out."
  },
  {
    "rating": "5/5",
    "review": "The scenery in he movie was absolutely beautiful, especially the woodland, the woodland animals, and the snowing white rose petals at the end. The dwarfs were neat. It looked like they were played by midgets, but the way special effects are prominent in every movie today, I wouldn't doubt if they were FX tricks. Anyway, every characteristic of each one was shown. Was this a Christian movie? No, but there was no blood, swearing, or violence of any kind. The queen, 'with powers' was totally evil, and Snow White was totally good. For parents with children, this is definitely a good movie to take your children to."
  },
  {
    "rating": "1/5",
    "review": "Rachel was amazing, Gal Gadot ruined this movie. Absolutely terrible!!"
  },
  {
    "rating": "5/5",
    "review": "Liked the few changes in original story. The dwarfs were perfect"
  },
  {
    "rating": "1/5",
    "review": "The worst movie ever, the worst actor of all time."
  },
  {
    "rating": "0.5/5",
    "review": "Waste of time and money. Disney have lost the plot."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie overall. The evil queen should’ve won."
  },
  {
    "rating": "3/5",
    "review": "I loved the movie, I didn't like all the singing though."
  },
  {
    "rating": "0.5/5",
    "review": "Just so darn bad. Couldn't get throigh it even my young family hated it"
  },
  {
    "rating": "4/5",
    "review": "I don't understand why this movie is getting so much hate from critics - I liked it a lot more than I thought I would based on reviews. Firstly, the new music is phenomenal - Pasek and Paul are the Rodgers and Hammerstein of my generation. The performances are all great, and I even had to Google whether Gal Gadot's singing was dubbed because it was surprisingly good (spoiler: it's not). The sets and costumes are beautiful. The choreography is mostly meh. The only negative criticism I share is that the use of CGI dwarves is indefensible. There are actual humans who could have played those roles. This is a live-action Disney musical, folks - go in with appropriate expectations and you will love it!"
  },
  {
    "rating": "1.5/5",
    "review": "simply, no. come up with a new idea and stop rewriting history. studios haven't come up with a new idea in years and they continue to butcher the stories generations grew up on. another lame, soulless attempt by Disney. can't blame the actors, just the lazy studio. boo!"
  },
  {
    "rating": "5/5",
    "review": "My children absolutely loved the film! It was very entertaining and enjoyable to watch. You must watch this outstanding movie!"
  },
  {
    "rating": "0.5/5",
    "review": "Absolute dumpster fire"
  },
  {
    "rating": "5/5",
    "review": "Loved the movie and enjoyed seeing some of the same aspects from the cartoon. i would have enjoyed the ending somewhat better though had it not be a solo ending with Snow White. i love the fairy tale endings with the happily ever after with the prince and princess."
  },
  {
    "rating": "0.5/5",
    "review": "Slay, Don't look like the original film"
  },
  {
    "rating": "5/5",
    "review": "Loved it! No idea why it was so hated."
  },
  {
    "rating": "3/5",
    "review": "It’s nice for kids 100%. But is it really bringing it to life? Disney definitely felt like they were walking on egg shells while writing this when really it was really just a carpet. Rachel did amazing but it’s so weird how they got a dwarf for inclusivity but couldn’t get people to do the actual dwarfs? It really would’ve made the movie better"
  },
  {
    "rating": "3/5",
    "review": "Rachel was really good in it , Gal was okay.. the dwarfs were a bit odd and costuming is a bit downgrade from Sandy Powell.."
  },
  {
    "rating": "5/5",
    "review": "I think the movie was great! Beautiful visuals, nice songs, modern twist. I think the negativity is very unfair. I loved the story line and my daughter is obsessed with Rachel as Snow White."
  },
  {
    "rating": "1/5",
    "review": "This wasn’t a bold reimagining — it was a hollow dismantling. They miscast the lead, rewrote the story with all the grace of a wrecking ball, and stripped away every ounce of emotional depth the original held. In place of magic and meaning, we got preachy monologues, lifeless characters, and a desperate attempt to look \"modern\" by tearing down what made the tale resonate in the first place. Snow White used to be about growth, redemption, and wonder. Now it's just about checking boxes and pushing slogans. Audiences didn’t turn away because of the lack of special effects. They rejected it because the film has no heart."
  },
  {
    "rating": "5/5",
    "review": "What a pure story for the sake of the story itself! Disney makes us believe yet again in childlike wonders! The songs? Phenomenal!! I’ve already downloaded them as my alarms in my phone. Fearless, Fair, Brave, and True. Gotta keep spreading kindness and fairness in the world."
  },
  {
    "rating": "4/5",
    "review": "I understand why it’s so controversial in terms of who is playing Snow White, but everything else was there. The story telling and I think the only dislike for myself was the repetitiveness of every scene being a song."
  },
  {
    "rating": "5/5",
    "review": "I really loved this movie. Yes, it is “woke” but with very beautiful lessons. I cried, I laughed, I enjoyed every moment of it"
  },
  {
    "rating": "5/5",
    "review": "I thought that the movie was fantastic! The songs were well done, it was true to the original story for the most important parts, and the mine scene was a gem (literally and figuratively). My big takeaway? People should judge the movie after watching it, not after solely hearing about it."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible acting. For Disney to put out something like this, they had to be desperate or something because that was rough acting. Fake Dwarfs when they could have used little people was another huge miss."
  },
  {
    "rating": "0.5/5",
    "review": "Disney just has to make everything woke and ruin classics. So incredibly lazy."
  },
  {
    "rating": "5/5",
    "review": "This movie was better than I expected and I recommend for everyone. It truly is a magical experience!"
  },
  {
    "rating": "5/5",
    "review": "This movie was unexpected and very beautiful. There was no prince charming which was actually better and the plot wasn't as predictable as I expected. I was surprised there were so many songs too. I thought the actors were very good and I enjoyed it more than I thought I would. Gal Gidot was great as the evil queen which surprised me. The special effects were dazzling."
  },
  {
    "rating": "1/5",
    "review": "Poorly cast and terrible remake. Wish Disney would stop trying to please everyone while pleasing no one. Wish they would come up with something original and quit destroying the classics. Snow White was loved by so many because it was actually good. This is not it."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was extremely bad!!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Love Rachel!"
  },
  {
    "rating": "1/5",
    "review": "Need I say anything? This is absolute dogwater in movie form. Bland, boring, forgettable."
  },
  {
    "rating": "5/5",
    "review": "It’s an amazing movie. When I watched it I was on the edge of my seat in excitement. 10/10 I recommend"
  },
  {
    "rating": "5/5",
    "review": "I liked the movie, and my friend liked it too. It was very appealing, colorful, it showed the magic of fairy tales, and there was a lot of CGI. I found Snow White beautiful, even though the public commented that the stepmother was prettier, but Snow White was younger, simpler, lighter and a nicer person, different from the stepmother. In the movie room there was a lot of people in my session, as children and adults."
  },
  {
    "rating": "4/5",
    "review": "Snow White from 2025 was a very criticized film, but in my opinion it wasn't bad at all. In fact, it was really cute! Sure, it had some differences compared to the original animated film, but in addition to being a more child-friendly version than the 1937 version that terrified them, it was a clear homage to the entire history of Disney production, since she was the first princess. In fact, there were references to every animated film and Disney movie, from Rapunzel to Sleeping Beauty, to Enchanted and Robin Hood. This movie was a version that clearly brought together all the Disney masterpieces, using Snow White as a tribute to all of them, since it was the first Disney film ever made. It was so obvious that all the criticisms about it being different left me speechless, it's obvious that it was, it was a tribute mixing all the characters and masterpieces, it could never have been the same! But they kept the same atmosphere of the forest, the dwarfs' house and the goodness of Snow White. The message was really sweet and true, I didn't find the costumes ugly at all as many said, in fact that red cape was beautiful! The songs were really nice and catchy, including some kept the same as the original... in short, for me it's an absolutely cute film and suitable for the whole family!"
  },
  {
    "rating": "2/5",
    "review": "No real story to movie too much singing"
  },
  {
    "rating": "0.5/5",
    "review": "don't watch this boring and miscast waste of time"
  },
  {
    "rating": "0.5/5",
    "review": "Deviates too much from the original... must keep the classical inspiration... or just rebrand all together..."
  },
  {
    "rating": "0.5/5",
    "review": "not even worth pirating"
  },
  {
    "rating": "0.5/5",
    "review": "Awful, story is completely changed and Rachel is a moron. Awful person, awful politics, and she’s not even a good actress. Hope this is the last movie she’s ever in. Disney sucks now unfortunately."
  },
  {
    "rating": "0.5/5",
    "review": "Not sure what Disney was smoking when they made this."
  },
  {
    "rating": "5/5",
    "review": "Whatttt?! I am so baffled by the bad reviews. It has to be political sabotage. We were a group of 5 adults, 8 kids ranging from 4-13 (my husband and the older girls are very critical). Everyone loved the movie! I’m so confused. If you still have a chance— go watch it!"
  },
  {
    "rating": "0.5/5",
    "review": "Don’t understand why this would be made, subjecting us to this, if not an improvement on the Original? Kids were mostly bored thanks to watching original the prior weekend. Why do this? It’s like what Disney did to the last Star Wars trilogy that was reviled by us, everyone we know, and wishes it could be completely erased. Disney has gone down a path of failure."
  },
  {
    "rating": "1/5",
    "review": "when i first heard about this i thought it's gonna be good, nope. i don't even understand what are they trying to say by changing the story. not for me."
  },
  {
    "rating": "5/5",
    "review": "I thought the movie was great Rachel zelger did amazing I loved how they made it more modern especially as how the original movie was a bit concerning and how the age gap was huge I think that it gave a better lesson towards kids and little girls who take inspriration from Snow White great movie awesome music overall"
  },
  {
    "rating": "0.5/5",
    "review": "It’s a total waste of time and energy and money to see this movie. Didn’t deserve not even 5 mins of my life! Rachel was terrible, horrible, such a disgrace !"
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed it so much! The complexity of characters, the development, it's all there. I found being entertained from the beginning to the end, and it was a fun rollercoaster of tears, laughs, some cringe and some 'wow' moments for me, so the movie felt very alive and fun to watch."
  },
  {
    "rating": "4/5",
    "review": "The dwarfs were adorable, the graphics were amazing, I didn't know it was a musical"
  },
  {
    "rating": "0.5/5",
    "review": "The film is a real bomb, it ruined the original story and the protagonist has nothing to do with it and also Maleficent is more beautiful than Snow White which makes no sense at all, a disaster."
  },
  {
    "rating": "0.5/5",
    "review": "My wife grew up loving Disney films, yet after about 25 mins of the movie she turned to me and said \"this is horrible\". We left and were quite disappointed in almost all the aspects of the movie. A complete waste of time, money and my only suggestion to anyone reading this; Don't watch Snow White! Save your time and money!"
  },
  {
    "rating": "5/5",
    "review": "Rachel Zeglar is absolutely amazing, her voice blows me away. She IS a disney princess. She is unfortunately the only good part about this film. But it's fair to give her 5 stars. Gal Gabot is so dissapointing as the evil queen, she gave nothing, her costume was awful. She doesn't seem like an evil queen atall. It ruins the entire film as she is so unbelievable. She really cannot act. The storyline seems like 3 or 4 different scripts chopped up and put back together, most likely because of the backlash disney had recieved already during production. Snow white is actually saved by a love interest, which she wasn't originally meant to. That part seems rushed and sloppily added in. The ending made absolutely no sense. Snow white going head to head with a magical queen with no plan or weapons. Cut to suddenly everyone dancing in white? Disney absolutely screwed up the script and costume design but Rachel carried the film."
  },
  {
    "rating": "1/5",
    "review": "Absolutely shocking. Another film destroyed by this woke generation. Really bad kids like the original better"
  },
  {
    "rating": "5/5",
    "review": "My family really enjoyed it."
  },
  {
    "rating": "0.5/5",
    "review": "I only loved the dwarfs part seeing them in the cave and interact the rest was straight garbage. I stripped away the political stuff aside and tried to give it a honest watching the story line was too switched from the original childhood story I saw in the original movie as a kid. Disappointed, the actress playing snow-white is personality was to incorporated into the film"
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie of all time"
  },
  {
    "rating": "5/5",
    "review": "Inspiring! The diamond mine scene is spectacular; outstanding graphics-the perfect fantasy. I also loved how the dark woods reflected Walts’ original vision-incredibly captivating. Both Snow White and the Queen nailed their character persona and the singing was perfect. Finally a crew that knew how to segue a script into a song naturally and not for the sake of inserting a song-thank you! I cannot wait to see this again."
  },
  {
    "rating": "1.5/5",
    "review": "Movie was trash, even my daughter wanted to leave early."
  },
  {
    "rating": "5/5",
    "review": "Despite what everyone says, it really reaches its purpose to entertain"
  },
  {
    "rating": "2/5",
    "review": "The enjoyable story stuck true to the original. The music on the other hand left much to be desired"
  },
  {
    "rating": "0.5/5",
    "review": "I'd give it 0 stars if I could, not worth your money, or your time."
  },
  {
    "rating": "0.5/5",
    "review": "Awful and wouldn't recommend for kids. Very poor story."
  },
  {
    "rating": "1/5",
    "review": "The original Snow White cartoon is a classic... As is Beauty and the Beast, and The Little Mermaid, etc... Disney's reimaging as \"live action\" is an interesting concept mainly because we go to the theater to see how our beloved cartoons are transferred onto a different medium. This is an entirely differrent movie. More a parody of the original than an homage. I truly wanted to like it. Mostly because I heard the hate and hoped (Like with Wicked) a quality movie would dissolve it. Sadly, as much as it pains me to say... For ENTIRELY MISGUIDED and petty reasons.... The haters were right. Don't waste your time."
  },
  {
    "rating": "0.5/5",
    "review": "If you take current politics and shove it into a classic Grimms' fairly tale, you get this mess. It's like a high school play where anyone plays any character. The outfits look like cosplay. The acting is stiff. The CGI is so CGI. The characters' motives are weak and uninspiring. Rachel plays this sweet and innocent character in the movie but in real life she's bitter and full of hate."
  },
  {
    "rating": "0.5/5",
    "review": "An utterly disjointed movie, with Gadot showing once again that she cannot act. Zegler was surprisingly not bad, but could in no way rescue this awful movie."
  },
  {
    "rating": "0.5/5",
    "review": "Flop of the year. I never thought Disney would do such a horrible thing to classic movie. Poor casting, horrible acting."
  },
  {
    "rating": "4.5/5",
    "review": "Such a fun take on an old and boring film"
  },
  {
    "rating": "1/5",
    "review": "C'mon, dude. Really?"
  },
  {
    "rating": "1/5",
    "review": "Wrong actress to play the role and the removal of key parts to the original makes the movie less of what its suppose to be."
  },
  {
    "rating": "1/5",
    "review": "Easily the worst movie of the year so far."
  },
  {
    "rating": "0.5/5",
    "review": "Garbage worst movie ever Disney made, especially with the main character and everything sucked about it, save your money don’t watch it"
  },
  {
    "rating": "5/5",
    "review": "Went to see this with my 5 year old and it was a lovely updated version of the classic story. Snow White played the part well and absolutely lovely singing voice. Would highly recommend."
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed this and loved the music. There were some scenes that gave respect to the original and honestly it was pretty awesome."
  },
  {
    "rating": "0.5/5",
    "review": "Waste of £40, at least the popcorn was hot and fresh. The other best thing about the Snow White was my soda was very cold and the ice didn't smell."
  },
  {
    "rating": "5/5",
    "review": "I really loved the movie, the modern twist was spectacular. All the actors played their roles perfectly, their acting skills were outstanding!"
  },
  {
    "rating": "5/5",
    "review": "I read a lot of negative reviews about this movie. But I loved Rachel in Westside Story so I took my kids to see it. Even though I am not a fan of the live action Disney remakes. I was surprised at how wonderful the music was and the story. My kids were captivated by the cute forest animals and charming characters. The song “waiting on a wish” is an instant classic. This is the only disney live action remake that I have throughly enjoyed. Kids give it 5 stars!"
  },
  {
    "rating": "5/5",
    "review": "I love this show so much ten out of ten"
  },
  {
    "rating": "1/5",
    "review": "just like not even entertaining and the acting is so horrible the movie is just awkward"
  },
  {
    "rating": "5/5",
    "review": "So amazing must see.Such a talented cast magnificent animation animals were so cute .🐰🐭🐣"
  },
  {
    "rating": "0.5/5",
    "review": "How do you ruin the plot to this?!?! Do better Disney and quit destroying classics."
  },
  {
    "rating": "4/5",
    "review": "Rachel Zegler knocks it out of the park as always. I will say, I was very excited for this because of Rachel, and while she kills it, the movie as a whole does feel like it doesn't quite reach its potential. I actually thought Gal Gadot did a great job, and the CGI for the dwarves looked incredible, way better than I expected, so those aren't my complaints. I think it feels like maybe the pacing is off, and the hair and wardrobe are distracting. I think a rewatch may help though."
  },
  {
    "rating": "0.5/5",
    "review": "Mirror, mirror on the wall, whats the best movie of them all? There once was a movie named Snow White. It was classic, unforgettable, a real delight. But to that movie this one cant compare. Even if it was the last movie on earth dont go there."
  },
  {
    "rating": "3/5",
    "review": "While this film is structurally sound, it's lacking in the nuts and bolts of what truly makes a good film. I like the message they were going for, I even feel like it's one Walt would have personally endorsed; they just botched it completely at the end by showing that--surprise surprise--kindness did NOT, in fact, win in the end. Want to know what did win? The evil queen getting shot at by a crossbow. Less significant gripes include: -I personally don't like the designs of the Dwarves, but that's up to personal taste -While the songs are fairly high quality, they slow the pace of the film to a crawl -Snow White herself is a very unlikable character -Some of the acting is REALLY bad. Seriously, what the hell was up with Huntsman? Praise! -Most of the songs are really good! I especially like \"Fairest of Them All\" -I appreciate the innovation on the story even if it was fumbled a bit -Dopey's arc is a lot more compelling than I thought it would be Pound for pound, I'd recommend seeing this if you have nothing better to see. Don't go out of your way for it, but it's worth a watch."
  },
  {
    "rating": "0.5/5",
    "review": "Another garbage Disney film that is more interested in politics and agendas that making a movie for people to enjoy. Why did they change the original storyline??"
  },
  {
    "rating": "5/5",
    "review": "We loved it! 3 generations watched it together. It was flawless! Very well done in every way. Excellent!"
  },
  {
    "rating": "5/5",
    "review": "This was what got me into DISNEY!!! Along time ago, and it's why I still wish amongst a star..."
  },
  {
    "rating": "5/5",
    "review": "Love Snow White its great"
  },
  {
    "rating": "1/5",
    "review": "Disliked this movie. Didnt know if I was watching a film or a musical. The actresses are bad. Dont like the new plot twist. Do not recommend at all"
  },
  {
    "rating": "5/5",
    "review": "Snow White was wonderful! I loved the entire movie from start to finish❤️"
  },
  {
    "rating": "0.5/5",
    "review": "I watch this movie and it's nothing like the original and the plot makes no sense. Rachel Zegler acting is really good and here singing is amazing and is the only thing that is good about the film. Gal Gadot acting and singing was just horrible, and Andrew Burnap was worse than Gal Godot the dwarfs were terrifying I think I'm going to have nightmares for weeks but dopey was actually really scary like why did he look like that. It's really sad that they didn't give opportunity to people with dwarfism to be in a big film like this. The film over all was a mess and by the way they refilm this movie a second time and it still wasn't good. The costumes and makeup for snow white was pretty bad I just feel like if they gave her the right dress, hair and makeup it would have looked much better this film was like 99% CGI and I feel like the script was literally ai generated. When I watch this movie, it felt like it was 5 hours long, but it was only any hour and 39 minutes I literally wanted to die so I HIGHLY RECOMMED TO NOT WATCH THIS."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing music and set design. Absolutely phenomenal costumes. Really fantastic recreation and update of the original"
  },
  {
    "rating": "5/5",
    "review": "just saw the Snowhite movie the other day and it really reasonated with me! It was just so beautifully done and felt like magic! The original has a special place in my heart but I loved this one! Disney is really improving I feel with all their latest projects. The hate does feel forced and It deserves a chance. Change doesn\"t have to be bad."
  },
  {
    "rating": "3/5",
    "review": "Esse com certeza é o live-action mais polêmico da Disney, mas, apesar disso, o filme não cumpre nem as polêmicas que prometia. \"Branca de Neve\" apresenta grandes problemas, principalmente no roteiro, que é fraco, repleto de atalhos forçados para a história avançar, diálogos ruins e cenas mal escritas. O elenco também não convence em alguns papéis, com destaque negativo para Gal Gadot, que está longe de funcionar como Rainha Má. Apesar disso, o romance entre os protagonistas, a qualidade das músicas, o carisma dos coadjuvantes e o CGI ajudam a evitar que o filme seja um desastre completo. No fim, temos uma obra que não é o fracasso anunciado, mas também está longe de ser memorável — apenas uma experiência minimamente organizada. Nota: 6"
  },
  {
    "rating": "0.5/5",
    "review": "It feels like the whole movie was a publicity stunt and ended up horrible"
  },
  {
    "rating": "5/5",
    "review": "This movie was absolutely fantastic, one of the best Disney movies I have seen in a long time from start to finish. It was alot more than I expected with all the bad reviews. You have done disney proud. Well done to the whole production team and cast👍👍👍"
  },
  {
    "rating": "5/5",
    "review": "im a 21 years old woman who never watched the original movie but ive read the story. This movie was better than the one i made up in my head. Rachel's big smile is contagious and the dwarfs are just so adorable. I wouldve loved if this was a serie because it kinda felt rushed but honestly that makes it perfect for kids!"
  },
  {
    "rating": "0.5/5",
    "review": "Trash don't waste your time main reason for this movie disaster is the actress who plays snow white I can't even remember what's her name hopefully she will never cast a diney live movie ever again!"
  },
  {
    "rating": "0.5/5",
    "review": "Simply, From all the other talents out there why put an actor who's a sisekick at best & with terrible English accent as the Evil Witch ? Terrible performance, the whole movie looks like a bad dream"
  },
  {
    "rating": "0.5/5",
    "review": "It's got no soul. It's not demonic. It's not some fallen being. Marked against the animated original, it truly is the foundation dirt of hell against the highest pennants of the tallest spire in heaven."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies I have seen, its a complete waste of time. Also isn't snow white supposed to be the fairness in the land? Because definitely not in this movie"
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie disney ever invested in. They clearly have ignored what the public wants and are only creating whatever they feel like doing. NO one wants this garbage and the numbers are solid data that shows how we feel about it. Stop. We. Mean. It. I cancelled my disney account because of this."
  },
  {
    "rating": "5/5",
    "review": "amazing, my two princess enjoyed the movie. Thanks Disney."
  },
  {
    "rating": "1/5",
    "review": "Disliked the whole movie"
  },
  {
    "rating": "4/5",
    "review": "Yes kind of scary for kids, but overall my daughter liked it and enjoyed it. We love the soundtrack!"
  },
  {
    "rating": "1.5/5",
    "review": "The music isn’t memorable, Snow Whites character isn’t warm or endearing, the acting on many of the leads is painful, the CGI dwarves are so ugly to watch.. in fact a lot of the movie just left me feeling “this is ugly”. The set design is beautiful, I liked the take on the costumes. It had potential.. shame about the writing and cast."
  },
  {
    "rating": "5/5",
    "review": "Was really good, enjoyed it with my 6yr daughter."
  },
  {
    "rating": "1/5",
    "review": "The movie sucks. They changed the entire element of the original 1937 story."
  },
  {
    "rating": "5/5",
    "review": "Was it my favorite Disney remake, no. But it doesn’t deserve all the hate it’s gotten. I loved that they brought new music into the movie and invigorated the storyline from the classic. I would encourage anyone to watch it and form their own opinion."
  },
  {
    "rating": "1.5/5",
    "review": "The first movie my daughter has ever asked to leave. The only saving grace was Rachel Zeigler. She was wonderful but the movie was incredibly boring."
  },
  {
    "rating": "1/5",
    "review": "My baby has been fussy all week thanks to teething and hasn't slept but this movie put her right to sleep that's why it gets a star! Thank you Disney My son said every second was painful to watch he said Snow White looks like a temu version They changed the original completely it honestly didn't make sense. And there's no Prince it's not a love story Go watch Minecraft instead."
  },
  {
    "rating": "0.5/5",
    "review": "Sin duda alguna la peor pelicula de disney hasta ahora, no hace falta decir el porque. (Disney y sus \"INCLUCIONES\") Ademas de que la protagonista es una hija de..."
  },
  {
    "rating": "4.5/5",
    "review": "Awesome. From start to finish this movie was perfectly executed."
  },
  {
    "rating": "4/5",
    "review": "I thought it was fine . Idk what the problem is with everyone."
  },
  {
    "rating": "5/5",
    "review": "Great message and luv the casting choice . The dwarfs were cool but lowkey scary @ first"
  },
  {
    "rating": "5/5",
    "review": "The only thing was the movie was too low and was hard to hear in some parts but besides that my daughter and I loved it!."
  },
  {
    "rating": "5/5",
    "review": "I went with my kids on opening day and we liked the movie and keep listening and singing along the music playlist. Nothing inappropriate. Wish somethings were more alike the original but it was a good take."
  },
  {
    "rating": "4/5",
    "review": "I don’t get why people have to be so critical. I thought the movie was really good. And my kids thought it was GREAT. There are two reasons it doesn’t get 5 stars from me. 1) the 7 dwarves were CGI and I do not understand why. I get live action doesn’t have to be 100% but they are people….let people portray them. 2. I didn’t see a need to carve the prince out of the story. I just didn’t think that was necessary in order for Snow White to be a strong female leader. In fact, it almost made it less powerful. Do they think she couldn’t have been the strong carácter leader if her guy had been “royalty”? But the music was great as were Rachel Ziegler, Gal Gadot and Andrew Burnap. An entertaining and uplifting joyous movie!"
  },
  {
    "rating": "5/5",
    "review": "The forest animals and the dwarfs were the cutest ever"
  },
  {
    "rating": "1/5",
    "review": "Poorly made. Movie seemed very rushed and off. The original from the 30’s surpassed it by far when it should’ve been the other way around. Go back to the drawing board Disney and instead of messing up classics here’s a thought…Come up with something new!"
  },
  {
    "rating": "4/5",
    "review": "Pleasantly surprised! Really enjoyed it."
  },
  {
    "rating": "5/5",
    "review": "Fun live action recreation of Snow White"
  },
  {
    "rating": "5/5",
    "review": "It was a super musical of an old fairy tale. The actors were great. The scenery was beautiful. The songs and music were fantastic!"
  },
  {
    "rating": "3/5",
    "review": "It seemed rushed. We know the story but just wanted a little more. I LOVED the 7 dwarfs though!"
  },
  {
    "rating": "5/5",
    "review": "“Snow White” is reimagined with a fresh perspective, yet it beautifully preserves the timeless charm of Disney’s 1937 classic. I loved seeing a version of Snow White who had been raised by parents that instilled in her not only thoughtfulness and compassion for their kingdom but also the quiet strength that comes from leading with kindness. She embodies those values throughout the film, passing them on to everyone she meets. Beyond its heartfelt message, the film dazzles with breathtaking visual aesthetics. The music and songs are absolutely captivating, the cast delivers outstanding performances, and the animation is pure perfection. Every set and costume is crafted with such care and attention to detail—it’s truly a feast for the eyes. Did I mention I adore this film?"
  },
  {
    "rating": "5/5",
    "review": "My 7 year old daughter loved every moment of the movie."
  },
  {
    "rating": "4.5/5",
    "review": "Disney and Broadway-esque, its really meant for people who loved Disney love music thats got a Broadway flare and animation particularly related to animals. The story is fairly close to the original and the action moves along only go if you actually like musicals because criticizing something because its a musical means you shouldnt have gone."
  },
  {
    "rating": "0.5/5",
    "review": "Unfortunately I can't give less than one star"
  },
  {
    "rating": "5/5",
    "review": "It was good. We enjoyed it."
  },
  {
    "rating": "1.5/5",
    "review": "Ehh, that’s not my version of Snow White. Just ok. Would I see it again! No!"
  },
  {
    "rating": "4.5/5",
    "review": "Loved the dwarfs. A little off from the original story line but still good. Kids liked it."
  },
  {
    "rating": "1/5",
    "review": "This was ass. Everyone walked out the movie theater when it started 😭"
  },
  {
    "rating": "4/5",
    "review": "Music was great except queen song. Good job with story and music. Didnt care for faces of dwarves. If they were going to make so realistic looking than just use real people."
  },
  {
    "rating": "0.5/5",
    "review": "Honestly, can’t recommend this at all one of the worst watches I have ever had in my life. None of the songs are memorable, and the original story was ruined. Avoid at all cost."
  },
  {
    "rating": "1/5",
    "review": "CGI dwarfs? What a missed opportunity to empower real people that could have played this iconic role! No prince? An example of going too far from the original story."
  },
  {
    "rating": "1/5",
    "review": "The best part of the movie for me was the end credits."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies ever and as a German who knows the original. This movie completely lost its plot!"
  },
  {
    "rating": "5/5",
    "review": "great movie love snow white music is great!"
  },
  {
    "rating": "1/5",
    "review": "A very disappointing remake and a betrayal of what was once a great Disney tradition. Stick to the original"
  },
  {
    "rating": "1/5",
    "review": "It was kind of boring"
  },
  {
    "rating": "0.5/5",
    "review": "Disney gave up......."
  },
  {
    "rating": "0.5/5",
    "review": "Disney’s “Snow White” – A Woke Trainwreck That Misses the Magic Disney’s latest attempt to “reimagine” Snow White is less of a fairy tale and more of a cautionary tale on how far Hollywood has fallen into the abyss of political correctness, identity politics, and woke ideology. What was once a timeless story about kindness, courage, and innocence has now been mutated into a hollow, preachy mess with little resemblance to the 1937 classic — or the Brothers Grimm tale that inspired it. A Story No Longer About Snow White The original Snow White and the Seven Dwarfs was a whimsical tale centered around purity, jealousy, and triumph over evil. It celebrated femininity and traditional values without apology. In contrast, this new version ditches nearly everything that made the story resonate for nearly a century. Snow White, once a gentle-hearted character who found joy in small things and valued friendship and goodness, has now been rewritten into a hardened, independent rebel who “doesn’t need a prince” — a painfully overused trope in modern remakes. Instead of letting the original character stand on her own merits, Disney decided to inject a forced feminist agenda that feels more like activism than storytelling. Wokeness Over Wonder From the casting choices to the rewritten dialogue, the entire movie seems like a checklist for woke credentials: Race-swapped protagonist: The lead role is played by an actress who openly criticized the original story in interviews before the movie even released. Rachel Zegler’s disdain for the source material is painfully obvious, and it’s hard to feel invested in a character when the actor seems embarrassed by the role. No dwarfs? Disney replaced the iconic seven dwarfs with a group of “magical beings” of different genders, races, and sizes — completely erasing the characters that gave the original charm and humor. Ironically, this was done in the name of \"inclusion\" — yet it wipes out roles for dwarf actors, the very people it claims to protect. Villainy gets softened: The Evil Queen, once a memorable and terrifying villain, is now more of a misunderstood character than a true threat. Once again, Disney seems afraid of portraying actual evil, opting instead for morally grey characters that push the idea that everyone’s just “misunderstood.” Bad for the Actors, Worse for the Legacy This film isn’t just a disservice to fans of classic Disney — it’s a ticking time bomb for the actors involved. Rachel Zegler’s social media missteps and public comments criticizing the original film, princess tropes, and “cringey romance” have already made her a controversial figure. For a young actress, alienating Disney fans is not a smart career move. Hollywood is learning — slowly — that pushing a forced agenda doesn’t guarantee success. Recent failures like The Marvels, Strange World, and Lightyear all tanked at the box office after audiences grew tired of being lectured. The same fate seems destined for Snow White, especially considering the backlash even before its release. Actors caught in the middle of these remakes are often blamed when it all falls apart, even when it’s the studio’s agenda driving the failure. Rather than lifting these actors up, these woke reboots are career anchors — and Snow White is no exception. Hollywood’s Wokeness is Burning Out There’s a growing shift. Audiences are rejecting reboots that prioritize virtue signaling over storytelling. Independent films, faith-based content, and unapologetically traditional stories are thriving, while major studios continue to lose both viewers and respect. People don’t go to the movies to be scolded or to endure rewritten nostalgia with a side of politics. They want magic. They want heart. And Disney, once the master of wonder, seems to have lost the plot entirely. Conclusion: A Rotten Apple The new Snow White is a disastrous remake that strips away the soul of the original and replaces it with empty messaging and awkward reinvention. It’s not just inaccurate — it’s disrespectful to the source material, to the fans, and ultimately to the actors who are now stuck defending a sinking ship. If you want to see Snow White, go back to the 1937 version — the one that had heart, music, and meaning. This new version? It’s the mirror image of what made Disney great — a reflection distorted by ideology, not imagination."
  },
  {
    "rating": "0.5/5",
    "review": "It wasn’t broke so why did they ruin a classic? CGI sucked and the storyline was ridiculous!"
  },
  {
    "rating": "1/5",
    "review": "Was embarrassed that I took kids to watch this. The wanted to leave and go to Captain America less than halfway through."
  },
  {
    "rating": "4/5",
    "review": "All the other reviews aren't true. When I watched this movie, I thought it was pretty good and there was nothing wrong with it. All of these jokes about this movie are nonsense. Though, it could have had more action, but it was NOT boring."
  },
  {
    "rating": "4/5",
    "review": "I didn't hate it. I didn't love it. My daughter loved it. 🤷🏾‍♂️ that's all that matters to me"
  },
  {
    "rating": "1/5",
    "review": "Very boring with no action. All the characters did was walk around a forest. Plus, the only dramatic scene was when snow white died but the first thing the prince did when he came was kiss her so it only lasted for like 40 seconds."
  },
  {
    "rating": "0.5/5",
    "review": "Una película que nunca debió dar luz verde en primer lugar... Disney nunca aprende de sus errores cinematográficos, que fue tan mala esta película, que pausaron indefinidamente la producción de Enredados de Live-action por miedo (cometiendo los mismos errores)... Mi análisis sobre esta película no tiene freno de lo tan aburrida que es, además de tanto escándalo que hubo detrás de la película y nisiquiera debo decir algo positivo de esta película porque no lo tiene, el pésimo CGI de los enanos (que fue lo más rescatable de la película), la película cambia completamente el mensaje de la película animada y una verdadera falta de respeto a la primera película animada de Disney en la historia. 0% de originalidad y pésimas actuaciones que entierran más este proyecto, además de todo cines vacios y perdidas millonarias en todos los aspectos."
  },
  {
    "rating": "5/5",
    "review": "Loved this movie!!!! Seen three times so far."
  },
  {
    "rating": "1/5",
    "review": "Boring! Seriously couldn’t even watch 30 min of it."
  },
  {
    "rating": "2/5",
    "review": "Its not as bad as the internet would have you belive. It's not exactly good either - just okay. And that's okay. The CGI dwarves are weird and a bit uncanny. Gal Gadot's singing and acting are... unfortunate. And the story is more than a little contrived. But if you are just looking for something to watch with kids, it'll do. Some fun musical numbers (Zegler does have a great voice), cute animals, a few short action sequences... it's very by-the-books modern Disney, for better or worse. Would rather just watch Mirror Mirror though."
  },
  {
    "rating": "5/5",
    "review": "This was a 5 out of 5 movie for me. It was just a lot of fun. The entire family enjoyed it."
  },
  {
    "rating": "1/5",
    "review": "The worst disney live action to ever exist . almost like they hated it . disrespected disney in ways i never thought possible ."
  },
  {
    "rating": "0.5/5",
    "review": "I had the best nap in this movie"
  },
  {
    "rating": "4/5",
    "review": "It was a cute good movie! Too much music but other than that, I love it."
  },
  {
    "rating": "3/5",
    "review": "Surprisingly good, particularly given all the grief this movie has received. The songs are hit and miss, but this does a nice job expanding on what is in reality, a pretty limited animated movie. Certainly not world-changing, but worth the time."
  },
  {
    "rating": "1/5",
    "review": "The entire movie is a disgrace to the original movie. To Rachel Zelglers terrible performance to the atrocious CGI dwarves, it was a complete flop"
  },
  {
    "rating": "5/5",
    "review": "I like the movie a lot for being a musical."
  },
  {
    "rating": "4/5",
    "review": "Parts were a little scary for young kids"
  },
  {
    "rating": "0.5/5",
    "review": "its horrible, even when i like the og movie, this one changes a lot is a LIVE ACTION, NOT A REMAKE, so DO NOT CHANGE THE PLOT, and its not for kids or even adults, because its very horrible, is so horrible that i think i prefeer being in the 1920 big depression than seeing this movie again"
  },
  {
    "rating": "3/5",
    "review": "It was boring and miscast"
  },
  {
    "rating": "1/5",
    "review": "Did not enjoy it, definitely the magical movie I thought it would be was ruined. Wish I would have never taken my kids here"
  },
  {
    "rating": "5/5",
    "review": "Wonderful, updated & modern storyline. Much improved from the original!"
  },
  {
    "rating": "4/5",
    "review": "Snow White has never been a favorite of mine, but coincidentally has always been a princess that I’ve been compared to. Whether it for my short brunette hair, my love for nature and animals, or perhaps (even) my childlike spirit. I never connected with the story of Snow White because we have different backgrounds. She was known for her fair skin and delicate nature, which were two things I was not. Being mixed as always hard, because you never felt like you fit in anywhere. So when Rachel Zegler was announced to portray this iconic role in Disney’s live action remake, I was ecstatic. Zegler would not only be the first Latina cast as a Disney princess, but she was also mixed like me. Someone I have seen myself in before when she portrayed Maria in Stephen Speilberg’s West Side Story. I don’t need to tell you about the uproar of people against her when she was first cast. I think there are plenty of articles around the internet about that, including one by our own, Sarai Yanes, who covered that story wonderfully. I am here to give you my review, not only as a Disney lover, or as a mixed Puerto rican girl, but also as someone who was never into Snow White to begin with. I was excited to see Zegler portray this role and I wanted to support her work as our first Disney princess of Latin-descent, so I promptly saw the film opening day, Friday March 21st with my weekly AMC A-List ticket in hand. And I’ll give you my thoughts with all of the spoilers: Key points: -Zegler was made to play Snow White (portrayed her well and spot on) -this reimagined version gave Snow, so much more courage and I enjoyed her back story as well as the necklace that she took with her from past to present (everyone is going to want one of those heart shaped necklaces now) -this movie was a MUSICAL and given that musicals aren’t for everyone. This movie was giving CAMP. It was over the top and almost cringey at points, but I feel like this was on purpose— It reminded me of broadway, it reminded me of Brandy’s Cinderella. Over the top, everyone was involved, which I wasn’t expecting. This felt different from other live action remakes. The whole town was singing, you recognized people who were not main characters. -theres been a lot of controversy also about Gal Gadot’s role in the movie, she is of Israeli descent and is Pro-Israel, so that’s been part of the controversy, but also for years people have talked about how she’s not a great actress but is awarded with these big blockbuster roles, where people are consistently disappointed in her performance. Personally, I don’t think she did great in this movie either. In simple terms, you just didn’t believe her. Her acting was too obvious, unbelievable, and you didn’t feel anything from the words she spoke. I would say, comparatively something like Maleficent for example was way more believable as a character. You could feel bad for her, even for Ursula in the little mermaid. She had a back story and you could believe where her revenge arch was coming from. This queen did not have that, along with a performance that frankly wasn’t believable for audiences. -Prince Charming was amazing. I love what they added to his character. He wasn’t actually a prince. She was genuinely someone you could fall for, comparatively to Prince Eric in the recent Little Mermaid live remake. It’s a great change for these “princes” to actually be activists and people who passions behind their courageous and ambitious spirits. His acting was truly believable and he had me falling for him too. -Something eerie about this remake was it felt like it came out at the perfect time, with everything we are going through under the new Administration in the United States. The movie flowed synonymously with the times. It portrayed a dystopian nation who was dealing with a greedy ruler and at least for me, it gave me that hope that as a community we probably do want the best for the greater good. This movie taught you that the ruler wants us to scramble and fight and be distracted with each other rather than help us prosper and that if we can work together, we can take our kingdom back for the betterment of everyone. I think this will be an inspiring film for the next generation. -It’s not a movie that is about being saved, it’s about having courage in the face of adversity and at a time where most people have lost hope. It inspires to continue fighting for what’s right, not matter the cost. In this movie, you saw great examples of people risking their lives for the hope of a better future. -Now let’s talk about the CGI dwarves, apparently the reason because the CGI dwarves version live action actors was to make sure they were not portraying little people in a negative light. I think that’s understandable. In the beginning, when you first meet the dwarves, it gives AI, it gives uncanny valley, but you eventually forget about their looks and are able to follow the characters in the story. It didn’t distract from the entire movie, like I think a lot of people are anticipating. -I think they did a great job at focusing on Grumpy and Dopey like they do in the original animated film. People will fall in love with Dopey all over again. I like that they eventually give him the courage to speak in this film. I think it brings great awareness to those who are non-verbal and it might even inspire some of those people. I think they wait for the perfect moment for him to finally speak from his heart and it is in the climax of the film, where he gives motivation to his peers during a difficult time in the film and pushes them to keep going. It’s a great example again for young children to learn something like that when they’re young. I made me think of kids on a playground watching someone get bullied and finally standing up to that bully. -Random thing: I don’t think the gems were believable. I think especially for the millennials and gen z who are going to see this film, like myself would’ve loved to see them use real crystals and they don’t. You can tell the gems they’re using as fake or plastic and that would’ve added again more believability to the story. Something I think would’ve been portrayed differently in a film like Maleficent where we remember how real and luxurious and beautiful all of that looked. These “uncut gems” if you will, do not aid Gadot’s role as it is. -I also heard people complaining about the costumes. I think the costumes were great, again giving a campy vibe, like Brandy’s Cinderella, super colorful. I really liked the remake of Snow White’s dress. She didn’t wear a bow, but had a cloak almost reminiscent of Red Riding Hood. And then it gets ripped off in her falling scene which reminded me of Alice in Wonderland. -Loved the artchictecure and detail that went into the cottage of the seven dwarves. It was beautiful, eclectic, timeless, and seemed comparable to things you can find in vintage shops. It perfectly portrayed the Germanic woodwork, as I collect some of those items in my own home. -All in all, I think it was a good movies, especially for the right person. Someone into broadway, musicals, campy dramatics. The only thing that brings the rating down for me was Gal Gadot’s performance. -I do not agree with Entertainment Weekly’s quote saying that it was Disneys BEST live action remake, however for Latinas and for Disney lovers I think you will all still enjoy this movie and the new takes on this classic film. I think more people will feel included in this story and it definitely gives a stronger and more inspirational message than the original."
  },
  {
    "rating": "5/5",
    "review": "All this hate for this movie is unbelievable ! The movie is great, beautiful and exciting, Main difference is that it's not a duplicate to the original - I mean there's no price, just a rebel."
  },
  {
    "rating": "0.5/5",
    "review": "I tried it but like salty luke warm water I spat it out. Totally a waste of time. Nothing makes any sense; I'm talking from costumes, to song choice, to production, I don't even know how it got the go ahead sign but this is pure garbage."
  },
  {
    "rating": "4.5/5",
    "review": "The animal character were cute."
  },
  {
    "rating": "0.5/5",
    "review": "worst disney princess ever existed"
  },
  {
    "rating": "1/5",
    "review": "Absolute GARBAGE...!!!!"
  },
  {
    "rating": "3/5",
    "review": "Very much “inspired by” the original but it is in no way a live action remake. It’s an entirely new film and story all together. Still, it wasn’t as bad as everyone is making it out to be."
  },
  {
    "rating": "0.5/5",
    "review": "This is the worst movie Disney has ever made. Avoid this movie at all cost, save the cost of the ticket for something worth spending your money on."
  },
  {
    "rating": "0.5/5",
    "review": "Glad I did not pay to see this abomination! Disney, what were you thinking? If you wanted to make a new movie, then just do it. Don't claim to remake a classic, then turn out a turd like this... It's the worst movie I have seen! I left 3/4 of the way through and that wasn't soon enough."
  },
  {
    "rating": "0.5/5",
    "review": "This was a terrible movie before during and after production it was terrible"
  },
  {
    "rating": "1.5/5",
    "review": "Went to see the movie against all my instincts. The star and half are for the scenic design - everything else left a weird taste on my mouth. I’ll all for female empowerment and diversity, but I think these topics should get new and exciting stories, not half-backed recycled ones."
  },
  {
    "rating": "0.5/5",
    "review": "Boo, I was hoping to enjoy this movie. It was hard to watch. I really wish I would have waited until it came out to stream."
  },
  {
    "rating": "0.5/5",
    "review": "Maybe the worst Disney ever. The whole story is changed and not like the original. Why modify a movie that was so well done in the 30s? I didn't mind the dwarves being animated, but I thought it was live, not animated. Also, this movie has a massive undertone of feminism, which ruins a \"love story\"."
  },
  {
    "rating": "0.5/5",
    "review": "Sad that Disney strayed so far from the original, additionally in an age where the stars have access to communicate directly to audiences it really ruined the magic of the film for me. Between Gal and Rachel, no matter which side you are on there are some problematic aspects that remove the viewer from the magic of escapism that is the reason why audiences see movies. Save your money and skip this one!"
  },
  {
    "rating": "0.5/5",
    "review": "Garbage! Not even hot garbage!"
  },
  {
    "rating": "0.5/5",
    "review": "Do not waste your time nor money. This was a botch job."
  },
  {
    "rating": "1/5",
    "review": "I hateeee this remake. This movie had so much potential and they absolutely flunked! They should have used the german remake featuring Laura Berlin as inspiration!!"
  },
  {
    "rating": "1/5",
    "review": "Another Really Bad Disney Movie. The new Mufasa was stupid and now this one. Disney really needs to rethink on who is making these movies."
  },
  {
    "rating": "4.5/5",
    "review": "I don’t know if I would have gone to see it if it weren’t for the huge discrepancy in ratings- either people love it or hate it, and the hate reviews seemed so over the top, maybe not related to how the actual movie is, but based in political preference. I’m a moderate, which feels weird to state for a movie rating, but the movie itself was great and had nothing to do with politics in my opinion! Beautiful songs, cinematography, story, themes (embellished from original animated movie but personally I think the original could have had more depth and use of source material). My 2.5 year old daughter was captivated the whole time. Disney did a great job (I haven’t seen their other live action remakes to compare)!"
  }
]