[
  {
    "rating": "3/5",
    "review": "As Anakin has a destiny as child there wasn't that much drama in the beginning until the fight scene of Darth maul"
  },
  {
    "rating": "1/5",
    "review": "The Phantom Menace isn't just a bad Star Wars movie; it's an assault on the very senses. It's a cinematic black hole that sucks the joy out of the entire saga. Where do I even begin with this festering wound on the franchise? Jar Jar Binks. Let's just start there. A character so offensively cartoonish and grating that he makes Ewoks look like nuanced, Shakespearean figures. His dialogue is an incomprehensible babble, his movements are an eyesore, and his mere existence is a cinematic crime against humanity. But the awfulness doesn't stop with Jar Jar. The plot is a convoluted mess of trade federations, taxation of trade routes (seriously?), and political machinations that would bore even the most dedicated history professor. The child actor playing Anakin Skywalker delivers his lines with the emotional range of a block of wood, and his \"romance\" with Padmé Amidala feels about as natural as a conversation with a droid with a faulty vocabulary bank. And the midichlorians! Oh, the midichlorians. This attempt to scientifically explain the mystical Force ripped away all the wonder and replaced it with space germs. It's like explaining magic by saying it's just really good glitter. The action sequences? Mostly forgettable, aside from the admittedly cool but criminally underused Darth Maul. Even the podracing scene, often cited as a highlight, drags on for an eternity. The Phantom Menace isn't just disappointing; it's actively infuriating. It took a beloved universe and dragged it through the mud, leaving a sticky residue of bad CGI and baffling creative decisions. It's a film that makes you question everything you once held dear about Star Wars. Zero out of five stars. Avoid like the plague. Burn all copies. Bury the memory."
  },
  {
    "rating": "5/5",
    "review": "Loved watching this on the Big screen with my son!!"
  },
  {
    "rating": "3/5",
    "review": "Not bad, but still kind of a rocky start. The CGI is very dated, especially since what they did 25 years earlier was way better."
  },
  {
    "rating": "2.5/5",
    "review": "“Star Wars: The Phantom Menace” is a solid start to a larger story, with strong acting, an iconic musical score, and a thrilling final battle. While it introduces key themes and characters well, it often prioritizes political commentary on governmental corruption over the adventurous spirit fans expect from the Star Wars universe. The film has its flaws and may leave viewers with mixed feelings, but it remains a worthwhile watch, offering a moderately insightful message beneath its imperfections."
  },
  {
    "rating": "2.5/5",
    "review": "Good story and great action sequences but I’d completely forgot how wooden some of the acting was. Liam Neeson is good, Jar jar binks is still annoying, Natalie Portman isn’t great but Ewan McGregor is still the biggest mis cast disappointment with his stiff wooden acting. It’s really terrible and still makes me cringe over 25 years later."
  },
  {
    "rating": "2/5",
    "review": "More fun than I remember. The environments and characters either look really good or hysterically bad. Jar Jar and Anakin are annoying but in an amusing sort of way. Watto, Nute Gunray, and Boss Nass are all comedy goldmines. It really is just one of those so bad, it's good movies; all of its blunders are either hilarious or endearing, and I had a great time rewatching it."
  },
  {
    "rating": "2.5/5",
    "review": "This movie was made for kids, not for Star Wars fans who’ve seen the other movies. And it’s got more politics than space battles."
  },
  {
    "rating": "3.5/5",
    "review": "Jarjar Binks was extremely annoying and didn't add much to the story. Darth Maul, Obi-Wan, and Qui-Gon Jinn fight was entertaining, and Palpatine seems true to episodes 4,5, and 6. Great acting by Palpatine and Obi-Wan carried but all around good movie. Solid 3.5/5"
  },
  {
    "rating": "3/5",
    "review": "This is the only Star Wars prequel I like. It isn't nearly as good as the OT, but it's solid."
  },
  {
    "rating": "5/5",
    "review": "Love this movie probably my favourite out of all of the star wars movies. Liam Neeson is great in it."
  },
  {
    "rating": "4/5",
    "review": "Hot Take, This not a bad movie and I think it is better then episode 2 by a mile."
  },
  {
    "rating": "3.5/5",
    "review": "George Lucas’s return to his cinematic galaxy with commanding creativity aligns the general impression of a trilogy’s lesser beginning to make room for phenomenal growth from the icons’ planted anticipation to the visually dazzling upgrade on explorable canvas while stakes are performatively expressed at a decent level. Resultingly good to admit, the disturbance in the Force shows this being a flat disappointment and inferior on comparably weaker levels when it comes to the required storyline basically a misfit gathering against a political backdrop while the visuals inject unsuitably cartoonish frivolity, stemming from the alleged main focus on practicing digital opportunities over drafting a solid worthwhile story. (B)"
  },
  {
    "rating": "4/5",
    "review": "What a wonderful reminder of all the hope and promises was before us when the prequels were first released. Great to see this classic on the big screen again!"
  },
  {
    "rating": "3/5",
    "review": "Too much hate the vibe of this movie is elite"
  },
  {
    "rating": "2/5",
    "review": "It really isn't good. It took me days to watch because the acting matches the poor dialogue and I couldn't find a character to care about. It's pretty though. Very visually appealing and the soundtrack and sound mix are amazing."
  },
  {
    "rating": "5/5",
    "review": "What can I say… Epic Music, Brilliant Fight scenes, Darth Maul. All Round Good Fun."
  },
  {
    "rating": "2.5/5",
    "review": "I've been wanting to start a rewatch of all the Star Wars films for some time, but knowing this would come first put me off for a while. It felt like it would be homework. And most of the problems I remember from the cinema release are there - Jar Jar Binks, ill conceived and badly executed in every respect; a shapeless plot; a terrible screenplay leading to wooden performances; an excess of CGI. And more. But it was more enjoyable than I expected - the actors can't really be blamed for what the script forces them into; the podracing sequence is thrilling and well-staged - thought it's telling that this standout section has little bearing on what passes for the film's plot. Imagine how exciting it would have been with genuine stakes. The lack of an antagonist is a serious issue; Darth Maul could have been it, but he's just not in it enough; imagine, again, if the JJB parts had been excised and replaced with more of Maul. The final, sprawling, action sequence is good but also suffers from the formless plot issue ... but it's more fun than I remember."
  },
  {
    "rating": "4/5",
    "review": "In 1999, my five-year-old grandson looked like the star, and loved the racing scene best of all. Nana (me) loved Jaja Binks. I could not understand the antipathy toward him."
  },
  {
    "rating": "2/5",
    "review": "The only way I can describe this, is that it is very \"meh\", story is very meek, and doesn't have as much of an impact, or great of a story progression compared to the other films in the franchise."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing and enthralling Star Wars movie! Best Jedi themes and music! Only Empire Strikes Back and Rogue One challenge it!"
  },
  {
    "rating": "5/5",
    "review": "So biased this ratings the prequels may not be compared to the originals. But they are not bad."
  },
  {
    "rating": "5/5",
    "review": "Definitely An Underrated Masterpiece! George Lucas Is A Genius Storyteller! The Action Sequences Are Incredible! Anakins Story As The Chosen One Is Magical! Qui Gon And Obi-Wan Are Great Leads, Darth Maul Is One Of My Favorite Sith Lords Ever! And Of Course My Favorite Scene The Duel Of The Fates Is Lightsaber Combat At Its Finest! From The Williams Score, To The Epic Action, The Phantom Menace Is An Excellent Beginning Of The Star Wars Saga!"
  },
  {
    "rating": "4.5/5",
    "review": "The Real Menace is the Tomatometer for this film, which is underrated as it provides incredible battle sequences, podracing, and arguably the best song composed by John Williams: Duel of the Fates!"
  },
  {
    "rating": "2.5/5",
    "review": "The Phantom Menace’s first major sin is showing off the double bladed lightsaber in the trailer. You wait for the real movie to reveal that kind of stuff. This movie starts off the prequels and boy does it…a fresh faced Obi Wan shows up for negotiations with his master, Taken. After they run super speed away from some destroyer droids (where did that very effective design go after the coming war?) they end up on Naboo, home world to Luke and Leia’s mom and Darth Sidious, aka Senator Palpatine (which is obvious throughout the movie as he tricks Padme into calling for the Chancellor to be removed and smiles evilly about it). Here they run into the movies second biggest sin: Jar Jar Binks. Supposed to be comedy relief, he is bumbling and somehow more annoying to listen to than Yoda and his weird talk pattern (which Yaddle, another Yoda species doesn’t have btw). They eventually end up on Tatooine like every other movie where they meet the chosen one and Darth Maul who is criminally underused in the movie. Real quick….the prophecy says he will bring balance to the force? How dumb are the Jedi? There’s 2 Sith and like a million Jedi….WTF do they think “balance to the force” means? So they stop the invasion of Naboo, and Maul dies but not before Taken tells Obi Wan to look after Jake Lloyd after he dies. Yoda is still a weird, somehow older puppet than in the original movies. It’s a fine movie, kind of boring."
  },
  {
    "rating": "5/5",
    "review": "Muy Buena pelicula Darth Maul lo mejor el maquillaje y el doble sable de luz rojo :D"
  },
  {
    "rating": "5/5",
    "review": "The Phantom Menance is by all means an awesome movie. We see how everything started and the origins of many characters with breath taking choreography. By far my favorite star wars movie."
  },
  {
    "rating": "3/5",
    "review": "If it wasn't for the epic dual at the end of the movie, it would be a 1 star buttttttttttttttt, nope. Unfortunately this movie was not the best 1st movie for a trilogy. A lot of space politics make it not very interesting. I did find Jake Lloyd's performance to age fine as I know it has gotten serious hate in the past. I am not really sure where people stand now nor do I care but it wasn't as bad as I remembered. Either way, the movie doesn't really have good tempo and struggles to capture certain themes."
  },
  {
    "rating": "5/5",
    "review": "The movie is a lot better than what I had remembered it was."
  },
  {
    "rating": "5/5",
    "review": "Despite its poor dialogue, The Phantom Menace is an amazing movie and a fun watch every time I see it. I always have fun watching this movie, and it's such a great start to the Star Wars canon. I definitely recommend it!"
  },
  {
    "rating": "5/5",
    "review": "Better than the disney trilogy."
  },
  {
    "rating": "3.5/5",
    "review": "In my opinion it's way better than Attack of the Clones."
  },
  {
    "rating": "3/5",
    "review": "It's good but not that Star wars good . It has it's own moments and great characters like Darth Maul and Qui gon jin . Also this movie is my first Star wars movie ."
  },
  {
    "rating": "5/5",
    "review": "Still an amazing movie"
  },
  {
    "rating": "4/5",
    "review": "Criminally underrated and underappreciated Star Wars film! Jar Jar Binks is an amazing and talented character!!!"
  },
  {
    "rating": "4/5",
    "review": "Duel of the Fates is just peak"
  },
  {
    "rating": "5/5",
    "review": "Top 3 Star Wars movie, absolutely amazing in so many ways."
  },
  {
    "rating": "5/5",
    "review": "Great movie! It has awesome special effects (either CGI or practical), the characters are unique, and the movie takes advantage of the new technology and creates new worlds and aliens. The movie also has a great soundtrack and plot. I think the film holds up better than the original trilogy."
  },
  {
    "rating": "3.5/5",
    "review": "I like this film. Its not perfect, but you will enjoy yourself watching it."
  },
  {
    "rating": "3.5/5",
    "review": "This movie gets too much hate in my opinion important developmental movie for the series wish there was more maul maybe a little faster pace but I wasn't bothered by the acting I would rate it 80%"
  },
  {
    "rating": "3.5/5",
    "review": "George should have let someone else do the screenplay. Dialogue was tough at times and it really needed a Han Solo like character. Also introducing Anakin as child for a half the movie was a mistake. I would have started with Attack of the Clones. Best thing about the Phantom Menace was Darth Maul by far, a wasted character."
  },
  {
    "rating": "1.5/5",
    "review": "This movie is actually pretty bad. Some of the visuals are good though. And the Duel of the Fates scene was incredibly entertaining."
  },
  {
    "rating": "3/5",
    "review": "I'm a little mixed my least favorite of the first 6 but I can't call it bad."
  },
  {
    "rating": "3.5/5",
    "review": "A mi me gustó bastante, la película tiene un buen ritmo, una banda sonora espectacular, actuaciones geniales, efectos visuales y sonoros impresionantes. George Lucas volvió con todo a su creación más preciada. Lo único que me molesta un poco es el humor que maneja con Jar Jar Binks, que en ocasiones se vuelve molesto."
  },
  {
    "rating": "3/5",
    "review": "Let me start by saying The Phantom Menace is a much like eating a 7-course meal where half the dishes are gourmet and the other half are Jar Jar Binks..The Phantom Menace is a film that attempts to cover a lot of ground but only succeeds in some areas. It’s kind of like a pizza loaded with every topping you can think of: some slices are fantastic (Darth Maul), some are a bit odd (midichlorians), and others make you rethink your decisions (Jar Jar). It’s chaotic, but it’s our chaos, and I can’t help but enjoy it—mainly because it brought us memes."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie. Comfortable chairs"
  },
  {
    "rating": "5/5",
    "review": "My Brother and I are the only ones who like this movie in our entire family, despite what many people have said to me about it being slow, and how uninterested they were in the politics I found the whole movie to be amazing, especially the choreography for the light saber fights. The only thing I would’ve changed was Gungans. The way they talked was racist…but still Darth Jar Jar!"
  },
  {
    "rating": "1.5/5",
    "review": "I’m watching this movie for the first time since I first saw it in the theater. Now I know why I’ve ignored it all these years: It’s bad. The whole movie feels like a movie for 9 year olds, written by 9 year olds. Nothing but contrived dialogue, coupled with shoe-horning references to the original movies makes it almost unbearable to watch. Add in bad acting, poor CGI effects, and ridiculous characters, and you’ve almost ruined a franchise. We need a reboot of this atrocity."
  },
  {
    "rating": "5/5",
    "review": "A movie way ahead of its time. Look past the lightsabers and the droids and enjoy the human element."
  },
  {
    "rating": "5/5",
    "review": "\"Back then they didn't want me, now I'm hot they all on me\" Classic one for me. I will never forget going to see this on theaters when I was a child. my first Star Wars experience in theaters"
  },
  {
    "rating": "2.5/5",
    "review": "As much as I LOVED this movie as a kid, unlike Attack of the Clones, it does not translate to adulthood. It's so boring and politic-y for most of the movie. Jar Jar sucks but I don't hate him as much as most people. If it didn't have Liam Neeson and the most epic lightsaber duel, and Maul (who I've perfectly cosplayed) I'd probably have given it less stars."
  },
  {
    "rating": "3.5/5",
    "review": "La verdad, seré sincero. Está película es bien recomendable para los fans de Star Wars (Trek)."
  },
  {
    "rating": "2.5/5",
    "review": "No está tan buena los efectos son chafas, aún que la batalla final si es buena"
  },
  {
    "rating": "3/5",
    "review": "Liam Neeson's Portrayal of Qui-Gon Jinn was solid, Darth Maul was a good villan the emperors cameo was good also, Jar Jar was forgettable but the final Jedi vs Sith clash was good"
  },
  {
    "rating": "2.5/5",
    "review": "Not very good. It lacks an interesting storyline at parts. Darth maul is the whole reason to see it. I give it a 54%"
  },
  {
    "rating": "2/5",
    "review": "Look, Phantom Menace is not a bad movie. It is quite possibly one of the earliest victims of review bombing. It’s understandable why that happened though. Fans waited 15 years for this half baked snoozer. The dialogue is unnatural, the green screens are terrible, and the humor is cringeworthy. Additionally, the romance between Padme and Anakin is creepy. Why couldn’t she have been younger or he had been older? George Lucas is a kinky guy. With that being said, the film is redeemed by inventive aesthetics. The city scapes are something to behold, the vehicles are gorgeous — I want to pilot them all, and the Darth Maul fight will always be cool. It can be hard to stay awake through Phantom Menace but the beautiful architecture and lightsaber fight might just wake you up."
  },
  {
    "rating": "5/5",
    "review": "These are another one of the most underrated films of all Time, George Lucas poured his heart and soul into this film, creating an entire new universe for his franchise and it really shows. The CGI the visuals are breathtaking especially for 1999 the story The dialogue everything it is a masterpiece. Definitely must see."
  },
  {
    "rating": "3.5/5",
    "review": "Over time, I have grown to appreciate this movie more and more. Except Ja Ja. I can never appreciate Ja Ja. Truly wish they had more practical effects. It is a pretty solid start to the Skywalker Story. The duels are awesome, but wish they did s’more with Darth Maul in the later episodes."
  },
  {
    "rating": "3.5/5",
    "review": "This is a good movie, maybe a bit boring at some times and can feel like it's dragging on. Everything in the final act is amazing, the lightsaber duel, the droid fight, and infiltration of the palace. I would definitely recommend watching this movie especially if you are getting into Star Wars."
  },
  {
    "rating": "3.5/5",
    "review": "Though the film does leave a lot to be desired from a Star Wars movie, the introduction of some top characters, alongside a brilliant score, makes it always worth a watch."
  },
  {
    "rating": "5/5",
    "review": "LOL!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "2/5",
    "review": "The Phantom Menace remains the most disappointing movie of my life. It only had to have been average for millions of devoted Star Wars fans to have loved it, but it feels to even reach mediocraty. From the opening scrawl talking about trade embargo's you know this isn't going to be the same level of drama as the original movies. But this film fails on every level. It seems to be aimed more at children, with a ridiculous child character capable of amazing feats and comedy droids and aliens in slapstick falls and fumbles. However, this is mixed with a long playing time and plot that centres around a trade dispute which is unlikely to captivate many children. There may be some fans of this movie out there, but I guarantee that none of them were fans of the original movies. Phantom Menace has no likeable characters, poor dialogue, a terrible plot, terrible acting and no sense of story or pace. The original movies spawned fans that could quote the movies line for line and many critics hail them as some of the best cinema has to offer. Phantom Menace is a poor movie, even if it was not linked to this legacy. I have given 2 stars, simply because of the visual effects and the John Williams score, which is the only thing that elevates it above a total failure. It is not enjoyable to watch and still leaves me wondering if it would have been better to have left Star Wars at just 3 movies."
  },
  {
    "rating": "3/5",
    "review": "I don't understand why this gets so much hate - yes it is a bit slow and the dialogue isn't great - but Liam Neelson is amazing and seeing the Jedi Order properly is an amazing experience. Duel of the Fates was brilliant - the choreography and the music. Darth Maul with double lightsaber. Very underrated film in my opinion."
  },
  {
    "rating": "3.5/5",
    "review": "I really don't understand the hate for this movie I thought it was a really good movie but I also understand some of the hate for this movie like the CGI or the cheesy lines"
  },
  {
    "rating": "3.5/5",
    "review": "\"Star Wars: Episode I - The Phantom Menace\" is an imperfect, yet underrated film. Despite its somewhat slow-paced nature, it opens George Lucas' prequel trilogy with an impressive array of worldbuilding, characters and set pieces."
  },
  {
    "rating": "3/5",
    "review": "Dry stale also bad cgi but some fine actors and kinda entertained me"
  },
  {
    "rating": "4.5/5",
    "review": "An overhated film, but a solid one that foreshadows to the next two in the OT. At times, it may feel like it could drag but it’s a solid film for Star Wars fans."
  },
  {
    "rating": "3/5",
    "review": "Definitely one of the weakest Star Wars films. Qui Gon is great, as are the ending duel and pod racing sequence. But Jar Jar is pointless and the movie has too many poorly done parts that only kids will tolerate."
  },
  {
    "rating": "3.5/5",
    "review": "George had great set designs, an interesting story, a passionate team, and a huge following ready to see Star Wars to return. He just forgot to write interesting characters and dialogue that doesn't sound like they are directly reading off the script. In my personal opinion, this is truly a Star Wars film of all time."
  },
  {
    "rating": "3.5/5",
    "review": "Classic Star Wars Film, Love this movie. Not as good as any of the originals or Revenge of the Sith but still better than Attack of the Clones."
  },
  {
    "rating": "4/5",
    "review": "overhated movie. While you can see that it is meant for kids, many people overlook the fact that this is a prequel, the first in the franchise, and it is building the main story. We see how the main character Anakin, is brought into this fight. We see the beginnings of a conflict that lasts through two generations. We also see here how the Jedi would see their downfall. The choreography in this movie was some of the best in all cinema, and the world building in this movie is the best in any star wars movie. A great start to the best franchise of all time."
  },
  {
    "rating": "5/5",
    "review": "LOVE this movie. I was born the year it came out and loved it ever since. I love it even more now that I got to see it in theatres! The final act is about the most action packed in any Star Wars movie. Duel of the Fates is one of the best Star Wars songs and fights ever! Pod racing is amazing! Jar Jar didnt annoy me when I was a kid. I remember really liking him when I was a kid and then hating him when I was a teenager but now that Im older I love Jar Jar again. Hes a silly comic relief character and you can tell Ahmed Best had a blast with the role! He did not deserve the hate he got at all! Same with Jake Loyd. He a skid playing a kid and he does a good job. Not the best child actor ever but definitely not the worst by far! Qui Gon is definitely my third favorite Jedi behind Luke and Yoda. Obi Wan is not far behind Qui Gon. Liam Neeson does amazing job portraying a Jedi as a Jedi should be. Not what the Jedi had become during the prequel era which will lead to their downfall. And Amazing Star Wars movie that kicked off the entire Prequel Era, the era I grew up with and love. I love this movie snd no one can ever convince me otherwise I even like the politics! You cant show a Republic fall to a Dictatorship without, you know, showing how that happened! It would be pretty cheap if we never saw the Senate and how corrupt and weak theyd become. Only for Palpatine to show up and take power. Theyre be no setting without the political setting and thats true for the Prequels and OT. Anyway, LOVE this movie and Ill never stop loving it"
  },
  {
    "rating": "4/5",
    "review": "The film was amaizing but the weakest out of three."
  },
  {
    "rating": "4.5/5",
    "review": "Very unpopular opinion, but this is the 2nd best prequel. Sure it doesn't have the best plot or story, but I still love it. Darth maul is super awesome and so is Qui Gon and Obi-Wan. Id say it's a worthwhile watch."
  },
  {
    "rating": "1.5/5",
    "review": "Stupid Disneyfication... Horrible \"cute/funny\" things like Jarjar... I also hate the ewoks, so?"
  },
  {
    "rating": "5/5",
    "review": "A classic that is worth watching every time it’s on! May the Force be with you while watching, and always."
  },
  {
    "rating": "4.5/5",
    "review": "Very underrated and hated movie. It is not the greatest, but it is an iconic start for the prequels. Amazing characters, and again one of the best soundtracks ever (John Williams)."
  },
  {
    "rating": "5/5",
    "review": "Still one of the best Star Wars movies"
  },
  {
    "rating": "2.5/5",
    "review": "Direção: Ok Atuação: Ok Roteiro: Ruim Caracterização: Ok Soundtrack: Bom"
  },
  {
    "rating": "3.5/5",
    "review": "Not good but definitely not the worst Star Wars film."
  },
  {
    "rating": "3.5/5",
    "review": "Looking back at this movie I think Jar Jar Binks gets a bad rep and the acting of the actor who played Anakin Skywalker is not as bad as we think it is. Though its not great I don't think it is bad as we have been lead to believe. Its a fairly decent movie and gets hated on a lot"
  },
  {
    "rating": "5/5",
    "review": "Off course I've seen this film as a little child, deep-diving into the beautiful world of George Lucas' Star Wars. The origin story of the greatest villain of all time, introducing new fan-favorite characters and starting the era of Star Wars that brought us so much later on. But it was not like I especially liked it or anything. But I still got hyped hearing the film was gonna return to theaters for its 25th anniversary. I booked my tickets, invited a dear friend of mine to see it. After going out for dinner and walking through the town it was time to visit the theater. It already started perfectly with the trailer of Deadpool & Wolverine, PG-13 and extra exclusive scenes added in. After that, for the first time ever, I watched a Star Wars film in theaters and I fell in love with it all over again. Not only because I love Darth Maul, I loved him before in 'Rebels' and 'The Clone Wars', not only because it has the authentic Star Wars-feeling George Lucas kinda killed with shooting on digital for Attack Of The Clones, it was such a good time and beautiful and heartwarming film. Every was perfect. Easily a top 3 theater experience and a top 3 Star Wars film. I'd honestly take this over the sequel trilogy, the other prequels, Rogue One, Solo and the original Star Wars any day."
  },
  {
    "rating": "4.5/5",
    "review": "For me, this definitely a solid start for the often-divisive Star Wars prequel trilogy. Darth Maul always remains one of my personal favourite Star Wars villains."
  },
  {
    "rating": "5/5",
    "review": "Happy Halloween Star Wars Movie theater Maui Penelope pitstop 0234"
  },
  {
    "rating": "3.5/5",
    "review": "Jar Jar is just the best!"
  },
  {
    "rating": "1/5",
    "review": "Horrible acting. It was so bad that now I can't watch anything with Natalie Portman without cringing. The only semi-positive element of the film was the fact that it explored the pre-empire galaxy. And as if things couldn't get worse, they decide to add a character like Jar-Jar Binks who just ruins everything (including the movie itself)."
  },
  {
    "rating": "5/5",
    "review": "A masterpiece to watch on the big screen."
  },
  {
    "rating": "5/5",
    "review": "This is the second time I’m watching the phantom menace in 12 years of 3D rerelease."
  },
  {
    "rating": "5/5",
    "review": "Pod racing and darth maul, what more can I say, it's awesome."
  },
  {
    "rating": "4.5/5",
    "review": "A classic. Great light saber battles. Better than anything Disney star wars has done."
  },
  {
    "rating": "4.5/5",
    "review": "Literally any problem with this movie can be fixed with a change of dialogue. Any at all. Dialogue is the only issue with this movie. Too political? There is a better way to talk about it and have it make sense. Bad acting? Nope, bad dialogue. Too boring? Change dialogue, or even take out the boring dialogue entirely. The plot? Easily understandable if there was better dialogue. It's not a complicated plot. This will offend SW1 haters, but politics and war go hand in hand. This movie literally explains how the characters got to SW4-6. The build-up of war is always political. ALWAYS. If that makes someone upset, they didn't want a convincing story; they just wanted ships going blast blast explode and lightsabers going vroom vroom clash. Sorry bud but there's more to it than that. Besides the story itself, the special effects and the music are phenomenal. Engaging, fun, and unique. Overall, this is a great movie with interesting layers and an engaging theme."
  },
  {
    "rating": "2.5/5",
    "review": "The only good part was the end light saber fight"
  },
  {
    "rating": "2/5",
    "review": "Very disappointing, the original idea of the story deserved a better development, but it became a commercial spot full of horrendous graphic effects, it ended to be a family comic. By the way you have to watch it if you want to see the entire star wars franchise."
  },
  {
    "rating": "5/5",
    "review": "I don’t understand why people rate this movie so badly. Its thousand times better than new ones from Disney."
  },
  {
    "rating": "5/5",
    "review": "mini anakin is the goat fr"
  },
  {
    "rating": "4.5/5",
    "review": "Honestly, I feel like this movie deserves more respect than it actually deserves. Such an amazing start to prequel trilogy! The CGI is actually not that bad even coming out of a movie from 1999. The lightsaber and space battles were fun and exciting! And you gotta admit that Darth Maul is a cool villain. (At least in this movie)."
  },
  {
    "rating": "3.5/5",
    "review": "El tema político se combina con una película se podría decir que más infantil, y el resultado resulta una mezcla muy extraña. Las escenas de acción son muy buenas pero manejan el tema polico de una manera en la que afecta terriblemente la narrativa, dándonos una película lenta con buenas escenas de acción y un descontrastado desarrollo de los personajes. No es mala pero tampoco me encanta."
  },
  {
    "rating": "3.5/5",
    "review": "Really underrated movie, not the best though"
  },
  {
    "rating": "1/5",
    "review": "Worst Star Wars movie. No soul. No feeling. No magic. Blah."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie overall, keeping in mind the target audience is children. Dialog could be better but the action sequences where excellent."
  },
  {
    "rating": "3/5",
    "review": "I saw it in 4dx for the anniversary what made it rlly cool"
  },
  {
    "rating": "5/5",
    "review": "Absolute classic. Darth Maul’s mysterious stance as a new unknown character is incredible and I can’t believe it has been around for 25 years now."
  },
  {
    "rating": "1.5/5",
    "review": "Despite some good VFX, the story doesn't make much sense, there is not character depth, there is wooden dialogue and acting, and other than the final battle, there is no tension. However, Jar Jar Binks is so bad and painful he is actually funny. 3.90/10. Awful. Those who like this garbage hate 2001. Anakin sucks, Qui-Gon Jin is baffling. Do I smell Jin? Well, me and Plinkett do."
  },
  {
    "rating": "1.5/5",
    "review": "Liam Neeson is very good, everything else is pretty bad"
  },
  {
    "rating": "5/5",
    "review": "It's Star Wars that do you expect. It's peak fiction at It's finest. It's got great action, story and characters."
  },
  {
    "rating": "3/5",
    "review": "mid. not bad, just really mid. 6/10"
  },
  {
    "rating": "1.5/5",
    "review": "I remember how angry I was in the theater over this movie when it first came out. I was so excited, and wanted to like it. But as soon as Jar Jar Binks appeared on the screen and I realized that he wasn’t going away, I couldn’t appreciate any of the rest of the movie. That, coupled with some really bad acting, weird characters that seemed out of place even for Star Wars, and cheesey, sitcom-like transitions, pretty much made me lose my interest in the movie. There were some good parts — parts that I’ve discovered on rewatching — that didn’t quite make up for the bad parts. I enjoyed Qui-Gonn Jinn (Liam Neeson), young Obi-Wan (Ewan McGregor), and some of the other cast. And I liked the scenes on Tatooine. Other than that… yikes."
  },
  {
    "rating": "5/5",
    "review": "Never listen people who spit on this movie, they're cringy af. It's a masterpiece, like every Lucas movie."
  },
  {
    "rating": "5/5",
    "review": "Best star wars of the franchise!!!!! Just as good the first time I saw it released in theatre's!!!!"
  },
  {
    "rating": "5/5",
    "review": "Yeah there's some corny bits, but I genuinely love this more than any of the other movies."
  },
  {
    "rating": "0.5/5",
    "review": "It's really bad. There is nothing to like about this movie and thinking about it makes me angry."
  },
  {
    "rating": "5/5",
    "review": "I saw this originally 25 years ago at a midnight showing and I looked it back then, however this and the other prequels have gotten better with time and now I love this movie... More so now after the ones released by Disney... Episodes 1-6 are the true star wars movies, everything after is just fan fiction."
  },
  {
    "rating": "4/5",
    "review": "CGI definitely doesn’t hold up. Also, Jar Jar."
  },
  {
    "rating": "5/5",
    "review": "Just a straight up good time. Great origin story with even better fight scenes. Every time I watch, I’m immediately transported to a galaxy far far away and I love every second of it. Even you Jar Jar ❤️🤣"
  },
  {
    "rating": "5/5",
    "review": "Jake Lloyd slays in this film"
  },
  {
    "rating": "5/5",
    "review": "Get this film to 60%! Originally underrated."
  },
  {
    "rating": "5/5",
    "review": "not the best but still way bather than disney work"
  },
  {
    "rating": "4/5",
    "review": "Not perfect but a great beginning"
  },
  {
    "rating": "4/5",
    "review": "Mis likes this movie... a lot. Mis is happy."
  },
  {
    "rating": "1.5/5",
    "review": "This movie is quite bad. The story was never great, but watching it now, the CG is terrible. And then there’s that Binks dude. A few good moments here and there save it from being a zero, but hands-down the worst in the Star Wars canon."
  },
  {
    "rating": "4.5/5",
    "review": "I don't care, Phantom Menace is amazing."
  },
  {
    "rating": "4.5/5",
    "review": "Its not the best Star Wars movie, not even the best of the prequels. I don't think its bad, it's just not great."
  },
  {
    "rating": "2.5/5",
    "review": "Pretty decent but also boring at times. Overall a good started to the prequel trilogy."
  },
  {
    "rating": "5/5",
    "review": "It’s a great movie for kids and open minded people will enjoy it. The morals George teaches are also valuable."
  },
  {
    "rating": "5/5",
    "review": "Great prequel. Kinda started with the same note as The New Hope and great setup for the later prequels"
  },
  {
    "rating": "3/5",
    "review": "Flawed, too much cgi, having a kid protagonist is kinda annoying but part of the story and Jar Jar Binks should never have seen the screen. Still miles better than The Acolyte."
  },
  {
    "rating": "3/5",
    "review": "A lot of jar jar ….. ground breaking cgi would have loved more practical effects"
  },
  {
    "rating": "4.5/5",
    "review": "The movie is a classic and overhated"
  },
  {
    "rating": "2.5/5",
    "review": "Disappointing return to the franchise, too many fx, characters aren't very likable."
  },
  {
    "rating": "5/5",
    "review": "All the people hating on this movie are delusional"
  },
  {
    "rating": "5/5",
    "review": "Honestly it's a good starwars movie and highly underrated."
  },
  {
    "rating": "5/5",
    "review": "Great addition to the original trilogy get a deep dive into the back story of the darth vader and why he becomes what he was"
  },
  {
    "rating": "0.5/5",
    "review": "Might be the worst movie relative to its budget ever made"
  },
  {
    "rating": "4/5",
    "review": "Powerful visuals & world building - expands the Star Wars universe richly"
  },
  {
    "rating": "4.5/5",
    "review": "Some hits some misses, but at least it had imagination and heart much better than the soulless corporate nonsense Disney makes."
  },
  {
    "rating": "5/5",
    "review": "(ESPAÑOL - 25 ANIVERSARIO) Increíble, simplemente increíble...Como hace 25 años atrás por allá en 1999. No pude evitar las lágrimas apenas la intro tan mítica de la saga entró en escena. Luego de sufrir tanto con Disney, esta película me hizo olvidar todo por un momento. Gracias George Lucas"
  },
  {
    "rating": "2/5",
    "review": "Star Wars: Episode I - The Phantom Menace is a cringeworthy first entry in the Star Wars prequels, with poorly aged visual effects and extremely lackluster performances being the main components of the figurative ball and chain that pulls this film to the bottom cinematic respect."
  },
  {
    "rating": "1.5/5",
    "review": "It is bad but not awful. It is certainly not a way to reboot Star Wars."
  },
  {
    "rating": "4.5/5",
    "review": "En su día le habría dado 3 estrellas, hoy en día después de haberla visto varias veces y de los productos que saca Disney de Star Wars, casi se acerca al nivel de obra maestra"
  },
  {
    "rating": "3/5",
    "review": "I have so much nostalgia for this movie.. it was the first Star Wars movie I ever saw in the cinema. Best part is the end with Darth Maul but the racing pots was also a highlight."
  },
  {
    "rating": "5/5",
    "review": "Best Star Wars ever! pod racing! qui-gon. darth maul. just the best!"
  },
  {
    "rating": "3.5/5",
    "review": "Though the movie is heavily reliant upon world building and character placement, its execution holds up better than that of its successor. If you can look past the childish humor and some stiff moments, it's a good start to the story."
  },
  {
    "rating": "5/5",
    "review": "After watching the sequels I have a new appreciation for the prequels."
  },
  {
    "rating": "4/5",
    "review": "Jar Jar gives this movie a bad rap, maybe rightfully so. But it's not all bad. It was the first time we got to see the Jedi in their prime and it was awesome. The duel of the fates is probably the most memorable lightsaber duel (and musical score) in all of Star Wars."
  },
  {
    "rating": "4.5/5",
    "review": "It has its problems but its easily the best, most complete movie of the prequels and far better than any of the Disney stuff."
  },
  {
    "rating": "4/5",
    "review": "The most underrated Star Wars film of all 6."
  },
  {
    "rating": "5/5",
    "review": "Less Portman would have moved this to 6 stars."
  },
  {
    "rating": "4.5/5",
    "review": "Sale Darth maul, eso para mí lo dice todo"
  },
  {
    "rating": "3/5",
    "review": "The prequels had a good and interesting plot but a rough execution."
  },
  {
    "rating": "4/5",
    "review": "I was very young when this movie came out originally, unable to comprehend. I caught a screening for the 25th anniversary. I will say this, it is not the best prequel. If you look at it through the lens from what we have had the last 10 years from Disney, you respect it. When I watched it in the theater, I had the child-like wonder, like it was a universe without motives and derivative storytelling. I feel that it holds up, It does have its moments where you remember why it is some peoples' least favorite. I believe a lot of people would go back to this universe in a heartbeat. George Lucas was truly original and a head of his time, most times worked. Best I can give is 4/5."
  },
  {
    "rating": "4/5",
    "review": "One of the best parts is John Williams his score. Acting is decent enough but act 2 has some big moments things drag on story wise and the lines that actors are given can be bad."
  },
  {
    "rating": "2.5/5",
    "review": "Ok movie. Sadly nothing like the originals."
  },
  {
    "rating": "5/5",
    "review": "George lucas wisdom in the prequels becomes more evident the older I get. They were masterpieces of a different sort than the original 77-83 films."
  },
  {
    "rating": "3/5",
    "review": "Yea.. I like Darth Maul and parts of the story, but it would never be in my top 5 Star Wars movies."
  },
  {
    "rating": "3.5/5",
    "review": "I mean, it's alright, like"
  },
  {
    "rating": "4.5/5",
    "review": "This is an actual good movie. Maybe it was divisive back then, but it withstands the test of time. Some Star Wars fans are just hateful. Be glad for what we had, because there are dark times ahead."
  },
  {
    "rating": "3/5",
    "review": "I don't think Episode I failed due to any plot problems. On the contrary, I personally appreciate the grand worldview that this film expanded for the Star Wars universe. However, it is undeniable that this prequel deviates too far from the original trilogy. This may be why many fans are not optimistic about the plot presented in this movie. The prequel series only clearly connects to the original trilogy in The Revenge of the Sith, which makes this movie seem very disconnected from the main storyline."
  },
  {
    "rating": "2/5",
    "review": "The visuals are top nots. The hype was more exciting than the movie. Podrace was the best part of this movie."
  },
  {
    "rating": "3/5",
    "review": "Yes, too many eye rolling moments yet offered the greatest lightsaber battle in history"
  },
  {
    "rating": "5/5",
    "review": "I saw this in theaters when i was 9 (ironically the same age in the movie as the chosen one) and it birthed my love for the greatest movie franchise this side of heaven. Amazing portrayal of origin of anakin skywalkwer and the jedi order at its height. EPIC lightsaber duel between darth maul qui gon and obi wan. I love this movie"
  },
  {
    "rating": "5/5",
    "review": "We were so lucky to have 3 more movies from Lucas himself before Disney took over. I appreciate his prequels more and more all the time. And come on! The Darth Maul Duel of the Fates lightsaber fight alone is worth 4.5 starts by himself. Director Lucas and Composer Williams come together in a masterpiece of twirling light blades."
  },
  {
    "rating": "3.5/5",
    "review": "Yo conoci star wars por la trilogia de precuelas, y alk no tener como referencia la trilogia original no supe ni pude dar las criticas que tuve la pelicula, a mi personalmente me gusto, aunque muchos la consideren aburrida, extrañamente yo si me la he visto completa varias veces, y lo que algunos dicen de positivo de esta pelicula como la carrera de vainas sinceramente a mi es la parte que mas me aburrio. Jar jar no me parece tan molesto como se le dice, aunque hay escenas donde efectivamente es molesto perro no lo suficiente como para que yo lo odie. Y el duelo final me hizo querer pelear con un palo de escoba que termino en que rompiera una ventana de la puerta."
  },
  {
    "rating": "3.5/5",
    "review": "One of my all-time favorite Star Wars films, in my opinion, George Lucas had an incredible vision at the time. I don't understand why or how people could give such a low score to such an epic movie. This movie has heart, style, and great special effects. The acting, in my opinion, was pretty excellent overall, offering an awesome, unique Star Wars experience. I enjoyed all the characters and the uniqueness of this film. The \"Duel of the Fates\" music is memorable, as is the storyline and music. You may spot flaws within this film; however, consider the uniqueness and accomplishments they pulled off with advancing technology in filming. The Jedi have a great presence, as does the mystery of the Sith. I would give this film a 9.8 out of 10. Most impressive is the \"Duel of the Fates\" fight."
  },
  {
    "rating": "4.5/5",
    "review": "Compared to anything Disney has put out… other than Rogue One… the entire prequel trilogy has aged very well."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie whe it came out. The kid lines are cringe but he mostly keeps his mouth shut."
  },
  {
    "rating": "5/5",
    "review": "The Phantom Menace is a good movie that people should see and look at it from the lens of seeing episode 1-6 as a cohesive series"
  },
  {
    "rating": "5/5",
    "review": "\"The Phantom Menace\" is a visually stunning and exciting introduction to the Star Wars prequel trilogy, introducing us to a new generation of heroes and villains. The film's CGI is groundbreaking, seamlessly blending with live-action to create a truly immersive experience. The epic scale of the film is evident in the breathtaking landscapes, bustling spaceports, and thrilling lightsaber battles. The film introduces us to Anakin Skywalker, a young and powerful Jedi with a troubled past. He is a compelling character, showcasing the potential for both good and evil within him. The film skillfully explores his complex relationship with Obi-Wan Kenobi, a mentor and friend who is trying to guide him on the right path. The dynamic between Anakin and Obi-Wan is captivating, filled with moments of both tenderness and conflict. The film also introduces us to the charismatic villain, Darth Maul, whose iconic double-bladed lightsaber and brutal fighting style make him a formidable and memorable antagonist. The lightsaber duel between Obi-Wan and Maul is a standout moment, showcasing the film's impressive action sequences. The film's pacing is a bit slower than the original trilogy, but the story unfolds at a measured pace, giving us a chance to get to know the characters and their world. \"The Phantom Menace\" is a visually impressive and entertaining film that sets the stage for the epic saga that unfolds in the prequels. While some critics may argue that the film lacks the charm and heart of the original trilogy, it introduces us to a vibrant and exciting new chapter in the Star Wars universe, with a cast of captivating characters and a story that promises great things to come."
  },
  {
    "rating": "5/5",
    "review": "The start of the the story! From pod racing, to intrigue, sleek space fighters and weapons, to fantastic music and one of the best fight scenes in the series, this is my all time favorite of the Star Wars films."
  },
  {
    "rating": "2.5/5",
    "review": "4.5 out of 10. This could've been so much better. Cgi jarring, dialogue is weak. Fight choreography awesome!"
  },
  {
    "rating": "3.5/5",
    "review": "Held my interest throughout the entire movie, it was entertaining. Great fight scene at the end, and overall entertaining movie. Could have been better."
  },
  {
    "rating": "3/5",
    "review": "Least favorite of the Lucas movies. Need to look at the prequels as 1 movie, thus making this movie a little better. Lots of good Star Wars material and is the beginning of a great story."
  },
  {
    "rating": "4/5",
    "review": "this movie honestly holds up alot better then I thought. time has done many favors for this movie"
  },
  {
    "rating": "5/5",
    "review": "Generation defining prequel to a stellar franchise."
  },
  {
    "rating": "4.5/5",
    "review": "Jar Jar Binks absolutely carried this movie, my only issue is that Jar Jar should have taken more responsibility over his kin and become a genocidal leader similar to the behaviors of previous world leaders."
  },
  {
    "rating": "3/5",
    "review": "It's not as bad as people say I think.... It's still kind of bad though. Lol"
  },
  {
    "rating": "2.5/5",
    "review": "These 2 1/2 stars were earned from Darth Maul, pod racing and the acting from Liam Neeson and Ewan McGregor. Almost everything else about this movie is sub par."
  },
  {
    "rating": "2.5/5",
    "review": "George Lucas's return to the franchise brought a slew of characters, some interesting but others underdeveloped. <i>Star Wars: Episode I - The Phantom Menace</i> lacks the magic that made the characters work in the original trilogy, there was so much potential with Darth Maul but his motivations and backstory remain shrouded in mystery."
  },
  {
    "rating": "4.5/5",
    "review": "Having been a life-long Star Wars fan, I was a little critical of this movie when it first came out. Watching it 25 years later, I amazed at how great of a film it actually is. I still don't care for the whole midichlorians thing, but that is a minor issue compared to the cinematic genius of George Lucas. Lucas' prequels to the original trilogy far surpass the Rey sequels by leaps and bounds. The only major criticism I have of the prequels is that they were too short for really good story develoment. I feel like a lot ended up on the cutting room floor and I would love to see 3+ hour-long Director cuts of each of these films."
  },
  {
    "rating": "2.5/5",
    "review": "Falls far short of the original trilogy, but an okay outing."
  },
  {
    "rating": "5/5",
    "review": "Quite possibly the most underated movie, especially for new Star Wars fans getting into the franchise. Will forever hold a top spot in my favorite movies!"
  },
  {
    "rating": "4.5/5",
    "review": "in my opinion, the best Star Wars film since the Original Trilogy"
  },
  {
    "rating": "5/5",
    "review": "Dual of the fates. Best fight scene ever. Darth Maul versus Qui-Gon and Obi-Wan."
  },
  {
    "rating": "1/5",
    "review": "Visually stunning but stunted and wooden acting."
  },
  {
    "rating": "4/5",
    "review": "This movie is underrated 8/10"
  },
  {
    "rating": "3/5",
    "review": "Boring and very confusing, to fast plot with nothing special to see."
  },
  {
    "rating": "3/5",
    "review": "Liam Neeson and Ewan MacGregor make this film watchable. Lucas should have allowed others to polish the dialogue and direct."
  },
  {
    "rating": "4/5",
    "review": "I personally feel like it depends on what type of person you are when it comes to enjoying this film. If you are a kid or you like movies with great visuals and action then you would really like this film. Me and my friends went to go see this film for the 25th anniversary, two of them had never even seen the film and we all really enjoyed the movie. However, even with all of the pros there are still some cons. The acting is not the greatest and most of the time the acting just feels lifeless. If you want the audience to relate and care about the characters then you have to make them seem real, not like robots repeating a script. While there was a main objective and a threat in the film the threat did not feel like a real threat. The villains were not intimidating and you cant help but laugh at the villains. In conclusion, the average person or most people would enjoy this film but Star Wars fans and critics would not enjoy. This film is more enjoyable if you are younger, a casual viewer or if you simply appreciate the director's \"George Lucas\" vision. It is worth checking out, this film is very divisive so you will either like it or you will not, there is not much in between."
  },
  {
    "rating": "2/5",
    "review": "40% The ending fight scene between Darth Maul, Qui, and Obiwan was really the only good part."
  },
  {
    "rating": "2.5/5",
    "review": "It's fine that really it"
  },
  {
    "rating": "4/5",
    "review": "There is a lot of Good with this film, the final battle/lightsaber duel, Obi one kenobi’s character arc, Qui gon jinn’s wisdom however the movie fails to properly set up the sequel and spends too much time on sub plots. Still love jar jar binks though."
  },
  {
    "rating": "3/5",
    "review": "In some ways it expands the universe well, but the script is so clunky, and it manages to be ridiculously juvenile and extremely tedious at the same time. Also some silly prequel exposition."
  },
  {
    "rating": "2/5",
    "review": "Don't bother. Watch the first three, Rogue One, Andor or the Mandalorians first season instead."
  },
  {
    "rating": "2/5",
    "review": "Jar jar ruined this movie. It’s ok for a global war movie to be serious. Also,,, well… mostly it’s the cute androids and misc useless creatures that subtract all vitality from an ominous plot."
  },
  {
    "rating": "4.5/5",
    "review": "スカイウォーカーサーガ(1-6)の始まりの物語。"
  },
  {
    "rating": "5/5",
    "review": "Went adn saw with my son who never saw it in the theater, just awesome except for jar jar the sith."
  },
  {
    "rating": "3.5/5",
    "review": "Star Wars nerd here. The most highly anticipated release ever and it just didn't pack the punch we all wanted. Oh to just be able to edit out about 10 very selective minutes. Such as nearly every Jar Jar Binks line as well as having modern day style sports announcers at the pod racing. UGH! Push those thoughts away and did enjoy getting some Anakin back story and loved the Darth Maul character. I would have loved some more story about him. Ultimately it is my least favorite Star Wars movie, but I think George Lucas learned his lesson after this one."
  },
  {
    "rating": "4.5/5",
    "review": "Not like the original trilogy at all, but this film doesn't want to be. Excellent world building and stunning visuals for 1999. Liam Neeson as Qui Gon Jin steals the show!!!"
  },
  {
    "rating": "5/5",
    "review": "Granted I started watching Star wars as a child and have loved all of the original trilogy and the second trilogy this one is a nostalgic classic movie for me."
  },
  {
    "rating": "5/5",
    "review": "So much better than the Disney sequel trilogy. Seeing Darth Maul when those doors open, Qui Gonn saying “we’ll handle this.” with Duel Of The Fates horns blasting is must see in a theaters!!"
  },
  {
    "rating": "5/5",
    "review": "The 25th anniversary of this in theaters was awesome! Easily one of the best movie theater experiences for me!"
  },
  {
    "rating": "5/5",
    "review": "This movie is the essence of the magic of star wars: podracers darth maul, duel of the fates! It’s epic and family-friendly. Just watch it, you wont regret it."
  },
  {
    "rating": "4/5",
    "review": "I have more love for this movie now than I did back then. A bright, action packed romp, great stuff!"
  },
  {
    "rating": "5/5",
    "review": "I dont care. I love this movie. The score, the duels. It's star wars. Nuff said."
  },
  {
    "rating": "2.5/5",
    "review": "All these years later, still middling."
  },
  {
    "rating": "5/5",
    "review": "Extremely underrated starwars movie that aged extremely well. Introduced characters that have lived on for 20+ years. Amazing music to go along with great action sequences. Jar jar was a solid comedy break."
  },
  {
    "rating": "3.5/5",
    "review": "Most underrated star wars movie. People just hate it whitout a reason."
  },
  {
    "rating": "5/5",
    "review": "Grew up watching this on repeat. Still go back to this 25 years later!"
  },
  {
    "rating": "5/5",
    "review": "25 years later, and this groundbreaking film has aged like a fine wine."
  },
  {
    "rating": "5/5",
    "review": "Just as amazing and awe inspiring as it was years ago."
  },
  {
    "rating": "4.5/5",
    "review": "I was in middle-high school in the 90s when this debut, and after all this time, I got to enjoy this movie again in the theater. Such nostalgia. My favorite of course are the characters who were played so well by their respective actors. It's my favorite movie of all the three trilogies... Its relatable tale which is smoother to follow appeals to me than the chaotic, multi plot stories of the other movies , which is the origin and discovery of Anakin and the conflict of the Tatooine and Gunggan armies battling the droids.. I also enjoyed seeing Naboo Tatooine, Corusant, and the Gunggan city on the big screen again...People can be whiney and unappreciative all they can, but its such an entertaining and re-watchable movie to a more imaginative person."
  },
  {
    "rating": "2/5",
    "review": "Ugh. I had forgotten how bad it is and that Jarjar is on the screen the whole time. Nostalgia is the ONLY thing that kept me in the theater"
  },
  {
    "rating": "5/5",
    "review": "I just finished watching this and it is a movie I will never forget. Not only do I think this is the best out of the prequels, but the acting and dialogue weren't actually too bad when looking at the more modern types of movies these days."
  },
  {
    "rating": "4/5",
    "review": "Come On, It’s Star Wars bro, I Love Star Wars, the fight scenes are great and all that, I understand why people don’t like it, but hey it’s still Star Wars."
  },
  {
    "rating": "4/5",
    "review": "Def not as bad ad people made it out to be. Think its aged well. One thing thats aged like a fine wine is the choreography"
  },
  {
    "rating": "4/5",
    "review": "First Star wars movie I watched as a kid, thoroughly enjoyed the adventure and drama-stricken battles along with the great score, not my favourite from the series, but still worth any star wars fans time."
  },
  {
    "rating": "5/5",
    "review": "The Phantom Menace gets so much hate I thought it was a good movie remember watching it in theaters what a blast I love the podracing scene and the lightsaber duel at the end of the movie I don't care what people have to say I love the phantom menace The road to the acolyte"
  },
  {
    "rating": "4.5/5",
    "review": "This Film gets far to much hate. It has moments of boredom (Pod Racing) but the action and thrill of an evil Darth Maul, someone actually dying when they get stabbed. It makes sense and its an integral part of SW."
  },
  {
    "rating": "3.5/5",
    "review": "I'm a Star Wars die hard so of course I went to see Phantom Menace for the re-release this previous weekend. It was the first movie I ever saw in theaters at 8 years old, I grew up with this movie but I'm aware of it's problems. Flat acting because George Lucas doesn't know how to collaborate with actors. Some unnecessary side plots etc. With that being said the light saber fight is iconic. The set up of what's to come is solid enough. I would say this movie is on par with the first Harry Potter movie which has the same age in mind for it's target audience yet people never hate on that movie for some reason. With all of that being said, in comparison to the original trilogy this movie isn't great. But on it's own it's not as bad as people pretend it is. 7/10 for me"
  },
  {
    "rating": "3.5/5",
    "review": "People hate this movie because it's childish but George Lucas himself admitted that it's a film for 12 year olds."
  },
  {
    "rating": "5/5",
    "review": "Was originally introduced to Star Wars from my mom watching the OG trilogy. I grew up with the prequels. Never hated it when it originally came out of the theatres. After 25 years, still enjoy seeing the prequel & OG trilogy on the big screen. There's just something about seeing Star Wars in a theatre."
  },
  {
    "rating": "2.5/5",
    "review": "25 years later and still same faults no personality no charm from McGregor Neeson and Portman Jake Lloyd can’t act and Jar Jar Binks is annoying Visually it is very good but should have been far better after having 22 years to perfect script"
  },
  {
    "rating": "3.5/5",
    "review": "25 years later we return to the theatre to watch this film, and The Duel of Fates still sounds amazing."
  },
  {
    "rating": "3/5",
    "review": "Um clássico com grandes problemas mas acertos agradáveis. Jar Jar Binks é bem desagradável e tira toda a quase seriedade que o filme tem. Darth Maul é um personagem icônico mas bem subutilizado. Tem uma das melhores cenas de sabre de luz e trilha sonora épica. Eu adoro a corrida de pod e defendo o quão empolgante é a cena."
  },
  {
    "rating": "5/5",
    "review": "Saw this on opening night in 1999 and then saw it 25 years later (last night) and I love it just as much today as I did in 1999. Beautifully executed sequences, incredible music, all new places and faces (and some familiar ones!). TPM was a glorious return to the franchise and something we'd waited to see for over 20 years - how did Darth Vader get his start? We get to see the shining citadel hiding the dark heart and rot that is taking over the Republic. Easily one of my top three Star Wars movies. (And had the best poster of the entire saga - the one with the shadow of Vader behind Anakin.)"
  },
  {
    "rating": "5/5",
    "review": "One of the best movies all time. This movie gets hate because fans of the originals have a superiority complex. But, if the originals were never made, they would have loved this film. The Dual Of Fates is one of, if not THE most iconic scene and music in the history of blockbuster cinema."
  },
  {
    "rating": "5/5",
    "review": "This movie is awesome, better than I remembered as kid especially in theaters. I never understood the hate for this one, Darth Maul is so cool and seeing the jedi in action is so sick. The pod racing scene was really cool too. I actually like the acting and the cgi, it created a really cool universe. Thanks George!"
  },
  {
    "rating": "4/5",
    "review": "a really good movie that slows down at times"
  },
  {
    "rating": "3.5/5",
    "review": "Returning to theaters for its 25th anniversary, The Phantom Menace is meant to be viewed on the big screen. The racing sequences and lightsaber battles are the best Star Wars content one can ask for. Unfortunately those are the only notable parts of the movie."
  },
  {
    "rating": "5/5",
    "review": "meesa love movie with a goober fish"
  },
  {
    "rating": "2/5",
    "review": "Every time I watch this film, I can't help to think of the 3 big mistakes George Lucas did (besides sitting in the director's chair for the whole prequel trilogy): 1) Jar Jar Binks as a main character and main topic of almost everything in the movie. 2) The casting of the dull and totally lacking of charisma Jake Lloyd as Anakin. 3) The minimum use of one of the coolest characters created in the SW universe... Darth Maul"
  },
  {
    "rating": "1/5",
    "review": "It's the most disappointing film of the entire franchise."
  },
  {
    "rating": "4.5/5",
    "review": "After the horror of \"Somehow Palpatine returned\" it really feels nice to return to the prequels."
  },
  {
    "rating": "2.5/5",
    "review": "It's one redeeming feature is that it is better than Attack of the Clones."
  },
  {
    "rating": "5/5",
    "review": "An extremely entertaining and engaging film beyond everything, looking back on it today, The Phantom Menace constitutes a solid work that gives rise in a good way to this already established science fiction saga."
  },
  {
    "rating": "0.5/5",
    "review": "Jar Jar Binks. Nuff said."
  },
  {
    "rating": "1/5",
    "review": "This is a terrible film though whilst most blame Jar-Jar, he's oscar-worthy compared to Jake Lloyd as Anakin who is just utterly hateful and ruins every scene he's in with sheer force of bad acting."
  },
  {
    "rating": "2/5",
    "review": "So starting off on the Star Wars month and welp, much as I say this for nearly everyone who's sat through as a kid and now today as an adult like myself, this movie was bad. Bad on it's own unique way. Tp be fairly honest, I give Jake Lloyd a lot more credit for his performance which it's even good that he's doing much better as an adult right now. No hate towards the actors but from the racial stereotype type of alien species to Jar Jar Binks, I really just despise. Pod racing was cool at first, but it does drag on for a while along with some parts of the movies. Of course, the lightsaber fights even between Darth Maul vs. Qui-Jon and Obe-Wan is still good to the visuals from Tatooine and the underwater world of Naboo are still really cool. Sadly, this is still considered one of he weakest of the Prequel Trilogy, but one of the bad Star Wars movies. 4/10."
  },
  {
    "rating": "2.5/5",
    "review": "Basically, it's remember the most scenes and in the case of the plot it's unpleasant."
  },
  {
    "rating": "0.5/5",
    "review": "I want to see it again...wait...\"what is me saying?!?\"....i dont want to see it again."
  },
  {
    "rating": "0.5/5",
    "review": "Bad. The casting of some characters and the writing was crummy"
  },
  {
    "rating": "0.5/5",
    "review": "A crushing disappointment in every single respect. I grew up with Star Wars, and this absolutely crushed that love. The plot is nonsensical. The characters are boring. The effects have aged poorly. And Jar Jar is simply one of the worst cinematic confections of all time."
  },
  {
    "rating": "3.5/5",
    "review": "Some acting and directing issues, but mostly enjoyable."
  },
  {
    "rating": "2/5",
    "review": "A suprisingly mediocre movie for such a loved franchise."
  },
  {
    "rating": "3.5/5",
    "review": "Not the Best SW but still great SciFi/Fantasy. And a good Introduction and Base in to a stable Universe (at the Time)"
  },
  {
    "rating": "3/5",
    "review": "I think the movie is fine but Samuel L Jackson is awesome in the movie and the negative things are the relationship between Anikan and Padme and of course Jar Jar Binks."
  },
  {
    "rating": "5/5",
    "review": "this was a really good movie that is hated on to much"
  },
  {
    "rating": "4.5/5",
    "review": "Darth Maul and the absolute silence during his entire bout is legendary. Young Anakin is wholesome as well."
  },
  {
    "rating": "3.5/5",
    "review": "the menace is phantom"
  },
  {
    "rating": "4/5",
    "review": "It's 2024 and 25 years later the social experiment of pretending to dislike this movie continues. It's like a shortcut to feeling seen. It's equivalent to asking someone about the weather. It's the laziest thing you can do in order to feel like you're part of an agreement between lazy people unwilling to make an effort."
  },
  {
    "rating": "5/5",
    "review": "he Star Wars movies are the best movie franchise ever made hands down! You will laugh and cry and some times at the same time with strong messages for humanity!"
  },
  {
    "rating": "2/5",
    "review": "Why can't George Lucas direct a film now? Produce, sure. Write, OK. Direct, please stop him!"
  },
  {
    "rating": "3/5",
    "review": "This movie had the potential to be great, think if they'd had showed a little bit of palpatine, maybe not reveal that it was palpatine but showed some of his training with Darth plagueis. The wise and hinted at Anakin's creation would have been cool, perhaps if Darth maul didn't die or if they had brought him back somehow would have been cool. He was very interesting character. Liam neeson should not have died but I understand for the story he had to but he was a great Jedi and it was awesome seeing him on screen as a Jedi. Jar jar Binks should not have been in the movie at all. His character lessened the movie quality. It took audiences out of the movie and he was so annoying and stupid looking and not interesting or funny. Some of the dialogue of the robots was ridiculous. We don't need battle droids, making jokes and talking about their 9:00 to 5 job. That's ridiculous. The whole pod racer scene was very campy and cheesy could have been done better. Anakin Skywalker was portrayed two campy and cheesy should have cast a different actor. This movie did have some of the best fight scenes between Darth maul and The Jedi. The frog people at the end that fought the battle droids were a little cheesy. I thought the frog people could have been a little bit more serious and less campy. The tones of this movie were all over the place. The story is very serious and there's a lot of death in the movie, but then there's a lot of silliness that didn't seem to sit right."
  },
  {
    "rating": "2/5",
    "review": "The prequel trilogy starts off with a misfire, the best part of the movie is defiantly the end, but without the ending, most of the movie is just talking with somewhat of a sense of direction."
  },
  {
    "rating": "4/5",
    "review": "This movie is very underrated. It has a pretty stacked cast, a decent plot of you're paying attention, and is far better than it's successor in my opinion. I am a lifelong, diehard Star Wars fan and even though many people in that community were against this movie, I still think it's a fun watch and also has one of the best lightsaber duels in all of Star Wars"
  },
  {
    "rating": "5/5",
    "review": "The only thing I found wrong with this movie was th CGI didn't age well. Other than that I legit don't know why people hate this one. The characters are interesting and seeing how Anakin lived as a child was refreshing especially knowing how he ends up in the later movies"
  },
  {
    "rating": "3/5",
    "review": "Ein recht unterhaltsamer an vorallem jüngeres Publikum gerichteter Film. Wie beim Nachfolger allerdings auch mit vielen hölzernen Dialogen. Der Film wird vorallem durch den spektakulären Endkampf zwischen Darth Maul und Qui-Gon sowie Obi-Wan gerettet. Dieser Kampf ist von der Choreografie her extra Klasse."
  },
  {
    "rating": "5/5",
    "review": "my favorite star wars"
  },
  {
    "rating": "3.5/5",
    "review": "7.0/10- Darth Maul was the best part of"
  },
  {
    "rating": "5/5",
    "review": "I watched a good action movie of the 20th century,,Star Wars 1-Episode''.This film tells the story of Jedi's teacher and his student. The world-famous movie can be downloaded and viewed via Google. However the two Jedi had to save the queen from the trading empire. They didn't wait for help because the senator was on the side of the evil empire. Two brave characters were able to save the queen, but the teachers killed the Sith. IIt's a very good movie that everyone will like. I liked the movie with its uniqueness. I would recommend everyone to see it."
  },
  {
    "rating": "2/5",
    "review": "This is a film that has sparked many discussions and divided opinions since its release. As a child, I found it fascinating but somewhat lacking compared to the original trilogy. Mr. Plinkett's review highlighted many valid points. I personally didn't like the overly polished nature of the film and the sense that the world didn't feel as lived-in as in the original movies. While it introduced new elements to the Star Wars universe, the movie didn't quite capture the same magic and grittiness that made the original trilogy so beloved."
  },
  {
    "rating": "1/5",
    "review": "I waited over 15 years to watch this garbage. The worst Sci-Fi character in history, a 5 year old who miraculously catches up in age with the 13 year old, bad bad bad. One of the biggest let downs ever."
  },
  {
    "rating": "1.5/5",
    "review": "What a disaster of a prequal kid acting is terrible but I try not to hold that against the kid terrible writting boring in general what was george lucas thinking?"
  },
  {
    "rating": "5/5",
    "review": "This is such a good movie! It wasn't the best of the prequels, but it was def better than Attack of the Clones."
  },
  {
    "rating": "5/5",
    "review": "cheong hor ivor:obi wan!! you need to stop darth maul!!"
  },
  {
    "rating": "3.5/5",
    "review": "This movie was actually pretty good. I don't know why people hate this movie, sure it has no meaning to the next movies, but it's still good. Darth Maul was a good villain, and Jar Jar binks could go put himself to sleep. Final rating, 3.5/5."
  },
  {
    "rating": "2/5",
    "review": "It suffers from bad direction and shockingly bad camera work. It can be watched to pass the time."
  },
  {
    "rating": "5/5",
    "review": "This is a great movie"
  },
  {
    "rating": "4/5",
    "review": "A great original story of Obi-Wan and Anikan. With the 3rd best lightsaber fight behind Episode 7's Luke v. Vader. This could have been better but overall I enjoyed the use of CGI and the movie overall. 8/10."
  },
  {
    "rating": "5/5",
    "review": "Loved it sad this movie got so much hate I miss George's star wars!"
  },
  {
    "rating": "3.5/5",
    "review": "Qui Gonn NOOOOOOOOOOOO"
  },
  {
    "rating": "2.5/5",
    "review": "Good movie? No not really. Fun watch for the memes? Yes absolutely."
  },
  {
    "rating": "3.5/5",
    "review": "too long for me but it's still something good, there's one of my favorite sw character, darth maul, it's not the best but it's good"
  },
  {
    "rating": "1.5/5",
    "review": "For a start to the Prequel Trilogy, it kinda sucks."
  },
  {
    "rating": "5/5",
    "review": "Love love love this! Great intro to a great story"
  },
  {
    "rating": "5/5",
    "review": "One of the best films of all time. Has great lightsaber fights and a compelling story"
  },
  {
    "rating": "3.5/5",
    "review": "Nice backstory for Anakin and excellent duel at the end. Bit boring at times"
  },
  {
    "rating": "5/5",
    "review": "it is one of the best star wars movie"
  },
  {
    "rating": "4/5",
    "review": "8.5/10 underrated af can not wait for the re release this may"
  },
  {
    "rating": "3/5",
    "review": "Action sequences and acting were good, but it just didn't feel like the originals."
  },
  {
    "rating": "3/5",
    "review": "It's a solidly ok movie. The fight at the end is amazing, but the rest is pretty meh."
  },
  {
    "rating": "3.5/5",
    "review": "I know many people were unhappy with this movie and I sort of agree with them to a point. I remember paying $ for movies that were showing the trailers of this movie and they excited me for this movie In anticipation of this movie like so many die-hard fans, I camped out for this movie for the week (well we were allowed to leave for work or school). I was so excited for this movie like no other. When I finally saw the movie at the midnight opening, I was pleased and not so pleased, but there were so many things that pleased me than disappointed me. The only thing that made me not like the movie was the acting. If the acting was as good as the original trilogy the movie would have been so much better. But it can't be changed. Now the things that pleased me were the story, the action, and of course the VFX. I am one of those people who loves special effects and to me, it improves the stories. To me, George Lucas' creative mind to create aliens and alien worlds is top-notch (just like James Cameron's with Avatar). This is something I felt was incredibly missing from the sequel trilogy, which felt more Star Trek than Star Wars. Throughout the prequels, Geroge created so many great alien civilizations. I especially love the Gungans and the society. I loved Jar Jar and he should have been seen more as the unlikely hero as he was portrayed but so many see him as just the bumbling idiot. The pod racing was the best part of the movie and I wished George would have had it more in the other prequels. The final battle was a little weak but the best part of it was the Duel between Kenobi, Qui-gon, and Darth Maul. But my favorite part of the movie is the story of a little boy on his journey to becoming the greatest villain of all time, with the help of the Jedi and of course with the help of Senator Palpatine's help as well. Many die-hard fans knew who he was and that he would become the Emperor but talking with non-die-hard fans when the movie came out, they did not realize or know who he was. The Phantom Menace deserves more respect than it has been given."
  },
  {
    "rating": "3/5",
    "review": "I think the movie is decent. The score is amazing, qui gon and Obi wan were brilliant, the cinematography was cool, and the podracing and action sequences were great. However, it isn't without its flaws. The CGI is not that good (it's 1999 cgi, but it was too much and it looks like a video game), the pacing is a bit too slow, and the dialogue was a bit dull at some times. I didn't really mind Jar Jar. I never hated him. He was sometimes funny, other times annoying or cringe. Still, not a bad movie, but it's definitely flawed. And I can't wait for the rerelease!"
  },
  {
    "rating": "4/5",
    "review": "Great quality, Rich story leaving a lot of room for whats to come"
  },
  {
    "rating": "5/5",
    "review": "Fun Characters, lays out why and how the empire came into existence, and best light saber battle in the Star Wars universe."
  },
  {
    "rating": "3.5/5",
    "review": "El paso del tiempo le hizo bien a esta película Buenas actuaciones y acrobacias Es buena? No me arriesgaría pero tampoco puedo calificarla de mala si la comparo con las creaciones de Disney Jar jar resultó ser mejor personaje que rey"
  },
  {
    "rating": "1/5",
    "review": "This is a terrible film. Wafer thin plot, bad script, the most stale acting I have ever seen, the most annoying character I have ever been subjected to who was on screen for about 2 hours of its bloated runtime. Most of the special effects are impressive and are the films only saving grace but some of the practical effects are really awful. The director George Lucas says The Phantom Menace is the first Star Wars film you should watch but how anyone can watch that film and have any desire to watch another one, let alone eight more of them, is beyond me. They can definitely only get better I suppose."
  },
  {
    "rating": "2.5/5",
    "review": "All right but it felt slow rushed, with some meaningless shots, to some horrible cgi (it was 1999 so its passes), but the darth maul sequence was fire"
  },
  {
    "rating": "1.5/5",
    "review": "Unbelievably disappointing..."
  },
  {
    "rating": "0.5/5",
    "review": "This movie just sucks, literally might be the worst movie I've ever seen"
  },
  {
    "rating": "5/5",
    "review": "I'm not doing this because I'm a big Star Wars fan I'm doing this because it's my thoughts about the movie this movie was amazing I don't care what people say about me the characters story was amazing too I like how darth maul blink once and survived his fall"
  },
  {
    "rating": "3.5/5",
    "review": "Absolute classic, I don't remember the transitions and CGI being this bad when i was younger though"
  },
  {
    "rating": "1/5",
    "review": "Everything sucked except Darth maul and the John Williams score, but granted, John Williams always does perfectly."
  },
  {
    "rating": "3/5",
    "review": "The script wasn't particularly boring or entertaining, and the acting was wooden and the story hard to follow. The CGI was decent, though, especially for the time."
  },
  {
    "rating": "5/5",
    "review": "I loved this movie when I watched it at the theater and still enjoy it to this day! Love the trilogy and the beginnings of the Skywalker saga!"
  },
  {
    "rating": "5/5",
    "review": "Um filmaço, que representa tudo aquilo que uma grande produção de cinema pode nos proporcionar. Fiquei impressionado com tudo. Neste site este longa levar essa nota tão baixa, mostra como alguns críticos e fãs tomam notas equivocadas sobre o assusto. Esse filme é cinema puro, uma obra de arte!"
  },
  {
    "rating": "5/5",
    "review": "I think it was a more fanciful tail than people was expecting, but still really enjoyed the story and action. I just wonder how long till people realize Jar Jar is a sith with the eyes he has and doing those supernatural jumps."
  },
  {
    "rating": "3/5",
    "review": "Nowhere near as bad as people made out. A good kids film."
  },
  {
    "rating": "2.5/5",
    "review": "While I do enjoy watching this film, it's not without flaws. First off, I find it hard to believe that the Trade Federation could invade Naboo, considering that their army consisted of some of the least threatening droids in existence. Also, Jar Jar is very clearly in the film just to appeal to younger kids. I think that they could have made the podrace a lot longer, and Darth Maul should have gotten more screen time, seeing as he's the most epic Star Wars villain there is. Lucas could have done better."
  },
  {
    "rating": "2/5",
    "review": "Pretty awful. Mostly shock and awe of special effects in battles and chases. Not enough plot and character development. I liked Portman's performance, that's about it. Throughout the trilogy, including this movie, Skywalker's devolvement into the villain he will become is not compelling. It lacks justification, depth, color. Even comic books do better. Too bad, there was potential for this to be one of the great character transitions in cinematic history."
  },
  {
    "rating": "2/5",
    "review": "Filme completamente CHATO com uma atuação ridícula da criança principal, é uma trama boba, tem um dos piores personagens já visto e criados por alguém e pouquíssimas coisas se salvam, até os mínimos momentos marcantes, foi completamente apagado por esse filme chato."
  },
  {
    "rating": "3/5",
    "review": "I LOVE Star Wars, but there are so many things that could have been better about this movie. It’s a mess of characters and plot and unnecessary fan service. THAT said, it’s so fun that I can absolutely understand how and why it has gained its own popularity. The Jedi Mind trick is to just turn off your brain and enjoy the ride."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie to start of anakins story and the plot was good and the fight scenes were really good and overall I think this film was a great start of the prequel trilogy"
  },
  {
    "rating": "1/5",
    "review": "literally the worst star wars movie"
  },
  {
    "rating": "2.5/5",
    "review": "My personal least favorite Star Wars prequel. The script and clunky dialogue seems to be the main problem in all of the prequels, but it is the most prevalent in this one. Jar Jar Binks and Young Anakin Skywalker are infamous among the Star Wars community, yet I don't really have any problems with either. The effects are amazing, and the music is great, and the world building really shows you a lot more about the Star Wars universe than the originals. I would recommend a watch."
  },
  {
    "rating": "2.5/5",
    "review": "After re-watching the OG trilogy, thought I'd give the prequels another chance. This is a frustrating one. With what was thought to be the next epic installment in the franchise, The Phantom Menace is a boring, poorly paced and generally uninteresting start to the Prequels. I actually dozed off and had to rewind it. It The story with Naboo and the trade dispute was obviously a way of introducing Anakin and acquainting him with Padmé, but everything else about it was so uninteresting. While there are definitely some good ideas, and some decent foreshadowing of things to come, the whole is not greater than the sum of its parts. The performances are decent. Liam Neeson is reliable as Qui-Gon Jinn and Ewan McGregor turns in a more limited but still impactful performance as Obi-Wan. I also have to give props to the acting from the younger cast members. The visual elements are overdone though. I understand the film came out over twenty years ago, so the CGI won't be as good, but goodness, it's just really bad in this. Nothing feels authentic. I wish George Lucas had used more practical effects as he did in the OT. John Williams does deliver a great score, but that's as far as my praise can go. These were always seen as divisive and I think I now remember why."
  },
  {
    "rating": "5/5",
    "review": "Appreciate the movie as part of a whole. Too many haters up in here; they're the classless ones."
  },
  {
    "rating": "4/5",
    "review": "This actually a pretty solid start to the prequels, a lot of praise for the fight scene at the end"
  },
  {
    "rating": "4.5/5",
    "review": "Far superior than the sequels. At least George Lucas took risks with this movie and tried to be original…"
  },
  {
    "rating": "2.5/5",
    "review": "I think that there were some good things about the Phantom Menace. Like Darth Maul's awesome dueling skills and his awesome lightsaber. Or Jar Jar practically being the biggest idiot on Naboo, or maybe the galaxy. Or the dramatic part when Qui-Gon fell to the ground. But there was also some bad parts. Like how the characters talk. They talk like nobody would talk. There's also a bunch of bangs and clashes every ten or twenty seconds. Anakin is also a really, really terrible actor. He talks like a baby, and he always seems sarcastic. And Anakin marrying Padme in Attack of the Clones doesn't make sense, because they were just friends in Phantom Menace. I'm just saying that the movie's terrible. If you think it's a good movie, I disagree, but I'm sure a lot of people also think that it's a bad movie."
  },
  {
    "rating": "5/5",
    "review": "It's star wars what do you expect"
  },
  {
    "rating": "3.5/5",
    "review": "The movie is kinda boring, but the characters are amazing"
  },
  {
    "rating": "3.5/5",
    "review": "The movie is long and drags but l, for those that love Star Wars, it brings in fantastical lightsaber duels and new lore that starts the Skywalker saga off in an humerus and whimsical way."
  },
  {
    "rating": "5/5",
    "review": "Still peak Star Wars"
  },
  {
    "rating": "4/5",
    "review": "This movie did not deserve all the hate it got. Yes the dialogue was wooden and jar jar binks deserves to die, but besides from that what you are left with is a movie with amazing music, races, and fight scenes. So i would say that although this movie could have definitely been better, it is still a pretty good movie."
  },
  {
    "rating": "3.5/5",
    "review": "It's not my favorite Star Wars movie but it's still good"
  },
  {
    "rating": "0.5/5",
    "review": "Ugggh. How can you make Liam Neeson into a wooden character? But they do! Skip all of these"
  },
  {
    "rating": "3/5",
    "review": "Watching the chronological sequence of the Star Wars saga. I have seen this one a few times. Good movie that sets the stage well for “follow-on” productions."
  },
  {
    "rating": "3.5/5",
    "review": "I Get that this Movie Disappoints with the Story being a little too slow and lacking the Storytelling Depth of the Original Trilogy, and the Politics are more of obstacles of the Plot and I still cringe at Jar-Jar Binks and some of the Anakin scenes, but Every Saga has a Beginning, and The Phantom Menace as flawed as it is, is still a worthy way to begin the Story of Anakin Skywalkers Journey, The Visual Effects have aged greatly, and the Battle Droids were very Photorealistic for 1999, but I kind of wish the movie was more about Obi-Wan's Beginning, and the Era of the Jedi, and I wish the Trade-Federation Story-line was more of a part of the Main Plot instead of being a Secondary Sub-plot, and I wish Anakin's origins was more of the minor Sub-plot. But this Movie is still a worth-a-watch and I'd recommend it as long you don't expect it'll live up to the original trilogy. 7.5/10"
  },
  {
    "rating": "1.5/5",
    "review": "My god, why do people like this movie? Every character is entirely wooden, not aided by some honestly pretty BAD acting performances, coupled with awful exposition-heavy dialogue, makes for an almost uncomfortable viewing experience. Jar Jar is incredibly annoying, and every other character is bland, at best, monotonous at worst. The plot feels entirely unfocused, with far too much time being spent on this planet for the sole purpose of obtaining spare parts for the ship. Yes, I am aware that this takes places in order for them to find Anakin, but the whole process feels contrived as all hell. Will still try the rest of the series, but on its own I would not recommend this movie."
  },
  {
    "rating": "5/5",
    "review": "Sem dúvidas o melhor filme da saga, assisti umas seis vezes, ficou perfeito!"
  },
  {
    "rating": "5/5",
    "review": "Padme was young and hot."
  },
  {
    "rating": "2.5/5",
    "review": "This was unbelievably Boring, I hate jar jar so much"
  },
  {
    "rating": "2.5/5",
    "review": "A Star Wars movie, but not much more. While the fight scenes are incredible, the characters are annoying and disappointing, and the pacing is ridiculous. Only worth watching to start the saga off."
  },
  {
    "rating": "5/5",
    "review": "great movie, easily worth the cost. anyone who hated it was either unhappy for anything past the first trilogy or too stupid to get it."
  },
  {
    "rating": "5/5",
    "review": "Good movie, The acting in this movie is incredible !"
  },
  {
    "rating": "3.5/5",
    "review": "Arguably the worst Star Wars, but despite its flaws, it's still an entertaining movie for the kids."
  },
  {
    "rating": "3.5/5",
    "review": "It's not the best part of the prequel trilogy, but it's still good movie, I really enjoyed the begging of the Anakin Skywalker, that is shown to be very strong with not only force, but intelligence/mind at a very young age. It also shows how powerful and equal were both fractions, republic and imperium."
  },
  {
    "rating": "5/5",
    "review": "Amazing Movie, made my childhood. Soooooo awesome !!!!! Us Kids loved it, but the Adults rated it."
  },
  {
    "rating": "5/5",
    "review": "If you don't like this movie, then we're not friends"
  },
  {
    "rating": "3.5/5",
    "review": "Achei o filme muito bom mas não é grande coisa comparado aos outros, o que faz ele ser um filme Ok de Star Wars. Não me incomodei com Jar Jar Binks ou alguns outros aspectos do filme, mas queria que tivesse mais trilhas sonoras na corrida de speeders, falando nelas, ótimas como sempre em Star Wars. Achei um pouco enrolado o filme e a batalha final por mais que boa, não foi tão longa ou épica, mas pra mim, foi muito boa e tem sua importância, acho que os atores foram bem e que é não é um mal inicio para se contar a história de Star Wars. Mas acredito que grande parte do desgosto do público veio por conta do hype que foi gerado no filme, Star Wars 16 anos depois e todos esperavam algo épico e inesquecível como foi a trilogia original, infelizmente não foi assim, mas definitivamente não é um filme ruim ou o pior de Star Wars, eu recomendo a fãs de Star Wars e para quem tem interesse em começar a assistir a série, essa é minha crítica."
  },
  {
    "rating": "3/5",
    "review": "I was deeply disappointed by the prequels. At least Darth Maul was in this one."
  },
  {
    "rating": "2.5/5",
    "review": "I like this movie because again of nostalgie, this movie was my favorite star wars as a kid, but now... not so much but it has a special place"
  },
  {
    "rating": "3/5",
    "review": "When I was my younger brothers age I really liked the star wars movies, and I want to show to show him the movies, so I started with his one. He didnt care at all, it was confusing to him what a trade embargo and an intergalatic federetion was, and what are ambassedors. he was bored and so was I, so we just played the lego game instead."
  },
  {
    "rating": "5/5",
    "review": "What an amazing foundation to the saga, you begin to understand better what is really happening in episode 4."
  },
  {
    "rating": "4/5",
    "review": "While there were some controversial performances, the phantom menace makes up for it's lackluster plot with an amazing cast and fx."
  },
  {
    "rating": "2/5",
    "review": "Vary annoying characters. And the story is very flat"
  },
  {
    "rating": "2/5",
    "review": "This movie is just… not good. It's not garbage, it's not unwatchable, but it's just so… soulless. This film is devoid es of any emotion. And Jar-Jar Binks 😬"
  },
  {
    "rating": "2/5",
    "review": "Meh, it passed the time"
  },
  {
    "rating": "3.5/5",
    "review": "The worst movie out of the prequel trilogie but stil a great beginning for the star wars franchise (in the timeline) i enjoyed it"
  },
  {
    "rating": "4/5",
    "review": "A surprise, to be sure, but a welcome one Heavily underrated and overhated.. I actually liked Jar Jar Binks. Action 8/10 Story 5/10 Dialogue 8/10 Choreography 8.5/10 Duel of the Fates 100/10 Music 11/10 Padme 11/10"
  },
  {
    "rating": "1.5/5",
    "review": "The lost me with the 1-2 punch of Midi-chlorians and Anakan building C-3PO (in the much better Heir to the Empire series of books C-3PO and Lando go to the factory moon where he was built) and it went downhill from there. Jar Jar, \"roger roger\" and the \"tension\" around whether or not Sebulba was going to \"kill Anaken - AKA the future Darth Vader\"."
  },
  {
    "rating": "3/5",
    "review": "A decent addition to the franchise that does a better job of exciting long-time fans with its expansion to the world building than telling a story captivating for all audiences."
  },
  {
    "rating": "5/5",
    "review": "Duel of the fates score is fire!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Alright. Hot take. 2nd best Star Wars movie. For the most reason, the movie is fun, entertaining, and does an awesome job bringing in the storyline of Obi Wan and Anakin. Great acting, though Qui Gon was a great character only used for one episode. He should get a stand-alone series, definitely. Another reason is Darth Maul is a badass character with first seen dual bladed lightsaber with super athletic moves which makes him the best Star Wars villain! The fight scenes are iconic and just probably the best we seen."
  },
  {
    "rating": "2.5/5",
    "review": "This is probably one of the few times I write, The Phantom Menace has good moments but sometimes it has some downturns that kill everything. Likewise Darth Maul is an iconic antagonist and I adore him"
  },
  {
    "rating": "3/5",
    "review": "Sudden start and stop. Middle could dwell less on Jar Jar Blinks. Some iffy logic. Cute Padme. Surprisingly okay after having seen the later movies. 6/10."
  },
  {
    "rating": "4/5",
    "review": "I think time has been kind to this. Look it has problems (especially where the overly juvenile humor is concerned) but it's still compelling in its exceptional action sequences, Williams' score, and Lucas' fascinating and seemingly endless supply of film references."
  },
  {
    "rating": "2.5/5",
    "review": "I think The Phantom Menace is better than Attack of the Clones; simply because its an easier watch and a little more entertaining. The plot is quite slow at times, and not every character delivers, but their is a cohesive story that pays off in a mildly satisfying final battle and a very satisfying lightsaber duel. Jake Lloyd struggles in here for sure, but overall I'm having a good time, even if the film is far from top-notch cinema."
  },
  {
    "rating": "3/5",
    "review": "Star Wars: Episode I - The Phantom Menace feels like the oddball of the franchise, yet I can't bring myself to hate it."
  },
  {
    "rating": "5/5",
    "review": "Começaram com o pé direito na 2ª trilogia."
  },
  {
    "rating": "3/5",
    "review": "The Phantom Menace for me is the weakest film of the original 6 movies, but that doesn't mean the movie is awful. I hardly find myself watching it— and is unfortunately the most boring, especially the first hour of the film, still. The story is good but could've been executed better than it was."
  },
  {
    "rating": "4/5",
    "review": "great movie. (except jar jar) idk why theres so much hate on this movie its done so much good stuff, i love this movie so much tbh and i really liked the senate scenes. AND DUEL OF THE FATES BRO john williams is invincible at this point. overall a 8/10 for me"
  },
  {
    "rating": "1.5/5",
    "review": "Star Wars nunca foi conhecido por ter roteiros incríveis e direções fenomenais, no entanto, suas histórias sempre foram cativantes, um universo interessante e personagens bem construídos, isso é algo que se perdeu totalmente no \"Ameaça Fantasma\". Esse longa é além de decepcionante, visualmente falando é feio, artificial demais, sem direções inventivas ou minimamente precisas. George Lucas é um excelente contador de história, mas como diretor e roteirista, é péssimo, e isso fica explicito principalmente nos diálogos cafonas e sem inspiração alguma entre os personagens. A história que normalmente deveria ser o ponto alto, aqui é chato e confuso, envolvendo uma trama política completamente perdida no roteiro, algo que só iria melhorar de fato no Episódio III da franquia."
  },
  {
    "rating": "3/5",
    "review": "Some of the CGI has aged terribly and the diolog is stunted, but Phantom Menace still offers a decent story with enough heart to invest in."
  },
  {
    "rating": "3.5/5",
    "review": "I enjoy this movie more than others I think. The only real problems I have are minor, and it has to do with the end. And I still think the ending was good, just minor things seemed force. For example, Obi Wan did not need to hang on the ledge that long at the end. Also, the death of Darth Maul was so lame. In fact, I think he was severely underused. Everything else was good."
  },
  {
    "rating": "2/5",
    "review": "Good movie but boring in many places. 4.4/10"
  },
  {
    "rating": "4/5",
    "review": "This movie is good and very underrated."
  },
  {
    "rating": "5/5",
    "review": "This film doesn't get the praises it deserves"
  },
  {
    "rating": "5/5",
    "review": "Everything about STAR WARS EPISODE I: THE PHANTOM MENACE by George Lucas is PERFECTION with unbelievable Directing, Acting, Dialogue, Writing and the beautiful CGI and you can't leave out the wonderful Score by the great John Williams. This film should have won Best Picture in the Academy Awards along with other Categories. EPISODE I is a better STAR WARS film than all Disney Star Wars films combined."
  },
  {
    "rating": "4/5",
    "review": "George Lucas brought to the screen his vision, and to me, there is something so beautiful about seeing a director's vision come to life, even if it's terrible."
  },
  {
    "rating": "3.5/5",
    "review": "A good idea was screwed up by poor writing and Jar Jar Binks. So much wasted potential."
  },
  {
    "rating": "3.5/5",
    "review": "Afet a long wait like many others I was excited to see some new Star Wars. Acting was ok, special effects usual high standard, story ok, but what was Jar Jar Binks all about?"
  },
  {
    "rating": "4/5",
    "review": "The Phantom Menace is an enjoyable film. It's a little slow at times but I liked it. When the action gets going in the final act of the movie, it is truly epic."
  },
  {
    "rating": "2.5/5",
    "review": "The Phantom Menace, while boasting impressive visual effects, struggles with lacklustre storytelling and questionable acting, making it a mediocre entry that fails to recapture the magic of the original trilogy."
  },
  {
    "rating": "2.5/5",
    "review": "Over hated good besides jar jar binks"
  },
  {
    "rating": "5/5",
    "review": "\"Star Wars: Episode I, The Phantom Menace\" Of The Year 1999, For Me Is So Fresh, The Beginning Of The Saga Of The Saga Of \"Star Wars\" The Invasion And The Battle Of Naboo, Years Before Of The Final Battle Of Exegol In The Rise Of Skywalker The Best Of The Movie \"Duel Of The Fates\" Of \"John Williams\" 🎵 \"Obi-Wan Kenobi\" \"Qui-Gon Jinn\" VS \"Darth Maul\" I Am Fan Of The Saga Of \"Star Wars\" May The Force, Is Be With You, Always 🎬⭐"
  },
  {
    "rating": "3/5",
    "review": "Star Wars è a metà tra il banale ed il decente: scene d'azioni spettacolari, ma personaggi vuoti come sacchetti"
  },
  {
    "rating": "3/5",
    "review": "Bad acting, bad dialogue, too much contents that are unnecessary for the plot."
  },
  {
    "rating": "5/5",
    "review": "One of the best of the best."
  },
  {
    "rating": "3/5",
    "review": "What's sad is that reading Darth Plagueis and Shadow Hunter made this movie so much more interesting. Yoda looks terrible. Last fight is fantastic. Besides that, meh."
  },
  {
    "rating": "5/5",
    "review": "Even though it's the worst in the true star wars films, it still beats anything Disney has done"
  },
  {
    "rating": "3.5/5",
    "review": "its ok. Kinda bored sometimes"
  },
  {
    "rating": "3/5",
    "review": "Honestly really good quite slow but really elevates at the end. Not to mention the fighting is just peak"
  },
  {
    "rating": "4.5/5",
    "review": "The definition of Star Wars. Not too serious, maybe a little too comedic, however. The villain does feel underdeveloped but the lightsaber duels and soundtrack are amazing."
  },
  {
    "rating": "3.5/5",
    "review": "An otherwise disappointing film only partially elevated by visual splendour a d a few decent action scenes"
  },
  {
    "rating": "3.5/5",
    "review": "One of the better star wars movies in my opinion with it as the beginning star wars movie ave showing anikin as good."
  },
  {
    "rating": "3/5",
    "review": "I don't hate the movie, however I can't say I fully enjoyed it either. First of all small Anakin and Jar Jar Binks kind of ruined the movie for me personally. The reasoning for giving this a positive review is the fight between Darth Maul and Obi Wan and Qui Gon Jinn. AND THE THEME MUSIC HOLY SHIT. The opening scene with Obi and Qui Gon is epic and really displays the power of Jedi. The rest of the movie is kind of boring and it gets minus points for pod racing, because that damn level on the game \"Lego Star Wars complete saga\" put me into deep depression. However the movie made up for it with the quote: \" there is always a bigger fish\". Overall pretty average"
  },
  {
    "rating": "2/5",
    "review": "Even Ewan McGregor couldn't save this steaming pile of crap."
  },
  {
    "rating": "2/5",
    "review": "Not a fan tbh, the story is just not that good, the acting is okay and Darth mall is a good villain, but the film still falls flat."
  },
  {
    "rating": "0.5/5",
    "review": "It was really boring, burdened by overexplaination (for things that I really didn't want explained) and a lot of the jokes broke the illusion that I was in outer space. The writing was also pretty weak. I do understand why some people liked it though, as it is definitely pretty nostalgic. The lightsaber fight at the end was really well put together though, and Liam Neeson and Ewan McGregor both carried out great performances. Also, the CGI was pretty when it wasn't overdone. Jar Jar is a common reason why people don't like the movie but personally for me, I think I would like it even less without him. I feel very bad for all the hate Jar Jar's actor got and Jake Lloyd."
  },
  {
    "rating": "3/5",
    "review": "Not enough Darth Maul. Not a fan of the CGI"
  },
  {
    "rating": "4/5",
    "review": "This movie looks a lot better since the release of the sequel trilogy."
  },
  {
    "rating": "2/5",
    "review": "The highest of my prequel ratings, because it takes its time to start slow and build something."
  },
  {
    "rating": "3.5/5",
    "review": "Just so no one gets confused I'm watching these for the first time but i am watching them in the episode order instead of the order they were released. My thought on this episode is that the pacing is a bit slow but it really does pay off in the end with the battle between Qui-Gon Jinn and Obi Wan facing Darth Maul which i quite enjoyed and Jar Jar Binks mad me laugh quite a bit at times to. I did not want to give a really high star rating just in case there are better ones ahead. So this might change depending if i like any of others better than this one."
  },
  {
    "rating": "3/5",
    "review": "Cast your mind back to May 1999. You may remember quite a buzz of excitement in the air. The world was awaiting the release of a new edition to the Star Wars saga, 16 years after it ended. To put it mildly, The Phantom Menace had a lot to live up to. It may yet go down in history as the most divisive film of all time. As often parodied, it split Star Wars fans down the middle. No one could deny that the effects were superb, flawless even. But what bothered many was the clunky dialogue, the wooden acting and the fact that it didn't seem to belong in quite the same world as the series which shares its name. My main problem with the Phantom Menace is that I'm relatively indifferent to it. It's not awful by any means, in fact it has many redeeming features (but no where near enough to make it a great film). The visuals were the best in the world at the time of the film's release, and still hold up today. The realization of Coruscant, the \"capital of the galaxy\" in the form of a planet-wide city is an interesting idea, as is the Gungan's underwater \"bubble city\" and both look sensational. The film also has two stand-out action sequences - the pod-race, a creative, heart-thumping Ben-Hur tribute, and the \"duel of the fates\" which forms the finale of the film. This three-way lightsaber battle between a young Obi-Wan Kenobi (Ewan McGregor) and his master Qui-Gon Jinn (Liam Neeson) against the formidable Darth Maul (Ray Park) wielding an iconic double-bladed lightsaber. This has to be among the finest fight scenes of all time - the choreography is extremely creative and the execution flawless - it's a real testament to the stunt crew working on the film. Brilliant visuals and two memorable scenes cannot save a film, however. The story isn't up to much, and you don't have the high stakes of the original films - you know who's going to survive, it being a prequel to the original series. Lucas has never been great at dialogue, but during his Star Wars prequels, he seems to become worse at it over time. In the Phantom Menace you can look forward to such gems as Obi-Wan's \"do not defy the council master, not again\", young Anakin's \"Are you an Angel?\" speech, Yoda's classic \"how feel you?\" and pretty much everything said by Jar-Jar Binks. Ah Jar-Jar Binks - no other three words send shivers down the spine of a Star Wars fan so effectively (accept maybe a debate into who shot first). He's a truly irredeemable character - narratively unnecessary, insulting, and very, very annoying. The other actors and their characters are either unremarkable (MacGregor, Lloyd and Portman) or look thoroughly embarrassed to be on screen (I'm talking about you, Mr Neason). The Phantom Menace is a disappointment, but in truth, it could never live up to Star Wars fans' high expectations, but it's good for providing the odd cheap thrill. And John Williams' scoring for the series is still great."
  },
  {
    "rating": "3/5",
    "review": "It had good moments but very disappointing"
  },
  {
    "rating": "4.5/5",
    "review": "Despite its flaws, it's really not that bad of a film; this movie has a lot of excellent moments. There is indeed a sense of discovery in scene after scene of The Phantom Menace. This is George Lucas trying something new, and I applaud him for that."
  },
  {
    "rating": "4.5/5",
    "review": "This was an amazing movie the only thing letting it down was Jar Jar Binks. Not to say that I don't like him I do but he can get somewhat annoying. Liam Neeson as Qui-gon chefs kiss cause damn he's an amazing Jedi. The Battle of Naboo was incredible."
  },
  {
    "rating": "4/5",
    "review": "It's not bad but it's a slow passed movie and it doesn't have that much fighting till the end"
  },
  {
    "rating": "3/5",
    "review": "Average..."
  },
  {
    "rating": "3/5",
    "review": "The worst of all the Star Wars movies to date. Was always going to be tough ask, but some wooden dialogue, bad acting and the overuse of CGI takes away from a movie that does have some great scenes."
  },
  {
    "rating": "1/5",
    "review": "Just a mess in every aspect"
  },
  {
    "rating": "3.5/5",
    "review": "Pacing could be a lot better"
  },
  {
    "rating": "0.5/5",
    "review": "Horrible effects, clunky dialogue and a jarring story."
  },
  {
    "rating": "2.5/5",
    "review": "A boring movie, there's little to no action and the characters are pretty bland, especially Jar-Jar, who is the most annoying character I have ever seen."
  },
  {
    "rating": "2.5/5",
    "review": "This movie was kind of weak Jar Jar Binks was a bad character. Boring story it jumps every where. I like DUEL OF THE FATES But kid Anakin was also bad wish I could say more"
  },
  {
    "rating": "5/5",
    "review": "Absolute masterpiece of cinematography. Provides the ultimate background of the prequel movies and perfectly sets up the rest of the movies. Provides iconic lines and scenes. 10/10 must watch"
  },
  {
    "rating": "3.5/5",
    "review": "Jar Jar Binks is a sith lord"
  },
  {
    "rating": "4/5",
    "review": "Star Wars: Episode I The Phantom Menace is a polarizing entry in the iconic franchise that had lofty expectations to live up to its predecessors. Director George Lucas returns to the galaxy far, far away with a visually ambitious film that showcases groundbreaking special effects and epic set pieces. However, the film is burdened by convoluted plotting, wooden performances, and an overemphasis on CGI that often overshadows the heart and soul of the original trilogy. While Ewan McGregor brings charisma to the role of Obi-Wan Kenobi and the introduction of Darth Maul injects a much-needed dose of menace, the film sometimes struggles to capture the magic and depth of its predecessors. Despite its flaws, \"The Phantom Menace\" remains a noteworthy addition to the Star Wars saga, offering moments of spectacle and nostalgia for die-hard fans, but leaving a sense of disappointment for those seeking the narrative coherence and emotional resonance that made the original trilogy so beloved."
  },
  {
    "rating": "2/5",
    "review": "Just rewatched this as a father of 2 young boys. And Oh My God! Who is this for? They didn't understand Jar Jar's garbage either. It was embarrassing introducing them to this."
  },
  {
    "rating": "3.5/5",
    "review": "Phantom Menace is one of the more controversial Star Wars movies with half the fan base loving the movie and the other half absolutely hating it. Honestly, it depends on how old you were when you watched the movie. The movie appeals to the younger audience who stay connected to the movie, while the older you are when you watch the movie the less you like it. Though, the movie has its flaws, its high points are amazing. The duel of fates and the lightsaber duel that follows stays to date on of the best movie sequences of all time. It is a enjoyable-albeit long watch."
  },
  {
    "rating": "4.5/5",
    "review": "It took me 23 years to finely see it. I loved it."
  },
  {
    "rating": "2/5",
    "review": "No recuerdo ir con mas ilusión al cine y salir mas decepcionado que con esta película, la pelea final esta bien... nada mas. De todos modos si la comparamos con The Last Jedi esta parece una obra maestra y Jar jar Bin el mejor personaje de la historia."
  },
  {
    "rating": "3.5/5",
    "review": "If for nothing else than the pod racing segment (sans the commentators) and the Duel of the Fates segment. other than that, it was impossible to live up to the hype and overall promise of a new Star Wars story"
  },
  {
    "rating": "5/5",
    "review": "Really fun movie for the whole family."
  },
  {
    "rating": "4/5",
    "review": "\"The Phantom Ménage\" pode não ser o melhor filme da franquia, mas é algo que todos nós podemos ver e dizer que é um filme de Star Wars."
  },
  {
    "rating": "3/5",
    "review": "it might be mid but it certainly is a star wars movie"
  },
  {
    "rating": "5/5",
    "review": "From hero to villain, the childhood of one of the most popular characters in the public."
  },
  {
    "rating": "1/5",
    "review": "it was cool but super boring"
  },
  {
    "rating": "4/5",
    "review": "This movie fulfilled the important task of showing us the beginnings of both the Star Wars cinematic universe and of Anakin Skywalker. It is not a movie without flaws, but it enjoyable to watch (especially the lightsaber duels)."
  },
  {
    "rating": "4/5",
    "review": "My first Star Wars movie. Despite what other people say i really enjoyed it. Yes it has it's flaws, but there is not that many of them."
  },
  {
    "rating": "1.5/5",
    "review": "'The Phantom Edit' cut of this film saved it from being unwatchable. As a film this is bad. As a star wars film the Darth Maul fight is cool and so is the first 10 minitues but apart from these secenes...what happened Lucas?"
  },
  {
    "rating": "2.5/5",
    "review": "O filme é bom com bons personagens ,mas os diálogos e batalhas não são dignas de Star Wars, o personagem Jar Jar Binks é um personagem ridículo e sem sentido. Traduction: The movie is good with good characters, but the dialogues and battles are not worthy of Star Wars, the character Jar Jar Binks is a ridiculous and pointless character."
  },
  {
    "rating": "2.5/5",
    "review": "A Star Wars film that I feel is definitely a little over-hated. There are still definitely problems with it, like the movie being way too long for it's own good. You definitely feel the run time. Had they cut out a good 15-20 minutes, I feel the story could have been a lot tighter and flowed much better. Jar Jar actually isn't even all that bad, definitely don't understand the hate he got, and some of the action was pretty good. Especially the sequence with Darth Maul. George Lucas should have definitely told the story in a different way though, as the movie is just simply boring at times and you just want to to get moving in some scenes."
  },
  {
    "rating": "5/5",
    "review": "Definitely my all time favorite movie."
  },
  {
    "rating": "5/5",
    "review": "I love this episode of Star Wars as you meet a lot of the characters for the first time and the Esquire Theater is so cozy and comfortable. Will be back."
  },
  {
    "rating": "3.5/5",
    "review": "It's a good movie but slow when their on Tatooine and I liked Jar Jar Binks the ending was perfect it's not that bad as people say it is"
  },
  {
    "rating": "3.5/5",
    "review": "It just never gets old! In 2023, it was the third or fourth time I watched this. But the previous time - in 2020 - I wasn't as enthused. This time, watched in a less critical, more fanboy mode."
  },
  {
    "rating": "3/5",
    "review": "A pretty underrated title. Still would prefer any of the OT movies but still a good one. I really like Maul and Qui-gon. I wish they built Qui-Gon more."
  },
  {
    "rating": "5/5",
    "review": "What? Such a low rating score on rotten tomatoes? Can somebody explain to me how a movie made in 1999 is still better than 90% of the movies made today? And I'm not one of those people that automatically likes everything that says 'Star Wars\" on it and I'm also not one of those people who just likes old movies and hates everything new... It's JUST A GOOD MOVIE and it was made 24 years ago... It's just a bunch of dolls, people with makeup, funny clothes and primitive computer effects (compared to modern technology, where everybody has computers in their pockets...) Amazing movie! One of the best i have ever watched!"
  },
  {
    "rating": "5/5",
    "review": "The greatest 02 hours: and 13 minutes ever!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Pretty good minus a few lines of dialogue and the stupid midi-chlorian thing that is never again talked about throughout the rest of the movies."
  },
  {
    "rating": "5/5",
    "review": "I love this movie so much. It is my favorite Star Wars movie. Qui Gon is a great character and Liam plays him excellently. Jar Jar is amusing and enjoyable. Everyone really exaggerates on him being annoying. The political side of events is really interesting to see, not everything in Star Wars is \"pew pew, bang bang\" and it's nice to see inter-workings of the political mechanism of the republic. Little Anakin is great, makes you fall in love with this person you know is destined to commit absolute atrocities. Also pod-racing is dope."
  },
  {
    "rating": "1.5/5",
    "review": "Boring until the final battle"
  },
  {
    "rating": "2.5/5",
    "review": "STAR WARS: EPISODE I - THE PHANTOM MENACE is a mediocre start to the Prequel Trilogy."
  },
  {
    "rating": "3.5/5",
    "review": "If you can get past Jar Jar, this is a great introduction to the Star Wars universe. There are a few slow moments, but those slow moments are overcome by great performances by Ewan McGregor, Liam Neeson, and Ray Park. The Podrace sequence and final battle between Obi-Wan, Qui-Gon, and Darth Maul make this a worthy inclusion in this series."
  },
  {
    "rating": "1.5/5",
    "review": "Solid performances from Liam Neeson and Ewan Mcgregor aren't enough to save a movie full of lackluster characters, bad pacing, and strange story choices. Duel of the Fates is awesome though."
  },
  {
    "rating": "3/5",
    "review": "The worst star wars movies I watched(I only watched episodes 1,2,4,5 and 6)"
  },
  {
    "rating": "3/5",
    "review": "By far the worst star wars movie, the phantom menace has the star wars feeling but not the brilliant writing."
  },
  {
    "rating": "4.5/5",
    "review": "Overhated, definitely worth the watch"
  },
  {
    "rating": "3.5/5",
    "review": "Appreciated the world building and the establishment of the origins for the Original Trilogy. The combat was wonderfully choreographed and helped create some awesome scenes."
  },
  {
    "rating": "4/5",
    "review": "I really like this movie don’t get why people don’t like it"
  },
  {
    "rating": "4/5",
    "review": "Momentami głupiutko-familijny. Ciekawy świat i zróżnicowana akcja. Graficznie zestarzał się mniej niż sądziłem. Czasem topornie machają mieczami"
  },
  {
    "rating": "3.5/5",
    "review": "I am not sure why this movie is rated so low I think it is a great start to the beginning of such a legendary Movie series. good introduction to characters don't like JarJar binks but glad they later phased out. The Racing scene is good for the whole movie to watch. Alot of the Graphics and animation really pulls through and makes things really pretty."
  },
  {
    "rating": "4/5",
    "review": "Great depiction of Jedi through Qui Gon Jinn and Obi Wan Kenobi characters along with the Sith through Darth Maul. The pace wasn't great, a lot of focus on the princess and Anakin wasn't great either. But the space battles, Light Sabers duels and the loss at the end still makes for a great movie."
  },
  {
    "rating": "2.5/5",
    "review": "There is as much right about this as there is wrong. It's a 5 out of 10, but it could be slightly better (maybe a 6), if re-edited and tightened up. Although I really dig the creepy backdrop of a Sith puppeteer, destroying the galaxy...the execution is needlessly chatty. Perhaps it would've been better to have no dialogue in some of the places where it comes across clunky. At least we would be able to use our imaginations rather than have the redundant awkward explanations slap us in the face."
  },
  {
    "rating": "3.5/5",
    "review": "The first film of the prequel trilogy is a worthy Star-Wars film. It doesn't give the best story or special effects, but the excitement and tension of stand-out moments make this movie enjoyable nonetheless. Rating: 63%"
  },
  {
    "rating": "5/5",
    "review": "I had the fortune to see this as a six year old and I still love it."
  },
  {
    "rating": "5/5",
    "review": "One of the most memorable and impactfull movies of my childhood and I still love it."
  },
  {
    "rating": "3.5/5",
    "review": "Such an underrated movie. If you thing about watching it, dont look to critics, it deserves way higher than %59. Sure it has some flaws like jar jar binks but in overall its realy good movie. And i suggest to watch chronogical order to start Star Wars Saga."
  },
  {
    "rating": "4/5",
    "review": "I grew up loving the prequel films and have come to appreciate them even more after Disney's glorified fan-fiction trilogy was made. This film is key in setting up a 6 film character arc of redemption that works to create one unified story. It can get bogged down in politics, but George wonderfully fleshes out the universe he created. There are lots of new fresh, new ideas that fit with the timeline of the original trilogy."
  },
  {
    "rating": "5/5",
    "review": "I give this movie a 10/10 because I watched SW in timeline order and I wanted to know the story so that's what I did and I enjoyed watching this movie because it introduces me to Obi-Wan (fav SW character) and Anakin but it you watch the originals first they'll leave you with many unanswered questions but I wanted to really know SW and not be confused. Action, I really like the action especially the final fight on Naboo. Acting, I think that the acting was perfect especially Qui-Gon and Obi-Wan and they are also both well written characters. CGI is great, CGI got really good towards the end of the 90s. Villain, I like both Sidious and Maul but I think that Maul could have been a bit better in the movie are obvious reasons. Writing, I like the writing because for my first SW movie watched the writing was really good. Story, is perfect because it really starts off the SW story line perfectly. Casting, I think that the casting is perfect Ewan McGregor, Liam Neeson, Natalie Portman, Samuel L. Jackson are perfectly casted. Characters, is perfect no explanation needed. Adventure, for my first SW movie I think that the adventure is perfect because I've never seen anyone travel though space. Ending I think that the ending is perfect but I really liked Qui-Gon he didn't deserve to die but he would have in another project but other than Qui-Gon's death the movie is perfect."
  },
  {
    "rating": "3.5/5",
    "review": "The Phantom Menace is freaking underrated! And yeah.. I know the plotline is easily bumpy and boring, but there are things that you can't get your eyes off of it: The fast-paced choreography, especially the lightsaber duel between Obi-Wan, Qui-Gon and Darth Maul, is truly insane. The prequels are might be hated. However, the origin of Anakin and how the war started is absolutely beautiful. 7/10."
  },
  {
    "rating": "4.5/5",
    "review": "As someone who wasn't previously a big fan of Star Wars, I decided to give the series another chance and watch all the movies from the beginning. Going into The Phantom Menace, I had fairly low expectations based on reviews and my own recollection of the film. However, I was pleasantly surprised by how enjoyable it was to watch. While it may not be the best Star Wars film out there, The Phantom Menace offers plenty of exciting moments and an intriguing storyline that kept me engaged throughout. I found myself invested in the characters and their journeys, even if some of the dialogue and acting was a bit stiff at times. Overall, I would highly recommend giving The Phantom Menace a chance, even if you're not a diehard Star Wars fan. It's a fun and entertaining movie that exceeded my expectations and left me eager to continue my journey through the rest of the series."
  },
  {
    "rating": "2.5/5",
    "review": "How the mighty have fallen."
  },
  {
    "rating": "5/5",
    "review": "Duel of the fates is epic, good story"
  },
  {
    "rating": "5/5",
    "review": "In 1999, I was 10 years old and already a huge star wars fan. This movie to me , had everything! and is much better than the sequel trilogy we got today."
  },
  {
    "rating": "5/5",
    "review": "I loved the fight scenes and action sequences. I really don't see why it's so hated. Like, there's a reason why this movie made 1B dollars."
  },
  {
    "rating": "5/5",
    "review": "My family and I have been huge fans of STAR WARS for a very long time. To be able to be a part of a galaxy far, far away is truly an amazing experience, all thanks to the incredible imagination of George Lucas. If you want to be a part of a sci-fi universe where you can go to places that you've never been to before, then STAR WARS: THE PHANTOM MENACE will help get you started."
  },
  {
    "rating": "3/5",
    "review": "The movie has amazing scenes like the Qui-Gon and Obi-Wan vs. Darth Maul duel and pod race on Tatooine. However, most of the movie is flawed with boring sequences, mediocre cgi, and below par storytelling"
  },
  {
    "rating": "2/5",
    "review": "My first ever Star Wars media i have watched , and let me say it's pretty boring . I only like a couple characters , Padme,Maul, Obi, and whoever Obi's master is. I like the end though."
  },
  {
    "rating": "3/5",
    "review": "I kicked off my Star Wars rewatch with Episode 1 The Phantom Menace. This movie is a very complicated movie to judge. Part of me values this movie mode then most due to the extreme amount of nostalgia I have for the Prequels. Whereas part of me sees the horribly written dialogue and struggles to give this a good rating. I decided to go into this completely open minded and with a movie critic mindset. People don't talk about the world-building in The Phantom Menace enough. The Gungans, the Jedi Council, the Sith + The Rule of Two, the Senate, the political structure for all of the new planets, and countless other examples of world-building. George Lucas is a genius when it comes to this stuff. People are always talking down upon this movie because of the dialogue and writing but completely ignore the other outstanding examples of filmmaking from George Lucas. The lightsaber choreography is jaw dropping. The fight with Darth Maul, Obi-Wan, and Qui Gon is one of, if not the best lightsaber duels in the entire franchise. I've always said that John William's best work is the Star Wars Prequels and listening to the score of this movie further proves that. There are so many iconic tracks in this movie. Most notably, Duel of the Fates. My absolute favorite song in the entire franchise. Liam Neeson as Qui-Gon Jin is perfect. Qui-Gon is such a fantastic character and is an amazing addition to the franchise. Ewan McGregor as Obi-Wan is perfect and that's further displayed throughout the rest of the trilogy. I love Jake Loyd as a young Anakin Skywalker. It's a shame that he received a ton of hate for this role. I thought his acting was great for his age. He could've had a promising career if it weren't for all of the hate he received. Despite the terrible dialogue and CGI, The Phantom Menace sets up an era of Star Wars that is home to some of the best stories in the entire franchise."
  },
  {
    "rating": "3/5",
    "review": "Cringey dialogue, bad acting and horrible script writing. Enjoyable lightsaber fights, John Williams music, and Liam Neeson save this Star Wars parody."
  },
  {
    "rating": "1.5/5",
    "review": "I think this movie is bad .The movie is pretty boring.I don't have lots to say about this due to the boredom I experienced.The only cool and good part is Darth Maul.His fight scene at the end of the movie is pretty sick.The pod racing is also kinda cool. Overall a bad film. -4/10"
  },
  {
    "rating": "2.5/5",
    "review": "At first the movie just seemed kind of boring, didn't really hook me but once it got more into the movie the plot really took off and it got more action packed. I wouldn't say this is a great movie, but it isn't bad. I think if there was more action from the start then it would've been more interesting."
  },
  {
    "rating": "1.5/5",
    "review": "This is actually a bad film. I can explain more clearly - there would be people that unfairly dismiss high production 80s fantasy as being \"just about visuals\" as if props, concept art and visual effects \"were the movie\". Obviously, this overlooks the dynamic cast, great music, tought plotting and classic villains in the original Star Wars film trilogy. Getting down to it, this movie - probably one of the most anticipated genre films of it's decade - has NO clearly defined lead character. It features a cast of actors defined almost entirely by what they wear, and boy are there a lot of overstated costumes and backdrops in SW ep1: tPM. The film also bores (and confuses) people as director George Lucas introduces a bickering space senate, treaties, trade embargoes, tax disputes and so on and on. He's: Not Very Good at this type of story. The main things Lucas did well previously was create proportion, space, physicality and a dynamic cast. Not only are the new characters characterless, but the attempts to make a serious plot about \"profits\", \"losses\" and \"diplomacy\" is riddled with lifeless dialogue. Any (grown up) film maker knows these things are staged for dramatic resonance, not just to airlessly waffle about among overstuffed scenes. That's the real point of the movie, really: the overproduced set pieces. While impactful back then, they just seem cluttered and look like dated computer animation now. The original Star Wars concept artist Ralph McQuarrie, a key player responsible for the hugely successful Star Wars design aesthetic has been replaced by new staff that like: insectile, weak robot armies, clunky looking CGI space craft and, yeah, absurd overstatement. Where three well designed buildings would sit great in a shot, now there's dozens or hundreds of them. The urge to \"outdo\" any other production facility by stuffing in more and more geometry, fake lighting and clutter simply engulfs the (bland) cast onscreen. Followed by two sequels, both similarly unlikeable although the second one has an absurd ending, and the third a visually impressive and slightly less absurd ending. Avoid."
  },
  {
    "rating": "3.5/5",
    "review": "I thought that Star Wars"
  },
  {
    "rating": "3.5/5",
    "review": "The star wars franchise under George lucas has always been a favorite of mine. Although it lacks in dialog and some long slow moments. It realty sets the stage for the Boy that becomes Darth Vader."
  },
  {
    "rating": "2/5",
    "review": "Sadly, this film marked the turning point of the Star Wars franchise. While not the worst film in the series (although it is pretty bad, ngl) it still got the trilogy to a pretty good start. We get a deeper insight into the character we met in A New Hope, Obi-Wan. We see the history between him and Lukes's Father, Anakin (known as Darth Vader throughout the first trilogy). Some cringy jokes and a few less-than-stellar scenes later, we get to the part where we learn how Obi-Wan came to be Anakin's trainer. While not very good in general, it got the series off to an ok start."
  },
  {
    "rating": "3.5/5",
    "review": "I get the feeling that George Lucas wasn't 100% sure whether he was making Star Wars for a new generation of kids, or making Star Wars for the adults who grew up on the original films. Understandably, the result is that the film suffers from people alternately complaining that it's too politics-heavy to be a kids' film. Or too slapstick to be an adults' film. Whichever side you're on, if you can put aside the bits that don't appeal to you (and the bits that don't appeal to anyone), then it's a fun way to spend a couple of hours of your life."
  },
  {
    "rating": "2.5/5",
    "review": "'Star Wars I - A Ameaça Fantasma' não é um filme bom, mas também não é ruim! Os diálogos e a trama são muito desinteressantes, já as cenas de luta e ação são muito boas. O começo do filme é entediante, o meio é bom e o final deixa a desejar. O projeto também possui coincidências do roteiro e algumas cenas com CGI péssimo, mesmo para a época. Nota: 5,0/10"
  },
  {
    "rating": "5/5",
    "review": "Liam Neeson as Qui-Gon Jinn was a perfect casting choice by Lucasfilm. The beginning of the prequels started off with a bang, with the introduction of Darth Maul and many other characters we've grown to love."
  },
  {
    "rating": "4/5",
    "review": "I really don't know why a lot of people don't like this film. Yes there is bad cgi and jar jar binks, but it's just a good start to the prequels"
  },
  {
    "rating": "3/5",
    "review": "Nice start to the prequels."
  },
  {
    "rating": "0.5/5",
    "review": "A shame to all of the Star Wars saga."
  },
  {
    "rating": "4/5",
    "review": "A great beginning for Star Wars. Ewen Mcgregor was the star of this movie…. We finally get to see the Jedi order we all wondered about…."
  },
  {
    "rating": "5/5",
    "review": "Great movie. The haters aren't actually fans of star wars"
  },
  {
    "rating": "1.5/5",
    "review": "Most of the movie is boring, Anakin was too young and should've had a father, and Darth Maul shouldn't have fallen while cut in half down that shaft as if he died because they ended up reusing him as a character again. There was so much wasted potential with this movie. The Trade Federation should've been given much more of a backstory and more clear motivations as well."
  },
  {
    "rating": "2/5",
    "review": "This might be the best of the prequels, which isn't saying much. Liam Neeson, Natalie Portman and Ewan McGregor all do a decent enough job, but the dialogue is incredibly stilted and the CGI is distracting. At least Haydn Christensen isn't in it."
  },
  {
    "rating": "1/5",
    "review": "Three words sums up everything that is excruciatingly bad about this movie…. Jar Jar Binks!!!"
  },
  {
    "rating": "2/5",
    "review": "This film is maybe the worst star wars movie. Super terribly placed with weak characters and weak dialogue. Good final fight though."
  },
  {
    "rating": "4/5",
    "review": "in my opinion, all the star wars film are fantastic, except the last jedi"
  },
  {
    "rating": "3.5/5",
    "review": "THIS FILM IS ok, the villain is memorabiolmeifenjnwsjoheWFHEBHUWB QUI GON is a good chartres"
  },
  {
    "rating": "2/5",
    "review": "A flop, no doubt, but Liam Neeson is great."
  },
  {
    "rating": "2.5/5",
    "review": "I always avoided anything related to Star Wars since i didnt understand it, so i decided to give it a chance and after some quick search they recommended this is the first movie to watch in order, i will be honest im quite disappointed i expected something much better than this considering all the hype people have for the Star Wars movies, these some nice visuals when you compare it to movies at that time but what i found this movie lacking is a good and strong story to keep you interested. another thing to mention is the movie is a little bit long for this story i was forcing myself to keep watching after maybe 1 hour into it, they should have ended it early and not dragged it for 2 hours! i might give Star Wars another try but that was a bad start for me."
  },
  {
    "rating": "5/5",
    "review": "I really love this movie. There is just so much in this movie for all audiences. The biggest complaint I see about this movie is people not understanding it. If you don't understand it I'd recommend watching it again or doing some research. This movie is absolutely genius by George Lucas."
  },
  {
    "rating": "4.5/5",
    "review": "You can’t compare to the originals because this is a different time in Star Wars. Yea there are some stupid parts but it has one of the best light saber duels and is refreshing and new"
  },
  {
    "rating": "3/5",
    "review": "Fun movie. More tolerable the younger / older you are. I enjoyed it and it did not \"ruin my childhood.\""
  },
  {
    "rating": "5/5",
    "review": "The best movie costumes ever designed! With the best makeup and hairstyling ever done in a movie! And the best sound editing ever done in a movie!"
  },
  {
    "rating": "4/5",
    "review": "Da sextologia Lucas, esse é o mais fraco, mas ainda assim tem grandes elementos, como a batalha contra Darth Maul e o proprio Darth maul, que merecia mais tempo e tela. O Lucas se perde na posibilidade do infinito de efeitos que tem em mãos aqui, mas ainda assim é muito superior a tudo o que a Disney viria a fazer com esse franquia."
  },
  {
    "rating": "3.5/5",
    "review": "I don't understand all the hate this movie gets it has some good moments and some bad."
  },
  {
    "rating": "5/5",
    "review": "i love the star wars franchise #Best_franchise_ever!!!"
  },
  {
    "rating": "2.5/5",
    "review": "Darth maul, podracing, and groundbreaking CGI still don't stop this movie from leaving a rather bad taste in your mouth."
  },
  {
    "rating": "3/5",
    "review": "Won’t miss anything too special if you just fast forward to the end light saber duel."
  },
  {
    "rating": "3/5",
    "review": "Big Star Wars fan. The movie is only watchable and memorable for its significance to the overall story. Very cheesy acting. George Lucas' insistence on using a child actor really hurt the film with its crazy over-top (yet lack of depth) dialogue. Good effects for the time as well as a great finale that wraps up nearly all the loose ends in the film. The 2nd act of the film holds a lot of the problems in my opinion that could've been rewritten in a more favorable way. A lot of sequences drag on for far too long to the point where you're waiting for the film to move on."
  },
  {
    "rating": "3/5",
    "review": "Doesn't deserve the hate but still meh"
  },
  {
    "rating": "4/5",
    "review": "A bit of a boring movie in itself, although it actually turns out to be a great backstory for Attack of The Clones and Revenge of The Sith."
  },
  {
    "rating": "3.5/5",
    "review": "I never know if I like this film or if I don't it's really entertaining with lots of great moments especially the battle with Darth Maul but this movie also has some of the worst things about Star Wars terrible dialogue and Jar Jar Binks so I guess you win some you lose some but this is a pretty nostalgic movie to me so I don't know 7/10"
  },
  {
    "rating": "4/5",
    "review": "I think that this movie is underrated in a few ways. The coolest parts of it include the awesome pod racing sequence, Darth Maul and the epic lightsaber fight at the end, and John Williams's Duel of the Fates. While one can get angry at quite a few things at the film and understandably so which make it quite different from the first trilogy, you have to focus on the good things too, and this film I give tremendous credit for those things! If you watch it with enough positivity and appreciation, you can have a good time! And plus, guess what? I really do like the character of Qui Gon Jin played by Liam Neeson and liked his addition in the story! He's wise, well-spoken, well-portrayed, clever, and his relationship and initial faith in Anakin feels very special! The movie just gives me the feels as a Star Wars fan! I remember being a kid and always wanting to see it and being fascinated when I finally did! I thought it was awesome and as an adult I appreciate the fact that Star Wars returned after 16 years without people thinking they'd see another one, let alone 3 more movies! Haters are gonna hate, but I can't care!"
  },
  {
    "rating": "2.5/5",
    "review": "George Lucas made big news when he picked up on the original three films that would begin the great Star Wars saga in 1999, twenty-two years after the original three films debuted. \"Star Wars: Episode I- The Phantom Menace\" certainly utilizes the numerous advances that special effects and moviemaking have evolved into, unfortunately it lacks the character development and depth of the original trilogy. Hopefully now that the stage has been set we will see a return to form in the next two films and how they blend into the Star Wars mythos. The film had quite the story to live up to and while it falls way short, hopefully they will grow and fall in line with the masterpieces of the original trilogy."
  },
  {
    "rating": "5/5",
    "review": "The Star Wars Prequel Trilogy starts with this classic 1990s film! This was also the start of Darth Maul's epic storyline!"
  },
  {
    "rating": "2.5/5",
    "review": "This is one of the most important of the starwars movies, weve learnt that its all about anakin and this really shows where he came from, it does a great job at being a prequel. And duel of the fates is one of the best lightsaber duels."
  },
  {
    "rating": "2.5/5",
    "review": "Star Wars: Episode I- The Phantom Menace is a movie that succeeds on the visual and action front adding a great frontier to this movie. But, when you have mostly annoying and unbalanced characters, tedious politics sessions, terrible story and a lot of exposition, this movie falls flat quite quickly."
  },
  {
    "rating": "2/5",
    "review": "Terrible acting by the young Anakan, annoying performance by Jar Jar Binks, overreliance on CGI, cheesy humor and underdeveloped villains all add up to one bad movie."
  },
  {
    "rating": "3.5/5",
    "review": "Star Wars: Episode 1- The Phantom Menace is definitely worth a watch, but I do think it is one of the weaker movies of the Star Wars saga. I will admit I wasn't expecting much after reading some very negative reviews on IMDb, but I do think this particular instalment did in some ways exceed my expectations and disappointed as well. On a visual and technical level, it looks absolutely fantastic, with splendid special effects, stunning cinematography and fine scenery and costumes. The script is fairly decent, perhaps lacking the sophistication of Empire Strikes Back or New Hope, but does have some memorable lines. The action is constantly exhilarating, and Darth Maul, well played by Ray Park is a very good villain. Of course though, Darth Vader is better. Most of the performances are very good, especially Natalie Portman as Queen Padma who looked stunning and Jake Lloyd as Anakin Skywalker who shone with his confident charm. And Jar Jar Binks is okay on the most part, and you have to love Yoda. And the music score by John Williams was outstanding, definitely one of his best works. The quality of sound and direction are also impressive. However, there were things about this film that did disappoint. One is despite the awesome visuals, strong music score and good characters, the story never quite distinguished itself. It did take a while to get going, and when it did try to get going and you could tell it wanted to, it was further disadvantaged by the uneven pacing. Liam Neeson is a fine actor, his performances in Kinsey and Schindler's List are proof of that, and I do like Ewan McGregor. But as Qui-Gon Jin and Obi Wan Kenobi, both stars give unusually wooden performances, and at times looked even embarrassed. And as I said, the pacing is very uneven, there are some slow moments, and one or two scenes felt rushed. All in all, maybe disappointing for fans of the saga, but it cannot be denied that visually it is an accomplishment. 7/10 Bethany Cox"
  },
  {
    "rating": "3.5/5",
    "review": "This film may have been a terrific beginning to a trilogy with a few tweaks, but Jar Jar just killed it. Give the movie a chance if you haven't; it's not the worst in the franchise, but it's dangerously close. The movie begins off OK but then gets monotonous in the third act. Thankfully, Darth Maul prevented it from being dreadful."
  },
  {
    "rating": "5/5",
    "review": "Best of Movies/TV Series Collection"
  },
  {
    "rating": "2/5",
    "review": "Please, please, kill Jar Jar Binks! By himself, he ruins this movie. And what's up with the aliens that don't speak an alien language, but instead speak bad English? And oh please, those droids soldiers! Are they a parody of the stormtroopers making fun of the fact that they can't shoot? Ya know, the original Star Wars established that they empire was something to be feared; They murdered innocent Jawas, farmers, etc and blew up an entire planet. In the first scene of the original Star Wars, the stormtroopers overwhelmed Princess Leia's ship. In the Empire Strikes Back, they totally obliterate the rebel base with with these massive imperial walkers. In this movie, these droid soldiers just provide comic relief. How're we supposed to fear them?"
  },
  {
    "rating": "5/5",
    "review": "I still remember watching this in the theater and never understanding the hate it got."
  },
  {
    "rating": "5/5",
    "review": "my honest favorite of the series, it sets up a wonderful political betrayal. I love the set pieces of the pod race, and the final battle beats expectations"
  }
]