[
  {
    "rating": "5/5",
    "review": "A so underrated Marvel Universe Cinematic movie ! So attached to Natasha since the begining and she deserve to be part of the entire Endgame fight ! After re watched this movie many times it is a piece of work ! Love Florence and Scarlett alchimy on screen !"
  },
  {
    "rating": "4/5",
    "review": "Not only did it take Marvel FOREVER to get us a \"standalone\" film of Nats life but it was barley that. It felt like a sequel to a film we should've gotten in phase 1. Nat is one of the original avengers, the reason why we have so many more women within the MCU and this is what she gets?? Dont get me wrong, I loved the film. its a comfort for me but she deserved better. I wanted to see what we saw in Age of ultron, I want to see our Ballerina assassin. Bucky's widow to his his winter. Though I love Yelena and the dynamic they have, this film was just a setup to bring her in."
  },
  {
    "rating": "4/5",
    "review": "overhated. Underappreciated."
  },
  {
    "rating": "0.5/5",
    "review": "Really bad story movie, packed with actions."
  },
  {
    "rating": "4.5/5",
    "review": "Thoroughly enjoyed this. Great ensemble cast and a mix of darkness with flashes of humour"
  },
  {
    "rating": "5/5",
    "review": "BLACK WIDOW is One of The best super hero movie which is more of a spy movie, I love Scarlett Johanson and she as black widow is a killer combo and in this we get to meet her family and we get some new heroes like Red Guardian ♥️😂 he's a great and funny being and we get Yelena her sister she is also a badass like her sister and the villain taskmaster is good, this movie is packed with Action Emotions & Comedy, I'm reviewing this late but swear I've watched this back in the year 2021. If you haven't watched yet and you're not even a marvel fan but you'll still kinda like this movie. 💀🔥💯😂📈🤪🖤🥺"
  },
  {
    "rating": "4/5",
    "review": "Aside from the ending that might have dragged a little bit too long, this was a super fun, action filled movie, and WOMEN. Can’t ever go wrong with women."
  },
  {
    "rating": "4.5/5",
    "review": "One of my favorite film of mcu, it because the fight sceen but not with the cgi"
  },
  {
    "rating": "4/5",
    "review": "Le duo Florence Pugh et Scarlett Johansson est absolument phénoménal ! Revoir ce film après avoir vu Thunderbolt, c'est encore plus fort. Mélange d'action et d'humour, un très bon Marvel !"
  },
  {
    "rating": "5/5",
    "review": "I love this rehash of the classic Marvel film character."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie. Title sequence is one of the best in all superhero movies since X-Men origins: Wolverine or Guardians of the Galaxy 2"
  },
  {
    "rating": "4/5",
    "review": "I liked this movie and you really get to know more about Natasha and her past"
  },
  {
    "rating": "4/5",
    "review": "Loved their sister chemistry and enjoyed the family dynamic, Scarlet Johansson does a great job."
  },
  {
    "rating": "3.5/5",
    "review": "Florence Pugh as Yelena is fantastic, the action is pretty good, and the humer, (especially with Red Gaurdian) is great. But, the film has some major special effects issues, and a weak villain. Overall pretty good, just not one of Marvels best."
  },
  {
    "rating": "1/5",
    "review": "Um dos piores filmes da Marvel, mais genérico impossível."
  },
  {
    "rating": "2.5/5",
    "review": "The CGI was bad almost all the movie then they stoped using green screen"
  },
  {
    "rating": "3/5",
    "review": "A good addition to the Marvel Universe but clearly a streaming movie which is fine!"
  },
  {
    "rating": "4/5",
    "review": "Love this extension movie and background of Black Widow. Scarlet Johansson portrayed this superhero as expected! Strong and alluring! Enjoyed the action scenes!"
  },
  {
    "rating": "3/5",
    "review": "Honestly loved the plot and the new characters, but the CGI was too bad for me to give this a higher rating."
  },
  {
    "rating": "4/5",
    "review": "My honest thoughts on this movie: after all the bad stuff I've heard about it, I was very surprised 😮 . It is nowhere near as bad as people say it is! I can see the flaws, especially when it comes to VFX effects, but with strong, fun moments and a great new characters addiction consisting of David Harbours Red Guardian and Florence Pughs Yelena Belova this movie was great. Overall I'll give it a 4/5."
  },
  {
    "rating": "5/5",
    "review": "I really liked the movie."
  },
  {
    "rating": "4/5",
    "review": "A very good look at the Black Widow character. Wish that this had been released in the correct place in the timeline. Natascha ( great casting with Scarlett Johansson) inspired casting with Red guardian ( David Harbour) and White Widow (Florence Pugh). All over a solid movie 🍿"
  },
  {
    "rating": "5/5",
    "review": "La historia es sólida y cautivadora, destacándose por su ritmo dinámico y sus intensas escenas de acción. Logra mantener al espectador entretenido de principio a fin, combinando emoción y narrativa de manera efectiva."
  },
  {
    "rating": "2.5/5",
    "review": "My friend Kyle said not bad, but not my favorite. On my upcoming weekend with the boy we have pondered the thought of seeing Thunderbolts. Some mombojmbo Marbel movie and I guess I need to watch this? Work has been busy but still find the time to do go on Instagram and look at some fake butts. I know they are not real but I still enjoy the video. I do not like (the post) it so my friends do not know this is what I have been up to when I say I am busy."
  },
  {
    "rating": "0.5/5",
    "review": "Eu só desejo uma coisa desse filme que ele nunca mais seja exibido o vilão e uma porcaria que inclusive o vilão e uma versão paraguaia do soldado invernal do capitão América 2"
  },
  {
    "rating": "0.5/5",
    "review": "bad movie, glad they did not go for the second one. horrible and boring"
  },
  {
    "rating": "4/5",
    "review": "An almost perfect film. The 3rd act with the floating cloud lair was really lame."
  },
  {
    "rating": "5/5",
    "review": "absolute masterpiece"
  },
  {
    "rating": "5/5",
    "review": "An excellent addition to the spy genre side of the marvel universe. On par with 'The Winter Soldier'. Funny, dramatic and well acted. Florence Pugh shines as Yelena Belova and Scarlet Johannson is always at her best. Grab your popcorn, sit back and enjoy the ride."
  },
  {
    "rating": "4.5/5",
    "review": "Honestly i don't know why the fan based didn't really liked this movie, it was amazing, the plot is good, the action scenes, the acting, the villains, the cinematography is amazing, i really enjoyed all the characters devolvement thought the movie, definitely recommend it"
  },
  {
    "rating": "5/5",
    "review": "Kalian harus nonton film ini seru sangat"
  },
  {
    "rating": "5/5",
    "review": "film yang sangat menarik"
  },
  {
    "rating": "4.5/5",
    "review": "interesting super hero movie. and scarlett watson plays it well"
  },
  {
    "rating": "5/5",
    "review": "I'd recommend this Movie, you won't be disappointed. I feel like this Movie would never gets old (⁠ ⁠╹⁠▽⁠╹⁠ ⁠)"
  },
  {
    "rating": "1.5/5",
    "review": "I didn't find the plot very interesting, and the visuals were terrible. It had potential, but it just wasn't great in the end."
  },
  {
    "rating": "5/5",
    "review": "It's a good Marvel movie with special effects that deserves a big screen. Good plot, acting, and script development. The action-packed scenes in the film are admirable."
  },
  {
    "rating": "3.5/5",
    "review": "Nowhere near as bad as people were saying. It's not peak MCU content but it's still a very solid watch."
  },
  {
    "rating": "3/5",
    "review": "This movie is overhated. I didn’t love this movie but I didn’t hate this movie. What I did love was the post credit scene though. How Yelana is looking for Hawkeye now. A the fact that it actually got delivered was awesome. That never happens anymore in the MCU."
  },
  {
    "rating": "5/5",
    "review": "I'll give this 5 stars for several reasons. Surprisingly this works quite well as a stand-alone movie without much knowledge of the marvel universe. Chemistry between Pugh and Johansson was excellent as it was with Harbour. Great storyline and visually gorgeous. Simply a great action movie."
  },
  {
    "rating": "2.5/5",
    "review": "Boring is many ways, there are some great characters here, they should have tell her true origin story"
  },
  {
    "rating": "2/5",
    "review": "Action pose, karate kick, karate kick, more karate, fire weapon, punch in the face, karate kick, jump from top of the building, action pose, karate kick, karate kick, karate kick, fire gun, punch in the face, karate kick, more bad acting, end of movie. Just like the last action movie you watched."
  },
  {
    "rating": "2/5",
    "review": "It's not good. Sometimes it was quite boring, the end credits scene setting up for a future film was straight up stupid. It'd be okay as a second monitor screen while doing something else, but if someone said should we watch this, I'd say no"
  },
  {
    "rating": "2/5",
    "review": "Strangely grabs then loses my attention with weird scene transitions and tonal shifts. Obviously a likable lead we all know well but unfortunately a very weak villain in the end."
  },
  {
    "rating": "4/5",
    "review": "When I first saw this movie, I thought it was just okay—but after watching it a few more times, I’ve really grown to love it. Honestly, if this had been released during Phase 3, I think it would’ve hit even harder. What I really appreciated was how it gave us a deeper connection to Natasha. We finally got to see where she came from, the horrors of the Red Room, and how women were trained—and tortured—to become assassins. It added so much depth to her character. I also loved how the movie showed that Natasha had a real family beyond the Avengers. That dynamic made her story more meaningful. In fact, if her family had been more involved or even present after her death in Endgame, I think it would’ve made that moment even more emotional—but that’s just my take. Overall, this is a solid film that gave Black Widow the spotlight she deserved."
  },
  {
    "rating": "3.5/5",
    "review": "Similarly to Wakanda Forever, this was a good movie but not rewatchable."
  },
  {
    "rating": "5/5",
    "review": "Greatest Female Solo Movie, She Deserved This A While Back But It Still Pulls Me In To Watch, Scarlett Is Very Talented."
  },
  {
    "rating": "0.5/5",
    "review": "A LITERAL COPY PASTE OF Charlie's Angels (2019)"
  },
  {
    "rating": "4/5",
    "review": "\"Easy to follow and a bunch of fun\" manages to balance the action and humor better than most of the rest of the MCU. Florence Pugh is delightful throughout, here's hoping Yelena pops up again. the movie actually has something to say too with it's creepy manipulative old hollywood producer guy as the villain. even though they overdo the effects at time, the HALO-esque set piece at the finale was easy to follow and a bunch of fun."
  },
  {
    "rating": "2.5/5",
    "review": "É um bom filme, que tem bons arcos e boas cenas de ações, mas o Guardião Vermelho é muito irritante em alguns pontos, mas no geral é positivo."
  },
  {
    "rating": "4/5",
    "review": "Esse filme deveria ter lançado na Fase 3 todo mundo sabe disso. o filme em relação ao outros filmes da fase 4 ele fica um pouco por baixo mas ainda sim e um excelente filme de espionagem que tem um ótimo equilíbrio com humor,cenas emocionantes,ação e lutas. Ótimo filme mas em relação alguns projetos da fase 4 ele fica um pouco por baixo"
  },
  {
    "rating": "2/5",
    "review": "okay movie, but the plot twist ruined a great character."
  },
  {
    "rating": "4/5",
    "review": "That this movie gets way more harsh criticism than let’s say the Ant-Man movies says a lot about we got quite a few steps to go before a movie with strong female protagonists can be reviewed on an equal level as the one with males. Black Widow is flawed, don’t get me wrong, but is it worse than the others I mentioned? Or is a coincidence that Cap Marvel and Marvels are also among the worst ranked in the MCU? I think not. BW is way more entertaining and interesting than all the Thor movies combined… A great cast not least the supporting actors and tho the thriller spy theme is somewhat drowned in the high octane explosions and loooong action scenes. But even those scenes are pretty entertaining. With a running time of nearly 2,5 hours the movie may wants to do too many things in one movie. But rather that then the opposite as in for example Thor: L&T What a complete waste that movie was… Is BW better than “the girl w dragon tattoo” series, a movie with a similar theme? Hell Yes!"
  },
  {
    "rating": "5/5",
    "review": "Loved every second! I miss Nat so much!!"
  },
  {
    "rating": "5/5",
    "review": "I absolutely loved this movie!!!! It shows the sad story behind Natasha and Yelana and I loved them working together to enhance the film."
  },
  {
    "rating": "3/5",
    "review": "The pacing of the movie was a bit off. It really took a long ytme to get to the finale which was a bit disappointing. The villain's daughter's suit looked goofy and more of a fortnite skin than a threatening antagonist. This movie is ok. Nothing special but as I wasn't going in with high hopes, I think it delivered an experience that won't leave a bad taste in your mouth."
  },
  {
    "rating": "3.5/5",
    "review": "The plot was good, but was disappointed with how Taskmaster was portrayed."
  },
  {
    "rating": "2/5",
    "review": "The action is good but it's boring and uninteresting. Taskmaster is also disappointing and the only good thing about this movie is that they created Yelena and the Red Guardian."
  },
  {
    "rating": "5/5",
    "review": "Only one bad CGI part but other than that it’s really good"
  },
  {
    "rating": "3.5/5",
    "review": "Not bad of a movie"
  },
  {
    "rating": "3.5/5",
    "review": "It's a nice and watchable movie. There are boring and unnecessary scenes, but I think it's a watchable movie. The Natasha story made me quite sad, but I think it's a movie worth watching."
  },
  {
    "rating": "3.5/5",
    "review": "Direção: Ok Atuação: Bom Roteiro: Ok Caracterização: Bom Soundtrack: Ok"
  },
  {
    "rating": "5/5",
    "review": "Fun, action-packed origins movie."
  },
  {
    "rating": "0.5/5",
    "review": "worst MCU movie ever"
  },
  {
    "rating": "5/5",
    "review": "Dark, Funny, Action Packed. Hello Yelena Belova. Florence Pugh steals every scene she's in, effortlessly. The directing, at times is a little funky...but the writing, editing, SFX, score... incredible."
  },
  {
    "rating": "4/5",
    "review": "Underrated Marvel movie."
  },
  {
    "rating": "4/5",
    "review": "85/100 I thought I was not going to like this movie but I ended up enjoying it."
  },
  {
    "rating": "5/5",
    "review": "It's really a fun movie and worth watching."
  },
  {
    "rating": "3/5",
    "review": "Marvel should have told her true origin story"
  },
  {
    "rating": "2.5/5",
    "review": "certified mid"
  },
  {
    "rating": "5/5",
    "review": "best movie every love it"
  },
  {
    "rating": "5/5",
    "review": "I am very happy that the movie shows us the steps and choices that are necessary in the life of a great person. I like the movie."
  },
  {
    "rating": "5/5",
    "review": "This movie was SO well done. Very impressed."
  },
  {
    "rating": "5/5",
    "review": "Best Movie ever need part 2."
  },
  {
    "rating": "4.5/5",
    "review": "Sinceramente, esse filme não tem o reconhecimento que merece. Ele é muito subestimado, assisti umas 3 vezes e é ótimo como entretenimento, obviamente ele não é perfeito só que está muito longe de ser ruim como pintaram a época."
  },
  {
    "rating": "4.5/5",
    "review": "action packed movie..."
  },
  {
    "rating": "2.5/5",
    "review": "Better if it released before Endgame and it seems more of a third movie in a trilogy."
  },
  {
    "rating": "5/5",
    "review": "This movie should have been made way before it came out, but I'm happy it finally did."
  },
  {
    "rating": "5/5",
    "review": "hands down the best Marvel movie. This is my all time favorite Marvel movie ever. If you read and live Marvel then watch this."
  },
  {
    "rating": "4/5",
    "review": "Great marvel movie as expected. Just wish it was made sooner, prior to end game. It woulda made Natashas sacrifice so much more powerful."
  },
  {
    "rating": "2/5",
    "review": "The film is good to have on in the background. The whole vibe of the film is kind of a letdown after Endgame"
  },
  {
    "rating": "3/5",
    "review": "Veel actie, geloofwaardigheid nul. Gewoon links laten liggen."
  },
  {
    "rating": "4.5/5",
    "review": "It's an wonderful movie..."
  },
  {
    "rating": "0.5/5",
    "review": "Almost as bad as it gets. Bad script, bad direction, bad acting... Everyone has hokey Russian accent. Boris & Natasha from Rocky and Bullwinkle were more convincing... Really Awful..."
  },
  {
    "rating": "3/5",
    "review": "A good movie, and there is not much else to say about it. Competently shot, acted well, and has decent action. Villain falls off for me a bit just because they used the Taskmaster name, and I was hoping for a little closer to the comic book iteration of the character but just because it didn't go my way, doesn't mean it was bad, it just takes it down a little for me. Pugh and Johansson's connection is felt at parts but then at times feels like they are strangers just getting to know each other. I know they had been separated for a while, but it still felt awkward at times."
  },
  {
    "rating": "0.5/5",
    "review": "Incoherent, boring plot. I got fed up after 30 minutes and stopped watching."
  },
  {
    "rating": "0.5/5",
    "review": "This is another embarrassing Marvel movie with cringe humor. It's sad what Disney has done to Marvel movies."
  },
  {
    "rating": "3.5/5",
    "review": "our choices make us who we are."
  },
  {
    "rating": "5/5",
    "review": "I forgot how much fun Marvel movies used to be until I rewatched this today. Awesome film."
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing story. Really funny at time and heart warming but packed with enough action to make this a top marvel classic"
  },
  {
    "rating": "4/5",
    "review": "Underrated especially compared to the newer marvel releases"
  },
  {
    "rating": "3.5/5",
    "review": "I did enjoy this movie overall, but it has one big problem. There is a huge disconnect between the opening sequences and implied background to the story and what we get. This should have been a much darker, Punisher or Joker type movie. The opening sequence is fantastic at setting the right mood for this characters story, then Disney chickened out. A huge missed opportunity to make something truly memorable, instead of making it just another typical MCU movie."
  },
  {
    "rating": "4.5/5",
    "review": "I feel that they could have started telling her backstory earlier, like in phase 1 or 2, because not knowing alot about her past and by watching this movie feels like their is so much stories to tell. Nevertheless this is an amazing movie and a beautiful send off, We will always love Natasha."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was not bad, I recommend it."
  },
  {
    "rating": "5/5",
    "review": "Such a good movie. So emotional and great connection amongst the characters in the movie. i have watched this movie too many times but i absolutely love it each time. Scarlett Johansen is such a good actor."
  },
  {
    "rating": "0.5/5",
    "review": "Don't even watch it, It's not even entertaining."
  },
  {
    "rating": "4.5/5",
    "review": "I enjoyed it. Good origin story and chosen actors and their dialog were excellent. Action scenes and comedic value were well balanced, and I wasn't left checking the time to see how long we had left as the story kept moving along nicely."
  },
  {
    "rating": "1/5",
    "review": "Forgettable. A lot of scenes could have been cut. The dialogue wasn't very interesting or memorable. I think they were trying something different with this movie, but it doesn't make sense and it's not something I would rewatch. I barely got through it the first time."
  },
  {
    "rating": "4/5",
    "review": "i love this movie so muh"
  },
  {
    "rating": "2/5",
    "review": "Am I the only one who is done with Scarlett Johansson being in everything? Not that she hurts this film. The whole Marvel Universe hurts this film more than anything. It is a hokey, continuous sequence of cinematic buffoonery that will keep you saying \"Yeah Right\" to the screen throughout the whole thing. I'm sure it's fun to many, and might even make you giggle a time or two. But a good film this is not. Sadly, it is worlds better than most of what comes out of the Marvel drivel bad."
  },
  {
    "rating": "2.5/5",
    "review": "Great cast, I wish I had less of the over-the-top spectacle ending, I think a grimmer perhaps Noir setting for Blackwidow would have been more appropriate. I felt the Taskmaster persona was wasted here."
  },
  {
    "rating": "4.5/5",
    "review": "Unexpectedly delicious."
  },
  {
    "rating": "3.5/5",
    "review": "I think that this movie deserves a pass it's okay but CGI is bad"
  },
  {
    "rating": "4/5",
    "review": "Bom filme! Da pra assistir e se entreter. Para um pseudo filme de origem, ele serve, mas seu lançamento foi em uma época ruim e fez algumas adaptações desagradáveis."
  },
  {
    "rating": "2/5",
    "review": "Almost as good as Thor 2."
  },
  {
    "rating": "3/5",
    "review": "Fun but way too streamlined. This was during covid and such insecurity about the future of cinema so im not sure how that impacted this film, but the movie is too little to carry all the new characters and the ending wraps up too neatly. Still doesn't make me any more attached to the titular character."
  },
  {
    "rating": "5/5",
    "review": "excellent movie loved the female characters"
  },
  {
    "rating": "5/5",
    "review": "Awesome, worth my time"
  },
  {
    "rating": "2/5",
    "review": "It wasn't the worst Marvel outing, but I would hesitate to even call it solidly mediocre. The fight scenes were inconsistent in quality, the visual effects were just awful, the plot was too thin yet the film tried to make it feel like the stakes were incredibly high, and a lot of the humor was a big swing and a miss for me. Florence Pugh was the stand out, and her character's dynamic with Natasha was really enjoyable. Taskmaster....... Oh Taskmaster...... A very cool and simple concept for a villain that they royally butchered. Everything you see in this movie has been done in many other films before it and most of them are a more enjoyable watch."
  },
  {
    "rating": "4/5",
    "review": "not the best mcu movie but it is awesome to watch i don't see why female marvel hero's get so much hate i like that the studio could end it off with a banger it's sad to see her die in endgame but it's great to see her come back one more time for what like 2 in a half hours i think"
  },
  {
    "rating": "3/5",
    "review": "This movie is personally overrated. The plot and cgi are terrible in some moments."
  },
  {
    "rating": "0.5/5",
    "review": "Mission impossible Disney style..bad bad bad..."
  },
  {
    "rating": "3.5/5",
    "review": "Filme brabo, com ações gostosas e um filme que cronologicamente na Marvel é bom."
  },
  {
    "rating": "4.5/5",
    "review": "I wasn't expecting much after the low critics scores but I don't know what movie they were watching. This is one of the better Marvel films that has come out in the last couple years. It was very intense. The action was very thrilling IMHO. All the ladies did great in their roles. And the villain was one of the better antagonists I've seen in a marvel film in a while. I highly recommend this movie."
  },
  {
    "rating": "0.5/5",
    "review": "Not a great movie. Was boring and tedious to watch."
  },
  {
    "rating": "3.5/5",
    "review": "Altho the cgi can be terrible at times there are still some cool action sequences and the acting was good too. Not great and not bad. But it is good. recommend maybe u'll like it maybe u won't. No promises."
  },
  {
    "rating": "5/5",
    "review": "Great film, loved it."
  },
  {
    "rating": "1/5",
    "review": "Terrible film. Very terrible."
  },
  {
    "rating": "0.5/5",
    "review": "this movie was such a letdown. Marvel is on a downward spiral."
  },
  {
    "rating": "4/5",
    "review": "I liked it, this is a solid movie."
  },
  {
    "rating": "0.5/5",
    "review": "Disney is trash! Their betrayal will never be forgotten or forgiven! They were supposed to be a wholesome company that made children's entertainment. Instead they've become some sort of twisted, perverted, and disgusting bunch of radicals that want to corrupt children!! Honestly those responsible should be put in prison for their unforgivable aberrant actions!!"
  },
  {
    "rating": "2.5/5",
    "review": "Forgettable characters, goofy accents, so many fights without much stakes, and weird placement in the MCU release order. One of the weaker entries in MCU."
  },
  {
    "rating": "5/5",
    "review": "I thought the movie had good story to it but I didn't like the CGI. The movie is still good and it's great to watch."
  },
  {
    "rating": "3.5/5",
    "review": "Fun fact: I didn't even notice the cgi in the third act, and still don't."
  },
  {
    "rating": "2/5",
    "review": "The movie is at its best when it is a dysfunctional family action comedy. Too bad those scenes are overwhelmed by the mind numbingly dull action scenes and the undercooked plot."
  },
  {
    "rating": "5/5",
    "review": "It was a good movie. I am surprised it took me so long to see it. I guess I was more busy than I thought."
  },
  {
    "rating": "4/5",
    "review": "Whether the narrative is in amped-up overdrive or idling, the director and her magnetic cast keep us fully invested in their cautious reconnection and their ability to survive a series of life-threatening encounters."
  },
  {
    "rating": "4/5",
    "review": "Natasha Romanoff deserved a good standalone film like this one. It's the perfect goodbye for this character we are following for over a decade. The characters were great. I loved Yelena Belova: the performance Florence Pugh gave in that regard was funny and moving in the same time. I also liked the Red Guardian, a fun character that I would like to know more about. The plot was interestingly catchy. The photography is a strong argument for this film. It has good scenes filmed outdoor, with natural light. The artistic direction in general is a success. The few weaknesses are to find in some fight scenes, poorly assembled, and in the villain that we only see for about 10 minutes in total."
  },
  {
    "rating": "4.5/5",
    "review": "I will never. Never understand the hate for this movie. I thought the family dynamic was fantastic. Yelena was absolutely superb, I don't think the action gets the credit it deserves, I truly think it rivals the Winter Soldier in terms of action. Yeah the third act gets a little crazy and I think the pheromone bit is a little weird but the rest of the movie is great enough for me to get over that pretty quickly. I love this film."
  },
  {
    "rating": "4/5",
    "review": "Watched it again after 3 years and it's a lot better than I remember."
  },
  {
    "rating": "4/5",
    "review": "Good film! With all the ingredients of your usual solid Marvel production. Fun characters, glib dialogue, charming family dynamics and spectacular action set pieces. I was hoping for a darker, more Cold War era centric espionage film that focused on her origins and upbringing. It seems arbitrary to tell a side story that takes place just after Civil War but at the same time it works thematically and callback to existing lore will gratify MCU fans. Black Widow doesn't really feel like a fresh, powerful installment to the MCU but it gives stronger emotional context to Romanov's sacrifice and establishes great new characters that we'll hopefully see more of in the future."
  },
  {
    "rating": "4/5",
    "review": "Great homage, FINALLY, to Black Widow."
  },
  {
    "rating": "4.5/5",
    "review": "Very well done! Great, exciting, original feeling action scenes. Clever & relatable dialogue. Natasha's sister steals the spotlight with her dry wit and piercing commentary. Funny and fast-paced superhero/spy flick with some truly authentic heartfelt moments between characters."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies of all time."
  },
  {
    "rating": "5/5",
    "review": "One of the best films of phase 3 and 4, the script makes you reflect, especially dealing with a young female audience. The fight scenes are very well directed, my favorites from the Marvel universe"
  },
  {
    "rating": "2.5/5",
    "review": "Attempts to walk the line of being a Marvel flick but with gritty Bourne-esk spy thrill overtones but eventually devolves into more CGI MCU nonsense with none of the stakes of any of the previous installments due to its chronology in a muddled timeline. Nevertheless, the whole family dynamic between Johansson and company is palpable and Florence Pugh & David Harbour are true scene stealers."
  },
  {
    "rating": "3/5",
    "review": "Not a terrible start to Phase 4. It just feels like this story should have happened before Endgame because it doesn't have as much gravitas to it because her character is already dead. The supporting cast is good especially Florence Pugh and David Harbour. The villain is severely disappointing and not all that interesting. Also contains some terribly looking visuals in the movie which is just disappointing. Not the start of Phase 4 I was hoping for."
  },
  {
    "rating": "3/5",
    "review": "Scarlett Johansson and her co-star Florence Pugh are excellent, but the thin plot depends on unbelievable twists and cheesy soap opera shenanigans."
  },
  {
    "rating": "1/5",
    "review": "BORING AS HELZ!!! \"DON'T WAIST YOUR TIME\""
  },
  {
    "rating": "0.5/5",
    "review": "where to start, Scarjo is great (needs lipstick badly) in this, but there is no tension, she died in later movies, prequels and origin stories have that fatal flaw, you know they wont die. Story is a muddled mess"
  },
  {
    "rating": "3/5",
    "review": "A movie that feels like it arrives too late as we already know that the title character is alive after the events of the movie which takes place before the next movie she appears in. Also, the villain is portrayed as a ruthless assasin which we the audience haven't seen as we are used to feeling empathy to the villain. However, our expectations are subverted and we are forced to feel sympathy leading to feeling a bit of cheat from marvel. On the positive side, the supporting cast are lovable as david harbour presents a flawed dad and florence pugh is the bratty younger sister who steals the show!"
  },
  {
    "rating": "5/5",
    "review": "Me gusto bastante!!!! Es una de mis súper heroínas, me encanto que le hiciera su película y saber su historia, lo que no me gusto es que 20/50 escenas fueron del trasero de Scarlet"
  },
  {
    "rating": "3/5",
    "review": "Very typical marvel super hero movie"
  },
  {
    "rating": "5/5",
    "review": "Now in the Marvel timeline, this film takes place after *Captain America: Civil War\" but \"Black Widow\" really stands on its on. You do not have to have seen the other Marvel film to enjoy this Awesome origin story of Natasha Romanoff, a Russian spy turned Avenger. It Is 1995, Russian spies Alexei Shostakov and Melina Vostokoff go in deep undercover in Ohio USA. Posed as a family with with two young daughters, Natasha and Yelena, (ages 11 & 6} they steal secret SHIELD intel and return to Russia. But the young girls are taken by General Dreykov and sent to the infamous Red Room and trained to be assassins. \"My girls are toughest girls in the world\" - Alexei Now twenty years later, the very intel they stole is being used to control \"Black Widow\" assassins all over the world...including Yelena. Now to stop Dreykov and destroy the Red Room the family must reunite and fight together. But were they ever a real family? \"It was real for me\" - Yelena \"I'm sorry. We had our orders and we played our roles\" - Melina Black Widow is my favorite of all the Superhero films.... and it is so much more. This is a great well written story about a unlikely family but with lots of action, mystery, spy and hero stuff, and family feuds and reunions. I saw Black Widow on the big screen when it came out and watching again, I really forgot how good is, Way beyond my expectations..... And a Awesome cast! Some of my favorite actors. Scarlett Johansson, Florence Pugh, David Harbour, Rachel Weisz, Olga Kurylenko, William Hurt, Ray Winstone \"Family, back together again.\" -Alexei"
  },
  {
    "rating": "2/5",
    "review": "What if I told you I loved this movie despite my hard rating? Well you'd be surprised that the reason I adore this movie is not the reason I should like this movie. Black Widow struggles on its main character, its main antagonist, its visuals, and its story. Everything else is welcomed with open arms. Simply, this movie is awesome not because of Black Widow. The worst part of the movie is the very character it is trying to represent. There are not enough reasons to like Black Widow except that she is played by Scarlett Johansson. The movie gives you enough reasons why we should not like her. She killed a little girl, she abandoned her sister, she killed even more people, etc. I believe the film is trying to get us to show empathy for her. What it did was leave its audience feeling guilty for loving a character for a long period of time."
  },
  {
    "rating": "1/5",
    "review": "Pido ser mil veces mejor"
  },
  {
    "rating": "1/5",
    "review": "This movie is overrated. I liked some new characters like yelena and red guardian but the villains were absolute garbage. Really didn't like the plot, third act and the cgi. One of the worst films in the mcu."
  },
  {
    "rating": "4/5",
    "review": "The CGI struggles and whatever character depth the film was trying to achieve is blocked off by all the action, but \"Black Widow\" is an entertaining enough flick and a quality edition to the Marvel Cinematic Universe."
  },
  {
    "rating": "0.5/5",
    "review": "Awful movie, dont waste your time on this shit"
  },
  {
    "rating": "4.5/5",
    "review": "Black Widow is too powerful in this film"
  },
  {
    "rating": "3/5",
    "review": "I would give it a higher rating but it flopped after it had been flocked."
  },
  {
    "rating": "3/5",
    "review": "Wasnt fair on Johansson to wait so long for a solo movie it should of happened between like iron man 2 and avengers 1 for her characters arc but releasing a solo movie about a character who the audience has just witness die was baffling it didn't matter what happened in the movie because everybody knew whatever threat is going to come out of it won't top thanos an will Just be minuscule and forgettable"
  },
  {
    "rating": "3/5",
    "review": "Would have been a great 90s movie. It feels like a Pierce Brosnan era James Bond movie, but better than that. By MCU standards, it was only ok."
  },
  {
    "rating": "4/5",
    "review": "Another great movie for the MCU! Loved the intro credits in this! The action was cool! A must watch!"
  },
  {
    "rating": "5/5",
    "review": "Over hated. If 1 bad CGI shot is the worst thing about this movie, it must be pretty good."
  },
  {
    "rating": "1.5/5",
    "review": "The action was mediocre. The jokes were just not funny. The plot was average at most and the CGI was awful."
  },
  {
    "rating": "0.5/5",
    "review": "Task master is not a girl he is spose to be a guy he has always been a guy in every iteration please fix this"
  },
  {
    "rating": "2.5/5",
    "review": "To put things simply, this was a movie that should have come out in 2015-2017. It is inconsequential after Thanos as Black Widow is dead. It is an alright movie, but it feels pointless, unfortunately."
  },
  {
    "rating": "3/5",
    "review": "Nice to give scarlett johanson finally her own movie but it wasnt how i expected it to be. It is a good movie but compared to other marvel projects it could have been better. The villain taskmaster was a big letdown and was completly changed how he is supposed to be. They managed to make him a uninteresting character. But the movie in general was good but it ciuld have been better"
  },
  {
    "rating": "1/5",
    "review": "Los pocos hombres que salen o son tontos, o graciosos o retrasados."
  },
  {
    "rating": "2.5/5",
    "review": "Black Widow showcases Scarlett Johansson's strong performance as Natasha Romanoff, but some silly character choices and an over-reliance on unnecessary quips sacrifice potential heartfelt and emotional moments, resulting in a mixed execution for this long-awaited MCU solo film."
  },
  {
    "rating": "0.5/5",
    "review": "The gag inducing visuals are somehow on the least of this movies concerns"
  },
  {
    "rating": "3.5/5",
    "review": "es gran película acción y una de las mejores de marvel el villano es olvida-ble y personajes son carismáticos llego tarde pero es una película genial Natasha es un 7.9 de 10"
  },
  {
    "rating": "3.5/5",
    "review": "Expected this to be terrible but it was okay. Didn't like how this human character was seemingly elevated to superhuman abilities surviving things that should have killed her, also thought the end was incredibly dumb, but other than that, I really enjoyed the back and forth of the sisters, the father's arc, and the implied stories involving Clint which served to expand Natasha's story without having to show it, leaving something to our imagination which isn't common in major movies nowadays when everything has to be over explained."
  },
  {
    "rating": "3/5",
    "review": "Good I suppose, but it was terribly timed within the MCU. This would have been great about 5 to 6 movies ago."
  },
  {
    "rating": "3.5/5",
    "review": "Taking place after the events of ‘Captain America: Civil War’ and before ‘Avengers: Infinity War’ Natasha Romanoff is on the run after breaking the Sokovia Accords with Steve Rogers escaping custody After 12 years Marvel Studios and director Katie Shortland give Black Widow her own solo adventure at last with her tracing her roots training with the Black Widow program She also comes back into contact with her adoptive sister, Yelena Belova by Florence Pugh discovering a deeper conspiracy controlling all the other agents by Ray Winstone’s Dreykov His hired assassin comes in the form of Taskmaster who’s capable of mimicking all the fighting techniques of all the Avengers in battle Both of them also reunite with parents Melina and Alexi, Alexi used to be The Red Guardian which was Russia’s response having their own super soldier but had to retire being assigned in America watching over the girls Melina was following orders failing to be a real mother Scarlett Johansson finally gives this character the proper treatment she deserves since her debut in iron man 2 all the way back in 2010 proving a female director can hold her own story Feels like an old school 1970s spy/espionage thriller along the likes of ‘Moonraker’ with some family drama Lots of big things about facing your past trauma and having to make your own choices instead of being chosen by someone else and raised to be nothing but a tool or weapon They even cover successes and failures as parents and as children I love Scarlett’s chemistry with Florence Pugh who brings a lot of levity and Dan Harbour as Red Guardian next to Rachel Weisz Taskmaster should've been a more central villain though But there's great action, stunts, and meaningful stuff fitting with today's #metoo era exploring abuse as well as intense tragedy by the male patriarchy I really like the Russian aesthetic they bring too from the music to the heritage roots Scarlett Johansson gives this Avenger more weight adding to what we’ve seen previously while Shortland doesn’t skimp on the summer thrills nor the character and depth This makes her sacrifice in ‘Avengers: Endgame’ all the more meaningful given how much she was willing to put on the line Wonky script aside this feels very self-contained in the long-running roster with minor references to the other films while remaining a decent send off for this character Not a great film in the MCU but still worth watching"
  },
  {
    "rating": "3.5/5",
    "review": "A long overdue, well deserved origin story."
  },
  {
    "rating": "3.5/5",
    "review": "Marvel does Bourne. No shade. It's good. Probably too action heavy, which is a common problem with the MCU"
  },
  {
    "rating": "3.5/5",
    "review": "The only Marvel Phase 4 movie that's worth a damn."
  },
  {
    "rating": "1/5",
    "review": "What a dull movie can't bieve it got a certified fresh almost 80% Insane!! And what did they do with taskmaster.. Unbelievable such a badass character and this is what they did with it. Unnecessary movie as well since black widow died in endgame."
  },
  {
    "rating": "4/5",
    "review": "Black Widow is a film with deeper themes and a great \"family\" dynamic that makes the film all the more enjoyable. While the CGI in some of the film is questionable at best, the movie is great to watch with family and/or friends."
  },
  {
    "rating": "2/5",
    "review": "Seems well made with good acting etc. But I just found it boring and gave up half way."
  },
  {
    "rating": "2.5/5",
    "review": "Good but they did a lot wrong taskmaster was very disappointing and had no personality"
  },
  {
    "rating": "5/5",
    "review": "This is a very good movie for see the real Russians"
  },
  {
    "rating": "0.5/5",
    "review": "Ruined an amazing villain in Taskmaster. Terrible movie. Weak characters overall."
  },
  {
    "rating": "4/5",
    "review": "What a great movie! Yelena was amazing, and I cannot wait to see more of her and the Red Guardian! I was a bit disappointed about the lack of any other MCU characters, although given the period of time this movie took place in, it makes sense. Also, the ending part with the whole pheromones thing was kind of strange, but otherwise a great movie."
  },
  {
    "rating": "3.5/5",
    "review": "A belated stand alone movie for one of the more intriguing Avengers. While not outstanding it is a solid enough entry into the MCU. Could easily see a spin-off series for David Harbour and his Red Guardian character if Disney is true to form."
  },
  {
    "rating": "5/5",
    "review": "Really good plot line, and it does have that epic climax and the buildup to it was done beautifully. The characters were funny too, but not in a cringe way."
  },
  {
    "rating": "3/5",
    "review": "It was OK. Lots of things exploded. Otherwise it was pretty much by-the-book Marvel Product. If you have nothing to do on a rainy night and just want to watch stuff go boom and people punch each other, it does that very well."
  },
  {
    "rating": "3.5/5",
    "review": "It really should have come out before infinity war. It was hard to connect to a movie and be vested when you know a characters has died in a previous movie."
  },
  {
    "rating": "3/5",
    "review": "'Black Movie' comes a little late in terms for Romanoff's character, but still manages to be an entertaining vision, with great Johansson and Pugh."
  },
  {
    "rating": "4/5",
    "review": "Actually surprisingly very entertaining action and dark moments. Some parts drag, but when it does, it's a lot of fun"
  },
  {
    "rating": "4.5/5",
    "review": "Muito bom, acabei de assistir Capitã Marvel, igualmente maravilhoso, mas com um tom mais sério, inicialmente pensei tratar-se de mais um filme maçante, estilo Mulher Maravilha (não gostei), entretanto o drama familiar me encantou, as cenas de ação me hipnotizou, os personagens são cativantes, as irmãs lindas, todo um ótimo contexto heróico, finalmente bons filmes de heroínas femininas... Belíssimo, dignamente produzido, dramático, total empatia com essas meninas... Perfeição..."
  },
  {
    "rating": "4/5",
    "review": "I love how all Marvel films connect at some point, and seeing Black Widows' background story was insightful. When we found out Natasha had a younger sister, it and she was still captured by the red room I was fascinated. The plot of her trying to destroy the red room was satisfying and how she got her fake family back together to help her do so. It was nice to see Black Widow as her person, making us forget she's with the Avengers. Although it could have been better timed since the movie came out after Natasha was killed off in the end game. It makes me feel like she deserved better."
  },
  {
    "rating": "3/5",
    "review": "The only solo film for Scarjo's Black Widow. Introduces us to Black Widow II who will replace her going forward in the series. Also brings in taskmaster and gives him a sex change so the MCU version is a woman robbing us of all the potential storyline's involving his daughter and mother of his child."
  },
  {
    "rating": "3.5/5",
    "review": "This movie is nowhere near as bad as some critics and \"commentators\" suggest. I've watched this at least twice and I can barely watch any of the \"new\" crop of Marvel films they are so bad. This is a fun and entertaining movie with some great actors. The only issue with this movie is that it should have come out way sooner. Black Widow is a great character and she deserved her own movie a lot earlier. Definitely worth a watch."
  },
  {
    "rating": "3.5/5",
    "review": "This film improves massively when watching the MCU in chronological order"
  },
  {
    "rating": "3.5/5",
    "review": "This is a cool spy thriller that introduces fun new characters. Although it does feel 5 years too late and it really struggles in its third act."
  },
  {
    "rating": "1/5",
    "review": "If I can forget one movie in my life, I choose this movie"
  },
  {
    "rating": "5/5",
    "review": "Finally after years of them treating Black Widow like eye candy for the audience and someone for the male Avengers to flirt with she gets her own film where she's a badass without having to appeal to anyone. Great cast, great story, really funny moments. So good!!!"
  },
  {
    "rating": "3/5",
    "review": "3 stars for Florence Pugh, without here it does not deserve even one..."
  },
  {
    "rating": "3.5/5",
    "review": "The acting isn't bad. S.J. is the best thing giving a solid performance. The villain isn't bad but doesn't get a lot of screen time and needed more time to go against Widow instead of just at the end spitting plot expose. Her sister isn't bad and neither are the parents but they needed more time together as it is somewhat jarring to see them being secret assassins and Red Guardian out of nowhere from when we first see them at the start. The music is solid with a good mix of modern pop music and cinematic , but I wouldn't call it catchy. The cinematography isn't bad either with very well done practical action but the CGI especially at the end is too much and isn't as good. There are memorable locations, and some well done scenes when the family bonds together but this gets offset by some dumb choices, over the top action at the end that feels out of place, a floating castle in the sky similar to the villains space station in Moonraker and why would he be so stupid and leave his ring behind and why would she let the assassin out. Also the BMW crashing in the subway stairs was laughably bad. The editing and pacing are decent also. This has a weird Filler Movie/Origin Story approach that works but not very smoothly. This give a disjointed feel throughout that eventually makes sense but doesn't flow smooth. This needed a proper story arc throughout her life in a linear fashion like Wonder Woman and Superman The Movie. Instead it feels like its cramming a lot in that does work though more than it misses. The ending feels like it belongs in a Sci-Fi Movie not in a grounded non super powered hero like Black Widow and goes against most of the tone of rest of the film. This balances action, telling an origin story and character development well enough. Although the ending goes off the rails a little bit it still is entertaining. Overall anyone who is a fan of S.J., the director, or Marvel films will have fun with this. Besides that its just a run of the mill action film without the context of the MCU."
  },
  {
    "rating": "3.5/5",
    "review": "Pretty good movie. Not my favorite but not worse. Gave us a little more insight to Natasha's life before her S.H.I.E.L.D. days."
  },
  {
    "rating": "2.5/5",
    "review": "Bland and unimpressive, Black Widow was a below-average entry in the MCU. To care about the story, I must first care about the characters. Unfortunately, knowing Natasha's fate at the end of Avengers Endgame made my interest in her character falter. The film took a blind stab at Natasha's past while also trying to introduce new characters to the MCU. Unfortunately, nothing substantial was added to the story of Black Widow. The gravity of Budapest was lacking, the truth behind the Black Widows was ill-conceived and I was just bored throughout. There were a few unique moments of storytelling and some clever callbacks to other entries in the MCU. Florence Pugh was great, though all the fake Russian accents were grating at times. Had this movie come out right after Civil War, I would have enjoyed it more. Unfortunately, knowing the fate of the main character makes this film seem like an afterthought."
  },
  {
    "rating": "2/5",
    "review": "Could have been way better, :("
  },
  {
    "rating": "1/5",
    "review": "The only good thing about this movie was the introduction of Yelena and Red Guardian. The movie can´t stand its own ground without the public love for Nat. Horrible CGI to top it off"
  },
  {
    "rating": "5/5",
    "review": "Love Scarlett Johansson, Florence Pugh! Amazing Actresses who can kick some cans and make it look real! I highly enjoyed the dialogue between the sisters and the script altogether.... characters, action and storyline. Watched it a few times!! We need more female led action films with strong scripts and production all around! Fun and original. I'd like to see another part 2!"
  },
  {
    "rating": "0.5/5",
    "review": "Why did they make such a bad movie for such a well-developed character?"
  },
  {
    "rating": "1.5/5",
    "review": "I never finished that movie, it just got out too late. Disney definetly wanted something to make money, and thats the best thing they were able to come up with"
  },
  {
    "rating": "2/5",
    "review": "Disappointing to say the least. I couldn't care about any of the character besides Natasha herself. Taskmaster was wasted so hard as the villain, he's definitely one of the more forgettable MCU villains. The CGI was fine, but there were a few shots where it was just plain BAD. The movie is also just way too long for it's own good.. they could have paced it a lot better. Best way to describe this movie is forgettable. There was just nothing for me to grasp from this movie and I was bored for more then half of it."
  },
  {
    "rating": "2/5",
    "review": "Bad casting, no chemistry between the actors. Movie suffers due to the lack of chemistry between all the actors."
  },
  {
    "rating": "1/5",
    "review": "I still don't understand how this movie has 79% critic and 91% at audience percentage. Very weak plot and most forgettable characters and cringe climax battle. Worst movie in MCU according to me..!!"
  },
  {
    "rating": "1/5",
    "review": "Devuélveme mi tiempo, perdido."
  },
  {
    "rating": "1.5/5",
    "review": "They tried. They failed."
  },
  {
    "rating": "3/5",
    "review": "Mid marvel film that's very unnecessary"
  },
  {
    "rating": "3.5/5",
    "review": "Notwithstanding all the drama behind the scenes and in courtrooms, Marvel's Black Widow\" is an apt standalone feature for the badass mercenary turned Avenger, diving deep into her back story. While there was plain knowledge that Natasha Romanoff was a defected spy and assassin from Russia, Cate Shortland's film goes right back to her childhood and a fleeting view of events on her journey and affiliation with America. An older child in a family of Russian spies embedded in Ohio, Natasha along with her kid sister Yelena and parents are forced to flee the country when her father, Alexei (David Harbour) is busted after completing a major espionage mission. Natasha is reluctant and fears the return to her country of origin, possibly for things she has seen and experienced, while Alexei and her mother, Melina (Rachel Weisz) are bound by their loyalty to a General Dreykov (Ray Winstone). We then cut forward to a point of time, post the events of \"Civil War\", with Natasha already an Avenger and on the run for being an outlaw by affiliation with Captain America and the squad that backed him. Yelena (Florence Pugh) is now a brainwashed Black Widow assassin working for Dreykov and his \"Red Room\", but during a mission to assassinate a rebel is freed from her mind-controlling chemical/drug. Yelena seeks out help from her sister and the rest of her family who have been split and separated over the years, to find Dreykov. And it is indeed a fun reunion. The film is evidently action packed and the action is good, supported by adequate and slick CGI. Scarlett Johansson leads with a punch and a kick-some performance in what might be potentially her last swing as the \"Widow\". Florence Pugh is an enterprising entry as the younger \"Widow\"; a rising actress, the film makes way for more of her in the Avengers universe. David Harbour is hilarious in his bits, and Rachel Weisz plays an adequate part in the dysfunctional and bantering but fun family. And there are a couple of interesting cameos from Olga Kurylenko and O. T. Fagbenle (of \"The Handmaid's Tale\" fame) It isn't something exceptional – but it's tightly held together with a good cast and it's definitely better than some of the recent Marvel content that's been out there. Mostly powered by ScarJo and the represented retribution of women breaking out of manipulative strings, #MeToo or otherwise."
  },
  {
    "rating": "5/5",
    "review": "Was a great film. Loved the Cold War take. Sad to know she's now forever written out of the MCU."
  },
  {
    "rating": "3.5/5",
    "review": "There wasn't much about black widows history and background. So I really liked this movie. See how the character became her."
  },
  {
    "rating": "3.5/5",
    "review": "A dark movie that gives off the vibe of phase 3 as Yelena and the dad steal the show."
  },
  {
    "rating": "3.5/5",
    "review": "Overall, this is a pleasing instalment of the Marvel universe.  At the same time, it is not as exciting as all other Marvel films before, but it is still fun, brainless and highly familiar.  Some plot details did feel complex or vague during the film's rocky opening, but this improves as the film progresses.  Action is excellent, but it is also fast-paced and differs from the previous films with slightly less excitement and a \"wow factor\".  Music is pleasing but sadly somewhat forgettable, and the audio relating to dialogue sometimes felt challenging to hear.  Either way, it is still an exciting film for the character, but I cannot deny I hoped for something far more significant than being \"just another Marvel film\"."
  },
  {
    "rating": "4/5",
    "review": "Black Widow shows that being a superhero is not always linked to having superpowers and touches on the point of human exploitation, in this case female, for repulsive ends. In a path of good action scenes, family drama and exploration theme Black Widow is a closing film with good performances, comic scenes and even \"heavy\" for the MCU."
  },
  {
    "rating": "5/5",
    "review": "my favorite character, I want it back I loved the movie"
  },
  {
    "rating": "3.5/5",
    "review": "It's a long movie. Unsympathetic characters incessantly beg for sympathy in between the smash crash scenes that likewise go on for too long. Fortunately, Scarlett and Florence aren't hard to look at."
  },
  {
    "rating": "1.5/5",
    "review": "Super boring, story is also confusing"
  },
  {
    "rating": "3.5/5",
    "review": "Watched it the first time and wasn't a big fan. After watching it a few more times, I loved it twice as much as the first time."
  },
  {
    "rating": "3.5/5",
    "review": "Fun movie. Nice spy thriller stuff, and the family dynamic is great."
  },
  {
    "rating": "5/5",
    "review": "My only complaint is this wasnt made sooner. Really fun movie and perfectly cast!"
  },
  {
    "rating": "2/5",
    "review": "The overly drawn-out drama retreads the same ground over and over, and the action is so poorly framed it isn't engaging in the slightest. This movie might have the best side characters of any Marvel movie so far though."
  },
  {
    "rating": "3.5/5",
    "review": "de los mejores intros e inicios del ucm ,temas profundos y reales bien manejados e interesantes pero que pierden un poco de importancia en la trama ,llena de acción y muy entretenida ,florence pugh magnifica en su papel ,los puntos bajos de esta película es haber llegado tan tarde cuando el personaje principal ya esta fuera de juego ,un villano inolvidable y una pesima adaptacion de taskmaster este punto realmente si lo odie"
  },
  {
    "rating": "3/5",
    "review": "This is a pretty good movie I like how they showed a back story of black widow and her family to make you love the character even more. But the third act suffered and I’m not a fan of the red guardian. The villain is very bad."
  },
  {
    "rating": "4/5",
    "review": "Everything it needed to be"
  },
  {
    "rating": "4.5/5",
    "review": "Black Widow es sin duda una de las mejores entregas del MCU ya que en vez de ser una película de superhéroes, es un film de acción que se siente apartado del género al que Marvel se dedica. Scarlett es lo mejor (siendo esta su ultima película de Marvel) y la película es bastante impecable y fresca. Da detalles sobre el origen de Natasha y nos presenta una espectacular historia de ella enfrentándose a su pasado en un reencuentro con su hermana y sus tutores. Su única falla es haberse realizado después de Endgame ya que se tendría que haber hecho años antes, pero es una película aceptable. Mi nota para este film es un 9/10."
  },
  {
    "rating": "3.5/5",
    "review": "There are no stakes in this movie, but it is still enjoyable. My biggest issue is the misuse of Taskmaster as a character, in that she isn't a character. She is used as a pawn instead of an actually intelligent villain. It is still a good time watching but it feels repetitive."
  },
  {
    "rating": "3/5",
    "review": "the problem I have with prequels is if you know what gonna happen to the character then it doesn't add any high risk with them, this movie didn't really add anything to the black widow as a character since the spoiler she is dead, they ruined taskmaster by making it some random guys daughter that he controlled for some reason, the action was fine, CGI ok. Yelena and the red guardian carried the movie. saw it in theaters and i think it would have been better if i watched it at home."
  },
  {
    "rating": "4.5/5",
    "review": "Did not like what they did with TaskMaster."
  },
  {
    "rating": "4/5",
    "review": "Good film that helps to understand the history of Black Widow but has no great influence on the future happenings of Marvel"
  },
  {
    "rating": "3.5/5",
    "review": "we now know natasha's back story and her family"
  },
  {
    "rating": "3/5",
    "review": "Good action and not that much else."
  },
  {
    "rating": "1.5/5",
    "review": "Such a promising beginning in the middle with great Jason Bourne style action and interesting story but quickly losing steam in the last act which takes it so much more down with terrible CGI and just Really really really bad action I don't know how you were able to ruin such a promising movie but somehow the end of this film is just terrible Jelena was a great addition though so who's complaining 3/10"
  },
  {
    "rating": "4/5",
    "review": "\"Black Widow\" (2021) is a thrilling and well-crafted addition to the Marvel Cinematic Universe. The plot provides a compelling origin story for the titular character, exploring her past and the events that shaped her into the assassin we know and love. The acting is strong, particularly from lead Scarlett Johansson, who brings nuance and depth to her performance. The supporting cast is also excellent, adding layers to the film's complex world and story. The cinematography is visually stunning, capturing the high-stakes action and espionage with a sleek and stylish flair. The direction is confident and effective, keeping the pacing tight and the tension high. The film's score is pulse-pounding and perfectly complements the on-screen action. However, the film can be criticized for its somewhat formulaic plot and predictable twists. Additionally, the film's villain is underdeveloped and fails to provide a truly compelling threat to the main characters. Overall, \"Black Widow\" is a thrilling and well-crafted film that provides a satisfying origin story for the titular character. While it may not reach the heights of some of the best films in the Marvel Cinematic Universe, it is still a solid entry that fans of the franchise will enjoy."
  },
  {
    "rating": "0.5/5",
    "review": "Laughably bad CGI, poor writing, and awful plot lines make for one of the worst Marvel movies to date. Y'all are actually delusional for rating this movie so high."
  },
  {
    "rating": "2/5",
    "review": "Not only did they introduce a Walmart taskmaster but the plot armour couldn't be any more obvious. How they survive their car being hit by an explosive, landing on the tank, rolling over multiple cars and down a flight of stairs upside down takes you right out of the movie. That's just the first of many issues with the movie which is disappointing knowing the comics involving taskmaster. I was extremely hyped for this movie and I watched half and then turned it off and finish it over the course of a few days. Not terrible but eh kinda movie."
  },
  {
    "rating": "4/5",
    "review": "One understands more than ever what a difficult life Natasha Romanoff had. Florence Pugh steals the show as Yelena Belova."
  },
  {
    "rating": "3/5",
    "review": "A long overdue sequel that is as mediocre as it gets, we learn a lot about Nat and her past, but this was mostly so Marvel could set up the Thunderbolts and go in a new direction"
  },
  {
    "rating": "3.5/5",
    "review": "Não curti muito. Deveriam ter feito um filme ao nivel da Viuva Negra, mas mesmo assim dá para assistir. A Yelena é o ponto forte do filme. As cenas de ação são normais e genéricas, eles ficam empurrando e forçando a amizade delas e ainda o reencontro. Um filme que dá para ver, mas não ao nivel da Viuva Negra. O vilão é um dos piores!"
  },
  {
    "rating": "1/5",
    "review": "Worst CGI, boring plot F"
  },
  {
    "rating": "2/5",
    "review": "Not sure why it's rated highly, it wasn't that good. It was ok at best."
  },
  {
    "rating": "3/5",
    "review": "A weak start to the phase four movies, and the weakest film of the multiverse saga so far."
  },
  {
    "rating": "2/5",
    "review": "Other than introducing characters to be used in future films, this movie is a pointless, too-late, boring filler. The post-credits scene is possibly the stupidest one in MCU history."
  },
  {
    "rating": "4/5",
    "review": "Cate Shortland's long-awaited addition to the Marvel Cinematic Universe has finally made its theatrical debut. The film mixes established characters and explosive action in a globe-trotting adventure. Johansson makes her final appearance as the titular hero in a story that delves into past and future events in the elaborate universe. Fresh off the events of 'Captain America: Civil War', Natasha Romanoff (Scarlett Johansson), now a political fugitive, must go into hiding and begin anew after violating the Sokovia Accords. But when her past catches up with her, Natasha must dive back into a dangerous conspiracy, confront the red in her ledger, and outrun an unstoppable force. Cate Shortland makes her MCU debut alongside a star-studded cast that includes Rachel Weisz, Florence Pugh, David Harbour, OT Fagbenle and Ray Winstone. Shortland manages to bring these exciting new characters together in a way that explains who these characters are while keeping the explosive action moving. Johansson once again slips into the role of the Russian spy with ease. She delivers a brilliant performance, making her eighth appearance as the trained assassin the perfect way to end Natasha's story within the MCU. Florence Pugh's Marvel debut allows the talented actress to show off her vast range, bringing the character of Yelena Belova (fellow Black Widow assassin) to the screen. Pugh's performance is comedic and emotional, and her sister-like bond with Natasha is the perfect way to mix some much-needed comedy into the film's dark subject matter. The film's post-credits scene implies that Marvel intends to bring Yelena into the Disney+ series 'Hawkeye', which should arrive Fall of this year. So fans of the blonde assassin shouldn't have to wait long before seeing her back in the MCU. Like every other Marvel production, 'Black Widow' does a splendid job referencing MCU past and future, providing context for previous references. But the film also gives viewers a much-needed insight into Natasha's past life. Despite Marvel's impressive track record in the visual effects department, 'Black Widow' doesn't appear to be up to par with the numerous other MCU projects that came before it. Natalie Abizadeh brings her talent to the screen, providing each character with attractive yet practical hairstyles that range from intricate braids to simplistic ponytails. Even though 'Black Widow' is a Marvel production and comes from a studio most notably known for their big-budget, explosive blockbusters, it still manages to deal with incredibly deep themes such as family, free will and human nature. Shortland features shots of fireflies at both the start and end of the film; these insects resonate with themes such as hope and guidance. But more importantly, fireflies relate to the importance of our internal character, which in Natasha's case is something that the character struggles to deal with. If you're new to watching Marvel's vast, interconnected universe, then 'Black Widow' might not be the best place to start for numerous reasons. Not just because the majority of viewers will already know the events of the 2019 film 'Avengers: Endgame', but because there's a plethora of minor details and references that will fly straight over your head. The stunt choreography displayed over the 134 minutes is a somewhat fresh take on what viewers have previously seen, with no vibranium shields or telekinetic powers. All these characters have to rely on is mundane weapons and their surroundings (e.g. furniture/ home decor), as seen in the Budapest apartment fight scene in which Natasha and Yelena attempt to strangle each other with a curtain. The fact these characters don't have hi-tech weaponry gives it a slight sense of realism and adds another layer of tension. But viewers are moved to the edge of their seats wondering who will win. Overall, 'Black Widow' is a film that is a balanced mix of hilarious comedy, emotional drama and explosive action, led by a stellar cast that each provides brilliant performances in a film that contributes to the Marvel Cinematic Universe in more ways than one. Cate Shortland gifts viewers a heartfelt goodbye to the titular character in the 24th addition to the forever-growing Marvel universe."
  },
  {
    "rating": "3/5",
    "review": "The stand-out part of Black Widow was Yelena and as usual, marvel had a weak written villain who did not have a strong motive."
  },
  {
    "rating": "2/5",
    "review": "I just didnt like it. There are better marvel films out there."
  },
  {
    "rating": "5/5",
    "review": "It's everything I both wanted and expected from a Black Widow movie. Loved it. So powerful!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie could of been a lot better if they utilized Taskmaster better, such a wasted villain"
  },
  {
    "rating": "4/5",
    "review": "Finally we have a Black Widow solo film & it's finally released!!! Although about 7 years too late unfortunately. Don't get me wrong I'm super pumped we have a BW solo film, I just feel it probably should've been out back in 2014 after Winter Solder. Or at least well before the character had been killed off in the MCU. So of course knowing that, this film really didn't have the weight it probably should've. I mean we already know how Natasha's story is going to turn out. All that aside BW was still a very entertaining and highly enjoyable film! Not the best MCU film, but a solid entry. Albeit a weaker storyline. She's basically on a mission to bring down the \"Red Room\" and people behind it.  While BW was supposed to expand on Natasha's past we get some of that and we are introduced to her \"sister\" Yelena Belova portrayed to perfection by Florence Pugh. Yelena was pretty much the stand out for me. I suppose that is a good thing as she's most likely going to be taking up the mantle now. Yelena is a very likable and at times funny character. She's able to go toe to toe with Natasha as well as hold her own in fights. Between Yelena & Natasha you didn't really need the other \"family\" characters. Their dynamic together was awesome. They felt like true sisters. Melina (the mom) was ok, but barely any excitement or much use for her. Alexei/Red Guardian (the dad) was completely useless. He did not have a single thing to do and very little action. Both of those characters could've been omitted for me. They didn't lean much into the family dynamics as they could've so I felt both of them were just there for the sake of padding the talking scenes as neither had much action or furthered the story.  Speaking of the action, BW fell into WW84s problem in the third act. The third act here was more of a spectacle than WW84, but still very minimal hand to hand fighting. There was a brief scene with Natasha vs the other Widows, Red Guardian vs Taskmaster and Natasha vs Taskmaster. All of which were concluded so fast it made the big finale sequence very underwhelming. Speaking of Taskmaster there is a twist with the character, but still it's used very minimal. There was a pretty decent sequence early on on a bridge with Taskmaster and Natasha which was probably the standout. Other than that the character was very under utilized and subsequently \"defeated\" too quickly. The first half of the movie had some pretty good excitement and entertaining sequences, but slows down until the sloppy final act. This film had a lot of potential, but while enjoyable, it didn't live up to to that potential unfortunately. The end credit scene is actually really nice and helps set up some future stories. I will definitely check this out again as BW deserves her solo film, but just wish it were slightly better story wise and come along a lot sooner."
  },
  {
    "rating": "5/5",
    "review": "this is an outstanding film, the only qualm I have is the casting of ray winstone who doesn't look or sound Russian that aside it's an emotional and exciting visual feast and the first time we meet the wonderfully cynical Yelena. I absolutely love this movie."
  },
  {
    "rating": "4.5/5",
    "review": "Good action-movie and good actors. Some scenes are pure adrenaline."
  },
  {
    "rating": "2.5/5",
    "review": "Love to see it when I'm bored"
  },
  {
    "rating": "3.5/5",
    "review": "Natasha should have had her own spin-off or incorporated movie in the MCU before her inevitable death. This almost felt like they regretted killing her off and tried to get another story out of her. The cast and acting was great, I just wish the backstory part of the movie in the beginning rolled into more relevant event in the MCU timeline. Not an overly memorable movie but I still enjoyed watching it."
  },
  {
    "rating": "3/5",
    "review": "This is a prime example of too little, too late. This would have been fairly interesting if it had come out before endgame, but it seems misplaced and irrelevant as part of phase 4. Also, while it wasn't bad exactly, it was incredibly slow. I kept tuning out during the lengthy, predictable dialogues."
  },
  {
    "rating": "0.5/5",
    "review": "Movie was awfully boring, nearly fell asleep about two or three times in the first twenty minutes, turned it off."
  },
  {
    "rating": "3.5/5",
    "review": "A few years too late and Avengers 4 gutted some of its impact but as a standalone, this film really delvers. One of my favorite Marvel films in years."
  },
  {
    "rating": "4.5/5",
    "review": "I think this movie is a little overhated. It's not that bad, yes it's flawed and the pig scene is just distasteful, the fact they forgive their parents so quickly is weird. But other then that I think it's a good movie."
  },
  {
    "rating": "2.5/5",
    "review": "mid ahh movie - Light 5/10"
  },
  {
    "rating": "3/5",
    "review": "You can watch it one time and that's it"
  },
  {
    "rating": "4/5",
    "review": "Liked it. A good one time watch. Didn't like a few things and that left a bad taste in my mouth. 1. Taskmaster - not enough action scenes to fully appreciate the character. And It was disappointing to see Taskmaster unmasked. 2. Lack of a one on one convincing fight sequence."
  },
  {
    "rating": "0.5/5",
    "review": "so boring, useless for the phase 4"
  },
  {
    "rating": "5/5",
    "review": "Loved it. All the way around a fantastic movie. Sad it will probably be her last in the mcu."
  },
  {
    "rating": "5/5",
    "review": "A nice send-off for Scarlett."
  },
  {
    "rating": "3/5",
    "review": "The newest MCU film offers great performances, some entertaining action sequences and some emotional family elements, however amidst all those comes a dull and uniteresting story riddled with forgettable villains and a feeling of unorginality making it a disappointing start to phase 4."
  },
  {
    "rating": "4/5",
    "review": "No es excelente pero si muy buena en mi opinion, la historia es entretenida y te mantiene viendo de principio a fin"
  },
  {
    "rating": "1.5/5",
    "review": "Natasha Romanoff has never been one of the most interesting Avengers but in this movie she goes from uninteresting to boring. Her three co-stars were way more fun to watch compared to her and it's her damn movie. The first action scene is fine but all the action after that is boring as hell, particularly the final setpiece. I didn't care at all about the stupid plot and the villains were boring too. I've never read a taskmaster comic book but even I was dissapointed by how he/she was portrayed in the film. The only positive thing in the movie are some scenes where the characters are just talking. The movie is basically pointless, all it really does is setting up some character that will hopefully be in good movies after this."
  },
  {
    "rating": "4/5",
    "review": "It was good/fun. Enjoyed it."
  },
  {
    "rating": "4.5/5",
    "review": "This is NOT a superhero movie, so don't expect to see so many \"super human\" things in it. Both the movie and Natasha have a unique way of looking at life, more raw, grim and down to earth. There are people who complain saying \"this movie had no long-term effect on the MCU\", and those people are missing the focal point of the movie, it is not creating a new story to follow in the MCU, it is actually closing a cycle that started since we saw Natasha for the first time. Pleasant, entertaining, a good action thriller movie and overall a good experience."
  },
  {
    "rating": "3.5/5",
    "review": "I will say, I am not a fan of the all-female-action-movie genre. All such movies I have ever watched have turned out to be bullcr*p. This movie, however... This movie genuinely surprised me. It is a good action movie. In any case, it proved to me that all-female action movies can be done right, and made in such a way that even men can watch them and not cringe."
  },
  {
    "rating": "0.5/5",
    "review": "Did I watch this movie? No. Do I want to contribute to helping Hollywood make the decision to finally stop making superhero movies? Yes. Very badly. Please go back to making art. I'm sure the artists would rather make art. I don't care if these studios trip and stumble over themselves through their next 5 or so movies as long as they are aiming at something meaningful. Take some risk and hire some nutcases. David Lynch and similar weirdos would never get a chance today and that is a loss for everyone. I don't think that it's unfair for me to review a movie I haven't seen. I think it is unfair that when I look at what is playing in theaters, it's all made for mental midgets. Having half decent taste in today's society makes you feel like a cultural minority. That would be ok if it was truly representative, but I think people have much higher capacity for meaning that Hollywood would have you believe."
  },
  {
    "rating": "3/5",
    "review": "Could've been better. Felt weird. This movie should've been made before they killed off the character. Loved yelena tho"
  },
  {
    "rating": "3/5",
    "review": "This was rather boring. The combat scenes were superfluous, and simply over the top. There wasn't much thought given to character building."
  },
  {
    "rating": "3.5/5",
    "review": "Good plot, great acting, nice mid-credits scene, appalling visual effects."
  },
  {
    "rating": "0.5/5",
    "review": "Terrível do início ao fim"
  },
  {
    "rating": "0.5/5",
    "review": "No me gusto en absoluto… excesivo humor y bulling por parte de las hermanas Romanoff contra su Padre… la historia no se ajusta an universo de UCM"
  },
  {
    "rating": "4.5/5",
    "review": "Not a bad way to fill an empty spot between civil war and infinity war. This movie actually explains a lot about the backstory of Natasha and the actions are well-packed with the storyline"
  },
  {
    "rating": "5/5",
    "review": "Black Widow is an action-packed and emotional superhero movie about Natasha Romanoff's dark past. The opening scene is probably one of the best scenes we've ever seen in MCU. The movie becomes exciting because of the family dynamics of the main characters. It's gritty but funny at the same time. The action scenes are consistently good and even the music stays in your head. The cast is excellent throughout. In my opinion, one of the darkest and best Movies in the MCU."
  },
  {
    "rating": "1/5",
    "review": "Second time i have tried to watch this movie and still 1 hour in turning off"
  },
  {
    "rating": "3.5/5",
    "review": "Despite some darker moments coming from the MCU, Black Widow has too much action scenes especially at the beginning when everything goes too fast. When the movie finally takes its time it becomes a great Marvel with a tense and explosive last act. I saw a lot of people saying the movie is useless considering Natasha's faith in Endgame but this movie does have a purpose, even in the main MCU storyline, by introducing Yelena which has good chance to become an important player in the MCU."
  },
  {
    "rating": "4/5",
    "review": "Much better than I thought it would be. Wasn't quite up to par with many other MCU movies but still good."
  },
  {
    "rating": "5/5",
    "review": "I loved the movie and it will forever be one of my favorite movies."
  },
  {
    "rating": "3.5/5",
    "review": "Black widow is meh. No more no less"
  },
  {
    "rating": "2/5",
    "review": "It had some fun new characters but butchered fan favorite Taskmaster. Black Widow is an MCU movie that I will soon forget about and not revisit for a long while."
  },
  {
    "rating": "5/5",
    "review": "Best of Movies/TV Series Collection"
  },
  {
    "rating": "3.5/5",
    "review": "Good humor and action throughout. Would have been boring without David Harbour. Scar-Jo’s heiney gets plenty of much-deserved screen time."
  },
  {
    "rating": "1/5",
    "review": "filme mais ou menos, o roteiro é fraco, tem muito dialogo para poucas cenas de ação, achei legal a parte algumas partes mas não foram o suficiente para o file ser bom, e o filme falhou um pouco nas partes com o cgi, a cena da Yelena Belova irmã da viuva negra, na parte antes da explosão do helicoptero, dá para ver o fundo meio diferente, parece que não tinha uma nada de caotico a cena, ficou meio estranho."
  },
  {
    "rating": "4.5/5",
    "review": "By far the best Marvel movie. The chemistry between the characters is outstanding, especially between Scarlett and Florence. Scarlett gives the expected engaging performance, but it's Florence Pugh who elevates this movie. She alone is worth watching this. David Harbour has some great scenes too and is pure comedy gold. Apart from the overblown finale the action looks very real and not just CGI. The highlight is the fight between Natasha and Yelena."
  },
  {
    "rating": "4.5/5",
    "review": "I watched this movie twice and enjoyed it a lot, I love this whole family theme going on. Scarlett Johansson is perfect again in her portrayal of the Black Widow. The only thing I have a problem with is that it wasn't as meaningful cause it was made when the main character already died in the Endgame movie, no high stakes, no real danger to the character which is the only reason this movie wasn't completely perfect to me. If they released it before Endgame and made some meaningful connection to the Hawkeye character to make her death even more emotional it would elevate both movies."
  },
  {
    "rating": "0.5/5",
    "review": "Sorry but nobody can talk me out of saying this movie is bad"
  },
  {
    "rating": "4/5",
    "review": "\"Black Widow\" is an action-packed and entertaining film. Scarlett Johansson brings her A-game as the titular character, showcasing her incredible physicality and emotional depth in every scene. The supporting cast is equally impressive, with Florence Pugh delivering a hilarious and scene-stealing performance as Yelena. While the film's villains were a bit weak and some of the VFX sequences could have been better, the movie's strengths far outweigh its shortcomings."
  },
  {
    "rating": "2/5",
    "review": "I desperately wanted to enjoy this film. Black Widow was one of my favorite MCU characters, and after Winter Soldier I really wanted a solo film for her. Unfortunately, this film wasn't action packed, wasn't funny, and wasn't entertaining. The story here falls flat, is mind boggling stupid at times, wastes the potential of characters, and has a villain straight out of a bad comic book. Sad that this was Black Widow's swansong because she deserved better."
  },
  {
    "rating": "5/5",
    "review": "I actually really liked this movie and Inreally hope we see more of her sister in more things. She is a great character and the actress did an amazing job with the role. Unrelated to this movie but I was very upset there was not more talk of pockets in Hawkeye."
  },
  {
    "rating": "1/5",
    "review": "Not a good movie. The 2 stars were cast well but the story and everything else was not good. Story should have been done 10 years ago."
  },
  {
    "rating": "2.5/5",
    "review": "it was ok when i first watched it but i didn't enjoy it when i tried again"
  },
  {
    "rating": "4/5",
    "review": "Very good, I like the characters and the story is very good."
  },
  {
    "rating": "3/5",
    "review": "Overall, I think this movie was pretty good. The plot was pretty good, the acting was good. I didn't like how they did Taskmaster dirty. 3 = Pretty Good"
  },
  {
    "rating": "3.5/5",
    "review": "Completely loved it! The whole stuff with her family and sister was amazing 101% recommend it"
  },
  {
    "rating": "5/5",
    "review": "Definitely one of the better Marvel films. Johansson and Pugh made a great team. Really good action story with a satisfying ending. I laughed and almost cried at some parts."
  },
  {
    "rating": "2.5/5",
    "review": "If I wanted to watch beautiful women getting hot and sweaty, I'd have watched a different kind of movie."
  },
  {
    "rating": "2/5",
    "review": "An amazing character in a disaster of a film. Black Widow shines once again but does not have a good foundation to balance her on and she ends up falling."
  },
  {
    "rating": "3/5",
    "review": "ScarJo was the secondary in this movie compared to her family, all of which overshadowed her. Plot was mostly ignorable, Taskmaster was criminally dumbed down for no reason. Black Widow vs an interesting Taskmaster along with the BW family there for side plots would have been an easy top tier movie to write. Just needed a Taskmaster related Deadpool cameo at the end and this would have been a $1B movie, praised for years to come."
  },
  {
    "rating": "5/5",
    "review": "great movie love Natasha #blackwido"
  },
  {
    "rating": "0.5/5",
    "review": "Just not the marvel I've been watching since my childhood."
  },
  {
    "rating": "3/5",
    "review": "Not my favorite Marvel movie but it wasn't the worst"
  },
  {
    "rating": "5/5",
    "review": "Amazing! It told the perfect story of the Black Widow. With great new characters, great music, impeccable action scenes, great special effects and an amazing villain."
  },
  {
    "rating": "3.5/5",
    "review": "Good movie. Always love Marvel films"
  },
  {
    "rating": "5/5",
    "review": "Really strong and nice send of for Nat, and a fun way to introduce a great new hero played by Florence Pugh."
  },
  {
    "rating": "2/5",
    "review": "Very bland, not worth the time and money put into the film."
  },
  {
    "rating": "3/5",
    "review": "After many months of Covid delays, Black Widow's solo film released into theatres. I've heard many say this is the worst or one of the worst MCU films of all time. Based on personal opinion, this movie at times can get a little boring but as a whole, still holds up alright. Not the finest movie and nowhere near perfect, but a reasonably decent film to be added to the MCU collection. Decent ---------------- 6.6/10 (3/5)"
  },
  {
    "rating": "0.5/5",
    "review": "Awful film. Doesn't contribute anything to the MCU's story. The story inside the movie just isn't enjoyable. Certain scenes have horrible CGI."
  },
  {
    "rating": "1.5/5",
    "review": "Not gonna lie I kinda liked the performance of Black widow but the plot/cgi of the movie just killed it"
  },
  {
    "rating": "4/5",
    "review": "waited for this movie for so long. ive always wanted to know abt black widow's childhood."
  },
  {
    "rating": "2/5",
    "review": "I'm going to say it. The MCU is officially evolving backwards. Black Widow is a pretty bad prequel to a deadly spy of the Avengers. Yes, great character moments, but the script and plot didn't fulfill. I wish there was less talking, more action and plot. Honestly hoped for a good Black Widow story since she is one of the most interesting members of the team. Also come on guys, give the VFX team more time! Black Widow Rating: B- for Black Widow's wasted potential."
  },
  {
    "rating": "3/5",
    "review": "While it is a \"minor\" entry into the Marvel universe of movies, it's definitely worth a watch for Marvel fans (I would put it on par with Antman and Thor...definitely better than Thor: The Dark World). Florence Pugh nearly steals the spotlight from Johansson here...she is mesmerizing and practically could have carried the film herself."
  },
  {
    "rating": "2.5/5",
    "review": "Zwyczajny, bardzo poprawny, dosyć nijaki. Trochę naciągana fabuła, ale bez tragedii. Żałosny dubbing (szybko zmieniłem)"
  },
  {
    "rating": "3.5/5",
    "review": "It's ok, not bad. Fun to watch."
  },
  {
    "rating": "4.5/5",
    "review": "One of the best movies in the Marvel franchise. The bond between the female leads makes this a fun and entertaining movie that pulls at your heartstrings as well as you to the edge of your seat. The family dynamic is orchestrated perfectly and therefore keeps you from wanting to look away from the screen. A must-see for any Marvel fan"
  },
  {
    "rating": "3.5/5",
    "review": "My rating for the film is a 7.9/10"
  },
  {
    "rating": "2.5/5",
    "review": "If this movie came up a little bit early I think it might be good. But unfortunately, this movie came after the event of avenger: endgame, and this movie feel empty because the black widow's sacrifices in the endgame really emotional. Watching this movie is like seeing a dead character and for me is not a great feeling. This movie exists only to set up Yelena's character in a future film. Overall the story is decent and the good thing about this movie is just the action scene is kinda great."
  },
  {
    "rating": "5/5",
    "review": "I love this movie because we got to know more of Natasha's past and her other family that she loves."
  },
  {
    "rating": "2.5/5",
    "review": "got made to late and kind of boring"
  },
  {
    "rating": "3/5",
    "review": "The beginning of this film captured the essence of what I wanted the rest of it to be. Unfortunately it was toned down; there could have been more seriousness included to truly shine."
  },
  {
    "rating": "3.5/5",
    "review": "A fun spy thriller that came 5+ years too late. They shouldn't have waited till this character was dead to give her a film of her own. It serves to introduce Florence Pugh's Yelena who is a great character performed well by her."
  },
  {
    "rating": "2/5",
    "review": "Disney siendo Disney, aburridísima, con incongruencias de guion, los personajes desaprovechados, CGI malo, otra película dirigida a niños sin sangre, ni acción ni nada de coreografías decentes. Mala suerte por Scarlett."
  },
  {
    "rating": "2/5",
    "review": "I just didn't get it. The story felt pretty confusing and not as entertaining. Black Widow as a character is great, but I think they just waited way to long to get her own solo movie."
  },
  {
    "rating": "3/5",
    "review": "Another failed attempt of the MCU to blend superhero movies with genre cinema, in this case spy thrillers, Black Widow represents a step down to the studio, with a weak and excessively formulaic plot that entertains because of it's charismatic cast and some \"indie\" filmmaking choices brought by Shortland."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is trash! The ones giving high praise to this abomination are clearly deaf, blind and mentally feeble. Scarlett, you're better than this. Florence Pugh, you're not. Just a completely horrible movie and a big waste of time."
  },
  {
    "rating": "2.5/5",
    "review": "It's confusing if the initial release of this movie worn out people or the need of this movie to be made was suppose to be during Phase 3 or before. It's not remarkable compared to other spy/action films as it also has the same action sequences & stakes. It's other character's moments kinda helps the movie to be entertaining, but the direction of the film to a big finale and surprise twists was still not able to aid the overall movie."
  },
  {
    "rating": "0.5/5",
    "review": "Garbage way to end black widows run in the mcu. PHASE BORE"
  },
  {
    "rating": "2/5",
    "review": "It wasn’t a needed marvel movie. It should’ve been made long ago. The only redeeming quality is it’s comedy which is some of the best in the MCU"
  },
  {
    "rating": "0.5/5",
    "review": "Why did they change taskmaster?"
  },
  {
    "rating": "4/5",
    "review": "Black Widow is Marvel's spy thriller, and despite its issues, the movie is still entertaining. Scarlett Johansen's Black Widow is a fun character, although her character is undercut by the fact that we already know her fate in Avengers: Endgame (this movie was supposed to be made and released before Endgame). Florence Pugh's Yelena steals the show, and the rest of the cast is also well-acted and adds some humor and emotion. And though the action scenes are entertaining, and the emotional moments tug on the heartstrings, Black Widow has some flaws. The stakes are more personal than global, which is fine considering what we know happens to Natasha Romanoff later on. The villain isn't exciting, but this movie is more about the personal redemption and arc of Romanoff than the villain (for better or worse). But the bigger problems lie in the secondary villain and action scenes. Taskmaster had so much potential to be a great villain, and though they had some great action scenes, the charcater was totally undercut by the end of the movie. The action, though fun, was very brutal and doled out vast punishment to the characters. If these were superpowered heroes, that would be fine, but both Nat and Yelena are regular humans that should not survive the damage they take in this movie. The final action scene is fun, but for such a grounded movie, feels very out-of-place. Overall, Black Widow suffers the most from such a delayed release, but the majority of it is fun enough to be worth a watch."
  },
  {
    "rating": "3.5/5",
    "review": "Yeah, this is better than CATS."
  },
  {
    "rating": "1.5/5",
    "review": "The only thing the movie had going for it was the new addition of Yelena, everything else was rough to even acknowledge as a Marvel movie. It disappoints me the most that the script was awful and they didn't think about re-doing it to make the movie stronger, and make more sense."
  },
  {
    "rating": "4/5",
    "review": "Wish taskmaster was better in this. Besides that movie was solid. Wish it came out in 2016-2017 tho... you know when it takes place. Only made it after because her sister."
  },
  {
    "rating": "2.5/5",
    "review": "Story is lacking, lack of passion. Didn't fulfil our expectation of Budapest incident. Taskmaster is a wasted, character development was weak. But Yelena was good, full of mystery vibes."
  },
  {
    "rating": "3/5",
    "review": "It was OK, didn't like most of the plot"
  },
  {
    "rating": "0.5/5",
    "review": "ScarJo deserved more than a script rushed out in 11 days. Followed by this clumsy hand off to a boring \"WHO?\", in a void of MCU nothingness. Characters are just outfits now so who cares. Shame on you Marvel and Disney, disgusting."
  },
  {
    "rating": "3.5/5",
    "review": "MCU brings fourth a lavish tale about Natahs (a.k.a Black Widow). I was hyped and pumped about this movie, but a bit disappointed on how the movie turned out. It wasn't my favorite MCU movie, but it was quite interesting, to be honest, to know about Natahsa's past. I was expecting the title card to come around the 5 minute mark, but it wasn't till like the 10 or 12 minute mark. Because of that, I thought I was watching the wrong movie in theatres. I didn't think this movie was going to be disturbing, but I was surprised on how intense the action was. It was PG-13 kind of action, but man was that intenser than I thought! Black Widow isn't a failure of a movie, but I felt they could have made this better and more understandable -- they didn't exactly made it easy to understand her past, I felt like!"
  },
  {
    "rating": "3/5",
    "review": "pretty disappointing"
  },
  {
    "rating": "3/5",
    "review": "This movie tells at best a decent story on Natasha Romanoff right after the events of Civil War, but it was very boring on some aspects. The story was kind of generic and uninteresting, and the villain was also not notable at all. The actors performed very well though, and I like the addition of Yelena especially. We should've gotten this movie right after Civil War came out, and after about 5 years of waiting was it worth it? Not really, but it's a passable MCU film."
  },
  {
    "rating": "1.5/5",
    "review": "Somewhat cheesy at times, just a meh movie."
  },
  {
    "rating": "3/5",
    "review": "Black Widow can be summed up in one sentence: Marvel x James Bond / Mission Impossible. This movie relied more on action set pieces and big explosions to make up for the adherent lack of superpowers in this movie, which I really dug. Watching Black Widow, Yelena Belova, Red Guardian and Taskmaster all fight hand to hand, skilled combat was really awesome and a refreshing break from superpowers that was rather needed, and I would say I preferred this to the standard superpower fight scenes. The newly introduced characters of Red Guardian and Yelena Belova created many more exciting opportunities for future movies and the potential replacement Black Widow in Yelena Belova. However, I would have to say that they ruined Taskmaster, as they made her totally different from the comics, which although that didn't bother me turning her into a superhero really ruined any chance of Taskmaster as a future villain and the remaining part needed for the Thunderbolts. General Ross had a unique but confusing appearance in which he was included but generally forgotten about with a time skip stopping us from seeing why he was there, but as long as it's justified in a later film I'm good with it. The main villain was Dreykov, a rather forgettable villain that was rather basic although needed to set up the next movies in phase 4 and the progression of Yelena Belova for future movies. The end credits scene hints at a future movie where we will see Yelena Belova vs Ronin which I am super hyped to see and definitely can't wait to see. Overall, Black Widow set up a great amount of new movies and was a really good start to Phase 4 of Marvel movies."
  },
  {
    "rating": "3/5",
    "review": "Florence Pugh outshines all of her cast mates in \"Black Widow\", including leading lady Scarlett Johansson who also delivers a passionate performance. Unfortunately, this duo wasn't a good enough distraction from the film's wonky CGI, weak antagonists, and perplexing action sequences."
  },
  {
    "rating": "4/5",
    "review": "I started to lose interest in the MCU after Acengers:Endgame. I found it too portentous, way too long and narratively lazy. The combined forces of that and COVID kept me away. Then Disney+ arrive in my lounge, I want something new but not taxing on a bad Long Covid day. This was just the ticket. It's the love child of Marvel and Mission:Impossible, complete with terrific stunts and action set pieces. The central villain's plot may seem hard to pin down, but Johansson is good and it's lovely to see the always excellent Florence Pugh given a key role in a film like this. There's a pleasing lack of the meaningless cityscape destruction that so often features in superhero films, and Marvel's trademark style of wit fits well in the action spy context. Fans of the tv show Alias like me may spot some of its influence also, and it seemed to me that there's more than sniff of a feminist take about this that works pleasingly (though of course women should critique that). Yes it's still quite generic (and, of course, overlong … but not Endgame overlong at least), but the mix of genres definitely gives it a different feel throughout, to the extent that even Ray Winstone's absurd attempt at an accent doesn't jar too much. Terrific entertainment just when I needed it, I'm freshly motivated to try catching up with the rest of the MCU films I've missed."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing film, would watch again"
  },
  {
    "rating": "4.5/5",
    "review": "yalana stole so many scenes. was a fun movie that grew BWs character arc....but should've been released prior to End Game"
  },
  {
    "rating": "3/5",
    "review": "The story line is okay and the effects and the cinematography is good. The action scenes are too busy and go way too long and are frustrating when it's obvious that it comes down to stupid luck rather than skill or intention. Of course its fiction and based on comics, but it's still more enjoyable thinking that somehow the skills and powers actually matter in the Marvel universe."
  },
  {
    "rating": "4/5",
    "review": "really loved the addition of Florence Pugh; was a great female-lead film. would definitely recommend!"
  },
  {
    "rating": "0.5/5",
    "review": "Wow!! Truly horrible"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies ever"
  },
  {
    "rating": "0.5/5",
    "review": "The utmost generic movie I have ever seen, the direct is highly regarded for her indie movies in the indie world, why would get such an amazing an indie director and tell her “ok, now forget everything u know and make an action comedy” it makes absolute no sense. You can feel the director trying to be something she’s not."
  },
  {
    "rating": "5/5",
    "review": "I loved it more than I thought"
  },
  {
    "rating": "3.5/5",
    "review": "I enjoyed this - not perfect by any means, but the \"family\" interactions were good, and I really liked that we finally got time to learn who Nat really is."
  },
  {
    "rating": "0.5/5",
    "review": "Would you believe me if I said there was no plot?"
  },
  {
    "rating": "3/5",
    "review": "There's some good humor, otherwise Marvel isn't exactly at their very best. The villains make the ones in Ant-Man and the Wasp seem memorable."
  },
  {
    "rating": "3.5/5",
    "review": "I'm glad Natasha Romanoff finally gets her story told, but the movie is more than just about her, but the people around her from what we can call a 'different life'. Lots of action, lots of emotion and do stick around for a post credits scene setting up stuff for the future!"
  },
  {
    "rating": "5/5",
    "review": "Movie was so good i didnt mind how they took spidermans villain but the movie was so good"
  },
  {
    "rating": "2/5",
    "review": "This movie was… okay. There is a lane in which this movie works very well; that of the #MeToo movement from years ago. The main villain, some slime ball named Dreykov, is basically what you get when you make Harvey Weinstein a Bond villain. Florence Pugh is a treasure, making the new character of Yelena Belova the absolute best part of the movie, a genuine good. I can't wait to see where she goes from here. Unfortunately, the good things run out here. The Russian super soldier guy is a buffoon, who doesn't quite understand why his pseudo-daughters hate him after he handed them over to the evil Russians that turned them into weapons. The woman that was the closest thing Natasha and Yelena had to a mother is just a mad scientist in a catsuit. These two \"parents\" are horrible people, and why Natasha went to them to them to put the Red Room in the ground instead of calling in, oh I don't know, CAPTAIN AMERICA and his posse is beyond me. There's also no Hawkeye. For a character that is so important to Natasha's story, he's mentioned but never shows up. It would have been better if this was the story of how Natasha escaped the Red Room all those years ago."
  },
  {
    "rating": "3/5",
    "review": "Zasługiwała zdecydowanie na lepszy film... a nie to co otrzymała."
  },
  {
    "rating": "5/5",
    "review": "loved the female roles"
  },
  {
    "rating": "2.5/5",
    "review": "One of the worst mcu movies to date"
  },
  {
    "rating": "2.5/5",
    "review": "It was a mid movie I dont understand how it is a 91% on audience rating and 79 the same as fight club which is wrong."
  },
  {
    "rating": "2/5",
    "review": "ação de baixa qualidade com roteiro basico. a scarlett deve ter ganhado muito dinheiro pra fazer um papel ruim desse"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was horrible and forced....the jokes were flat and at the wrong time. I know it's a movie....but when has a human ever fallen that far....hit that many things on the way down and then just walk away?"
  },
  {
    "rating": "5/5",
    "review": "Scarlett Johansen finally get the movie she deserves."
  },
  {
    "rating": "4/5",
    "review": "Black Widow serves up another savory helping of the blockbuster Marvel formula, with a fun family dynamic adding extra character development in the midst of all the action."
  },
  {
    "rating": "4.5/5",
    "review": "Absolutely a great movie. Loved Florence Pugh and all of the newcomers to the MCU. Just wish Black Widow had a movie before she died."
  },
  {
    "rating": "1.5/5",
    "review": "First of all the CGI is terrible in some scenes, It dragged on I just wanted it to end, And the beginning was so rushed BAD MOVIE."
  },
  {
    "rating": "0.5/5",
    "review": "The utmost generic movie I have ever seen, the direct is highly regarded for her indie movies in the indie world, why would get such an amazing an indie director and tell her “ok, now forget everything u know and make an action comedy” it makes absolute no sense. You can feel the director trying to be something she’s not."
  },
  {
    "rating": "2.5/5",
    "review": "A middle-of-the-road summer spy movie."
  },
  {
    "rating": "2/5",
    "review": "The handful of times \"Black Widow\" tried to be funny, it worked. A couple of the action sequences weren't bad. Most of the time, though, it was just insufferable. I give it a D, just don't bother."
  },
  {
    "rating": "5/5",
    "review": "The best Marvel movie so far. Great performance and great action. Loved it so much."
  },
  {
    "rating": "5/5",
    "review": "Scarlett Johansson is the ultimate Black Widow assassin. Florence Pugh was also extremely phenomenal. The entire movie itself brings a satisfying close to Natasha Romanoff’s story as an Avenger and will have fans remembering her as a legend forever. Absolutely my favorite movie!"
  },
  {
    "rating": "5/5",
    "review": "Excellent movie Excellent leading lady. Excellent Supporting cast."
  },
  {
    "rating": "3.5/5",
    "review": "I love Black widow and her sis Elina. The red Guardian is cool but unfortunately emasculated. A little PC and agenda but I HATED WHAT THEY DID TO TASKMASTER!"
  },
  {
    "rating": "3.5/5",
    "review": "The second half of this movie is a bit wack, Taskmaster could've had more screen time and importance and the end was a bit anti-climactic to me but the first half of this movie is absolute cinema in my opinion. Some of the beginning scenes are so well done and they just give me chills. So overall I think this movie is decent but could've been great if they kept the tone and quality of the story more consistent through the third act."
  },
  {
    "rating": "5/5",
    "review": "Ages 13 and older!!!!!!!!!!!! Saving this movie is \"so\" necessary!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "3/5",
    "review": "Okay as a movie, but I was kinda bothered by Scarlet Johanson's acting. It gave nothing new on Black Widow's backstory or added to the overall MCU."
  },
  {
    "rating": "2/5",
    "review": "A very meh movie, don't recommend."
  },
  {
    "rating": "1/5",
    "review": "As a Black Widow fan, sadly, this movie is one of the worst in the MCU to date (and I'm a HUGE marvel fan, who has followed it from the beginning). I didn't really care about any of the characters, and the villain/main conflict fell flat. There were some inconsistencies in the story, and jokes that were awkward or not funny. I almost felt like an AI could have written it, with the way it was just so cookie cutter. It's just so forgettable and unnecessary, especially after endgame. Yelena was a great edition, but it felt like the story didn't go where it should have with her. There were a lot of useless action scenes and explosions, and it didn't feel fresh or new like I was expecting. I hate to say it, but I wouldn't watch it again."
  },
  {
    "rating": "3/5",
    "review": "The timing of the release of this after Endgame made it hard to be enthusiastic about it; and tonally, they couldn't seem to quite decide whether it wanted to be taken seriously (like Thor), taken lightly and comically (like Thor: Rangnarok), so it split the difference and kind of missed either. Florence Pugh stole the show quite often, Scarlett Johansson seemed to work hard to make space for Florence Pugh as well as David Harbour and Rachel Weisz, who are ALSO solid actors - though stretching to be parental as they are only 10 and 14 years older than ScarJo, respectively. It was fine, really. Happy to have watched it. But it didn't quite measure up to the best of what MCU can deliver."
  },
  {
    "rating": "3.5/5",
    "review": "Its pretty good ,the action scenes were well made ,but black widow isn't one of my favourite marvel character."
  },
  {
    "rating": "4/5",
    "review": "nice intro ......i well recomand it ito any one"
  },
  {
    "rating": "2.5/5",
    "review": "It's a bit of meh all around, the occasional smile perhaps"
  },
  {
    "rating": "4.5/5",
    "review": "It's basically an action spy movie but set it in the Marvel Cinematic Universe. Like all the MCU movies, it's fun and fast paced. It delves into Black Widow's history and introduces her spy \"family\" that she was undercover in America with for years. It shows the other \"widows\"--orphan girls who are adopted into an elite assassin program at an early age--and we get to met Black Widow's \"sister\", \"mother\", and \"father\" (AKA The Red Guardian, AKA Captain Russia, the USSR counterpart to Captain American). Great comic relief moments, especially with the Red Guardian (seriously, he kinda steals the show). I just wish it had been made earlier."
  },
  {
    "rating": "4.5/5",
    "review": "One of the best movies in the marvel universe. I thought the relationship between black widow and her sister was adorable and heartfelt."
  },
  {
    "rating": "2.5/5",
    "review": "A classic story, nothing more, nothing less. In my opinion Scarlett Johansson acted very well, unfortunately the plot remains quite banal and above all predictable. I had a hard time staying focused."
  },
  {
    "rating": "1/5",
    "review": "Being someone that absolutely loves the MCU....I have to be honest and say that I could not get through this movie. Just never got my interest. Did not understand the need or desire to go here. Plenty of other supporting characters that would have had a more interesting backstory to explore...or at least they could have made this back story more compelling and more engaging to watch. I may throw this on in the background sometimes to see if it gets any better - but 20 minutes in and I needed to pound 3 Dr. Peppers just to not nod off."
  },
  {
    "rating": "4.5/5",
    "review": "Unlike others Marvel movies, Black Widow doesn't brake the plot with a huge amount of jokes. The movie is set 2016, right after the events of Captain America: Civil War and brings up the story of Natasha's \"fake\" family and shows action all the time with fight scenes. I loved the relationship with her sister and her father makes me laugh a lot. Black Widow enriches the Avengers background story and I'll give 4 and a half stars."
  },
  {
    "rating": "1/5",
    "review": "It's a really bad film honestly. The story isn't doing the work of knowing more about this character, it's more like filling a gap between Civil War and Infinity War, but also an unnecessary film existing in the MCU. Also, you can't feel any feelings between characters, overall it's a really bad experience."
  },
  {
    "rating": "2/5",
    "review": "The script and directing were completely amateur, the story is uninteresting and cliche, and Black Widow literally never holds scene. Natasha's sister is the better character through and through, and also the better acted part. You can tell the creators we're trying hard to make emotional callbacks, but all but one moment has no effect, sense or weight. Just a bad movie overall, which adds nothing to the broader MCU."
  },
  {
    "rating": "1/5",
    "review": "One of the worst Marvel movies ever"
  },
  {
    "rating": "3.5/5",
    "review": "This film could be better developed and worked with some old elements of Marvel, not only new content just to show Black Widow again. Although, Marvel created her background perfectly, pointing each aspect of her hard but united family and her work."
  },
  {
    "rating": "5/5",
    "review": "Florence Pugh is a miracle! Scarlet is awesome, but FP held her own and really shined. The movie is great."
  },
  {
    "rating": "0.5/5",
    "review": "one of the worst marvel movies of all time"
  },
  {
    "rating": "5/5",
    "review": "liked the story of Black Widows family, gave us more of her background. the movie fits perfectly between Civil War and Infinity War..."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest and tragic marvel movies"
  },
  {
    "rating": "5/5",
    "review": "better than captain marvel and i knoiw what i'm talking about"
  },
  {
    "rating": "4/5",
    "review": "A great movie, but feels more like a sequel to a first Black Widow movie that doesn't exist. I feel the story and characters needed more time and fleshing out, and would've benefited from being a Disney+ series as opposed to a movie."
  },
  {
    "rating": "5/5",
    "review": "Black Widow has been my favorite character of the MCU ever since her first appearance in the film franchise. Although the wig they put on her in her first appearance was god awful, her character and story evolved into the telling of one of the greatest femme fatale stories in my opinion."
  },
  {
    "rating": "2.5/5",
    "review": "The finale was essentially just Captain America: The Winter Soldier."
  },
  {
    "rating": "3/5",
    "review": "Better than I expected, but just another mediocre Marvel movie in the end"
  },
  {
    "rating": "3.5/5",
    "review": "This is an entertaining ride. There are numerous scenes that are absolutely ridiculous, even for a superhero film. take 30 punches and get up? Ok I guess you are juiced up or super trained or something. But flight physics + avalanches and skycities and terminal velocity fights, etc... the list of physics defying scenes is very long for what is a lower than crazy level of powers. I'd expected this from Thor Ragnarok, but Black Widow? That said, I was totally entertained. The characters are multifaceted, (some of them) and often entertaining as well as looking or being badass. There is the right amount of comedy sprinkled in. The fight scenes don't tend to last TOO long or get dull. There is a LOT of human damage that gets hand waived and I gets the Sykovia Accords make sense, hmm? Watching this in order, right after Civil War, was great. There are quite a number of tie-ins that serve to link this story to those before and after it. I appreciated those details. In the end I loved some of the new characters (Pugh was great!) and had a good time - through three 45min viewing sessions. Streaming has spoiled me and these MCU flicks can be long."
  },
  {
    "rating": "0.5/5",
    "review": "Aburrida a decir basta"
  },
  {
    "rating": "5/5",
    "review": "it is my comfort movie. can watch it a thousand times."
  },
  {
    "rating": "3/5",
    "review": "Whilst I am glad the MCU has finally given its first female superhero her own solo film, Natasha Romanoff does not feel like the main character in her own story. The film does a nice job delving into Natasha as a character, but only provides glimpses of her background - one that acts as social commentary for child trafficking, an aspect of the film brought up during the intro sequence but is otherwise largely ignored for the rest of the film. One of the bigger problems that seem consistent across all Marvel Studios productions, is how they add humor inappropriately during points of the film where it tries to deal with serious topics. In Black Widow, a saving grace is that the comedy was fairly enjoyable. Black Widow also suffers from Marvel Studios' villain problem, where its primary antagonists are barely characters and more so plot points that exist for a conflict to occur. We learn very little about Natasha's rivals and they ultimately felt like unnecessary and uninteresting additions to the MCU. The best aspect of the film to me was the cast. Scarlett Johansson reprises her role as Natasha Romanoff and does an excellent job in the role as usual. Joining her are Florence Pugh, Rachel Weisz, and David Harbour who make up the most enjoyable and heartfelt moments in the film."
  },
  {
    "rating": "3.5/5",
    "review": "Fun, but it's soooo late. Why didnt we watch this movie before Avengers: Endgame? The problem here it's when it was released, not the movie itself."
  },
  {
    "rating": "0.5/5",
    "review": "não gostei, roteiro fraco historia sem sentido, o elenco é a única coisa boa mas mesmo assim não salva o filme."
  },
  {
    "rating": "3.5/5",
    "review": "It's a pretty good action movie. Johansson and Pugh are great in their performances. I could've done without Red Guardian but I realize he is a part of Natasha's past. I'm just not a big fan of the character and found him annoying at times. Yelena however, is one of my favorite recent additions to the MCU and I hope is a big player moving forward in our more grounded movies like this one. Her and Natasha really carry this for me though. The villain was pretty boring and what they did with Taskmaster was a huge disappointment and wasted one of Marvel's best rouges for no reason really. 6.5/10."
  },
  {
    "rating": "5/5",
    "review": "Finally the long-awaited solo film on Black Widow. I loved it."
  },
  {
    "rating": "1.5/5",
    "review": "\"Black Widow\" is a poorly crafted film that I wish I could like. The first few minutes of the film seem fun and fresh for a Marvel film, but as the story progresses, it melds into the same old Marvel flick formula with no significant character development. However, the film's biggest sin is the creation of its villain or lack thereof and its near-complete lack of a satisfying third act. Overall, if you watch it without too much critical thought, you will have a decent time, but there are much better movies to spend your time on than yet another mediocre-at-best superhero flick."
  },
  {
    "rating": "5/5",
    "review": "Black Widow is not bad movie. For me is very nice. Scarlet Johanson is top level at this movie. PUGH is FABULASTIC!!! FANTASTIC play from Florence. David Harbour is very humoristic man and he is brilliant. Soon solo movie for Florence Pugh!!!"
  },
  {
    "rating": "2/5",
    "review": "Baffles me as to why this is rated so highly. Black Widow has to be one of the most boring and disappointing MCU entries to date. Sure, it expands on Natasha's history and family but that really only feels like it was used to introduce Red Guardian and the next Black Widow. Task Master was an absolute disappointment, I was so looking forward to this comic book menace finally being brought to the screen. Only to be a complete waste of a good character, unmasking to reveal a character that literally could have used any other name than Taskmaster and by the end of the film isn't even a villain anymore. Seriously, the thought that would be a good idea?"
  },
  {
    "rating": "0.5/5",
    "review": "The only thing worse than a bad movie that's forever hated is a mediocre movie that's easily forgotten and that's what this is. If you watch the directors other movies u will see how perfect of a director she was for this, her one flaw was her mindset. Cate Shortland (the director) had a mindset of how can I make this an epic movie that adds to to the collection of the greater MCU lore (u can check she says it multiple times in interviews) when this should have been something different that stands on it's own but they didn't do that. If u watched any of Cates other movies she then u know she makes indie films, her films have a poeticness to them on top of being raw and honest and a feeling of being in the moment like nothing u have ever seen, and if u really do understand Natasha Romanoff than you would know that's who she is on the inside and because of that I was excited to see this movie through Cates eyes which is also Natasha eyes since the way they see the world is so similar. Unfortunately we didn't get that, but hey if your a family person that loves fart jokes with stupid happy endings, then u will love this movie."
  },
  {
    "rating": "5/5",
    "review": "muito bom filme da viuva"
  },
  {
    "rating": "2/5",
    "review": "Was a good time passer. Glad I didn't see it in theaters."
  },
  {
    "rating": "4/5",
    "review": "Great action movie. Great job by the whole cast. Twists, great CGI, humor, and fight scenes. It makes me wish it was made a few years earlier so there could be some sequels. ScarJo is fantastic as THE Black Widow."
  },
  {
    "rating": "3.5/5",
    "review": "Was a decent film, it just felt a bit late… I'm glad black widow finally got a film and a proper goodbye"
  },
  {
    "rating": "1.5/5",
    "review": "worst villain in the history of the mcu. also plot was really bad and characters didn't fit with me"
  },
  {
    "rating": "4/5",
    "review": "Ultimo film sulla vecchia vedova nera, mi sarei aspettato qualcosa in più ma nel complesso mi è piaciuto"
  },
  {
    "rating": "1/5",
    "review": "Boring villain, no context"
  },
  {
    "rating": "5/5",
    "review": "Awesome performance by Scarlett Johansson."
  },
  {
    "rating": "4/5",
    "review": "the introduction of yelena to the mcu in the movie was perfect for future shows/movies. the look into natasha past at the red room and the destruction of it gave us an even better insight into the assassins past, yet still leaves much to question. fight scenes between black widow and taskmaster was amazing! could've spent more time on younger nat/yelena in the red room but still a good watch."
  },
  {
    "rating": "3.5/5",
    "review": "Watch it for Florence Pugh, Scarlett Johansson, Rachel Weisz, Olga Kurylenko, David Harbour and Ray Winstone. They do not disappoint."
  },
  {
    "rating": "4/5",
    "review": "This movie exceeded my expectations."
  },
  {
    "rating": "5/5",
    "review": "the movie had an awesome plot, with many twists."
  },
  {
    "rating": "3.5/5",
    "review": "While this movie should've come out in 2017, it's still a good Black Widow story. Unfortunately the final battle in a floating base was a bit too much for me, and the Taskmaster twist didn't mean anything to the viewer, because Natasha has no real emotion toward the situation."
  },
  {
    "rating": "4.5/5",
    "review": "A refreshing reset for Marvel. Humor and script was great."
  },
  {
    "rating": "3/5",
    "review": "Smelly villain, wasted task-master, half the movie was boring. Yelenas nice tho?"
  },
  {
    "rating": "2.5/5",
    "review": "It's just not good, super mediocre. If it came out shortly after Civil War released as it takes place during that time within the MCU then I probably would've enjoyed it more, but given it's release after Ragnarok, Infinity War, & Endgame it just falls flat especially since it was the first MCU film in 2 years. They also ruined the character of Taskmaster, it was a horrible twist and hopefully they fix it in the future. However the film did give us Yelena, played by Florence Pugh, and she's definitely a great addition to the MCU so there's that."
  },
  {
    "rating": "3/5",
    "review": "More solid than I expected. I like that this film took a different approach to the hero origin story we've seen re-hashed over and over in mainstream superhero films. Also thought the banter between Yelena and Natasha was very fun and well-conceived."
  },
  {
    "rating": "4/5",
    "review": "Clever, fast-paced, funny. Provides a solid backstory for the two principals. Just when you think it is predictable, along comes a plot twist. Some of the action sequences severely strain credulity."
  },
  {
    "rating": "2/5",
    "review": "So all the feminists got together and demanded a Black Widow movie, well, here it is, and it sucks, because nobody gave a s* about Black Widow's background. The best footage of Black Widow's character is in the Avenger movies."
  },
  {
    "rating": "5/5",
    "review": "i and my good friend hu teacher all think very good,because he like big body."
  },
  {
    "rating": "3/5",
    "review": "Yes, it is a Marvel movie... was kinda hoping it'll be more of a spy movie since it is about spy after all, but no... just... Marvel™"
  },
  {
    "rating": "2.5/5",
    "review": "The film itself is nice. What saves the film is the ending. In the last act of the film, the film improves but in the beginning and middle of the film, the film is much less good."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie with great actors. Great opening. Good job."
  },
  {
    "rating": "4/5",
    "review": "It was a Good movie, I would watch it again. Full of action and it explained the character from The Adventures."
  },
  {
    "rating": "3.5/5",
    "review": "The film is very respectable, especially with the circumstances the world has been in while creating it, and it has developed an amazing story line that setup and even better spider-man movie that has most definitely been put in a special place in my heart. The film itself is better than most, but still underwhelming, it is a marvel movie, so it did have the funding to have absolutely amazing VFX, which is always a boost in my eyes."
  },
  {
    "rating": "5/5",
    "review": "Once again - Audience is better critics than the critics."
  },
  {
    "rating": "4/5",
    "review": "This is good Character Backstories about Black Widows was Been Hostage from Villains trying To Tortured her but She Been Saved"
  },
  {
    "rating": "3.5/5",
    "review": "This film suffers from weak villains. Family aspect was great though."
  },
  {
    "rating": "3.5/5",
    "review": "This movie probably gets a little more hate than it deserves. There are some strong set pieces, the themes of abuse are more relevant than ever, and it has a surprisingly wholesome family dynamic. The film is also plagued with some poor narrative and writing choices, and I don't know if it's just me, but it feels like the special effects in these movies are getting worse."
  },
  {
    "rating": "3/5",
    "review": "This was extremely disappointing for an MCU film. None of the usual strengths of Marvel were present and it was a thoroughly 'meh' kind of movie. I likely won't be rewatching."
  },
  {
    "rating": "5/5",
    "review": "Love letter to fans of the character who were excited for every scene she was in and every line she had. The idea of the spy family was a fun twist that brought in a great cast the only flaw of the movie is that it still has the mcu staple humour which feels out of place here"
  },
  {
    "rating": "3.5/5",
    "review": "An average movie, with bad humor."
  },
  {
    "rating": "3/5",
    "review": "Very complex standalone Black Widow movie fans finally got that feels both well-made and a bit clueless, since it takes many ideas from others and yet offers some solid entertainment all the same."
  },
  {
    "rating": "1/5",
    "review": "Um hello? The cgi is as bad as Supergirl... How are the reviews so good? Also Disney X level acting...."
  },
  {
    "rating": "2.5/5",
    "review": "Funny sister dynamic but other than that its just ok."
  },
  {
    "rating": "1.5/5",
    "review": "Story was barely watchable. I got through it but not my gf... so many issues. I don't ever wanna see this again. Plot was so crazy it's bs level movie."
  },
  {
    "rating": "5/5",
    "review": "Peak, finally Natasha Romanoff got her solo movie! I also love that her sister Yelena is introduce to MCU, looking forward for her next projects in this cinematic universe."
  },
  {
    "rating": "1/5",
    "review": "Mas um filme com potencial, mas caiu na fórmula Marvel"
  },
  {
    "rating": "3/5",
    "review": "this movie was sort of a letdown. i can neither recommend it or shame it. it was okay but had so much potential. great characters but the plot was meh."
  },
  {
    "rating": "0.5/5",
    "review": "Don't watch it. Don't waste your time."
  },
  {
    "rating": "2/5",
    "review": "Too little and too late, that's the simple single-sentence review for Black Widow which finally released after four post-production delays. Of course, those delays are not the reason why this film came about too late, that was always going to be an issue. Black Widow takes place between the 2016 Captain America: Civil War and the 2018 Avengers: Infinity War with Natasha Romanoff (Scarlet Johansson) being a fugitive on the run following the Avengers breaking up over disagreements regarding government surveillance. This middle-of-the-road placement of the film doesn't affect the main narrative much as it's isolated to characters unique to this film rather than the more crossover-heavy films the MCU have put out lately, but at the same time it can't be ignored that the film feels like it should have been released in 2017 rather than after the 2019 Avengers: Endgame where Natasha ultimately was killed off. Her fate in Endgame being sealed does hurt some of the tension in the film since even if you wouldn't expect a Black Widow film to kill her off, the fact that it literally can't kill her off alters your perspective quite a bit. It's just unfortunate and a testament to how Disney's reluctance to make this film for the longest time has left scars in the script that can't heal. The story involves Natasha reuniting with her foster-sister, Yelena (Florence Pugh), from before her indoctrination into The Red Room, the global network of assassins that take little girls and turn them into programmed killers. Natasha and Yelena set out to take down The Red Room. It's fairly straight forward and you most likely figured out the few twists in the story from just watching the trailer. It's clear that the film wants to evoke more of a James Bond vibe than a typical superhero film, from the opening title sequences set to an awkward slowed down cover of Smells Like Teen Spirit to the more visceral and violent action scenes feeling right out of the Daniel Craig Bond films that take up the first half of the film. It's a breath of fresh air that unfortunately is lost in the final act when it becomes a more standard superhero film despite all this. The performances in the film works quite well with Johansson looking far more comfortable as Natasha in this film than in any of the seven films she was in before this. Pugh as Yelena is the stand-out star and the hints that she'll take up the Black Widow mantle in future MCU media is something I welcome. Black Widow is not a terrible film, but it's also not a decent film. It's a dull if inoffensive action adventure that awkwardly tries to slot itself in between other films to not have to deal with the fact that they waited so long to make this film that the character had both been killed off in-universe and lost most of her popularity from nearly a decade ago. It's certainly not worth going back to theaters or paying a Disney+ premium price for, that's for sure."
  },
  {
    "rating": "5/5",
    "review": "Atlast Black Widow. The woman hero character dare to stand with other male heroes on NewYork city Chitauri's Invansion, her pre-Avenger history have established well in the manner that, the way she react, behave, feel, and group bond she create to have the meaning."
  },
  {
    "rating": "3.5/5",
    "review": "This movie is fun to watch the action is cool but the bad thing that I don't like is the CGI and the acting is so weird"
  },
  {
    "rating": "2.5/5",
    "review": "I have absolutely no idea why this movie was released in 2021 or why it was the opening act for the fourth phase of the MCU. This movie would have been immensely more interesting had it been released following Civil War which is when the story takes place. The fact of the matter is that it's a story that didn't need to be told for a character whose storyline is finished in the present of the MCU. While I believe you can tell a story about a character who is no longer alive, you have to make the story matter. This story absolutely didn't matter. It's serves as a quasi-origin story at the beginning with a side story about Natasha dealing with her life as an assassin with no family. There are some touching moments, and the characters have decent chemistry together, but the movie felt so unnecessary. It was clearly made to be a big-budget 2 hour lead in to the Hawkeye show. This seems to be the beginning of a dark period for the MCU. Many of its heavy hitters have tied a bow on their storylines which means Marvel will try to squeeze out as many stories as they can from any other superhero still remaining. What's unfortunate is that Far From Home made me feel like the MCU could continue even without Iron Man and Captain America. However, if the future MCU movies continue to maintain the quality of Black Widow, I'll probably just stick with the movies of established heroes that are remaining from the Infinity Saga."
  },
  {
    "rating": "1/5",
    "review": "what have they done with Taskmaster 💀 incredibly disappointing"
  },
  {
    "rating": "2/5",
    "review": "This story feels unneeded. Its not very exciting or angering or any emotion feeling really. I didn't really need a Black Widow movie after she's already dead... I get Yelena needs a entry point but Marvel Universe itself is beyond the point of needing a basic hand to hand combat fighter... meh"
  },
  {
    "rating": "2.5/5",
    "review": "It had potential, but marvel really let Scarlet Johansen down."
  },
  {
    "rating": "3.5/5",
    "review": "Something that may make sense to you. Black Widow has interesting character's but sometimes doesn't explain the story behind them that therefore don't add up and only make people question more further."
  },
  {
    "rating": "3.5/5",
    "review": "this movie should have been out right after Captain America Civil War. story was fine didn't really add anything to Natashia character but introduces an excellent replacement for Black Widow going forward."
  },
  {
    "rating": "3.5/5",
    "review": "Family dynamics made this movie but had a very lackluster villian"
  },
  {
    "rating": "2/5",
    "review": "It happened. Captain America Winter solider but bad. CGI is good but third act is ridiculous. Characters are all good. Just another marvel movie. Had a lot of potential."
  },
  {
    "rating": "0.5/5",
    "review": "Pouca ação, meio que mostra que os homens no filme são preguiçosos, babacas e que só pensam em uma coisa apenas, que as mulheres são para uso. Esperava mais"
  },
  {
    "rating": "5/5",
    "review": "Scarlett never disappoints. I love her and this movie deserves more recognition than it got!"
  },
  {
    "rating": "3.5/5",
    "review": "while it's at times boring and the villian is bad it's still really enjoyable"
  },
  {
    "rating": "3.5/5",
    "review": "Buena peli, esperaba mas historia, llega a aburrir algunas escenas pero en general no esta mala."
  },
  {
    "rating": "0.5/5",
    "review": "I hate woman so I hate this movie."
  },
  {
    "rating": "0.5/5",
    "review": "A big missed opportunity"
  },
  {
    "rating": "5/5",
    "review": "It was such a beautiful story. We got the chance to learn more about Natasha Romanoff and her past. Natasha and Yelena were a dynamic duo. Amazing movie."
  },
  {
    "rating": "1.5/5",
    "review": "one of the worst marvel for me, the inconsistencies are more ... inconsistent than usual ... it's a pity because I like this character ... but I expected him to massacre a little this movie, which seems to have pleased the american public ... less a priori in France ... I'm one of the people who didn't like it much ..."
  },
  {
    "rating": "0.5/5",
    "review": "PESSIMO FRACO PIOR VILAO, VIUVA NEGRA CONTINUA GOSTOSA MAIS NAO SABE LUTAR DIREITO , TINHA QUE SER MULHER"
  },
  {
    "rating": "1.5/5",
    "review": "Muito \"engraçadinho\",até demais. O terceiro ato revela um vilão asqueroso que não combina com o clima descontraído do filme e que simplesmente é um enorme retcon,já que o filme simplesmente tentar enfiar guela abaixo no espectador que esse cara é um super manipulador(controla todos os governos de grandes potências) que age há muito tempo sem que nem a SHIELD ou a Hydra soubessem dele. Simplesmente intragável esse roteiro da parte final e ainda por cima exagera no CGI e finaliza um arco bem forçado(começa pesadíssimo e termina leve) de personagem da Viúva Negra. Ela merecia mais,sem contar os takes de câmera na bunda dela."
  },
  {
    "rating": "4.5/5",
    "review": "Good Movie, it's so cool"
  },
  {
    "rating": "4.5/5",
    "review": "Black Widow, directed by Cate Shortland. The main character is Natasha Romanoff, played by Scarlett Johansson. The story is about a young girl who is part of an experience to put young girls in combat. This experience destroys her life. One day she finds her little sister who was also in this experience. The two sisters go in pursuit of the red room where the experience happened, to kill the person responsible for the experience. They are then accompanied by their parents who actually helped in the experience, particularly the mom. The special effects are inventive, the photography is incredible So I find this movie realistic and impressive. I recommend to go and see it if you like action movies."
  },
  {
    "rating": "3/5",
    "review": "It wasn't bad, but it wasn't up to the story it wanted to tell. Huge Natasha fan, and Johansson is on point here, but everything around her isn't. The script is weak---except the fake family bit especially the flashbacks which packed a punch. Decent fight scenes, the sister is okay, but no where near up to filling the hole left by Black Widow's demise. Yet. We'll see how it goes from here."
  },
  {
    "rating": "4/5",
    "review": "Black Widow was produced by Cate ShortLand in 2021. Natasha, the main character is played by Scarlett Johansson. It is an action movie that is about Natasha and her sister, Yolona, who were recruited by Russian government to become \"black widow\" and fight the American government. Few years later, Natasha side with American and she became an Avengers. Yolana escape from black widow organisation and they fight together Russian government to free every black widow. The plot is basic to action movie, but the ending is poignant. Special effects are superb, especially with pan shot and long shot. The acting is stunning, the casting is amazing. The script is very interesting, characters are dive few years later after the Cold War, but we could feel tension between USA and Russia. This movie is outstanding, acting is perfect and, despite a poor plot, and I love Cold war references. I recommend this film everyone love historic and action movie."
  },
  {
    "rating": "4/5",
    "review": "A fun thrill that stands alongside all other MCU movies"
  },
  {
    "rating": "4.5/5",
    "review": "The difference between all of the main characters in the family brings truth to the saying, \"Opposites attract.\" The movie is so light-hearted in serious moments and action sequences but still manages to bring emotion and character development through the whole 2 hours and 15 minutes. Definitely not the best Marvel movie, but it is well up there in terms of a solo-titled superhero movie. 100% better than Captain Marvel, Wonder Woman 1984, and other female-led superhero films recently."
  },
  {
    "rating": "5/5",
    "review": "The best Marvel movie of the year."
  },
  {
    "rating": "3.5/5",
    "review": "The pros are right: too much over the top action (however well choreographed), not enough drama or story, not to mention characterization. If the leads were less physically attractive this would net 1 1/2 stars merely."
  },
  {
    "rating": "4/5",
    "review": "Whilst the story was decent with elements of good character development, the performances of Scarlet Johannson and Florence Pugh were well done."
  },
  {
    "rating": "2.5/5",
    "review": "Really disappointed with this one. They literally had a former Soviet spy who defected to the other side, and they didn't do a spy thriller. I was severely underwhelmed."
  },
  {
    "rating": "3/5",
    "review": "It's not the best marvel movie I have seen and it is a bit weird that it is not really much of an origin story. But it was still entertaining either way and it was nice to see black widow one more time."
  },
  {
    "rating": "2/5",
    "review": "Meh... was expecting something better. It had an amazing opening that made it feel as if it were going to be a powerful thriller but ended up becoming another comedic movie. Loved Black widows backstory...didn't care for much else"
  },
  {
    "rating": "4/5",
    "review": "I enjoyed the movie. It's not quite up to the level of the best Marvel movies, but it was still fun."
  },
  {
    "rating": "5/5",
    "review": "What a fantastic movie!! SCARLETT is incredible."
  },
  {
    "rating": "3.5/5",
    "review": "Everything was great in this movie other than two aspects. Taskmaster felt underutilized, and the CGI was clearly very rushed. disappointing that Marvel will only pull out all of the stops with cgi for every movie that has a white male actor. Other than those things, this movie is definitely worth watching, and ScarJo and the other actors' performances are entertaining and captivating."
  },
  {
    "rating": "2/5",
    "review": "A missed opportunity to explore the darker side of Natasha Romanoff's past. It's a shame this is her last outing instead of Endgame."
  },
  {
    "rating": "0.5/5",
    "review": "Nothing in this film really got me in. The main character is eclipsed by almost every side character that appeared. I wanted to finish the movie because I wanted to check if there was going to be other characters with important role in the future Marvel movies, but really wanted to switch it off in the middle of it."
  },
  {
    "rating": "3.5/5",
    "review": "Worth a watch, good without being great."
  },
  {
    "rating": "4/5",
    "review": "A pretty great MCU film. I very much appreciated the \"Disney film\" aspects of it, and making Natasha more of a Disney Princess-type character. But the film is also willing to go dark (particularly in the opening credits sequence). Yes, the third act is a buffet of mediocre CGI, perhaps even bad CGI, but Florence Pugh is amazing and the film has a lot of interesting things to say."
  },
  {
    "rating": "2.5/5",
    "review": "This for me is yet again another bland blockbuster film released from Marvel. I was hyped for this film and watched it the day it came out. Director Cate Shortland is a fairly unknown director and this was her first big-budget film. I can see what she was trying to go for in this movie but sadly failed while writing got in the way of things. The first start of the movie is just showing you how rushed and bland the script is. I also think the action was very boring, especially for a Marvel movie. Marvel movies are known for their amazing fight scenes (like in blade 2) and this one really failed to do so."
  },
  {
    "rating": "3.5/5",
    "review": "Plot was somewhat convoluted and all over the place at times. Action scenes, stunts, and special FX were solid. Acting was a bit stiff and the non-action scenes really dragged things down to the point of boredom. Final show down with villain at the end was well worth the price of admission. Rescue scene at Russian prison was also awesome. Who expected an avalanche?! Nice touch. Other facts: Johansson sued Disney studios for releasing the movie digitally on Disney Plus too soon after movie hit the theaters. Johansson felt it a breach of contract. Johansson and Disney settled for an unnamed amount. Johansson was seeking 50 million in damages. The suit alleged that Johansson lost out on tens of millions of dollars in box office bonuses."
  },
  {
    "rating": "2/5",
    "review": "There was so much opportunity for a darker, more serious spy movie. Instead, we got an awkward half baked superhero movie with a boring third act."
  },
  {
    "rating": "3/5",
    "review": "An ok movie with decent action and humour. This movie could have been more better. It had a lot of potential but something felt missing from it."
  },
  {
    "rating": "5/5",
    "review": "IS DC GOOD?!?! DC > MARVEL!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Kick ass women kicking ass. What's not to love?!"
  },
  {
    "rating": "3.5/5",
    "review": "Good movie, but not as fun as the other Marvel movies. The story is interesting but not suspenseful enough to make you excited to know what the plot might end up with but overall it's a good movie for a good movie night."
  },
  {
    "rating": "3.5/5",
    "review": "Black widow is a fun movie. It focuses on a dead character without necessarily trying to implant ground to resurrect the character, but clear the path to moving on from Natasha Romanoff's tragic death in Avengers: Endgame. It is absolutely packed with amazing action and I think it would have been more well-received if it was actually made in 2016, the year it takes place in. It passed the time, for sure, but it is still guaranteed to give you a very enjoyable time."
  },
  {
    "rating": "3.5/5",
    "review": "The overall film was good, however they could have done so much more with Dreykov, Ray Winstones's character, they obviously spent a lot of time photoshoping him into various photos with famous people then he's hardly in the film, I found that dissapointing if I'm honest."
  },
  {
    "rating": "5/5",
    "review": "Refreshing new take on what a Marvel movie could be. Must watch!"
  }
]