[
  {
    "rating": "1/5",
    "review": "This movie is so cringe and I couldn't get past the first 30mns! Who behaves like that with their boss? Lol and on the first day as well. I get boss employee relationships but this is NOT how they start, ever. Nobody can be that audacious, no matter how irresistible you may think yourself to be. It seems like the plot to a bad porn film. Absolutely disgusting"
  },
  {
    "rating": "1/5",
    "review": "Garbage. I lost brain cells watching this self absorbed crap. Check that, I fast forwarded through most of it. 😜"
  },
  {
    "rating": "1/5",
    "review": "Good God...what happened to Nicole Kidman? She's gone from being one of our generation's best actresses to nothing more than a porn star. Her last few movies have been nothing more than showing off her nude body and actual sex scenes. I wonder what her personal life is like if this is what she wants to show in her movies now."
  },
  {
    "rating": "2/5",
    "review": "The film has a tension due to the lead protagonist's (Kidman) risky behavior with her intern as she can't help but engage with him inappropriately. The scenes are very disturbing at times and uncomfortable. This film is a commentary on sex and sexuality and empowerment...but falls short of delivering on the final message to the audience. I can only liken this somewhere between \"Fifty Shades\" and \"Saltburn\". At the end you may just scratch your head and wonder what you just watched."
  },
  {
    "rating": "1/5",
    "review": "What the hell were they thinking. The sceenplay was all over the place, so bad you could not follow, scene by scene. I have no idea who put this piece of garbage in motion or who was dumb enough to pay anything for it. Don't waste 5 minutes trying to watch this attempt at a motion picture."
  },
  {
    "rating": "1.5/5",
    "review": "For a movie that's all about sex, I found it quite boring. Nicole Kidman's portrayal of Romy is flat. This fits with the rest of the movie as none of the characters have any depth. Don't waste your time."
  },
  {
    "rating": "1.5/5",
    "review": "Story was disjointed and not at all believable. Some of the spicy scenes were alright but even then they seemed odd and erratic. Nicole Kidman looks good though."
  },
  {
    "rating": "0.5/5",
    "review": "Even with Nicole Kidman in the lead, The Baby Girl is a confusing, slow-paced film that tries to explore dominance and submission but ends up feeling scattered and boring. The themes clash more than connect, and the character dynamics lack depth. It left me more frustrated than entertained."
  },
  {
    "rating": "1/5",
    "review": "Do not waste your time. I was absolutely disappointed as a fan of Nicole Kidman, this was completely boring, waiting for excitement when it was so predictable and awkward role for her. Forced roles on other actors. Skip it."
  },
  {
    "rating": "5/5",
    "review": "people simply don't get it. there are so many underlying meanings within this film; the movie itself is directed with a personalized and an intimate feel whilst upholding reality through its writing. there is a lot I can say. it is not for everyone. but there's so many different takeaways. easter eggs. people aren't getting it."
  },
  {
    "rating": "2.5/5",
    "review": "The acting is a bit vacuous but if you want an entertaining movie without a lot of heavy details, this will work."
  },
  {
    "rating": "1/5",
    "review": "Ghetto version of 50 shades of grey. Don’t waste your time."
  },
  {
    "rating": "0.5/5",
    "review": "This could have been a deeper darker romp, but just fell short, and ended flat."
  },
  {
    "rating": "1/5",
    "review": "The movie is bad because its script teeters on clichés and forced situations, failing to build characters with clear motivations or a narrative arc that's even remotely interesting. The plot, which attempts to explore dynamics of power and desire, fizzles into a succession of scenes that don't quite connect, leaving the viewer with a feeling of emptiness and confusion. The characters, far from generating empathy or fascination, come across as unsympathetic, and their actions lack solid justification, making any kind of emotional investment in their fates difficult. It even generates embarrassment, a palpable cringe at the forced nature of their interactions and decisions. The chemistry between the protagonists is conspicuously lacking, making the film's central relationship feel artificial and unbelievable, stripping it of the tension or appeal it was intended to generate. Despite its attempt to enter the realm of an erotic thriller, the film fails miserably to create a sensual or exciting atmosphere. The intimate scenes lack the necessary intensity and feel more like a passionless formality, often creating an uncomfortable and artificial feeling. Compared to other offerings in the genre, \"Baby Girl\" pales in every respect, offering an unsatisfactory cinematic experience that fails to provoke or entertain. Nicole Kidman's talent, though present, is overshadowed by the overall weakness of the project, leaving her performance as an isolated effort amid a disjointed ensemble that, at times, borders on the ridiculous and produces that feeling of \"cringe\" so characteristic of poorly executed situations. Ultimately, the film comes across as a failed attempt to generate controversy and eroticism, remaining a superficial and forgettable offering that, at times, is downright embarrassing to watch."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worse movie I ever seen in my life, don’t waste your time."
  },
  {
    "rating": "1/5",
    "review": "Did it get any better? I couldn’t watch Nicole Kidman. She doesn’t seem human to me. More like a stiff robot with too much plastic surgery. The guy she’s attracted to seems to young like a boy."
  },
  {
    "rating": "0.5/5",
    "review": "Nicole Kidman’s jump the shark moment is this film! This movie was ridiculous. I hate to say it because Nicole has been one of my favourite actresses and people since Days of Thunder. I hate that she did this film. It was beneath her as was Eyes Wide Shut. I get she’s trying to step out of her comfort zone and push the envelope but she pushed it way too far here. Yes, she can act. We all know this by now. She has nothing left to prove. She’s won an Oscar and is highly regarded in Hollywood as an actress. But this role to me wreaked of desperation. She is getting older and has something to prove in real life too?! It was way too much even for a fan of her career - like me - to handle. It just had this underlying tone of utter vanity on her part to take this role. I’m sorry but that is how I see it. The movie made me want to have a shower after I watched it. I just found it repulsive. I’m no prude by any means but women her age don’t behave that way in real life. There is something called menopause. I was recently approached by a much younger man and I told him NO WAY. I have nothing to prove. I’m confident in my own skin. Don’t need to crawl around on my hands and knees. Don’t need anyone else’s validation. I’m good! I have self respect. Her character was a sex addict. There is a lot wrong with people who degrade themselves that way, especially when they have a good partner by thelr side. I did not finish watching this movie. Her worst ever. I didn’t like anything about it. What Nicole did wasn’t earth shattering either. There are a lot of actresses who could have taken on that role and pulled it off!"
  },
  {
    "rating": "5/5",
    "review": "I thought this was an excellent movie. Very entertaining. I loved the submissive nature of this film. Art imitating reality"
  },
  {
    "rating": "1/5",
    "review": "Bad and unrealistic yet another unhealthy representation if you related you're weird"
  },
  {
    "rating": "2.5/5",
    "review": "I think the film industry should not approve these types of sexual films. A24 He makes every production crazy and out of reality."
  },
  {
    "rating": "1/5",
    "review": "I'm sorry but all I could see aside from a dreadful story was how old Nicole Kidman looks. Honey time to play age appropriate characters. Also? Girl. Eat a sandwich."
  },
  {
    "rating": "5/5",
    "review": "Personally as a female in my early 40's this definitely was exciting amd gripping right from the first scene of the woman pleasuring herself after bed with her husband. I couldn't stop watching it. All the naughty dirty racy no no's in this are great. Just all round loved it! Not sure if I would feel comfortable watching this with me partner tho."
  },
  {
    "rating": "1.5/5",
    "review": "Definitely boring! I never thought would see a movie with Banderas & Kidman so bad... The story didn't catch me..."
  },
  {
    "rating": "5/5",
    "review": "Wow, bravo. Though story line not perfect, close enough. The acting though is an 11 out of 10. Nicole Kidman is one of the best actors of our time! Different, tense, and captivating!"
  },
  {
    "rating": "1/5",
    "review": "Babygirl had the potential to explore some deep and emotionally charged themes, but unfortunately, it fell flat for me. While the erotic scenes were well executed and visually appealing, they couldn't make up for the weak plot and lack of emotional depth. The dynamic between the sub and dom characters lacked authenticity, and I didn’t get the sense that either party was truly educated in the lifestyle. It felt like the filmmakers only scratched the surface of what could have been a complex and layered power exchange. Emotionally, the movie missed the mark. The pain and betrayal of being cheated on were barely addressed, making the character's motivations feel shallow and unrealistic. Given the protagonist's age, I expected more maturity in how she communicated, especially with her husband. Instead, her reactions often felt impulsive and teenage-like, which undermined the gravity of the situation. The film also gave off the vibe of a low-budget production, and not just in terms of visuals — the storytelling itself felt underdeveloped. There was so much room for deeper dialogue, emotional reckoning, and stronger character arcs, but none of that was fully realized. In the end, while Babygirl might satisfy those looking purely for steamy content, those hoping for a compelling story with emotional weight and mature handling of serious topics might be left disappointed."
  },
  {
    "rating": "1/5",
    "review": "Is Nicole desperate for movie roles? Normally a big fan, I was a little embarrassed for her and didn't like this movie."
  },
  {
    "rating": "3/5",
    "review": "Not my favorite, but Nicole Kidman killed it."
  },
  {
    "rating": "3.5/5",
    "review": "What a movie... it was nothing I expected but, I enjoyed myself, which I think is due to understanding both sides of the equation. I found myself holding my breath A LOT. I liked it."
  },
  {
    "rating": "1/5",
    "review": "I only tried to write a review this time because I thought I might be able to post a half star instead of 1 star. Alas, I can only do a 1 star. Why was it so bad? I'm unsure. I think because I am not that easily shocked by sex, so I saw it for what it was from the beginning. It relies on shock value to engage you, but if you are not... then it is just bad. Not bad in a funny way that can be very entertaining for the viewer in some B grade movies. It is bad in an uncomfortable way, like the sexuality reads as unauthentic."
  },
  {
    "rating": "2/5",
    "review": "The best thing about this movie was Anthony Banderas. Some scenes were unrealistic, such as the argument on the balcony at work. The script fell a little flat but I understand the message it attempted to convey. The shift on power roles between genders."
  },
  {
    "rating": "2/5",
    "review": "Felt like A24 was trying to do their own 50 Shades of Gray. However, it just falls flat. The only good thing out of the film was Antonio B and Nicole K performances."
  },
  {
    "rating": "1/5",
    "review": "It's a valid story, but it's very poorly adapted to film. The young protagonist doesn't portray his character well. His character simply isn't believable; he lacks the magnetism Mickey Rourke had in \"9 1/2 Weeks.\""
  },
  {
    "rating": "4/5",
    "review": "I thought it was good and relevant to the power driven sexual issues happening in the everyday news. I enjoyed the suspense and acting. But compared to movies like blink twice that deal with power and sex, this pales in comparison. To be fair this movie deals with unresolved sexual desires of a woman who happens to be in a position of power. I really enjoyed it . 4-stars because it's not original but the twist and turns kept me tuned in"
  },
  {
    "rating": "3/5",
    "review": "It was kind of interesting but not very believable. Jacob takes her back in such a short period of time. I'd never bother watching it again as It was over the top."
  },
  {
    "rating": "1.5/5",
    "review": "The movie has wonderful performances but Nicole appears frozen and there is no chemistry with her intern. Most of the sex scenes are just cringy and ridiculous. The character's excuse for infidelity and betraying her children is downright stupid and the ending does not give closure to her behavior. You never fully understand what is the motivation behind his character's behavior. It's another Hollywood-esque movie in where the main character behaves terribly, betrays all the people they love but in the end everything is ok and you're the fool for seeing it differently."
  },
  {
    "rating": "4/5",
    "review": "As she so often does, Nicole Kidman chooses challenging, complex roles and delivers them with exceptional skill. The chemistry between the lead characters is strong and adds depth to the story."
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies I've seen in a long time. So tedious, so badly written. Not worth wasting more words or time on!"
  },
  {
    "rating": "0.5/5",
    "review": "Very few movies make me feel this uncomfortable for the actors. This movie is the same old story of a sexually ungratified older woman having a torrid affair with a younger man...blah..blah..blah. Nicole Kidman is beautiful and talented and this movie did nothing but diminish her. Poorly written, directed and acted by all."
  },
  {
    "rating": "2/5",
    "review": "I am really glad I didn't pay to see this. It was very slow moving indie film with flipped dynamics where a woman exploits another to get ahead in the name of morality. Yawn,"
  },
  {
    "rating": "0.5/5",
    "review": "Could not connect with main characters... The age gap was too much..it felt weird and uncomfortable..the scenes were embarrassing and humiliating..Nicole needs to leave her face alone and I turn it off half way through it"
  },
  {
    "rating": "3.5/5",
    "review": "I am not sure if I liked this movie. I am not sure if it is good. There are moments that it infuriated me. It is a sexually charged, and, sometimes, perverse movie about a successful tech executive who is sexually repressed and becomes involved with a manipulative intern. Nicole Kidman is revoting in this. She is confusing and sexy and vulnerable and difficult to watch because she is so good as the woman becoming unhinged. Antonia Banderas is great as the husband. Harris Dickerson is good in the role, and very easy to hate. The movie made me think and it, definitely, turned me on at times. Worth Seeing for its unique and Adult character."
  },
  {
    "rating": "0.5/5",
    "review": "I saw this movie in Australia in the outdoor cinema and I wanted to like it sooooo bad, but it sucked! Super strange and weird. Nicole somehow loves going for these bizarre and twisted roles and sometimes it hits, but this one did not AT ALL. Also, I couldn't stop staring at her face. Idk what she did to it, but it looks so bad that it really draws away from her acting these days. Antonio was great in it. He looks amazing and really played the role well, I wished the storyline showed more of the family dynamic."
  },
  {
    "rating": "0.5/5",
    "review": "Gives sexy entertainment a bad name. I really disliked all the characters, even the husband and daughters at the end. It was so boring, and not stimulating at all, which maybe was the point? I’m not sure. I was going to turn it off half-way through, and I wish I had. The end was extremely disappointing. I’m not sure what the message was here - was it supposed to be empowering? It wasn’t. Left me with an icky feeling instead."
  },
  {
    "rating": "2/5",
    "review": "Sorry, she's NOT SEO omg."
  },
  {
    "rating": "1.5/5",
    "review": "Boring and slow. Nicole needs to choose her roles more wisely. She is not remotely believable in this role"
  },
  {
    "rating": "1/5",
    "review": "This was borderline unwatchable. The dialogue is stunted and awkward; the plot is all over the place. It’s drivel dressed up as edgy."
  },
  {
    "rating": "1/5",
    "review": "Very interesting but I imagined this film to have more dialogue and less sex scenes. I feel like the characters lacked authenticity. I feel like based off of what we see, this film had potential to dive deeper into the lives of the characters so you can understand the “Why” behind the decisions that they made. It didn’t give enough context. It was kind of all about sex and not expanding on the overall story of what drives these decisions and engagements."
  },
  {
    "rating": "3/5",
    "review": "Not a bad movie, interesting enough to keep me watching. What I don’t like is the ending that the husband took her back and it seems that he adjusted himself to satisfy her kinks! I understand that the movie is about ‘my body, my choice’ and empowering women, but it should portray that men have a choice too. The husband shouldn’t take her back and submit to her like that, if he’s not into that kind of thing, then he shouldn’t have to endure it. And now, if it’s in real life, the man is now miserable instead of the woman. The ending that I’d like would be that the two are divorced, but still care for each other and her kids still love her and everything, and she’s proudly going out on her own, starting the journey in search of her sexual satisfaction, bolder and unapologetic this time."
  },
  {
    "rating": "5/5",
    "review": "Babygirl has stayed with me long after the credits rolled. It is more than just a story about erotic tension — it’s about awakening something deeper: the craving for every part of us to be fully alive. The film captures loneliness, longing, and self-discovery in a way that feels raw and real — and sexy as hell, in my opinion. For me, Babygirl wasn’t just entertainment. It stirred something powerful: a reminder that desire, hunger, and even our perceived darkness can be beautiful parts of who we are. We can have our cake and eat it too — once we embrace every part of who we are."
  },
  {
    "rating": "1/5",
    "review": "Not even NK could salvage this dunking dhip, boring ,slow, soulless..."
  },
  {
    "rating": "2/5",
    "review": "an implausible story in which I could not empathize with anyone. this guy really irritated me, and the behavior of the heroine Nicole did not pull up to the level of a cool girlboss CEO"
  },
  {
    "rating": "4/5",
    "review": "Nicole Kidman is a fox in this. Antonio Banderas acting especially in the final act is incredible. I can feel the emotion oozing through. Great movie to watch with friends and or alone. Just look out for the heavy use of strobing lights in one scene."
  },
  {
    "rating": "1.5/5",
    "review": "Didn’t hit the mark. It was boring, cringy and infuriating."
  },
  {
    "rating": "0.5/5",
    "review": "Really bad movie. Disappointed in Nicole Kidman. Very sexual and domineering personalities. We would not recommend."
  },
  {
    "rating": "1/5",
    "review": "I can see what they were trying to do but it just did not work. I didn’t care about the characters at all and they were not sexy. It’s not believable at all that a woman like that would be attracted to that younger guy, he wasn’t charismatic or charming or cute. And I’m sorry I just don’t wanna see an older woman like that in a movie like this. Diane Keaton in something’s gotta give was perfect but this is not it."
  },
  {
    "rating": "1.5/5",
    "review": "What a mess of a movie. The plot was as thin as tissue paper, with the idea perhaps they could rest on the fact that such a movie has never been made before. Too bad the creators didn't ask why! And Nicole, just stop - we can literally see your breast implants through your pale aging skin. You are a beautiful woman, you have nothing to prove."
  },
  {
    "rating": "0.5/5",
    "review": "So, this was marketed as an \"erotic thriller\" but I didn't find it thrilling at all. Nor did I find anything erotic about a young guy angling for someone who looks like a melted barbie doll. I made it to the 40-minute mark of this 50-Shades-wannabe before forwarding to the end, which was also bad."
  },
  {
    "rating": "5/5",
    "review": "For one, that I’m still thinking about this movie days after watching it says something. There are definitely scenes I had to watch through my hands because they made me so uncomfortable. Nevertheless it’s quite compelling. I particularly found it interesting that Samuel and Romy were exploring the concept of domination and submission with neither really knowing what they were doing but deciding to give to a shot and figure it out along the way. I am not a part of that community so perhaps that is a recipe for disaster, but there was something about their willingness to trust each other enough to try it on that I found intriguing. At some point everyone is a beginner. It wasn’t until close to the end of their relationship that they discussed a safe word. And also the fact that it was more of a relationship that I think is considered a switch, where at times we see Samuel being submissive. At one point during pillow talk Romy tells Samuel that he’s great at sensing what people need and giving that to him and we see him doing just that for Jacob, Romy’s husband, while he is having a panic attack. I found their chemistry and dynamic quite compelling and while continuing the relationship wouldn’t make sense, it still feels like mourning a loss when we discover Samuel has taken a job in Japan. But we can see the lasting effects of their relationship when Romy needs to fantasize about him in order to derive pleasure in her marriage. Kidman is fantastic, though something about the rave scene reminded me of Naomi Watts in Gypsy so I can envision her in this same role. That’s not to discredit Kidman, it was just a fleeting thought. To me the star was Dickinson. He was the perfect choice for Samuel and has me intrigued. This could also be because he was an actor I haven’t seen before. And I already know how talented Kidman is."
  },
  {
    "rating": "2/5",
    "review": "Terribly amateur and confusing directing, embarrassing on-the-nose script and sad, unrealistic characterizations. Seems the goal was to create word-of-mouth shock value and it failed due to it’s insincerity."
  },
  {
    "rating": "0.5/5",
    "review": "Very slow burning movie that never really builds up to anything. It wasn’t even that kinky when compared to movies within the same genre. Other films have tackled this topic much more effectively and with much more erotica than this one. For example: 2002s ‘Unfaithful’ starring Richard Gere and Diane Lane was way better and much more provocatively sexual scenes than ‘Babygirl’."
  },
  {
    "rating": "0.5/5",
    "review": "2 hours gone out of my life for this piece of trash movie. Nichole must like this. She did EYES WiDE SHUT, a movie that was trash. I want my time back."
  },
  {
    "rating": "3/5",
    "review": "I’m still just having a hard time with the fact that Antonio Banderas couldn’t get her off to begin with."
  },
  {
    "rating": "3/5",
    "review": "I actually liked it! It has gotten some pretty negative reviews, but I found it interesting."
  },
  {
    "rating": "1/5",
    "review": "Ok, I tried, I looked forward to watching it. Can't believe she would put up with his arrogance. What's wrong with that woman? He's nothing special. I bailed out of the movie."
  },
  {
    "rating": "0.5/5",
    "review": "She's a good actress but I had to shut this off. This just doesn't happen, a 20 something yr old and a almost 60 yr old, she's suppose to be 49 in this but we all know how old she is. I was already cringing the first 5 minutes."
  },
  {
    "rating": "1/5",
    "review": "Absolutely beyond belief that a young, good looking man would be attracted and enter into an erotic liaison with a skeletal looking, saggy neck senior woman which is what Nicole Kidman is despite all her Botox, facelifts etc Found this to be soft porn and totally unbelievable Definitely has to be one of the worst films I’ve ever seen Time for Ms Kidman to accept that she’s not a sexually attractive young woman any longer"
  },
  {
    "rating": "1/5",
    "review": "Babygirl (2024) is a major misfire. Marketed as an \"erotic thriller,\" it fails to deliver on both fronts, offering instead a sluggish and disconnected plot with awkward performances. Nicole Kidman’s portrayal of Romy feels unconvincing, and the lack of chemistry between her and Harris Dickinson makes their dynamic painfully forced. The film drags, never building any real tension or excitement. Ultimately, Babygirl is a missed opportunity that leaves viewers frustrated and unimpressed."
  },
  {
    "rating": "3.5/5",
    "review": "Some says it was horrible, some finds it \"sexy\", some finds it \"kinky\". It probably is all of it. But what intrigued me more is the family dynamics vs female sexuality...why is that we, women are judged so harshly for our fantasies? Why do we feel ashamed by our dark desires? Why do we have to be judged at all? Why having family and husband often means end of weird, kinky, dirty sex? I think as society we asks wrong questions. She loved her husband, and he loved her. They were great together, but hardly ever one person can GIVEITALL...it probably works better if you put a few people together: husband. Friend, lover... if you were lucky enough to find it in one men-congrats but the truth is-it hardly ever happens to the rest of us. Why we have society of ashamed, hungry and scared people? Why and when did we convinced each other that you absolutely MUST have one and only one person for the rest of your life? We created unrealistic expectations of ourselves and when they fall on our heads we feel like biggest looser and failure. We beg to be forgiven. But for what exactly? She wanted to be SEEN. She wanted to feel accepted for what she wanted, even though she was scared to admit what it is, that she really wanted...we carry in ourselves the need for love, for acceptance but also need for punishment, humiliation, pain...these are blurred together. Most of us never experiments with the hidden side of our inner urges, those few who dose-get to meet antother unknown side of themselves. I think what we should do, is be more open, do not judge and most importantly-stop putting ourselves unto position of failure-like lifelong marriages."
  },
  {
    "rating": "1/5",
    "review": "Dull, boring in every way."
  },
  {
    "rating": "0.5/5",
    "review": "Apple sold me this movie as a thriller. I have no words. My favorite part was the end. Sorry."
  },
  {
    "rating": "2.5/5",
    "review": "Script was lacking, not one of Nicole's best. I feel it needed more background and character development."
  },
  {
    "rating": "0.5/5",
    "review": "Never before felt such a desire to be single forever. Otherwise cringe"
  },
  {
    "rating": "1.5/5",
    "review": "Quite novel if the intention was to make it an awkward critique of the extended session scenes we see in films now, but it seems to be genuine. Also Kidnan looking like a reanimated corpse doesn't help the realism. Some funny moments."
  },
  {
    "rating": "5/5",
    "review": "I watched babygirl last night and can’t get it out of my head. It was awkward, it was raw, it was funny, it was real, it was sexy as hell. Nicole did a fabulous job showing the layers of emotions as her character flirts with, denies herself, and then gives into her affair. Harris and Nicole’s chemistry is off the charts. This isn’t a movie about female empowerment, it’s a movie about being seen and then giving into a deepest secret desire after being told “it’s ok” even when the character knows- it really probably isn’t. The complex characters and their dynamics felt real as they often left me wanting to know “what did that person mean by that? What happens next.” Similar feelings I remember feeling when trying to parse out the first stage of my own new and daring relationships when young. A must see!"
  },
  {
    "rating": "2/5",
    "review": "Nicole Kidman is so convincing here, professional. The movie itself is quite wired."
  },
  {
    "rating": "1.5/5",
    "review": "What could have been a suspenseful and exciting movie, was taken and turned into an absolute joke. The characters were uninteresting and flat. The storyline was choppy and confusing. The dialogue was laughable and childish. Even the spice was flat. I found myself laughing at serious parts and cringing anytime the male lead tried to be dominant. Read a book if you want to explore this kink. This is a movie making fun of the entire genre and lifestyle."
  },
  {
    "rating": "1/5",
    "review": "Time I will never get back. What a complete waste and shocking that Nicole Kidman would lower herself to such trash"
  },
  {
    "rating": "4/5",
    "review": "What even are power dynamics? Lush aesthetics (you know that A24 look), gorgeous soundtrack, and sexier than it probably should be."
  },
  {
    "rating": "2/5",
    "review": "The movie tries to find itself and then loses itself and somehow it finds itself. If you can understand my post then you'll understand this movie..."
  },
  {
    "rating": "3.5/5",
    "review": "it was very interesting and cool"
  },
  {
    "rating": "5/5",
    "review": "Mesmerising performances"
  },
  {
    "rating": "4.5/5",
    "review": "Uhm…yes It was very sexy and maybe a little weird but…yes a million times yes"
  },
  {
    "rating": "2/5",
    "review": "Its really interesting how you can almost always see the hand of a female director. The subject matter and how the point of the film just feels forced are the two biggest glaring giveaways. Nicole is great as always but you see she's lost and just cant make the role believable. Same with Harris, tho he is def the weaker one. Though I do appreciate the subject matter, the execution is nothing more than a butchering of a great idea with lousy ending: she finally orgasmed with her husband and lived happily ever after"
  },
  {
    "rating": "2/5",
    "review": "The acting was good. This movie gave me an unsettling feeling that almost made me stop watching.. and I love intense stuff. What really makes or breaks a movie for me is the ending, and I thought the ending was horrible. How do you end an intense serious movie with a unrealistic and cliche ending?"
  },
  {
    "rating": "0.5/5",
    "review": "Turned this movie off when they meet in the hotel room - very cringe worthy and dubious attraction between the two."
  },
  {
    "rating": "0.5/5",
    "review": "I watched it because my girlfriend insisted on watching it with me. Honestly it could have been a good 50 shades of grey kind of film if you know what I mean. Unfortunately this moovie does not have the balls to be erotical."
  },
  {
    "rating": "1/5",
    "review": "I love Harris Dickinson but this was genuinely ass… It was more centered on her life and problems at home. Not to be nasty but he was basically fully clothed the ENTIREEEE time and they barely did nothing except him finger her"
  },
  {
    "rating": "4.5/5",
    "review": "If you think this movie was about lust and sex then you missed the entire point. The last 3 scenes makes you rethink the entire movie. It’s a very deep look into the dynamics, rolls, and needs within a long term relationship and what it takes to get them back on track for both people."
  },
  {
    "rating": "1/5",
    "review": "It fails to deliver, boring and shallow."
  },
  {
    "rating": "1/5",
    "review": "Terrible movie, a waste of my time."
  },
  {
    "rating": "0.5/5",
    "review": "so stupid. Please don't waste your time."
  },
  {
    "rating": "0.5/5",
    "review": "The worst movie i have ever seen. Its boring the whole movie. Didnt enjoy even 1 sec. Dont watch it u will waste 2 hours of your life. Go watch paint dry its more exciting"
  },
  {
    "rating": "1/5",
    "review": "This movie was a big disappointment. I like Nicole Kidman and generally like these type of movies from \"Fatal Attraction\" , Diane Lane and Richard Gere in \"Unfaithful\", and Demi More and Michael Douglas in \"Disclosure\", All of these movies had a compelling story and characters that I cared about. Consequently, I was eager to also see this flick plus a chance to Nicole in the buff.. Unfortunately, Babygirl does not have a compelling story and most of the characters including Nicole Kidman's character are unlikable (Extremely unlikable)..In addition, the movie tries to shoehorn themes around \"Women Power\" \"Me too\" \"Consent\" and in the final analysis, ends up being one big bore.. Save your money and rent something else.."
  },
  {
    "rating": "4/5",
    "review": "The chemistry between the 2 main characters of romy and sam was great. The ending they played it to safe. Tim Treakle"
  },
  {
    "rating": "1/5",
    "review": "Nicole Kidman’s Latest—A Modern Bondage Epic (With Extra Botox!) Nicole Kidman is back, and this time, she’s starring in a psychological thriller that’s less Eyes Wide Shut and more Face Wide Stretched. In what can only be described as Fifty Shades of Beige, Kidman plays a woman trapped in a twisted game of control, submission, and—you guessed it—questionable cosmetic surgery. From the moment she appears on screen, you can’t help but wonder: Is she in emotional distress, or is that just what her face does now? Her expressions fluctuate between mildly surprised and vaguely haunted, like a wax figure that just found out it’s being melted down for parts. The film’s supposed tension is overshadowed by audiences trying to decipher whether she’s reacting to danger or a particularly tight facelift. At its core, this is a film about endurance—both the character’s suffering and ours. And in the end, the real mystery isn’t the plot—it’s how Kidman’s forehead stayed that smooth through all the trauma."
  },
  {
    "rating": "1/5",
    "review": "This is one of the films with the dumbest plot I've ever seen."
  },
  {
    "rating": "4.5/5",
    "review": "All y'all that said it missed the mark, missed the mark. You didn't get it. It's about healing shame."
  },
  {
    "rating": "2.5/5",
    "review": "This movie reminded me of Kim basing her in 9 1/2 weeks and Nicole Kidman and eyes wide. i’d like to get my 90 minutes back."
  },
  {
    "rating": "1/5",
    "review": "Worse movie ever. Extremely slow, and content was just awful. Very disappointing."
  },
  {
    "rating": "2/5",
    "review": "This movie didnt know what it wanted to be....a retelling of fatal attraction? A toned down retelling of 50 Shades of Grey? A love story? A Girl Power story? A Boss Woman story? Its a lot of disjointed parts put together. People are labeling it as a thriller but its not"
  },
  {
    "rating": "1/5",
    "review": "I love taboo sex but this was weak and controlling"
  },
  {
    "rating": "3/5",
    "review": "Too self centered only with the protagonist which made the plot never grew up comedy. Wasted effort yet the lead made good portaits."
  },
  {
    "rating": "2/5",
    "review": "Not a good movie. The actors don’t have the chemistry it takes for this kind of story. I was hoping to watch something unique but it ended up being a cliché. The cinematography was good, it has all the elements but it doesn’t work at the end."
  },
  {
    "rating": "0.5/5",
    "review": "So cringy. I felt like the actors were really trying to make it work, but maybe the awkwardness and soullessness of the characters is what made it so desperately unsexy."
  },
  {
    "rating": "0.5/5",
    "review": "This is the most boring movie ever, nothing like the consensual dominant submissive they are trying to portray. I understand fantasies and kinks but this was not has it is in the real Bdsm world at all. If you thought fifty shades was bad... Well it is far better than this."
  },
  {
    "rating": "3/5",
    "review": "There is no denying Nicole Kidman has a very hawt body & I would go out with her but I found it funny as hell how a CEO of company gets involved with a freaking intern like are kidding me talk about a stretch and I've never seen fifty shades but I can imagine it was something like this."
  },
  {
    "rating": "0.5/5",
    "review": "Fifty shades closed, featuring the Intern (Compared to the trailer and interview) Terrible movie"
  },
  {
    "rating": "4/5",
    "review": "Great movie - it was twist and turns throughout, with a surprising ending."
  },
  {
    "rating": "0.5/5",
    "review": "such a bad movie. I never thought I’d ever see a movie as bad as 365 days, yet here we are. I was so grossed out 2 seconds into the movie. also why the hell does she think of herself as a DOG?! sexualising animals is “erotic” now?? anyways.. I’d give it a 0, but that twink was hot so I’ll let it slide for now"
  },
  {
    "rating": "0.5/5",
    "review": "Movie wasn’t good at all bruh 😭 as a young person who enjoys spicy things"
  },
  {
    "rating": "3/5",
    "review": "64%. Weird story about a controlling CEO yearning to relinquish control and be submissive sexually. She sees one of her interns on the street take control of a dog and is attracted to him immediately. They then form a bond and she cheats on her husband continuously with the intern. To me it didn't feel like this one observance was enough to be so infatuated with a young, intern and subordinate that would be worth risking your career and family with. Even if she was craving being submissive and having a more thrilling sex life. Kidman plays a lot of very sexual roles and this is another. It starts off very weird and boring and eventually gets more intriguing but still not very good. 0/5 rewatch"
  },
  {
    "rating": "3.5/5",
    "review": "I don't really know what's happening here."
  },
  {
    "rating": "2.5/5",
    "review": "too messy and confusing to really provide the message it should have NICE TRY THOUGH embrace your kink !!"
  },
  {
    "rating": "3.5/5",
    "review": "I felt this film to be very good . its obviously about an affair but overall its about coming to terms and being sexually accepting of who you are as a person and not hating yourself or denying what you like sexually .Nicole Kidman ,Harris Dickinson , Esther-Rose McGregor and Antonio Banderas were all very good ."
  },
  {
    "rating": "1.5/5",
    "review": "Disappointing story and acting .. very surprised how a Nicole K acted."
  },
  {
    "rating": "0.5/5",
    "review": "I had never walked out of a movie theater before a film finished until this disaster. 40ish minutes of my life I'll never get back. It's not because of the overtly sexual nature which doesn't bother me. It's the cringeyness with such bad acting, and, in my opinion, a stain on Kidman's career. I asked customer service at AMC for a credit towards another movie, and they knew exactly what movie we'd just walked out of. They knew the movie sucked too."
  },
  {
    "rating": "1/5",
    "review": "Poor shallow script . N Kidman plays the usual silent pensive type Nothing really works well - it all feels contrived. Dull and empty - the film is one dimensional - a 300 word article in a magazine would have got the same point across : yes - women have fantasies too - err - we know that . It would have been better to have not made that the only think going on in the film."
  },
  {
    "rating": "1/5",
    "review": "This was just Nicole Kidman pretending to be a dog."
  },
  {
    "rating": "0.5/5",
    "review": "When this train wreck of a film ground to a halt I turned to my very hot husband and said “let’s go to bed and definitely not have sex”. This movie was full of half baked fantasies that were brought to life in a way nobody actually wants and was easily the least sexy film of all time. I wish I had read the reviews before buying this and not the internet hype."
  },
  {
    "rating": "0.5/5",
    "review": "Zero chemistry between these actors."
  },
  {
    "rating": "1/5",
    "review": "I've given 1 star for cinematography. I'm not sure what the original script was like, but I feel the direction and acting made the story line into a directionless mess. Sorry guys. I know it is very hard work to make a film, but this film let you down."
  },
  {
    "rating": "0.5/5",
    "review": "I miss the days when I hadn't watched this movie yet."
  },
  {
    "rating": "5/5",
    "review": "Nicole omg! You expose yourself so sexually. You look great! How hard to be an actress. Good for you. Love all your movies."
  },
  {
    "rating": "2.5/5",
    "review": "interesting premise but badly executed. I believe getting Dickinson to play the lead was a bad idea. He was not convincing at all. If they casted someone else more believable for that role it might have been another story."
  },
  {
    "rating": "0.5/5",
    "review": "Mysongynistic movie. My best guest is that the actors involved envisioned a better, more sophisticated, outcome than what the audience received."
  },
  {
    "rating": "4.5/5",
    "review": "wowww bagus sekaliii😲"
  },
  {
    "rating": "5/5",
    "review": "Wowwww i fall in love with this senior actress and this film is also challenging from all sides, especially a24 PH. Great job."
  },
  {
    "rating": "5/5",
    "review": "Provocative and unsettling, Baby Girl is a gripping thriller with a standout performance from Nicole Kidman."
  },
  {
    "rating": "5/5",
    "review": "Ridiculously hot and brilliantly nuanced. The SM film we didn't know we needed. I'm going to go out on a limb here and say it was even better than 50 shades*. *Deliberately facetious."
  },
  {
    "rating": "2/5",
    "review": "'Babygirl' is a tame erotic thriller that possess a stunning Nicole Kidman performance, but is mostly just uncomfortable."
  },
  {
    "rating": "0.5/5",
    "review": "one of the worst movies I have ever seen - total waste of time I will never get back!"
  },
  {
    "rating": "1.5/5",
    "review": "Twisted on multiple levels, but confused on its message - Baby Girl is just sick trash."
  },
  {
    "rating": "5/5",
    "review": "Spoiler Alert: The acting made this movie. The storyline is a bit of a stretch for some people because this is not how see women and definitely not how society wants to see women, which I feel is the point. And the point of making it so visceral. We see men in Kidman’s role all the time, as the older leader with a younger subordinate and power dynamics, but we don’t see this as often with women. When we do, it viewed as awkward and wrong, even. Yet we don’t tend to view men in these roles quite as wrong or awkward because we see it so much. It’s normalized. Kidman does an amazing job showing how she wants to be a certain way, sexually, but struggles to find that with her husband, but is caught in wanting to be how she thinks he wants her to be. Women ignore real desires and the struggle to communicate those desire to partners is real, even in long term marriages, hence some of the awkward moments in bed with her husband. Banderas Is extraordinary in showing his love for his wife being playful and supportive, and the pain when she admits the affair is so well done. It’s nice to see men caring and feeling that deeply and still not making it about them. He stays and in the end listens and wants to understand. For me, this movie is far less about the the affair and more about the dynamics women’s sexuality and relationships. This FEELS like a movie directed by a woman and Reijn hits it out of the park. I could not love Banderas and Kidman more for taking such a leap in exploring this role and making it come to life is real and emotional way. If you’re not giving this a 10/10 then you many need to watch again with different focus."
  },
  {
    "rating": "2.5/5",
    "review": "The movie was interesting but it didn't make sense. Why was this powerful woman attracted to such a strange young guy and actually take it so far as to crawl around for him? And why would a young guy (presumably not rich) be renting hotel rooms for them to hug each other in? There was so little sex in this movie I'm not sure there was any, other than the opening scene. Did they do more than hug and cry? There was just so little chemistry and it was so cringey. And I guess they were trying to explain she was so messed up due to being brought up in a cult, and she had \"dark thoughts\" which involved asking her husband to do something pretty usual to her. (and not \"dark\") I felt bad for her that she wanted to debase herself with a young guy. Eventually, everyone was threatening Romy because even high powered CEOs are weak and needy. Romy was so typical for how women are treated in movies. The movie fell apart at the end. Romy looked like a disheveled drug addict and there was no reason for her to look like that or behave like that but I guess she was \"falling apart\". I don't even know what actually happened in the last few minutes. The young guy was with a dog in the hotel room. Very strange and nonsensical. Overall I was hoping for more of a 9-1/2 Weeks vibe, but this was some really weak tea."
  },
  {
    "rating": "1/5",
    "review": "É uma fanfic reversa de 50 Tons de Cinza muito mal feita criada pra tiktokers."
  },
  {
    "rating": "1/5",
    "review": "This movie was so sloppy. The story line was just a jumbled mess that left you with little to care about each character, besides maybe the husband. The “erotic” scenes were uncomfortable and not for the reasons they were going for."
  },
  {
    "rating": "4.5/5",
    "review": "Never have I seen a scene as cathartic as the close up of Nicole Kidman’s face shocked by her own pleasure and overcoming a lifetime of female shame. Finally we’re getting to a place where such secret and intimate feelings are shown in a mainstream movie. Is it perfect, maybe not, but I grew up in a landscape quasi exclusively showing the male experience so I’m just grateful to be watching this. Kudos to Nicole Kidman for baring her whole self and going for those roles."
  },
  {
    "rating": "1/5",
    "review": "Just terrible. No story, no point. And ruined one of my favourite INXS songs for me forever."
  },
  {
    "rating": "0.5/5",
    "review": "Can’t tell if I hated it because it is totally realistic or offensive as a woman. Or if it because Nicole Kidman is total over done. Whatever the reason, save your money and time."
  },
  {
    "rating": "1.5/5",
    "review": "From plot holes to tropes like the clueless husband, this movie proved difficult for me to finish. Who is the intern and what is his motivation? What was so special that the top executive would risk everything? As others noted, Basic Instinct and Fatal Attraction, paved this erotic thriller ground and the Secretary showed sex outside traditional bounds years ago. Although these centered on male protagonists and Babygirl doesn't, the lack of male naked bodies in this movie made me feel the movie perpetuated the male gaze. The intern's seeming ability to read people's needs interested me the most. His face to face with the executive's husband intrigued me in ways much of the movie didn't. Does her ownership of her desires make everything worthwhile?"
  },
  {
    "rating": "3/5",
    "review": "It was interesting but at times a bit cringe. Props to the beautiful NK for bearing it at her age... been a fan since Dead Calm."
  },
  {
    "rating": "3.5/5",
    "review": "Babygirl is a thought-provoking, erotic, psychological thriller. The whole story is a character study and I realised that near the end of the film. Both leading characters are very complex. I still wonder whether Romy wanted it or not. There are also great moments, for example in Romy's eyes Isabel's actions with the girl next door verified her own. It was a little frustrating when I realised that none of the characters make good decisions when needed, but that's also very realistic. On the other hand I couldn't feel connected to any of the characters except for Jacob, but the movie doesn't focus on him too much. So wasn't too intrigued throughout the whole film. The cinematography is great, I loved the longshots, but it's not the way of filming that is outstanding, but the acting performances. Both Nicole Kidman and Harris Dickinson are amazing. In the beginning there was a little use of CGI which was terrible in my opinion. The score and soundtrack on the other hand is extremely powerful and my favourite aspect of the film. The cast is great, I didn't know some of the actors involved, so I was surprised to see Esther-Rose McGregor after seeing her in Obi-Wan Kenobi a few years ago. Babygirl has its amazing aspects, but overall it's a little boring and it's not outstanding."
  },
  {
    "rating": "2/5",
    "review": "Well, as a respect to the cast, I won't be harsh but it was a soft porn with little going on and not much to be expected of it. Reminded me of 'unfaithful' obviously but a very poor version of it."
  },
  {
    "rating": "1/5",
    "review": "Unrealistic as the dye of NK's hair"
  },
  {
    "rating": "0.5/5",
    "review": "Horrible movie, no plot line. Guy is into beasteality. Boring AF"
  },
  {
    "rating": "1/5",
    "review": "There is no even chemistry between the two main characters..."
  },
  {
    "rating": "2/5",
    "review": "A24 always creates visually cinematic scenes with rich colors and thoughtful angles, but the film's story is confusing. The script doesn't really hit the mark, and I didn’t come into it looking for sexiness, yet the film still didn’t offer much to me."
  },
  {
    "rating": "5/5",
    "review": "The scene with Father Figure will stay with me for a long time. Great movie"
  },
  {
    "rating": "5/5",
    "review": "Wonderfull acting and a beautiful story about a woman who discovers her own sexual desires. I will never think the same about ordering someone a glass of milk."
  },
  {
    "rating": "3/5",
    "review": "I am glad that Erotic thriller is back. I am glad that Nicole finally plays a different role from her recent years, a role she can show how much of a spectacular actress she always is. Unfortunately tho script is lazy. Solely relies on two leads and doesn't put effort to build tension,to pull us in. Harris Dickinson is a talented enough actor but not that compelling to make me believe in the irrestible hold his character has over Nicole's."
  },
  {
    "rating": "3/5",
    "review": "Nicole Kidman really tried to be different and powerful. However, the movie didn’t offer that; it failed to give her any powerful or dramatic moment that swept the audience away. I expected this to showcase her in a position of power, but instead, it was just her and Harris Dickinson arguing over trivial matters—like “I need you, but this is unprofessional.” I understand that they were trying to portray her career and family crumbling, but the film never fully delivered on that concept. Nicole had a brief moment of power at the end, but that was it. I understand the desire to be \"different\" sometimes—we are human and have needs to be fulfilled. The stakes were supposed to be high, but the moment lost its impact. The movie had a clear idea of what it wanted to achieve but fell just short of reaching it."
  },
  {
    "rating": "1.5/5",
    "review": "Nothing new. Parts of the plot have already been seen in other films with different power imbalances between the protagonists. The dialog seemed static, fragmented. Just like the movie as a whole seemed like a series of TikToks. At times it was rather embarrassing and the superficiality made you feel ashamed. Spend your movie ticket money on something else."
  },
  {
    "rating": "3/5",
    "review": "It was an okay movie. I expecting more. Message of the movie is to be open to communication especially about the things that happen in the bedroom. Fellas listen to your girl and be open minded."
  },
  {
    "rating": "3.5/5",
    "review": "nicole kidman can be mu father figure anytime she wants and i’ll not only let het but will say please and thank you for doing so! this one was beyond good in a lot of ways! it’s nicole kidman’s world and we’re just living in it! she goes from mother, to CEO, to babygirl in a matter of hours and i cannot yet phantom why she didn’t receive an oscar nomination or the recognition she deserved from this movie and this role! the movie in general was greatly filmed, nice play with the dialogue and interesting setting and storyline, but it’s nicole who really shines and the absolute star of the show <3 all my praises to that woman!"
  },
  {
    "rating": "4.5/5",
    "review": "Better than I expected! Nicole Kidman did a really good job in this one as well as the others.. Wouldn’t watch it in the theater but worth it on fandango in your living room. It gives you what it promises!"
  },
  {
    "rating": "3.5/5",
    "review": "Overall good movie for the theme. Nicole Kidman is stunning and puts on a great performance. I would say that the casting of her male counterpart was lacking in sex appeal as per my spouse. The movie does tend to drag a little and could have had more of the good stuff, but overall a good drama."
  },
  {
    "rating": "1/5",
    "review": "Shockingly bad. No tension or build up at all. The husband portrayed as totally unaware of all the goings on until the last minute. Can't understand why Nicole Kidman would want to star in such a bad effort."
  },
  {
    "rating": "2.5/5",
    "review": "Interesting but not worth watching in cinema. The concept of the power dynamic was cool but two points bothered me. 1 movie took too long, 2 Nicole Kidman looks scary after all that plastic surgery."
  },
  {
    "rating": "1.5/5",
    "review": "Wtf. Not overall believable at all. Harrison is great to watch very magnetic however this story is unrealistic. Not very enjoyable to watch & I will not watch again."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible. Boring, has no point and difficult to sit through the whole movie. I would have walked out of the cinema, had I not been there with friends. Orinarily, I like Nicole Kidman, but I think she should be ashamed of starring in this movie, it's the worst!"
  },
  {
    "rating": "0.5/5",
    "review": "The movie could've been over in the first 10 minutes (or less), which is proven with how the movie ends. I felt embarrassed for Nicole in this role. This movie makes old school Skinamax look good. It's not sexy, sensual, or tastefully erotic (imo). Others have addressed the subject better. I wouldn't even watch this on streaming. At one point, I thought everyone in the theater would get up and walk out en masse."
  },
  {
    "rating": "4/5",
    "review": "The acting by both Kidman and Dickinson is superb. I also though the writing was fast paced and the sex scenees were appropriote, minus one scene with some particularly cringe dancing from Dickenson which felt out of character and awkward. What makes this film unusual for any film about a woman exploring a fetish is the happy ending and sweet, empathetic characters, including both protagonists."
  },
  {
    "rating": "1/5",
    "review": "Babygirl (2024) is yet another attempt at making a \"provocative\" drama that leans too much on surface-level shock value rather than compelling storytelling. The plot, if you can call it that, revolves around an imbalanced relationship dynamic that lacks any real emotional depth. There is no real buildup, no effort to make the audience care about these characters beyond their physical interactions, and certainly no originality. The film tries to be daring, but instead, it feels like a predictable series of events with little payoff. The directing is uninspired, relying on overused shaky cam techniques that have no business in a drama like this. The cinematography does nothing to elevate the story, and at times, it feels like the camera is as lost as the script. The only real standout performance comes from Antonio Banderas, but he's barely in the movie. Nicole Kidman, despite her talent, is stuck in a role that feels more about aesthetics than substance. And of course, we have the usual over-the-top praise for a \"bold sexualized performance,\" the same kind of overhyped reaction we saw with Demi Moore in Substance, as if established actors being in explicit scenes somehow qualifies as groundbreaking cinema. The script is painfully weak, with dialogue that does little to make the characters feel real or relatable. The film spends too much time trying to push a message without taking the time to craft an engaging narrative. There are moments where it seems like it might go somewhere interesting, but then it falls back into the same repetitive themes. The pacing is another issue, dragging through unnecessary moments while rushing past anything that could have added depth. The score is outright annoying. It doesn't complement the film or enhance any of the scenes, it's just there, adding to the discomfort in all the wrong ways. In the end, Babygirl tries to be provocative but lacks the intelligence or creativity to make an impact. It's the kind of movie that confuses shock value with substance, leaving you wondering what the point of it all was."
  },
  {
    "rating": "0.5/5",
    "review": "The best parts of this movie were seeing the beautiful apartments and houses for decorating ideas in the future the movie the characters and the plot was horrible"
  },
  {
    "rating": "2.5/5",
    "review": "Direção: Ok Atuação: Ok Roteiro: Ok Caracterização: Ok Soundtrack: Ok"
  },
  {
    "rating": "3.5/5",
    "review": "Something different than usual, but there were scenes that didn't make sense. The characters' acting was very good."
  },
  {
    "rating": "1/5",
    "review": "I knew from the beginning this wasn't going to work because of the young actor they put as Nicole's lover. This guy is so unattractive it's ridiculous. She needed to be paired up with someone like Antonio Banderas or Keith Urban. I wouldn't have even dated this guy. No sexual chemistry whatsoever! No steamy sex scenes. It was terrible I spent $20 to see this what a waste!"
  },
  {
    "rating": "1/5",
    "review": "This must be one of the worse films that Nicole has done which saddened me.... poor story line, bit of dominant behaviour, female boss as submissive, its not a sexy film but there's lots of sex acts in the film..."
  },
  {
    "rating": "5/5",
    "review": "Please ur girls fellas"
  },
  {
    "rating": "2.5/5",
    "review": "It was OK but probably won't watch it again"
  },
  {
    "rating": "2/5",
    "review": "The trailer was sooo fun so i was really looking forward to this movie so everything fell so short. It felt rushed and unrealistic. Nothing was particularly kinky. And it definitely was not a love story. Theres no happy ending. Towards the end it felt like a whole scene had been cut out because i couldnt understand the context or what was happening. I liked the casting but wouldnt watch again."
  },
  {
    "rating": "1.5/5",
    "review": "Forgot what this was about the moment it ended. Was this going for shock value? I found it bland."
  },
  {
    "rating": "1.5/5",
    "review": "Like porn for old ladies. It reminded me a little of \"Fifty Shades...\" but a little less bad"
  },
  {
    "rating": "1/5",
    "review": "What kind of a sick writer wrote this movie and what possessed any director to agree to producing this movie, it was absolutely disgusting, it made me feel sick to my stomach that not even half way in I walked out of the cinema, the second I heard the words \"Get on your knees\" come out of that character's mouth I knew I didn't want to watch anymore."
  },
  {
    "rating": "0.5/5",
    "review": "Another cougar movie. Softcore porn. Avoid."
  },
  {
    "rating": "3.5/5",
    "review": "Hot and Bothered! This movie made me extremely uncomfortable in a good way. The power he had over her made me so uneasy but the pleasure she felt WOW.... It is never worth ruining your life for amazing sex but it was great seeing someone on screen risk it all. I was not expecting the twist in the end. This is not for the kids but a great couple watch with an open minded partner. My husband walked out disgusted. LMAO"
  },
  {
    "rating": "0.5/5",
    "review": "Uma perda de tempo, a história é rasa e focada nas cenas de submissão sexual da protagonista. Com esse roteiro péssimo parece que a vontade deles era fazer um filme porno."
  },
  {
    "rating": "3/5",
    "review": "Cold, uninvolving but ultimately watchable due to compelling central performances from charismatic leads. Kidman is excellent and plays the role of the sexually frustrated CEO extremely well. However, I couldn't care less about these people. All the characters were pretty unlikeable even Banderas as the cuckolded husband. For a movie that's full of sex scenes it was not at all erotic. Perhaps that was the point."
  },
  {
    "rating": "1/5",
    "review": "This film has a certain uncomfortability about it that is neither ultimately satisfying nor engaging. The interminable focus on the sexual fulfilment and enlightenment of Kidman's character serves very little purpose. An odd choice of music is puzzling, with 'Never Tear Us Apart' and 'Father Figure' having no relevance to mood or plot. If there is some philosophical thread that sets out to arouse the viewer, I can not see it or feel it."
  },
  {
    "rating": "2/5",
    "review": "Not as good as the hype would have you believe. The sexual interactions between the stars, whilst obviously going for weirdness, seems unrealistic. The premise of their relationship of him blackmailing her into seems the wrong message to send. The performances of Kidman and Dickinson are good and doing their best with the source material. Maybe it's not aimed at my demographic but the film just wasn't my jam and a hard slug to watch."
  },
  {
    "rating": "2/5",
    "review": "This could have been an amazing exploration of a female sub's desires. Instead she ended up with a bratty 20 year old. In true fashion. The woman needs to be destroyed by her own sexual energy....."
  },
  {
    "rating": "2/5",
    "review": "Nicole Kidman is not a real fave of mine...seems to always play Nicole Kidman just in different situations and clothes. But that aside, I did want to give this movie a look-in after I read some reviews. I was disappointed for a few reasons. One, was that it took way too long to get 'going'. Once it did - eventually - the greatest disappointment was the complete lack of any chemistry between the two characters. One kinda expects some 'heat' when protagonists are embarking on something so risky. Also, I didn't find the Samuel character sexy at all...or particularly dominating...which I gather was how he was meant to occur. The scenes when Romy was climaxing, just showed a wooden-ness I've come to expect from Kidman. The best performance was from Banderas. Imho. At least he showed some passion."
  },
  {
    "rating": "0.5/5",
    "review": "Garbage, Kidman was poorly casted & her acting was terrible. Don't waste your money"
  },
  {
    "rating": "0.5/5",
    "review": "This is a horrible movie, Nicole looks like a wrinkly old lady 🤮… the sex scenes are just awful. At one point in our lives we need to accept it’s over.. she needs to accept that it over for her."
  },
  {
    "rating": "1.5/5",
    "review": "Look I've seen my fair share of dramatic/erotic thrillers and this one was just plain disappointing. First, Nicole Kidman was the wrong choice for the role. Because of how recognizable she is I was never fully convinced of her sexual fantasies nor desire to be submissive--it felt like she was playing a part (in a bad way) the entire time. Additionally, it never felt like she wanted to be controlled because she didn't. The confusion between sexual fantasies was extremely difficult to follow and to be honest I never really thought the characters had good chemistry. The only time we see Romy yearn for Samuel is out of jealousy and that felt out of place because it was one of the only real outbursts she had (apart from the \"fight\" scene in the original hotel). Lastly it was so cringe. All of the intimate scenes were horribly acted, I never understood Samuel's character (maybe that's on me) but I was genuinely bored. I wished they had fleshed out the dynamic more (rules/conversations an actual dominant and submissive would have) and we did not need the montage of intimate scenes just one or two more that actually showcased their dynamic (imo). Overall not the best which is really sad because I've been waiting for more movies of this genre to come out for a while and was hoping this one would live up to that expectation."
  },
  {
    "rating": "2/5",
    "review": "Nicole Kidman's sexual need is something majority of women can relate too, however, I expected more from the movie in terms or suspense and a reason for her need."
  },
  {
    "rating": "3.5/5",
    "review": "An erotic thriller that shines thanks to its protagonist and a director who knows what she's doing. In any case, it's a film that doesn't end up being completely rounded and promises more than it ends up delivering at the end of its credits, but it's entertaining, has brilliant moments of eroticism and dares to give something more in the search for personal satisfaction of its protagonist. It's a fun game that's worth getting into and enjoying, especially for the queen Nicole Kidman."
  },
  {
    "rating": "2/5",
    "review": "A total disappointment. Not sexy at all. The scene of cat licking the milk from a plate was a total disappointment and very humiliating. Expected a total different movie, sexy, sensual, exciting. Not worth the money and time. I only give the two stars for Nicole Kidman because she is a good experienced actress."
  },
  {
    "rating": "0.5/5",
    "review": "Boring movie leading to nowhere. Degenerate and stupid, a complete waste of time. Dunno how these people and critics high rate a movie like this, have they even see a movie before?"
  },
  {
    "rating": "5/5",
    "review": "The talk is all about Nicole Kidman. While I was not particularly impressed with her performance, I thought both Antonio Banderas and Harris Dickinson played their very different characters spectacularly well. Banderas awesome like always, and Dickinson a very interesting actor - look forward to seeing him in more films after this!"
  },
  {
    "rating": "4.5/5",
    "review": "Nicole Kidman has been BUSY. This film is dark, sexy, thrilling, powerful and so much more. I did not expect to like this movie as much as I did. I watched Nicole Kidman’s actors on actors interview with Zendaya and decided to watch it once it became available on Prime. I would love to watch the table read with Nicole and Harrison to see the natural chemistry from the beginning."
  },
  {
    "rating": "0.5/5",
    "review": "Rambling plotless film with an unending-no clarity at to what actually happens-not one sympathetic character-stereotyped degrading treatment of a female who \"really wants to be told what to do \" predictable twists -Nicole Kidman never stops being Nicole Kidman- if they had cast a similar looking unknown-would have been much better- relentless sex scenes that were cringe worthy because of the underlying abuse . Two scenes of Nicole's character getting some kind of therapy with eye movement but it's never explained-totally unrealistic-married for 20 years to an husband who's a theatre director who never stops wanton to have sex with Nicole's character after all those years of marriage plus kids (unrealistic) and they are richer than God-nonsensical ending to boot! Skip it!"
  },
  {
    "rating": "0.5/5",
    "review": "Don’t waste your time or money. Horrible!"
  },
  {
    "rating": "0.5/5",
    "review": "The dialogue in ‘Baby Girl’ was amateurish, with the main character’s behavior and motivations lacking coherence. The intimate scenes failed to engage, and some audience members laughed during serious moments, suggesting a disconnect. Additionally, the main character’s appearance seemed overly artificial. One character in the film even comments on it, but I don’t think it hit the way the director intended."
  },
  {
    "rating": "0.5/5",
    "review": "It's about a powerful traumatized woman with a princess complex, just like all of Nicole Kidman movies from the past years. This has been one of the worst movies I've watched in my life."
  },
  {
    "rating": "1/5",
    "review": "Such a bad movie!! I do not recommend, 16 is way too young für this film you have to be 18 at least. Don't waste your money and time!"
  },
  {
    "rating": "1/5",
    "review": "It was the worst movie I’ve ever seen in my life. They were trying to put through a message to the viewevers about s.x positivity, but it was nothing if not forced. The supposed “dominant” male role in the movie acted like a whiney little kid. Him and Nicole Kidman crashed out every single moment she could and she acted like a weirdo whe alone. All we heard was the lead actress moaning and whining through the whole movie. It was terrible."
  },
  {
    "rating": "0.5/5",
    "review": "🗑️ One of the worst movies I’ve ever seen! Storyline was basic, hardly any character development & made with no class whatsoever! It just starts and then all of a sudden the movie ends! Harris plays his character really badly! U HAVE TO QUESTION YOURSELF IF U LIKE THIS MOVIE 🗑️"
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie ever. Nicole.... what were you thinking!? This whole story could have been told in 10 minutes without having to drag the audience through a thought-provoking cliché of sexual desires that just lacked the magic of having a deeper sense of meaning. Maybe a lesson learnt, or a regret of some sorts... but emotionless."
  },
  {
    "rating": "5/5",
    "review": "Brilliant film. Director, performance, script, cinematography, music. So far best film this year. I'm surprise it didn't get Oscar nominations. Why??? This is a masterpiece."
  },
  {
    "rating": "2/5",
    "review": "Expected a lot from the movie, unfortunately doesn’t worth your time."
  },
  {
    "rating": "5/5",
    "review": "This is not a movie for children, or anyone with a child's sensibility about the complexity of female power, sex, and especially females over the age of 45. OMG. Just finished watching Babygirl, I rented it on Prime. Nicole Kidman shines in this fantastic portrayal of modern-day power, sex, and societal expectations turned on its head. I can understand why many viewers are rating this low...but I can't help but feel it's because they are not fully appreciating this cutting-edge depiction of the complexity of a complicated woman with power navigating past trauma, the sexual desire born from it, and the modern world. Kidman is magnetic, complex, and fully relatable in this intellectual, sexy, and multiplex movie. Women over the age of 50 might decide to cheer to finally see more great films made for them."
  },
  {
    "rating": "1/5",
    "review": "Completely unrealistic. Watching 58 year old Nicole Kidman act like a prostitute and do sex scenes is just gross. She's not even a gilf so I'm not sure why or how she gets these roles. Only Marissa Tomei is gilf qualified. I'm surprised Nicole Kidman actually accepted this role/garbage. I mean she is reaching 60 so she should do roles that can help her win more awards."
  },
  {
    "rating": "1/5",
    "review": "Was hoping it would be good, it was boring, wanted to walk out of the theater."
  },
  {
    "rating": "1/5",
    "review": "I wont be watching this, it filmed in camcorder mode, from watching the preview for it. I wasted my money and time on dear satan, conclave, and venom 3. I wont be buying the disk. How can critics think a film made in camcorder mode be good? I want the 35mm viewing. wish I didnt have to give a 1 star, but a negative 5 star rating."
  },
  {
    "rating": "3/5",
    "review": "I wanted it to be good Actually surprised Nicole Kidman would do this kind of movie. I usually like her work. Anthony B. the same. Now Harris Dickerson. He's new to me. I’ll continue to check out his movies. Best part of the movie was his sexy little dance to George Michael’s Father Figure. That I’ve repeated a dozen times. Lol"
  },
  {
    "rating": "5/5",
    "review": "Both leads are impeccable and natural actors with genuine chemistry."
  },
  {
    "rating": "0.5/5",
    "review": "...KIDMAN...Crawling On The Floor To Drink Milk Out Of A Saucer To Please Her BOY TOY Did Me In...Not \"EYES WIDE SHUT\" Or Even Close..."
  },
  {
    "rating": "3.5/5",
    "review": "Worth the watch, although, they could have done a lot more of the concept. It felt like they were running out of movie time and wrapped it in a messy way, but I think the problem was that the setup took almost half the movie. Some potential wasted here, but still interesting for what it is. (A lot of the bad reviews are just very uptight people that can't accept that this kind of thing actually happens)."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was as disappointing as Beyoncé winning the 2025 Grammy for best country music album…. An absolute joke"
  },
  {
    "rating": "0.5/5",
    "review": "Well, that’s two hours of my life I’ll never get back. Smouldering? More like uncomfortable sex scenes. There were some things that made no sense at all. They talk about consent, but he essemtially blackmails her into continuing the relationship, saying he’ll ask for a transfer if she doesn’t keep seeing him. I will say that I didn’t see the twist at the end coming. But that’s because it made no logical sense whatsoever. The only reason I stayed until the end was that I had a big frozen drink to finish and I was at the cinema. If this was streaming, I’d have switched it off in about 10 minutes. Would give it negative stars if I could."
  },
  {
    "rating": "0.5/5",
    "review": "Diane Lane in 'Unfaithful'...now that was believable passion. This movie 'Baby Girl' I really felt none of the actors had chemistry....they just did their lines...blubbering...yelled...panting...whatever....none of it believable. This was a boring movie....and how many movies has Kidman done now..older woman & young guy....it's all getting old too fast...time for her to do something that requires acting...Demi Moore...believable in her Golden Globe nomination....Kidman...nope! Anyway...pewww is my rating!"
  },
  {
    "rating": "0.5/5",
    "review": "The concept could have been interesting if the characters were developed. This movie is a random sequence of scenes with no substance."
  },
  {
    "rating": "3/5",
    "review": "Decent film, I enjoyed it more than I think I would. Very basic storyline as you know what’s going to happen, but nonetheless entertaining for sure."
  },
  {
    "rating": "0.5/5",
    "review": "Only enjoyable moment for me was Harris Dickinson dancing shirtless to George Michael’s ‘ Father Figure’"
  },
  {
    "rating": "5/5",
    "review": "A masterpiece. Nicole Kidman at her finest. Great acting, storyline."
  },
  {
    "rating": "2/5",
    "review": "Looks like the Fifty Shades era is over. Time for a new guilty pleasure to take its place."
  },
  {
    "rating": "3/5",
    "review": "Babygirl is a mess, but it’s the kind of mess you can’t look away from—like a car crash where one of the cars is inexplicably on fire and the other is playing disco music. 3/5, would recommend for the Roomba alone."
  },
  {
    "rating": "2/5",
    "review": "The plot seemed really jumbled up and there was little to no room for real character development. It settled on the lives of the two main character which made it feel like other characters where neglected. The female characters older daughter in particular needed more light on her problems because through the movie I kept wondering what her issue was exactly. That might have been deliberate to arouse questions but it feels more like her character was forgotten and she was made to improv the rest of the movie. It felt like 365 days with a less confusing plot. The male main character was meant to be \"dominant\" but I didn't see much of that. He just seemed like a really effed up kid with mummy issue."
  },
  {
    "rating": "1/5",
    "review": "This was an absolutely dreadful movie with so many holes in the story line that a lot of it just did not make sense. I was expecting sexy but it was just degrading and controlling. One of the worst films I have seen in a long time!"
  },
  {
    "rating": "1/5",
    "review": "Terrible movie, an embarrassment"
  },
  {
    "rating": "3.5/5",
    "review": "Babygirl is an interesting and intriguing film, but I believe it falls short in a few areas. It smoulders but never truly catches fire. It's an erotic thriller with some great scenes though. Romy is a successful woman who is CEO of a robotics company in New York. Her husband is a theatre director and they have two teenage children. But at the beginning of the film we are shown that Romy is sexually frustrated. When a new group of interns are brought to her company we see her take an interest in one of them, Samuel. He takes up her interest and soon they begin an affair, where he plays the dominant role. It's torrid and messy and threatens her seemingly stable family life. The film though doesn't quite fulfill its promise. It's not dark enough to work properly as a thriller and we don'tget close enough to the characters to work as a psychological study. Although falling short the performances are very good. Nicole Kidman and Harris Dickinson are both quite good in the lead roles. An interesting film, but not quite a successful one."
  },
  {
    "rating": "1/5",
    "review": "I thought Hollywood had stopped demeaning women, guess I was wrong! A shameful depiction of a powerful woman, put in her place by supposedly “ wanting” to be submissive. I can’t believe they are getting away with this sort of crap, still!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie was absolutely terrible. You think you'd be watching something akin to 50 shades of gray where a young, charming, seductive man would be taking control of an older woman who wanted to be told what to do, but what you have is a man who acts like a 14 year old boy not knowing what to say or do with a woman. Lapping up milk? The sex with her husband seemed better than the short snippets they had together. Don't waste your time on this as I was left with more questions and disbelief than being turned on by a movie. Completely dreadful."
  },
  {
    "rating": "4/5",
    "review": "Good movie it's nice to see a female character in this role. It reminds me of a few romance books I have read with a little of the dark romance books mixed in."
  },
  {
    "rating": "1/5",
    "review": "Like a chicken together series of skits from drama school. All loaded up with faux tension. Stupid, storyline that can't be believed. Garbage."
  },
  {
    "rating": "2/5",
    "review": "You thought Antonio Banderas would be so bad in bed that Nicole would look for rough stuff with an unsexy office new chum? Does not convince."
  },
  {
    "rating": "5/5",
    "review": "If you are looking for a sexy, clean cut film this isn't for you. If you value raw slightly confronting material you are in for a treat... I felt one of the messages of the film was how empowering and liberating it can be to accept and even play out desires... I felt the scene at the end, where she stands up the man blackmailing her for sex... was sort of the climax of the film"
  },
  {
    "rating": "2.5/5",
    "review": "Movie title should be changed to “Bitch”"
  },
  {
    "rating": "1/5",
    "review": "Creepy and awkward to watch. Porn isn't even as dirty as this film."
  },
  {
    "rating": "2.5/5",
    "review": "It was okay. The leads had good chemistry. But it falls short, for me, in communicating its message. I think the movie Good Luck to You, Leo Grande does an overall better job at handling themes of female insecurity and ageing, and sexual exploration."
  },
  {
    "rating": "1/5",
    "review": "Don’t spend a dime nor a second of your time. Fake bad acting scenes we’ve all seen millions times only in unpleasant way. No real content. Just bad movie. Avoid"
  },
  {
    "rating": "4/5",
    "review": "I watched 'Babygirl' soon after re-watching 'Eyes Wide Shut' which makes for an interesting segue - even the opening waltz and Holiday setting is a cool match! If you imagine it's 25 years later, you could almost call this a loose sequel, following the Kidman character, from the Kubrick film of her sexual introspection to a now full-blown exploration of self-discovery. People do have these lifelong trajectories especially in the confines of a traditional marriage. Kidman's character here, Romy, is finally addressing her sexual fulfillment 'needs' and is beginning to affirm herself, shedding the shame she's felt all her life. And yet, wants to retain her family; she wants to have her cake and eat it, too. I think the film beautifully illustrates this quest."
  },
  {
    "rating": "1.5/5",
    "review": "Promoted as an erotic thriller! Nothing erotic in it nor was it thrilling. Boring film about some sex wacko"
  },
  {
    "rating": "1/5",
    "review": "Not good. Not meaningful. Not insightful just dumb. Kindling that never lights. A story with no surprises…pseudo porn."
  },
  {
    "rating": "1.5/5",
    "review": "The plot? It was a fever dream written by someone who watched Euphoria once and said, “Needs more chaos.” The dialogue? It felt like an AI bot was fed 50 romance novels and a bottle of cheap wine. The acting? Even the actors seemed like they wanted to clock out early. I couldn’t finish it-not because I was busy, but because my soul physically rejected it. If you enjoy watching A-list actors make choices they’ll regret in interviews for years, give it a shot. Otherwise, save yourself and watch Shrek 2 instead. Would I recommend it? Only as a form of psychological warfare. 💀"
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies watched in a long time. Kidman’s performance so fake and bland as she her self. Cringe factor all along, not sexy, not gripping, no punchline."
  },
  {
    "rating": "5/5",
    "review": "Amazing, dynamic, mesmerizing, hypnotic acting with a different, but beautiful storytelling. Loved every moment highly recommended."
  },
  {
    "rating": "0.5/5",
    "review": "Nicole Kidman has been very ordinary for a couple of decades now, If not more."
  },
  {
    "rating": "1/5",
    "review": "Is Nicole Kidman okay? She seems to pick these movies lately that show she’s still a sexual person. This movies is just so uncomfortable, cringy, ridiculous and fantastical. No way any of this story line would ever happen so you find yourself laughing at how stupid this story line is. Save yourself the time and pick some thing else."
  },
  {
    "rating": "1.5/5",
    "review": "It started off good but then was kind of without any closure. Not a very sexy movie like I was expecting. More about lessons to learn."
  },
  {
    "rating": "4.5/5",
    "review": "Not for everyone but it’s a great movie. I liked and saw what the director wanted to show"
  },
  {
    "rating": "2/5",
    "review": "How much i love Kidman and Banderas, unfortunately this movie des not come with any new value to my life. Could be more sex, less sex, less Banderas, more Banderas, its so so boring, predictable, non emotional. I rather watch Emily Perez one more time)."
  },
  {
    "rating": "3/5",
    "review": "This movie looked slick and I was really on board but then it didn't fulfill. It meandered and was choppy and didn't spend enough time with the power dynamic as I would have hoped. In the end she lost nothing and gained everything which isn't a bad thing. It just left me wanting so much more."
  },
  {
    "rating": "1/5",
    "review": "Babygirl tries to be a compelling drama but fails on every level. The screenplay is shallow and cliché, the characters are lifeless and one-dimensional, and the sluggish pacing drains any tension. The performances feel artificial and lack emotional depth, while the direction is uninspired and visually dull. In the end, the film has no clear message, no memorable moments, and no real reason to be watched."
  },
  {
    "rating": "4/5",
    "review": "Layered, unafraid, and well worth the watch."
  },
  {
    "rating": "5/5",
    "review": "Sexy. Passionate, a story of forgiveness . I loved it"
  },
  {
    "rating": "0.5/5",
    "review": "The previews indicate that you're about to see building sexual tension that eventually culminates into a torrid affair. Instead they kiss the first time they're alone, and the \"sex scenes\" after that are weird and clunky - filled also with Kidman lapping milk from a saucer on the floor. There is no character development, just weird inconsistencies into who people are. I think I'm supposed to feel bad for NK, though I'm not sure why. She's unlikeable and immature."
  },
  {
    "rating": "0.5/5",
    "review": "Wanted this movie to be good BUT it was boring and sex scenes were of no climax. Poor acting by Nicole and showed it was a low budget film. No positive as I wanted the movie to end quickly. Don't bother watching it"
  },
  {
    "rating": "1/5",
    "review": "Embarrassing, puerile, laughable and gratuitous. Script and story weak and boring. Can’t imagine what Nicole Kidman was thinking to take this role at this stage of her career."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was hyped up to be something exceptional- but went down like a lead balloon. Let me be clear - I love Nicole but I am shocked she chose to star in a film with no real story line, boring sex scenes and just overall cringe. I read so much about this film being sexy (and called a Thriller!? There is nothing thrilling about this film) and having many full on sexy scenes- you’ll find more in a single episode of Banshee or Vikings. The characters were not convincing and did not draw you in to be invested. Unrealistic- there is zero chance of a high flying, powerful CEO letting an intern show zero respect or professionalism when first meeting. I wish I had not wasted my time or money. I wish I had walked out rather than thinking - it will get better. It doesn’t. If you have to see this wait until you can stream it. I would give this zero stars if I could."
  },
  {
    "rating": "0.5/5",
    "review": "This was an incredibly awkward movie to watch and not because it had anything to do with sex or erotic behavior. The chemistry between the two characters made zero sense. At least when there is a sexual relationship between two people, especially one that has to deal with an affair and an inappropriate office relationship, you would expect there to be some sexual tension or chemistry between the two from the moment they meet. In this case, the two seem like they both have social disorders that prevent them from acting normally around people in general. And the fact that a powerful woman likes to be controlled by a younger man is not a new concept and I can't believe I wasted almost 2 hours watching this movie. It was the most awkward and terribly written/acted out movie I think I've ever seen."
  },
  {
    "rating": "0.5/5",
    "review": "What a waste of time and money. So irrelevant. Not sure if it’s meant to be some sort of porn but if it is there must be MUCH better. Wouldn’t even give it half a star."
  },
  {
    "rating": "0.5/5",
    "review": "Unrealistic garbage - not sexy at all"
  },
  {
    "rating": "2/5",
    "review": "If this movie had been set in 1980, it would have made a lot more sense that the characters knew next to nothing about bdsm, power exchange, poly relationships, etc. But this movie looked very current, and, I'm sorry, the internet exists. It is ridiculously easy to look these things up, join Fetlife, find a nearby dungeon nearby or what have you. Kidman's character talks about wanting to banish the dark disgusting thoughts from her head rather than just admit she's kinky. It just strains a willing suspension of disbelief that no one in this movie knows what kink is. The intern guy was also pretty unbelievable. He acts rude and unprofessional from day one at the office . . . and no one calls him on it. How did he keep his position, whaaat? The movie is disjointed, atmospheric, and rather hard to follow. It serves art film or one long music video bouncing between pop tunes and weird discordant music with a few bursts of badly-written dialogue. But it had some fun sex scenes, some wonderfully weird moments, and a general, oh what is going to happen next that kept me watching. I can't say it was a great movie, but it was amusing enough."
  },
  {
    "rating": "4.5/5",
    "review": "I think Babygirl is a great movie and definitely worth a watch. This movie really shows how important your wants and needs are in a relationship. However, if you are easily disgusted this movie def isn’t for you!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Really wanted to love this …big fan of Nicole Antonio and Harris … but ultimately for me and my hubby who rented it tonight it was awful!!! No storyline, no true sexy chemistry i was on the outside looking in entire time and emotionally detached. One of the worst flicks i’ve seen in a while sadly."
  },
  {
    "rating": "1/5",
    "review": "This film moves at a sluggish pace and fails to deliver on its promise of a psychologically erotic thriller. Instead, it feels like a lackluster attempt at exploring the dynamic between a mature woman and a younger man. The so-called “intern” appears to be in his mid-30s, making the age gap feel less striking. While the main character seems to be in her 60s, with teenage kids, and a boring sex life with her husband. Rather than exuding sexual tension, the film unfolds as a disjointed montage of dating experiences, never delving deep enough into the characters’ emotions or psychology to foster real connection. Ultimately, it’s a disappointing and uninspired effort."
  },
  {
    "rating": "2/5",
    "review": "There were brief moments of the film i enjoyed, however a lot of the scenes fell short of the tension they were aiming to create. The lack of character development made it hard to care about them and it felt pretentious and overindulgent. I found myself laughing and scenes that were meant to be serious ( i think?) Not really a fresh take of anything. I feel like we have seen this all before. I wanted to like it more than i did."
  },
  {
    "rating": "5/5",
    "review": "Yes, definetely super sexy but to me the best of the movie is that Nicole character lives in most women of my generation (60’s) and probably earlier ones. The difference between she and us (English not my first language, sorry) is that not all of us has the courage or the opportunity to she had. Men do not know women and dont care less until their egos are challenged. Well older men at least."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is profoundly disturbing! The interactions between the main characters and the ambiance it provides, as well as the borderline pornographic plot sets the stage for a deep sense of discomfort that lasts all the way till the end."
  },
  {
    "rating": "4/5",
    "review": "A different kind of film to what I usually watch but I I did enjoy it and I’d recommend it. It was funny, scandalous and definitely an interesting watch."
  },
  {
    "rating": "1.5/5",
    "review": "And the point of this movie was what...challenge societal norms about sex and power dynamics? Or was it...growing up in communes / cults and being name by a yogi makes you sex crazed looking to be dominated. Either way, I didn't get it."
  },
  {
    "rating": "3/5",
    "review": "Helps women deal with the spell of a psychopath, basically a good idea but with bad execution."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible movie, don't waste your time lol"
  },
  {
    "rating": "1.5/5",
    "review": "Not exactly sure what the film-makers were thinking but this is NOT hot/erotic or even mildly stimulating like I'm sure they intended. Harris Dickinson is an amazing up & coming actor with huge charisma BUT Nicole Kidman playing the tortured undersexed older vixen just falls flat. She looks more like a science project now. If you want to see it done right, watch Adrian Lyne's 2002 'Unfaithful' with Diane Lane & Olivier Martinez."
  },
  {
    "rating": "2/5",
    "review": "Nicole, nauseating narcissism. Boringly predictable."
  },
  {
    "rating": "5/5",
    "review": "Nicole Kidman does not disappoint. This movie was amazing at times very steamy to where I just was like Oh hell no is this really going on lol and I wanted to see more and more and more .And was wondering what was gonna happen at the end like is her husband gonna find out this was one hell of a movie I absolutely loved it But hell, all of Nicole Kidman movies are freaking amazing I could watch movies like this all day every day just amazing and the guy wow sexy but weird I guess I want to call it lol but What a hell of an actor 👏🙌❤️❤️❤️"
  },
  {
    "rating": "2/5",
    "review": "The subversion of power dynamics between the sexes in this movie is too obvious and rather simplistic. The real question is: why should the audience be invested in someone's supposed dark sexual fantasy when the only engaging outcome is a series of tension-fueled sex scenes without having an actual dark edge? The movie lacks genuine psychological and emotional layer."
  },
  {
    "rating": "0.5/5",
    "review": "If superficial pseudopsychological, fatuous scripted, irritatingly directed, badly acted Nicole porn is your thing, you'll probably create justifications to watch this...if it's not, then you should just completely avoid..."
  },
  {
    "rating": "1.5/5",
    "review": "Oof. 2 hours of my life I'll never get back + 19.99 rental fee. Barely a plot, plus zero screen chemistry between Kidman and Dickinson make the sex scenes seem performative, just two actors doing their best to fake it. If you feel like you must see it, then at least wait until it's streaming for free because that's the proper price of admission to this dud."
  },
  {
    "rating": "1/5",
    "review": "It was horrific. I left the movie theatre asking myself what the hell I had just watched. I was expecting something along the lines of 50 shades but instead I got crying, bad script, a daughter who was there but wasn’t and adds nothing to the plot, a crapy ending that doesn’t really end and no character development. Although Nicole Kidman looks amazing, the movie wasn’t sexy it was just confusing. The characters didn’t seem like they knew what they wanted and the movie was wayyyyyyy too long for having no plot and no defined outcome. Also at the end why did she fantasise about the dog while she was having sex?? Why did it zoom in on the dog so much??? I was speechless afterwards and still can not comprehend what I have watched."
  },
  {
    "rating": "3/5",
    "review": "I think this movie was about a woman who had some desires that she thought were two taboo to discuss with her husband. She ends up meeting a guy who is willing to act out some of these fantasies with her and has an affair. She happens to be a CEO in another woman tries to blackmail her into being her ideal of what a female role model should be. I think the power dynamic between the two main characters was an illusion. She had the power and he was just her toy even if he didn't realize it. But eventually the affair is revealed her husband eventually forgives her and she becomes more open with him about her fantasies which they now share together. Oh and the young dumb boy toy kid got himself a dog. Definitely we're a couple real good laughs in this movie. The line \" we need to set up some ground rules if we're going to do this first rule is I tell you to do something and you do it. Had me rolling. It was an okay movie not risque or anything like that Worth to watch once."
  },
  {
    "rating": "4.5/5",
    "review": "Liked it! I will watch all Nicole Kidman movies."
  },
  {
    "rating": "0.5/5",
    "review": "Poor story line. If you don’t like it the first 20 mins, it’s best to walk out as the rest of the movie is quite the same."
  },
  {
    "rating": "4/5",
    "review": "I think babygirl dives into the realm of a woman's mind and just how far and how much she would risk for her own happiness... the answer??? Everything! Kidman gives a great performance that delivers the sexuality of \"To Die For\" but adds an element of innocence and mystery to the woman she appears to be playing. I think the film explores the true nature of a woman's mind, how narcissistic they all are, and the scariest of all the facts, that they have absolutely no clue what they want. Sadly, 90% of women who watch this movie will be able to relate, because they have either experienced, have done, or would do the exact same thing Kidman's character is doing in the movie. The film also taps into the world of a woman, and what she does when she has a sense of power. Harris Dickinson and Antonio Banderas, in my opinion, offer little to the film, it is Kidman who carries the story the whole way. I would tell the men who are watching the movie to take notes, that sadly, a woman will sacrifice her family, career, and everything she loves for her own happiness, and really dives into how selfish women truly are."
  },
  {
    "rating": "4.5/5",
    "review": "I'm assuming the reason Baby Girl got such poor audience reviews is because of the cis-men who went to see it with their significant others. I loved this movie, and it will be my new holiday favorite, right up there with Love Actually."
  },
  {
    "rating": "2/5",
    "review": "It felt like \"50 Shades of Grey\" came back wearing an expensive wig, a fake mustache, and a slightly better outfit. Nice try. Great actors starring in what essentially is a high-budget mom-porn."
  },
  {
    "rating": "5/5",
    "review": "Loved it! An exiting and provokative movie that shows a woman who never got to explore her sexuality in a “boring marriage” until now. It’s exiting and thrilling. Would watch again"
  },
  {
    "rating": "2.5/5",
    "review": "A24 seems to be a bit less picky these days. Babygirl is cringe-inducing—its hollow characters feel like total caricatures of what “business” people are. You’ll find infinitely more interesting high-end office relationship drama in HBO’s Industry. The film is shot with no passion, the acting is stale, and the plot is just plain creepy."
  },
  {
    "rating": "1/5",
    "review": "This movie was aggressively disturbing. The actors are phenomenal but what was the script? The plot? I felt like I was reading Wattpad at 12 again and not knowing what is happening in this story. I would not recommend. I felt as though it could've used a little more finesse, a little more juje, a little more flavor. I felt like watching it was equivalent to having some scratch nails on a chalkboard but they have really dirty, uncleaned, sharp fingernails and the chalkboard is my eyes"
  },
  {
    "rating": "5/5",
    "review": "Very good. Better than I expected."
  },
  {
    "rating": "5/5",
    "review": "Women are strong 💪!"
  },
  {
    "rating": "2/5",
    "review": "The movie fell flat for me. First of all, the character Samuel, was not good looking enough for me to understand how a top executive would risk it all for him, much less impart lustful empathy from the audience. Second, that situation was incredibly unrealistic. He was way too familiar with her the first time they met- arrogant, disrespectful… if I were in her shoes, I’d have escorted him out of the building in less than 5 minutes. Third, there wasn’t enough character/relationship building between the two. One would have to have a lot of trust with someone dominating you and there was literally zero time between them that allowed that to happen. I get the psychological play with Nicole’s character.. but as a relatively short movie, even that wasn’t played out well. The ending was cliche.. where Nicole’s character seems “healed” from allowing mistreatment. But again- it could also have been a knee jerk reaction to her private life leaked by Samuel. I don’t know… it just lacked substance. Probably would have done better as a series to allow the tension and relationship to build and grow… a little more subtlely. And for Banderas to suddenly take on a domineering role after he felt it was “sick” and seeing how much her adultery hurt him- that was unrealistic as well. Poorly written overall."
  },
  {
    "rating": "1/5",
    "review": "This movie was so boring. Nicole Kidman never spoke above a whisper, the “tension” between the characters was awkward and did not mesh well. So many chances to bring the movie to life but yet nothing. Also the music selected for the film did not match WHATSOEVER!!!!!!!! The reviews did it dirty because I wouldn’t tell a single person to waste money on watching. -10 stars I want my money back."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie. Different from what’s out nowadays which I like. Kind of reminded me of Eyes Wide Shut in some ways."
  },
  {
    "rating": "1/5",
    "review": "Predictable and boring. Nothing new under the sun. Only for Nicole fans."
  },
  {
    "rating": "5/5",
    "review": "It's definitely targeted towards an older audience. To desire but to be restrained by your social position, by your age, history... It's not really something most people would understand. This movie is every genre (well, maybe except horror). It's a romance, it's a thriller, it's comedy and of course it's definitely a drama. The only thing I think it cheapens it is the old '80s tracks like INXS and George Michael - unless these are there solely for Mrs. Kidman's sake"
  },
  {
    "rating": "3/5",
    "review": "‘9 1/2 Weeks’ came out in the mid 1980s and makes ‘Babygirl’ seem like a watered down, PG-13 version of what could have been a better movie about a similar subject. The tension is great and the performances are compelling, but the director shoots the film like someone who is timid and afraid to go the distance. The film also lacks any real sensuality or poetry and makes me want to go watch Adrian Lyne’s incredible, artful filmmaking in ‘9 1/2 Weeks.’ The giggles and shocked reactions of moviegoers during the screening only serves to show how low we’ve sunk as a culture in terms of maturity; that something as prudish as this film would have its audience displaying a belief in its own Puritanism is a sign of the times."
  },
  {
    "rating": "5/5",
    "review": "Fantastic movie, enjoyed every minute of it. I will say its very European and psychological. A lot of reviewers are missing the different layers, so I guess it is not for everyone."
  },
  {
    "rating": "3.5/5",
    "review": "the movie wasn't exactly what I expected, but I like it, even if i hoped for more spicy scene. I understand the real intention of the author that tries to show us how women are scared to get old because their bodies change but also how some sexual fantasies are bad seen by the society and for this reason we want to repress them and we are mistakenly ashamed of that. But who says what is right or what is wrong? I like the actiong of Nicole Kidman and Harris Dickinson, the tension between them was palpable the way she tried to reject him without success...I really appreciate lots of things and I suggest giving this movie a chance."
  },
  {
    "rating": "2/5",
    "review": "Not my cup of tea. A bit unconfortable - in not a good way..."
  },
  {
    "rating": "1/5",
    "review": "This movie was weird, not at all sexy, that’s what it seemed like they were aiming for. Just really strange. There was no point to it at all. Nicole isn’t looking too great these days either. Absolute failure of a movie"
  },
  {
    "rating": "1.5/5",
    "review": "It was an effort to convince us that powerful and wealthy people can be needful, weak, and lose control. That you can be conflicted and confused and unable to resist someone or something that is not particularly healthy only because passion is overwhelming. This story has been written and acted many times with many famous stars. And its always more of the same. They tease obsessive sex driven behaviors wrapped around a somewhat trashy or less straight laced character who lures in the wealthy socialite or the primm pure soul, and they have a torrid affair that always ends in a breakup and the protagonist learning deep inner truths taught by the darkness of forbidden passions....And eventually finds happiness of some form. Yes, its soft porn. Its bad writing from bad novels that sell to bored housewives made into film. Hell Antonio Banderas has even played the same part before. Last time it was Angelina Jolie leaving him for another...and his obsession causing him to break down. And think for a moment....is it possible for a woman to say to Antonio Banderas \"Youve never made me orgasm!\" in real life? This was trashy, stupid, and melodramatic, badly written. The plot was repetitious, cheap romance novel fare, and the acting was poor. If you have 2 hours to spend, you can do considerably better. I Find it humorous how many are saying \"A tour de force!! OH ITS SO MUCH BETTER THAN 50 SHADES!\". Thats rather like saying The National Enquirer is so much better than the Weekly World News...(Or HUSTLER is better than PENTHOUSE...) It was crap. No better way to say it."
  },
  {
    "rating": "1/5",
    "review": "This movie sucked. So contrived I could guess every line. Kidman and Bandero not believable as a couple. Intern guy not attractive or interesting. Annoying music or sounds or whatever… All characters were boring. Don’t waste your time or money."
  },
  {
    "rating": "0.5/5",
    "review": "It would be lovely for directors to start making movies that aren't just thinly veiled derogatory fetishes."
  },
  {
    "rating": "0.5/5",
    "review": "Nicole, babygirl... you need to start making better choices. This was a smoldering mess."
  },
  {
    "rating": "1.5/5",
    "review": "This is awful. I don't know what I expected but not this. Not my kind of movie I find Nicole Kidman really cringe to watch. Maybe that was the goal, to make viewers squirm"
  },
  {
    "rating": "2/5",
    "review": "Great. Another film about power, control, and the insatiable greed of the privileged. A wealthy white woman flits between her sprawling Manhattan penthouse and sumptuous country estate in a distracted state of inchoate desire. She \"has everything\" - yet of course - still wants more. Sigh. It isn't that the premise is so dreadful, but finally, what she wants is so pedestrian, and so predictable. The power she possesses in her wealth, her story-book marriage, and her ill-defined \"high-powered\" CEO position is glossed over - just window dressing for a film that aspires to little more than soft-core porn. And even in that, winds up being more sad than sexy. So many missed opportunities to explore the roots of actual passion, power, and desire in the costext of a very imbalanced world."
  },
  {
    "rating": "5/5",
    "review": "Really good movie especially for those interested in bdsm dom/sub dynamic on training wheels"
  },
  {
    "rating": "3.5/5",
    "review": "Get exactly what you want. Babygirl is a 2024 American erotic thriller film written, directed, and produced by Halina Reijn ❤️ It’s good 🙂 Worth a watch. I’d recommend it if you like this genre 👍🏼 A high-powered CEO puts her career and family on the line when she begins a torrid affair with her much younger intern."
  },
  {
    "rating": "0.5/5",
    "review": "This has to be Nicole Kidman’s worst movie ever. How embarrassing that she agreed to be a part of this mess."
  },
  {
    "rating": "1/5",
    "review": "I was very disappointed with the male actor and also thought the dialogue was weak. I could not believe a strong business woman could behave so weak and then a weak man behave so strong. Harris Dickinson had no gravitas on the screen compared to Antonio Banderas short parts and the script was poor, to suggest that the only thing that was important regarding their relationship was them and not her husband and family but then threaten her to her company if she didn't comply sounded like a 13 y o boy not getting a sweet."
  },
  {
    "rating": "3/5",
    "review": "Who’s the one in more control: the boss or the subordinate? Nicole Kidman, Antonio Banderas, and Harris Dickinson A seductive thriller by director Halina Reign A woman Romy is a high powered CEO of a robotics process automation company She’s married and has two children Things start to change though when she starts having an affair with a much younger man Samuel, an intern no doubt The exchanges between them go from professional to flirtatious to confrontational to unsettling Romy in a way starts to enjoy Samuel’s hostility as a form of foreplay, any minute he can implode her world revealing their secret but she can’t stop being drawn to his demeanor There’s a lot of stuff in here about being submissive, surrendering control, the lack of intimacy while also being intimate, searching for alternative ways to please ourselves when we lack it, actually understanding what consent is, who actually abuses who, what makes a great leader especially for women, we can unexpectedly gain more courage and confidence when facing what we’re afraid to do we wouldn’t normally do It’s also very adult when it comes to the seduction scenes There are a lot of dialogue exchanges keep in mind and I was expecting a lot more crazy melodrama But the performances by Kidman and Dickinson are solid and Reijn’s direction takes a look at desires, power dynamics, personal growth, and the struggles of women between the boardroom and the bedroom"
  },
  {
    "rating": "2.5/5",
    "review": "Pretty much soft porn! Not my cup of tea!"
  },
  {
    "rating": "0.5/5",
    "review": "A waste of time, it was so boring and ridiculous."
  },
  {
    "rating": "1/5",
    "review": "was expecting a lot sexier of a movie"
  },
  {
    "rating": "2/5",
    "review": "Something fell flat. There wasn't enough development of Romy and Samuel's relationship. It was heavy on marketing as erotic thriller but not enough time was spent on the sexual kink aspect of their relationship. I was expecting more attention to be paid to the BDSM part, but sadly it was not."
  },
  {
    "rating": "0.5/5",
    "review": "It's embarrassingly bad. You can see they took parts of 9&1/2 weeks from it which came across so cringe it's hard to look away. I only finished watching to actually see how bad it would get. Male main character was diabolical. I didn't get the point of this movie at all. Female empowerment? Nope, sexual empowerment nope. Just a jumble of rubbish."
  },
  {
    "rating": "1/5",
    "review": "Overhyped.If you are a fan of 9 1/2 week which I rate a as a 5 star film this in comparison is a 1 star."
  },
  {
    "rating": "0.5/5",
    "review": "I went into this movie expecting something akin to 50 shades, but better. What I ended up seeing was a jumbled mess of a movie that has no real buildup, no character development, and honestly was just an un-sexy mess. The movie itself is objectively bad. The pacing, the acting, the camera work, the sound. If you try to look past that just want some smut, it still doesn't deliver. I was left asking myself \"Who did they make this movie for?\" and I still don't have a good answer. I only recommend this movie if you love PG-13-esque, really bad, fan fiction."
  },
  {
    "rating": "2.5/5",
    "review": "Thought it was annoying to watch and Nicole's character kinda got on my nerves."
  },
  {
    "rating": "0.5/5",
    "review": "It was very sexually backward and confused. Not sassy at all and poorly done. The ending was silly and script really badly no point. It could have been good but fell very short"
  },
  {
    "rating": "1/5",
    "review": "This movie had no redeeming features. It is one of the worst films I have ever seen It was just a platform for pornography. I felt soiled after seeing it. A real downer! Nothing uplifting at all just sleazy and sad. I think the title should be The Wages Of Sin Dont waste your time or money on this trash."
  },
  {
    "rating": "0.5/5",
    "review": "So bad I really can’t be bothered to write a review"
  },
  {
    "rating": "0.5/5",
    "review": "Got so bored I started playing candy crush"
  },
  {
    "rating": "2.5/5",
    "review": "Exactly what you'd imagine if A24 decided to reboot \"50 Shades of Grey.\" A promising storyline that could have amounted to much more had it not been mishandled. The relationship between the two main characters felt shoehorned with virtually no buildup and natural chemistry to drive the plot. Awkward dialogue that at times made it feel more like a comedy than an erotic thriller. Still rather entertaining with some interesting moments that made the trip to the theater fun, but not what I expected it to be."
  },
  {
    "rating": "0.5/5",
    "review": "Not enough suspense. Very disappointed in Nicole Kidman. She's such a classy lady. Did she need the money to do this film."
  },
  {
    "rating": "5/5",
    "review": "Baby, baby, when you touch me like… a dog? This movie was paws down amazing. Every scene left us begging like a dog for more. The chemistry, the romance, the excitement. You could cut the tension between the protagonists with a knife. If you’ve seen movies like alien, the wolf of Wall Street, alien 2, the great gatsby, alien 3, or titanic this movie will have you thinking those movies were made for a middle school English class. Please do not miss this. Do yourself a favor and see it. Honestly, see it twice. No, seriously, see it 3 times. You will not be disappointed. No really though this movie lowkey sucked. It wasn’t inherently bad but it wasn’t good. If you’re in need of something to see on a $5 Tuesday this might be acceptable. Otherwise, maybe stay home."
  },
  {
    "rating": "5/5",
    "review": "This was, with out a doubt, the greatest movie I've ever seen and probably will see in my lifetime! 11/10 would recommend!!! I've seen a lot of movies in my life and this one takes the cake! This was better than The Wolf of Wall Street, Titanic, The Great Gatsby, Alien, Alien 2, Alien 3, really any Alien movie or spin-off. If you liked Dradpool 3 than this movie is for you! Make sure to take all your homies to this action packed THRILLER take on the best idea Hollywood has ever put to screen. The best performance Nicole and Antonio ever did. Truly ahead of it's time!"
  },
  {
    "rating": "1/5",
    "review": "Dont waist your time, moneyalthough the popcorn was great"
  },
  {
    "rating": "2.5/5",
    "review": "O início parece uma fanfic sem criatividade. Enquanto o filme era puramente fetichista e sem propósito, achei bem chato, mas quando aprofundam sobre repressão sexual, desejo e responsabilidade socioafetiva, fica mais interessante. A personagem da Nicole Kidman é boa porque da pra entender as confusões que ela sente e o que ela quer. Já o personagem do Harris Dickinson é confuso e, por vezes, sem sentido."
  },
  {
    "rating": "3.5/5",
    "review": "Definitely worth a watch. Classic A24 style movie with the added bonus of Nicole Kidman."
  },
  {
    "rating": "0.5/5",
    "review": "Yet another movie that only the usual degen critics with a degradation kink (as if everybody wasn't already rejecting feminism and equality) will overrate"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. A real look into the"
  },
  {
    "rating": "3/5",
    "review": "An engaging watch but a bit of a chaotic missing some key groundwork and explanation of character motivations and backstory"
  },
  {
    "rating": "2/5",
    "review": "I have no idea what the point of this film was - was it to show that women can be just as power-hungry and selfish as men? Nicole looks great the guy is a strange looking kid who reminds me of Niedermeir from Animal House"
  },
  {
    "rating": "1.5/5",
    "review": "Boring and predictable."
  },
  {
    "rating": "0.5/5",
    "review": "Absolute waste of time movie! Nicole Kidman is an amazing, but the writing is amateur and the directing is disjointed. There is a total disconnect with the characters to the point there is zero chemistry and therefore as an audience member, I don't care about anyone. The entire audience I sat with laughed at parts that were not intended to be funny and we all felt tortured by this poorly put together film that leaves you with nothing but relief when it's over in the end. I'll take \"Unfaithful\" any day!"
  },
  {
    "rating": "0.5/5",
    "review": "I did not see the point of the movie. There was no real plot. What ? A woman in power has an affair with a younger man? Big deal. Other than that what was the point? I did not like it at all. I am disappointed to say the least."
  },
  {
    "rating": "0.5/5",
    "review": "This movie was terribly degrading to women, comparing them to dogs. It was also degrading to men senior men. It paints the 20 year old guy as the alpha that controls everyone and the hero of the movie. It also has no originality, stealing from Fatal Attraction, Disclosure, and many others! I expect more from A24, and this one never deliered. Save your time and your money. This is overrated by the critics."
  },
  {
    "rating": "5/5",
    "review": "Fantastic cast, clever, and ultimately very… optimistic."
  },
  {
    "rating": "0.5/5",
    "review": "Horrible. Dark. Immoral content gets old."
  },
  {
    "rating": "2.5/5",
    "review": "It certainly gives you a lot to discuss afterwards. Its uncomfortable all the way through, but is intentionally so."
  },
  {
    "rating": "3/5",
    "review": "Definitely a psychological/sensual script. Acting was good."
  },
  {
    "rating": "0.5/5",
    "review": "Cheap knock off of 50 Shades and Norman Bate's Motel. Deeply disappointed"
  },
  {
    "rating": "1/5",
    "review": "Pornographic and gross. Im very disappointed that Nicole would take a part like this. I dont believe her character was a high powered CEO of a high tech company. Very weak."
  },
  {
    "rating": "2/5",
    "review": "Babygirl is more like gurl bye"
  },
  {
    "rating": "0.5/5",
    "review": "The story and the timeline are on a kindergarten level."
  },
  {
    "rating": "0.5/5",
    "review": "Beyond idiotic. Nicole Kidman had no need to do this film, and it was a huge waste of her talent. I’m astonished at the acclaim the film is getting."
  },
  {
    "rating": "5/5",
    "review": "The audience are rating this movie bad when this movie is like one the best movies like I'm assuming they don't get the love like they do in this movie so they taking it out on the movie and rating it bad maybe find better lovers!!! The Movie and Acting is SUPERB!!!"
  },
  {
    "rating": "2/5",
    "review": "Not as advertised, kinda weird. Seemed like it didn't know which direction to go. Kinda pieces together."
  },
  {
    "rating": "5/5",
    "review": "I can’t believe people didn’t enjoy this. This movie was everything it promises to be! Steamy, sexy and speaks to a woman’s fear to ask for her desires to be met and ability to put everyone else’s needs above her own. It’s also not even that kinky just dipping the toe in the kink pond a bit. Very well done!"
  },
  {
    "rating": "0.5/5",
    "review": "Horrible movie should never had been made. Pornographic and very degrading for someone like Nicole Kidman. Would never recommend this type of move to anyone."
  },
  {
    "rating": "4/5",
    "review": "I understand what they were trying to say with this movie, but they need more help saying it."
  },
  {
    "rating": "1.5/5",
    "review": "Typical infidelity story"
  },
  {
    "rating": "4/5",
    "review": "Hot! Lots of power play keeping us on our toes"
  },
  {
    "rating": "5/5",
    "review": "Very Good movie. deep, clean, truth art of life . Best actors play .,"
  },
  {
    "rating": "1.5/5",
    "review": "Despite reading numerous positive reviews, the film was disappointing for the most part: The characters’ internal and psychological reasoning and grounding was paper thin. Backstories and personal drives were sprinkled so sparsely throughout the story that it seemed like cheap skating, narratively speaking. And while characters were lacking in grounded and relatable personality traits and psychology, neither did they seem to transform or develop in any meaningful way. Harry Dickinson’s role was without any meaningful depth, his moods and actions inexplicably change without connecting to any deeper layers of the character, and it ends up simply being annoying. The same is nearly true for Nicole Kidman’s Romy, however we learn that her reasoning behind jeopardising her family and career boils down to her not being able to org**m with her husband of 19 years… and without spoiling too much; let’s say the film had a happy, although idle and insubstantial, ending. The stars given is to the sound design, the short moments of funny awkwardness, and Antonio Banderas’ irresistibly charming accent and good acting."
  },
  {
    "rating": "3/5",
    "review": "When the Babygirl trailer dropped, I felt like this was a story about a middle aged woman navigating being in a position of power in her profession and exploring the complex layers of being in power/control in some aspects of your life as a woman while not fully feeling empowered in other aspects of your life and how those coexist…namely your sexuality. In a way, Babygirl did that but fell flat a bit. Though Nicole Kidman and Harris Dickinson have chemistry, the characters were not fleshed out enough for that to be transmitted to the viewer. Very little background is given to Dickinson’s character of Samuel. While Babygirl doesn’t center Samuel, it would’ve been great to have more of a story to understand his motivations in relation to Romy (Kidman) and her journey. Because of how little the character is fleshed out, he just seems to pop in and out. The ending of the film could’ve felt complete if Samuel’s point of view could’ve at least been hinted at. The film needed to show the audience more of Romy’s journey in finding her sexuality after being married for so long so it didn’t fall flat and came across as just a movie about an affair with a power imbalance and really given us this intense erotic thriller about exploring your sexuality and pleasure later in life and the need to engage with someone new out of fear of judgement. Soundtrack and Song are A+!"
  },
  {
    "rating": "1/5",
    "review": "I would rate it ZERO if I could. Choppy filming, choppy acting. I felt embarrassed for Nicole Kidman that she even made this movie. Weird relationships. Demeaning behaviors. We walked out of it."
  },
  {
    "rating": "4/5",
    "review": "Envolvente, Amei a trilha sonora, uma descoberta sedutora!"
  },
  {
    "rating": "2/5",
    "review": "'Babygirl' is s'x and bugger all else. It features two of the more freaky characters in cinematic history, they both kinda creeped me out I'm not going to lie - I will never look at a tie in the same way again, or a glass of milk for that matter. Kudos for creativity, I guess! Nicole Kidman and Harris Dickinson do commit to their respective roles, some of the noises coming out of the former were quite something to witness. In fairness, if this is what they were going for then both actors do a fine job. Antonio Banderas is at least there to add sort of normality. Impressively, aside from a few bits, there isn't much nudity in this, how you show so much without showing barely anything is actually quite the thing. I'm not against seeing films of an erotic nature, I just personally need a bit more substance attached to it. I'm fascinated to see the reception this got, I've no idea."
  },
  {
    "rating": "1/5",
    "review": "Ridiculous. Story line? Not one. Erotica? Lame. It was terrible."
  },
  {
    "rating": "5/5",
    "review": "Intelligent, stylish, sexy, vulnerable, thought provoking - ultimately the most real & mesmerising film I have seen in cinema. Lead actors, Kidman & Harrison both deserve an Oscar - well played!! WATCH IT!! LOVED!! Huge respect to the Director @halinareijn ❤️"
  },
  {
    "rating": "3/5",
    "review": "A lot of sex no plot lol but music was ok and the cinematography was good"
  },
  {
    "rating": "0.5/5",
    "review": "This is the worst movie I’ve ever seen. There is not a good storyline and it is definitely not sexy in any kind of way. I can’t believe I wasted two hours of my time and money to see this in the theater."
  },
  {
    "rating": "5/5",
    "review": "I loved it. Not just a sexy movie or about power dynamics or generational differences. Also about how different human beings can be of service to each other."
  },
  {
    "rating": "4.5/5",
    "review": "What a good movie. Even though the beginning of the story is predictable and kind of forced, the movie is so enjoyable in a weird way. Even when there's discomfort in some scenes, the movie delivers humor. The actors are really good. Dickinson really managed to give off the vibe <<I know how to read people>> and it was really interesting. Highly reccomend it but I don't think it's for everyone!"
  },
  {
    "rating": "1/5",
    "review": "This movie was horrible. Period"
  },
  {
    "rating": "5/5",
    "review": "I was thoroughly engaged in the film steamy, thrilling, and well written. The messages and themes it touched on were pretty striking given my own experiences, so I enjoyed myself! Not for everyone for sure, but well worth my time."
  },
  {
    "rating": "3/5",
    "review": "This film had so much potential- an older woman’s sexuality and kinks being such an interesting and uncharted topic to explore But the carry through just wasn’t there. I don’t know if it was the dialogue (the acting was excellent), but a lot of it just seemed so silly and cheesy. I was expecting a dark erotic film but instead it felt like a Hallmark movie gone slightly racy. The best scene by far was the rave, when I was finally able to lose myself in the moment as an audience member."
  },
  {
    "rating": "1/5",
    "review": "What a waste of time and money. Note to self: do not watch anything with Nicole Kidman. She has really gotten weird to look at."
  },
  {
    "rating": "0.5/5",
    "review": "The worst movie I’ve seen in a while"
  },
  {
    "rating": "2/5",
    "review": "Not sure what it was all about."
  },
  {
    "rating": "5/5",
    "review": "loved it! Yes, there was kinky sex but the movie piercingly funny. Nicole Kidman hot as hell 😍"
  },
  {
    "rating": "5/5",
    "review": "Enjoyed a more mature movie discussing womens sexuality"
  },
  {
    "rating": "2.5/5",
    "review": "I did not like the drama is not well elaborated, and there are many shadows. The ending is banal all use power to secure a career. All in all, Nicole Kidman performs very well."
  },
  {
    "rating": "1/5",
    "review": "I was so looking forward to this. Was expecting so much more. It just didn't work on my level for me. It's neither an erotica thriller or anything more meaningful. I just did not care about any characters. Was never convinced about any of it So disappointing. Dull as dishwater. Was meant it to be gripping??....erotic?"
  },
  {
    "rating": "1.5/5",
    "review": "Utterly predictable 'Nicole Kidman looking in a mirror and admiring her 50-something gym-toned body' movie. Fairly boring and tbh looking already a bit dated. There's a Basic Instinct-esque club scene in the middle. And because you know it's a women's freedom movie going in, you know nothing bad will happen to any woman! They will only discover truths and be ever more sexually liberated! I wish these 'all women are saints' movies could be INTERESTING and unpredictable sometimes!"
  },
  {
    "rating": "0.5/5",
    "review": "This movie reminded me of so many movies on this subject. there is nothing new."
  },
  {
    "rating": "4/5",
    "review": "Loved this intense erotic drama with a kinky twist. It shows you there is a lot more going on in peoples minds then what they let you see."
  },
  {
    "rating": "0.5/5",
    "review": "Pathetic waste of time and money!"
  },
  {
    "rating": "0.5/5",
    "review": "Disturbing pathetic and sad"
  },
  {
    "rating": "1/5",
    "review": "Fortunately, I waited to write a review because I see how poorly the movie has done. Did the creators really think a movie about unconventional BDSM was going to succeed? Especially when it’s done to the detriment of the dignity of women. I’m assuming I should feel bad for the actors and actresses involved because it’s my impression they often don’t know what their contractual obligations have gotten them into until it’s too late!"
  },
  {
    "rating": "2.5/5",
    "review": "Very strange. Too much crazy sex and not much of a plot. However, Nicole and Javier were good."
  },
  {
    "rating": "3/5",
    "review": "Personally I thought that Nicole was going to turn things around differently. I don't want to give up anything about the movie. I watched this one myself so I didn't have anyone to discuss the ending with. I think I got the plot ending but would like some feedback."
  },
  {
    "rating": "5/5",
    "review": "A must see . This movie was nominated for the Golden Lion in Venice . Harris Dickinson deserves an Oscar, Intense yet slow, with was brilliant .I was getting anxiety but could not move my eyes from the screen. Very sexual , Playful Bondage and S and M ... It is an old Narrative about extremely powerful people that love to be submissive and dominated . Nicole Kidman gave a perfect acting worthy of an Oscar also . I can wait to see it again"
  },
  {
    "rating": "5/5",
    "review": "This movie is a paradigm shifter with some iconic scenes that will be remembered in film history. Halina Rein did an excellent job in capturing the fluctuating emotions of the main character and her inner conflict which reflects the pressures on women to excel in everything they do and fit a certain image. She chose very telling points in the narrative to put her main character in front of the camera, or at a public event, or inside her glass office. The film has many merits and raises important questions about women, age, power dynamics, sexuality and relationships in the workplace."
  },
  {
    "rating": "2/5",
    "review": "This movie is not it. It basically tells the story of a high powered CEO who decides to live out her sexual fantasies with an intern instead of her husband. We see a lot of those fantasies playing out in detail , which I found the main actors chemistry lacking making the scenes very awkward. It only just came to an end due to runtime and then no one faced any consequences. I am not really sure what the point of this movie is really. It was watchable, but very few redeeming qualities."
  },
  {
    "rating": "0.5/5",
    "review": "While I understand the message this film is trying to convey, I found it downright uncomfortable to watch. The constant degradation and humiliation of a partner isn’t a kink I share, and that made it hard to stomach. At times, I couldn't even keep my eyes on the screen, as the portrayal of toxic dynamics felt less like a compelling story and more like a cringeworthy exercise in emotional abuse. The film seemed to think that pushing boundaries meant making viewers feel repulsed, rather than challenging them in a meaningful way. I get that some people might find something to appreciate in the rawness of it all, but for me, it felt like nothing more than a sadistic spectacle. There’s no depth here, just discomfort masked as artistry"
  },
  {
    "rating": "0.5/5",
    "review": "Not what I was hoping for. The trailers came off like Eyes Wide Shut or Basic Instinct - a psychosexual thriller. There was no intrigue or even anything exciting. This felt like an attempt to be a slight spin on the 50 Shades series and even then wound up lacking. There was nothing hot or steamy about it and it just felt like a wasted $40"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Soundtrack fantastic and performances incredible! A movie that will stay with you which is rare nowadays in big distribution films."
  },
  {
    "rating": "4/5",
    "review": "I am a fool for any Kidman movie so I couldn’t miss this one. I think it’s essential for men to go to this with their wives because with all the sexual explicitness the story was really about. Men being sent enough to fulfill and understand their wife’s needs and the fact that Nicole Kidman feel free enough to do. This was quite a treat, and she certainly is a beautiful woman with or without her clothes on it. I think it’s a great show."
  },
  {
    "rating": "0.5/5",
    "review": "Disgusting storylines…. Morals and values are non existent… don’t taint your minds with this… such a shame because generally I love Nicole Kidman… can’t believe she took this role"
  },
  {
    "rating": "1/5",
    "review": "From start to finish, Babygirl is pure, unfiltered cringe. Antonio Banderas seems to be starring in an entirely different film, absorbed in a personal drama that nobody wanted or needed. Meanwhile, Nicole Kidman looks like she’s auditioning for relevance, clinging desperately to a script that does her no favors. The movie awkwardly attempts to make the tired ‘older woman-younger man’ trope feel edgy, but it only ends up radiating pure desperation—both in the plot and in Kidman’s performance. Her zero-fat body and overly worked injections can’t rescue this disaster, no matter how hard she tries to infuse nonexistent psychological depth. It’s a trainwreck that manages to be both boring and painfully embarrassing—cringe from beginning to bitter end."
  },
  {
    "rating": "5/5",
    "review": "Very hot movie but the happy end is nice! Liked it and recommend to watch who likes or want something spicy to see in the evening"
  },
  {
    "rating": "4.5/5",
    "review": "Loved this movie, Nicole Kidman in her prime milk licking days! Half star off for her wearing a silk bow tie top to a rave and for the absolute mockery that is pretending she didnt wanna sleep with Antonio Banderas."
  },
  {
    "rating": "0.5/5",
    "review": "I see a lot of movies and this is in top 10 of worst movies I've ever seen. It was just stupid"
  },
  {
    "rating": "3.5/5",
    "review": "interesting film style and good music but definitely a bit freaky in the sense there’s a lot of audio during sexual scenes and go on for a little long 😬😬 but overall not too bad"
  },
  {
    "rating": "5/5",
    "review": "This film was THRILLING! Watched it in theaters and the crowd was eating it up. I loved every twist and turn. The performances were perfect and the themes were resonant and thought provoking. Beautifully shot and directed as well."
  },
  {
    "rating": "0.5/5",
    "review": "Overrated and painful to watch. As a Kidman fan it was embarassing for me to watch her stumble through this role like a 56 year old trying to play a 45 year old. Her acting was like her body now, thanks to the nudie scene that was totally unrequired, artificially built up and too much Botox on the fault lines. The overhyped BDSM scenes were NOT what an amateur of the genre would call even close to BDSM. There is a powerplay, not only between the 2 lovers but also between Romy and her husband, but it has nothing to do with full fledged BDSM, more like a tussle between rivals. As such the 'Submission' scenes are just artefact, no grounding. It's a nother banal love affair between an older woman who gets obssessive over her younger lover. My time and money wasted. You can safely give this one a miss."
  },
  {
    "rating": "0.5/5",
    "review": "Was hoping for something along the lines of Sades of Gray…What a disappointment. Reading the Critic’s reviews one said it was funny! WTF? Nothing funny about this film. Boring…kept wondering how it would end, something dramatic or tense or exciting anything for God’s sake! Actually was uncomfortable watching and not in a good way. To save the next theater visitor, thinking about seeing this movie, here’s the spoiler. They all live happily ever after"
  },
  {
    "rating": "1.5/5",
    "review": "Strange movie, kinda dark...didn't care for it"
  },
  {
    "rating": "1/5",
    "review": "A wreck of a film about a woman's mid life crisis. Dull and utterly uninspired I was expecting at least some camp like other thrillers of a similar nature but sadly no. Also for those who have light sensitivity be warned, there is a prolonged scene with flashing rave lights."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible movie, no plot. Just kept getting worse"
  },
  {
    "rating": "1/5",
    "review": "One of the most boring movies I have ever seen. Pointless storyline and message, unconvincing acting, no tension despite the several sexual scenes (I almost felt asleep). Not recommended"
  },
  {
    "rating": "1.5/5",
    "review": "Three of us went to see this movie and all three of us hated it. We weren't shocked by the sex and there was no plot to speak of. I have no idea why it's described as a thriller since there is no particular mystery or intrigue. Both of the main characters acted in ways that were wildly inconsistent and not credible. It had some entertaining moments and decent acting but definitely would not recommend."
  },
  {
    "rating": "2/5",
    "review": "Can't really say there was anything intriguing to me about the performances, plot, or characters. I wouldn't even call it exceptionally steamy between the leads."
  },
  {
    "rating": "4.5/5",
    "review": "Nicole Kidman is always at her best when she lets her freak flag fly."
  },
  {
    "rating": "1/5",
    "review": "Very uncomfortable sexual content. Not much of a plot or story line either."
  },
  {
    "rating": "1.5/5",
    "review": "It seems like a joke… unless you've seen 9 1/2, of course."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies Ive ever seen"
  },
  {
    "rating": "0.5/5",
    "review": "Did not like it period didnt know it was all about sexual satisfaction! Sick!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Hands down one of the worst movies I’ve seen in awhile. Storyline was hardly a storyline. Weird moaning and grunting. Awful sexual scenes. Uncomfortable arguments. Awkward pauses that made the whole crowd laugh because how bad it was. If you enjoy being uncomfortable and having weird kinks, this might be your movie. Don’t recommend"
  },
  {
    "rating": "1/5",
    "review": "One of Nicole Kidman’s most boring movies. Redundant role of her nymphomaniac escapades, pointless plotless storyline. Wait for streaming if you must see it."
  },
  {
    "rating": "0.5/5",
    "review": "Me and my friends left after 30 minutes was boring with no storyline.. really a waste of time and money. I wont recommend it."
  },
  {
    "rating": "2.5/5",
    "review": "Had potential but wasn't my favorite. How the relationship starred seemed unrealistic. How the dynamic started seemed unrealistic. The potential of the power dynamic is what kept me intrigued but it just didn't get to where I wanted it to be"
  },
  {
    "rating": "1/5",
    "review": "This is a very annoying premise played out by an actor with far too much plastic surgery and a monotone boy-man. Hard pass."
  },
  {
    "rating": "5/5",
    "review": "BEST FREAKING MOVIE OF ALL TIME HOLY CRAPPPPP This movie had my jaw to the floor the whole time not once was I not on the edge of my seat wondering whats going to happen next like holy crap this movie was so gooooood I want to watch it again. IM WAITINF FOR THE SECOND MOVIE THIS WAS TO GOOD and so sad like come on I feel bad for the husband but my boy (the young one) deserves a good ending like they did my boy DIRTY im his 1 fan"
  },
  {
    "rating": "5/5",
    "review": "I loved this movie. I just wish they showed more full scenes instead of clips if you know what I mean"
  },
  {
    "rating": "1/5",
    "review": "Not at all what Im used to see of Nicole. Wasted my money!"
  },
  {
    "rating": "0.5/5",
    "review": "This was probably the worst movie I have ever seen. They tried to start 10 different plots and didn't finish any of them. Even the sex scenes weren't good. This movie was totally kink-shaming, not even trying to make it serious or hot. They couldn't even commit to the dominance bit, as it was inconsistent and awkward. The actor for the intern was so bad and unrealistic. Not to mention, the one time they tried to address consent, they totally missed the mark and it ended up being coercion. 0/10 don't reccomend."
  },
  {
    "rating": "3/5",
    "review": "The trailers sell a different expectation. Nicole Kidmans character saved the movie. To no Harris Dickinsons fault, his character lacked seduction, rapport, intimacy. Im not sure it was intentional, but reality would have a man hungry at the opportunity to explore Kidmans characters impish desires more lusciously. At times it seemed as if Harris character was erotically autistic."
  },
  {
    "rating": "1/5",
    "review": "Sorry not my cup of tea. It shows females in a bad light."
  },
  {
    "rating": "1/5",
    "review": "The scenario isn't really interesting and I didn't believe the story for a second."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst films I have seen recently. Sold as a film about female emancipation and domination, it results in a description of a bipolar and mentally unstable woman and man (we guess it in the first 10 minutes with the tie scene). The dialogues are meaningless, the script incoherent, the secondary characters very poorly written and apart from Nicole Kidman, the acting, especially Harris Dickison is insipid (yet striking in King's man). In short, an unhealthy film from which I wanted to get out several times (but the cinema ticket is expensive) and whose good reviews must have been bought very expensively."
  },
  {
    "rating": "0.5/5",
    "review": "An empty movie! In my opinion, Nicole Kidman’s performance was not surprising, while Harris Dickinson’s acting impressed me a lot! As for Antonio Banderas, honestly, his poor performance was evident throughout."
  },
  {
    "rating": "5/5",
    "review": "Exceptional acting. Challenging story that kept us engaged from beginning to end"
  },
  {
    "rating": "5/5",
    "review": "Overall excellent made and acted."
  },
  {
    "rating": "3/5",
    "review": "An interesting/ odd story line with adequate acting . Main plot began well, but midway through , went off the rails. Intern character not well conceived. Nicole Kidman was not at her best. Antonio Banderass acting was decent, but his role was minor."
  },
  {
    "rating": "3/5",
    "review": "Í Believe Me the Greiner Carter How Wever The Toe line and Green sexy CE was not Make of ti south Speak"
  },
  {
    "rating": "1/5",
    "review": "For the first time in my life I walked out of a theater before the movie finished. Waste of my money and time. Just terrible."
  },
  {
    "rating": "0.5/5",
    "review": "*Babygirl* (2024), directed by Halina Reijn, attempts to position itself as a provocative erotic thriller but ultimately stumbles in its portrayal of BDSM dynamics, misrepresenting the very foundation of what makes such relationships work. While Nicole Kidman’s performance as Romy Mathis carries the film with elegance and intensity, the movie falls apart in its exploration of power, trust, and intimacy, instead leaning into harmful stereotypes that feel both shallow and irresponsible. At the core of the story is the relationship between Romy and Samuel (Harris Dickinson), which is framed as an exploration of dominance and submission but fails to capture the essential principles of the BDSM community—trust, communication, and consent. Samuel is portrayed as the embodiment of a \"bad Dom,\" using manipulation and exploitation instead of fostering a consensual and respectful power dynamic. Meanwhile, Romy is cast as submissive, but her character never actually aligns with what being a willing and active participant in such a dynamic entails. Instead, her actions and reactions feel forced, as though the script misunderstands submission as passivity or victimhood. What’s most frustrating is the film’s insistence on framing these interactions as seductive or empowering, while the reality feels exploitative and devoid of the care that should define such relationships. In this way, *Babygirl* not only mishandles BDSM but sensationalizes it in a way that feels outdated and, frankly, lazy. It’s particularly damning when the film makes *Fifty Shades of Grey*—often critiqued for its own shortcomings—look like a more authentic representation in comparison. While Kidman delivers a layered and emotionally charged performance, it’s not enough to salvage a story that fundamentally misunderstands the very subject matter it claims to explore. For those familiar with or part of the BDSM community, *Babygirl* is likely to come across as reductive and tone-deaf, reducing a complex and consensual lifestyle to a series of tired clichés. Ultimately, the film is a missed opportunity—its glossy exterior masks a hollow and uninformed core."
  },
  {
    "rating": "0.5/5",
    "review": "Just weird, no real storyline or plot."
  },
  {
    "rating": "1/5",
    "review": "Disgusting, walked ouy in the middle!!!!!!!!!!"
  },
  {
    "rating": "1.5/5",
    "review": "Cringy 🥴 I was very dissatisfied."
  },
  {
    "rating": "1.5/5",
    "review": "Couldn’t even make it to the end. This was just not it. Could not tell you a single name of one of the characters. Just sex driven and zero story line. Glamorized cheating, nothing special. Hollywood struggles making anything interesting without extreme nudity. Could hear scoffs throughout the theatre during cringey scenes."
  },
  {
    "rating": "1.5/5",
    "review": "Boring film with very little discernible plot. Zero chemistry between any of the leads, little lead up to the affair, and it feels jolted when it starts. There are better films about female sexuality that can make a statement without the weirdness that exists in this film."
  },
  {
    "rating": "1/5",
    "review": "Very shallow story. Like a modern day fatal attraction."
  },
  {
    "rating": "1.5/5",
    "review": "its just borring, story plot used hundred times: bored wife stumble upon some guy at the work and has had quick affair then returns to her husband. moreover, Nicole is gently said, too old for such role."
  },
  {
    "rating": "0.5/5",
    "review": "This was absolutely cringe. Like others have said, NO plot…no chemistry in my opinion. Great actors, but just not the right cast. Loved the soundtrack and cinematography was good…..but just so cringe with no real story."
  },
  {
    "rating": "3.5/5",
    "review": "It showed me that women should not be afraid to ask for what satisfies them in the bedroom."
  },
  {
    "rating": "0.5/5",
    "review": "Really poor, terrible plot that hardly goes anywhere, characters have no redeeming qualities. Not really sure what the film was trying to achieve."
  },
  {
    "rating": "0.5/5",
    "review": "Love the idea of exploring the story of a middle aged woman finally discovering and owning her sexuality and needs but felt it was done in a cheap way through this film. Why glamorize/perpetuate this cliché idea of wildly inappropriate workplace behavior in order to show her journey? There are so many other possibilities for a better story but they went for the gross cliché. A lot of the movie seemed so contrived and unnatural and I’m honestly impressed by what the actors were able to extract out of such a pitiful script/story. Her hero’s journey was underwhelming at best with various unexplained discrepancies throughout the storyline that made it unconvincing. Seems like the story was trying too hard to be risqué for no reason and none of it really hit the spot——there was no added value to the plot/character development and none of it even felt sexy since it felt forced. Honestly, very 50 shades of gray/twilight vibes in terms of intellectual/emotional depth, or lack thereof. So disappointed since I was excited about the cast who have all proved their capacity for digging deep into their characters in other films. And what a shame and waste to have Banderas on call but give him such a poorly developed character…that felt wrong. And what was with the camera person shooting everything at such a shallow depth of field and missing the mark on so many scenes? The very least I’d expect from a professional film is for the technical stuff to be on point. This movie took 2 hours to barely scratch the surface of any of the many topics it tried to incorporate, a huge fail for me——unfocused, shallow, poor utilization of acting talent, silly technical mistakes, misses the mark on trying to empower women because it tried to do it in a lame way."
  },
  {
    "rating": "1/5",
    "review": "As we are very open minded and loved the cast this movie was actually terrible. Choppy script and failed to arouse an inch of my body. Very disappointed"
  },
  {
    "rating": "1/5",
    "review": "I sat through saltburn and poor things and those weren't nearly as weird as this movie. left half way through."
  },
  {
    "rating": "0.5/5",
    "review": "What the hell was this - the plot doesn't make any sense. It was so bad, laughable at points because it was so bad. Dominance wasn't even dominant, it was embarrassing."
  },
  {
    "rating": "0.5/5",
    "review": "I don't know what to think of this movie. I just feel like this young kid feels like he can degrade a powerful woman. And is so embarrassing to see Nicole in this role... ugh"
  },
  {
    "rating": "5/5",
    "review": "A brilliantly written and acted psychosexual odyssey through what looks like a mid-life crisis with a mind of its own. Enjoyed the cinematography, the sound, and each and every performance. Bravo."
  },
  {
    "rating": "1/5",
    "review": "No plot, was just cheating and sex and then it ended."
  },
  {
    "rating": "5/5",
    "review": "I truly enjoyed this movie! I believe that it was one right for its time! I cant wait to watch it at home!"
  },
  {
    "rating": "4/5",
    "review": "The acting and thrill factor is superb. The premise and the onscreen chemistry of Kidman and Dickson is a treat and holds the film together, making the premise more satisfying and scintillating than it really is today in modern life."
  },
  {
    "rating": "0.5/5",
    "review": "Good acting, but can’t say the same about the movie."
  },
  {
    "rating": "4/5",
    "review": "I didnt care for the ending as much, but still liked the movie overall."
  },
  {
    "rating": "1/5",
    "review": "Worst piece of junk I have ever seen."
  },
  {
    "rating": "2.5/5",
    "review": "meh. was not bad but not good. sort of like when you use a microwave and then you have a hot bowl of cold food. know what i mean?"
  },
  {
    "rating": "1/5",
    "review": "I thought it was as vulgar and way beneath the talent of Nicole Kidman."
  },
  {
    "rating": "0.5/5",
    "review": "A definite waste of my time.. This isn’t even good porn."
  },
  {
    "rating": "1/5",
    "review": "Was trying to give it no stars, but it wouldnt allow me to. Absolutely horrible, slightly embarrassed for Nicole Kidman for taking this role and slightly embarrassing for sitting there watching this We need to get better movies in the theaters so people will continue to go! Between this and the last showgirl. Im done with the movie for a while. Sad because I actually enjoy going to the movies and its a very expensive outing nowadays.!"
  },
  {
    "rating": "1.5/5",
    "review": "5 words Writer's thinly disguised milf fetish"
  },
  {
    "rating": "5/5",
    "review": "I’ve never seen anything like it. Nicole Kidman gives another awe inspiring performance"
  },
  {
    "rating": "1/5",
    "review": "Sorry Didn't like at all. Jumped around randomly, just awful"
  },
  {
    "rating": "0.5/5",
    "review": "Truly putrid. Thought it was a comedy at some point as my wife & I literally LOLd at some of the scenes"
  },
  {
    "rating": "3.5/5",
    "review": "Good flick to watch Nicole Kidman still lookin'"
  },
  {
    "rating": "5/5",
    "review": "Great film, well made, phenomenal performances"
  },
  {
    "rating": "1/5",
    "review": "Acting was very good, but the story line was too weak. Too much time on sex and it no ugh on plot."
  },
  {
    "rating": "2.5/5",
    "review": "Not as much action as previews showed. Ending was bad."
  },
  {
    "rating": "4/5",
    "review": "Sexy. Dark. Great cast. Kidman was excellent."
  },
  {
    "rating": "0.5/5",
    "review": "Couldn't wait for it to end. Movie was a wannabe something but fell far far far short. The dominant male characterization did not match a dominant personality. Nicole kidman's character was weird but not really in an interesting way. Really??? This woman made it to the top of a huge corporation? Not likely. Everything came off as somewhat unrealistic, which isn't all that unusual for a Hollywood film but it was boring unrealistic. I found the movie boring, boring, boring and almost fell asleep several times. The movie and theme had potential. This could have been a great thriller. A better lead male for one. Characterized the lead female as more of a realistic corporate lead. Better more interesting engaging scenes. Rates in the top 10 as one of the worst movies I have ever seen."
  },
  {
    "rating": "5/5",
    "review": "This film was very engaging. The acting was top notch all around. The script was taut. The scenes were get out: Erotic, sly, coy, humorous — many felt so real like you were in it, just like real life. In fact many scenes had me on the edge of my seat. Such good portrayals of regular people just being their kinky selves. I actually wanted more. They should have made it three hours long. Nicole Kidman is so beautiful. Go see this before it leaves the theater!"
  },
  {
    "rating": "1.5/5",
    "review": "Not a good movie in any way. No better than 50 shades of gray. Do not waste the time or money."
  },
  {
    "rating": "2.5/5",
    "review": "I thought the topic was interesting, but the script could have been stronger. Harris Dickinson as the intern didn’t quite work for me—I didn’t think he had enough charisma to make her sacrifices feel believable. Overall, it’s a thumb sideways from me."
  },
  {
    "rating": "1/5",
    "review": "basically a movie full of sex, no plot whatsoever."
  },
  {
    "rating": "4/5",
    "review": "It's a pretty good erotic film. It's about needs and control. Ended well."
  },
  {
    "rating": "5/5",
    "review": "I love this movie!!! They are so sexy"
  },
  {
    "rating": "5/5",
    "review": "Was an… arousing experience, to say the least."
  },
  {
    "rating": "1/5",
    "review": "Very dull through the whole movie, she should have been honest and more firm with her husband to show him what she wanted."
  },
  {
    "rating": "4/5",
    "review": "Super sexy well done the only thing I didnt like was the lack of information at the end.. was it a set up?"
  },
  {
    "rating": "0.5/5",
    "review": "Horrible plot, it was more soft porn than anything!"
  },
  {
    "rating": "2/5",
    "review": "Halina Reijn is not Michael Haneke. \"Babygirl\" is not \"The Piano Teacher\". Most ridiculous movie this year"
  },
  {
    "rating": "5/5",
    "review": "Here’s the deal—if you’re so stupid that you went to this movie without realizing it was going to have a lot of sexuality to it, your opinion should be automatically discounted. And the amount of people on here saying it was too much like a porno is mind blowing—idk what kind of porn you watch (probably none) but the majority of this movie the character’s sexual interactions occur with their clothes on. What you are picking up on is sexual tension, and because our culture is so repressed, it’s making you uncomfortable. Which is good—it made me uncomfortable too! It’s good for us to be challenged and made to feel things by the films we watch, and that’s also a testament to the director and the actors and the crew. So to get on with my actual review, the acting was incredible, the score was incredible, the dynamics between the characters were incredible, and I loved the climactic scene too. The direction was amazing—much like the central character, as the film is getting going I as an audience member was also hesitant. Things felt stiff and I wondered if the director knew what she was doing and was going to be able carry it off—parts made me doubt she would. Then, paralleling Kidman’s character jumping into things, as one scene after another played, I not only realized that she (the director) WOULD carry it off, but that she was doing it phenomenally. Also shout-out to an incredibly real-feeling rave scene."
  },
  {
    "rating": "4/5",
    "review": "Very interesting movie and confusing at the same time."
  },
  {
    "rating": "0.5/5",
    "review": "Awkward and cringe no thanks."
  },
  {
    "rating": "2.5/5",
    "review": "If one thing Babygirl reveals is the fantastic marketing effort supporting Nicole Kidman. Perhaps one good friend should recommend her not to portrait characters that turn into a self-inflicted joke, not potent dramatic vehicles to display her undeniable force as actress."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is draggy and about a psychopath blackmailing a CEO.. They have to be politically correct instead of writing a great scrip. Every scene shows a Christmas tree. When Christmas is long over. Horrible movie. Save money and time. If you want an Excellent Erotica movie watch 9.5 weeks. Waste of money and time."
  },
  {
    "rating": "0.5/5",
    "review": "I wish there was an option for zero stars. I’d like the time I wasted on this movie back. It was a cringe fest. I’d be embarrassed if I was Nicole Kidman. I’d be more embarrassed if I was Keith Urban."
  },
  {
    "rating": "4/5",
    "review": "Provoked a great discussion for hours about womens desires, the male gaze, what little men know about female sensibilities, sexuality, and sensuality. It also prompted thoughts and discussions about how are men to know these things. A tightly wound Nicole Kidman, an understated Antonio Banderas, and an excellent newcomer created a high-wire movie."
  },
  {
    "rating": "2/5",
    "review": "Didn't buy into any of the characters."
  },
  {
    "rating": "0.5/5",
    "review": "Not good at all. Should have been told more like a porn movie"
  },
  {
    "rating": "4/5",
    "review": "A strange movie that works. Keeps you on your toes. Enjoyed it."
  },
  {
    "rating": "4/5",
    "review": "It was a great movie but hard to watch because it's uncomfortable to watch someone spiral and self-destruct but certainly powerful."
  },
  {
    "rating": "5/5",
    "review": "Put some respect in Nicole Kidman’s name. This movie feels like the sequel to “Eyes Wide Shut”."
  },
  {
    "rating": "0.5/5",
    "review": "Erm one word, VANILLA! Me and the hubby have been doing this for years… don’t see what Nicole was so excited about. Her body was lowkey tea tho"
  },
  {
    "rating": "3/5",
    "review": "the social message is excellent the plausibility and dialogue were brutal and forced as if the writer was a 20 year old with no corporate experience with how the workplace works this is not soft porn, actually has a interesting way of healing from infidelity"
  },
  {
    "rating": "2/5",
    "review": "Uncompelling story, but wel acted. For me this movie is overhyped. It doesn't do a good job communicating the message it is trying to tell."
  },
  {
    "rating": "4/5",
    "review": "Honestly it was pretty good. Not her best movie she's ever done but still not a bad movie by any means. Even with all the sex stuff.. you can tell that it was directed by a woman. Nicole definitely stepped outside of her comfort zone but was still in control and not totally degraded in those scenes. I think the chemistry between all the actors was good. I think Harris was a good choice to play along side her and in that context. Not too rough but not too soft. All in all it's probably one of the final chances Nicole will be getting to play a role in this category and I think she did a great job and she looked absolutly amazing!"
  },
  {
    "rating": "5/5",
    "review": "the actors were excellent and Nicole went outside her normal character the entire story leaves you wondering what will happen next"
  },
  {
    "rating": "1/5",
    "review": "Was horrible, there was no plot to it."
  },
  {
    "rating": "4/5",
    "review": "I thought it was good. If anything a bit tender. You're watching two people fumble through discovering their sexuality. I thought it did a good job of showing that desire mixed with the awkwardness of exploration. It's funny to see that some people had such a visceral reaction to it. I think that tells you something ;)"
  },
  {
    "rating": "4/5",
    "review": "Amazing acting and story, loved every second of this erotic desiring script."
  },
  {
    "rating": "0.5/5",
    "review": "Shocking and disappointing! The acting was good, the story was bad, and the 'kink' was even worse! Whoever wrote this needs to do more research! It could have been amazing, but it was cringy at best, consent by blackmail, although I can guarantee it happens in real life. It's a big no on the kink scene. Safe word after he's already laid a hand on her another big no! And you made the switch act creepy!"
  },
  {
    "rating": "2/5",
    "review": "Nicole Kidman stars as a powerful CEO of robotic package selector company who is bored with sex with husband Antonio Banderas. Soon Kidman meets handsome intern Harris Dickenson who gives her what she really wants - to be ordered around in mildly masochistic ways. I cannot recommend this film as it is episodic with no real plot and Dickenson's motivations are unclear. The dialog is stilted and unrealistic and direction is middling. Sadly, a 5/10 for me."
  },
  {
    "rating": "3/5",
    "review": "Uneven film about a sexual dalliance & exploring power relationships. The main problem I have is if the younger man IS (to be) in control, he doesn't ask Nicole Kidman's character whether he is in control"
  },
  {
    "rating": "1/5",
    "review": "If I could give this movie a negative rating, I would. It was horrible. I am very disappointed to see that Nicole Kidman would agree to take the role. Although her acting was excellent, the storyline was ridiculous. It felt like it was directed toward a simple-minded adolescent child. I took my mother to see it and was embarrassed to watch it. I am not adverse to watching explicit content if it has a part in the story that enhances the plot. The sex WAS the plot."
  },
  {
    "rating": "2/5",
    "review": "boring and not entertaining Kidman is OK"
  },
  {
    "rating": "3/5",
    "review": "This was an unbelievable scenario. The actors did a great job with what they were given to do."
  },
  {
    "rating": "5/5",
    "review": "Favourite of 2024. Raw acting, bold social commentary. Fun!"
  },
  {
    "rating": "4/5",
    "review": "For those who unfortunately didnt make it to the movie, heres my take on BabyGirl with Nicole Kidman, fore-mostly can we just say how amazing she looks wow (lots of nude scenes) given the nature of this psychologically charged sexual thriller, and how it demonstrates the feeble nature of monotonous monogamous sex with a lifetime partner, coupled the wrestling of power between human relations , because of this very outward expression however lacking in the protagonist and antaganist backgrounds I give it a 7 out of 10.... enjoy. (no chatgpt didnt write this)"
  },
  {
    "rating": "5/5",
    "review": "Brilliant script, casting, cinematography, sound design, the whole thing... masterful."
  }
]