[
  {
    "rating": "5/5",
    "review": "Absolutely an excellent movie, after watching Havoc I started Mobland. Tom Hardy is absolutely amazing"
  },
  {
    "rating": "3/5",
    "review": "Good action, good cinematography, good sound and music. Really really terrible story, plot and script. The whole thing is a stupid misunderstanding that could be cleared up at any moment with a single sentence, but for some reason nobody even attempts to say the words... The irrational behavours and unbelievable luck / misfortune of the different characters is jarring."
  },
  {
    "rating": "3/5",
    "review": "Bit of a load of bollocks, but good if you like guns with endless supplies of bullets and only the villains allowed to die."
  },
  {
    "rating": "5/5",
    "review": "Feels like a comic book come to life. The way Gareth Evans crafts action sequences is just mind blowing. The nightclub sequence was out of this world. This is a must watch for any action movie fan. Can't wait to see more of Gareth Evans."
  },
  {
    "rating": "1.5/5",
    "review": "Well now.....that was awful"
  },
  {
    "rating": "1/5",
    "review": "Waited for this movie such a disappointment really bad storyline always rushed and be storytelling but action was great"
  },
  {
    "rating": "3/5",
    "review": "“Havoc” invokes plenty of chaotic disorder and grit in Gareth Evans's action-packed, ballistic style, though its narrative couldn’t escape the carnage unscathed. Undoubtedly, the film delivered exactly what the poster and marketing suggested: a consistently entertaining and ultra-violent ride through the gritty, corruption-filled city. However, it can also be a bit too chaotic for its own good when its story and characters are set aside amidst the disorder. Tom Hardy and the rest of the cast were suitable enough to carry the movie's average screenplay and restrained themes through its duration. As for Gareth Evans, he again showed off his action filmmaking bravura with the film’s delightfully violent and tension-filled sequences, despite the murky CGI spoiling the authenticity. It may not be a sensational comeback for Gareth Evans regarding the genre, but its chaotic nature had enough moments to satisfy most of the genre’s fans seeking undemanding entertainment on Netflix."
  },
  {
    "rating": "1.5/5",
    "review": "Insane to think that Tom Hardy is in this movie. Everything, including the city looks like cgi. The logic the characters go at times by is mind blowing, they let cop killers free but Tom's character must pay for his deeds. The quality casting could not even save this movie. Do nit waste your time on this one"
  },
  {
    "rating": "2.5/5",
    "review": "I really like Tom Hardy, but damn was this movie done in AI or some cheap special effects and the casting people are like that's good enough. This movie is something like John Wick and Kill Bill smashed together. Love action movies but sad."
  },
  {
    "rating": "2.5/5",
    "review": "“Havoc” is a neo-noir film that feels like The Crow meets John Wick, anchored by strong performances from Tom Hardy, Forest Whitaker, and Luis Guzmán. Despite their efforts, they can’t fully salvage a muddled script. Two elements—its visual style and fight scenes that cater to the gaming crowd—merely decorate, rather than elevate, the film’s flawed foundation. A solid B film, rescued in parts by its cast but weighed down by its writing."
  },
  {
    "rating": "1/5",
    "review": "Blood and gore galore. I don't hate that, but there is nothing else redeeming. Massive plot holes. Ridiculous lapses in logic. Unlimited bullets. Apparently many main characters have magical healing power. Poor script. Ridiculous CGI-the vehicles look like a bad video game. Poor directing. There are times when the characters are watching the action with the audience instead of reacting. Main character armor. Cars that run after dozens and dozens of bullet holes. Rickety buildings can stop bullets now. Bad guys stare as they are about to be shot. The \"plot\" is built on a frustrating and obviously wrong premise. Some of the actors are just plain bad. Jessie Mei Li is an exception-she was fantastic. Quelling Sepulveda was so ridiculous as was the guy who played Tsui. The Head Triad lady was also bad and would NO ONE, not the police, not the Triads try to figure out what happened? NO! Nope! Just follow the frustrating McPlot."
  },
  {
    "rating": "3/5",
    "review": "Luis Guzman gained weight, but this darkly framed flick is a nocturnal treat for followers of the gun lobby, whether you're a fan or not."
  },
  {
    "rating": "4.5/5",
    "review": "A good watch. Action choreography is great. If you for a brutal action movie, go watch it."
  },
  {
    "rating": "0.5/5",
    "review": "I liked Tom Hardys' character but the movie was a bit painfull to watch. I found myself fast forwarding through many of the fight scenes. (most of the movie). Plenty of blood and guts and gore but no substance to the movie. the movie focused on the bloodshed and sacrificed a plot to do it."
  },
  {
    "rating": "1/5",
    "review": "Dreadful CGI graphics and ridiculous guns that carry more bullets than an F16...... big names, poor film..."
  },
  {
    "rating": "1.5/5",
    "review": "After watching Mobland series with Tom Hardy , Bronson and Helen Mirren was looking forward to Havoc but bitterly disappointed, every aspect over the top , turned it off 20 minutes in ."
  },
  {
    "rating": "2.5/5",
    "review": "Part video game, part John Wick (impossible killings and tons of blood), part The Batman (Gotham city vibes and theeee daaaaark), part Tarantino (The Yakuza and again impossible killings and blood), part Tyler Rake. Batshit crazy total massacre movie but somehow Tom Hardy as always delivers, and and so even the unlikely and a bit stereotypical rookie-sidekick Jessie Mei Lei. Not bad."
  },
  {
    "rating": "1.5/5",
    "review": "The Raid was good but not this, that kinda style doesn't work in this setting, I'd like to see more weapon reloads and less CGI because it got a bit ridiculous at times (very hard to ignore). I also think the whole of Asia is the target audience for these movies so trying to reach English-speaking countries and European audiences is not a great idea. For example, India loves slow-mo and ridiculous fighting scenes but it just looks tacky to everyone else. But if you like 600 Asian boys that can't hit anything diving to their deaths then go ahead."
  },
  {
    "rating": "0.5/5",
    "review": "I had high hopes because Tony Hardy was in it. I thought he was more selective with the characters and scripts he chose. This was just so over the top cheesy (maybe it was supposed to be?) between the ridiculous driving scenes to humans taking on bullet after bullet and just keep going like nothing is astounding. Let’s not forget the how fake the snow was. I mean, did they even try? Sad."
  },
  {
    "rating": "3.5/5",
    "review": "Plenty of action makes up for a lousy story. It's to cheesy and and over used. Tim Treakle"
  },
  {
    "rating": "2.5/5",
    "review": "I think the movie overall had tons of issues. Not to say it was unwatchable or anything. I think Tom Hardy and Timothy Olyphant are solid actors who help the movie. But the overuse of pretty poor CGI in pretty much every driving scene was just bad. The actions scenes were pretty good though. Also the fighting and the violence was pretty solid. So if you can just shut that noggin off and enjoy the ride I'd recommend it. If you can't and inconsistencies in plot drives you mad I'd avoid it."
  },
  {
    "rating": "3/5",
    "review": "What you get is what you have expected, nothing more, nothing less. However it is always a pleasure to watch Tom Hardy. A classic action flick."
  },
  {
    "rating": "5/5",
    "review": "This is a good movie and anybody saying that it isnt yall know ntg about acting.. This is one of tom best movie.. for the ones that want to see reviews before watching.. i totally recommend it, that is if you are into action movies like myself if u wanna see real action just watch it ..infact any of tom movie is FRICKN highly recommended"
  },
  {
    "rating": "3.5/5",
    "review": "Decent action scenes and gory deaths…not one to watch again and again but well worth it for a one off."
  },
  {
    "rating": "5/5",
    "review": "Crime-fighting worldwide!!!!!!!!!!!!! LOL, ROFL, & YOLO!!!!!!!!!!!!!!!!"
  },
  {
    "rating": "2/5",
    "review": "The film is too hectic for me and lacks atmosphere but the film has a hard pace and the film really gets to the point"
  },
  {
    "rating": "2/5",
    "review": "A tenuous and cliche ridden story pumped up to fever pitch with half the film consisting of balletic, violent fight sequences that technically scream \"look at me!\". But for all that (or because of it) the film lacks emotional engagement and gravitas..."
  },
  {
    "rating": "1.5/5",
    "review": "Tom Hardy is a phenomenal actor, but unfortunately the writing on this film was really bad. Plus the use of shaky-cam made all the fight and action scenes a nausea inducing mess."
  },
  {
    "rating": "2/5",
    "review": "I had look forward to this movie for a long time only to be overall disappointed. The opening chase scene was pretty cool, enjoyed the music use however I expected more. It all just became a little boring and generic by the end."
  },
  {
    "rating": "3/5",
    "review": "WIE LEICHT SIND WASCHMASCHINEN? Walker ist echt mies drauf, nicht nur wird ihm eine neue Kollegin zu geteilt, er findet zu dem kein gutes Geschenk für seine Tochter. Zu allem Überfluss muss er noch den Sohn des Bürgermeister Kandidaten suchen. Eine lange Nacht der Gewalt steht ihm bevor, wo die Patronen nur so fliegen. Havoc geht ca. 105 Minuten und ist ab 18 Jahren freigegeben. Wir haben hier einen Action-Thriller mit Tom Hardy in der Hauptrolle, in dem es hauptsächlich zwei Dinge gibt. Einen Dauer mürrischen Helden, der typisch harte Kerl der wenig sagt, ein schlechter Vater ist und jeden platt macht der vor seine Knarre kommt. Die andere Sache ist eine Ballerorgie nach der nächsten, gefiel mir die Sequenz im Club noch recht gut wird in den gefühlt letzten 30 Minuten kaum noch ein Wort gesagt sondern nur noch geschossen. Es ermüdete mich schnell und ich sah zum Schluss eh nicht mehr durch welcher Schuss nun welche Hirn hinaus beförderte. Tom Hardy ist als Hauptfigur genau der mies gelaunte Sack den man mag, schauspielerisch ok, inhaltlich eher flach. Die Story dreht sich um das finden des Sohnes von Forest Whitaker, während Hardy dabei alles zerschiessen darf was nicht bei drei aufm Baum ist und ich Wette selbst von da hätte er auch jeden runter geschossen. Die Bösis gucken hauptsächlich böse und wollen Rache weil der Sohn der Hauptbösi getötet wurde, mehr gibt es nicht zu wissen. Korruption und Drogen dürfen dabei natürlich auch nicht fehlen. Was extrem auffällt ist der unglaubliche Bass der hinter jedem Schuss steckt und das manche Pistolen eher MGs sind. Am Ende bleibt ein Werk das durchaus Spaß macht wenn man sein Hirn aus macht. Die Action ist ziemlich übertrieben, aber einige Sequenzen können sich durchaus sehen lassen. Leider ist die Story recht dünn, die Bösis uninteressant und Klischees geben sich die Klinke in die Hand. Von mir bekommt der Film 6/10 Punkten. Gab es hier eigentlich auch verletzte oder sind alle Feinde direkt gekillt wurden?"
  },
  {
    "rating": "4/5",
    "review": "Unrelenting video game action. Almost everyone dies."
  },
  {
    "rating": "1.5/5",
    "review": "This was a complete disappointment! Couldn’t make it through the entire movie. They did a big disservice to TH and Forrest Whitaker. Cheesy 90’s storyline, unlimited ammo fight scenes, unnaturally large amounts of blood spatter. It was like they took cgi technology notes from the era when movie 300 came out. Another disappointment was the physics behind the AI generated vehicle scenes that gave a Sharknado-like vibe. I mean come on! Felt like there was no quality control implemented during production. The only reason I even gave it 1 1/2 stars is for the fact that, if you were so bored, nothing on tv, it would be some good white noise in the background while cleaning your house or something."
  },
  {
    "rating": "1/5",
    "review": "Very complicated, but I will try to summarise: (dont worry, no spoilers as no real plot so far as I could work out). Basic premise was Tom Hardy's character wrinkling his brow a lot to emphasise his gritty earnrstness, and the incessant discharge of an improbable number of bullets from guns that would probably need reloading much more more regularly than they were. Shame given the cast and evident budget involved."
  },
  {
    "rating": "2.5/5",
    "review": "A tepid thumbs up. The action is great, but what a dumb story. Set in a knockoff Gotham City where guns don't need reloading."
  },
  {
    "rating": "5/5",
    "review": "Wer brutale Action möchte ist hier genau richtig! Ich liebe die The Raid Teile und Gangs of London und freue mich schon auf den nächsten Film von Evans. Der Mann versteht sein Handwerk! Für mich jetzt schon das Highlight des Jahres!"
  },
  {
    "rating": "1/5",
    "review": "Honestly havent watched sucha bad movie in a while. Just a LOT of weirdly placed blood. Dumb shooting and I just hate it so insane much, when you cant even use guns correctly. There is a sequence where the bad guy shoots like 20 bullets in 2 seconds with a total normal pistol. Or another where someone shoots with an uzi( short gun, goes brr rly fast but short) but in this movie the magazine seems endless and she shoots with it for full 10 seconds. Apart from that the story is just boring and brings nothing new. So it seems like this should be a full action shooting bloodfest, but in that part the movie sadly is by far the worst. So whats the mission here ? Wish I would have just watched anything else in that time"
  },
  {
    "rating": "5/5",
    "review": "Great fight scenes, gritty visuals and Tom at his best… so so story line, but that’s not what I came for"
  },
  {
    "rating": "2/5",
    "review": "This movie had so much potential; great cast, good special effects and lots of energy. It was spoilt by ridiculous and protracted shootout scenes where the main characters appear untouchable and the villians were the worst shots in the world or firing blanks (or both). At points I thought it must be tongue in cheek but the script and acting contained no humour anywhere and was intensely delivered throughout, so I assume it was serious (to a point). Pity as it could have been so much better."
  },
  {
    "rating": "1/5",
    "review": "There's no script here just blocking for the constant fights and bullet ballet. Tom Hardy is a fantastic actor but this one is just a pay day. One of those action movies where the characters are so thin that you don't remember their names when the credits roll."
  },
  {
    "rating": "4/5",
    "review": "Lots of shootings, some logical inconsistencies, but overall entertaining, as long as the violence doesn’t deter you. Great art? Nah! But enjoyable."
  },
  {
    "rating": "1.5/5",
    "review": "Terrible Movie. Didn't even feel like a real movie, characters were all off, of course had to have the tough woman. Storyline was BS. I think Tom H must have gotten a big bag to do this one."
  },
  {
    "rating": "5/5",
    "review": "\"Old Boy\" meets \"Cyberpunk 2077\". Nuff said"
  },
  {
    "rating": "1/5",
    "review": "Why? Old and reused story of corrupted police and Chinese mafia and too much violence with enormous amount of blood, the dialogs are shallow , 4/5 of the movie is shooting , the chasing seems are on too fast motion, Tom Hardy really ? Really, really a bad film."
  },
  {
    "rating": "1.5/5",
    "review": "Seems like A1 scripting and visuals throughout rendering it just plain dull and despite the high octane supersonic level of action and violence, just dead. Nothing new here at all. Tom Hardy? Why????"
  },
  {
    "rating": "2/5",
    "review": "Too violent! Only the Chinese mother looks real"
  },
  {
    "rating": "0.5/5",
    "review": "I actively made a Rotten Tomatoes account just to give this movie a rating. It is SO BAD. I hate that Tom Hardy is in it because I like him."
  },
  {
    "rating": "0.5/5",
    "review": "The ‘John Wick style’ action doesn’t make up for the bad plot and lack of story depth. They must have paid Tom Hardy a lot of money to agree to this trash.."
  },
  {
    "rating": "2/5",
    "review": "A fairly easy watch with a fair storyline. Graphics were good, but the blood splashes were grossly overdone. Even one of my favourites in Timothy Olyphant couldn’t save this one to make it a 3+ star film"
  },
  {
    "rating": "0.5/5",
    "review": "This film wastes the talents of two great actors - Tom Hardy and Forest Whitaker. It is little more that a series of ridiculous action shoot-outs and car chases, with a poor script filling in the gaps. It was clearly inspired by the mayhem of competitive computer fantasy games and, also just as clearly, largely created with CGI. It is tedious. How did two actors of that quality allow themselves to get involved in such mediocrity?"
  },
  {
    "rating": "3.5/5",
    "review": "This movie definitely does not discriminate because EVERYONE can get it! Holy violence! I could have sworn as one point blood came off the screen and got in my eye, it was awesome. Good story line, good acting, and a lot of violence."
  },
  {
    "rating": "2/5",
    "review": "0815 netflix movie... only even darker and edited faster so that you have no idea where you are or what exactly is happening... + a lot of gore I used to like Tom Hardy somehow... but those days are probably over"
  },
  {
    "rating": "3/5",
    "review": "Some bozo is review bombing this movie for some reason. The stylized car sequences are campy in a cool way. Over-the-top action is fun. The movie was too long though; I checked the time about halfway through. The plot was weak. Slightly sadistic in a bad way. It wrapped up conveniently for the leads. I was hoping for a noir detective movie after the first twenty minutes and got brainless action instead. Not bad, but could’ve been better."
  },
  {
    "rating": "0.5/5",
    "review": "Nothing felt real, in a bad way. You could tell rooms/alleys were sets and not real. The emotions either didn't exist or felt forced or fake (wrong emotions portrayed at the wrong time or no value placed on the portrayal by characters). Don't get me started on the fight scenes... apparently you can fire 22 bullets out a 6-shooter at the speed of an assault rifle. And best of all, the 50x bad guys emptying assault rifles (with unlimited ammo) at the main characters decide that they suddenly want to take the main characters alive after 4/5 of the bad guys have been shot... so lets go in with bare hands and try grab them since our bullets don't seem to work... just bad."
  },
  {
    "rating": "1.5/5",
    "review": "Same story as better movies, cop does something bad and tries to redeem himself. All the guns seem to have unlimited ammunition and the fight scenes are pale imitations of John Wick."
  },
  {
    "rating": "1/5",
    "review": "Couldn’t get past the first 10 Minutes"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst films I have seen for a while, acting? I have seen better in UK soaps, everything just falls into place, the violence is pathetic, the violence is ultra unrealistic, the magazines in the guns must have a unlimited supply, it’s just your standard Asian gang violence film, very poor in my opinion"
  },
  {
    "rating": "2.5/5",
    "review": "A bit too much action and not enough story/plot to keep you interested.. And this is coming from a BIG Tom Hardy fan.."
  },
  {
    "rating": "1/5",
    "review": "We tried to watch it. The plot was dull and it's very difficult to care what happens to any of the characters. If the second half is incredible then I'm happy to give 3 stars."
  },
  {
    "rating": "5/5",
    "review": "Awesome movie action packed."
  },
  {
    "rating": "5/5",
    "review": "Tom Hardy is awesome. This movie is ridiculous and over the top and I loved it."
  },
  {
    "rating": "1.5/5",
    "review": "I love Tom Hardy and the rest of the cast was pretty good. The story was far fetched but it's a movie and we don't always need everything to be so realistic but this was pushing the outsides of reality for sure. I am just done with shaky cam. They took years designing and building apparatus to steady shot while in motion and even up and down stairs so you could follow your characters around without the need for Dramamine. Now they hire some uninterested kid to manage the camera and just tape the camera to his hand and say go jog around this scene because that will really make it cool and life like. Well I didn't remove my head from my body and use is as a basketball while observing my surroundings but apparently Gareth Evans thinks that's how life appears to us all. I won't fault the actors because they are doing their job and they don't know that the scene looks like they're in a 8.5 magnitude earthquake. I watched it all and wasn't thinking of turning it off but I'm not too interested in seeing it again."
  },
  {
    "rating": "2/5",
    "review": "This is a throwback 90s action movie in almost every way. Ridiculous action scenes. Minimal plot or character development. Poor writing that is typical of most Netflix movies."
  },
  {
    "rating": "4/5",
    "review": "It was a pretty good movie however realistically more rounds were fired and missed than by an infantry regiment engaged with another regiment"
  },
  {
    "rating": "0.5/5",
    "review": "Total waste of time. Don't do it"
  },
  {
    "rating": "2.5/5",
    "review": "in the first scene where a group of people are running away from the police and one guy is hanging off the door it looks so fake and so bad that it nearly made me turn it off but i thought stick with it and i may end up enjoying this movie. This movie was filmed with a Mini LF Camera which was filmed for The Batman and Dune. Tom Hardy is a fantastic actor who knows what type of genre to stay in for projects like drama or action type projects because when he is in these type of projects it's very good to see him act in them. despite the very slow start to this movie once it gets to the heist and drama you start to get a little hooked in and drawn into the story but that didn't start until after 1hr 5 minutes have gone of the movie. overall i gave this a 5.5 out of 10"
  },
  {
    "rating": "2.5/5",
    "review": "It could've and should've been better. There's a lot of laughably unrealistic scenes in this movie that requires you to shut off your brain, and the action is nothing special. The Raid 1 and 2 were far superior in that department. This is a step down from what I would expect from Evans."
  },
  {
    "rating": "0.5/5",
    "review": "I can give points to the acting but the writing was so clumsy, they was no story that was told ,everything was so rushed as if the writer ran out words to write in the middle of the script"
  },
  {
    "rating": "3/5",
    "review": "If you like to see people getting shot to pieces, then this movie is for you. But it's hopelessly implausible, has sappy protagonists, and is loaded with stereotypes. Only in games and movies do guns have infinite ammo."
  },
  {
    "rating": "2/5",
    "review": "Not really a movie. A series of unrealistic action set pieces. Unlimited ammo. Unsupported character motivations. They spent no time trying to get us to care about the protagonist. World building was inadequate. Any film school professor would give this a failing grade. Cast is wasted on crappy script."
  },
  {
    "rating": "1/5",
    "review": "Solid Plot in eternal darkness. But far too much shooting with unrealistic endless magazines ... that's just boring"
  },
  {
    "rating": "1/5",
    "review": "One of the worst films I've ever seen had to turn off half way through very disappointed"
  },
  {
    "rating": "0.5/5",
    "review": "When will Hollywood STOP MAKING CRAPPY AI/video game looking movies. Its horrible!! Too much camera movement it's not art it's dizzying!"
  },
  {
    "rating": "4/5",
    "review": "This is a movie with much action, high body count and some decent twists. The actors are top notch and writing somewhat average done before storyline. If your up for some action its a good choice."
  },
  {
    "rating": "1/5",
    "review": "Makes you feel like you're watching a video game live stream, not a movie. The pace is too fast in the worst possible way."
  },
  {
    "rating": "1/5",
    "review": "Disgustingly violent and vulgar which is a sign of the times and should lead to a strong pushback from decent people everywhere (but won't)."
  },
  {
    "rating": "0.5/5",
    "review": "You see I usually like Tom Hardy but I'm getting a little fed up of him playing... we'll.. Tom Hardy. I'm not sure my review is valid as I switched this one off half way through. Very poor for me. Unlimited rounds of bullets and too many bullshido fight scenes. I'm out!"
  },
  {
    "rating": "3.5/5",
    "review": "finally the triads take one on the chin. hardy plays hardy, jefferson plays a bad daddy, raylen givens is a bad cop and the action and bullets never hit the good guys and also never run out. you could watch this."
  },
  {
    "rating": "2.5/5",
    "review": "They use too many bullets"
  },
  {
    "rating": "1/5",
    "review": "This movie was the worst piece of crap I have had to watch it was so dumb. The story makes no since the acting was phones in but do you blame them. Anyone who says anything good about this movie needs to close your account and go away."
  },
  {
    "rating": "3/5",
    "review": "A new record in people shot and killed in a movie. Congrats! The story has been told before, but that is ok. No Oscar, but if you are looking for easy entertainment, go ahead!"
  },
  {
    "rating": "1.5/5",
    "review": "Sooo bad! They should have spared a few dimes for the script instead of spending it all on cgi, ammo and fight scene choreography. Save yourself the time and watch something else."
  },
  {
    "rating": "1.5/5",
    "review": "This movie would have worked in the 90s, but we are in 2025. Such a great cast, but such a weak script. The plot holes are everywhere. I started scratching my head, because it did not make any sense. I was bored and was just waiting for the end. What a waste of talent."
  },
  {
    "rating": "1/5",
    "review": "What happened to this once promising director, awful script and acting from talented actors. Dont bother with this mess of a movie. I didn't even make it through the film."
  },
  {
    "rating": "5/5",
    "review": "Simply and beautifully ACTION"
  },
  {
    "rating": "1.5/5",
    "review": "Unwatchable. CGI is rough, but the story, Doesn’t really make sense. Well it sort of makes sense it’s just bad . I couldn’t make it to the end. I gave it 1 star because it didn’t have any political overtones like so much coming out of Hollywood does now."
  },
  {
    "rating": "1.5/5",
    "review": "Super boring from the very beginning. Lots of shootouts nothing else"
  },
  {
    "rating": "1.5/5",
    "review": "This film delivers on over the top violence but that about it. The story is ridiculous, The CGI is atrocious, and the dialogue is awful. I like action films but this was not even a serviceable one."
  },
  {
    "rating": "3/5",
    "review": "If I had something better to do I would have."
  },
  {
    "rating": "2.5/5",
    "review": "Sakto lang. Medyo papunta na sa pagiging waley sa dami ng mga side plots. Oks naman un mga madugong fight scenes na halatang cgi ang iba"
  },
  {
    "rating": "1/5",
    "review": "This movie totally sucks."
  },
  {
    "rating": "1.5/5",
    "review": "Far below anything Tom Hardy should be associated with. Many good actors, especially Chinese ones, but nearly all shootouts played like video games. As if AI directed CGI after reviewing shooter games. CGI is horrible to point of unwatchability. Some choreography of the nightclub fights was enjoyable but them they just returned to one person shooting 50 in 2 seconds. Not fun or interesting."
  },
  {
    "rating": "1/5",
    "review": "I cannot remember worse CGI in the last 20 years in all the city scenes. It is so bad that I cannot believe anyone would put a name on it. In the opening scene they try for some Beverly Hills Cop thing that was horrendous. I stopped watching after about 20 minutes because even a simple city scene of a police car driving was terrible CGI. Advice to the CGI team, follow your dream in some other profession. Maybe food service is really for you."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely inchorent. This feels like they filmed on a green screen and told AI to spit out an action movie. All the Tarantino gore with none of the wit. Tom Hardy are you okay? Do you owe this director money or something?"
  },
  {
    "rating": "4.5/5",
    "review": "For the people who say they didn't like it so turned it off after 10 minutes then you missed the best parts. It does what it says on the tin....the action is brilliant, yes there is blood...its an action film so there will be blood, esp when it comes from the writer and director of The Raid and The Raid 2! Fantastic cast, stunt work amazing and action packed all round. Think the problem is some are going in to this with a different expectation which is why they feel \"let down\"."
  },
  {
    "rating": "1/5",
    "review": "A bad movie that one can only enjoy by turning their brain off. The pistol size magazines that never run out of ammunition on auto, ridiculously dumb. Along with gunshots that have minimal effect on those absorbing them. I enjoy action films. This was really absent of plot and execution."
  },
  {
    "rating": "0.5/5",
    "review": "Less realistic than dungeons and dragons. Terrible cgi, terrible plot, terrible driving scenes, infinity magazines in every weapon, a pump action shotgun that unloaded shells like an A12. This was the worst 2 hours of my life, and I've had organs taken out of my body."
  },
  {
    "rating": "0.5/5",
    "review": "lowest of the low rubbish"
  },
  {
    "rating": "5/5",
    "review": "Gareth evans action is always best"
  },
  {
    "rating": "0.5/5",
    "review": "Very bad CGI… It was like watching gameplay of Doom, too much unlogical gore, infite ammo, no knowledge. Story was stretched an hour too much. What a waste…"
  },
  {
    "rating": "1/5",
    "review": "Whilst I thoroughly enjoy a balls to the wall action, Havoc leaves me with a bad taste due to lack of depth in storyline. It's clear there's a team of corrupt cops who have been doing the Mayor's secret bidding. Yet nothing else beyond that. Hardy's character has an estranged wife and daughter that are surplus to requirements, aside from showing he has a shred of humanity."
  },
  {
    "rating": "0.5/5",
    "review": "Stopped watching after 5 minutes the CGI was so bad it makes you cringe. Useless, it’s 2025 how is it still so poor."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst films I've seen. Ridiculous and unnecessarily bloody shoot outs which go on far too long and take up most of the film which makes it very boring. Thin and unimaginative plot."
  },
  {
    "rating": "2/5",
    "review": "Good action sequences but some gun battles went on too long and sooooo many bullets wasted on so many minor characters running in shooting from all doorways. Tom Hardy's clichéd bad cop/bad dad reflected against his otherwise excellent performance. More emphasis on plot and characters would've given this film.a better score."
  },
  {
    "rating": "2.5/5",
    "review": "This is an action movie with some good action. However the camera crew was terrible. It was way too shaky and took away from the action scenes. Story and everything else was average of not below average"
  },
  {
    "rating": "1.5/5",
    "review": "The movie was alright. The horrible cgi everytime a vehicle was on screen and watching these police vehicles go 0-60 in under a second bad just whoever approved the cgi failed horribly. All of it just can’t recommend it."
  },
  {
    "rating": "2.5/5",
    "review": "Fails to capture a fraction of the billiance of The Raid. Havoc is messy, full of tired tropes and more painful than entertaining to watch."
  },
  {
    "rating": "5/5",
    "review": "I loved every single minute of this dark, gritty, violent crime story. Tom Hardy plays a homicide cop with a dirty past. Enough said, he is on a death 💀 mission to bring in the guys who shot up a drug dealers hangout. I only wish they made more movies like this these days. Don't believe all the bad reviews on here, they must be bots. If you like dark cop stories with action then you will love this movie. If you're a fan of Tom Hardy, then don't miss this one. He really shines in this tarnished cop role."
  },
  {
    "rating": "4/5",
    "review": "It’s an easygoing, action-packed watch—think Sin City meets John Wick. The handheld camerawork gets a little excessive in spots, but if you go in expecting solid action rather than a deep plot, it delivers exactly what you need."
  },
  {
    "rating": "3/5",
    "review": "Mindless mayhem: 5/5 Cultural enrichment: 0/5 Combined score: 3/5 Havoc comes out of the gate screaming with violence, blood, and action and never really stops until the end. Pretty sure the audio is 85% gunshots, punches, groans, and blood spatters; 10% other sound effects like car crash sounds; and 5% dialogue. For every point it has in blood and violence, though, it lacks one in meaningful plot and continuity. There is a plot. Technically. It's just weak, shallow, and its presentation is disjointed. It's good enough to get the gist, but this movie is definitely not meant to make you think. I gave this Havoc 3 stars. because I was entertained by the mindless action, but I do prefer at least a little better plot development and continuity, even when I want to mentally check out. All in all, if you're up for some mindless mayhem, this movie is for you, but if you are looking for any kind of meaning, art, or culture, skip it, because you aren't going to get any."
  },
  {
    "rating": "1/5",
    "review": "A money grab by the 3 top actors. So over the top with a weak plot, idiotic plot jumps and the worst fake snow. Only slightly less pathetic than Working Man."
  },
  {
    "rating": "4/5",
    "review": "Really enjoyed this movie, loved the action, genuinely don’t know why this movie is getting so much hate 🤔"
  },
  {
    "rating": "1/5",
    "review": "Absolute dribble from start to finish."
  },
  {
    "rating": "0.5/5",
    "review": "Worst camera work I've ever seen. Plot? Just barely. Don't bother."
  },
  {
    "rating": "0.5/5",
    "review": "Awful. Completely unrealistic. Either the director is stupid or he thinks the audience is stupid. The night driving scenes looked like 💩"
  },
  {
    "rating": "0.5/5",
    "review": "Way to violent graphic"
  },
  {
    "rating": "4.5/5",
    "review": "I really enyoyed this movie. Tom Hardy was fantastic in the lead and the supporting cast were great. Unique story, fast paced and lots and lots of action. It was like John Wick on steroids. I'm not sure who the good guys and the bad guys are. I think thy are all bad guys. Gareth Evans has delivered a great film. Best of 2025, so far."
  },
  {
    "rating": "1.5/5",
    "review": "Typical good cop bad cop movie. Drug deals gone wrong. I thought maybe the action scenes would give some redemption to this movie. But they over use the shaky cam duo g the fights often blueing the scene until someone is injured and over use of the blood splatter packs are used. Most of the action scenes are filled with everyone shooting everywhere indiscriminately to the point I’m taken out of the movie and I’m just at this point asking why is this character shooting 12 times with a revolver and never reloading. Proving John Wick and Mr Nobody franchises are the superior action movies of our time."
  },
  {
    "rating": "1/5",
    "review": "Plot pretty standard bad cop / good cop and more bad cops, but the level of violence is way too high. How many bullets do you need to kill someone?! Almost comic book in it's style but without super heroes or villains. Shame as some good actors who have done much better work."
  },
  {
    "rating": "5/5",
    "review": "Intense, visceral action filled with adrenaline and graphic violence."
  },
  {
    "rating": "5/5",
    "review": "Absolutely superb, doesn’t hold back on the blood, guts and death toll Didn’t think they made dodgy cop/gangster films like this anymore! Thoroughly enjoyable - gripping from start to finish. Whole cast, director and production should take a bow."
  },
  {
    "rating": "4/5",
    "review": "Gareth Evans once again has given us a movie that keeps the adrenaline flowing in all areas of the body. 'HAVOC' although feels like a repetition of what Gareth Evans did in 'THE RAID', this movie manages to stand out in all ramifications, creating it's own unique noise. Tom Hardy leads an ensemble with a skull crushing performance, this continues to prove how much of an actor he his. Although I wouldn't speak of the plot with such high praise, this movie still manages to fill the plot holes with it's non-stop bloody action and it's power house ensemble. Gareth Evans' 'HAVOC' is filled with blood and viscera that fuels ones adrenaline rush."
  },
  {
    "rating": "4/5",
    "review": "It's nuts from start to finish, great action flick that isnt trying to be anything else"
  },
  {
    "rating": "2/5",
    "review": "I really enjoy Hardy and Olyphant but man does this movie suck."
  },
  {
    "rating": "2/5",
    "review": "With loads of decent actors in this, I expected more than just a massive kill fest. it would have been much better if it wasn’t just kill kill kill disappointed with it I actually fell asleep towards the end."
  },
  {
    "rating": "2/5",
    "review": "Meh. Loved venom though"
  },
  {
    "rating": "5/5",
    "review": "The storyline was interesting and on par with the action. Did not like the killing of the father."
  },
  {
    "rating": "5/5",
    "review": "Gareth Evans can seemingly do no wrong. I would argue he’s the best action movie director working today and “Havoc” only reinforces that notion. Beautifully shot and choreographed, the action is fast paced but you never get confused or unsure of what is going on. Evans is a master at the the very top of his game and if you like kick ass action movies, you’ll love Havoc."
  },
  {
    "rating": "0.5/5",
    "review": "film felt like one long crawl through a sewer"
  },
  {
    "rating": "5/5",
    "review": "This’s by far the best ultraviolet movie of the 2025 Seriously, this film is not for the faint of heart. There are scenes with so much gunfire it's hard to keep track of who's still standing. I'm honestly surprised Netflix is streaming something this extreme. If you're sensitive to extreme violence and graphic killings, proceed with caution.\""
  },
  {
    "rating": "3/5",
    "review": "Makes John Wick look like Teletubbies. Not for the weak of heart. At times, there is so much bullet spraying that's it hard to tell who's alive and who isn't. I'm somewhat amazed that this is even on Netflix. AVOID if extreme violence and graphic killings isn't your thing. I knock a couple of stars off because there are too many different groups of bad guys, and only at the end did I kind of figure out what was going on. Why make it complicated when your overall goal is High Score in blood & gore?"
  },
  {
    "rating": "3/5",
    "review": "If John Wick was precision, Havoc was pure chaos (yes I know what Havoc means). John Wick had the efficient use of a double tap and Havoc was empty a clip into one person, reload, repeat. Never have so many shots been fired so so few could die. The action was above average even if the story was a bit redundant."
  },
  {
    "rating": "4.5/5",
    "review": "It's SO awesome. Insane stylized action shot and choreographed to perfection. Simple premise, goofy accent from Tom Hardy but whatever. This is action done to perfection."
  },
  {
    "rating": "1/5",
    "review": "It has no real plot line and is pretty awful. We are curious how many people were killed and how much ammunition was used. We did watch to the bitter end. Ugh!!!"
  },
  {
    "rating": "0.5/5",
    "review": "Ok, is it me or does Hardy have a hard time maintaining his American accent(which is pretty bad by the way)? The storyline is boring, the cast is weak like watered down whiskey. I've been lost since the opening credits."
  },
  {
    "rating": "1/5",
    "review": "How the Hecht is this movie #3 on Netflix?! it’s just killing and more killing, no thank you."
  },
  {
    "rating": "4/5",
    "review": "Overall, I liked it. I am OK with violent movies and this was very violent, but was really action packed. I wish the filming had used better lighting, but the whole movie had a very dark, depressing, mood to it. Still, it was fun to watch and I would recommend it."
  },
  {
    "rating": "2.5/5",
    "review": "Havoc struggles to find its footing in the first half, weighed down by a convoluted plot and underdeveloped, unengaging characters. The CGI is noticeably poor—particularly in the car chases, which feel unnecessarily digital when practical effects would have served the scenes far better. Visually, the film suffers from flat cinematography and a muted color palette that saps energy from the screen. But once the film shifts gears in the second half, it delivers exactly what fans of The Raid: Redemption have been waiting for. The action kicks into high gear with explosive, pulse-pounding sequences that showcase the director’s flair for brutal, high-octane combat. It transforms into the kind of gloriously over-the-top action spectacle that makes the earlier missteps almost forgivable."
  },
  {
    "rating": "2/5",
    "review": "This movie tries to be so many things. Seems that somebody is a true Blade runner fan and that's fine. But also a fan of Blade. And also a fan of asian martial arts flicks. And comics. Decent script, terrible dialogue, cheap looking CGI. Tom Hardy does what he does best - being moody and cryptic. Except for his character all others are annoyingly shallow like in a video game. Watched it slightly past the middleof the whole duration."
  },
  {
    "rating": "1.5/5",
    "review": "There is so much cringe in this it's almost like an ab workout because you're constantly sitting there going oh yuck and ew and recoiling and wondering why this even got made into a movie... Feels like a cheap video game made for emotionally stunted people nothing is well developed or interesting or fresh."
  },
  {
    "rating": "1/5",
    "review": "Worst movie I Have ever seen. CGI just horrible and just unjustified scenes all the way through the movie. Tom Hardy is the Only thing to rescue about this movie. Bring back real action and forget about fake CGI scenes."
  },
  {
    "rating": "3.5/5",
    "review": "Watched the film earlier and I was amazed by the action and story. There was a lot of good gunfights and chase scenes. Tom Hardy played his role very well. However, I feel the pacing of the film was well off. It’s definitely worth a watch."
  },
  {
    "rating": "1/5",
    "review": "Another terrible Netflix action film. Without Hardy this Would have a 5% rating."
  },
  {
    "rating": "1/5",
    "review": "A sad waste of excellent acting talent. Muddy and trite story. Pure violence porn."
  },
  {
    "rating": "5/5",
    "review": "Probably the greatest action movie in recent years. Thrilling, suspenseful, great acting, plot. Everything you'd expect in this potential oscar winner."
  },
  {
    "rating": "2/5",
    "review": "Just not a very good movie. I enjoyed the camera work but aside from that not much else. Characters you don't care about, crazy over the top action sequences and a story line that just doesn't make sense."
  },
  {
    "rating": "3.5/5",
    "review": "Great movie from. the start to about 80 percent. I feel like the ending was rushed and they just wanted to finish the film. At the mid point the action was going Great, my adrenaline was pumping and I didn't want it to stop. The last main scene was boring and the filming was nothing special just a bunch of guys shooting up the cabin. Anyways, I'm glad to see Gareth back into the movie scene. Hopefully we get a Raid 3 out of him. It's hard to watch the main character fighting in martial arts form. Didn't really work for this film. Lots of gore and fight scenes."
  },
  {
    "rating": "4.5/5",
    "review": "That's some crazy action movie man personally don't expect movie to go that hard. The way they Film this movie man absolutely feel like video game , Camera shaking and sound effects combo take the scenes to next level absolutely love Tom Hardy and this movie."
  },
  {
    "rating": "2/5",
    "review": "Massive fan of Gareth Evans work on The Raid series where the action scenes were cutting edge and easy to witness. This however seems more of a blur. The camera work seems all over the place which quick blink before you miss it editing. On top of which, a paper thin plot and poor character development meant I just didn't care about any of the characters."
  },
  {
    "rating": "4.5/5",
    "review": "Good action, turn off your brain, movie."
  },
  {
    "rating": "3.5/5",
    "review": "Let’s be honest: the bar for Netflix original action movies isn’t exactly sky-high. That said, Havoc doesn’t just clear the bar — it vaults over it with style. Is it perfect? No. It has pacing issues, and the CGI, while effective in context, may not be to everyone’s taste. But taken for what it is — a stylized, gritty, hard-hitting crime action film — it exceeds expectations. Just keep those expectations realistic."
  },
  {
    "rating": "5/5",
    "review": "Tom hardy does an awesome job. Love his movies."
  },
  {
    "rating": "2.5/5",
    "review": "Great cast. Weak and formulaic story barely noticeable, its largely about epic violence and body count which is well done in and of itself."
  },
  {
    "rating": "3/5",
    "review": "Havoc (2025) delivers a visceral, chaotic ride through a decaying city plagued by corruption and violence. The film excels in staging brutally kinetic action sequences and capturing a grimy urban atmosphere, but stumbles when it comes to building compelling characters or emotional stakes. Tom Hardy anchors the chaos with a raw, physical performance, yet the shallow script and predictable plot prevent Havoc from rising above its genre trappings. Ultimately, it's a solid but forgettable action experience—thrilling in the moment, but fading quickly afterward"
  },
  {
    "rating": "1/5",
    "review": "To me I think it was poorly directed. Hardy is a good actor but it just seemed bad, all of it. I could not sit through the movie all at once so I would stop it shake my head and come back to a day later 2 times. When it was over I just shook my head. Within the first 15 minutes you knew it wasn't going to be good"
  },
  {
    "rating": "1/5",
    "review": "I was expecting so much more from both Gareth Evans and Tom Hardy. I waited with great enthusiasm for it's premiere.I can't express how incredibly disappointed I was by this movie. Trying to make Wales look like whatever American metropolis it was supposed to be failed right off the bat. The CGI chase scenes were almost laughable. The fight scenes were muddled and were not crisp at all. This is surprising considering Gangs of London and the Raid movies amazing fight choreography. This movie as well as Hardy tries way too hard to gritty. This movie dragged Hardy down as well as Forest Whitaker,and academy award winning actor. This movie has no redeeming qualities and I cannot in good conscious recommend it. I would go as far to say avoid it at all costs. I literally could not wait for it to be over."
  },
  {
    "rating": "5/5",
    "review": "This move grabs you from the very beginning and pulls you hard and fast to the end. Great action sequences, a good cast from to bottom. We have watched twice in 2 days and will watch again soon."
  },
  {
    "rating": "1/5",
    "review": "The Movie sucked dead donkey balls. Bad story Bad action sequences Bad acting."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible cgi and camera work, the chase at the start looked like it was made by an intern with a PlayStation. I didn't get past the first 20 minutes, I was annoyed I wasted my time watching it. Why can't director spend the time shooting a film in the real world instead of on thier computer"
  },
  {
    "rating": "0.5/5",
    "review": "Load of Rubbish , terrible story line"
  },
  {
    "rating": "5/5",
    "review": "I thought the movie was great. Great action scenes. Very fast paced. Casting choices were great. Who wouldn't like Tom, Timothy and Forrest all in the same movie. Tom Hardys character arch was well rounded. The problem with a lot of people is their complaint about some of the accuracy of the gun scenes. Relax man it's a movie. So if the guns all fired the right amount of bullets then it would've been more believable. Come on. Hope they make another cause I felt like they left it open."
  },
  {
    "rating": "5/5",
    "review": "Over the top violence. Crazy shooting scenes very cool style . Acting was better than the dialogue. Just except it as a wild shootem up an it's greatfun movie"
  },
  {
    "rating": "2/5",
    "review": "This movie only saving grace is its action scenes without those scenes this movie plot is very forgettable."
  },
  {
    "rating": "2/5",
    "review": "The CGI or AI is down right terrible. Not sure what they were going for here. The story is ok but the way over the top violence, to the point where it is laughable. Watched the whole thing but it was painful for certain. I feel like Tom Hardy has fallen backwards with this, how he can recover. Such as weird production, I could tell if it was winter or everything was covered in mud. The chase scenes are so badly done. Proceed with caution."
  },
  {
    "rating": "4.5/5",
    "review": "I just don't understand the low scores on both sides! Best film of 2025! Great storyline, excellent acting and action! There were some cons but the pros outweighed them by far."
  },
  {
    "rating": "1/5",
    "review": "Filmed in the dark like a low budget B film without developing any kind of coherence except shoot em up. The second worst movie I’ve seen recently along with the Wolf’s. Keep trying. ."
  },
  {
    "rating": "5/5",
    "review": "It's not for people with low IQ, it's an awesome movie, not those that you already know what's gonna happen.."
  },
  {
    "rating": "4/5",
    "review": "It is a deeper look in the crime world and how things actually work. A corrupt officer is more common than most movies show. The cinematography is genuinely good with a subtle hint of the grey scale of Tom Hardy's character. It's realistic in alot of human aspects"
  },
  {
    "rating": "1.5/5",
    "review": "Really unwatchable, it always amazes me how Hardy can be such a great actor in one show and so horrible in another. Clearly was doing this for a payday or just wasn't interested. And the jitter camera thing is way over done, way way over done."
  },
  {
    "rating": "3.5/5",
    "review": "a touch of Kill Bill about this movie, Tom Hardy fans will enjoy it, plenty of action and a reasonable storyline."
  },
  {
    "rating": "3/5",
    "review": "Havoc was good. I enjoy action books. This movie was packet high with fight scenes and violence. ( we don’t promote violence in real life guys)! Awesome job by hardy. However, I do believe the plot left little to imagination and could’ve been better. I would recommend this watch if you’re bored or for a movie night."
  },
  {
    "rating": "3/5",
    "review": "Gareth Evan’s action extravaganza is a chaotic, adrenaline fueled thrill ride that knows exactly what it is and doesn’t try to be anything more. Those familiar with the director’s previous work will know what to expect and it absolutely delivers!"
  },
  {
    "rating": "0.5/5",
    "review": "By far one of the most stupidest movie I watched in a long time.. don’t get the writing at all and everybody should be dead with a shootout scene like that. The girl cop should be arrested too I’m so confused and the girlfriend why do she know how to fight or shoot like that lol I thought she was a normal girl clearly she’s an assassin too"
  },
  {
    "rating": "1.5/5",
    "review": "Interesting plot enjoyed a lot of the movie however the people who made this movie clearly doesn’t understand guns, however that aside it wasn’t terrible"
  },
  {
    "rating": "0.5/5",
    "review": "The camera operator did a terrible job. It gives me a headache. Couldn’t get through the first 10 minutes."
  },
  {
    "rating": "5/5",
    "review": "Definitely a good movie. Lots of action, has you on the edge of your seat"
  },
  {
    "rating": "3/5",
    "review": "Havoc delivers an intense, fast-paced ride led by Tom Hardy, whose performance remains reliably strong. The storyline holds up well, offering enough intrigue to keep you engaged, and the acting across the board is solid. The action sequences, however, are a mixed bag. There’s a distinctive visual style in the driving and combat scenes—wobbly camera work and rapid cuts that feel almost like a video game cinematic. It’s unique, though it might not be to everyone’s taste. The gunfights lean heavily into spectacle, often crossing into unrealistic or even unintentionally humorous territory due to exaggerated gore and physics-defying shootouts. One recurring issue is the lack of realism in the weapon handling—especially the seemingly endless pistol magazines and minimal reloading. For viewers who appreciate detail in action choreography, this can be a distraction. Some fight scenes also come across as overly choreographed, pulling you out of the moment. That said, the film does pack a few surprises and moments of clever storytelling. The final act tries to ramp up tension, but it leans too far into over-the-top territory, which might undercut its emotional payoff. Still, the filmmakers clearly aimed for something bold, and there’s a lot of effort visible in both the visuals and production. Overall, Havoc is a decent watch if you’re in the mood for gritty action with a stylized edge. It doesn’t quite hit the highs of other genre standouts, but it’s not a waste of time either. A solid one-time viewing for action fans—just don’t go in expecting grounded realism"
  },
  {
    "rating": "1.5/5",
    "review": "One of the most braindead, one-dimensionsal shoot-em-up movies ever put together. Turn your brain off and enjoy the bloody special effects I guess"
  },
  {
    "rating": "1/5",
    "review": "Definitely the worst movie I’ve seen in 2025. Top 3 worst movies since 2000. How can a movie with such an amazing cast be this bad?"
  },
  {
    "rating": "4.5/5",
    "review": "Love anything by Garath Edwards, and anything with Tom Hardy, so for me this movie was awesome, very much reminded me of the Raid, and the house scene in Gangs of London."
  },
  {
    "rating": "1/5",
    "review": "Horrible movie where tiny women beat men 3 times there size. Complete garbage. So tired of watching little women try and portray some scary tough guy every man should be scared of. Total garbage. Love Tom Hardy but man was this a bad career move."
  },
  {
    "rating": "2.5/5",
    "review": "The fight scenes, when they are happening, are very kinetic and imaginative. A lot of choreography has obviously gone into them and it's exciting to watch. Unfortunately, the story itself makes very little sense and there is way too much CGI in the movie. The action is filled with obvious CGI blood splatter, knifes, exit wounds etc. But even the rest of the movie has CGI - the cars, the buildings, the scenery - everything is uncanny. Apparently much of it was shot in Wales, UK so I'd love to see what preproduction shots looked like but I bet much of it is green screened or simply doesn't exist outside of a computer."
  },
  {
    "rating": "1/5",
    "review": "Having a bad and unnecessary CIG scene in the first 5 minutes is not a good start. But i gave it a try. Nevertheless, after multiple jumps between characters and a horrificly bad and unrealistic shooting scene i gave up."
  },
  {
    "rating": "2.5/5",
    "review": "Very disappointing No character development just mainly mindless action Great cast wasted for the most part"
  },
  {
    "rating": "2.5/5",
    "review": "Kept me somewhat entertained until 2030 minutes before the end. Our 3 guys killed about 20 bad guys with weapons and karate skills! Then was when became more ridiculous! the 3 bad guys handcuffed surrounded by a plenty of gangsters (having guns in their hands ready to shoot) managed to somehow free themselves, take guns and kill the gang members…. They shot long time exterminating the gang which was waiting to be killed😂 Our hero T Hardy was watching peacefully from the door step. He was protecting two young people who had a guns pointed at their heads at this point surrounded by the gang 😂. When the 3 bad guys took over in slow motion-action weapons and killed many he decided to find a gun! Lots of shooting and blood, graphic scenes but at this point I felt fed up with unrealistic scenes. If you like endless scenes of blood and shooting then this is a movie for you! But If you have expectations for a bit realistic scenes then this movie is ridiculous 😂😂 No touching scenes between son and father, daughter and father can save the bad skript!"
  },
  {
    "rating": "0.5/5",
    "review": "Stinker of a film. Nothing new, nothing clever, just endless, tedious, unrealistic fight scenes. It starts well then just tails off and then you just want it to end so that you can go to bed and not feel compelled to revisit and finish it off the next day out of curiosity. You will never get the time back and will instantly forget it. Lazy film making."
  },
  {
    "rating": "2/5",
    "review": "The movie's world is a dirty dystopian looking setting where all guns have the infinite bullet cheat. Characters that don't look like they come from a killing background barely looking comfortable pulling off a truck heist become professional fighters against Yakuza types. You have a 100lb girl shooting a no stock shotgun one handed. Why is it so hard for movies to have some type of logical sense to them anymore. Entertainment requires some thought behind actions to me. Tom, Jessie, and Tim bring the movie from 1 star to 2 stars."
  },
  {
    "rating": "5/5",
    "review": "Finally after years I have watched a real good old style non stop Action movie, bullets going everywhere straight pure action wish the 80's and 90's style action movies will come back to life. today we see more cgi than action movies"
  },
  {
    "rating": "0.5/5",
    "review": "Oh Gareth, what have you done...... here I am waiting on another RAID and you go and do this pile of twaddle. Although I watched the entire film my whole being was telling me to turn it off. Yes its brutal, yes its violent and yes some may find it entertaining, but trust me as a massive fan of Evans work, this is utter tripe. The slow mo bits, WHY! Tom shame on you, Forest shame on you as for Olyphant.... LOL. the only actor who got off lightly was Guzman playing the same character he always does, Harrington just looked annoyed the entire film, perhaps the only one to recognise this as a potential carrier ender. I also pity the 'critics' who said this was great HAHAHAHAHA ......."
  },
  {
    "rating": "1.5/5",
    "review": "Plot is silly, the gun fight is not serious like automatic pistol has so many rounds you lose count, and guns has no shell casing ejection."
  },
  {
    "rating": "1.5/5",
    "review": "Gloomy, incoherent and nonsensical. That pretty well describes this disappointing mess. All the more disappointing in that both Tom Hardy and director Gareth Evans (The Raid) are capable of so much more. I’m not sure what Evans was trying to accomplish when insisting everyone shot had to be peppered with at least ten bullets, but it was laughable…much like the rest of the script."
  },
  {
    "rating": "0.5/5",
    "review": "Have you ever heard of the infinite chimpanzee theory?- In that an infinite amount of chimpanzees typing on an infinite amount of typewriters producing infinite scripts, would ultimately write a word for word perfect equivalent of Romeo and Juliet? Well I am of the firm belief, that given infinite time, they would never come up with a plot this poorly structured. Utilising a dictionary and thesaurus, I could collectively spend hours trying to articulate, in the greatest detail, how bad this movie is, yet the human language would fail me as there is not a single English sentence that could properly convey how terrible this movie is. A cosmic mistake of divine proportion had to weave itself into reality, in order to manifest this absolute tripe. Time was lost - real life minutes, hours, days and months, of real people’s lives, in dedication to this dismissal, convoluted, hellscape. I’m trying to save someone here. I’m attempting to prevent divorces and friendship endings for the party that suggest watching this movie. This isn’t Tom hardy, it has to be a clone, they cloned Tom hardy and used the clone exclusively to act in a E-grade Kmart - no Aldi- no Alibaba John wick. I need to have a shower, to wash the muck off from having to have sat through this soul killer. -100000000000/5"
  },
  {
    "rating": "0.5/5",
    "review": "Normally i am a big fan of movies starring Tom Hardy, but this isn't it. Plot is bad, action way over the top millions of shots and no one hits anything. Even not from 1 meter distance. If one of the main characters do get hit after dodging bullets like they are in the matrix, it does not even matter. they just walk it off. Also all car scenes are heavily CGI based, no real chase which you can already spot in the very first scene..."
  },
  {
    "rating": "2/5",
    "review": "I was expecting more from this movie. Some of the action scenes were hard to watch as if it was playing at 1.5x speed."
  },
  {
    "rating": "3.5/5",
    "review": "The cinematography stood out on this, especially on some car chase scenes. Hardy's character might have been better fleshed out. But it was almost as though he was created as an enigmatic central muse to the exposition of several memorable female side characters like Mia, Ellie, his cop partner, and Cortez's wife. I'm not sure what kind of Oscar material everyone else was expecting. I enjoyed it."
  },
  {
    "rating": "0.5/5",
    "review": "This is literally one of the most ridiculous movies I have ever seen. They tried to match the bloodshed of John Wick with a story that is so absurd you can never suspend your disbelief. One of the worst films I have ever seen."
  },
  {
    "rating": "5/5",
    "review": "We enjoyed it. It's a bit of John Wick meets Gotham City...Love Tom Hardy in anything!"
  },
  {
    "rating": "1/5",
    "review": "After brilliant acting roles such as Taboo, the reverence, the Krays, mobland to name a few this was a massive letdown. Very little dialogue to support a very mediocre plot and can only wonder how Tom was persuaded."
  },
  {
    "rating": "1/5",
    "review": "How did they trick you into this Tom?"
  },
  {
    "rating": "0.5/5",
    "review": "Did I watch another movie than what everyone else is reviewing? This was comically bad."
  },
  {
    "rating": "2/5",
    "review": "What you really want is to watch The Raid or any John Woo film, because this story is so basic but not only basic it's basic and confusing at the same time which is to say the script is awful. The action is fun at times, again just watch Hard Boiled or The Killer (not the terrible remake) if you want to get your action fix, sometimes the set looked like a videogame, the acting for all badguys is also terrible c movie status."
  },
  {
    "rating": "0.5/5",
    "review": "Quite possibly the worst movie in the last few years. No real storyline and it was very hard to watch in general. It gets 1/2 a star because I can't give 0"
  },
  {
    "rating": "3/5",
    "review": "3/5 STARS - I didn't realize going into this that it was made by the director of The Raid movies. I enjoyed the first Raid film, but it was many years ago when I saw it. My enjoyment of it might not be the same today. I mostly watched this because of Tom Hardy, and it was pretty good in a lot of ways, but there were some things that held it back from a higher rating for me. The overzealous use of shaky cam video and the obnoxious amount of gunfire (you'll know what I mean when you see it! lol) both annoyed and desensitized me to what was going on and detracted from what was, in many ways, a gripping story. This won't end up on my best of 2025 list, but it won't be on my worst either. I don't consider it a waste of my time. I just wish it could have been a less frustrating viewing experience. Video review to come shortly."
  },
  {
    "rating": "4/5",
    "review": "It’s a John Wick movie. Audience reviews on this one are a little bizarre everyone treating an action film like it was supposed to be an Oscar contender. Yes the plot is thin and violence is over the top but if that’s what you’re expecting it’s a fun watch. Pretty much every negative review is the same ohhh it’s so unrealistic how can Tom Hardy dodge so many bullets, why don’t they have to reload more, etc etc who cares you could say that about pretty much any movie in this genre. I liked it."
  },
  {
    "rating": "2/5",
    "review": "This movies storyline and CGI are terrible. The shooting scenes are okay at best. I would only watch it once."
  },
  {
    "rating": "1/5",
    "review": "It's pretty obvious that you shouldn't watch a film like this unless you're looking for an escapist action movie. I went into it expecting nothing great--just a little diversion. I was, nevertheless, disappointed. I found myself laughing at the extended, relentless gunfights and, worse yet, even fast forwarding through them. As many others have noted, the good guys seem to have found pistols that hold between 50 and 100 rounds before needing to be reloaded. The bad guys--and it seems like that's about half the population of Chicago--appear to be completely unable to hit a target even though they have assault weapons that appear to fine many hundreds of rounds a a second and never need to be reloaded. They are good, though, at approaching their targets while walking completely protected and completely obliterating the building the good guys are shooting from. Some reviewers compare it to an animated comic book. If so, it's a badly written comic book. The relentless gun battles do, though, pause conveniently at moments for the characters to pretend to have deep emotional exchanges, to try to make you think the two-dimensional characters are real people with real emotions. If you're looking for some mindless *diversion*, I'd suggest looking elsewhere. If you're just looking for mindless, maybe this will fit the bill."
  },
  {
    "rating": "5/5",
    "review": "Havoc: A Cinematic Reflection on Karma's Wrath (Written through the eyes of a seer, not just a viewer.) Havoc, starring Tom Hardy, is not just a gritty action film about chaos and survival. Beneath the visceral violence and shadowy cityscapes lies a far deeper narrative, a story about karma, accountability, and the cost of choices. From the very first frame, the film mirrors the internal unraveling of its main character. The opening scenes aren’t merely setting up a plot, they’re setting up a confession, a slow, brutal reflection of one man’s sins catching up with him. By the end, when Tom Hardy's character accepts his fate, it isn’t resignation, it’s atonement. Few ever reach that moment of true acceptance in life, and Havoc captures it in its most raw, aching form. Throughout the story, we see that karma is not selective. The innocent, the guilty, the corrupt, and the desperate, all are swept into the same current of consequences. No one walks away untouched. The young couple, the boy and the girl thrust into the eye of the storm, play supporting roles that quietly become some of the most profound. In a world collapsing into itself, their survival feels almost mythic. Their encounter with the police officer, who chooses mercy over procedure, is a powerful psychological beat. In reality, such an action would never hold up in the lawful world. However, in the world of spirit and soul, where right and wrong are not always written in ink, mercy finds a place. She let them go not because she was weak, but because she recognized their humanity still flickering amidst the ruins. The film’s deeper moral hums like an undercurrent, right place, wrong time, or wrong place, wrong time, sometimes it doesn’t matter. Karma threads through everything, balancing the scales whether we are ready or not. It does not discriminate, it only fulfills. Technical brilliance One cannot overlook the masterful sound design. The use of dynamic compression and environmental layering created an immersive atmosphere that made every creaking door, every distant siren, every desperate breath feel like it was happening inches away. It wasn’t just a film you watched, it was a film you inhabited. The sonic texture pulled you under and held you there, refusing to let you stay a mere observer. Final thoughts Havoc isn’t just an action movie. It’s a karmic ballet danced in blood and consequences. It shows us that no matter how hard we run from ourselves, sooner or later, karma will knock, sin will speak, and fate will answer. And perhaps the greatest victory isn’t survival at all, it’s acceptance."
  },
  {
    "rating": "3/5",
    "review": "I was excited to see this movie with such a phenomenal cast. They were great, but the directing and action were a total disappointment. The movie had a clear story. I liked the story but would get lost in all the movement. I had to keep closing my eyes and pausing the movie to keep from getting dizzy and to help me understand the scene while fighting nausea from the jerky camera work. It seemed like a Kill Bill wannabe that just doesn't understand the difference of in between spaces. The seconds after a detail is revealed should give way to a space for realization without being jerked out of the story to ward off nausea and vomiting due to scenes moving and jerking around so fast that you feel like youre having a seisure while someone is holding your head under water. Was that sentence long and awkwardly stated? Did you feel an urgency for it to end? Did it make you feel uncomfortable? That's the feeling I had watching this. Of course everything is subjective, but I hope they actually look at our posts and take our opinions into consideration. I'd love to see another but with more thought into creating movement without actually needing to shake us to death while doing it. 🌸🩵"
  },
  {
    "rating": "4/5",
    "review": "Una película de acción con todo lo que eso significa, y con los antecedentes del director no falta la sangre, las peleas super coreografias y tiros por todos. La escenas de acción son pocas pero muy intensas. El director se toma su tiempo para desencadenar el conflicto principal pero una vez que empieza no para. Buena película, no a la altura de The Raid o The Raid 2 pero mantiene su firma."
  },
  {
    "rating": "5/5",
    "review": "I have to say that I really enjoyed the movie. The acting was great as was the writing in my opinion. What I really enjoyed though were the action scenes. I have seen a lot of negative reviews and that people had different expectations. I for one really enjoyed it. The story was great as well."
  },
  {
    "rating": "0.5/5",
    "review": "Absolutely terrible. Storyline non existent, wooden acting. Tom Hardy shot himself in the foot with this one. Would have made a good Zombie apocalypse film though. Lots of gargling death scenes. How Tom Hardy dodged all that automatic gunfire defies the laws of physics. Please don't make a sequel. Oh forgot, was the last scene an attempt to replicate Frank Sinatra in Von Ryan's Express? Thank God this wasn't shown at XMAS. In the words of Tom Hardy \" I wouldn't want to ruin her Christmas\" Well it would have ruined my Christmas wasting 2hrs watching this garbage. -("
  },
  {
    "rating": "4/5",
    "review": "It's another classey violent thriller from Evans with Tom Hardy providing quality performance. Though a little weak in the script, it more than makes up for it in the action."
  },
  {
    "rating": "3/5",
    "review": "Released almost silently by Netflix, Havoc arrived in the catalog without the fanfare that usually accompanies the platform's big bets. There were no robust campaigns or big trailers promoting the film - only the magnetic presence of Tom Hardy in the lead role served as the big draw for viewers to press play. The rest of the cast, including the excellent Forest Whitaker, barely featured in the promotional materials, which shows where the production's focus is. Behind the scenes, there were no grandiose expectations either: the script and direction were handled by Gareth Evans, known for his work on the Operation Invasion franchise and the Gangs of London series, but still without a major consolidated hit on his CV. However, Havoc turns out to be a pleasant surprise for fans of the genre. There is no complex plot here, full of twists and turns or memorable performances worthy of awards. The movie doesn't pretend to be anything other than a brutal, direct and, at many times, extremely effective entertainment vehicle. Gareth Evans, in an interview, made it clear that his intention was to pay homage to the Hong Kong action films of the 1980s and 1990s, especially the classics of the subgenre known as “heroic bloodshed”. And even if the end result is not an impeccable homage, it is undeniable that the director delivers an intense, adrenaline-charged experience with action scenes that impress with their level of brutality and realism. The film exudes graphic violence with practical effects, precisely choreographed fights and camera direction that seeks to insert the viewer into the action. Blood gushes, bones crack and everything is handled with a rawness that borders on the visceral. It's no exaggeration to say that Havoc is one of the most violent and impactful films of recent times in this subgenre - and not in the gratuitous sense, but as a conscious stylization that harks back to the times when action didn't depend exclusively on CGI or frantic cuts. The combat sequences are brutal, dirty and believable, and two scenes in particular are the beating heart of the feature: long, well-directed and with a technical level worthy of applause. It's in these moments that the movie transforms itself, gaining life, rhythm and personality. However, outside of these sequences, the film stumbles. The narrative is shallow and uninteresting, with generic motivations and characters who develop little over time. The beginning is especially draggy and full of clichés, with Tom Hardy seeming to revisit mannerisms from his performance in Venom, delivering a performance that oscillates between tired and functional. The setting is generic and the construction of the universe limited. There are attempts to establish emotional relationships, especially between Hardy's character and secondary figures, but none of them are strong enough to generate real involvement with the audience. Even so, for those who watch an action movie expecting just that - action - Havoc fulfills its role with flying colors. It's not a complete work, far from it, but within the proposal to entertain with well-choreographed and visually striking combat scenes, it stands out. Brutality is the leitmotif of the experience, and Evans shows a special affection for these sequences, which have clearly been given more care than the rest of the script. The direction, although unbalanced, hits exactly where it should: in the physical battles, the weight of the impacts and the tension of the confrontations. In the end, it's clear that Havoc would be a completely forgettable movie if it weren't for these two key scenes that raise the bar for the production. They justify its existence and, in a way, redeem the lack of narrative depth and the poor development of the characters. If the viewer is able to let go of greater demands in relation to the script and immerse themselves in Gareth Evans' proposal - which is essentially to deliver stylized beatings and uninterrupted brutality - the film becomes a good choice for action fans who miss productions with physical weight and real impact."
  },
  {
    "rating": "3/5",
    "review": "Shaky camera moves coupled with little to no lighting make this hard to watch begin with. The storyline is unoriginal. The fight scenes are intense but good luck seeing them. Tom Hardy is the only bright spot because they clearly had no lighting on the set."
  },
  {
    "rating": "4/5",
    "review": "Nothing but a big adrenaline rush. Actually beautifully shot and directed. Hardy is Hardy and the rest of the cast hang in and do a great job. Why so many negative reviews? What are you all looking for? Pretty Woman?"
  },
  {
    "rating": "3/5",
    "review": "'Havoc' is a hyper violent action thriller that delivers the desired gonzo entertainment, but nothing else."
  },
  {
    "rating": "1.5/5",
    "review": "Remember that one kid in fourth grade who used to draw the army scenes or fight scenes with stick figures and they were all shooting everything up, and there was a lot of blood and guts and beheadings in the little diorama pictures? Yeah, that guy grew up and wrote and directed this film..."
  },
  {
    "rating": "1/5",
    "review": "Terrible, Tom hardy deserves better than this and quite frankly dissappointed he took the roll, story line is shoddy and the whole film seems rushed just to make a quick buck. Also redicilois this many people died for a duffle bag of coke enough to fuel half time at a Charlton FC away match"
  },
  {
    "rating": "2.5/5",
    "review": "Tom Hardy grimaces, Gareth Evans stages chaotic shootouts, and Havoc forgets to give us anyone or anything to care about. A noisy, blood-soaked slog that mistakes endless carnage for tension. Some solid moments buried under a mountain of clichés and bad CGI. Watch The Raid instead."
  },
  {
    "rating": "4/5",
    "review": "Takes me back to John Woo days with vibes of replacement killers. A little bit of twist and character building and this would have been a better classic. Still better than the recycled garbage out there."
  },
  {
    "rating": "2/5",
    "review": "Tom Hardy is better than this cgi crap"
  },
  {
    "rating": "0.5/5",
    "review": "This is one of the worst movies I've seen in years, and everything that's wrong with the movie industry right now. Awful AI car chases, shoddy sets, even the props are terrible. Incredibly bad cinematography and don't get me started on the dialogue. I love a hard action movie as well as the next guy but this is not how you do it. Quite frankly, it's embarrassing. It's like a Temu John Wick."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was good. Camera work, BGM and set design were great. Hardy, as usual shines is these roles. The city they built, I loved that. Dark, gritty and messy. Same goes with the action sequences. They are not clean, they are messy, as supposed to be. The use of Music in that bar foght was awesome. The only complaint I had that their were too many slow motion shots in the climax sequences, and at one point it became jarring to the eyes and increased the movie run time. Overall, a good action movie."
  },
  {
    "rating": "0.5/5",
    "review": "Complete and utter rubbish, one of the worst films I’ve ever seen."
  },
  {
    "rating": "5/5",
    "review": "Great, fun, very entertaining movie. 10/10 performance from Tom hardy."
  },
  {
    "rating": "1.5/5",
    "review": "It’s just a few guns and another bucket full of bullets away from not needing a plot point at all. The entire movie plays out like an 90’s “violent action flick” but with hardly any substance to fill the gaps. Absolute waist of lead and talent IMO. Might be exciting for angsty teenage boys."
  },
  {
    "rating": "2.5/5",
    "review": "Havoc fails to deliver on Evans' considerable talents. It's stuffed full of boring camera shots we've seen a million times before, not to mention has some of the worst cgi for blood work I've ever seen."
  },
  {
    "rating": "2.5/5",
    "review": "No law. Only disorder. Havoc is a 2025 action thriller film written and directed by Gareth Evans 💪 Not bad, but not my favourite either 😐 Meh, it passed the time. Just. 😐 👍🏼👎🏼 When a drug heist swerves lethally out of control, a jaded cop fights his way through a corrupt city's criminal underworld to save a politician's son."
  },
  {
    "rating": "1/5",
    "review": "I love Raid 1&2 I like Tom Hardy. I hated this movie. There really was very little to like. Maybe more plot and build up and less over the top never ending ridiculous action scenes, then maybe could’ve been something. Sad to say, skip this one"
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies i've ever see"
  },
  {
    "rating": "1.5/5",
    "review": "John Woo meets Frank Miller. However, it isn't as slick, nor does it bring something different to the screen - like their work does. A cliche ridden script, without any surprises, adds to the problems. I cannot think of a single memorable line or scene in this blood fest. It could easily become Tom Hardy's Green Lantern."
  },
  {
    "rating": "2/5",
    "review": "Action aplenty unfortunately despite a top billed cast, I felt unconnected to any of the characters, which made me not care about the outcome"
  },
  {
    "rating": "1/5",
    "review": "I love Tom Hardy, he's one of my favorite actors. But I had to walk away from this movie. It was that bad. I actually signed up to write this review because it was so horrible and I felt like the something needed to be said."
  },
  {
    "rating": "3/5",
    "review": "Is unbelievable bloody violent action and mayhem thriller and the director who blow us away of The Raid 1 and 2 and action and stunts are are really impressive and amazing but Tom Hardy does really solid acting but he's no John Wick and the opening chase scenes felt like I'm watching a video game from PS5 and the cinematography is fine but i don't like it keeps on shaking and not knowing what's going on but the sound is good."
  },
  {
    "rating": "1/5",
    "review": "This movie was just 100 ways to shoot someone and nothing more. Plot was shallow with a very mid climax and an ending that left you wanting more while wishing you had stopped after seeing the first seen..."
  },
  {
    "rating": "2/5",
    "review": "I had high hopes, but it was just a below average shoot 'em up. Unsatisfying and predictable plot with absolutely chaotic but often flavorless action. It did have its moments in the fight choreography, but in the context of the story, it felt like the stars were magically impervious to all damage at times and at other times all it took was a stereotypical Asian gangster to somehow make the \"heroes\" suddenly forget their unexplainable fighting skills. All-in-all, it just felt like a undercooked John Wick wannabe, entertaining stunt work with little else to write home about."
  },
  {
    "rating": "1/5",
    "review": "So terrible that I had to stop watching after 20 minutes. Completely unrealistic opening scene (obviously AI generated). Honestly, during the opening scene I was wondering if this story is supposed to be a science fiction movie on another planet - that's how unrealistic it was. And then there was graphic violence just for the sake of violence, not because it added anything to the story."
  },
  {
    "rating": "1/5",
    "review": "Nothing to be excited about. How can they all escape so many bullets ? It’s beyond me. Boring"
  },
  {
    "rating": "2/5",
    "review": "So stupid it was hard to watch. A convoluted wasted opportunity. A waste of fantastic talent. And a waste of my time."
  },
  {
    "rating": "0.5/5",
    "review": "I'm sorry as I was looking forward to it but what a waste of the obvious effort and tech it took to make this movie! Just a unrealistic mess and quite depressing really!"
  },
  {
    "rating": "4/5",
    "review": "Muy buena para ver con amigos pero sólo un poco confusa y exageradas las escenas de violencia"
  },
  {
    "rating": "1.5/5",
    "review": "1 star for the unintentional hilarity. This was the stupidest action movie I've seen in years. I've never seen people dance around so much from being shot. It was like watching them do the \"bullet boogy\". It's a shame that big stars are having to take such awful projects these days. It's a testament to how badly things have slid in Hollywood."
  },
  {
    "rating": "4/5",
    "review": "It's a John Wick-inspired movie without the Wick, but you can't deny Tom Hardy. It's a Great movie to watch with friends!"
  },
  {
    "rating": "1.5/5",
    "review": "I'm predisposed to liking anything with Tom Hardy in it, I've seen all his movies, but this was one of the most disjointed, poorly written films I've seen. Next to zero character development, shooting scenes where every gun seems to have infinite ammo and the plot is one big trope. I'd pass on this one unless you want to watch sub sub par mindless violence."
  },
  {
    "rating": "1.5/5",
    "review": "Big fan of Tom Hardy. I was really looking forward to watching Havoc. The critics reviews were mixed but that's not unusual so, I downloaded it as soon as it was released. This weekend I sat down to watch and it was one of the most painful movie experiences I've had. Not enough to make me stop watching to the end but, that was mostly because I hoped it would get better. Unfortunately, it only got worse. The writing, ugh, where to start. Too many stories being brought together without enough background to make me care about any of them. The scripted words seemed forced for Forrest Whittaker, wasted on such an amazing actor. I can't imagine he enjoyed playing this part. I guess once they shipped him to Wales, he felt obligated, if not stuck, to do what they asked him to do. The action, ugh. In the day and age of realism in motion pictures, there was very little believable action in this flick. The biggest gaff, how many bullets does a pistol hold (hospital shootout scene)? An Uzi submachine gun would have been a better choice than the silenced pistol that fired on full auto and sprayed bullets everywhere without the need to reload. The ending, ugh. Hardy's character, the lone survivor. The honest cop who helped the wanted and easily cleared young couple flee. None of it is believable."
  },
  {
    "rating": "2/5",
    "review": "I like the actors and the action. But c'mon, you have 50 people with machine guns shooting at 4 people with pistols, and the 4 with pistols take em' out! Too farfetched for me."
  },
  {
    "rating": "1/5",
    "review": "\"Havoc,\" a 2025 action film starring Tom Hardy, is currently available on Netflix. In my view, the movie is overly hyped and exaggerated throughout. The plot felt scattered, with a convoluted storyline that often left me frustrated rather than engaged. It shifted back and forth so frequently that I struggled to stay invested in what was happening. While I was watching, I found myself torn between whether I was genuinely enjoying the film or simply watching out of boredom. I have no desire to watch it again. It seemed more focused on leveraging Tom Hardy's presence on Netflix rather than delivering a quality cinematic experience. Personally, it wasn't to my taste, and while it may resonate with others, it certainly didn't work for me."
  },
  {
    "rating": "2/5",
    "review": "Lamentablemente es una película de las que salen por minutos y son todas genéricas y muy malas.la peor actuación de hardy.la chica policía actuó muy bien.las escenas de acción además de ser pocas no convence.hay dos escenas igual a Babilon AD de vin diesel.cuando va caminando bajo la lluvia y le saca el arma a uno.otra en la pelea de la discoteca.el final es igual a la película de swat.de Collin Farrel.lamentable"
  },
  {
    "rating": "1/5",
    "review": "Why did we see that he has a gift for her child? Why did we see the guy on hospital and he was killed? I mean there are some many stupid parts in this movie that I cant find something that is clever or that has a meaning. Lets put Tom Hardy, make him cop, put too much nosiy, blurry shotting scenes, okey thats it. Now chat gpt write me a bad cop movie, I dont want anything relative to each other, make it just the oppsite of dramatic structure just write a terrible movie."
  },
  {
    "rating": "4/5",
    "review": "Not as bad as everyone is making out. If you've watched *any* Asian action cinema and the raids, it's that, but westernised. Great action sequences, good cinematography, ok story. What are you expecting seriously, calm down."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is unwatchable. If you need a headache, then I highly recommend this mess."
  },
  {
    "rating": "1.5/5",
    "review": "The title tells you everything about both the plot and the movie itself. Lots of action, not very engaging. Bon't bother wasting your time on this one."
  },
  {
    "rating": "0.5/5",
    "review": "One of the worst movies I've seen in uote some time. I don't know why they insist in casting 5'2\" 100lbs females in roles where they beat up 10 guys at one time in hand to hand combat. The leader of the Asain gang female, 2nd in charge female, top enforcer female, #2 enforcer female, Hardy's best fighting aid female. It is just so played out."
  },
  {
    "rating": "1/5",
    "review": "More 'Disaster' or 'Confusion' than Havoc. A movie that wants to be too cool for school, think early John Woo, Kill Bill or even Baby Driver but alas we end up with overly staged cartoon violence and not in a good way like the first Sin City outing. The primary issue is a total lack of character development allied to a complete over reliance on clunky CGI and a plot that could have been generated by ChatGPT. I've been a big fan of Tom Hardy over the years but his standards are definitely slipping with the notable exception of The Bikeriders where the ensemble cast did a lot of heavy lifting to mask the blatant Brando caricature. In this movie the supporting actors are equally underwhelming with stereotyped performances resulting in yet another Netflix production which will be completely forgotten in a couple of months. Poor."
  },
  {
    "rating": "5/5",
    "review": "Great movie, Tom Hardy is really good in this movie"
  },
  {
    "rating": "2.5/5",
    "review": "tom hardy is the only reason to watch this, and it's not much of a draw given how bad the script is. it's mostly a bunch of platitudes about family and christmas (idk why it came out in april) and the action scenes are not so much choreography as they are just as many bullets being shot as fast and loud as possible, so even as an action film i found it tastelessly abrasive."
  },
  {
    "rating": "1.5/5",
    "review": "An incoherent mess, over the top, poor CGI, a good example of when less is more would have made this so much better. Pity given the cast and its potential"
  },
  {
    "rating": "2/5",
    "review": "The film is based on one scene a relentless mass shooting and no effort has been made to see a different action film ."
  },
  {
    "rating": "2.5/5",
    "review": "I like Tom Hardy as the hard guy. The main reason to watch this movie. Movie was a bit to much violence for violence sake. The plot was pretty simple, kill or be killed and while your at it kill as many as possible. Splatter as much blood around as possible. The talents of Tom and Forest Whitaker were wasted on this movie. I would never watch it again and I do watch many movies more than once. Not this one. They should have been wearing superhero outfits and Tom and his mates were impervious to machine guns, iron bars and everything that was thrown at."
  },
  {
    "rating": "1/5",
    "review": "An appalling waste of time , money and acting talent. Avoid."
  },
  {
    "rating": "5/5",
    "review": "Nonstop action just the way I love my movies. Outstanding!!!! A must watch!!!"
  },
  {
    "rating": "1/5",
    "review": "Painfull to watch... Bad move, waste of Tom Hardy."
  },
  {
    "rating": "1/5",
    "review": "Havoc? Indeed. Unfortunately it refers to the pathetic script and endlessly tedious shooting match. Avoid."
  },
  {
    "rating": "3.5/5",
    "review": "After eagerly awaiting this film for what feels like too many years, I was ultimately left disappointed, however my expectations were quite high. This films story is rather generic and carried by some solid performances all round with some top teir action sequences dotted throughout. While still being disappointed i was pleasantly surprised by the amount of style put forward from the first minutes of this film, it's felt retro and nostalgic while also feeling like something I'd not really seen before."
  },
  {
    "rating": "0.5/5",
    "review": "Imagine something bad now multiply by 20. You get close to a movie that was made by \"chat GTP\" like not even the latest genereation of the AI tool. It looks fake top to bottom my Playstation does a better job. Well if this is the future of movies I'm out! Waste of time."
  },
  {
    "rating": "3/5",
    "review": "I expected more from Tom Hardy and Timothy Oliphant. They didn’t get to show their skills in my opinion! Gritty and fast paced but very predictable. A little too much stereotypical kung fu for my liking. Guns that never needed to be reloaded and an ending that leaves you wondering what’s going to happen to the main characters."
  },
  {
    "rating": "2.5/5",
    "review": "The action scenes in \"Havoc\" are entertaining as they are hyperviolent and energetic. I think the problem with the movie is, that is all it really has to offer. It is important for an action movie to have an engaging story and stakes, and this movie is missing both. I appreciate its technical craft as the action scenes are genuinely well put together, but the story is so forgettable I wouldn't be surprised if I forget it in just a few months. I also feel the movie underuses talent from its lead actor, Tom Hardy, by making him a one-dimensional killing machine. Overall, the movie has some fun moments, but it is not enough to make it stand out in a populated genre."
  },
  {
    "rating": "4/5",
    "review": "Basically 90 minutes of stylized violence with a bare bones plot connecting three action set pieces. Simple, but I found the style throughout riveting."
  },
  {
    "rating": "5/5",
    "review": "The setup, cast and the action makes it a good action movie. Kinda shock to see that the overall viewers rated this movie poorly."
  },
  {
    "rating": "3.5/5",
    "review": "Remember the old western movies when they fired a gun 100 times before reloading if they ever reloaded! Well, here you go! How about someone unloads a fully automatic at you and shoots 1000 bullets at you and all you do it duck down a little and you shoot back with a pistol and hit all targets! I was still a fun ride, but I am 100% sure my wife got tired me going that BS every couple minute! So, if you're looking for realistic then this isn't the one for you! If you are looking for an action-packed ride and a lot of cool fight sense here, you go!"
  },
  {
    "rating": "1/5",
    "review": "Entertaining non sensical shootouts. Terrible storyline, 1 dimensional characters and plot and nothing but senseless violence."
  },
  {
    "rating": "0.5/5",
    "review": "What a waste of Hardy’s raw talent, poor script and odd casting for the rest of the crew."
  },
  {
    "rating": "1/5",
    "review": "Love Tom Hardy, so this film left me wondering why he would be in it other than for the ton of money he surely was paid. The violence was nauseating (pardon the pun) overkill. I know Venom is violent, and I enjoyed the first one, but the violence in this film deserved an X rating. Left me sad that anyone would not only envision this level of bloodshed but also then go on to film it and label it as entertainment. Sad day for humanity. Would give this a -5 if possible."
  },
  {
    "rating": "1/5",
    "review": "The film is a mess. The story lacks substance. The characters depth. It was a painful watch. The ultraviolent latter half of the movie was wholly unessessary. Arguably the worst film of the year for me ... Avoid at all costs!"
  },
  {
    "rating": "1.5/5",
    "review": "I decided if it was Tom Hardy, I would give it a try without looking at reviews first. Well 20 minutes in, I had to check the reviews to see if it gets any better and it apparently doesn't, so turned off."
  },
  {
    "rating": "1.5/5",
    "review": "Not worth the hype. If you're going to use that much CGI, just make an animated movie instead!"
  },
  {
    "rating": "1.5/5",
    "review": "Considering the level of the talent involved (charismatic actors in front of the camera, a skilled director behind it) it's absolutely baffling that this movie managed to turn out feeling so amateurish and incompetent on every single level of filmmaking and storytelling (aside from a few shockingly brief flashes of entertaining choreography.)"
  },
  {
    "rating": "0.5/5",
    "review": "Big fan of the Raid [*film], Tom Hardy, Timothy Olyphant [*as actors. This movie however plays like a video game. Messy, dialogue is meaningless. Ultra violent [*for no apparent reason]. Couldn't get passed the club scene. All the best. 1/2 star"
  },
  {
    "rating": "0.5/5",
    "review": "Thought with the cast listing, this is a must - how wrong you can be. Unbelievably poor CGI actioning, and as a Tom Hardy fan, probably the worst performance I have witnessed from him. Tried to struggle on, but only managed 1hr before fast forwarding to the end to avoid having this rubbish sitting in the \"continue watching\" option box."
  },
  {
    "rating": "2/5",
    "review": "This was so over-the-top and contrived. Tom Hardy trying to play the tortured cop that has seen too much. The minute the over-dramatic narration started at the beginning of the movie, my reaction was: \"Groannn... do I have to?\" Definitely not for me."
  },
  {
    "rating": "0.5/5",
    "review": "Cant believe netflix approved the budget for this 😅"
  },
  {
    "rating": "1.5/5",
    "review": "Unwatchably bad CGI. Typical Hollywood never reload guns. Don’t waste your time."
  },
  {
    "rating": "1/5",
    "review": "It was over-the-top guts and gore and hand guns that seem to reap out 50 rounds a second, there is no such weapon. Bullets flying all over the place and most good guys survive. Not a good movie in general- yes, the actions scenes were brilliant and probably took up most of the $9 Million budget but it globally netted $371,000k in income, absolutely awful R O I !!!!"
  },
  {
    "rating": "5/5",
    "review": "You talk about edge of your seat I don't think I ever left the edge wow You think it's going to go one way but it goes the other it it reminds me of a really good modern throwback action movie and there's so much gun fire and blood it's just insane how good this is This is action movie of the year without a doubt maybe the decade I knew it was going to be good but damn it's solid like thank you Tom it's a masterpiece!"
  },
  {
    "rating": "5/5",
    "review": "WOW... how is this getting such low ratings?? Was it perfect or even amazing? No, not really. Was it totally a solid, very entertaining action movie? Absolutely. I gave it 5 to compensate for the rest of the insane reviews... its more like a 3.5 or 4, but for a Netflix production, its great. The plot moved fast and didn't necessarily explain everything, but you get enough explanation throughout the movie to get a solid enough understanding of the events and actions that led up to this point to enjoy it. The action was definitely over the top, but when JOHN WICK 4 can get like a 95% and Keanu can fall like 4 stories, cracking his back a few times during the fall and then pop up and continue his kill spree, this isn't even remotely close to that unbelievable. There are a ton of very good actors, starting with Hardy, who puts in a good enough performance, if a tad bit stiff for his pedigree, but overall solid. Olyphant and Whitaker were a little wasted, but again good enough to keep the plot ticking and engaging. The action was cool and definitely bloody, even if every good person seemed to be both talented parkour artists and former Navy Seals. The action reminded me of the good old 80s action classic movies but given a more modern, gory and realistic (kinda) approach, with plenty of bullet holes and blood sprays. I read the reviews first and saw the low scores here, and almost didn't watch it...BUT I am super glad I did. I really enjoyed it! There were honestly A LOT of really cool action scenes and really great gun fights. If you like the John Wick series, you will definitely appreciate this movie. If you need to see a completely coherent plot that has no holes with deep drama and characters who have totally understandable motives and reasons for their actions.... this movie is not for you."
  },
  {
    "rating": "3.5/5",
    "review": "Not On Par With The Raid Movies, But It Has The Same DNA, The Action Is Great And Tom Hardy Delivers As Always, The CGI Car Shots Were a Disappointment Though, But Overall It's Worth a Watch"
  },
  {
    "rating": "1.5/5",
    "review": "Non stop violence but pretty well done if you like pure mayhem."
  },
  {
    "rating": "0.5/5",
    "review": "This would have been a \"straight to DVD\" movie in earlier, simpler, and yes: easier times. I don't know what happened to Hardy's career. And I understand that people need to pay rent. Alas, does it have to be a movie like this for him? One that's overly thin on story and characters. Overly thick, however, on the \"blood spraying everywhere electric chair death wiggles\" (you saw it here, first). Lez alobe the half-minute MAC-10 magazines and attrocious gun-handling... This movie is a multi-car wreck, so bad you keep watching. Not because you like it but to see how bad it can get when it really, really mashes that gas-pedal. And unfortunately, the movie accepts that challenge. And excels at least in one aspect..."
  },
  {
    "rating": "3/5",
    "review": "Gareth Evans- still the most skilled master of fight porn- levels up with ultra gory sequences that would make Quentin Tarantino wince. But a familiar story line coupled with b action flick dialogue and uninteresting characters might bore the Kill Bill director and certainly disappoint most fans of Gareth Evans previous work. It's possible that Evans movies don't translate well into English. Perhaps he's not meant to use Hollywood actors- from any list. And he's probably not the guy to do an American streaming / subscription service company type movie."
  },
  {
    "rating": "2/5",
    "review": "IN MY OPINION THIS MOVIE TRY TO BE COOL AND BRUTAL ACTION MOVIE.BUT IN HIS ACTIONS IT FEEL LITTLE SLOPPY.THERE IS NO HAND TO HAND COMBAT.GUN FIGHT IS ALSO VERY BAD JUST TRYING TO BE BRUTAL.WITH A SINGLE PISTOL THEY FIRE ATLEAST 50 BULLET.IN JHON WICK WE SAW HOW GOOD A GUN FIGHT SEQUENCE CAN BE.SO IT JUST ANOTHER ACTION MOVIE NOTHING SPECIAL."
  },
  {
    "rating": "1/5",
    "review": "Can't believe with that cast and that director that's what they produced.... shocker. Jesus christ"
  },
  {
    "rating": "1/5",
    "review": "Oh Tom, where for art thou? I haven't seen him in anything good since Legend or The Revenant. Must've just needed a paycheck... Some decent choreography in the fight scenes, some good stunts. The rest played like a seriously over the top game with unlimited ammo and no reloads. Villains have 100% aimbot accuracy unless shooting at the main protagonists where their accuracy gets nerfed to 0%. All of the protagonists have 100% accuracy unless shooting at the main antagonists - nerfed to 0% until the plot requires them to die. Just cliche after cliche really. Nothing new, low brow entertainment. A real shame for Tom, Tim, Forest and Luis who all have way more range than this basic action movie allowed. I did laugh out loud at some of the fights, although I'm not sure I was meant to... Over-reliance on CGI too which is a shame."
  },
  {
    "rating": "1/5",
    "review": "With this cast, you have to try really hard to make a terrible movie but Gareth Evans managed to find a way. Before I saw who the writer and director was, I started thinking this was like an expensive attempt at a knock-off of The Raid. Turns out that's exactly what it is, but at least he's copying his own work. There is nothing interesting at all about the plot, it's intended to be pure action. But the action isn't interesting since you have no idea who any of these people are or care about them in any way. The producers must have stock in fake blood spatter, because it's huge part of every punch, shot, or slip and fall scene. Even watching for free on Netflix, it wasn't worth finishing because it's such a waste of time."
  },
  {
    "rating": "0.5/5",
    "review": "What a shitty waste of time for me. Just gun shots bullets and that's about it. no real story line total waste."
  },
  {
    "rating": "5/5",
    "review": "Felt like I was watching it on a VR head set during the action scenes. When I saw that Forest and Tom was casted, I knew it was going to be lit. I enjoyed the movie."
  },
  {
    "rating": "1.5/5",
    "review": "Forest, Tom, a few other higher name actors and you make this? This is like the Mel Gibson classic \"Payback,\" got mixed in with some early 2000s corrupt cop b-movies... only worse. Much worse. Several times I found myself saying, \"who wrote this script,\" \"he never reloaded,\" \"that man was shot 27 times,\" etc. CGI looks like Cruisin' USA. Even for Netflix this was simply abhorrent. Hopefully they got paid..."
  },
  {
    "rating": "3/5",
    "review": "A pesar de la violencia y el exceso de sangre, la actuación de Tom Hardy es muy buena."
  },
  {
    "rating": "1/5",
    "review": "Golly gee whiz! If this ain't a splatter comedy made up like a Frankenstein mash of old dead movies... It is ROTTEN ROTTEN. What a cast! They must REALLY NEED THE PAYOUT. SAD, BAD, and oh yeah, ROTTEN."
  },
  {
    "rating": "1/5",
    "review": "turned it off within the first 10 minutes. they spent the entire budget on Tom Hardy. Shaky camera affect to hide bad acting, 2012 CGI. does Tom need a yacht or something?"
  },
  {
    "rating": "1.5/5",
    "review": "Unfortunately, for 107 minutes, I hoped Tom Hardy would be able to save this movie. That didn’t happen. I could almost get over the weapons having unlimited ammunition due to the decent action scenes and fighting. It was hard to watch with the poor dialogue And entirely too far over the top writing. I was disappointed because it has a very good and talented cast, but they couldn’t save this clunky movie. I could not honestly tell anyone they should watch this."
  },
  {
    "rating": "1.5/5",
    "review": "I hate to hate a Tom Hardy movie. It's a childishly written script. Tons & tons of action. If you enjoy nonstop shoot'um up & don't care that good & bad guys shoot endlessly but never need to reload. I could go on but it's making me relive a very disappointing movie."
  },
  {
    "rating": "1.5/5",
    "review": "Generic action movie with a lot of bad CGI. Another mid Netflix crap fest."
  },
  {
    "rating": "3.5/5",
    "review": "This movie is for Hardy. He's the reason you should watch this shakey script. The fight scenes are a tad too frenetic, but still entertaining, thanks... to him."
  },
  {
    "rating": "1/5",
    "review": "All Netflix movies are complete trash. This was absolute nonsense. Terrible effects (what was that opening scene?), unlikeable characters, and a ton of very convenient misses from the guns. It all leads to nothing and then it ends. Why was this over 80 min?"
  },
  {
    "rating": "5/5",
    "review": "Ummmm I don't know what all the negativity is about this movie but it's hands down must see ! I think this movie has the BEST gunfight seen ever produced on film. From beginning to end non stop action. Highly recommend - the actor choice was most definitely on point Great Job 👍😍"
  },
  {
    "rating": "1.5/5",
    "review": "Opening CGI car chase is a total let down, unless you are into videogaming. The plot unfolds slowly but it gets engaging at last. I'd pick a more thought-out suspenful movie than this one."
  },
  {
    "rating": "4/5",
    "review": "It was a ride, lives up to the name Havoc all the way through. It's action gore and exciting, may not be the best plot but if you are looking for that here it's the wrong place. This is a fun movie would rewatch."
  },
  {
    "rating": "5/5",
    "review": "Story and acting was phenomenal! Quite entertaining plot!"
  },
  {
    "rating": "1/5",
    "review": "One of the worst movies I’ve seen in the recent years"
  },
  {
    "rating": "1.5/5",
    "review": "Havoc might go down as one of the biggest disappointments in recent memory. With such a talented cast, you’d expect something at least halfway decent — but instead, we get a mess of gratuitous violence, endless fight scenes, and a plot so thin it’s barely there. The female villains feel cartoonish and painfully underdeveloped. It’s almost impressive how a movie with so many good ingredients could turn out this bad. Easily one of the worst movies I’ve ever seen."
  },
  {
    "rating": "2.5/5",
    "review": "I found it laughable that every pistol had about 500 rounds in it throughout the entire movie,not one reload. Then in the final gunfight,they keep running out of ammo. Also how many times does one person need to be shot,once,twice or 50 times,if you answered 50 times then you just watched a Gareth evans movie lol. The fight scenes were a bit overdone as well, everyone apparently has fighting skills. In fact i was waiting for Forrest Whitaker to kill the triads at the cabin,apparently hes the only criminal or cop who doesnt know martial arts.I can't believe this film took 3-4 years to finish! Netflix is a hot mess at this point. I love Tom Hardy and even though the Raid movies are overrated they're at least solid but this movie had star power and did nothing with it. Pass ,unless you're extremely bored and looking for a brainless action movie. I cant believe they got me excited for this film."
  },
  {
    "rating": "2.5/5",
    "review": "If you have absolutely nothing better to do this will provide some shallow, forgettable entertainment. Way over the top fight scenes and some ropey Ggi but the fast pace should keep you from falling asleep. OK to watch once and forget about"
  },
  {
    "rating": "1/5",
    "review": "This hot mess is why I may actually give Netflix a second thought. What a disaster in the opening sequence. Just a mess all over the place."
  },
  {
    "rating": "2/5",
    "review": "Hyperkinetic well-choreographed video game violence... mags that never run dry, heroes that never get hit... John Wick on meth... Implausible overkill but the camera and directorial talent appreciated. Sadly, did not care about any of the characters. Or the story."
  },
  {
    "rating": "0.5/5",
    "review": "Very , let's see what happens when we have an AI make a movie. Right from the start you see hyper unrealistic vehicle movement and absurd 3x fastforward car acceleration. Also it's just boring. Terrible movie"
  },
  {
    "rating": "2.5/5",
    "review": "Tom Hardy stars as Walker, a detective who must save mayor Lawrence Beaumont's (Forest Whitaker) son Charlie (Justin Cornwell) from prosecution for a drug deal gone wrong. During his attempt to save Charlie, he must battle both sides of the law as the local triad believes Charlie is responsible for the deal going sideways and are looking to kill him while the police are looking to lock Charlie up. Writer/Director Gareth Evans homage to the Hong Kong films he grew up watching such as John Woo's THE KILLER, is a decent attempt to be in the same conversation, but ultimately fails in his endeavor. Outside of the opening chase scene and a gunfight in the woods during the third act, the film did little to hold my attention. There was a fight in a nightclub during the second act that comes across painfully artificial and choreographed. In addition, this story's been done a million times with Evans bringing nothing new to the genre. Hardy is the only standout performance but the material is so weak, he can only do so much to carry this picture. Not only that, but I found it obscenely laughable the term \"assault rifle\" is uttered by Hardy and his partner at least half a dozen times. Now I know Netflix is just gaslighting us but I'll pose the question anyway: what exactly is an assault rifle?"
  },
  {
    "rating": "1.5/5",
    "review": "The opening chase scene was a chaotic CGI mess. I couldn't get past the first 10 minutes."
  },
  {
    "rating": "2.5/5",
    "review": "Gruesome Uncreative violance, Nice to see Timothy back on set. They didn't use him to his full potential, he prolly auditioned for the main gig but they liked Tom more for the \"action scenes\". Which the whole problem with the movie's core dynamics. If this was a more creative thought out film, I think Tims the star, Toms a solid backup. I havn't checked out Gareth's previous work, I assume its mid. Aspiring Directior/Writer prolly being biased. Iv seen enough films in my day to make a NUCLEAR FILM. I don't think many people this world can say that. When you watch a Film, are you really listening. Or you texting your ex or current gf about to netflix & chill type thing."
  },
  {
    "rating": "1.5/5",
    "review": "Way over the top fight scenes. It has good actors who never get a chance to act because it's 90% gun fights. If you've ever seen Pooty Tang and the scene where he dances while getting shot at, same thing happens in Havoc as people get shot but it's not supposed to be funny here."
  },
  {
    "rating": "5/5",
    "review": "Lots of good action sequences, Tom Hardy rules in this one, 5 stars!! I want more!"
  },
  {
    "rating": "4/5",
    "review": "The story made little sense, the guns seams all assault rifles with endless bullets, major plot holes, infinite enemies with teleportation and gps… but damn entertaining and well acted. Perfect for a night of recharging"
  },
  {
    "rating": "1/5",
    "review": "It's a terrible film. A constant jittery camera view that is meant to put you right in the action feels like an epileptic seizure with a mediocre truck load of cgi crap thrown in to make it look gritty. Don't waste your time watching it."
  },
  {
    "rating": "1.5/5",
    "review": "Lots of old styles and concepts mixed into one weirdly familiar Romeo Must Die style plot with choir music instead of badass jams. It kept it feeling underground but just no REAL texture. Though characters were played well, I didn’t end up caring for any of the cast. Unnecessarily violent at times, just missed it. Director should stick to to punches not bullets."
  },
  {
    "rating": "2/5",
    "review": "Fine action movie for free, but Hardy is too good for this. And what’s up with the super gory version of the John Wick shootem up? Just felt silly rather than cool and clever."
  },
  {
    "rating": "0.5/5",
    "review": "A waste of such talented actors. Nonsensical action and thin plot."
  },
  {
    "rating": "1.5/5",
    "review": "Story makes little sense, much of the movie is second rate CGI. No idea how they convinced such a great cast to star in this utter tripe, but they can’t save it."
  },
  {
    "rating": "1/5",
    "review": "I didn't build much connection with any of the characters. If gratuitous violence and guns are your thing then you'll probably enjoy it but the story is not worth even talking about."
  },
  {
    "rating": "0.5/5",
    "review": "Just awful. 2 great actors wasting their latent in an absolutely dreadful film full of CGI and never ending fight and murder scenes"
  },
  {
    "rating": "3.5/5",
    "review": "Not as brilliant as it could have been but just as vicious as you'd expect from Gareth Evans, HAVOC is a gnarly & blood-soaked action thriller."
  },
  {
    "rating": "2/5",
    "review": "It is really a shame that Tom Hardy, who is a super actor (from \"Lawless\" to \"The Bike Riders\") agreed to waste his talent to star in this emply-plotted, shoot everybody up, use the F-word as much as possible, crappy movie."
  },
  {
    "rating": "1.5/5",
    "review": "Remember B movies? Low budget movies where they used tomato sauce as blood. This is a expensive B movie."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is not good."
  },
  {
    "rating": "2/5",
    "review": "This is a mix between a video game and a Rambo movie where 100 bad guys can’t take out one guy during multiple gunfights and martial arts fights. I can’t believe Tom Hardy and Forest Whitaker agreed to be in this movie. If you’re in the mood for a consistent, unrealistic shoot ‘em up action movie, then go for it."
  },
  {
    "rating": "2.5/5",
    "review": "I felt like i was watching someone play a shoot em up video game."
  },
  {
    "rating": "4/5",
    "review": "Havoc has finally released on Netflix and it’s a bloody, violent, and fun time. Tom Hardy does not have to say much here in this one because he is to busy kicking everyone’s tail. The movie sets the stage for a metropolitan city which is unnamed that is going through corruption at the highest level and a drug deal gone badly wrong. Our detective that we follow here played by Tom Hardy has to piece things together. The performances are pretty good but the main star is the fast paced hardcore action. For anyone that has seen one of Gareth Evans other films will know what I’m talking about. His action is in your face and does not slow down for a moment. Think of his other films like The Raid and The Raid 2. The only downside to all of this action on screen is the story starts to take a hit and holes start to appear. Even so this film is a wild ride from start to finish. Havoc gets a great 4 stars out of 5 from me."
  },
  {
    "rating": "1.5/5",
    "review": "A shockingly rotten pile of recycled cheese and worn-out cliches. Hard to believe this embarrassment is from the guy who made The Raid. Idiotic script. Characters you've seen a million times before. Looks like a video game. The only very slight hints of creativity are to be found in the two fight sequences, but they are largely incomprehensible due to the editing, and you have to sit through a load of old rubbish to get to them. Real bottom of the barrel stuff. I sometimes wonder if these fake films that go straight to streaming are purposefully made to have on in the background, and not be too intrusive by having any originality to them. If so, job done!"
  },
  {
    "rating": "0.5/5",
    "review": "Looks like Netflix continues to throw money at stars to use them to lure you into a low budget, zero plots movie and with a direction where an AI can probably do better. I stopped watching after 30 mins. You just destroyed Tom Hardy's reputation. And what was he thinking getting himself in this junk, just for the money?"
  },
  {
    "rating": "1/5",
    "review": "Shaky Camera and extreme close-ups substitute for actual cinematography. There is nothing new here. The only decent acting and writing is by and for the supporting cast."
  },
  {
    "rating": "1/5",
    "review": "30 minutes into this movie, I was ready to turn it off. It's not good."
  },
  {
    "rating": "1/5",
    "review": "It appears Hollywood has enough money to throw away on badly-written movies. The plot has many characters we don´t care about, like the candidate´s son, who is helping a girl for reasons that are never explained fully. The detective has committed crimes he tries to get away from, but for some reason seems to care about the candidate´s son enough to rescue him from the Chinese mob, led by a one-dimensional mobster who is on a warpath to avemge her son, an unlikable mobster. The candidate for Mayor (Forest Whitaker), for some reason that is never explained nor explored, has dirt on the detective (Tom Hardy) but the detective goes out of his way to protect the candidate´s son, even when he HAS NO REASON TO DO SO. He could have walked away and never be hurt. The movie relies heavily on shooting, stabbing and punching to distract from the very weak script/plot/story; it is good enough if you like the sound of gunfire. But, Tom Hardy is still very handsome."
  },
  {
    "rating": "1/5",
    "review": "Possibly one of the worst movies I've seen in a while. Way too much CGI, shaky camera work and over the top badly done gore scenes. The story had the potential to be good had all of the above been done well."
  },
  {
    "rating": "5/5",
    "review": "\"One of the finest action films to grace the screen in recent memory, this movie delivers relentless thrills and high-octane energy. Tom Hardy, in signature form, fully embraces his chaotic brilliance, anchoring the film with a magnetic performance. Supported by a top-tier ensemble cast, the movie maintains a level of intensity and craftsmanship that sets a new standard for the genre.\""
  },
  {
    "rating": "2/5",
    "review": "I really wanted this to be good but it was terrible."
  },
  {
    "rating": "1.5/5",
    "review": "I guess actors have to eat as well so a paycheck isnt a bad idea. This movie, however is. From never ending ammo to stormtroopers having better aim than the bad guys, it just dont do it. With a cast like this, it just should be better."
  },
  {
    "rating": "0.5/5",
    "review": "Well Netflix delivered a all the checked political nonsense boxes movie again, and again a handhold camera movie with utterly bad cgi and again full of diversive non believable characters... I cant believe Tom Hardy and Timothy Olyphant would work on this movie.. it is unwatchable bad!!"
  },
  {
    "rating": "3/5",
    "review": "This is very much a film of two parts. Part one is a deeply unconvincing police investigation/crime thriller, with unlikeable, two-dimensional characters and unexpectedly CGI cars that defy realistic physics. Part two is classic Gareth Evans action, and if you've seen The Raid: Redemption or the first season of Gangs Of London, you know this means crunchy fist fights, brutal injuries and incredible (if wildly OTT) gunplay. It opens with a truck being chased by a couple of police cars. Normally, I wouldn't mention this in a review, but it's noteworthy for being, as far as I could tell, entirely CGI, and not good CGI at that. The movement of the vehicles is just... off. There's simply no heft or weight to either the cars or the semi-trailer, and it's deeply off-putting. It's also worth mentioning because these weird CGI cars seem to be used every time there's a car driving faster than walking speed. Visually, Evans is going for a strange blend of pastel-bright colours and urban grime, to the point that I almost got a headache watching it. The story is patchy and difficult to swallow, and none of the characters are even slightly likeable or sympathetic, with the exception of Jessie Mei Li's rookie cop. But once the second half kicks in, all that goes to one side, because crunchy, meaty violence is what Gareth Evans does so, so well. When doing what he does best, Evans can tell a story with character arcs, empathy, and shifting allegiances even while character are hacking each other with meat cleavers and blasting one another to Swiss cheese with guns that can apparently shoot forever. It's a shame the first half is so bad. I'd like to see Evans team up with someone who can direct the quiet stuff and let Evans shine in the action, but in a project like this, written and directed by the same guy, we're going to see all the good and all the bad in equal measure."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is utterly terrible. I am a big Tom Hardy fan and he does what he can to make this movie better. Almost every action scene is either totally CGI or so much shaky cam that there is no way to know what is actually happening. The guns in the movie have no recoil and a seemingly endless supply of ammo. The bad guys in this movie have worse aim than stormtroopers because on several occasions from 5 feet away they can’t hit the characters with automatic machine guns with no recoil. Just don’t waste your time."
  },
  {
    "rating": "2/5",
    "review": "Going into Havoc, I thought I was about to witness greatness. I mean, with that cast, how could it go wrong? Turns out, very easily. Watching this movie was like being trapped on a rollercoaster that only goes in circles: loud, confusing, and after a while, you just want to get off. Sure, the actors looked cool punching and shooting each other and brooding in dark alleys, but the plot was so thin it could have been printed on a napkin. Havoc promised a wild ride, but delivered two hours of stylish confusion and not much else. Bring snacks… and low expectations."
  },
  {
    "rating": "0.5/5",
    "review": "I was looking fwd to this movie because it had great actors and was a thriller. I even marked it's release on Netflix in my phone calendar. I bought popcorn. I didn't even survive 15 minutes before I had to stop watching this film. The plot of the film wasn't edited sequentially; which made the shallow plotline difficult to comprehend. Most of the characters were corrupt or unlikable. Otherwise, they were depicted as victims and died in nasty ways. It was dystopian B Grade nastiness. The ADHD speed of perpetual car chases was used like a blunt instrument, to distract from the lack of plot or character depth. My ex-husband would have enjoyed it, whilst simultaneously texting someone else's wife on FB and online betting on football."
  },
  {
    "rating": "0.5/5",
    "review": "I was looking fwd to this movie because it had great actors and was a thriller. I even marked it's release on Netflix in my phone calendar. I bought popcorn. I didn't even survive 15 minutes before I had to stop watching this film. The plot of the film wasn't edited sequentially; which made the shallow plot difficult to comprehend. Most of the characters were corrupt or unlikable. Otherwise, they were depicted as victims and died in nasty ways. It was dystopian B Grade nastiness. The ADHD speed of car chases was used like a blunt instrument, to distract from the lack of plot or character depth. My ex-husband would have enjoyed it, whilst simultaneously texting someone else's wife on FB and online betting on football."
  },
  {
    "rating": "0.5/5",
    "review": "frequent editing and shaky camera was giving me a headache, unbearable to watch. 0/10"
  },
  {
    "rating": "0.5/5",
    "review": "This movie totally sucks. If it had been a Venom movie I could have accepted the over the top action and probably enjoyed it. The level of shooting towards the end is more like playing an fps with hoards of zombies attacking. Really disappointing as the cast was good."
  },
  {
    "rating": "4/5",
    "review": "I don't know what people problem is, this movie was fun. Sure plot was not much and some thing that happened make no sense but John Wick killed 80 people over a dog and everyone loved it (including me) . I watched it and just had fun, maybe not a super rewatch like Raid but I was into it. Only thing I really didn't like was car chases, so much cgi. Maybe used Forrest Whittaker pay check and gave to that department or practical effects. No to say FW was bad but that part could been played by others, same as Timothy. He was just 1 of like 5 bads so could been a cheaper actor."
  },
  {
    "rating": "2/5",
    "review": "Biggest disappointment of the year. Waited ages for it to be released and ended up turning it off halfway through. The nightclub scene was so badly directed with massively cringe-worthy background acting that made it really unconvincing and I punched the off button. This is a Jason Statham movie that Statham would have laughed at and Tom Hardy's incredible talent was wasted in it. Absolute pile of shite."
  },
  {
    "rating": "1/5",
    "review": "I don’t think a worse movie existed. The car chases were terrible. You can tell they just threw money at these “stars” to overact every scene. Anyone who thinks this a good movie is teenager that plays too many killing video games or just a violent person that doesn’t enjoy good stories"
  },
  {
    "rating": "0.5/5",
    "review": "Complete waste of time, no plot, unrealistic violence. Better to sleep to avoid to waste time"
  },
  {
    "rating": "1/5",
    "review": "If you can stomach the recycled plot and cringeworthy writing, you’ll at least get treated to some of the slickest, Call of Duty-style brawls in recent memory. The fight choreography is brutal and inventive — a rare highlight in an otherwise painful slog. Even Tom Hardy couldn’t save this mess; the script drags him down to almost amateur levels. Accidentally hilarious at times, ‘Havoc’ plays more like an unintentional comedy than the gritty thriller it wants to be."
  },
  {
    "rating": "1.5/5",
    "review": "I enjoy complicated films, but this is a mess from the start. It'd be nice if there was an actual plot"
  },
  {
    "rating": "1.5/5",
    "review": "Almost as many holes in the plot as in triad members."
  },
  {
    "rating": "1.5/5",
    "review": "The concept seemed decent but Tom Hardy's American accent was just odd. Then came the ridiculous overuse of CGi in car chases, city scenes, trains, gun battles which ruined it for me, scene changes. It tried to emulate a John Woo movie...but his action shots were executed superbly. This felt cheap. It was like watching a movie from the 90's and not in a good way. It was more than half way through when the action came which was intense but unrealistic. 1000 rounds obliteration a car but the 3 people inside were not hit once... I lost interested and ended up switching off with 30 minutes left."
  },
  {
    "rating": "5/5",
    "review": "It was a fun ride packed with action."
  },
  {
    "rating": "0.5/5",
    "review": "Terrible movie with no plot and non-stop gratuitous and grotesque violence. The body count is astronomical. The movie is a complete waste of the talents of Tom Hardy, Forrest Whitaker, Timothy Olyphant and Luis Guzman—why any of them agreed to do this movie is a mystery. The little dialogue that exists is silly. The film quality and scenery are amateurish. A complete waste of time."
  },
  {
    "rating": "4/5",
    "review": "Everything the Max Payne should have been"
  },
  {
    "rating": "1/5",
    "review": "Do not waste your time on the first movie I do like that Tom Hardy starred in. The cinematography was awful. The director lost control of this movie and not even the AMAZING Tom Hardy could save it. It’s a long ass movie because of the unnecessary shooting scenes that make no sense. The whole was as messy as this review. I love movies and this is just bad all around. The fake background or fake AI made this so hard to watch. DO NOT WASTE YOUR TIME. Tom Hardy is so much better than this hot mess.(Mobland is proof)"
  },
  {
    "rating": "1/5",
    "review": "It had so much potential but missed the mark with all the unbelievable shoot out scenes and trying to cram too many things into one night."
  },
  {
    "rating": "0.5/5",
    "review": "What an absolute waste of talent! Never knew you can shoot a gun for a full movie with one reload! CGI is on par with the 90's and that's being generous! The plot has more holes than the guys who get shot when they're already dead. Do not waste your time you'll never get it back. Tom why the hell did you take this role."
  },
  {
    "rating": "1/5",
    "review": "Unwatchable. Garbage."
  },
  {
    "rating": "3/5",
    "review": "Mayhem from beginning to end. In all the good ways and the bad. You can always hang your hat on Hardy delivering."
  },
  {
    "rating": "1/5",
    "review": "Camera work is terrible. Most all of the cameras are hand held. The director thinks that frequent editing and shaky camera work is a substitute for fast pace live action film making. If you don't want to get sick to you stomach from motion sickness, be sure to take Dramamine pills before you watch this potential cop thriller. Good actors can't rehabilitate bad filming. This flick is unwatchable!"
  },
  {
    "rating": "4/5",
    "review": "we've seen it all before but if you're willing to forget that for a while, you're in for a white knuckle ride once things go ballistic."
  },
  {
    "rating": "5/5",
    "review": "This movie kicks a**. Great cast, action is great. Big fan."
  },
  {
    "rating": "2/5",
    "review": "While it’s filled with nonstop action, the story is familiar and cliched and the overuse of CGI muzzle flashes, blood and environments begin to overstay their welcome."
  },
  {
    "rating": "3/5",
    "review": "My thoughts throughout - “OK.. what? Oh.. Who? Why? What? Oh…When? … how .. ? Who?.” Etc. good action and actors, but … what?"
  },
  {
    "rating": "4/5",
    "review": "A good and decent action film from one of the best directors in the genre who once again delivers sequences worth every second. It's not his most accomplished work, but it's a great diversion with the Gareth Evans seal of approval."
  },
  {
    "rating": "2/5",
    "review": "Hardy deserves better projects, he’s a great actor. But, this was not good at all. Skip."
  },
  {
    "rating": "3.5/5",
    "review": "Ok... It's an entertaining watch... If you don't mind a bit of blood... Just one question, is this a world where guns never need reloading? Like infinite ammo glitch land or something?"
  },
  {
    "rating": "0.5/5",
    "review": "Waste of time...painful to watch..can't believe Tom Hardy played in it ..10000000 bullets per minute ,shite acting."
  },
  {
    "rating": "1/5",
    "review": "I love Tom Hardy as an English gangster, but unfortunately, in this one, he's playing a mumbling American cop in a badly written and badly acted film. The hyperbolic action doesn't seem to make much sense which is apart from the stupid plot line. other journeyman actors like Forest Whitaker and Timothy Olyphant are wasted on this muddled mess. finally, let me summarize the first half hour of this film in one word... Yikes!"
  },
  {
    "rating": "1/5",
    "review": "The movie was not even decent. Terrible graphics and the plot was all over the place."
  },
  {
    "rating": "1/5",
    "review": "Horrible CGI for the entire movie. I felt like I was watching a student made film. Tom Hardy should have passed on this. The plot was bad, it seemed like a reused plot from an 80’s movie that has been used 30 times."
  },
  {
    "rating": "1.5/5",
    "review": "I am a huge fan of Tom Hardy, and think he's an exceptional actor, especially as a character actor where his talent really shines. His ability was wasted in this 'action' flick, and I think that was because there wasn't really anything he could work with... his character, like all of the others, were superficial stereotypes with no depth or development, mere props for the 'action' sequences, which, as I realised once they kicked off, were the whole point and purpose of this movie. The choreography of the fighting scenes was brilliant and what we've come to expect nowadays, but it was a relentless blood bath that really didn't have any convincing back story to justify its existence. The narrative and characters (and there were many - most without names), were simply something the director and producers could use as a prop for a violent gore-filled orgy of hacking bodies to death. If that's your thing, this movie is for you. If you like plot, characterization and development, a well-written script, believable car chases - look elsewhere."
  },
  {
    "rating": "2/5",
    "review": "Plot is scattered, underdeveloped, rushed, and nothing you haven’t seen hundreds of times. Cinematography is at times too chaotic and shaky making it hard to even see what’s happening. CGI is excessive at times just giving uncanny valley. Acting is mediocre at best especially from the supporting cast. Unrealistic fight scenes could be a vibe but something about unlimited ammo in guns and unrealistic decisions from the bad guys just take away from it all."
  },
  {
    "rating": "4/5",
    "review": "Great cast! Great action sequences! The story is good, not incredibly in depth, which is OK! Feels like a throwback action flick. I also thought the \"making sure the bad guy is dead by unloading half a clip into him/her if not a head shot\" was a nice touch."
  },
  {
    "rating": "5/5",
    "review": "More pure action awesomeness from the greatest action director working. Evans might actually be one of the greatest action directors ever, and that's not a hot take. The man is a cinematic technician of the highest order. We are all lucky to have such a visionary in the action movie business."
  },
  {
    "rating": "1/5",
    "review": "There was a ridiculous emphasis on the action and the storytelling felt flat. You can’t connect with the characters and don’t really know what’s going on about 60% of the time."
  },
  {
    "rating": "4/5",
    "review": "Good Movie with great action."
  },
  {
    "rating": "1/5",
    "review": "A career destroying low for Tom Hardy Guns that never need to be reloaded Humans that take 30-100 rounds to kill - and can still fight back terrible storyline not one actor's \"acting\" is redeemable or forgiveable and somehow, at one point the person that they are trying to save is a cleaver wielding ninja and the next moment a hapless damsel if I could give less than 1 star I would give me my time back"
  },
  {
    "rating": "1.5/5",
    "review": "Havoc (2025) was okay but ultimately lacking. I wouldn’t watch it again. It’s not the best Gareth Evans film I’ve seen — while the action is better than in most films, the brutality felt surprisingly tame compared to his earlier work, even compared to Gangs of London. The cabin shootout clearly echoed the cottage shootout scene from Gangs of London, but this version offered less impact and tension. Some of the fight scenes looked obviously choreographed, with the actors moving slowly in ways that felt rehearsed rather than natural. The story wasn’t very engaging, and the dialogue didn’t stand out. The pacing felt messy, with no real buildup of tension, and everything seemed a bit rushed. While the actors did their best, the characters themselves lacked depth. Casting Forrest Whitaker felt like a missed opportunity — he’s a fantastic actor, but his role here didn’t allow him to make much of an impact. Tom Hardy is also a great actor, but its been a while since I enjoyed a film he’s been in. Overall, I think it’s more that I’m disappointed. It felt like it was missing something. The Raid films still seem to be Gareth Evans’ best work."
  },
  {
    "rating": "1.5/5",
    "review": "A muddled slog of a film with distractingly bad CGI car chases, uninspired dialogue, characters you couldn’t care less about, unlimited ammo clips, and fight choreography that pales in comparison to what Gareth Evans directed in the Raid movies. It has the right elements on paper, but is dull, dumb, and disappointing. Watch the fight scenes if you’re curious, but you needn’t waste your time on anything else."
  },
  {
    "rating": "1/5",
    "review": "Bang bang bang. Blood. Bang bang bang. Plot? Nah. Bang bang bang. Blood. Bang bang bang."
  },
  {
    "rating": "4.5/5",
    "review": "Tom Hardy + Butchers Hook = SAVAGE VIOLENCE. I'm here to support this film with a humble review for those struggling with this one. It takes humility to make a film on a small budget particularly when you're a big name like Tom Hardy. The sequences of vengeful wrath are so savage in their execution that it makes even the most stoic action lovers dizzy with exhilaration and a bit queasy. Hardy makes some of the best use of non verbal performance, where his character aptly named \"Walker\" moves and walks like the dangerous animal he is. His expressions during several prolonged extreme close up shots was stellar. I don't think many folks appreciate what it's like to subject yourself to the scrutiny of peers time and time again. This is Hardy and director Edwards having some real fun on a small budget and getting setting the bar for violent action sequences at a level that it will influence actions movies to come for as long as we make these popcorn thrillers as a society. \"The Raid\" was a pivotal moment along with John Wick and this film introduces a sense of \"Havoc\" to the frenzied \"violent delights\" of action films."
  },
  {
    "rating": "1.5/5",
    "review": "What a waste of time…"
  },
  {
    "rating": "5/5",
    "review": "Great movie, does what is says on the tin. Movie full on action fest from the strats. The cinematography suits the style of the movie. The plot line, look dont watch a movie called Havoc for the story line. It carries the plot forward but nothing special. A great tune in and veb out movie."
  },
  {
    "rating": "1.5/5",
    "review": "I'm a big Tom Hardy fan but, in my opinion, he should have turned this one down. He's far too good to star in rubbish like this, although to be fair, he did let himself down with the American accent, it was terrible! If you're 10 years old though and love to watch people shooting at each other every other scene then you'll like this film 👍"
  },
  {
    "rating": "3/5",
    "review": "Good Action sequences with shallow characters and full of clichés. Very over the top, plot was all over the place with lots of information missing. Decent enough Saturday night viewing for Action fans."
  },
  {
    "rating": "2.5/5",
    "review": "Называется дай чуваку новый сценарий и новых актеров, он всё равно будет снимать Рейд) можно было бы его смотреть отключив мозг или как комедию, но уж слишком серьёзные рожи у пациентов, в заварушках много болталки камерой и лишних персонажей на кадр в секунду, Харди задвигается на второй план, да и самозарядные от воздуха пистолеты на кремний-углеродных аккумах)) это трэш похлеще Невского-Курицына, крови ща хлещет в лучших традициях Тарантино-Родригиса, развязка вообще бред, любителям Уика будет норм 5/10 за Харди он тут действительно Опустошенный, и в бронике) типа, куда я попал..."
  },
  {
    "rating": "5/5",
    "review": "Great movie! Love all the action even though some of it could be a little overboard, but I kind of like that in my movies. I'd like to see more movies like this but would a better narrative as the narrative and this one was a little flat but the action was not stop. Would recommend for anybody that likes a movie with tons of guns fights and unbelievable killing sprees. All in all an enjoyable movie."
  },
  {
    "rating": "5/5",
    "review": "I really liked watching this move. Action scenes were explosive and fun. The plot haters forget that this isn’t an academy award winner, it’s good hard action and fun. It has unique camera angles and who doesn’t want to see Tom Hardy kicking ass."
  },
  {
    "rating": "3/5",
    "review": "Good story but the director went overboard with the gore and the gunfights especially at the cabin at the end … was totally unbelievable. I’ll be sceptical of watching another movie made by Evans. Loved seeing Guzman and Whitaker again! Enjoyed Hardy but loved seeing my fav Olyphant (even if he played the baddie😉) Jessie Li showing great promise."
  },
  {
    "rating": "5/5",
    "review": "What an unbelievable experience. Everything about this movie is shot like a violent action anime. Everything from car chases to fights is exaggerated and insane. This movie takes the 80's action flick and dials it up to a modern level. Tom Hardy nails the gritty comic detective who manages to be both formidable and human at the same time. If you are a lover of pure insane action, this is fantastic recommendation. Yes, itis lacking in a full deep story, but the story isnt what this movie is about. Insane, Bloody, and Fast"
  },
  {
    "rating": "4.5/5",
    "review": "Can an action movie have too much blood and carnage! If your answer is NO, this is your movie. It starts with a high chase truck scene and never takes it's foot off the pedal. It has a ridiculous amount of blood and fight scenes in a Tarantino-kind of way."
  },
  {
    "rating": "0.5/5",
    "review": "Disappointing. Tom is selling his career down the river. Action too fast, story limited and everything is filmed in the dark."
  },
  {
    "rating": "0.5/5",
    "review": "I was really excited to watch this movie but once I turned it on and started watching the excitement quickly faded. I couldn’t even finish the movie. The opening scene was corny, the acting was horrible. The CGI was horrible. It seemed like they let an intern have their way with the movie and it was never sent to a final production. Whoever was in charge of this film needs to be fired."
  },
  {
    "rating": "0.5/5",
    "review": "Could not even finish the film, opening action scenes were cheesy and poorly done CGI, dialogue make me think they didn't even try. If you want to see Tom Hardy in a similar role watch Mobland."
  },
  {
    "rating": "5/5",
    "review": "Great movie! Tom Hardy is amazing and should be the next 007."
  },
  {
    "rating": "3/5",
    "review": "1/10 realism, 98% camera shake, 7/10 fun"
  },
  {
    "rating": "2.5/5",
    "review": "Havoc had the potential to be an absolutely top-tier action movie. The story, cast, and fight choreography were solid, but unfortunately, the constant shaky camera effect during the action scenes really hurt the experience. If they had just used steady camera work to let the fights breathe and be appreciated properly, this could have easily been a number one movie. Still worth a watch, but a bit frustrating knowing how great it could have been."
  },
  {
    "rating": "4/5",
    "review": "This movie to me one of the better action movies of the decade with sequences even Keanu Reeves would be jealous of. The story while simple, focuses on complex and morally grey character motives backed by stellar performances from the likes of Tom Hardy and Forest Whittaker. If you consider yourself a fan of action movies this is a must watch and a great time. PS Get this movie out of rotten IMMEDIATELY."
  },
  {
    "rating": "1/5",
    "review": "If you like john wick fims then there's a slight chance you'll like this. Even then, the action is less slick and more chaotic. It's enough to give you motion sickness. The plot is so flimsy you really couldn't care less who lives or dies. And a lot of people die. The never ending supply of henchmen have all the self preservation skills of zombies. I'm amazed Tom Hardy signed up to this drivel."
  },
  {
    "rating": "0.5/5",
    "review": "Firstly the cgi chase scenes are ridiculous need for speed most wanted ps2 vibes. I'm a huge Tom Hardy fan but Tom was half asleep for most of it moping around like an eejit. mumbling in a non specific American accent. watch Mobland, not this rubbish."
  },
  {
    "rating": "1/5",
    "review": "This is one of those movies that tries to be too many things at once. Particularly it tries to be clever and dense, but it is just self-conscious and obtuse. And stupid."
  },
  {
    "rating": "1/5",
    "review": "This movie was painful to sit through. I am normally a fan of many of the actors in this flim. The writing is so bad though they can't use their skills to carry it. The action scenes are filled with some crazy scenes but they are so unbelievable you can't over look how badly they don't make sense. The big build up at the end if you have seen the flim you know what iam talking about and if you haven't and plan to watch it you will remember this review. The plot has more holes than watering can."
  },
  {
    "rating": "5/5",
    "review": "MUST SEE!! JESSIE MEI LI WAS OUTSTANDING AND MADE A NEW FAN RIGHT HERE!! SHE ROCKS..."
  },
  {
    "rating": "1/5",
    "review": "Terrible, skipped most of it"
  },
  {
    "rating": "0.5/5",
    "review": "So bad and with so many (normally) good actors...I still wonder how they make it! Hardly any story, just shooting the entire time, and no story whatsoever!"
  },
  {
    "rating": "5/5",
    "review": "I just watched Havoc, and man, I can tell you it’s fantastic."
  },
  {
    "rating": "0.5/5",
    "review": "Oxygen thief of a movie."
  },
  {
    "rating": "5/5",
    "review": "I think peope around the world have too many problems that they just can't allow themselves to enjoy a simple movie with good action without complaining about this and that....its quite sad.the story line is old skool,the action is good and Tom Hardy carries it pretty well as always. So to all those complaining about the story line and how bad the movie is,my advice is,learn to not take everything so seriously and try and enjoy a movie....and breathe!"
  },
  {
    "rating": "0.5/5",
    "review": "90% of this movie was bad CGI and repetitive action scenes. Like how many times do you need to shoot someone already dead? Also how they got so many rounds without and scenes with them reloading at all. Expected this to be a good movie because Tom Hardy was in it, dunno how they convinced him into this, big flop"
  },
  {
    "rating": "2/5",
    "review": "Watching Havoc felt like sitting through a GTA cutscene stretched into a full-length movie — overloaded with CGI, endless, unrealistic shootouts that drag on far too long"
  },
  {
    "rating": "1.5/5",
    "review": "Years gone by Hollywood started paying more attention to the smaller details. This movie, for such a star studded line-up, just set it back to the 90's. It's one of the classic storyline's that's been done over and over again. There are some questionable scenes where I'm unsure if it's been overworked in the editing booth or straight out CGI. Couple that with the \"Unlimited Ammo\", definitely made it a hard watch."
  },
  {
    "rating": "0.5/5",
    "review": "Like watching a kids video game, in fact would love to know how much is CGi - feels like 90%."
  },
  {
    "rating": "1/5",
    "review": "Only thing impressive is the agent who convinced Tom Hardy to accept this role. Netflix misses block buster category yet again."
  },
  {
    "rating": "3.5/5",
    "review": "This movie was worth to watch from the start to finish. Great cast though. There was so many gunshots and moving camera angles. It was nice though the climax scene was little dull. The actions scences were amazing!"
  },
  {
    "rating": "1.5/5",
    "review": "The plot was generic and bad it was barely a movie and more like just a reason to film some action scenes. If you are going to make a plot that simple just to justify action do you really need to cram in 3-4 waring factions and people double crossing each other too? If you just want to have people shooting at each other how many different teams of bad guys do you need? I was too bothered by the terrible cliche plot to even enjoy the mindless action sequences."
  },
  {
    "rating": "2/5",
    "review": "Story straight out of the 1970s. Also kind of spiteful"
  },
  {
    "rating": "3/5",
    "review": "Not a great movie, but pretty solid action. It’s one of those movies that you can completed a number of chores, make dinner, etc and not truly miss anything regarding plot. Not one gun needs to be reloaded in this universe. Fun movie though."
  },
  {
    "rating": "3/5",
    "review": "Story is.... generic at best. But I didn't click open this movie expecting any sort of good story. I came for action and I got what I came for. Classic Gareth Evans gore & gritty action. Classic 'the Raid' style mob rush. And then.... Classic John Woo unlimited ammo & 'lets shoot each other and see who drops dead first' duels. All in all this movie gives me that 80s-early 90s Hong Kong action movie vibe from start to finish. **Gareth Evans is definitely paying tribute to John Woo with this one. He even used that song from 'A Better Tomorrow'.**"
  },
  {
    "rating": "0.5/5",
    "review": "Pointless, ridiculous, terrible script, violence was over the top, ZERO STORY."
  },
  {
    "rating": "1/5",
    "review": "Good visuals but absolutely C class movie story and storytelling. Dialogues are of very questionable intellect and not sure why but women are especially cheesy in this movie as if it was a cheesiness competition. Tries to be dark and serious but ends terribly naive almost as being a self parody in the end."
  },
  {
    "rating": "1.5/5",
    "review": "Lots of action, unrealistic scenes, unlimited bullets, like a video game."
  },
  {
    "rating": "4/5",
    "review": "A full packed Action movie. Loads of action, great choreography, brutal gore scenes, a great storyline. Definitely worth a watch. Some things I can nit-pick with the movie however are, some scenes are extremely unrealistic with how many bullets are fired, some scenes, the logic isn't ticking in anyone's brains. But the way the movie has been directed, it's almost as if they thought, \"we'll pack as much action into the movie as possible and hope they don't notice\". But if I've noticed, so will others. The movie isn't bad, it's definitely worth a watch, and anyone canning the movie are being too harsh on it. It's not a great movie, but I would say it's good. It's just a few things that could've been done better. Too much focus on the boom boom action, and not enough thought into the logic of certain scenes."
  },
  {
    "rating": "5/5",
    "review": "Gareth Evans is really a modern-day John Woo. His action sequences are such a pleasure to behold, far from the generic action of movies like The Accountant 2 which I also saw this week and was very disappointed in. Gareth stages very elaborate action scenes, just one of his scenes looks like it could have taken a month to film. I love The Raid 2 and the Gangs of London series and I think he is the new creative and visionary action director of a generation. I just wish he made movies and series more often. I've waited a while for this movie and it more than delivered."
  },
  {
    "rating": "5/5",
    "review": "The chase scenes filmed were the best of any movie I’ve ever seen. The camera work is over the top and I was genuinely impressed. Some times may be a little slow but once it picks up it picks up. Even though it was very unrealistic with the amount of bullets in each clip I feel that was the way they wanted it. So much bullets and action. I was very satisfied."
  },
  {
    "rating": "0.5/5",
    "review": "Worst movie I've seen in years. What were these actors thinking? How did this even get made? Ugh. Don't bother: Cut-rate, wannabe John Wick."
  },
  {
    "rating": "4/5",
    "review": "A good story with some of the best action scenes I've ever seen. Yes it's a popcorn action film but a really good popcorn action film."
  },
  {
    "rating": "3/5",
    "review": "Worth a one time watch."
  },
  {
    "rating": "4/5",
    "review": "This film is an action film. It knows what it is and know what it wants to be. High octane. Bloody action. With my boy Tom Hardy. It's a good fun watch."
  },
  {
    "rating": "3/5",
    "review": "I'm sure I saw Mr Hardy shoot someone. That's against the law and I'm gonna tell on him."
  },
  {
    "rating": "5/5",
    "review": "Old school Verhoeven vibes with tons of squib blood. I loved it! I want more movies like this!"
  },
  {
    "rating": "0.5/5",
    "review": "You know those people that create an account for that one review they had to write? That is me. This is that review. Everyone in charge of Havoc should be barred from the movie industry for-ev-er. Whitaker, Hardy, and Olyphant? Fire your agents. Fire them. Video game CGI? Check. Plot holes the size of Hong Kong? Check. Bad writing killing great actors? Check. I will never get this 1h 47m back. Do not make the same mistake I did."
  },
  {
    "rating": "1.5/5",
    "review": "The action scenes are cool but in no way believable every character is just as capable as john wick"
  },
  {
    "rating": "1.5/5",
    "review": "This is an attempt to have a movie with the most blood and the most bullets fired in a single seating. Of course a 80-90% enemy bullets fired and only a 1% hit rate vs 10-20% hardy and friends bullets fired with a 99% hit rate. Rediculous. But it is what it is. If you like an over the top action movie this one will be a five out of five for you."
  },
  {
    "rating": "0.5/5",
    "review": "An orgy of indiscriminate, plot-free killing, blood, machismo, nonsense. Skip it."
  },
  {
    "rating": "2.5/5",
    "review": "First half was fantastic, then it turned into unrealistic 90’s action. So many dang bullets"
  },
  {
    "rating": "4.5/5",
    "review": "This film has it's incredible moments and the choreography was insane if felt like i was watching a live action video game. The kills are insanely creative and there was a really well written plot. The plot twists and how things unfold are mind blowing. I was on the edge of my seat. The camera work is amazing too. The only thing is the cgi. Not for the blood but for the cgi there will be times where you'll be able to notice but all that aside the film was great."
  },
  {
    "rating": "1/5",
    "review": "Another impossible to watch Netflix disaster."
  },
  {
    "rating": "1/5",
    "review": "Movie Review: Havoc One Star (and that’s generous) If Havoc set out to be the most aptly named film of the year, then congratulations—it’s a chaotic mess of cinematic misfires, stitched together with the subtlety of a car crash and the clarity of a blackout. Watching this film is like squinting into a malfunctioning flashlight while someone throws a bag of CGI debris in your face. The cinematography is so murky and underlit, you'd be forgiven for thinking your TV was broken. Action sequences, which should be the film’s bread and butter, are instead an incomprehensible blur of shaky cam and shadows. When you can actually make out what's happening—which is rare—it only gets worse. The CGI is so lazy and cartoonish it feels ripped from a mid-2000s video game cutscene, not a modern action thriller with a presumably decent budget. And don’t expect the story to save you. The plot stumbles from one contrived moment to another like a drunk on roller skates. Characters appear and disappear with no weight or logic, and any attempt at emotional resonance is drowned beneath the clatter of yet another brainless, derivative brawl. Havoc could have been gritty and gripping. Instead, it's just dim, disjointed, and dumb. If you're looking for a film that assaults your eyes, insults your intelligence, and wastes your time, Havoc delivers in spades."
  },
  {
    "rating": "5/5",
    "review": "Justo lo que necesitaba ver mis ojos, quieres una buena peli de acción?, llama a Gareth Evans y te crea una obra maestra."
  },
  {
    "rating": "5/5",
    "review": "Non stop action! I am a die hard Tom Hardy fan & per usual he did what needed to be done! Having Forest & Timothy also in it was like icing on the the cake. Well directed & very John Woo-esque!"
  },
  {
    "rating": "5/5",
    "review": "É incrivel... Sem tempo a perder E a cenas de lutas são incríveis Já quero logo a continuação Para mais cenas físicas... Pra quem gosta de artes marcias é um ótimo filme"
  },
  {
    "rating": "4/5",
    "review": "Insane action fight choreography and hectic stunt chases for a gritty neo-noir. Welsh director Gareth Evans’ neo-noir action crime thriller Havoc (2025) on Netflix goes pretty hard. It’s not The Raid or The Raid 2, but I found Havoc solidly gritty and engaging. I wish the camerawork was less shaky as it can be seriously difficult to follow all the action. Evans’ direction features hardened criminals and desperate cops entering into brutal combat. Evans’ stylish direction is cool with wicked neon lights, heavy shadows, bloody violence, bleak worldview, and blunt honesty about the drug trade and homicide. Havoc opens on a chaotic car chase that looks super dangerous, the shootouts are very enthralling, and the fist fights are intricately crafted. The neon club fight in the center of the movie is awesome. It’s neat that Tom Hardy was also a producer on Havoc alongside Gareth Evans. Writer Gareth Evans crafts a dark story full of intriguing mystery, vicious killers, shady drug deals, deep corruption, and relentless violence. It’s neat seeing a conspiracy involving a disgruntled homicide detective have to rescue a corrupt politician’s son from the triad’s revenge. The drug deal gone wrong, shootout is crazy, then seeing the dark past of the cops was also interesting to me. I like how things escalate fast with surprising betrayals and shocking reveals. Casting director Kelly Valentine Hendry cast a lot of talented actors to portray these shadowy figures. Tom Hardy is totally gripping as the hardened homicide Detective Walker with shrewd tactics and brutal martial arts skills. Hardy is ready for the dark details and dramatic acting besides the intense combat. Hardy’s hard boiled performance grounds the drama and crime as Walker is willing to bend the rules to save himself. Michelle Waterson-Gomez’s assassin gets into a ferocious fist fight with Tom Hardy in the vicious finale. I adore the harpoon gun kill. Jessie Mei Li is excellent as the tough beat cop Ellie Cheung, who has joined homicide as the new girl. She’s as ruthless as the men here. Timothy Olyphant is also great as the stern officer Vincent. His intense crazy eyes and harsh words are as entertaining as his violent cop. Forest Whitaker is fun as the corrupt politician Lawrence. I love hanging onto every word of Whitaker’s. Justin Cornwell is surprising as the clever drug dealer Charlie, trying to move up in the underworld. Quelin Sepulveda is also engaging as the drug dealer Mia on the run and ready for a fight. Luis Guzmán is wonderful once again as Mia’s Uncle Raul. Sunny Pang is serious and compelling as the treacherous Ching. Yeo Yann Yann is fabulous as the Triad boss and Tsui’s vengeful mother. Serhat Metin gets immediately destroyed as Officer Cortez in the crazy car chase opener. Editors Sara Jones and Matt Platts-Mills’ chaotic fast cutting is both thrilling and hard to follow at times. Cinematographer Matt Flannery pulls off awesome shadows, visceral neon lighting, stunning close-up and medium shots, gritty wide shots, but gets too shaky during the action sequences. Production designer Tom Pearce’s gritty sets look cool like the neon futuristic look from art directors Faye Boustead and Sam Stokes. Set decorators Joelle Rumbelow provides all sorts of neat furnishings for the Triad clubs. Composer Tyler Bates’ hardcore film score is ominous. The hip hop soundtrack is really playful and exciting like the pulsing electronic songs. Gesaffelstein gets a real music showcase in the middle of Havoc. Sound designer Elis Howell Griffiths makes the assault rifle, pistol, and machine pistol gunshots sound heavy and massive. Costume designer Sian Jenkins’ all black outfits are fresh. Makeup artist Claire Pritchard does striking haircuts and bloody wounds. I did not care for the CGI blood, but the squibs look real. Overall, Havoc is fantastic fun for 105 minutes of violence and mystery."
  },
  {
    "rating": "2/5",
    "review": "Muy mala … sangre hasta en la pantalla de TV"
  },
  {
    "rating": "4/5",
    "review": "Don't go in expecting The Raid films which Gareth Evans is famous for and it's good. It's like a John Woo crazy gun action film. I doubt Tom Hardy fans even know who John Woo is so they won't like this film. It's ultra violent and fun in the last 50+ mins"
  },
  {
    "rating": "2/5",
    "review": "What a waste of great acting talent."
  },
  {
    "rating": "1.5/5",
    "review": "Too much shooting with a bit of predictability."
  },
  {
    "rating": "4.5/5",
    "review": "Modern classic, excellent cast. Relentless and brutal action."
  },
  {
    "rating": "1/5",
    "review": "Havoc is nonstop shoot it up and car and truck chases.Aging recognizable cast wasted on hackneyed plot. OK backgound when doing laundry or dishwashing. Unmemorable."
  },
  {
    "rating": "1.5/5",
    "review": "Havoc, the title reflects this chaotic film. Thin plot line as a vehicle for endless gun battles with a high body count. Probably would appeal to teenage boys who play these sort of games online."
  },
  {
    "rating": "5/5",
    "review": "A perfect Friday night action movie. Not sure of the plot but exactly what I love after a week of work."
  },
  {
    "rating": "4/5",
    "review": "Wasn't sure what most of it was about b.utt I enjoyed it 25.4.25 8/0 D.B."
  },
  {
    "rating": "1/5",
    "review": "Absolutely abysmal. When all the scenes are so dark that you can hardly distinguish the actors you know the plot is bad."
  },
  {
    "rating": "3/5",
    "review": "Pretty basic character development and story but overall a solid movie. Loved the frenetic pace and amazing gunplay you expect from Gareth Evans the man does gun violence and action like no other. Definitely a Netflix movie though"
  },
  {
    "rating": "0.5/5",
    "review": "Terrible. Just terrible. Went from thinking that Evans could do no wrong to amazed at how botched this movie really is. From the purposefully misleading trailer to the terrible editing, the incomprehensible plot, the garish CGI, the awful acting... all would've been forgiven if the action was good. People saying the action is good have never understood The Raid 1 or 2. Those movies were about great choreography and great execution from great martial artists, with minimal cuts and no shaky cam nonsense except when it would serve to heighten the intensity. Their action was lovingly crafted, pristine, and artful. This has none of that. At its best, it comes off as a poor John Woo homage. At its worst, it's a flop that is going to stain every participant's careers. What should've been a victory lap might end up being a death knell I am genuinely shocked this is real. Would've been a 1.5/5, but the manipulative trailer and marketing push this all the way down."
  },
  {
    "rating": "1.5/5",
    "review": "Tries desperately to get the Die Hard\" I'm not a Christmas movie but I am' vibe. In April. Then just descends into meaningless violence with Hollywood endless magazine capacities. No spoilers - man annoys people, they come to get him, he fights them. The end. Don't waste your time. Oh, another criticism, the CGI - seen better on a playstation."
  },
  {
    "rating": "3/5",
    "review": "Just as there was no rush to release this, there is no need to rush to watch it. It wasn't worth the wait. Considering the talent in front of, & behind the camera, it's hard not to scratch one's head at the derivative, bombastic, by-the-numbers drivel that has resulted. Having 90% of the action in darkly lit settings basically voids any thrills or sense of what the hell is going on. Though by the time things have switched into havoc mode, it's hard to care. That choice may have been spawned from a (justified) lack of confidence in the uninspired & generally dull fight scenes. The filmmakers can do better, and you the audience can too."
  },
  {
    "rating": "0.5/5",
    "review": "Very poor considering the cast. The use of CGI is also really obvious and distracting."
  },
  {
    "rating": "3/5",
    "review": "This film tries to channel the sleek, stylized action of a John Wick-style thriller, but ultimately falls short when it comes to building real tension or emotional investment. While the choreography and visuals are polished, the stakes never quite feel urgent, and the characters lack the depth to make us care. It’s one of those high-budget Netflix productions that’s visually impressive and fast-paced enough to keep you watching, but doesn’t leave much of a lasting impression. Entertaining in the moment, but ultimately forgettable."
  },
  {
    "rating": "5/5",
    "review": "What a movie! Blessings for action lover. Tom Hardy as always rough and tough guy. Love his attitude"
  },
  {
    "rating": "5/5",
    "review": "Entertaining and with awesome fight scenes."
  },
  {
    "rating": "1/5",
    "review": "badly written characters horendous dialogue the fights are laughable suddenly frightened girl fights like a martial artist, everything is in chaos because of complete lack of rationality just a complete mess,there is no point to anything happening , the club scene is probably one of the worst action scenes i have seen in a movie oh and last but not least 1000round guns since they didn't reload even once in the entire film. just another action flop. i guess its time to revisit the 90's films"
  },
  {
    "rating": "3.5/5",
    "review": "let's go in order from the worst to the best: the plot is undoubtedly the worst part, not that it's bad but it's banal, in short it's the classic story of a guy who has to save someone, there's the classic sacrifice at the end and then everyone's happy and content, it's certainly not the strong point of the film and the music is the classic one of action films. The characters are quite dull as often happens in these films, the only one who is a bit saved is Tom Hardy who plays a bit of a John Wick character, he never dies and kills everyone. The photography is made very beautiful by the settings of the city in degradation and by the lights since most of the film is shot at night, the shots are normal, nothing new. And finally the action scenes: beautiful, among the best I've ever seen (and I've seen a lot of action films), truly shot by God, crude and violent, definitely the best part of the film, probably they concentrated more on this rather than on taking care of the plot, which is absolutely not a justification though; It would be great to see a movie with action scenes like that and a well-studied and non-trivial plot, but for now we'll settle for that. There are no long dead moments so it entertains very well and leaves you quite satisfied."
  },
  {
    "rating": "2/5",
    "review": "I am a Tom Hardy fan but this must be his worst movie, made Legend look like the Godfather. I thought the acting was really poor, contrived and exaggerated. From unnecessarily prolonged action scenes, so fast you couldn't make out what was going on or who was involved, weapons firing unlimited rounds to poor CGI where snow looked like polystyrene, car tyres generated no spray through snow sludge to the fake buildins etc. I love action movies but this was really disappointing I'm sad to say."
  },
  {
    "rating": "0.5/5",
    "review": "Very first time writing a review, This sucks, Terrible writing, poor plot. More of a dark comedy with the unrealistic magazine capacity (unlimited rounds). Bad mob boss is a women who kills her own workers but hesitates to kill the ones who killed her beloved son. Tom hardy getting beating up by feather weight lady. But the female cop saves the day and lets Drug dealing/mass shooting interracial couple go then is told she's a good cop."
  },
  {
    "rating": "3/5",
    "review": "love the Raid films but something seemed to not work right with this. Felt over the top which for a fan of the Raid films seems a bit hypocritical but it just felt disjointed and ridiculous. The CGI car scenes made the film feel cheap too."
  },
  {
    "rating": "1.5/5",
    "review": "Characters that aren't developed enough to care about, and action that is a triumph of noise and violence over serving any actual narrative purpose. Shame, I like lots of what Tom Hardy does and there are some other strong people in it, but ultimately it's a pretty lame story, poorly told."
  },
  {
    "rating": "5/5",
    "review": "Forest Whitaker and Tom Hardy WOW 😲 I DIDN'T SEE THAT ONE COMING. Forest Whitaker will make any movie come alive. Tom Hardy, well you have to give it to him. He know how to keep you entertained."
  },
  {
    "rating": "5/5",
    "review": "Absolutely nice screenplay wow!"
  },
  {
    "rating": "0.5/5",
    "review": "Completely and utterly garbage movie, where the only entertainment value it offers is how laughably bad it is. 90% of the movie consists of incredibly poorly executed CGI, which plagues every single scene throughout. The plot is a razor thin, cliché, and completely incoherent mess that is further worsened by mediocre actor performances. Even the action scenes lack any substance, and has no interesting or nuanced elements to them. All you get is an over-excessive amount of blood, gun shots, sound effects, camera shakes, and Tom Hardy... Havoc is hollow on every level and adds nothing new to the table, if anything this movie only subtracts from that table…"
  },
  {
    "rating": "1/5",
    "review": "Very disappointing movie all-round, camera/picture quality is very grainy and appears to be lo resolution. The car chase action scenes have been sped up so much they are just ridiculous. As for the story there is nothing to keep me interested, instead of watching Havoc I'm writing thus review as it's more interesting."
  },
  {
    "rating": "2.5/5",
    "review": "If it’s action and great fight sequences you are looking for then this ticks the boxes other than that though there’s not too much to recommend it. The storyline is cliched/contrived and the script poor as is Tom Hardy’s attempt at an American accent."
  },
  {
    "rating": "0.5/5",
    "review": "The primary issue with Havoc lies in its appalling CGI and poorly executed visual effects. Filmed in England, United Kingdom, the film makes the questionable creative choice of attempting to pass off British locations as American cities. Rather than embracing its setting and adapting the story as a British narrative, the filmmakers opted for extensive computer-generated alterations to give the illusion of an American backdrop. This decision resulted in unconvincing visuals that resemble a distorted version of the United Kingdom, awkwardly dressed up to mimic the United States. The CGI is notably subpar, detracting significantly from the film’s authenticity. The artificial cityscapes and fabricated subway systems are not only poorly rendered but feel like a complete waste of effort and resources. The exaggerated camera shake further adds to the disjointed and chaotic viewing experience. Despite strong performances from Tom Hardy and several other talented actors, the film is ultimately weighed down by its technical flaws. The nearly two-year post-production process, largely due to the heavy CGI workload, appears to have done more harm than good. Had the filmmakers set the story in the United Kingdom, embracing the natural locations and cultural setting, Havoc might have delivered a far more grounded and visually coherent film. As it stands, the movie is an unfortunate example of style over substance, where misguided production choices overshadow the commendable acting talent involved."
  },
  {
    "rating": "1.5/5",
    "review": "Watching Mobland at the moment so immediately struggled with the American accent. There are similarities with John Wick in some of the action scenes, which were entertaining at times. Storyline a little weak and end sequence felt a little like Heat without the heart. Too much CGI with car chase sequences, which were terrible in all honesty. It was OK at best."
  },
  {
    "rating": "2/5",
    "review": "Netflix reminds me of old boomer, who just can't keep it up anymore. The movie is trash. But am i suprised? Not anymore. Netflix just cannot do a good thing anymore..."
  },
  {
    "rating": "0.5/5",
    "review": "Borderline un watchable. CGI/AI whatever you wanna call it is insane bad. Watched 1 hour had to turn it off as i promised my self i will not let another awful netflix movie waste my time again"
  },
  {
    "rating": "5/5",
    "review": "Tom Hardy at his awesome best, if you love Tom Hardy you'll love Havoc!"
  },
  {
    "rating": "1.5/5",
    "review": "The CGI use for the car chases and even just normal drives must have been the same that was used in Need For Speed 1. The screenplay writing reminds me of a low budget Tv series from the 80s and the directing could honestly not be worse. Another movie that had major potential that Netflix completely ruined just to add another listing to their watch list"
  },
  {
    "rating": "1.5/5",
    "review": "Infinite magazine, no recoil guns and sloppy fight scènes to be honest. Rushed story. Had a lot of potential for a good action movie.."
  },
  {
    "rating": "5/5",
    "review": "“Tom Hardy Unleashed: Havoc is a Brutal Ballet of Chaos and Redemption” Havoc isn’t just a movie. It’s a full-throttle, blood-soaked fever dream that drags you into the dark underbelly of a city gone to hell—and refuses to let you go until the credits roll and your jaw hits the floor. Tom Hardy delivers a masterclass in controlled chaos. His performance as the battle-scarred detective navigating a nightmarish web of corruption is gritty, visceral, and utterly magnetic. He doesn’t just act in Havoc—he bleeds for it. Every punch he throws, every breath he takes feels like it’s laced with trauma, truth, and tenacity. Director Gareth Evans (The Raid) once again proves he’s a god-tier orchestrator of cinematic violence. The fight choreography is nothing short of savage poetry—elegant and brutal all at once. It’s not just action for action’s sake. Every sequence has weight, emotion, and purpose. It feels earned. This movie is raw. Relentless. Relentingly real. It’s a gut punch to the crime thriller genre. The cinematography is moody and immersive, the pacing breathless, and the tension so thick it practically drips off the screen. You don’t watch Havoc—you survive it."
  },
  {
    "rating": "2/5",
    "review": "I loved The Raid movies but this Netflix movie was alright. The biggest problem, the shaky camera was heavily overused and some of the scenes wasn't fully clear."
  },
  {
    "rating": "4.5/5",
    "review": "Really great. Tom Hardy is a beast"
  },
  {
    "rating": "4/5",
    "review": "Great action...beware, however, of terrible CGI, espeically in the opening car chase!"
  },
  {
    "rating": "4.5/5",
    "review": "yes, this is not Reid. but today since no one is filming as Evans, so I will not criticize in vain. for everyone who is tired of the comedy action Bullet Train or Fight or Flight, this film is a breath of fresh air."
  },
  {
    "rating": "5/5",
    "review": "Movie is full of adrenaline. Nonstop action from start to finish."
  },
  {
    "rating": "2/5",
    "review": "Es una película de acción/fantasía. Creen que por matar más personas en las películas las hacen mejores y no es así. El guión tampoco ayuda."
  },
  {
    "rating": "3/5",
    "review": "Wtf happened? Is this the way of the future for action films? I don't know what to think."
  },
  {
    "rating": "4.5/5",
    "review": "While this is not a perfect action movie it is pretty, darn good. I knew when I saw Tom Hardy had teamed with Gareth Evans for this Netflix action movie that it would goo; however, it is better than I anticipated. This is a wild story of police corruption, mob violence, and drug wars. Hardy is a dirty cop with a conscience and he is in a web between the police and the Tongs to save a corrupt politician's son from being executed for a mob boss's son's murder. The action is next level. The violence is plentiful. The characters are all damaged, and that makes them more realistic. The Direction and cinematography are great. The gritty, filthy streets are part of what makes this part of the Gareth Evans universe. I need to watch this again to see all the great action scenes. I lover Sunny Pang, from Headshot and The Night Comes For Us and he is great in this. My one pet peeve is that some of the action cinematography is too shaky for my taste."
  },
  {
    "rating": "0.5/5",
    "review": "For an actor I like this was not a good film. Poor acting throughout to many ai generated scenes just a mess of a film really. It will only do well because of the names of the cast and no doubt get bigged up by the people and the media who don't want to tell Mr Hardy the truth about it."
  },
  {
    "rating": "5/5",
    "review": "John Wick 10 🔥 🔥🔥🔥"
  },
  {
    "rating": "0.5/5",
    "review": "Big dissapointment. Lost interest a third of the way through the movie."
  },
  {
    "rating": "3.5/5",
    "review": "For a weekend watch that'll keep that high-octane feeling going, you absolutely have to check out. Give it a shot, it's a pure, unadulterated action."
  }
]