[
  {
    "rating": "0.5/5",
    "review": "The movie was great but the theater was the bad experience. I almost walked out because of the audience."
  },
  {
    "rating": "5/5",
    "review": "An excellent, original movie experience."
  },
  {
    "rating": "5/5",
    "review": "Many layers, great music and the storyline and acting was stellar."
  },
  {
    "rating": "0.5/5",
    "review": "I so wanted to like this movie but it was so hard to get into and to understand. We were so confused. Ive never left a movie but even after paying 40 to see it we left."
  },
  {
    "rating": "5/5",
    "review": "A truly unique masterpiece. Original story, amazing acting, shot wonderfully. My only regret is only seeing once in IMAX."
  },
  {
    "rating": "5/5",
    "review": "this movie is a love letter to music while being a trhiller movie and so many others genres"
  },
  {
    "rating": "5/5",
    "review": "the music was a transcendent experience. a love letter to period dramas, black music and horror."
  },
  {
    "rating": "5/5",
    "review": "The movie was outstanding"
  },
  {
    "rating": "5/5",
    "review": "Amazing story with incredible actors.!"
  },
  {
    "rating": "1.5/5",
    "review": "The music was easily the best part of the film. I'm having a hard time wrapping my head around the overly positive reviews on this film. The pacing is ABYSMAL, the plot build is nearly 2 hours long, and the story literally branches off in a million directions. I would advise that the movie is worth watching for the music alone, but outside of that I really don't get the hype."
  },
  {
    "rating": "5/5",
    "review": "Great editinggreat music( creative"
  },
  {
    "rating": "5/5",
    "review": "Awesome Movie and Soundtrack. Chefs kiss!"
  },
  {
    "rating": "4/5",
    "review": "Good movie. Liked the sex"
  },
  {
    "rating": "5/5",
    "review": "Great acting, music, concept, social theme - twists you dont expect and keeps you fully engaged. Need to see again!"
  },
  {
    "rating": "5/5",
    "review": "You HAVE to see this movie!!!!"
  },
  {
    "rating": "5/5",
    "review": "In Sinners, director Ryan Coogler and star Michael B. Jordan reunite to deliver what may be their most spiritually charged and politically urgent work to date. More than a film, Sinners is a mirror—boldly reflecting the buried traumas and enduring strength of Black America. Jordan’s performance is raw and riveting, carrying a generational weight that never feels forced. Coogler’s direction transforms symbolic imagery—baptismal water, fractured stained glass, the pulpit and the prison—into poetic language. Each frame breathes with historical memory and present-day urgency. Rather than spoon-feed its audience, Sinners trusts us to sit in discomfort and revelation. For Black viewers, especially, it speaks directly and powerfully: a cinematic sermon that interrogates systems of sin and survival. Coogler doesn’t just tell a story—he resurrects one. Without question, Sinners stands as one of the most meaningful cinematic achievements of the decade."
  },
  {
    "rating": "4/5",
    "review": "Culture Music Vampire"
  },
  {
    "rating": "5/5",
    "review": "second time watching it that 70mm worth it totally worth it, still a badass Vampire flick especially with that IMAX"
  },
  {
    "rating": "5/5",
    "review": "Incredible storytelling and beautiful cinematography. Go see it in 70mm!! Its beautiful to watch real film!"
  },
  {
    "rating": "5/5",
    "review": "This was a very good movie. Haven’t seen a great movie in a while. It flowed, made sense, and even though it was a #VampireMovie , the overall story & message was a #GreatVibe. I give it a 10/10"
  },
  {
    "rating": "5/5",
    "review": "Superb! Very well written and casted!"
  },
  {
    "rating": "5/5",
    "review": "Greatest movie in my lifetime. A classic."
  },
  {
    "rating": "5/5",
    "review": "Favorite part is when he killed the klansmen"
  },
  {
    "rating": "5/5",
    "review": "Second time seeing it in theatersblown away both times. Ready to go again. I have never seen a movie more than once in my life! The acting, the storytelling, the costume design and the music.there is just so much to love. Well done, Cooglers. Very well done."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed the Film . It was great movie to watch"
  },
  {
    "rating": "2/5",
    "review": "Very odd movie, made no sense"
  },
  {
    "rating": "5/5",
    "review": "Great movie!! Stay past the credits."
  },
  {
    "rating": "2.5/5",
    "review": "It is a good movie but as a born again Christian it definitely has some inappropriate elements in it. There are some scenes I did not enjoy as a Christian. If you watch this from a non biblical world view it is a very good film. With a biblical world view it is a good story but very very inappropriate."
  },
  {
    "rating": "5/5",
    "review": "New agr vampire movie but also set in post slavery times when African Americans still had to fight to be free and own property. It's about love and family and equality and standing up for what's right and fighting evil with all your might."
  },
  {
    "rating": "5/5",
    "review": "Great movie just got to pay attention to detail!"
  },
  {
    "rating": "5/5",
    "review": "10/10 Definitely one of the Top 10 Films of the year."
  },
  {
    "rating": "5/5",
    "review": "It’s a masterpiece of a movie. layers upon layers of metaphors"
  },
  {
    "rating": "5/5",
    "review": "Excellent casting. Great imagery connecting the past to present society challenges."
  },
  {
    "rating": "5/5",
    "review": "Ryan Coogler does an excellent job at blending different genres from a period piece to horror to thriller And borderline a musical. I have seen it twice already and got more out of it the second time around. Michael B Jordan does an excellent job at playing the twins. He made it so it was easy to distinguish the twins from each other from mannerisms. It is quite good to see Haley Steinfeld in a more mature role as she grows as an actress. I go back to the movie soundtrack constantly because that’s how much of a role the music played in the movie."
  },
  {
    "rating": "1/5",
    "review": "Meh. Boring and fell asleep 40 min in. Walked out during climax. 2/10"
  },
  {
    "rating": "5/5",
    "review": "Must see will see again."
  },
  {
    "rating": "1.5/5",
    "review": "From a Horror movie, it's a great movie, BUT as a Born Again Spirit-Filled Christian ii was NOT a Movie that was beneficial for Christians to Watch. Lots of things that are in CONFLICT with the Christian Life!"
  },
  {
    "rating": "1.5/5",
    "review": "Bots have taken over this service. This movie was incoherent and mind numbing. Great message, but lost in its poor storyline, and complete lack of character connectivity."
  },
  {
    "rating": "5/5",
    "review": "I loved every second of it!"
  },
  {
    "rating": "5/5",
    "review": "Great pace and execution. Thrilled to my satisfaction"
  },
  {
    "rating": "5/5",
    "review": "What a movie, I left wanting more. Music was amazing and story line was scientific. Loved the characters."
  },
  {
    "rating": "3.5/5",
    "review": "I thought the movie was overall a worth watching story and a new take on the vampire genre. However, I think the director took too many liberties with what we have know for years about vampires, their strengths and weakness, no way the twin would have been able to best his vampire twin as the vampire is always stronger than a human. I think the story took too long to get to the action and was very slow and dull, also there were many more vampires than humans by the end of the movie so how the player survived was just not very believable."
  },
  {
    "rating": "5/5",
    "review": "My city had one of only eight 70mm prints in the country. Gorgeously shot film, great experience seeing it. Pretty much full audience each time I saw it. Absolutely incredible."
  },
  {
    "rating": "0.5/5",
    "review": "It was very weird, gory and long. I would not recommend it."
  },
  {
    "rating": "5/5",
    "review": "Exceptional movie, so good and original"
  },
  {
    "rating": "5/5",
    "review": "really enjoyed this movie. it was exceptional work. not once was it a dull moment. kept me entertained the whole movie."
  },
  {
    "rating": "5/5",
    "review": "Loved it! Plenty of messages."
  },
  {
    "rating": "5/5",
    "review": "That was the best movie i’ve ever seen."
  },
  {
    "rating": "3.5/5",
    "review": "I feel like it was missing something…"
  },
  {
    "rating": "5/5",
    "review": "Everything about this movie is amazing!!👏🏾👏🏾👏🏾👏🏾 10 out of 10. Highly recommend."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie. Unique take on a classic horror movie monster. I loved the intersection of music, black culture, and horror."
  },
  {
    "rating": "5/5",
    "review": "It was a good watch it just took a little long to get to the point, but that's storytelling. I love the idea of the twins, and it' was funny and sad"
  },
  {
    "rating": "5/5",
    "review": "Great movie. 💯👍🏾👏🏾"
  },
  {
    "rating": "5/5",
    "review": "Incredible. Perfection."
  },
  {
    "rating": "5/5",
    "review": "Probably the best vampire movie I’ve ever seen in a long time"
  },
  {
    "rating": "5/5",
    "review": "Great writing and acting! This is my 2nd time seeing it and I plan on seeing it again."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie and storytelling. Was honestly 1 of the best movies I've seen in the past 10 years. Highly, highly recommend"
  },
  {
    "rating": "5/5",
    "review": "The movie was really good. It was movie that made you think. Michael B Jordan did a wonderful job."
  },
  {
    "rating": "5/5",
    "review": "So many visual messages. So good. It was giving “Rosewood + Dusk til Dawn” vibes. The all star cast bench was deep! Performances were outstanding and the soundtrack was perfect."
  },
  {
    "rating": "5/5",
    "review": "The best movie experience ever! I cant understand why marks are so low! Probably because they have too many black people for certain audiences! I have seen it three times already and will purchase as soon as it becomes available!"
  },
  {
    "rating": "5/5",
    "review": "great movie all around an great twist"
  },
  {
    "rating": "2/5",
    "review": "I just feel it was a little overrated"
  },
  {
    "rating": "5/5",
    "review": "I love the movie, it was great"
  },
  {
    "rating": "5/5",
    "review": "Casting was great! The storyline was unique and interesting. Micheal B Jordan was flawless as both Smoke and Stack. I’d watch it again!"
  },
  {
    "rating": "5/5",
    "review": "It’s a great story and that could be it but it also could be about community and power and messaging and sin and soul… I hope this gets some kind of Oscar recognition because there is so much to think about and so damn good! Also soundtrack like Oh brother where out thou where it is great and interwoven."
  },
  {
    "rating": "0.5/5",
    "review": "What in the Zimbabwe mushroom trip was this movie? DO NOT WASTE YOUR MONEY."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! Very intense and thought provoking. Great casting of the actors."
  },
  {
    "rating": "4.5/5",
    "review": "I loved every single bit of symbolism in this movie, the messages were clear and it actually didn’t feel like a gory horror movie i loved it"
  },
  {
    "rating": "5/5",
    "review": "One of the best movies that I have ever seen. Amazing writing and original storytelling alongside a beautiful soundtrack. Refreshing to watch in the sea of Hollywood remakes."
  },
  {
    "rating": "1/5",
    "review": "I totally disliked the Movie I liked nothing about the movie"
  },
  {
    "rating": "5/5",
    "review": "Atmosphere and just oozing it. This is not your typical horror or vampire movie. Its an incredibly well done period piece and just is awesome."
  },
  {
    "rating": "4/5",
    "review": "Sinners is a stylish, high-octane ride that injects fresh blood into the vampire genre. With slick action sequences, a genuinely original story, and a cast of compelling, well-drawn characters, this film stands out as a bold and entertaining addition to the supernatural action lineup. The fight choreography is a highlight—brutal, fast-paced, and beautifully shot. But what really elevates Sinners is its commitment to character. Each member of the ensemble feels distinct and layered, with motivations that make the drama hit just as hard as the violence. The world-building is sharp and creative, offering a new spin on vampire lore without feeling forced or gimmicky. There are a few pacing hiccups here and there, but overall the direction keeps things moving with confidence and energy. It’s stylish without being hollow, and fun without losing emotional stakes. A solid 4-star experience that proves there's still plenty of life left in the vampire genre when it's done right. Definitely worth a watch."
  },
  {
    "rating": "5/5",
    "review": "A highly inventive and visually stunning piece!"
  },
  {
    "rating": "5/5",
    "review": "Excellent vampire movie. The music was great. Good acting."
  },
  {
    "rating": "5/5",
    "review": "incredible. Great exposition, great history, loved the metaphors used about black culture in American History. the horror aspect was very cool and the action was satisfying and fun to watch. the character work and writing was phenomenal. Better than anything Disney is making these days."
  },
  {
    "rating": "5/5",
    "review": "This movie is amazing on so many different levels. Acting Michael B Jordan fantastic! Editing 5 Stars, cinematic masterpiece. Sound 5 Stars. Directing 5 Stars. See this movie in Imax to achieve the full impact."
  },
  {
    "rating": "5/5",
    "review": "Great movie, the culture, history, and music was beautifully represented."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie. I regret waiting so long to see it. Definitely gonna watch again."
  },
  {
    "rating": "5/5",
    "review": "What an outstanding film. With historical accuracy, great cinematography, music, sets, choreography, cast., the story of love and redemption was incredible!"
  },
  {
    "rating": "5/5",
    "review": "Wowza! Haven’t seen a horror movie this entertaining and well done in a LONG time. With movies like this, here box office —take my money."
  },
  {
    "rating": "5/5",
    "review": "Loved it would see again"
  },
  {
    "rating": "5/5",
    "review": "Very eye opening and draws your emotions in"
  },
  {
    "rating": "5/5",
    "review": "Great movie!! Hopefully we'll get a part 2!"
  },
  {
    "rating": "5/5",
    "review": "This is a really good movie! Saw 2 times will definitely see more and more. I always see things I didnt see or pick up on things I didnt."
  },
  {
    "rating": "5/5",
    "review": "Fantastic back-story, characters, and of course some horror thrown in. DON'T LEAVE THE MOVIE AT THE BEGINNING CREDITS ROLL, YOU WILL MISS A GREAT ENDING MONTAGE!"
  },
  {
    "rating": "0.5/5",
    "review": "Slow start, corny monologues, and then it turned into a ridiculous vampire movie. Can't for the life of me find that this movie had any value."
  },
  {
    "rating": "4.5/5",
    "review": "Amazing movie loved the story and production."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie! Surprises around every corner. Dont miss the end! Some people left the theater when the credits started."
  },
  {
    "rating": "5/5",
    "review": "IMAX experience is amazing...Loved this movie! Ryan Coogler is the best writer/directors today! Michael B Jordan dual portrayal is a master class in acting. Storyline is terrific and totally unexpected. I will see it again and again. Yes, people, it IS that good! Just go see it."
  },
  {
    "rating": "5/5",
    "review": "If you're already looking up the movie, I'm certain you already heard its praises - the best thing to do next is go in and enjoy a phenomenal film."
  },
  {
    "rating": "4.5/5",
    "review": "Like everything about the movie."
  },
  {
    "rating": "5/5",
    "review": "Originality and great acting."
  },
  {
    "rating": "1/5",
    "review": "Movie is very slow and predictable. Plus the old southern American accent is really difficult to understand. Oh yes, I did give up when all the vampires started dancing Irish music."
  },
  {
    "rating": "4.5/5",
    "review": "Enjoyed the film very well made fantastic music"
  },
  {
    "rating": "4.5/5",
    "review": "One scene in particular was great! Overall the movie was very good/excellent. It starts off as a work of historical fiction set against the terror and indignity of the Jim Crow south before becoming a bit of a more conventional horror film. As always Coogler solicits great performances from his cast and layers social and political commentary into the narrative in ways that are apparent on the surface and as well as nuanced in allegories."
  },
  {
    "rating": "5/5",
    "review": "The movie was great and interesting. The cast was brilliant especially Michael B. Jorden he is really a great actor. It’s worth seeing in theaters. 👍❤️😀"
  },
  {
    "rating": "5/5",
    "review": "Love it! Went in with zero knowledge of the plot and was blown away!"
  },
  {
    "rating": "1/5",
    "review": "Fandango app is scammers customer service is soo poor do not buy raward membership with them you will loose your money and they not will fix your problem never! Since Wednesday I try to buy ticket over Fandango app and over Fandango website but I guess the problem is only with my account and Fandango doesn’t care! I loose my points and money! I have code for free movie and oh no I can’t use it. I buy with cards that had money but the message keep saying : “ Sorry, we were unable to process your order. You have not been charged for this transaction. Please try your order again. Try My Order Again and I’ve called to customer service since Wednesday and I send them screenshot from app and they never fix it and even shut phone off. So do not buy anything over Fandango you’re risking!!!!"
  },
  {
    "rating": "5/5",
    "review": "This was a fantastic movie. Many different genres. Not as scared as you may have been led to believe but thats a good thing. The story is much deeper than horror. Its really about family"
  },
  {
    "rating": "5/5",
    "review": "Didn’t expect it to be so good 👌🏽✨"
  },
  {
    "rating": "2.5/5",
    "review": "at the beginning it was slow but right at the middle part things got interesting."
  },
  {
    "rating": "5/5",
    "review": "The whole movie was wonderfully done. I've seen it a few times in theaters, and I always notice something I didn't see before. it's a really great movie."
  },
  {
    "rating": "5/5",
    "review": "Even if youre not a fan of monster movies, give this film a watch. Its more about the power of music. And a lot of things. The monsters are a sideshow representing other things. A masterpiece."
  },
  {
    "rating": "1/5",
    "review": "Overhyped for no reason."
  },
  {
    "rating": "5/5",
    "review": "The realness the thrill loved it!!!"
  },
  {
    "rating": "5/5",
    "review": "Absolutely 5 stars. Beautiful made and beautifully shot. No notes."
  },
  {
    "rating": "5/5",
    "review": "IMAX Experience is cool, but regular theater experience would be just fine."
  },
  {
    "rating": "5/5",
    "review": "It was a blended genres that delivered a wonderful dish of culture, scenery, and sound. These elements combined made this movie great."
  },
  {
    "rating": "5/5",
    "review": "Best movie of the year"
  },
  {
    "rating": "5/5",
    "review": "Great movie! awesome effects!"
  },
  {
    "rating": "5/5",
    "review": "Best movie I’ve seen"
  },
  {
    "rating": "5/5",
    "review": "I really liked the theater and the ambience. The people were all very polite and had minimal-to-no-talking. Jacob did a great job of introducing the movie and the IMAX/70mm technology, and thank you Dick for flying in from England! My only complaints was that the sound was a little quiet and that the film was a little dim, but those could just be me unaccustomed to 70mm film (it was my first time seeing it). There were also a few dust/specks flying down the screen towards the end of the movie, but I also think its part of the technology. Thanks for having such a cool theater and screen available to the public!"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie it's definitely a must watch!"
  },
  {
    "rating": "5/5",
    "review": "This film was brilliant!! The story telling, link to history as well as a different spin on the vampire genre!!! Definitely a must see!!"
  },
  {
    "rating": "5/5",
    "review": "Entertaining throughout. Solid character development . Make sure you stay past the initial credits!"
  },
  {
    "rating": "5/5",
    "review": "Loved it. Great to see my culture represented and others included."
  },
  {
    "rating": "5/5",
    "review": "This movie was Crossroads meets from Dusk till Dawn and some Gladiator. I found the folkloric roots being shown into the story. I love this movie."
  },
  {
    "rating": "5/5",
    "review": "amazing!! Great movie definitely would watch this again!"
  },
  {
    "rating": "5/5",
    "review": "Watching The Sinners in a 70mm theater was nothing short of extraordinary. The format brought every frame to life with breathtaking clarity and depth—an experience that completely pulled me into the world of the film. The story was gripping from start to finish, layered with emotional depth, suspense, and unexpected turns. Each moment felt intentional and powerful. The acting was phenomenal—every performance felt raw, real, and deeply human. The cast delivered with intensity and subtlety, making it easy to connect with the characters on every level. It wasn’t just a movie—it was an experience. Seeing it in 70mm elevated every scene, every emotion, and every nuance of this beautifully told story. I walked out feeling moved, stunned, and grateful for the ride. Absolutely unforgettable."
  },
  {
    "rating": "5/5",
    "review": "I loved everything about this movie. Michael B Jordan was amazing as twins. I love the Era it was portrayed in. I could go on and on. I was awesome. Definitely one of my favorite movies of all times"
  },
  {
    "rating": "5/5",
    "review": "2nd time watching it! Amazing🥳"
  },
  {
    "rating": "5/5",
    "review": "Wonderful! It was refreshing to go see a film that was not about heroes or hype just a really good story that left me thinking about the nuances of the symbolism days later. Brilliant."
  },
  {
    "rating": "5/5",
    "review": "Great film. Make sure to listen to the soundtrack and the score. Both are great. This was my 5th showing and 4th in imax 70mm. Actually buying another ticket now lol."
  },
  {
    "rating": "4.5/5",
    "review": "Everything about it is heat"
  },
  {
    "rating": "4.5/5",
    "review": "After the 1st 1/4 of the film and a finishing off a large soda, I needed to “use it.” BUT spent the entire last 3/4’s of the film “holding it” because I didn’t want to miss a second!!"
  },
  {
    "rating": "2/5",
    "review": "unrewarding, unhethical .. and not very smart from a point forward"
  },
  {
    "rating": "2/5",
    "review": "Way too weird to figure out. Plot is twisted and just too much violence with no purpose. I can’t believe it got these ratings."
  },
  {
    "rating": "5/5",
    "review": "Absolutely loved it!"
  },
  {
    "rating": "4/5",
    "review": "Entertaining movie with good quality production and descent storyline. Musical part could have been done with more time as Miles Catons voice is so good."
  },
  {
    "rating": "1.5/5",
    "review": "Boring and predictable, zero storyline."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I’ve seen in years. Visually engaging, musically enraptured, and emotionally intense, the time flew by. Heads Up: Don’t leave until the credits end!"
  },
  {
    "rating": "5/5",
    "review": "The movie was packed with so many messages I have to watch it again. Great job."
  },
  {
    "rating": "5/5",
    "review": "Loved every piece of this movie. The acting, the story, the writing, the music. It takes you on a journey of love, hope and resilience. Truly a must see"
  },
  {
    "rating": "5/5",
    "review": "Great movie, however horrible theater experience"
  },
  {
    "rating": "5/5",
    "review": "Very good movie. Loved the story"
  },
  {
    "rating": "5/5",
    "review": "Thrilling and unpredictable script with phenomenal acting"
  },
  {
    "rating": "0.5/5",
    "review": "This is the most crazy difference between what the audience thought about the movie and what I thought about it. I watched it based on the reviews and the ratings but left the moving shaking my head and wincing in pain. What a TERRIBLE TERRIBLE TERRIBLE movie, why people thought “that” was amazing I don’t know! 🤯 I just came here to see if I can save some people time with this review, good luck!!"
  },
  {
    "rating": "4/5",
    "review": "Interesting and intriguing with a little unexpected ending"
  },
  {
    "rating": "5/5",
    "review": "Beautiful, artistic, funny, and tragically sad. And I LOVE a flawed Michael B Jordan. Especially 2 of them. A layered masterpiece you must see more than once to absorb it all."
  },
  {
    "rating": "4/5",
    "review": "Love all the actors and actress who did there parts was some scary scenes in movie but it was good overall."
  },
  {
    "rating": "5/5",
    "review": "My Review - Sinners (Excellent) Before I forget ***STAY FOR THE CREDITS*** You will think there will be no more. Trust me. There is. You will get 15 more minutes worth of movie which could be an opening for a Sinners 2. A lot of people walked out and missed it. Now on to the review. I haven’t seen movie reviews this good in a long time. You would think this movie will be a catalyst for world peace the way reviewers were talking. I went in skeptical because 99.9% of the time they are wrong. Well, this is the .1% they are correct. Visually stunning, well acted (Michael B. Jordan plays dual roles as the Smokestack twins and actually does it well), an original storyline and a killer soundtrack if you like blues music. The first act of the film is in no hurry to get to the second act. It’s when characters are introduced before heading towards the part of the movie you are waiting for. It’s necessary for the viewer to actually develop feelings for the characters. The movie merges the past, present, and future through music. In today’s political climate some may have problems with the honest portrayal of black history and its reality. It’s a shame I have to bring it up. Reviewers say this is the best movie of the year. I have to agree and I will raise it. This movie is an epic masterpiece and will be a classic. Oh yeah…. and there are vampires. Get your tickets now. This movie deserves to have Barbie numbers in ticket sales and I will be watching!"
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I’ve seen in a long time"
  },
  {
    "rating": "5/5",
    "review": "Casting was phenomenal! Music was inspiring! Concept was gripping! Lots of layers to unfold."
  },
  {
    "rating": "5/5",
    "review": "Such a great movie, would definitely watch it again"
  },
  {
    "rating": "5/5",
    "review": "This movie was AMAZING!!!!"
  },
  {
    "rating": "5/5",
    "review": "This is the BEST Film of the last ten years. Such a great performance from the actors and great writing and directing from Ryan Coogler"
  },
  {
    "rating": "5/5",
    "review": "Real movies are back"
  },
  {
    "rating": "5/5",
    "review": "The movie was excellent…"
  },
  {
    "rating": "0.5/5",
    "review": "More boring than watching a tadpole grow legs."
  },
  {
    "rating": "5/5",
    "review": "Great.. Movie Of the Year category!! A True classic in the making"
  },
  {
    "rating": "5/5",
    "review": "Best movie I’ve seen in YEARS!!!!"
  },
  {
    "rating": "1.5/5",
    "review": "Was very cheesy to me."
  },
  {
    "rating": "2/5",
    "review": "It was more a musical movie"
  },
  {
    "rating": "3/5",
    "review": "Filming Michael b Jordan from 2 angles was great editing- not what we expected.. not for young teens .."
  },
  {
    "rating": "1/5",
    "review": "Not understanding the high reviews. The movie has a few different plots that could have been the focus. I kept waiting to see vampires for the first hour. Ha! If it was purely a vampire movie, it would’ve been more satisfying, instead of plodding along with the brothers and cousin until the last 30 minutes. The music was good, however."
  },
  {
    "rating": "5/5",
    "review": "Great acting! Storyline has great meaning."
  },
  {
    "rating": "5/5",
    "review": "Amazing moving ! From beginning to end!"
  },
  {
    "rating": "5/5",
    "review": "Fantastic movie! The acting, the story, the music and culture! Stay for the after credit scene, so worth it!"
  },
  {
    "rating": "5/5",
    "review": "Cinematic masterpiece!"
  },
  {
    "rating": "5/5",
    "review": "This movie has be staying up late making connections and questioning life. It also has the best villian I ever seen. Love the diverse cast that made me want to actually learn about history in the 30s and think about religion."
  },
  {
    "rating": "5/5",
    "review": "A one-of-a-kind soft horror movie. Its main vampire is a monster to fear, but even more so, a mirror reflecting the long, frightening history of evils experienced across cultures around the world. With poetic cinematography, a chillingly beautiful score, and nuanced performances, it’s less about what makes you scream and more about what lingers. A must-watch for those who love or hate horror. This movie has soul, meaning, and a hypnotic, dreamlike quality."
  },
  {
    "rating": "5/5",
    "review": "Very well made movie. I’ve seen it twice and it’s especially good the second time when you understand hidden meanings. There’s a lot of well written culture and history in this movie as well that help capture its own story."
  },
  {
    "rating": "5/5",
    "review": "loved every bit of it ! didnt expect certain parts!!! music was amazing & it felt like home while watching it"
  },
  {
    "rating": "4.5/5",
    "review": "Omg! This is a fascinating film that kept me at the edge of my seat the entire movie. Definitely a must see at IMAX theaters."
  },
  {
    "rating": "4/5",
    "review": "The acting of Michael P Jordan, Delroy Lindo, Wunmi Mosaku and Miles Canton amongst others, are exceptional."
  },
  {
    "rating": "4/5",
    "review": "Loved the music! Saddle up because this movie will take you on a ride you never expected! Its a bluesy horror show you didnt know you needed."
  },
  {
    "rating": "5/5",
    "review": "I really like the movie The story 10/10 Acting10/10 The message 10/10 The director did his thang!!!!"
  },
  {
    "rating": "5/5",
    "review": "Everyone must see this film. I have nothing negative to see about this movie"
  },
  {
    "rating": "5/5",
    "review": "Great and powerful acting! Ryan, did it again! Keep them coming sir. Great work!"
  },
  {
    "rating": "5/5",
    "review": "Enjoyed the movie from beginning to end!"
  },
  {
    "rating": "5/5",
    "review": "Is an absolute must see"
  },
  {
    "rating": "4/5",
    "review": "Great movie, great actors. I just dont care for vampire movies"
  },
  {
    "rating": "5/5",
    "review": "Unbelievable movie, great acting, great storyline and unreal Production."
  },
  {
    "rating": "3.5/5",
    "review": "I enjoyed the movie sinners it is definitely worth a watch. I didn't understand what was going on until towards the end, and then it all made sense. A little bit of a horror flick mixed in with a little bit of a little bit revenge"
  },
  {
    "rating": "5/5",
    "review": "Was The Best Movie Ive Watched Ever I Loved It And I Need Another One Please Yall Did Your Big One On This Movie And Im Soo Proud Of Yall Keep Doing What You Are Doing Best Movie Soo Far This Year Had Me In Tears"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie, i love it"
  },
  {
    "rating": "4/5",
    "review": "It was a twist i wasnt expecting. Definitely a enjoyable. Had a thrilling twist with some dark humor. Would of gave 5 stars but the plot was plain."
  },
  {
    "rating": "5/5",
    "review": "Amazing! Second watch."
  },
  {
    "rating": "4/5",
    "review": "Overall, a great time at the theater. Minus one star for the 10-15 minutes that could have been left to the directors cut on 4K blue ray."
  },
  {
    "rating": "5/5",
    "review": "As a fan of vampires, I really enjoyed this!!!"
  },
  {
    "rating": "5/5",
    "review": "Suspenseful and even funny . I want to see again. I loved the music too"
  },
  {
    "rating": "5/5",
    "review": "An amazing storyline, with great characters, overall amazing!!!"
  },
  {
    "rating": "5/5",
    "review": "This movie has LAYERS. Coogler and Jordan expertly lead a contained epic story that encompasses religion, historical, economic and supernatural applications and themes. The script makes no apologies, and has slight moments of heavy handed expositionnothing enough to disrupt the flow or take the viewer out of the experience. Thats what this movie was: an experience. A fully engrossing experience with characters that have far more depth than initially perceived. Go with an open mind and leave with a full but aching heart."
  },
  {
    "rating": "5/5",
    "review": "Masterpiece, everything about this movie was absolute perfection."
  },
  {
    "rating": "5/5",
    "review": "Literally the best movie I’ve seen in a LONG time and I NEVER go to the movies. If this doesn’t get an Oscar I stg."
  },
  {
    "rating": "5/5",
    "review": "GREAT WRITING and DIRECTING!!!!!!!"
  },
  {
    "rating": "4/5",
    "review": "Really enjoyed this movie. Lot's of Dusk Till Dawn vibes. Story and acting was quite good, definitely worth going to see."
  },
  {
    "rating": "5/5",
    "review": "If you haven’t seen it , GO SEE IT! If you have seen it , see it again!"
  },
  {
    "rating": "5/5",
    "review": "Incredible movie. Best movie I’ve seen this year."
  },
  {
    "rating": "5/5",
    "review": "Excellent movie - just perfect timing for the current climate."
  },
  {
    "rating": "5/5",
    "review": "The movie was a great movie with an intriguing story line !!"
  },
  {
    "rating": "4/5",
    "review": "Really good film. Michael B Jordan playing twins gave a great performance, and Haley Stansfield did a wonderful job. The movie was fast paced, entertaining and suspenseful."
  },
  {
    "rating": "1.5/5",
    "review": "Much ado about nothing. Despite the good acting, special effects and music, the movie offers little else of interest. It aimed high but achieved low with a boring story about vampires."
  },
  {
    "rating": "1/5",
    "review": "Tf was this garbage."
  },
  {
    "rating": "5/5",
    "review": "Loved everything about this movie. I’m definitely going to watch it again"
  },
  {
    "rating": "5/5",
    "review": "Amazing film! The best movie of 2025 thus far and one of the best movies I’ve seen this decade. Ryan Coogler is so assured with this film - his writing and direction are top-notch. The film’s score is amazing and the performances are perfect. Michael B. Jordan gives, IMO, the best performance of his career. I also enjoyed newcomer Miles Caton’s performance. I’ve seen the film 4x’s and have absolutely each viewing. And, I feel like I’ve learned something new about the film each time. Lastly, seeing it IMAX70mm is well worth it. I totally get why Mr. Coogler wants everyone to experience it this way - it is MIND BLOWING! overall - 10/10, A+, two thumbs up and any other superlatives you can use to express how amazing Sinners is. Salute to everyone involved in bringing it to us AND THANK YOU. 🙏🏾 GO. SEE. IT. 🫡"
  },
  {
    "rating": "5/5",
    "review": "This movie was a 10/10!!! I went to see this movie three times since the release of it. The storytelling, the music, the characters all of it was amazing. I can’t wait to get this movie on DVD!🤎"
  },
  {
    "rating": "5/5",
    "review": "Awesome music, great acting, fantastic story and script! Intense!!!"
  },
  {
    "rating": "5/5",
    "review": "Excellent movie and performance Gets into black history on a excellent spin"
  },
  {
    "rating": "1.5/5",
    "review": "I can’t believe this movie has this high of rating. Acting is good but it’s an awful vampire movie."
  },
  {
    "rating": "4/5",
    "review": "We enjoyed it but don’t understand the movi"
  },
  {
    "rating": "5/5",
    "review": "From the start, you begin wondering what the hell is going on. Through the telling of music and dialogue, this comes alive. Great one liners. Michael, hailee and many others deliver powerful performances."
  },
  {
    "rating": "5/5",
    "review": "Amazing- make sure to stay through the credits!"
  },
  {
    "rating": "5/5",
    "review": "THIS IS CINEMA. WATCH IT. AND WATCH IT AGAIN. MOVIES ARE BACK! The music scene is why we have Directors and actors and composers on the same wave length. Goosebumps on god."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie! Very original in its approach."
  },
  {
    "rating": "5/5",
    "review": "One of the greatest original movies of the past 10 years. Top 5."
  },
  {
    "rating": "5/5",
    "review": "EXCELLENT storytelling by a brilliant cast."
  },
  {
    "rating": "5/5",
    "review": "I loved the softness and sharp image contrast, And the immersive sound beats all other sound formats, giving a well balanced listening experience. the 70mm experience truly couldn’t be beat!! Of course the originality and beauty within the story carried a majority of the beauty of it all!!! Must see!!"
  },
  {
    "rating": "5/5",
    "review": "Well done. Enthralling and def showcased some excellent blues music. Wish we could have had more of a backstory on Remmick, but hopefully Mr. Coogler might entertain making a movie about him as a stand alone."
  },
  {
    "rating": "5/5",
    "review": "The lines in this movie were crazy"
  },
  {
    "rating": "5/5",
    "review": "Loved everything about it"
  },
  {
    "rating": "3.5/5",
    "review": "Was blown away by the soundtrack for this movie. The music and sound editing alone make this movie worth the watch in theaters. The acting by Michael B Jordan and Delroy Lindo is also some of the best in the movie, but the entire cast did a great job overall. I’m all for originality so I really appreciate Ryan Coogler’s vision for this movie and the story he crafted. Though I wish there had been a little more action in the movie or that some of the scenes had lasted longer, I still enjoyed the film."
  },
  {
    "rating": "5/5",
    "review": "Sinners não é apenas um filme — é um mergulho na alma humana. Uma obra que questiona, incomoda e, acima de tudo, deixa uma marca. Para quem aprecia histórias intensas, com personagens imperfeitos e tramas cheias de camadas, Sinners é um acerto certeiro."
  },
  {
    "rating": "3/5",
    "review": "First half introduced really well written characters that I feel gets thrown away for pure action in the second."
  },
  {
    "rating": "5/5",
    "review": "Walked into this movie with high expectations, and it blew even those out of the water. Best movie I’ve seen in the last year, hands down."
  },
  {
    "rating": "3/5",
    "review": "2 bank robber brothers killing vampires at a bar. Seen this in 1996 and it was called From Dusk Til Dawn by Quentin Tarantino."
  },
  {
    "rating": "1/5",
    "review": "One of the most aimless movies I’ve ever seen, too much of trying to be stylish and simultaneously not focusing on the substance"
  },
  {
    "rating": "5/5",
    "review": "Don’t miss this one! Outstanding!!👏🏼👏🏼👏🏼👏🏼"
  },
  {
    "rating": "5/5",
    "review": "This was a very powerful film!!!"
  },
  {
    "rating": "5/5",
    "review": "the theater was great, and the movie was excellent"
  },
  {
    "rating": "2/5",
    "review": "What an overhyped movie. A good example of how PR and marketing can create buzz where there shouldn't such a fuzz about it"
  },
  {
    "rating": "5/5",
    "review": "i liked everything about this movie. i would watch it 4 times if i could :)"
  },
  {
    "rating": "2/5",
    "review": "This was a strange watch. The storyline and character development felt patchy- really thorough in some cases and massive gaps in others. For example if you’re going to make the opening seem like the whole movie is centred around Preachers special ability why barely address this in the film? The musical scene that tried to depict this was a good start but not enough to walk away with a clear understanding. I still don’t really get what his special ability was other than the literal dialogue. Could have been a larger part of the plot line. I feel like the slow build up of suspense was lacking for a film classified as thriller/horror. The first 2/3 of the movie felt like a meaningful timepiece drama and the final 3rd felt like it was an entirely different film. The vampires themselves felt more like satire than actual feared characters. Especially the twin. He was too likeable and familiar as someone meant to be feared. More work needed to be done to break down all of the rapport we built with him through out the film before trying to make us see him as a villain. The automation of the weapons/ modernisation of the gun violence felt out of place for the period. The use of electric guitar scores in crucial moments also fits with the above. Didn’t feel like it fit in for the time period. Plus the closing KKK scene felt like a desperate attempt to draw deeper meaning at the end. Instead just came off as a stereotypical shoot out scene trying to wear the dress of a deeper message. Overall poorly done. Foundations were there but fell massively short and all of the raving reviews make me wonder if we watched the same film."
  },
  {
    "rating": "5/5",
    "review": "I went into the movie, blind, not knowing what to expect. I don’t know if I would have gone if I heard people describe it as being about vampires. It is SOOO much more than that!! The writing and acting is excellent. The symbolisms still have me pondering aspects of the movie. Well done!!"
  },
  {
    "rating": "2/5",
    "review": "The first 30 minutes and last 20 minutes or more were the worst. Just wasn’t a good movie. There were some African Americans that became excited when he mowed down like 20 KKK members at the end. It was a strange movie and strange experience. Not sure what the themes were. The story line obviously sucked and my wife said it was all over the place. I liked the music and the vampires though. Two stars for those aspects."
  },
  {
    "rating": "5/5",
    "review": "An original film with depth, humor, lessons, and soul. Everyone who had a hand in bringing this to life deserves all the accolades, attention, and applause they are sure to receive."
  },
  {
    "rating": "4/5",
    "review": "Os irmãos gêmeos Smoke e Stack retornam à sua cidade natal, depois de um tempo em Chicago. Eles resolvem abrir um clube de blues para a comunidade negra local, porém um mal mais antigo está à espreita. Ryan Coogler está se tornando uma das vozes negras mais potentes no cinema americano. Depois de continuar a franquia Rocky, criando uma nova com o filho do Apolo Creed e fazer um dos melhores filmes de super-heróis, apresentando o Pantera Negra, dando um grande destaque a ele, Coogler nos traz um filme de vampiros, mas com uma leitura social extremamente importante. Aqui ele retorna aos anos 30. O mundo tinha saído de uma guerra, mas logo entraria em outra. Sementes começavam a ser plantadas referentes aos direitos negros em uma região extremamente preconceituosa e atrasada. O clube dos irmãos Smoke e Stack é um lugar de celebração da cultura negra, como na cena mais famosa do filme, onde o personagem de Miles Caton se apresenta e se torna um griô, abrindo portas para o passado e futuro, onde a música e a dança se misturam em épocas e estilos diferentes. Mas também a cultura asiática é homenageada. Já é uma das cenas mais belas e fortes desse ano. Mas além de ser um local de celebração, é um local de resistência. Os vampiros representam não somente a ameaça àquele grupo de pessoas, mas também uma ameaça à liberdade que eles construíram naquele lugar, naquela noite. É muito interessante fazer uma relação entre a tradição que um vampiro tem que receber a permissão do dono da casa para poder entrar e os negros não terem o direito de entrar em todos os lugares. Ou de haver lugares separados para eles. E ao serem mordidos e transformados em vampiros, os negros perdiam sua identidade, tornando-se um só com o personagem de Jack O'Connell, como na cena onde uma roda se forma em torno dele e todos cantam aquela canção irlandesa, como se falasse a todos eles igual. Outro ponto extremamente positivo é a trilha sonora e as canções se encaixam perfeitamente bem, quase tornando o filme um musical, onde blues, country e canções tradicionais se misturam, unindo-se nos seus pontos comuns. Além do estilo de Coogler ser bastante perceptível, é claro que conseguimos ver influências de Spike Lee, Quentin Tarantino e Jordan Peele. O interessante é que o filme ocorre em um único dia, da compra da serraria pelos gêmeos, até o nascer do outro dia. Apenas um dia pode ser fugaz, mas aqui foi eterno. Parabéns, Ryan Coogler."
  },
  {
    "rating": "5/5",
    "review": "So many nuggets to draw from this movie. So many messages."
  },
  {
    "rating": "5/5",
    "review": "First half hour of the movie was a slow buildup but helped you get to know all the characters which I enjoyed, but once the action picked up I was on the edge of my seat the entire time. The ending was great and I wasn’t expecting the mid and post credit scenes, overall a 8.5/10 experience, would recommend to more people"
  },
  {
    "rating": "0.5/5",
    "review": "Pretty terrible movie. All the thing things si liked were in the for set half with no vamps could have a lot less plot holes"
  },
  {
    "rating": "4/5",
    "review": "The ending unraveled a very well-told tale. Great music and sfx, beautifully shot. Just... the ending felt inconsistent."
  },
  {
    "rating": "5/5",
    "review": "Every little nook and cranny of this was black excellence"
  },
  {
    "rating": "5/5",
    "review": "A masterclass in filmmaking, Sinners is somehow dark, sexy, thrilling, intense, emotional, intriguing, captivating, and terrifying all at once"
  },
  {
    "rating": "5/5",
    "review": "An incredible cinematic collaboration that combines engaging storyline, strong ensemble performances, great soundtrack, historical accuracy and layers upon layers of symbolic relevance!"
  },
  {
    "rating": "4.5/5",
    "review": "The movie isn’t 10 out of 10 material like most reviews but to me cinematography is beautiful. The messages was beautiful just the history behind. It was beautiful. I think the weakest part of the film was the vampire aspect, but I understand what it was for. I saw three times in total so in a horror movie aspect I would rate this in eight out of 10 from a film view a 9 so my rating in conclusion will be 8.5 out of 10 this film will definitely be a historic film hopefully we can get more contact with a future franchise"
  },
  {
    "rating": "5/5",
    "review": "This film is a masterpiece for the ages."
  },
  {
    "rating": "5/5",
    "review": "A stellar diverse cast, moving performances, captivating visuals, an infectious soundtrack and powerful societal messages wrap up to make one of the most filling and engaging films to come out in horror - and in general - for a long time."
  },
  {
    "rating": "5/5",
    "review": "A must see on IMAX, worth every penny. Story, cinematography, music, acting, and anything in between amazing. Picture of the Year."
  },
  {
    "rating": "5/5",
    "review": "Extremely well written and extremely good cinematography !"
  },
  {
    "rating": "4/5",
    "review": "I enjoyed what I watched. There's a spiritual message behind it but all I can say that it is on another level and I would see it again because I have missed out on some parts leaving in and out of theater."
  },
  {
    "rating": "5/5",
    "review": "Sinners is a work of art that makes music the focal point of the storytelling. Ryan Coogler and his team chose the right actors to bring this story to life. I've seen in four times in theaters."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies Ive seen in a long time. Original. Interesting. Excellent acting. Beautiful scenes. The directing was top notch. Wonderfully woven backstory."
  },
  {
    "rating": "1/5",
    "review": "I absolutely hated this film. It was boring, hard to follow and not interesting in the least. I was glad when it was over. Grade F"
  },
  {
    "rating": "4/5",
    "review": "The movie was good just didn’t like the imax effect on this movie, too dark and blurry"
  },
  {
    "rating": "5/5",
    "review": "Best movie of the year hands down. It looked amazing and the acting was a ten."
  },
  {
    "rating": "5/5",
    "review": "Excellent story telling and visual storytelling. Classic."
  },
  {
    "rating": "5/5",
    "review": "Ryan Coogler beautifully blends immigrant cultures in this absolute masterpiece of a movie, to tell a phenomenal story with meaning behind every scene."
  },
  {
    "rating": "5/5",
    "review": "This movie is phenomenal. I love how it captures the details of the time while telling an awesome horror story. Definitely buying it when released.!"
  },
  {
    "rating": "5/5",
    "review": "One of the greatest movies of all time. The entire cast was outstanding and Michael B. Jordan deserves an academy award."
  },
  {
    "rating": "3.5/5",
    "review": "Went to the matinée showing, had a few people in my theater and still had great reactions to this movie. It was funny, action packed (once it got going) - only draw back was it was 2+ hours for a vampire movie! Still had a fun time. Can’t wait to rewatch from the couch"
  },
  {
    "rating": "5/5",
    "review": "70mm IMAX. One of a kind experience. Great movie too."
  },
  {
    "rating": "5/5",
    "review": "You have to watch it, no words honestly. Such a generational treasure"
  },
  {
    "rating": "5/5",
    "review": "Sinners was excellent. Loved all of it. The acting, the story, the music. So good."
  },
  {
    "rating": "5/5",
    "review": "\"Sinners\" is the best Vampire Symbolism flick since \"Ganja and Hess\"! I've seen \"Sinners\" twice already and I'll be seeing it again with family this weekend; I wish I could see it in IMAX format. I plan to buy the DVD because I like to own GEMS🌟‼️"
  },
  {
    "rating": "5/5",
    "review": "Great film, there’s not a lot of good vampire movies. So it was refreshing to see a change in pace"
  },
  {
    "rating": "5/5",
    "review": "Great original story great watch"
  },
  {
    "rating": "4.5/5",
    "review": "My new favourite thing is going to the movies by myself. My girlfriends would never go to this movie. It had all my favourite things from Vampires, blood and gore, unrequited love, spirituality, voodoo, racial injustice, a killer soundtrack, great acting and to top it all off a cameo from my favourite bluesman of all time. Buddy Guy. Loved it."
  },
  {
    "rating": "5/5",
    "review": "Seeing this film in IMAX, the way it was meant to be experienced, is not to be missed."
  },
  {
    "rating": "5/5",
    "review": "Excellent experience and a great movie."
  },
  {
    "rating": "5/5",
    "review": "Very well done, it was a great story."
  },
  {
    "rating": "5/5",
    "review": "Great story, I am a bigger fan of Michael B Jordan now. Everything was done well."
  },
  {
    "rating": "5/5",
    "review": "I love the message of this movie."
  },
  {
    "rating": "5/5",
    "review": "Phenomenal movie! Loved it! Definitely seeing it again in theaters 🍿"
  },
  {
    "rating": "5/5",
    "review": "The acting, the story, and symbolism were outstanding!"
  },
  {
    "rating": "3/5",
    "review": "Felt like an adult twilight."
  },
  {
    "rating": "4/5",
    "review": "This shows that you CAN make a movie that is a hodgepodge of several ideas and themes, but still make it heart felt and entertaining. Most directors fail when putting so many ideas and characters into a story, but this is not the case - Kudos to Coogler."
  },
  {
    "rating": "3/5",
    "review": "The music and the culture portrayed in the film is solid and enjoyable but the story overall seemed very shallow. The actors did amazing when playing their roll but unless you’re paying 100% attention you miss a lot of the backstory behind the characters."
  },
  {
    "rating": "5/5",
    "review": "A masterpiece full of music, soul, history, action, romance, and just enough gore to not feel gratuitous! This story stays with you long after the movie is finished. Plus, I've seen it in theaters 3 times without ever getting bored (you can catch new brilliant details on every rewatch)! BRAVO RYAN COOGLER!! 👏🏼👏🏼"
  },
  {
    "rating": "5/5",
    "review": "I loved everything about this movie! From the casting to the storytelling Ryan Coogler didn't miss. I'm only on my 3rd trip to see this phenomenal work of art."
  },
  {
    "rating": "4/5",
    "review": "Different take on the subject of Vampire Movies. Like the music/culture asspects."
  },
  {
    "rating": "5/5",
    "review": "It was different and there was a lot to unpack but I enjoyed it and will probably come see it again."
  },
  {
    "rating": "5/5",
    "review": "My conservative parents loved this… how do I tell them they aren’t as conservative as they think they are"
  },
  {
    "rating": "5/5",
    "review": "This movie should really be 100% Rotten Tomatoes this is absolutely 1 of the best movie's I've ever seen. The way the music speaks to the soul and the spirit the way they speak of our ancestors is amazing it takes a brilliant mind and a excellent cast to film such a great movie."
  },
  {
    "rating": "5/5",
    "review": "Loved it. Michael B. playing the double roles was impressive."
  },
  {
    "rating": "5/5",
    "review": "Good pace, music, & back story"
  },
  {
    "rating": "5/5",
    "review": "Simply put, perfectly done!"
  },
  {
    "rating": "5/5",
    "review": "Amazing film, big fan of Coogler and the actors in this. Had to see it twice and plan to see it many more times."
  },
  {
    "rating": "4/5",
    "review": "I am an absolute sucker for art horror with social commentary. Love how this movie works both on the surface and underneath. Also, that one scene? Incredible."
  },
  {
    "rating": "5/5",
    "review": "Sinners was amazing, it really moved me. I loved everything about it including the music, \"I lied to you\" performed by Sammie brought me to tears. The entire cast is phenomenal!!"
  },
  {
    "rating": "5/5",
    "review": "It was a great cinematic experience!"
  },
  {
    "rating": "5/5",
    "review": "Full of essential metaphors re the Black Experience in America"
  },
  {
    "rating": "5/5",
    "review": "Sinners was an absolute Masterpiece. There was so much said and the story-telling was done in a fantastic way. The music was probably one of my favorite aspects to the whole experience. Already have plans to see it again."
  },
  {
    "rating": "5/5",
    "review": "I loved the social commentary aspect of an older Bommer/X generation vs younger groups."
  },
  {
    "rating": "3.5/5",
    "review": "The first half of the movie was very good. The second half, not so much. I was surprised it went in that direction, there was so much more that could have been done."
  },
  {
    "rating": "1.5/5",
    "review": "Hit and miss.. and miss again"
  },
  {
    "rating": "3/5",
    "review": "I know I'm going against the majority here, but I thought the build up to this movie was way too slow. I did like the back half of the movie however."
  },
  {
    "rating": "5/5",
    "review": "Thoughtful and entertaining. Good acting throughout."
  },
  {
    "rating": "5/5",
    "review": "it is a movie about The Blues. About love. Love for your sibling. Love for your partner. Love for your family. Love for God. And love for The Blues"
  },
  {
    "rating": "5/5",
    "review": "Best movie I’ve seen in a long time. Captivating from beginning to end. The use of music and storytelling was executed in such a wonderful way. it’s been weeks since I watched it and still find myself thinking about it and wanting to watch it again. This movie will go down in film history."
  },
  {
    "rating": "5/5",
    "review": "The culture. The lessons. The cast. The talent. Pure excellence and and a great experience!"
  },
  {
    "rating": "5/5",
    "review": "Phenomenal film!!! I plan to see it. 3-4 times."
  },
  {
    "rating": "4.5/5",
    "review": "With a stacked cast, amazing music, and genius film overall, this film takes a new light on classic vampires in its time period"
  },
  {
    "rating": "4/5",
    "review": "Wow. Left the movie almost speechless. Best movie Ive seen start to finish this year. Kept waiting for it to screw up but it did not. MBJ puts on one hell of a performance. Make sure to stay seated even as the credits roll."
  },
  {
    "rating": "5/5",
    "review": "Beautiful movie with a great story plot. Would see a 3rd time"
  },
  {
    "rating": "3/5",
    "review": "Good movie not my type of movie."
  },
  {
    "rating": "5/5",
    "review": "Wow just came out the theaters this is my favorite Micheal b Jordan Movie this has to be one of the best movies I ever seen masterpiece ryan coogley knocked it out of the park with this one"
  },
  {
    "rating": "4/5",
    "review": "Very good movie other then the one weird scene"
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed this movie! The storyline, the connection to the past, present & future. The music. The scary moments! It was different in a good way!"
  },
  {
    "rating": "5/5",
    "review": "Great movie, had me thinking to answer my questions"
  },
  {
    "rating": "5/5",
    "review": "This was a great story. Actors were so good."
  },
  {
    "rating": "5/5",
    "review": "AMAZING symbolism !!!"
  },
  {
    "rating": "1/5",
    "review": "Inaudible and extremely difficult to comprehend speech. The accent is heavy and seems overdone, please ensure the actors speak loud and clear or at least add subtitles. I know the goal is to be authentic but not at the cost of the movie experience."
  },
  {
    "rating": "5/5",
    "review": "Absolutely stunning movie!"
  },
  {
    "rating": "5/5",
    "review": "Most amazing movie ever"
  },
  {
    "rating": "5/5",
    "review": "Super entertaining and will keep you on the edge of your seat!"
  },
  {
    "rating": "5/5",
    "review": "At was an amazing experience the soundtrack made it more enjoyable"
  },
  {
    "rating": "5/5",
    "review": "I've seen this film 5 times and could watch it 5 more. What a masterpiece! Phenomenal 👌🏿"
  },
  {
    "rating": "5/5",
    "review": "The story was great. Everything was amazing. The music, the action."
  },
  {
    "rating": "5/5",
    "review": "I have not in many a year seen a movie as layered as artistic or as entertaining as this one. Ryan Coogler somehow seamlessly interwove history, racial politics, southern folklore, and reconstruction religion, into a vampire movie that was not only beautifully shot but had you on the edge of your seat. The final act was also a wonderful and unexpected turn. I wish I could go back with virgin eyes to see this again for the first time. An awesome, awesome film."
  },
  {
    "rating": "5/5",
    "review": "incredible. one of the best movies I've seen this year."
  },
  {
    "rating": "4/5",
    "review": "The portrayal of music and cultures. Also Hallie steinfield."
  },
  {
    "rating": "5/5",
    "review": "Absolutely EXCELLENT! If any movie deserves an Oscar this year it’s this one. Especially for the music, incredible incredible music"
  },
  {
    "rating": "5/5",
    "review": "Loved the music very good cast great movie"
  },
  {
    "rating": "2.5/5",
    "review": "It was ok , kinda all over the place"
  },
  {
    "rating": "5/5",
    "review": "Acting- 10/10 Storyline- 10/10 Soundtrack- 10/10"
  },
  {
    "rating": "5/5",
    "review": "Best. Bravo. A classic. I will see it 5 more times. Two is not enough"
  },
  {
    "rating": "5/5",
    "review": "Not too scary after all, and SOOO well written! Would love to see it again on imax!"
  },
  {
    "rating": "5/5",
    "review": "awesome movie. Kept me on the edge of my seat. Lots of action and suspense."
  },
  {
    "rating": "5/5",
    "review": "The story was captivating and gripping throughout the entire movie."
  },
  {
    "rating": "5/5",
    "review": "Movie of the year. The backstory, the character development, casting all perfection."
  },
  {
    "rating": "4.5/5",
    "review": "Great movie with good plot."
  },
  {
    "rating": "5/5",
    "review": "I have never written a review on any movie and I have watched A LOT of movies. This is a special one. The music, the story, the characters! It delivers in so many unexpected ways - 10/10! You HAVE to see it!!!!!!"
  },
  {
    "rating": "4.5/5",
    "review": "Wow, this movie has pretty much everything I was expecting and more. The writing, acting, cinematography, even the lighting stood out. But the music is the mvp here. I wad expecting more tension and I very much believe that there are moments that would have hit harder if the trailers hadn't shown them, which is a little annoying. I also don't think movie has a lot of rewatches in it for me which also marks it down a bit but definitely keen to watch it once or twice more"
  },
  {
    "rating": "5/5",
    "review": "If you like horror films, this movie is an absolute Must see! from start to finish! very entertaining!"
  },
  {
    "rating": "4/5",
    "review": "Fascinating film with many layers. Superb production (esp the long dancing sequence that spans the ages). Only 4 stars since it went a little too long. Some things could have been cut."
  },
  {
    "rating": "5/5",
    "review": "Taken off guard, was not expecting the outcome. Enjoy the movie."
  },
  {
    "rating": "5/5",
    "review": "The story line, the production, the music, that acting, every thing is spot on amazing. This is a must see for any one who loves thrilling and spine chilling movies."
  },
  {
    "rating": "5/5",
    "review": "Amazing in every single possible way- see it on the screen like it was meant to be seen- then obsess over the soundtrack from home"
  },
  {
    "rating": "5/5",
    "review": "An absolutely amazing movie!!! It hit so many different aspects of emotion! The music was amazing and the acting on point as well!"
  },
  {
    "rating": "4/5",
    "review": "Good, unique movie! Wish it was alittle scarier! But great movie."
  },
  {
    "rating": "5/5",
    "review": "Perfection in 2 hours and 17 minutes"
  },
  {
    "rating": "2/5",
    "review": "Not very exciting, slow burn that never really burns."
  },
  {
    "rating": "5/5",
    "review": "If I could have given it 10 stars I would! Beautifully shot, music was an experience on its own. Superbly casted! Instant classic!"
  },
  {
    "rating": "4/5",
    "review": "Not what I expected but a good movie"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie with accurate historical details. Will definitely watch again."
  },
  {
    "rating": "5/5",
    "review": "One of if not the best movie of 2025. This movie is a must watch. with the story and the visuals you will come out loving this movie."
  },
  {
    "rating": "3.5/5",
    "review": "Not a fan of the song and dance monologues."
  },
  {
    "rating": "5/5",
    "review": "I like how it explores different religious themes, while keeping the BLACK HISTORY within America in the story, tying it back to the blues, which ties to African history. A must see film!!"
  },
  {
    "rating": "5/5",
    "review": "Posso garantir que este é dos melhores filmes deste ano, do género. Com certeza irá concorrer ao Oscar 👍🏾"
  },
  {
    "rating": "5/5",
    "review": "Unique takes on the classic vampire and crossroads tales. Plenty of action and easy enough to choose sides."
  },
  {
    "rating": "3.5/5",
    "review": "The movie was fine - felt like a musical for a while"
  },
  {
    "rating": "5/5",
    "review": "Love, love, love this movie. Saw it twice."
  },
  {
    "rating": "5/5",
    "review": "very well made different vampire movie I love it!!"
  },
  {
    "rating": "3.5/5",
    "review": "This film was good, better than expected. Needed more backstory as to the characters and the villain. Music was good as well as the casting and acting."
  },
  {
    "rating": "5/5",
    "review": "Savoury and sensational. A southern gothic like no other."
  },
  {
    "rating": "5/5",
    "review": "SINNERS blew my head off... a slow rhythmic burn that drums to its own beat that moves you into a blood-thirsty frenzy with notes that rip a hole through your soul as it takes you back to the ancestors, the ancients and catapults you into a devastating reality. Forgive us. We sin. Ryan Coogler is a genius... Let there be more."
  },
  {
    "rating": "5/5",
    "review": "Love love love this movie"
  },
  {
    "rating": "5/5",
    "review": "I am not someone who enjoys watching movies more than once, but I saw this last week and am considering paying to see it again. LOVE the soundtrack and overall production"
  },
  {
    "rating": "3/5",
    "review": "Im sure I missed all of the subtle and not so subtle symbolism. The dance scenes were fantastic. The music was amazing. The acting was great. Michis ael B Jordan is fantastic as always. The supporting cast also fantastic. Didnt really understand a lot of the stuff thrown in. Im sure Im not the only person. Its definitely thought-provoking though."
  },
  {
    "rating": "4.5/5",
    "review": "Love the history, vampires and everything else. Great movie."
  },
  {
    "rating": "2/5",
    "review": "Overall acting was terrific, but I have no idea what this movie was about. A mumbo jumbo series of scenes totally disjointed with no consistent meaning of continuity. A 1932 dance hall scene of black dancers are all of a sudden intertwined with a weird set of dancers with modern day masks and costumes...huh? It's 1932 and all of a sudden someone is using modern day weaponry. Maybe I'm not cool but I didn't understand a word they were saying. I'm not sure who was the intended audience for this movie."
  },
  {
    "rating": "2/5",
    "review": "Mixing all different genres into one pile of dogshit."
  },
  {
    "rating": "5/5",
    "review": "A masterpiece of a movie. It was terrifying, sexy, gory and funny. This movie is easily the greatest movie ever made and deserves to be seen!"
  },
  {
    "rating": "4/5",
    "review": "Like From Dusk til Dawn… I liked it before the vampires came in lol"
  },
  {
    "rating": "5/5",
    "review": "This film was beautifully original. The story grabs you instantly by drawing you into the depths of each character. The entire thing was exciting to witness."
  },
  {
    "rating": "3/5",
    "review": "It got very confusing."
  },
  {
    "rating": "5/5",
    "review": "Great depth! I need to see this again, as I am sure I missed some things."
  },
  {
    "rating": "0.5/5",
    "review": "Starts off so slow and ends so fast that it feels rushed. Stick to 2 genres to fuse well, not 7."
  },
  {
    "rating": "5/5",
    "review": "I rate this movie in the same category as The Shining, Poltergeist, and the Birds. It starts out slow, and builds to an explosive finish. Stay until you see the final logo for both trailers (they tie up some loose ends, and maybe set the stage for a sequel)"
  },
  {
    "rating": "5/5",
    "review": "Incredible. Will be going back to see again. So thoughtful and unique. Respects the genre and the audience and is clearly driven by passion and vision from the filmmaker. A completely immersive, layered experience."
  },
  {
    "rating": "5/5",
    "review": "May just boost the film industry. Havent had a reason to go to the movies in years! This is what people want to see. Culture shifting!"
  },
  {
    "rating": "5/5",
    "review": "Amazing, absolutely. The music is amazing, and the plot/story fantastic, it has now became one of my favorite movies."
  },
  {
    "rating": "2.5/5",
    "review": "Several slow parts especially in the beginning but picked up later. Unnecessary infidelity. Disappointed with racial divide."
  },
  {
    "rating": "4.5/5",
    "review": "Great vampire film with beautiful visuals and stunning cinematography, layered and violent in each of its delightful twists."
  },
  {
    "rating": "3/5",
    "review": "what a mess. but a watchable movie just the same. like a talented kid in film school got a 100 million dollars to make a movie."
  },
  {
    "rating": "4.5/5",
    "review": "Movie is the best musical, comedy drama vampire horror me and my wife have ever seen. The soundtrack is amazing, the movie has great feel and was entertaining the entire way through. See it on a big screen with the best sound you can find. For us it Bucket list and we will probably go see it again. 5 out 5 vampires and all the tomatoes you can eat like a Vampire would. Side note: It is 137 minutes long so I did subtract half a star. Stay past the first set of credits. There is a hidden scene."
  },
  {
    "rating": "5/5",
    "review": "This movie was a drama masterpiece told in a very classical way."
  },
  {
    "rating": "5/5",
    "review": "A pretty perfect movie. Very mature themes, so definitely a hard R (IMO). However, extremely well written, beautifully directed, and an exceptionally talented cast. I plan to see it a couple more times in theaters."
  },
  {
    "rating": "5/5",
    "review": "Lived up to the hype !!!!!!! PHENOMENAL storytelling!!!!!"
  },
  {
    "rating": "5/5",
    "review": "I can watch this movie over and over again. Love it 100/10"
  },
  {
    "rating": "4.5/5",
    "review": "Great movie, good acting. Full disclaimer: no heads get chopped off."
  },
  {
    "rating": "5/5",
    "review": "Amazing movie, amazing story and it has all of genre in this movie."
  },
  {
    "rating": "5/5",
    "review": "Great movie with a fresh idea. Not just recycled content from the 1990’s. I would say the best movie I have seen in a long time."
  },
  {
    "rating": "5/5",
    "review": "The movie was very interesting and entertaining to watch"
  },
  {
    "rating": "1/5",
    "review": "Es un jodido musical y su nivel de violencia es muy malo no la recomiendo pa eso mejor verlo el joker 2 WB cada día más en caida"
  },
  {
    "rating": "5/5",
    "review": "This is one of the best movies I've seen in years! The strong black southern cultural ties and spirituality are so beautifully represented here. Coogler teamed up with his longterm collaborator Ludwig Goransson who delivers another unforgettable score. The music basically serves as its own character and is an essential aspect of the story. There is a single-shot scene which depicts Sammie performing on his guitar during opening night at the juke joint (yes, THAT scene... iykyk) that is truly jaw-dropping. It currently lives rent-free in my mind. Coogler is a genius. Period. Throughout the movie, Coogler follows classic vampires rules (Thank God) and delivers some genuine jump scares along the way. However, the vampires are not just scary, but also fun and interesting. The end of the movie serves a conclusion that is both satisfying and heart-warming for these unforgettable characters. And those of us who still crave the Marvel-esc mid and end-credits scenes will be delighted with the end of this movie. Go see it in theaters! This is a must-see."
  },
  {
    "rating": "5/5",
    "review": "Movie was excellent, I would definitely watch and plan on seeing it again ."
  },
  {
    "rating": "5/5",
    "review": "Unexpectedly Good as 🤬Listen I was toon all the way in ..start to Finish , I definitely will watch this Movie again"
  },
  {
    "rating": "5/5",
    "review": "Exciting movie, good story, i was on edge most of the movie"
  },
  {
    "rating": "5/5",
    "review": "it's good. unpredictable. surprising. good story. horror and adventure for sure. nicely done. it was so good the 2:15 hours went by too fast. definitely a must watch!!!!"
  },
  {
    "rating": "5/5",
    "review": "This movie is SOOO good! Best movie I've seen in YEARS. Saw it twice in the theaters and STILL wanna go back. The performances, the music, the story, the history, the culture.. Just superb. This is a movie that everyone should see!"
  },
  {
    "rating": "2/5",
    "review": "This film is a mess. Don't believe the hype. A horror film that's not scary, a bluesy film that barely brings the blues and movie about brothers that we never really get to know. Coogler's writing and directing here is misses the bullseye. In fact, it misses the whole dartboard."
  },
  {
    "rating": "5/5",
    "review": "Absolutely amazing. Great soundtrack, beautifully shot, great movie The trailer is bullshit, the movie was AMAZING"
  },
  {
    "rating": "5/5",
    "review": "You just have to see it for yourself! It's amazing!"
  },
  {
    "rating": "5/5",
    "review": "this was my third time trying to see Sinners after the first time my seat was taken and the second time I got sick. and it was 100% worth the wait. I cannot wait to buy it to add to my collection"
  },
  {
    "rating": "1.5/5",
    "review": "Couldn’t follow the story but great actors."
  },
  {
    "rating": "5/5",
    "review": "It doesn't really get better than this. Michael B Jordan gives a very strong performance playing both Smoke and Stack. Strong supporting actors that add depth to the story. The music is incredible with scenes that are truly unique. Very much worth the watch."
  },
  {
    "rating": "5/5",
    "review": "Good lord if you love vampires and southern music I am IMPLORING you to watch it. I am no longer asking I’m begging."
  },
  {
    "rating": "5/5",
    "review": "Phenomenal movie absolutely perfect!!"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Great depiction of when you let the enemy in and how many doors it opens to unwanted desires and experiences."
  },
  {
    "rating": "5/5",
    "review": "There could be triggers for some, so be aware of that. Im still thinking about this movie though, after a week. Having trouble finding the words to describe the complexity. There was so much symbolism in it and it was just extremely well done in such an original way. Truly profound if you choose to really dig in. But if you want pure entertainment its good for that too. Quite an accomplishment all around."
  },
  {
    "rating": "5/5",
    "review": "Absolutely one of the best movies I’ve seen. This is my third time watching it and it gets better and better!! Ryan Coogler is a genius, the way all of the themes tie together and all of the music. The cast did amazing!!!"
  },
  {
    "rating": "5/5",
    "review": "I was skeptical at first, but this movie did NOT disappoint. The metaphors throughout the movie, the cast, the storyline. Such a great movie about the black community. A movie worth re watching"
  },
  {
    "rating": "5/5",
    "review": "Amazing movie! I went to go see it a second time."
  },
  {
    "rating": "5/5",
    "review": "Best movie I’ve seen in years"
  },
  {
    "rating": "5/5",
    "review": "Iconic Movie, Ryan Coogler & Michael B. Jordan can do no wrong, everyone in the movie played the hell out of their roles."
  },
  {
    "rating": "5/5",
    "review": "Sinners was one of the best movies I have seen in a long while besides wakanda. I absolutely love this movie. I am going to see it again and have it in my catalog when it comes out on CD"
  },
  {
    "rating": "5/5",
    "review": "Absolutely stunning way to show history, important part of the culture and a really good storytelling experience with a great cast"
  },
  {
    "rating": "5/5",
    "review": "A return to form for vampire flicks, breathtaking."
  },
  {
    "rating": "1/5",
    "review": "why were we playing call of duty zombie mode..?"
  },
  {
    "rating": "3/5",
    "review": "Too much satanic behavior"
  },
  {
    "rating": "5/5",
    "review": "I LOVED the movie. The meaning is sooooo deep and spiritual."
  },
  {
    "rating": "4/5",
    "review": "Coogler continues to deliver. Michael B. Jordan's best performance from start to finish. Jordan was on full throttle for this one."
  },
  {
    "rating": "5/5",
    "review": "Loved every second of it"
  },
  {
    "rating": "5/5",
    "review": "Great movie! Well done even around the vampires A few jump out of your seat moments and great soundtrack"
  },
  {
    "rating": "1/5",
    "review": "Not sure why this movie got so much hype. Disappointing. The theme was good, this movie COULD have been good, but the plot was absent. Left the theatre not knowing what I just watched. The whole movie seemed like it had no message or point…"
  },
  {
    "rating": "5/5",
    "review": "Acting, dialog, action and depiction of the early 1900’s"
  },
  {
    "rating": "4/5",
    "review": "Cinematography was stunning and the music fantastic! A must see because of the performances."
  },
  {
    "rating": "5/5",
    "review": "Instantly in my Top 5 all-time films."
  },
  {
    "rating": "5/5",
    "review": "Amazing! Words dont do it justice."
  },
  {
    "rating": "3.5/5",
    "review": "I like the movie I thought it was very complete in terms of storytelling. I wish I would have dove into the backstory of the main antagonist, a little bit more, but all in all I think the movie was well put together and the acting was actually very good. It’s nice to have a refreshing movie Since the last few movies I have come out this year have been subpar. All in all, better than Mickey 17 haahhahaha"
  },
  {
    "rating": "3/5",
    "review": "Cinematography was good but the soundtrack drowned out the dialogue with strange thunder and higher volume than the voices. We left 40 minutes in."
  },
  {
    "rating": "5/5",
    "review": "One of the best movies I ever seen"
  },
  {
    "rating": "5/5",
    "review": "Awesome movie. Must see again!!!"
  },
  {
    "rating": "5/5",
    "review": "Very exciting movie. I loved the ending"
  },
  {
    "rating": "5/5",
    "review": "You forget Michael B Jordan is playing two characters he does such a good job. And the music? Top 5-10 movies of all time for me"
  },
  {
    "rating": "5/5",
    "review": "My Daughter and I just got home from our local movie 🎬 and let me tell you I was so impressed by this movie and how well it was portrayed and after watching I understand the hype. Best Movie out. All the actors and actresses deserve all the awards out there."
  },
  {
    "rating": "5/5",
    "review": "Multiple plots, twists and turns!! Keep me on the edge of my seat!"
  },
  {
    "rating": "4/5",
    "review": "Another Ryan Cooglar masterpiece. Beautiful visuals, deep themes and allegory with a fantastic score. Most importantly, very entertaining."
  },
  {
    "rating": "5/5",
    "review": "It had all the things. Blood gore, fact,fiction. Like"
  },
  {
    "rating": "5/5",
    "review": "Excellent plot and compelling characters."
  },
  {
    "rating": "0.5/5",
    "review": "Not good… Charley Patton… BLAH!!!"
  },
  {
    "rating": "4/5",
    "review": "I thought it was a little slow starting, but it picked up. Yes indeed , A very good movie,"
  },
  {
    "rating": "3/5",
    "review": "This film has many interesting elements that were only middlingly executed in my opinion. For example, the intergenerational/intercultural dance hall scene was a lovely concept, but I thought the implementation was noisy both visually and auditorily in a way that turned an opportunity for a powerful moment into mush. It also defined a sort of spiritual power in the verse that never really went anywhere. Although I wouldn't consider myself a blues fan, the music in this film was fantastic. Last, I'll note that this film is a victim of common pitfalls in horror movies -- the underpowered protagonists are written into a corner multiple times where there is no believable route for survival and the assaulting antagonists turn tail and run or monologue for no reason. Combat choreography was nonsensical, bordering on laughably bad at times, and the conclusion to the fight against the \"big bad\" didn't make a lick of sense."
  },
  {
    "rating": "5/5",
    "review": "All around awesome movie!!"
  },
  {
    "rating": "4/5",
    "review": "I did not like the ending of the movie."
  },
  {
    "rating": "3/5",
    "review": "I liked to storyline and historical music connections. I feel that they glanced over the real history of the Delta Blues. The musical parts were excellent. I felt that many the vampire scenes were overly gratuitous."
  },
  {
    "rating": "2/5",
    "review": "It was a roller coaster, where things in the beginning felt stiff and out of sorts; staged and seemingly overrehearst. It didn't resonate. Some, almost most , of the music didn't fit the period either, coming years later. Most folks wouldn't though I do know who Charlie Patton was and the legend of Robert Johnson who it is said sold his soul to the Devil. There was another scene with the cloggers that made me laugh [no spoilers], which I don't think was the intended effect. When it descended into Vampire lore, it got much better. I am a musician and so appreciated the film on a different level. 'The Blues' is a well-spring, one of the mothers of music.This at times felt like a homage to that.. It was a nice touch adding Buddy Guy at the end..There is another movie.. The Honey Dripper.. another juke joint, starring Danny Glover."
  },
  {
    "rating": "5/5",
    "review": "Very good story and measage"
  },
  {
    "rating": "5/5",
    "review": "As someone who absolutely loves a good vampire movie I was not disappointed. I found the vampires to very charismatic. I found myself wanting to join them. Remove the vampires and you still have a compelling story. Ryan Coogler did a fantastic job with the cinematography and the music was perfect. It was giving John Williams perfection. The cast was perfect. This is definitely a rewatchable."
  },
  {
    "rating": "5/5",
    "review": "Well written and well acted."
  },
  {
    "rating": "3.5/5",
    "review": "This is a different kind of movie. We saw a story about Blues music. We saw a story about vampires and we saw a movie that was more a musical. The music was good but then I noticed a story that says white folks are bad. I was confused going through the whole movie. The vampire part was pretty good but I came for a vampire movie. There were some different kinds of styles. Lots out of place for the sceens. Over all it was a decent movie. Very long movie."
  },
  {
    "rating": "4/5",
    "review": "Fun flick. Different than expected but good!"
  },
  {
    "rating": "5/5",
    "review": "Excellent cinematography and direction"
  },
  {
    "rating": "4.5/5",
    "review": "A film much better than I thought it was going to be. There were a couple very odd scenes, and that is saying something given the story but a great film."
  },
  {
    "rating": "4.5/5",
    "review": "The movie was well put together, as well as the acting by the cast. The movie gave me some anxiety due to the nature of the movie and my faith."
  },
  {
    "rating": "2.5/5",
    "review": "I love vampire movies and after reading the reviews, I thought this was going to be really good. It was just so-so to me. Very slow to get moving and some of the blood effects looked very low budget. The music was good, but I'm glad I saw it on discount day. Would have been disappointed to have paid full price."
  },
  {
    "rating": "5/5",
    "review": "So deep and so different!!! I wanted to yell BRAVO in the middle od the movie like I'm in theatre 👏👏👏👏👏"
  },
  {
    "rating": "5/5",
    "review": "really like it very action packed eyes on the screen the whole time"
  },
  {
    "rating": "5/5",
    "review": "Must see. Incredible writing with amazing cinematography."
  },
  {
    "rating": "5/5",
    "review": "The movie was fire. MBJ and the cast was amazing. Great performance."
  },
  {
    "rating": "5/5",
    "review": "absolutely phenomenal"
  },
  {
    "rating": "3.5/5",
    "review": "It was a action packed movie that kept my attrition. I liked the fact that it was a scary movie that was not real scary."
  },
  {
    "rating": "5/5",
    "review": "LOVE THIS! Saw it 5 times!"
  },
  {
    "rating": "5/5",
    "review": "This is a must see in IMAX"
  },
  {
    "rating": "5/5",
    "review": "Brilliant all around. Stick around for the mid-credits scene."
  },
  {
    "rating": "4/5",
    "review": "Enjoyed the movie,but IMAX is the way to go for this movie."
  },
  {
    "rating": "5/5",
    "review": "I enjoyed almost every moment of this movie, especially the ending. Make sure to stay through to the very end, I almost left after the initial credit roll and would've missed a great ending scene. Loved Buddy Guy."
  },
  {
    "rating": "5/5",
    "review": "The best of the year!"
  },
  {
    "rating": "5/5",
    "review": "Very original and needs more work on blood. A little unrealistic. New twists were appetizer for more."
  },
  {
    "rating": "5/5",
    "review": "Just a must see and the hoodoo practitioner is top tier"
  },
  {
    "rating": "5/5",
    "review": "Many historic references in the underlying theme."
  },
  {
    "rating": "5/5",
    "review": "Great story and visuals. Its a different spin on a horror film which I love because I havent seen a really good horror film in some time."
  },
  {
    "rating": "3.5/5",
    "review": "It was an interesting movie and entertaining"
  },
  {
    "rating": "5/5",
    "review": "This movie was absolutely phenomenal! If there were 10 stars I would give it that! This movie had horror and music and love and emotions! Michael B. Jordan was so good in this role and right after getting out I wanted to buy another ticket and watch it again! So good! Must see!"
  },
  {
    "rating": "4.5/5",
    "review": "Great film, beautfiul components of lost culture, pain, redemption and longing to regain what was taken from the weak by the powerful. I wouldve liked for the movie to be a bit longer to give room to explore more of these things, for instance, flash backs into stack and smokes childhood wouldve been cool. Also one for Remmick and his origins too."
  },
  {
    "rating": "5/5",
    "review": "I really enjoyed the movie. It exceeded my expectations."
  },
  {
    "rating": "0.5/5",
    "review": "This movie could have been so good. The culture, music and back story were great. He went so wrong w/the over use of gore. Terrible job of editing and vampire integration. I left the theatre."
  },
  {
    "rating": "5/5",
    "review": "Very entertaining. Very good cast of actors. MBJ playing identical twins with 2 distinct personalities was an amazing thing to see. Keeps you on the edge of your seat."
  },
  {
    "rating": "5/5",
    "review": "I love this movie so much , 10/10"
  },
  {
    "rating": "5/5",
    "review": "Great movie. Kept my attention the entire time."
  },
  {
    "rating": "1.5/5",
    "review": "Not a great storyline and acting is subpar at best."
  },
  {
    "rating": "5/5",
    "review": "The movie was fantastic. The storyline was tight and move along flawlessly. I have changed my mind about Michael B. Jordan he is a good actor on his way to greatness, if he keeps developing. The supporting cast could not have been better. The film took an aging theme and gave it new life. The music score is award worthy and lifted the movie to new heights. Please go see it, Please"
  },
  {
    "rating": "3/5",
    "review": "Its was ok.. lil weird though"
  },
  {
    "rating": "2/5",
    "review": "Jack O’connoll was the best thing about this movie. Very confused film, don’t quite understand the meaning behind it. Also the first hour was excruciatingly dull and kinda pointless and very slow. However it did liven up. I also thought the acting wasn’t great, didn’t seem authentic but for Jack. Not enough music!! I personally don’t understand the great reviews. Very surprising."
  },
  {
    "rating": "5/5",
    "review": "AMAZINGGGGGGGGGGGG!!! 1000/10"
  },
  {
    "rating": "5/5",
    "review": "Suspense, spontaneous, superb acting and great cinematics"
  },
  {
    "rating": "3/5",
    "review": "It's was good...but nothing like I expected..."
  },
  {
    "rating": "5/5",
    "review": "Excellent! Suspense, acting, story line—husband and I both loved it"
  },
  {
    "rating": "5/5",
    "review": "This movie is undeniable proof that Coogler would absolutely cook with a Blade movie."
  },
  {
    "rating": "5/5",
    "review": "absolutely loved this movie. The acting, the historical reference, the music, and the scares. I'm exhausted from being on the edge of my seat. I am a little late seeing the movie and was not disappointed. Believe the hype!"
  },
  {
    "rating": "5/5",
    "review": "Storyline, actors, all did a great job. Didn't what to expect. Great movie!"
  },
  {
    "rating": "2/5",
    "review": "I thought I was going to a movie about Delta Blues and the old story about Robert Johnson selling his soul to the devil at the Crossroads. This ain’t that. I did enjoy the 5 minute ending with a great Blues icon."
  },
  {
    "rating": "4.5/5",
    "review": "This movie is great all around. I had the impression that it would be a more serious and scary flick from watching the trailer, but it's actually very fun and funny, and it goes beyond that. I loved the cast, and got to care a lot about the characters, which added mucht to the tension. The movie is not afraid to spell out it's message and goes very intense, and isn't shy to be silly or even trashy at some moments. Overall it was a nice experience watching it. What keeps this movie from being perfect is that the tone of the movie is all over the place, sometimes is too serious and sometimes too silly, maybe more consistency on this aspect would make it more cohesive and help suspend the disbelief a bit more."
  },
  {
    "rating": "5/5",
    "review": "Loved the all-star cast. The movie moved along quickly and the storyline was good. Plenty of surprises and a very unexpected ending!! Would watch it again."
  },
  {
    "rating": "5/5",
    "review": "It's been a long time since I saw a movie that just absolutely had me start to finish. Everything about it was compelling and riveting. Sinners may also have the absolute best mid credits scene of any movie I've ever seen. It's not an ending, begining, or teaser. It simply just needed to be there."
  },
  {
    "rating": "5/5",
    "review": "If you love vampires and good music this is for you . Let’s make vampires scary once more ! This movie will keep you on your toes !"
  },
  {
    "rating": "4.5/5",
    "review": "I really enjoyed it!! I don’t really like horror movies, and this wasn’t super scary. The characters were interesting and the acting was great."
  },
  {
    "rating": "5/5",
    "review": "Loved it! MBJ played an amazing duo character role. This movie had deep historical meaning that many of us did not know. It did not seem like a 2hr 17min movie at all. Didn’t want it to end. Stay after all credits are over for bonus scenes. Will see this movie again!"
  },
  {
    "rating": "5/5",
    "review": "10/10. Go see it in theathers!!"
  },
  {
    "rating": "0.5/5",
    "review": "Sinners starts with a bang—and ends in a baffling, tuneless whimper. At first, the movie sets up what could have been a gritty, compelling crime drama. We’re introduced to a cast of morally grey gangsters with rich backstories and stylish direction that hints at something special. The cinematography is slick, the pacing tight, and the tension real. For the first 45 minutes, Sinners seems like a hidden gem. Then it crashes—hard. Seemingly out of nowhere, the film takes a sharp, unearned left turn into a full-blown vampire musical, complete with fanged jazz hands and lip-synced blood ballads. The shift in genre isn’t clever or bold—it’s chaotic and confusing. Characters who were once nuanced criminals are suddenly breaking into poorly written songs about eternal damnation and heartbreak in dimly lit nightclubs. It’s as if The Godfather had a baby with High School Musical—but left the script unfinished. The most frustrating part? The original plot is simply abandoned. Key storylines are never resolved, and several characters just vanish without explanation. It’s clear that either the writers lost control, or a completely different script was stapled on in post-production. There’s potential buried somewhere in Sinners, but it’s drowned in fake blood, pitchy vocals, and baffling creative choices. Unless you enjoy watching a promising movie derail into an incoherent musical fever dream, this one is best left in the crypt."
  },
  {
    "rating": "4/5",
    "review": "Great movie I'm glad I went to see it at the theater instead of waiting to stream. Just left me wanting for more lore."
  },
  {
    "rating": "0.5/5",
    "review": "This movie is extremely overrated. It needs to be labeled as a musical. It might be the worst movie you will see in your lifetime."
  },
  {
    "rating": "5/5",
    "review": "Awesome film Michael b Jordan and Ryan cogler are the modern day deniro and Scorsese if you haven’t seen this your in for a real treat"
  },
  {
    "rating": "1/5",
    "review": "So boring it took 2 hours to get to the worst vampire fight I ever seen"
  },
  {
    "rating": "4/5",
    "review": "I want to say I loved it, but it was just something I cant quite explain that I feel was missing in the story line. Im going to have to watch it again to see."
  },
  {
    "rating": "5/5",
    "review": "A masterpiece! This movie will be studied, celebrated, and appreciated for years to come!"
  },
  {
    "rating": "5/5",
    "review": "Loved this movie it means so much more than vampires"
  },
  {
    "rating": "5/5",
    "review": "Wow. What a great a movie. Mixing music, history and supernatural."
  },
  {
    "rating": "0.5/5",
    "review": "Negative stars. Most hideous movie we have ever seen. Left offend."
  },
  {
    "rating": "5/5",
    "review": "Complete, thorough storytelling and movie making. Exciting plot, wonderfully talented cast and director. Best movie of the year. This is a unique moment in time."
  },
  {
    "rating": "2.5/5",
    "review": "Loved the acting but sammie wasn’t given alot of screen time considering he’s the main character."
  },
  {
    "rating": "3.5/5",
    "review": "It's a great vampire movie I love the tropes they used! I'm def not the demographic for the movie but it was really well shot and it was a fun watch! I had a greater appreciation learning about all the themes and nuance from people the film was made for. It is definitely worth a watch especially in theatres to experience the music!"
  },
  {
    "rating": "3.5/5",
    "review": "Vampires do not dance and sing. vampires do not ask for permission to walking a building."
  },
  {
    "rating": "5/5",
    "review": "One of the best, most beautiful films I've seen in a while!"
  },
  {
    "rating": "5/5",
    "review": "amazing fast moving loved it all"
  },
  {
    "rating": "5/5",
    "review": "The less you know going in the better, get comfortable and take your time leaving the theater if you know what I mean."
  },
  {
    "rating": "5/5",
    "review": "exceeded my expectations by far."
  },
  {
    "rating": "5/5",
    "review": "Probably the most fun Ive had watching a movie ever. Ryan Coogler is THAT GUY, bro is nice with it. But MBJ sells it with an unparalleled immersive dual performance"
  },
  {
    "rating": "5/5",
    "review": "The story was great! Acting was phenomenal and I enjoyed it tremendously!"
  }
]